{
    "app_id": 10,
    "name": "Counter-Strike",
    "release_date": "2000-11-01",
    "developer": [
        "Valve"
    ],
    "publisher": [
        "Valve"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "Local Multi-Player",
        "Valve Anti-Cheat enabled"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 124534,
    "negative_ratings": 3339,
    "price": 7.19,
    "description": "Play the world's number 1 online action game. Engage in an incredibly realistic brand of terrorist warfare in this wildly popular team-based game. Ally with teammates to complete strategic missions. Take out enemy sites. Rescue hostages. Your role affects your team's success. Your team's success affects your role.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/10/header.jpg?t=1528733245",
    "minimum_requirements": "500 mhz processor, 96mb ram, 16mb video card, Windows XP, Mouse, Keyboard, Internet Connection Recommended: 800 mhz processor, 128mb ram, 32mb+ video card, Windows XP, Mouse, Keyboard, Internet Connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "cant buy skins, cases, keys, stickers - gaben cant steal our money 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "I met a lot of people who slept with my mother. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Blame this game for the rise of the online multiplayer modern military shooter. Good game, great custom maps, terrible community. Not much has really changed since 2000, has it?  I don't think anyone still plays this particular version of CS though.  Edit: Wait, there are over 8,000 people in-game right now. Wow... guess I have to give this a 'yes' then because it isn't dead.",
            "review_score": "1"
        },
        {
            "review_text": "WE WONT FORGET 1.6",
            "review_score": "1"
        },
        {
            "review_text": "I only write this because of how nostalgic I feel. The game that gave me my passion for shooters. Hands down, in my opinion, best game made in history.  This game, I cannot explain how many emotions it gave me, and thousands or millions of other players.  Cs 1.6, please stay alive.   Pros- Everything Cons- Nothing",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike is a great series. Though the real change they made was in CS:GO, Counter-Strike has been one of my favorite FPS games of all time. If you prefer a fast based shooter, this game isn't for you.  Counter-Strike can have exciting moments where it's you VS 5 others, or where you have no defuse kit with only a few seconds left to defuse the bomb  A comparable version of Counter-Strike's defuse gametype is the Call Of Duty 'Search and Destroy'",
            "review_score": "1"
        },
        {
            "review_text": "This game will never get old &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Ah, this is where it all started from.. The mecca of online competitive scene.. I still remember bunking my extra classes, and play this game in a bunker of a gaming center, during my school days. I didnt think, that it would take root inside of me, that would fruit up, some years later.  Come the post graduation years, and I found myself playing this again, this time.. on a competitive level and making sure I had fun, the entire time I spent, whistling away at this ..  Fond old memories.. Still growing strong.. Still making more and more, as we keep walking through the life..",
            "review_score": "1"
        },
        {
            "review_text": "*Goes in-game *Sets server requirements *Joins a server *Empty *Joins another server *Cursed at in rapid Spanish *Asks for tips, says 'I play CS:GO' *Gets cursed at some more *Gets a kill *YOU HAVE BEEN KICKED FROM THIS SERVER*",
            "review_score": "1"
        },
        {
            "review_text": "This game appears to remain No. 1 FPS Action games since 2000 for around 8 to 11 years. It is a intense game as your health and your exposure is important as well sticking together with your team mates at all costs. You should maybe try this game and learn the routes in common CS maps like dust or assault. Go on try it!  However they are a several downsides to this game like the weapon nerfs like the recoils and smoke grenade failing to detonate airborne and the lame Tactical Shield. And cos this game is so popular that thousands of servers host this game online, that some PC criminals tend to take advantage on players like using hacking or server addon hacking materials. So you maybe best to stay clear of weird or dodgy servers with extreme adult material and Steam cannot unban victims who got hijacked and VAC banned, so please be careful!  But if you are old and wise enough to handle this intense action game...BUY IT, SOLDIER!",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░░▄▄  ░░░░░░░░░░░█░░█  ░░░░░░░░░░░█░░█  ░░░░░░░░░░█░░░█  ░░░░░░░░░█░░░░█  ███████▄▄█░░░░░██████▄  ▓▓▓▓▓▓█░░░░░░░░░░░░░░█  ▓▓▓▓▓▓█░░░░ Loved it ░░░░░█  ▓▓▓▓▓▓█░░░░ ░░░░█  ▓▓▓▓▓▓█░░░░ ░░░░░█  ▓▓▓▓▓▓█░░░░░░░░░░░░░░█  ▓▓▓▓▓▓█████░░░░░░░░░█  ██████▀░░░░▀▀██████▀",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS game of all time. It's a shame only a few people still play it. Great for older Counter Strike players and newer ones to experience what older players had with this game :) This is where Counter-Strike is love Counter-Strike is life really have a meaning.  After several thousand hours in the game I still love and cherish it. A must have for any FPS player out there.",
            "review_score": "1"
        },
        {
            "review_text": "While people are outside playing Pokemon GO I'm playing a real game.",
            "review_score": "1"
        },
        {
            "review_text": "I've never met so many Brazilians in my life! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is just amaizing. If you have a game with cheaters then change the server with admins that actualy do stuff right like cs.kopideja.lv  Yes The graphics are outdated and the physix may make no sense but this is what started it all... If you havent played this and you play other CS games then you know nothing about this game... Buy it play it and enjoy  For me this game is more fun than CS:GO or CS:S because its calssic and was a my favorite childhood game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Perfect for anybody who like shooter game. Just be careful when searching server though.",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike was the game that changed everything for me in FPS games, coming from older games like the FPS Game Blood back in (1997) when I was only 10 years old and Half-Life, Counter-Strike changed everything for me it was litterally the best thing ever.  The quality of the game was never about the visuals for me but about the game play and performance and Counter-Strike litterally had it all in my opinion.  Even today after so many years, I occasionally come back and play Counter-Strike just because it is one of the greatest Counter-Strike versions flat out, anyone disputing this are most likely people that started playing either Counter-Strike: Source or Counter-Strike: Global Offensive first then tried Counter-Strike but if you played it in the right order there is no disputing this, because this game might frighten most the new generation that has expectations to visual graphics having to have a certain standard before they will even touch it.  Counter-Strike is not about the visuals, that is just a bonus, if you want visuals then you probably playing the wrong game, Counter-Strike was never Battlefield nor CoD which probably to many looks visually stunning.  If you want quality in a game then Counter-Strike is one of the best games to play and get, hence why I am recommending this game.",
            "review_score": "1"
        },
        {
            "review_text": "The best competitive first person shooter ever created.",
            "review_score": "1"
        },
        {
            "review_text": "A game that is so much fun and nostalgic.  Brings back so many memories.   Always in my heart. &lt;3  10 / 10 - Still fun nowadays.",
            "review_score": "1"
        },
        {
            "review_text": "This game was so fun before css and csgo",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike 1.6 ruined many hours of my life!",
            "review_score": "1"
        },
        {
            "review_text": "=100,000 hours",
            "review_score": "1"
        },
        {
            "review_text": "1.6 is love, 1.6 is life",
            "review_score": "1"
        },
        {
            "review_text": "Thanks for a great childhood",
            "review_score": "1"
        },
        {
            "review_text": "-Love to shoot people with real life guns with different names? -Have you ever dreamed to kill terrorists and even be a terrorist? -Love playing the same, universal map over and over just because it's the only map you'll ever know? (*cough* dust2) -Have you a desire to work as a team to complete objectives? -Do you know how to speak Brazilian-Portuguese and Romanian? (Awesome because many servers have players that have Brazilians, Romanians, and many other South American/Eurpoean players) -Love nostalgia? -Love to have fun? -Love getting an extra game with bots in it for free?  -Love randomly dying from wallbangs?  Great, you've come to the right game. Seriously though, despite the somewhat smaller North American community (Which is still big for the old game it is) it's probably one of the greatest games i've ever come to play, and i've only had it for about a year, and i'm gonna add hundreds of thousands of hours playing this. I don't even have actual friends that play with me yet I can still have fun with this game. From the countless recoil patterns to remember from all the guns, to the extremely friendly community (for the most part) and playing all these classic maps. Yes, of course there's hackers, you'll see a few of them, but they don't ruin the game. Either the server's admin can just ban them or you can just go to a different server, it's not gamebreaking or anything. And besides, if you get this you also get Counter-Strike: Condition Zero, which has bots. Hell, you can even download Zbots for 1.6, and it waypoints for you! Definitely get this game. This game stands the test of time.  10/10 Would throw brick-looking grenades at terrorists again.",
            "review_score": "1"
        },
        {
            "review_text": "legend in FPS game. legend is still alive. This is CS 1.6 !!!",
            "review_score": "1"
        },
        {
            "review_text": "CS is fast paced, intense. this game will not disappoint. The 'just one more round' addiction factor is very high. I've been addicted since 2007. I don't have a ♥♥♥♥ing vision for what i am saying. I'm making this ♥♥♥♥ up as I go. Buy it, download it, whatever; just get on board and if you enjoy it you will NEED it!  Counter-Strike 4 life.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest game ever made, with Half Life in second. The father to competitive shooters. I'm happy to be back playing it",
            "review_score": "1"
        },
        {
            "review_text": "Play this game. It´s awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Best Esport game of 21th century .   Good :   -easy to play -no cheaters ( maybe 10% if you play on random pubs) , in CSGO 60% cheating. -best game for tournaments as 5x5 -not boring , you can play again and again to improve ur skill  Bad :  VALVE did not support number one online action/esport game before die  was a lot of bugs   9.7/10  Recommend!",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Greatest game ever.",
            "review_score": "1"
        },
        {
            "review_text": "The best of all.",
            "review_score": "1"
        },
        {
            "review_text": "Forever Retro! Current!",
            "review_score": "1"
        },
        {
            "review_text": "- After all this time?  - Always. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed so much playing this game :)",
            "review_score": "1"
        },
        {
            "review_text": "Recommend delete Counter-Strike:Source &amp; CS:GO !",
            "review_score": "1"
        },
        {
            "review_text": "No skins no updates good recoil control good servers less russians better servers old style :) I love it .",
            "review_score": "1"
        },
        {
            "review_text": "cs the best",
            "review_score": "1"
        },
        {
            "review_text": "Great FPS game, recommended! ",
            "review_score": "1"
        },
        {
            "review_text": "(RADIO): Fire in the hole! You got flashed and got stuck in the corner by a teammate (RADIO): Fire in the hole!,(RADIO): Fire in the hole!,(RADIO): Fire in the hole! And both die from a grenade gg nice game will rush again with him",
            "review_score": "1"
        },
        {
            "review_text": "it`s ok.:)(2k14) Edit:It`s ok?!That`s all i had to say then? Kinda unfair, given that this is the game of my childhood. Was i a normal grill who loved to spend her whole day with friends back then when it was still OK and actually encouraged to play outside? YUP. But was i also a little geek who couldn`t wait to get back home from school and viciously murder anyone in my path of winning the match?Hells to the yeaah. Note: Can you believe i`m in Medical school, after all of that?  Rainy day cs-playing is the best thing in the world, hands down. This game never gets old.If you haven`t played cs, you`ve lived for nothing. Peace!^^",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, hours of joy! Recommended",
            "review_score": "1"
        },
        {
            "review_text": "Best Game ever Old Its Gold :)",
            "review_score": "1"
        },
        {
            "review_text": "A game you can play forever:)",
            "review_score": "1"
        },
        {
            "review_text": "Best multiplayer game in all time!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥in awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Old school,lost half of my life on it.GG",
            "review_score": "1"
        },
        {
            "review_text": "1.6  ..name  is enough",
            "review_score": "1"
        },
        {
            "review_text": "Classics. If you never played - you MUST do it. THe third PC game I will propose to my children when they will be mature enough - after DOOM and Quake, of course",
            "review_score": "1"
        },
        {
            "review_text": "Old but Gold :)",
            "review_score": "1"
        },
        {
            "review_text": "Mind blowing graphics, better than 2034 source 3 engine physics too.",
            "review_score": "1"
        },
        {
            "review_text": "Best game 4ever, no game is gonna beat this",
            "review_score": "1"
        },
        {
            "review_text": "buy counter-strike 1,6",
            "review_score": "1"
        },
        {
            "review_text": "Classic is always Best &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Omg, This Game is 1st best games in 2009-2011. &lt;3 i will never stop playing,  NEVER    ",
            "review_score": "1"
        },
        {
            "review_text": "Game which dragged me in gaming, as outdated and old it is, the best memories for me lies within this game. I mainly played because of mods, which were great, like Zombie Mod, Death Run and WC3FT Mod",
            "review_score": "1"
        },
        {
            "review_text": "Seriously im playing this game because of kreedz mod and climbing other than that is ♥♥♥♥ but still cool tho",
            "review_score": "1"
        },
        {
            "review_text": "the best!",
            "review_score": "1"
        },
        {
            "review_text": "Great!",
            "review_score": "1"
        },
        {
            "review_text": "(-:",
            "review_score": "1"
        },
        {
            "review_text": "I don't have to talk much about this game... It's so perfect! I know people who have got about 4000 hours on this game :o and they are not bored yet:)",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Great!",
            "review_score": "1"
        },
        {
            "review_text": "The best Multiplayer FPS of all time.",
            "review_score": "1"
        },
        {
            "review_text": "A must have classic for every FPS player !",
            "review_score": "1"
        },
        {
            "review_text": "u don't have NoSpread lel, this game only for Legit.",
            "review_score": "1"
        },
        {
            "review_text": "Who didn't play this awesome game while growing up? Oh ya... me. And boy did I miss out!",
            "review_score": "1"
        },
        {
            "review_text": "Still a better love story than Twilight!!!",
            "review_score": "1"
        },
        {
            "review_text": "  is this mincraft 2.0",
            "review_score": "1"
        },
        {
            "review_text": "better than csgo =P",
            "review_score": "1"
        },
        {
            "review_text": "This game is so amazing and I hope it never get older!",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it !!",
            "review_score": "1"
        },
        {
            "review_text": "~|^Kn!gHtM@Re^|~ Auto-Mix Server 103.2.238.234:27015  All the cs fans are welcomed..!",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Yes i recommend this game :D",
            "review_score": "1"
        },
        {
            "review_text": "Ruined my life. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The BEST game",
            "review_score": "1"
        },
        {
            "review_text": "its super awesome ♥♥♥♥ yeah",
            "review_score": "1"
        },
        {
            "review_text": "all these years and still playing this, says how good the game is.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "nice game 'best game'",
            "review_score": "1"
        },
        {
            "review_text": "It was and still No. 1 online game &lt;333",
            "review_score": "1"
        },
        {
            "review_text": "Good The best game",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "The best multiplayer game ever. 3000 hours of happy and smile with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game... Lots of memories. Lot of spent time playing this game in childhood, still having nostalgic feelings. I still play this game sometimes and it still makes me happy. c:",
            "review_score": "1"
        },
        {
            "review_text": "A great game!!!",
            "review_score": "1"
        },
        {
            "review_text": ";)",
            "review_score": "1"
        },
        {
            "review_text": "Easy to learn. Hard to master.",
            "review_score": "1"
        },
        {
            "review_text": "This game changed gaming as a whole. One of the best FPS of all time, if not the best. But its all about the gameplay. Its how CS plays that will get you. Huge online community, thousands of mods, nostalgic graphics, excellent gameplay, nice sound effects even if they r outdated. CS 1.6 is my favorite FPS and is much better than Global Offensive in all aspects. I played this game so much before i got Steam, this game is just spetacular. Even in non-steam gaming, lan houses,competitive play, CS 1.6 is still incredibly popular. 10/10, congratulations to the developers.",
            "review_score": "1"
        },
        {
            "review_text": "The Best FPS :D",
            "review_score": "1"
        },
        {
            "review_text": "While starting to show its age, Counter-Strike is a classic that you just have to play!",
            "review_score": "1"
        },
        {
            "review_text": "1 Word 'Classic' :D",
            "review_score": "1"
        },
        {
            "review_text": "The most addictive thing , EVER!",
            "review_score": "1"
        },
        {
            "review_text": "brb gonna learn russian",
            "review_score": "1"
        },
        {
            "review_text": "Very cooool game :)!!!! I Llike This GAME :d",
            "review_score": "1"
        },
        {
            "review_text": "The greatest multiplayer shooter experience I've had since Quake 1. The e-sport scene also helped it alot, it's the only computer game I've really followed when it comes to e-sports (back when I followed the CPL etc). The design of the game was simple but very effective and delivered a multiplayer experience that few other games can match. The Call of Duty and Battlefield titles, although good in their own right, never drew me in like Counter-Strike.",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold !",
            "review_score": "1"
        },
        {
            "review_text": "After 16 years of existence, this legendary game is still in the Steam top 10 most played multiplayer games in the world. it's one of the best shouter games ever made !! you can't get bored of this one, trust me i have about 1.3k hours here on steam &amp; more than 2k on the non steam version =) but ppl left it to play 'modern games' like cs go &amp; battlefield &amp; COD .. what a shame !! there still some alive communities &amp; servers so don't be afraid ... but the sad thing is that there are many cheaters (you will get used to see them anyways, thank god there are many admins who can take care of them) i love this game so much but after all maybe this it's the right time to let it go. maybe one day i will comeback to find it alive again like the old days, maybe one day :) anyways, i totally recommend this game for everyone! don't be shy go buy it now if you didn't already do !' this is a must have one !'",
            "review_score": "1"
        },
        {
            "review_text": "Nice game :D",
            "review_score": "1"
        },
        {
            "review_text": "I always love returning to this classic game. Only love for this one &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "i7 4790k, GTX 970, 16GB RAM  PC too ♥♥♥♥♥♥, can't run this game  KarambitFullFade/10",
            "review_score": "1"
        },
        {
            "review_text": "Its the best game i have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "Old School Rules B-)",
            "review_score": "1"
        },
        {
            "review_text": "After years, it`s still very fun to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "The best porn game ;)",
            "review_score": "1"
        },
        {
            "review_text": "The year is 1987.........................................  ut's time to fight back",
            "review_score": "1"
        },
        {
            "review_text": "Counter Strike Is Best Game In The World:*",
            "review_score": "1"
        },
        {
            "review_text": "Old But Gold",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike was one of the first video games I have ever played and will always be up there in my list of favorite games.  I had just installed it. It was my first multiplayer game and I though I'm too new to play against players so I played only with bots slowly progressing from easy to to the hard ones. Then one day I joined a Dust II DM server. It was chaotic, but fun. I didn't even know the map then, but I learned it by playing lots of DM. I slowly climbed the integrated server ranks and made friends with one of the admins...then after a while the server disappeared.  After that I found out about deathrun. I was horrible at it, but the regulars helped me and I started visiting the server more and more. Apparently the same server chain had a gun game server too. Now that was amazing. Completely different people played there, but again friendly ones. After a couple of months the server chain was shut down...  I continued playing aim, awp, jailbreak and other mods. I didn't even play the classic mode, it wasn't of that big interest to me, though after a couple of months I stopped playing CS.  I can't not recommend this game, because I have so many memories from it. Nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Cool and classic.who love this oldschool game.you can try!",
            "review_score": "1"
        },
        {
            "review_text": "nice game old school",
            "review_score": "1"
        },
        {
            "review_text": "it's ok",
            "review_score": "1"
        },
        {
            "review_text": "1337",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold. :)",
            "review_score": "1"
        },
        {
            "review_text": "the best of the best cs 1.6 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "An old game but it keeps you in it :D",
            "review_score": "1"
        },
        {
            "review_text": "Classic Shooter, good",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold",
            "review_score": "1"
        },
        {
            "review_text": "I really recommend this for people who want to play an old school, simple shooter. A lot of user created modes automaticly downloading in server joining. Really fun even though its old.",
            "review_score": "1"
        },
        {
            "review_text": "best of the best &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Still the best.",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "The best Game",
            "review_score": "1"
        },
        {
            "review_text": "YES, long live counter strike 1.6 - the best game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Best of Counter Strike!",
            "review_score": "1"
        },
        {
            "review_text": "most awesome game ever.  i play it since betas in 1999.   keep on rockin'!",
            "review_score": "1"
        },
        {
            "review_text": "What a game !! owesome ",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever with the best gameplay.. :))))",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "The best game 4ever",
            "review_score": "1"
        },
        {
            "review_text": "Old School enough sayd!",
            "review_score": "1"
        },
        {
            "review_text": "Played better than most of russians then get banned from server.  10/10 would rek again more russians",
            "review_score": "1"
        },
        {
            "review_text": "Best.FPS.Ever. You may have noticed I have very little hours, that is because, as a young duck, I used to play this game 24/7 at cybercafes vs randoms who played it, basically a LAN there, brings tears to my eyes the experiences I shared with this game and the people at that 1 cybercafe :_(.",
            "review_score": "1"
        },
        {
            "review_text": "Everything at all !",
            "review_score": "1"
        },
        {
            "review_text": "Super legit game, bring 1.6 back, ♥♥♥♥ the rest!",
            "review_score": "1"
        },
        {
            "review_text": "the legend",
            "review_score": "1"
        },
        {
            "review_text": "cs 1.6 forever",
            "review_score": "1"
        },
        {
            "review_text": "Started at the very beginning to play counter strike at 1.3 and since then it was my favorite online FPS game. Played it very long and have to say since than it was and still is perfect. Sad but its old, and lost its support. Still coming back to remember everything. But now spending time on CS:GO.. If you have an older machine i recommend it to play, cause there are still many servers, and game mods active!",
            "review_score": "1"
        },
        {
            "review_text": "old school out of time ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Nice game...",
            "review_score": "1"
        },
        {
            "review_text": "I really like the game, but I couldn’t find the stupid cake.",
            "review_score": "1"
        },
        {
            "review_text": "Old School classic",
            "review_score": "1"
        },
        {
            "review_text": "The mother of all FPS's around. Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute classic fps still enjoyable after playing for 8 years",
            "review_score": "1"
        },
        {
            "review_text": "Game of my life",
            "review_score": "1"
        },
        {
            "review_text": "best game they ever made",
            "review_score": "1"
        },
        {
            "review_text": "The mother of all online FPS shooters.",
            "review_score": "1"
        },
        {
            "review_text": "I`m still playing it, cuz i like all mod on this :)",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game (y)",
            "review_score": "1"
        },
        {
            "review_text": "Remember back to old days :_)",
            "review_score": "1"
        },
        {
            "review_text": "Would hack again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is litarary AIDs",
            "review_score": "1"
        },
        {
            "review_text": "+++++++",
            "review_score": "1"
        },
        {
            "review_text": "Counter Strike: Source with carboard walls! Love the feeling when I get wallbanged from the other side of the map! Can be runned on a toaster! Thanks for the great childhood :) 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Classic Games are best games",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best multiplayer games to ever be made. This is still my favourite CS",
            "review_score": "1"
        },
        {
            "review_text": "The best game of all time counter strike 1.6 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "still the best counter-strike together with condition zero, good times :)",
            "review_score": "1"
        },
        {
            "review_text": "The best game i ever played! Most of my friends are addicted to this game and it's like a drugs,when you start to play,you can't stop :)",
            "review_score": "1"
        },
        {
            "review_text": "Really Addictive Game With Great Players",
            "review_score": "1"
        },
        {
            "review_text": "A classic which is still very much alive!",
            "review_score": "1"
        },
        {
            "review_text": "  I love this game a lot!",
            "review_score": "1"
        },
        {
            "review_text": "  bot bot bot！",
            "review_score": "1"
        },
        {
            "review_text": "Very good game and load´s of fun !!",
            "review_score": "1"
        },
        {
            "review_text": "the best.",
            "review_score": "1"
        },
        {
            "review_text": "easy",
            "review_score": "1"
        },
        {
            "review_text": "The Best : )",
            "review_score": "1"
        },
        {
            "review_text": "Where it all started...",
            "review_score": "1"
        },
        {
            "review_text": "The legend game :D",
            "review_score": "1"
        },
        {
            "review_text": "Simply still the best Counter-Strike ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Old days &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I love this game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "classic, thats all i can really say! its classic!",
            "review_score": "1"
        },
        {
            "review_text": "good game when want hev fun",
            "review_score": "1"
        },
        {
            "review_text": "FIRE IN THE HO- FIRE IN- FIRE IN TH- FIRE IN THE HOLE- FIRE IN- FIRE IN THE HOLE",
            "review_score": "1"
        },
        {
            "review_text": "The most popular and best Game. Simply love it. May there be a series of Games with better Graphics and Gameplay, but this will always be like the First Love &lt;3",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "good game i like it very much :))",
            "review_score": "1"
        },
        {
            "review_text": "Funny game,better than csgo. Bad at 1.6 but good at csgo :)",
            "review_score": "1"
        },
        {
            "review_text": "A classic and a must play.",
            "review_score": "1"
        },
        {
            "review_text": "This game proves you don't need best graphics",
            "review_score": "1"
        },
        {
            "review_text": "  Everyone in this game uses the AK-47 and uses aimbot....",
            "review_score": "1"
        },
        {
            "review_text": "Play this game for skill no need buy anything  No pay to win Use strategy and real game fps with recoil You have to understand and practice to make  Your self pro",
            "review_score": "1"
        },
        {
            "review_text": "i wanna add bots how's thaat ? ",
            "review_score": "1"
        },
        {
            "review_text": "i bought cs but i am dont have counter strike zero why ?",
            "review_score": "1"
        },
        {
            "review_text": "Counter-strike is an amazing game i have pretty much grown up playing this game it never gets old totally in love with the game , you can pick it up pretty cheap way worth the price for all the hours of fun you can have check it out !",
            "review_score": "1"
        },
        {
            "review_text": "The best ego-shooter ever",
            "review_score": "1"
        },
        {
            "review_text": "I just bought it recently in steam But I've been playing it since my childhood It was my first FPS Game  simply... THE BEST 10/10 &lt;3 XOXO",
            "review_score": "1"
        },
        {
            "review_text": "no russians to delete my last brain cells",
            "review_score": "1"
        },
        {
            "review_text": "Old is Gold",
            "review_score": "1"
        },
        {
            "review_text": "Been over 15 years and it's still alive. Never tired of playing it. Original gameplay has been great already and now with mods created by players. CS never dies, it respawns.",
            "review_score": "1"
        },
        {
            "review_text": "CUKAM",
            "review_score": "1"
        },
        {
            "review_text": "My life &lt; Counter Strike 1.6. Bought this game a bit too late... wish I would've been around to play it back in it's prime.",
            "review_score": "1"
        },
        {
            "review_text": "A classic is a classic. Long live 1.6.",
            "review_score": "1"
        },
        {
            "review_text": "The first game that I played!!!Thanks Valve!",
            "review_score": "1"
        },
        {
            "review_text": "Got VAC banned for using hacks on an empty server, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "1k hours . . . .  the game is bad but give it a try",
            "review_score": "1"
        },
        {
            "review_text": "Good old calssic cs",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Childhood game. The best!",
            "review_score": "1"
        },
        {
            "review_text": "wh  vac soon",
            "review_score": "1"
        },
        {
            "review_text": "Really worth buying it if you have some friends to play it with. Doesn't matter how many years have passed, you can always put togheter your old buddies to play some Counter Strike 1.6",
            "review_score": "1"
        },
        {
            "review_text": "the best game forever.",
            "review_score": "1"
        },
        {
            "review_text": "Best of ...",
            "review_score": "1"
        },
        {
            "review_text": "The best game!",
            "review_score": "1"
        },
        {
            "review_text": "Fully Interesting game Every one must play",
            "review_score": "1"
        },
        {
            "review_text": "Try it out, you wont regret ;)",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike? It's very nice game, but why u put that all updates ?! ",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "Best game of world &lt;3 ",
            "review_score": "1"
        },
        {
            "review_text": "Try this game",
            "review_score": "1"
        },
        {
            "review_text": "A game that can always be played",
            "review_score": "1"
        },
        {
            "review_text": "One of the best cs games ever !!!! cant get enough of it  1.6 ftw",
            "review_score": "1"
        },
        {
            "review_text": "its a cool game i never liked so mutch anithing else like cs 1.6 fast moves fast aim like the recoil like evrything neat game",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game that improves your fluency in the foreign languages. Every server you visit has the charming alure of Mexicans and Brazillians; an honorable bunch of players who praise your skills with phrases such as 'filho da ♥♥♥♥!!!!!!', 'xiter!!!' and 'jajajajaja'. They are also very skilled players ingame; I often see a single player moving at the speed of sound, headshotting everyone in a blink of an eye, and getting all the praise from his fellow brethren, usually in the form of 'xiter fdp!!!'. Overall, I recommend this game to all individuals seeking to have a fun, non-hacker, non-english gameplay experience.",
            "review_score": "1"
        },
        {
            "review_text": "cs 1.6 back geek time! :)",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games i have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "Dat cyber-cafe memories.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "play this game",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful game, i am so glad i got to play it :X it chaged my life. OMG OMG",
            "review_score": "1"
        },
        {
            "review_text": "Probably my favorite fps of all time, been playing since the m4 had a scope.",
            "review_score": "1"
        },
        {
            "review_text": "best game ever with loads of competition",
            "review_score": "1"
        },
        {
            "review_text": "Addicted :| !",
            "review_score": "1"
        },
        {
            "review_text": "This has always been my favorite and a classic to my collection. No matter what, I will always have this game.",
            "review_score": "1"
        },
        {
            "review_text": "must-have-played-classic-genredefining-game",
            "review_score": "1"
        },
        {
            "review_text": "Really really nice game to play with friends =)",
            "review_score": "1"
        },
        {
            "review_text": "The best shooter,period.No game will ever come close to this one.Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Over a decade and still has thousands playing it!",
            "review_score": "1"
        },
        {
            "review_text": "The most repetitive and yet the most addictive game I ever played. It's a must have! :)",
            "review_score": "1"
        },
        {
            "review_text": "Great job!",
            "review_score": "1"
        },
        {
            "review_text": "Revolutionary new game for 2012, better graphics than CoD",
            "review_score": "1"
        },
        {
            "review_text": "The most favourite game of mine :D",
            "review_score": "1"
        },
        {
            "review_text": "Truely a game which signifies the value of 'Old is Gold'.... This shows that 'Graphics doesn't matter but Gameplay does'.... The Parent of First Person Shooting Multiplayer... Even though it's been more than a decade since its release but It's still one of the most favoured online games in the world. A must play for any die-hard First Person Shooter lover.",
            "review_score": "1"
        },
        {
            "review_text": "Love everything about this game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "loved this game for years!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever :O! Finished it in liek 5mins tho",
            "review_score": "1"
        },
        {
            "review_text": ":))",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Simply best fps ever.",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike destroyed my life. I had been playing HL deathmatch, and was waiting for team fortress 2 (some of those early TF2 screens are still etched in my brain) I came across a new mod called Counter-Strike, it had just been released, Beta 1 there were only 3 maps I think and the player models were so similar that in the darkend corridors of Mansion you couldn't see who was what, so there was team killing galore, even a console command for extra money, but it was awesome, I'd never played anything like it. So I played it. ALLOT. I'd come in from college stick it on and play untill I was ready for bed, screw school work I had people to shoot in the face! Anyway I failed my A-levels and got stuck with crappy jobs, but looking back, it could possibly have been worth it, because damn I had fun! I don't know what its like nowadays, I did get fed up with the bunnyhopping AWP gits and from what I gather that is the way the game went, but this was it, where it started for me, and if you haven't played it once then you should just so you know where all your call of duty and all that balls came from.",
            "review_score": "1"
        },
        {
            "review_text": "legendary game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome oldschool game.",
            "review_score": "1"
        },
        {
            "review_text": "=)",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever!!! :)",
            "review_score": "1"
        },
        {
            "review_text": "This is surely thes best and funny game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Get the best and forget the rest, don't waste your money on CS:GO stick with the original!",
            "review_score": "1"
        },
        {
            "review_text": ";)",
            "review_score": "1"
        },
        {
            "review_text": "2600hs in steam 10years in nosteam  the best game",
            "review_score": "1"
        },
        {
            "review_text": "The best FPS's of all time for its time and still and a great alive community.",
            "review_score": "1"
        },
        {
            "review_text": "^^",
            "review_score": "1"
        },
        {
            "review_text": "This game have a nice place in my heart, 10/10 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "It's old, but still verry popular.",
            "review_score": "1"
        },
        {
            "review_text": "OLD and GOOOD",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "I miss Pokemod season 1 &amp; 2.",
            "review_score": "1"
        },
        {
            "review_text": "God Games :D",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite game :)",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "ThabeToX,ExE GH0$T-R1D3R Those my name",
            "review_score": "1"
        },
        {
            "review_text": "@@",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best damn game ever made!",
            "review_score": "1"
        },
        {
            "review_text": "This is not just a game, its not like the others where you 'run and gun', not only a kill and win game, this game is love, it is life.",
            "review_score": "1"
        },
        {
            "review_text": "The best of times and now it has passed 10/10 for years of gaming.",
            "review_score": "1"
        },
        {
            "review_text": "One and only CS-game out there",
            "review_score": "1"
        },
        {
            "review_text": "I play this game since I was like 14 years old . Teamwork game in most of the times .  Solo game if you are pro . ",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "One of the best multiplayer games out there.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would headshot you in the face again",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game",
            "review_score": "1"
        },
        {
            "review_text": "The first Counter Strike in the franchise and the community is still there and there are plenty of people who still play it and they are not toxic at all.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game! :D",
            "review_score": "1"
        },
        {
            "review_text": "Can play hours on the game. There are better alternatives but for low graphics this is a good game :D :P",
            "review_score": "1"
        },
        {
            "review_text": "easy game for relaxation",
            "review_score": "1"
        },
        {
            "review_text": "Very nic game! ",
            "review_score": "1"
        },
        {
            "review_text": "~!!!",
            "review_score": "1"
        },
        {
            "review_text": "  Best game for all time!!",
            "review_score": "1"
        },
        {
            "review_text": "The best game :)",
            "review_score": "1"
        },
        {
            "review_text": "Good game but CSGO is better imo",
            "review_score": "1"
        },
        {
            "review_text": "One wordd to describe this game:CHILDHOOD.",
            "review_score": "1"
        },
        {
            "review_text": "EPIC and LEGENDARY game",
            "review_score": "1"
        },
        {
            "review_text": "classic counter-strike",
            "review_score": "1"
        },
        {
            "review_text": "Nice game!",
            "review_score": "1"
        },
        {
            "review_text": "When you just want to shoot people in the face and rage because they shot you in the face, play this.",
            "review_score": "1"
        },
        {
            "review_text": "Hell yeaah :) I love this game :) You all should get this :P It is one of mah favourite games in da whole wide world :3",
            "review_score": "1"
        },
        {
            "review_text": "Great game, would recommend to anyone who has played any of the other Counter:Strike franchise, or anyone who is interested in FPS games!",
            "review_score": "1"
        },
        {
            "review_text": "  &lt;3 love it *__*",
            "review_score": "1"
        },
        {
            "review_text": "cs 1.6 forever",
            "review_score": "1"
        },
        {
            "review_text": "Almost 3000h played, still paying!  Best ♥♥♥♥ing game ever, ♥♥♥♥ go :)",
            "review_score": "1"
        },
        {
            "review_text": " This game is classic!I started playing since 2005 and im still playing it!The main reason there is no '♥♥♥♥♥♥♥♥ блят''иди ♥♥♥♥♥♥♥♥♥♥'and others russian stuff.I only thanked Cs:go that helped me to learn native Russian!",
            "review_score": "1"
        },
        {
            "review_text": "Oldsql game but still needs upadate",
            "review_score": "1"
        },
        {
            "review_text": "No R8 11/10",
            "review_score": "1"
        },
        {
            "review_text": "IS the best game ever!",
            "review_score": "1"
        },
        {
            "review_text": "Its old but great game for multiplayers......",
            "review_score": "1"
        },
        {
            "review_text": "A classic.",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike is beutiful game when i play with my friend's and i get more new friend's",
            "review_score": "1"
        },
        {
            "review_text": "best fps game :D that can run on any laptop or pc XD",
            "review_score": "1"
        },
        {
            "review_text": "Better than csgo, has usualy 10-20k players. Buy it!:)",
            "review_score": "1"
        },
        {
            "review_text": "A great game to play, if you are used to CS:GO this game will have a massive learning curve to it. The style CS 1.6 has developed is very different than from what CS:GO needs.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best First Person Shooters on the planet still to this date!",
            "review_score": "1"
        },
        {
            "review_text": "Yes , worth it !",
            "review_score": "1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "cs 1.6 is love, cs 1.6 is life",
            "review_score": "1"
        },
        {
            "review_text": "Good Game, Appear Is The Best.",
            "review_score": "1"
        },
        {
            "review_text": "counter strike 1.6 !",
            "review_score": "1"
        },
        {
            "review_text": "All time classics, cs-go newschoolers ;)",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike 1.6? Classy. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "classic game.",
            "review_score": "1"
        },
        {
            "review_text": "$1000+ for my new comp and all i play is CS 1.6",
            "review_score": "1"
        },
        {
            "review_text": "i love this game buti have a problem every time i try to run it it stops woring and it says half life has stoped working plz help",
            "review_score": "1"
        },
        {
            "review_text": "Best of the Best  Master of all FPS games",
            "review_score": "1"
        },
        {
            "review_text": "This game has shields O.O",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever... fact",
            "review_score": "1"
        },
        {
            "review_text": "haven't played it enough to make a good review but it is an alright game from what i've experienced",
            "review_score": "1"
        },
        {
            "review_text": "One of the best FPS ever. :X",
            "review_score": "1"
        },
        {
            "review_text": "The next best version of Counter-Strike after the now defunct CS 1.5.",
            "review_score": "1"
        },
        {
            "review_text": "The original Counter-Strike. The one who gave life to both CS:S and CS:GO. I first played this game when i was 7 (over 10 years ago) and i never forget how difficult it was for me to kill an enemy. However, this is great game and game that certainly belongs in the 'Top 10 Games of All Time'.",
            "review_score": "1"
        },
        {
            "review_text": "A cheap and simple FPS shooter. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "BEST CS EVA",
            "review_score": "1"
        },
        {
            "review_text": "Cant beat a Classic... unless you just kill it with a bunch of bot servers. Still the king of the online fps.  For the record CS1.4 on the WON ID system (Way before SteamId's) was the best version.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. First FPS I ever got good at and still to this day I can load it up and have fun playing this game. This game has a lot of history behind it and it probably the foundation for a lot of the new FPS most notably CoD(Call of Duty). Thanks to this game I learned how to play an FPS properly and will alway enjoy playing this game no matter how old it is!",
            "review_score": "1"
        },
        {
            "review_text": "VERy GOOD GAME !",
            "review_score": "1"
        },
        {
            "review_text": "Still the best Counter Strike ever created to this day.",
            "review_score": "1"
        },
        {
            "review_text": "This game never gets old. The only thing you can improve is your skill 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "  8700 hours :D",
            "review_score": "1"
        },
        {
            "review_text": "Great FPS game :)",
            "review_score": "1"
        },
        {
            "review_text": "The real version of Counter-Strike classic..... played like crazy during my childhood.....",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is old-fashioned and fun. The community is casual, immersive and usually lacking the children. It's everything you want from a game you play in your spare time.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended",
            "review_score": "1"
        },
        {
            "review_text": "Best game, my first fps game :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun. It have got bad graphic but that is ok . I recommend It.",
            "review_score": "1"
        },
        {
            "review_text": "very good game trust me i been in this business for years.",
            "review_score": "1"
        },
        {
            "review_text": "Just recently started playing this game. But so far it is so much fun, have not played it with friends yet but when I do it will be 10 more times the fun.",
            "review_score": "1"
        },
        {
            "review_text": "The best game valve made after Cs:Go but the updates made the game very poor :( wish it could be like in the past",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS of all time.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": " It all started here.   I could also say ' I born here '.  What can I say, just the best game I've ever played!",
            "review_score": "1"
        },
        {
            "review_text": "I play this game for fun. My 1st favorite game on steam! Oldschool fun boy :) ^^",
            "review_score": "1"
        },
        {
            "review_text": "Just the best game ever, im glad i spended thousand and thousand of hours playing this game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Lol the best game",
            "review_score": "1"
        },
        {
            "review_text": "best tho :^D",
            "review_score": "1"
        },
        {
            "review_text": "old is gold ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Best multyplayer shooter",
            "review_score": "1"
        },
        {
            "review_text": "my first game",
            "review_score": "1"
        },
        {
            "review_text": "Invaded by ethnicities with bad computers and awful ideas with their server management, it is now impossible as of today to get a decent match without paying for ESEA, even in PUG servers.  Not being racist, this is what actually happened. Surf servers and Fun servers finally died around 2011, whilst vanilla servers that ain't running dust 2 all day long died before Steam even came out, and all that's left is a bunch of latino-controlled servers with ♥♥♥♥-awful maps and enough plugins to give you a seizure and a thousand hats.",
            "review_score": "1"
        },
        {
            "review_text": "cheated",
            "review_score": "1"
        },
        {
            "review_text": "still the best game ever",
            "review_score": "1"
        },
        {
            "review_text": "Pilica wj only",
            "review_score": "1"
        },
        {
            "review_text": "Ahhh! The original masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "''Fire in the hole!'' (Bring back sprays)",
            "review_score": "1"
        },
        {
            "review_text": "I would like to say that it is Awesome &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "'Old but gold' and the beginning of a legendary game franchise. From a time were Counter-Strike was about shooting and not about making money, skins and gambling.  Metacritic: 88 / 100 Metascore 9.3 / 10 User Score",
            "review_score": "1"
        },
        {
            "review_text": "My fav childhood game! I love it! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game (CS anthology bundle) back in 06 from a gaming store in Lamington road and it has been fun playing this every now and then whenever there are good public servers for this game. This game introduced me to STEAM platform as it was a very popular mod of Half-Life. It has been worth every penny to buy this game and I still play it more than I play CSGO.  I get reasonable pings (&lt;50) and I am on MTNL in Mumbai.  If you are newbie lookin to buy I'd recommend you buy the Valve's complete pack during a major sale.",
            "review_score": "1"
        },
        {
            "review_text": "So ez to ace hs w/ deag",
            "review_score": "1"
        },
        {
            "review_text": "great purchase and great experience! and yes, its awesome!",
            "review_score": "1"
        },
        {
            "review_text": "i have one thing to say ' THE LEGEND Was Born yet never Died and so on his Dynasty willl continue '",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS of all time",
            "review_score": "1"
        },
        {
            "review_text": "No FPS will ever beat this one . Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "I like this game",
            "review_score": "1"
        },
        {
            "review_text": "  Hey There Counter-Strike 1.6 Is The Best ♥♥♥♥ the REST",
            "review_score": "1"
        },
        {
            "review_text": "Nice game :)",
            "review_score": "1"
        },
        {
            "review_text": "Classic, the fundamental game of all these days shooters",
            "review_score": "1"
        },
        {
            "review_text": " PROS:  + great gameplay + big active community + great choice of weapons + huge amount of mods + lots of community created maps, weapons, AI, soundtracks, etc.   CONS:  - rare issues with graphic cards (especially for laptops) - has replacement in form of newer CS games   Comment:  What is there to introduce? This is a FPS game that most gamers know and the ones that don't should. The laughable half an hour I have displayed here was just testing out the newly bought game. In reality I have played many many many hours with my friends. I played it in high school. I played it in college. I played it with friends after work. While the graphics may be old and this game replaced by its' younger sibblings it still holds out the test of time. While I am no longer able to get my friends together and play this , this game will always be a fond memory for me. And who knows maybe I will pick it up some day again. What I can do is recommend this game to anyone who has not played it or people who are thinking about pruchasing this digital copy. The basic concept of terrorists vs. counter-terrorists is really fun and with the modding community the amount of variation is almost limitless. So grab it if you can, it is very much worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This is my childhood game :) thanks Counter Strike's developers for developing this such a great game!",
            "review_score": "1"
        },
        {
            "review_text": "  Very fantastic game Very fantastic game",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. All computers can open, but you will have skills and play so much time this game. Soooooooooooo I can't say anything. :) This game is all times mutiplayer!!! :D",
            "review_score": "1"
        },
        {
            "review_text": "Still the best fps",
            "review_score": "1"
        },
        {
            "review_text": "'Test of Time' award was made for this game imo...",
            "review_score": "1"
        },
        {
            "review_text": "It's OK.",
            "review_score": "1"
        },
        {
            "review_text": "An overwhelmingly great shooter. This game takes skill and tactics, and lots of teamwork. The community isnt perfect though. There are lots of dumb trashtalking players and people that whine whenever they die. If you can ignore that, then you will have an amazing experience.",
            "review_score": "1"
        },
        {
            "review_text": "Have a PC that you bought in the 1990s? Want the discount global offensive experience without the crate opening bullsh*t? Do you want to play a true first person shooter? Are you looking to impress your crush with shooting skills although you don't have any? Do you want to appear like a whiny edgy ♥♥♥♥♥♥ in front of your parents while giving your friends lessons on when to rush A or B?  This is the game you play.",
            "review_score": "1"
        },
        {
            "review_text": "Oldschool game, but it's fun.",
            "review_score": "1"
        },
        {
            "review_text": "remember ! if u shot to wall on de_nuke or whatever map, u will get double kill or annother lol kill on annother map xD fkin hilarious &amp; bay for noaimed pro players, this can be callled start ramp to csgo. Coz u dont need aim there &amp; csgo also.",
            "review_score": "1"
        },
        {
            "review_text": "this is a goood game and he is my favorite game",
            "review_score": "1"
        },
        {
            "review_text": "Never forgotten classic",
            "review_score": "1"
        },
        {
            "review_text": "Am I really writing a recommendation for this game?  Counter-Strike  or CS 1.6  is a classic game which started off as a Half-Life 1 mod way back in late 1999, and was later sold in 2000 which required both Half-Life 1 and the game itself. Where as now, you only need the game itself on Steam.   Counter-Strike was one of the biggest multiplayer FPS games ever made, due to it being playable on many computers, and just an overall really fun game. It has no doubt made a huge impact on the world of FPS. Especially in the competitive scene such as e-sports where 1.6 is still being played today.  However, it has aged. A lot. Especially in comparison to Counter-Strike: Source. So a lot of maps are quite spacious and don't look as realistic as many would expect to todays standards.   I actually prefer CS:S over this game as I just like the feel of it more.  I honestly don't know why I'm reviewing this game, as I'm sure everyone on my friends list here has played it. But just incase you're that one odd person out that for osme reason hasn't played it - try it out, and see whether you like it or not. ",
            "review_score": "1"
        },
        {
            "review_text": "it's like CS:GO....but losing isn't even that bad in this one. which makes it better. no ranks which is also nice",
            "review_score": "1"
        },
        {
            "review_text": "!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "I buy the AWP and I win.  I recommend this game whole heartedly.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "better than cs:go",
            "review_score": "1"
        },
        {
            "review_text": "it's older than the people who play cs go.",
            "review_score": "1"
        },
        {
            "review_text": "BEST shooter of my childhood  ( Junior High School )",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold :)",
            "review_score": "1"
        },
        {
            "review_text": "An iconic game, perhaps the best game of all time, please buy it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Old School is always the best.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game but i got some kinda grapical bug and i need very much help and i can't see my grapical settings just cuz somthing makes me see a little bit of the menu screen would like some help :D",
            "review_score": "1"
        },
        {
            "review_text": "Very Cool game",
            "review_score": "1"
        },
        {
            "review_text": "The oldest game I have, and its great. I played a bit of it recently, and the maps have certainly changed (since I went looking for maps om used to in CS:GO, which are Inferno and Dust II). So I do recommend this game, but if you want better, get either CS:GO, OR the CS Complete Pack.",
            "review_score": "1"
        },
        {
            "review_text": "full skills this game ;D",
            "review_score": "1"
        },
        {
            "review_text": "the king is here",
            "review_score": "1"
        },
        {
            "review_text": "If you didn't play this but play CS:GO, you probably like to pretend you did.",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever",
            "review_score": "1"
        },
        {
            "review_text": ":)))))))))))",
            "review_score": "1"
        },
        {
            "review_text": "Still Better then CoD",
            "review_score": "1"
        },
        {
            "review_text": "i love this game",
            "review_score": "1"
        },
        {
            "review_text": "MINIMUM: 500 mhz processor, 96mb ram, 16mb video card, Windows XP, Mouse, Keyboard, Internet Connection i dont even have a video card what blasphemy is this 11/10 everyone is better than me",
            "review_score": "1"
        },
        {
            "review_text": "MINIMUM: 500 mhz processor, 96mb ram, 16mb video card, Windows XP, Mouse, Keyboard, Internet Connection i dont even have a video card what blasphemy is this 11/10 everyone is better than me",
            "review_score": "1"
        },
        {
            "review_text": "OMG YES!!! This is the real cs not like CS:GO wich was ruined by valvE. This is still 100000% no mod game at starting and you decide if you want mods. If you want to try Counter Strike YOU HAVE TO buy this game at first!",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST GAME EVER!!!",
            "review_score": "1"
        },
        {
            "review_text": "Ruined my life. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "  Still better than CS:GO.",
            "review_score": "1"
        },
        {
            "review_text": "Cs my Life Kreedz my wife",
            "review_score": "1"
        },
        {
            "review_text": "The best",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "The mother of FPSs!? CSGO is better now imo tho. But loads of great memories! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever, really atmospheric and fun game, but i have to say its dead now and cs:go is a way better nowadays ;)",
            "review_score": "1"
        },
        {
            "review_text": "Get flashed by teammate simulator 2016",
            "review_score": "1"
        },
        {
            "review_text": "7.5/10 not enough ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": ":^)",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "best addicting game.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "you simply can't hate this game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This one of my bests game, the game is so good. You have differents modes of game like a Zombies, Capture the flag, etc.  I recommend this game?: Yes but not to low graphics computers, the game looks like a poop in software mode.",
            "review_score": "1"
        },
        {
            "review_text": "Classic :P",
            "review_score": "1"
        },
        {
            "review_text": "This game just means a lot to me. It's the start of the counter-strike we know today.. my entire chiledhood it's bond to this game.. and yet i still play it today.. love cs 1.6",
            "review_score": "1"
        },
        {
            "review_text": "Legendary FPS Game!",
            "review_score": "1"
        },
        {
            "review_text": "game is playable",
            "review_score": "1"
        },
        {
            "review_text": "Its Counter-Strike, why wouldn't you buy it?",
            "review_score": "1"
        },
        {
            "review_text": "CS IS LOVE &lt;3 CS IS HALF LIFE &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "the second pc game i ever played",
            "review_score": "1"
        },
        {
            "review_text": "It looks like cancer,but its actualy AIDS.",
            "review_score": "1"
        },
        {
            "review_text": "No reason to play this since Source exists (unless you have a pc from the 1999 with a pentium 2 proccesor),but still good game.",
            "review_score": "1"
        },
        {
            "review_text": "Well-known game physics and graphics. Based on famous Half-life 1998, not hardware damanding, Linux and Legacy Windows friendly (even Win98). Very consecutive like a chess or math, great game for competitions! Best FPS shooter IMO.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I Love Awp &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A classic, still among the most played game in existence.",
            "review_score": "1"
        },
        {
            "review_text": "perfect MP gaming since 2000",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "Best Movement and Gameplay ever made.",
            "review_score": "1"
        },
        {
            "review_text": "The best game all of the time!",
            "review_score": "1"
        },
        {
            "review_text": "Best fps game ever (better than CS:GO)",
            "review_score": "1"
        },
        {
            "review_text": "got yelled at in spanish by a fat mexican guy and then proceeded to tell ♥♥♥♥♥♥ knock knock jokes on mic and rouse a crowd of at least 20 spanish-speakers who understood at maximum 3 words in each joke but still laughed hysterically 10/10 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "Classic Counter Strike &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This is a GOOD VIDEO GAME dont get me wrong its good but not greatest graficks. But stil buy it if you are a VALVe FAN!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever",
            "review_score": "1"
        },
        {
            "review_text": "The one",
            "review_score": "1"
        },
        {
            "review_text": "It's a classic.",
            "review_score": "1"
        },
        {
            "review_text": "For the people that believed that Counter-Strike Global Offensive was too easy, I present to you this title.",
            "review_score": "1"
        },
        {
            "review_text": "I'm playing in this game since 2000! (CS Beta 7.1) It's my 1st favorite game!",
            "review_score": "1"
        },
        {
            "review_text": "the most awesome classic game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A wise man once told me 'Maybe you should load up some Counter-Strike 1.6 and ♥♥♥♥ around on some pub servers for a bit.'. And that was what I did. And it was good.  Then I entered a server with a bunch of ♥♥♥♥♥♥ plebs. Sometimes there would be a player or two that could challenge me and we'd have fun little fights. We'd make jokes back and forth with the radio but when I started asking for nude ♥♥♥ pics (no homo), the dude didn't respond ;_; . Two hours later, I noticed a player wouldn't stop trying to jump on a single ledge. Failing, he would back up and then try again and again and again without end and never shot back. I just sat there are watched him. That was when I realized the entire server was just bots and my conversations were with the rare amount of human players. Didn't know what to think. ",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, would recomend [ better than csgo ] 10 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Addictive :)",
            "review_score": "1"
        },
        {
            "review_text": "I Playing this game so long its best game in my opionion, but counter strike global offencive is our time counter strike is still nice :)",
            "review_score": "1"
        },
        {
            "review_text": "Unlike CS:GO, with getting expensive knives and later after you finally figure out how to use it you get shot by a noob. This game offer's true Russian Language Speaking Lessons, I have now learned fluent Russian and somehow learned German along the way. It works like a true Russian Language Speaking (and German) simulator should,   8/8 m8.",
            "review_score": "1"
        },
        {
            "review_text": "he keep me alive. is the best game ever",
            "review_score": "1"
        },
        {
            "review_text": "  Love This Game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "  Love This Game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "The reason why you should be using Steam in the first place.",
            "review_score": "1"
        },
        {
            "review_text": "The most popular online game :)",
            "review_score": "1"
        },
        {
            "review_text": "+ Good price + Good models + Fun + Good game for shity PC  - Toxic community zzz",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS out there, no doubt. With so many different mods, maps and time it takes to get bored with this game, I just can't think of a better FPS game. Best of all, it's all fun usually - except when you get kicked from a lithuanian/polish server for speaking english or asking to ban a wallhacker.  9/10  ...because server list is so big and many of the servers are full of bots, only serving purpose to redirect players to join someone elses server. It can be hard to find a real server.",
            "review_score": "1"
        },
        {
            "review_text": "This came out 14 years ago, and it still has better graphics than your average Call of Duty game.",
            "review_score": "1"
        },
        {
            "review_text": "2 addictive!!!!!! *_^",
            "review_score": "1"
        },
        {
            "review_text": "This game is a an amazing game and at the beggining your going to suck hard but you get good at this game and iti really fun",
            "review_score": "1"
        },
        {
            "review_text": "1 of d best games ever released :D",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game,it is fantastic :)",
            "review_score": "1"
        },
        {
            "review_text": "Sometime puke makes you excited",
            "review_score": "1"
        },
        {
            "review_text": "Great Game.",
            "review_score": "1"
        },
        {
            "review_text": "After not playing this game for almost a decade, honestly can say it is just as fun!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, It's a classic and the only reason I use steam in the first place. If you're a fan of the series pick this up now.",
            "review_score": "1"
        },
        {
            "review_text": "1",
            "review_score": "1"
        },
        {
            "review_text": "Old good thing. Enough said!",
            "review_score": "1"
        },
        {
            "review_text": "Game for all times :D",
            "review_score": "1"
        },
        {
            "review_text": "What an amazing game! I would recommend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "good game but i cant play with bots :(",
            "review_score": "1"
        },
        {
            "review_text": "I may not be good at this game but I consider this the perfect FPS.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really cool, it's one of the best Counter-Strikes, recommend playing this game! Its a fantastic game !!",
            "review_score": "1"
        },
        {
            "review_text": "Is very good game, i play it for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "This is the beggining of what we call 'modern FPS'. This game is pure skill. If u are a CoD 'aim down the sight' fanboy, don't try it, you're wasting your time. This game is for skilled players only. No aim. No help. Just your and your target.",
            "review_score": "1"
        },
        {
            "review_text": "yoyo best game ever",
            "review_score": "1"
        },
        {
            "review_text": "This old cs. Also like to play some times",
            "review_score": "1"
        },
        {
            "review_text": "Decent game with low price!",
            "review_score": "1"
        },
        {
            "review_text": "Just great",
            "review_score": "1"
        },
        {
            "review_text": "Great game, been playing since '04. All the community servers are trash, though.",
            "review_score": "1"
        },
        {
            "review_text": "  Guys, help me, i can't uninstall it, it's so hard to unins, i'm so confused",
            "review_score": "1"
        },
        {
            "review_text": "like cs:go, but worse graphics",
            "review_score": "1"
        },
        {
            "review_text": "+rep me please",
            "review_score": "1"
        },
        {
            "review_text": "  ....",
            "review_score": "1"
        },
        {
            "review_text": "even my mom plays this game",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "Where has the time gone wish people still played this game like they always had .",
            "review_score": "1"
        },
        {
            "review_text": "As i got PC... I dont remember any other game that was so easy to just 'click &amp; play' :)",
            "review_score": "1"
        },
        {
            "review_text": "Very good classic Counter Strike. Much better then CS:GO!",
            "review_score": "1"
        },
        {
            "review_text": "This MMORPG is off the chain! The story line is really intriguing and the in-game NPCs are just a delight! 2 thumbs WAY up ur butt",
            "review_score": "1"
        },
        {
            "review_text": "My precious ;P",
            "review_score": "1"
        },
        {
            "review_text": "Since 8 years ago this game stays no. 1",
            "review_score": "1"
        },
        {
            "review_text": "Ruined my life, 5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. That was the first game where i was start and i love it forever &lt;3",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "why i cant config video. Now more large.",
            "review_score": "1"
        },
        {
            "review_text": "CS FOREVER :)",
            "review_score": "1"
        },
        {
            "review_text": "The Best Multiplayer game ever!",
            "review_score": "1"
        },
        {
            "review_text": "the best",
            "review_score": "1"
        },
        {
            "review_text": "Im still doing my config.",
            "review_score": "1"
        },
        {
            "review_text": "Despite my hilariously low count of, 0.6 hours, on record, I can attest to you that, nay, I have played this game(and it's 'sequels') to the ends of time. I've literally sunk close to 15,000 hours into the various derivations of CS over the years.  I found out about CS from some #IRC chat I used to frequent back in the day(it might have been an ICQ chat with one of them). Namely, I started with the first ALPHA(yea, not beta, ALPHA). I can recall the loading screen and everything. From there, I progressed through the initial betas, introduction of maps, and various weapons(anyone remember the OLD cs_siege, complete with working apc and sniper tower?), etc.  I then became a player in various 'leagues'; I won't name drop, but I was a baller at one time.  So, yes, this game is good. Some people recommend CSGO as the 'modern' return of 1.6, but I disagree. CSGO is better than CSS, yes, but still not on-par with 1.6, nothing will ever be :(  Goodbye WON-servers.",
            "review_score": "1"
        },
        {
            "review_text": "10 years and still playing , 1.6 will never die.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, I'm stronk player, ples.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just a classic. If you think you are a gamer you should know",
            "review_score": "1"
        },
        {
            "review_text": "  123",
            "review_score": "1"
        },
        {
            "review_text": "Best game of all time :)",
            "review_score": "1"
        },
        {
            "review_text": "I died... alot 4.8/10 to much water",
            "review_score": "1"
        },
        {
            "review_text": "Like it, in my opinium the best CS, now i can play it cause they fixed the hacked masterserver.",
            "review_score": "1"
        },
        {
            "review_text": "Life is 1.  CS is 1.6   :)",
            "review_score": "1"
        },
        {
            "review_text": "Played this as a kid (lol) probably the best game ever made, and the best thing is - no cases no skins no ranks - skill is the only thing that separates you from the general mass",
            "review_score": "1"
        },
        {
            "review_text": "#Old But Gold  #Best Shooter Ever",
            "review_score": "1"
        },
        {
            "review_text": "This is great game... Graphics is no good but it's great multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "i love the game just one question, why did valve change the old models? heres the problem the guys hand model in the beta is fine but the steam 1.6 version his skin is to pale to be skin. the old player models were fine but in 1.6 they are just blah. the old title screen it looked fine in the beta it always reminded me of the map de_dust but 1.6 it reminds me of like a news report thing about to come on TV. the hostages sure they look better with the bland orange suits and the white suits with ties, but the scientist models for the hostages look better because for example would you see a guy in a orange suit in a freezing cold place like office? alright i think i am done with saying all the problems with cs 1.6 now",
            "review_score": "1"
        },
        {
            "review_text": "+++",
            "review_score": "1"
        },
        {
            "review_text": "The original Counter-Strike, Valve made a multiplayer masterpiece here; it is almost faultless, apart from its old graphics.  14/15 - 'Good'",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game i recommended to you. This game is old bath a good game for nolifers. If you play this i recommend a server Ladie.lt this is a good server. This server is of Lithuianian country.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best game ever",
            "review_score": "1"
        },
        {
            "review_text": "Fired at a person and I actually killed them  10/10, already more polished than CSGO",
            "review_score": "1"
        },
        {
            "review_text": "10 years of pure fun &lt;3 10/10",
            "review_score": "1"
        },
        {
            "review_text": "the classic. the feels.",
            "review_score": "1"
        },
        {
            "review_text": "3742 hours of gameplay. What else i can say about this game :D",
            "review_score": "1"
        },
        {
            "review_text": "my fav. game.  i haven't got bored playing this game and also became a skilled player :). ",
            "review_score": "1"
        },
        {
            "review_text": "A classic that would never be forgotten",
            "review_score": "1"
        },
        {
            "review_text": "No russian ♥♥♥♥ ♥♥♥♥♥ screaming like in GO, no skins, no r8, no cz, whats a tec-9  i r8 8/8 m8",
            "review_score": "1"
        },
        {
            "review_text": "Although it has poor animations and graphics, it is still one of the most played games, and it's still running. This game is created to test out players reflexes. With great skills, comes great VICTORIES.  Put your skills to the test with this Counter Strike, one of the best first player shooting game ever released, with more than 1000 of servers online 24/7.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game, old school!!!",
            "review_score": "1"
        },
        {
            "review_text": "-SUPER FUN -old but gold -broken  -super smooth -XD",
            "review_score": "1"
        },
        {
            "review_text": "Nothing beats a classic.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a great game to play",
            "review_score": "1"
        },
        {
            "review_text": "The second best game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Eh, its alright",
            "review_score": "-1"
        },
        {
            "review_text": "the ♥♥♥♥    ... And still is.",
            "review_score": "1"
        },
        {
            "review_text": "The Best for ever",
            "review_score": "1"
        },
        {
            "review_text": "  Its not just a Game.......................... ",
            "review_score": "1"
        },
        {
            "review_text": "Waiting for Half-Life 4 -.-",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best cs game ever  Buy it already plebs",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game 4 Ever Nice Fps Nice Gameplay  :D",
            "review_score": "1"
        },
        {
            "review_text": "Will always be better than GO! :]",
            "review_score": "1"
        },
        {
            "review_text": "cs time to play",
            "review_score": "1"
        },
        {
            "review_text": "Nice game. :)",
            "review_score": "1"
        },
        {
            "review_text": "all time play!!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ nuggets. try to shift walk - join new server try to crouch - join new server",
            "review_score": "1"
        },
        {
            "review_text": "So sad that there SOO many cheats on her now :/",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best classic FPS ever!",
            "review_score": "1"
        },
        {
            "review_text": "Classic. Everyone knows this game.",
            "review_score": "1"
        },
        {
            "review_text": "Old but Gold! You gotta try this !",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game ever xdd",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Old school game.",
            "review_score": "1"
        },
        {
            "review_text": "^‿^ ⒺⓅⒾⒸ ⒼⒶⓂⒺ",
            "review_score": "1"
        },
        {
            "review_text": "The Legend!",
            "review_score": "1"
        },
        {
            "review_text": "My Love Its Cs 1.6",
            "review_score": "-1"
        },
        {
            "review_text": "+++",
            "review_score": "1"
        },
        {
            "review_text": "you know it",
            "review_score": "1"
        },
        {
            "review_text": "childhood",
            "review_score": "1"
        },
        {
            "review_text": "Nothing to say But Best Classic FPS!",
            "review_score": "1"
        },
        {
            "review_text": "Old School Game One Of The That Make My Childhood Happy 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game when it game out. Super Toxic now",
            "review_score": "1"
        },
        {
            "review_text": "good game for play ",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically just CoD with bad graphics. I rate it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The graphics might be bad, but who cares? People said that Wind Waker was bad only for the graphics, but once you played it, it was AWESOME. Same with this game, the graphics might be bad, but what do you expect from a game that was amde in 2000? But once you play this, it's really fun.",
            "review_score": "1"
        },
        {
            "review_text": "Its okay, i guess.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, I admit, I played this game back in my childhood on my original Xbox, and had so much fun. Not too long ago I reinstalled it for my computer, but when I did, I HATED it. I couldn't play right. People would one tap me from the side of the map, others will just be an absolute pro with the AWP making life so hard. Theres no mercy for new players, there's no official Valve servers, only the community servers which take away the classic feel. I have probably only joined 2 servers that have none of the stupid annoying Quake sounds. No 'double kill' or 'dominating' just classic CS 1.6. It was aggrovating for me, my favourite childhood game gone to waste, or so I thought. I was just bad at the game. I was scared to do anything. If I pushed in first, I thought I would get destroyed immediately. The guns felt weird and ridiculously inaccurate, the game didn't FEEL right, and anything I tried would ultimately fail. Well, until a couple of weeks ago.   I played violent. I played smart. I played gruesome and unforgiving. Getting 4 man spray downs and one-double tap headshots across the map. I was ruthless, relentless, and I enjoyed it. This game was starting to be fun for me, not as annoying, not as frustrating, only fun, as I always wanted it to be. The thing is I learned not to be scared, the same with CSGO. I played CSGO, sucked at it, played horribly until I just began to not care if I died. That was when I began to play better. CS 1.6 came, and I began to be horrifying. Enemy teams would scream at me, I would laugh and continue, their unfornate moments was fuel to my wrath, until, of course as it always happens, a pro AWPer comes towards me and 420 swagscopes me in the face. Rage quit.  11/10 would get Blazed it again.",
            "review_score": "1"
        },
        {
            "review_text": "The games dead. Its basically worthless to anyone in USA unless you want to play with third worlders. Even then theres only a few servers it looks like. I would rather die than play with South Americans. Anything south of the US border is just hell ( I have never had a positive experience online with these people and if you know anything about geopolitics I need not go into that), so I advise not dealing with these peoples idiocy and just going with CSGO these days unless you want to LAN this game.  One of the greatest FPS games to ever come out and will forever remain a classic but also a game that can still compete design and gameplay wise with games released in more current times. We will never have the natural form of support from players and ESPORTS ever again. This is before ESports was just a way for devs to market and shill a game. This was from when people who liked to play a game competed and not just a bunch of rich kids trying to win monetary prizes like ESports is now (who else could play CSGO all day erry day in this economy?)  People got behind this game because they liked it, instead CSGO is all about market manipulation and human psychology manipulating with less consideration about gameplay because they want the most monetary return. If the idiots will pay hundreds for a digital knife skin then why would any company invest in gameplay that won't have direct returns like a digital nongood would have?  The video game market is full of idiots who will dump money into anything now just so they can distract themselves from the politcs, economics, and slowly declining living conditions of the western world. Bread and circus in its truest form.  CS 1.6 is from better days, more honest days. When people who wanted to make games, and people who wanted to play games were very closely related and the average IQ of someone who was online was higher than now. These days every idiot has an internet connection. That is to say, the target audience then was just better than the target audiences of todays games. This is exampled many times in economics. Mediocricity Sells.",
            "review_score": "1"
        },
        {
            "review_text": "I am king of the bots!",
            "review_score": "1"
        },
        {
            "review_text": "It's the original CS on Steam! You just can't go wrong with this one.",
            "review_score": "1"
        },
        {
            "review_text": "physics? not here.",
            "review_score": "-1"
        },
        {
            "review_text": "I like old games, I mean, i grew up playing the Lands Of lore RPG's. This game was awesome when it came out for its time..but i like to move on with the times and experience newer, better games. I want to push my rig, and going back to a game from 2000, wont be doing much for me. I can understand why alot of people have trouble letting go of the past, and playing all the games they did when PC gaming started to become more relivent, but common, there are so many better looking, newer games out there that people dont give a chance. Even CSGO needs a buff,graphically and mechanically but thats just me.",
            "review_score": "-1"
        },
        {
            "review_text": "hory shet",
            "review_score": "1"
        },
        {
            "review_text": "Howdy partners, y all ♥♥♥♥♥♥♥♥♥♥♥♥s need to grow da ♥♥♥♥ up and play some GO.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I dont own this one either.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game not in steam got the cd and install it and have fun I played it since 2009",
            "review_score": "1"
        },
        {
            "review_text": "injected speedhack.dll and ran cheat engine. still not vacced 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I got banned from this game in 2002 by VAC just because I logged in from a computer with hacks installed in a LAN SHOP. It has been 11 years since I was banned and I still can't play Counterstrike with my account. I am already 25 this year, even prisoners in democratic nations are given 2nd chance but not STEAM. Shameful!",
            "review_score": "-1"
        },
        {
            "review_text": "the good old days lol",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible, just horrible. Everyone gives this good reviews based on nostalgia. I saw all the good reviews and thought I should try it out. Upon opening the game, was a cringy menu. I fiddle with the settings, and theres no damn graphics options! I put the crosshair on small.(Definitely not small) So, I go to servers and all the servers have horrible maps. Plus, closest servers had 0 players. I click on a Dust 2 server with 10 players. When it loads up, nobody speaks ♥♥♥♥ing english. The buy menu controls were so ♥♥♥♥ed up I couldnt buy a gun. So, I stuck with the pistol. I go through the middle, and all the players look the same! You cant even tell who's who. Literally, the ♥♥♥♥ing same. So I die instantly because i couldn't even tell it was an enemy. ♥♥♥♥♥♥♥t. I finally managed to buy a gun in the ♥♥♥♥ed up menu. I find someone, spray at em', and surprisingly it was enemy. My gun starts shooting in the ♥♥♥♥ing sky, recoil over 9000, and I was burst firing! Absolute ♥♥♥♥♥♥♥t. Another HORRIBLE thing about this game, its graphics and audio! It just doesnt meet todays standards. I think I might have to bleach my eyes after glancing at this game. Its horrible. I only played the game for under 10 minutes and I already want to kill my self. Trust me, save your money. If you loved this game as a kid, I dont care get it. But if youre looking for a good FPS, to TODAYS standards, dont get this garbarge! Save your ten dollars and use it to get your ♥♥♥♥ sucked by the girl down the street. So, simplest way possible.  Graphics 1  Audio 1  Community 2  Experience 1  Controls 2  Gameplay 2  Overall Game 1.6 (Haha, Counterstrike 1.6)",
            "review_score": "-1"
        },
        {
            "review_text": "I keep hearing that CSGO is a good game but this is way outdated. How is this a new game?",
            "review_score": "-1"
        },
        {
            "review_text": "Always hated Counter-Strike, got it as I got Half Life 1.",
            "review_score": "-1"
        },
        {
            "review_text": "bad game  all cheatrs",
            "review_score": "-1"
        },
        {
            "review_text": "This community is full of 12 year old horny fukbois who upload pictures with bad ♥♥♥♥♥es      PSA:feel free to down vote this review because its the truth.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a good game but due to how long it has been out people that are just starting have a massive learning curve you would be better off just getting the new version Counter-Strike Global Offensive",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing romanian servers",
            "review_score": "-1"
        },
        {
            "review_text": "better buy cs go",
            "review_score": "-1"
        },
        {
            "review_text": "I could NOT move forward at all! Waste of 10 dollars.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought I would receive comfy nostalgia with a small but nice community, instead I got a bunch of ♥♥♥♥-talking mexicans 14/88 it's not like you think it would be",
            "review_score": "-1"
        },
        {
            "review_text": "Shoots at guy 1 health I die  CS Unistalled  Installs Farming simulator Lives life as a farmer The End",
            "review_score": "-1"
        },
        {
            "review_text": "on my imac CS 1.6 the mouse glitches, lags whatever... lost 7 quids ... :( CS:GO way better despite of its usage, my imac can play the game perfect with lags!!!",
            "review_score": "-1"
        },
        {
            "review_text": "it's a great game, but i don't recommend because nowadays there is a map rotativity of just two or three maps",
            "review_score": "-1"
        },
        {
            "review_text": "There is no point in playing this game. I was banned for using hacks when I have never used any hack programs on my steam account. Wasted $10 for this game. Good luck",
            "review_score": "-1"
        },
        {
            "review_text": "16 years after it's release people are still palying it, which, in my opinion, says a lot! People are dumb as ♥♥♥♥...",
            "review_score": "-1"
        },
        {
            "review_text": "one of the worst games i ever played and the most corrupted with cheats ... i would never recommend such crap garbage to anyone",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible game. 1/10 WOULD NOT PLAY.",
            "review_score": "-1"
        },
        {
            "review_text": "When you play Counter Strike, the terrorists win.",
            "review_score": "-1"
        },
        {
            "review_text": "Never Play This Game Ever Period End Of Story.............................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................",
            "review_score": "-1"
        },
        {
            "review_text": "in this game u shoot and its sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Won the game in less than an hour. 10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Classic game. Very innovative at its time and it's fun to play. You should get its second remake Counter-Strike: Global Offensive though which is improved in almost every aspect of the game. Only get this if you're a nostalgic freak :-)",
            "review_score": "-1"
        },
        {
            "review_text": "This reboot of the series fell flat just go back to CS:GO",
            "review_score": "-1"
        },
        {
            "review_text": "It's so boring it'll put you to sleep! A must have gay game!.....NOT! Do you love spawning every 5 seconds and then dieing instantly? Then this game's for you! Do you love hackers? Then this game's for you! Do you love outdated graphics? Then this game's for you! ZZZzzz....",
            "review_score": "-1"
        },
        {
            "review_text": "Outdated graphics, and my bullets wont hit ever except when im really close. Why would anyone buy this when there are free games like battlefield:heroes that have better graphics and control better. Also, the amount of hacking in this game is tremendous, i join a server and about 30% of the people playing are using some form of hacx. The biggest rip-of off my life.",
            "review_score": "-1"
        },
        {
            "review_text": "wasted too much of my life on this one",
            "review_score": "-1"
        },
        {
            "review_text": "VOLVO DELETE THIS GAME PLS!!!!!!! THE ♥♥♥♥♥EST GAME I'VE EVER PLAYED",
            "review_score": "-1"
        },
        {
            "review_text": "The others always kill you and your team mates only just fooling around and show to everyone how many mocking word they know.    I cannot recommend this game no-one.",
            "review_score": "-1"
        },
        {
            "review_text": "I want my 3 h back",
            "review_score": "-1"
        },
        {
            "review_text": "FOR THOSE FROM CS:GO I'm sorry but it feels very strange, and doesn't make much sense. Given its differences in handling sensitivity, and just everything really, unless you're commited, you'll just got 40 to 160 on a DM like I did. Not the best experience, especially since there was nothing I knew to even improve.",
            "review_score": "-1"
        },
        {
            "review_text": "This game did a lot of neat things for its time. But don't get it now. There's no reason to buy something that isn't an M4 or an AK-47, and if you are a CT that just got a kill, you drop your M4 and take his AK, unless you memorize the recoil pattern on the gun you're firing you will lose every time, not that it helps because anyone still playing this game has been playing for 13 years and will know where you are at all times and be able to AWP you a new ventilation shaft in your forehead from 400 yards the same second your arm moves into visibility from behind a door. Just hold your horses, and let's hope they save Counter-Strike's from itself with CS:GO",
            "review_score": "-1"
        },
        {
            "review_text": "Cant play this game on my dedicated graphic card thanks to valves brilliant update. :)  Edit: And now my game is cut again. What the actual frak.",
            "review_score": "-1"
        },
        {
            "review_text": "Never liked old games. And I was right.",
            "review_score": "-1"
        },
        {
            "review_text": "it does not works with joystick. ",
            "review_score": "-1"
        },
        {
            "review_text": "Sorry all lovers of this game but no, i dont recommend this game because it is too old better buy global offensive this game is only if you want feel old times",
            "review_score": "-1"
        },
        {
            "review_text": "I am not recommend for this game! :)!",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good. :)",
            "review_score": "1"
        },
        {
            "review_text": "WHERE IT ALL STARTED.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best FPS game ever - after quake series ofc -",
            "review_score": "1"
        },
        {
            "review_text": "nyc game in the world",
            "review_score": "1"
        },
        {
            "review_text": "The best game ;-bd",
            "review_score": "1"
        },
        {
            "review_text": "The best FPS game ever made. Lots of modes. Lots of players. Great fun!",
            "review_score": "1"
        },
        {
            "review_text": "play hard go pro",
            "review_score": "1"
        },
        {
            "review_text": "We all know one thing. This games kicks call of duty's ♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "very classic much aim",
            "review_score": "1"
        },
        {
            "review_text": "Nice game :)",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic classic game! :D",
            "review_score": "1"
        },
        {
            "review_text": "thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever, no need to talk too much.",
            "review_score": "1"
        },
        {
            "review_text": "Counter strike is a game that teaches you how to use your eyes to there full potential. You must be a fast thinker and good at stratigic thought. I have NEVER enjoyed a game as much as i do with cs.",
            "review_score": "1"
        },
        {
            "review_text": "Best oldschool FPS shooting game ever, we never forget you :)",
            "review_score": "1"
        },
        {
            "review_text": "best multiplayer fps title of all time. nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game... Enough said!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Hello. I play this game for more than 14 years and still happy and would be grateful for your gift to me in the new year game Counter-Strike 1.6 thanks :)",
            "review_score": "1"
        },
        {
            "review_text": "Old classic, fantastic game :) A lot of servers with mods",
            "review_score": "1"
        },
        {
            "review_text": "the bomb has been planted",
            "review_score": "1"
        },
        {
            "review_text": "One of the best old games ever",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to the world’s most fun over rated pile of ♥♥♥♥.   Since I first got a PC nearly 3 years ago all I have ever heard is counter strike, counter strike, counter strike. And, after about 15 hours of play time I see why.   Right away I can see that when counter strike came out it was the magnum opus of the fps/multiplayer genre and I can respect that but that also explains the largest problem with counter strike, its nonexistent learning curve. For the first maybe 3 hours I played on a few different servers and never killed a single person. I figured I’m new to this and it seems as thoe these guys/girls have been playing much longer than I have been so I began to brush it off and then 2 hours and may servers later I had killed maybe 6 people, not much had changed. And then remembered that that’s stupid, I shouldn’t be playing against people that have 150 hours clocked while I have 5.  Another problem is the weapons  I can understand the weird names, Valve would have been a smaller company then and saved a buck by naming them weird stuff but that doesn’t mean I won’t still make fun of them. The damaged ratio is also complete ♥♥♥♥♥. The sniper rifle is a one hit kill the subs are useless and I was once hit across the map with a shot gun blast. The knife is a bit under powered but Thats better than it being a light saber. And For some reason the only guns that are ever used are the AK look alike the M16 look alike and the sniper rifle.   I should say that counter strike is not a bad a game. It's for sure a sextillion times better than any Call of Duty ever made. And I will confess that this game is more fun giving your friends ADHD kid a gram of cocaine and telling him his dad is made of candy. But it’s also as frustrating as trying to put that same kid in a car seat. ",
            "review_score": "1"
        },
        {
            "review_text": "We all now Why? xD",
            "review_score": "1"
        },
        {
            "review_text": "Awsome.",
            "review_score": "1"
        },
        {
            "review_text": "due to its special gameplay back in the time 10/10 .  now its just 2/10.",
            "review_score": "1"
        },
        {
            "review_text": "Old, but Gold",
            "review_score": "1"
        },
        {
            "review_text": "Counter Strike 1.6.... the game that set the standards of shooters and paved the way for new video games. On my old Steam Account, I racked at least 1000 hours on Counter Strike and Counter Strike Condition Zero, and all for a good reason, because it is probably one of the best team shooters in the world.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "What servers?",
            "review_score": "-1"
        },
        {
            "review_text": "very cool game",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike is one of those games that still has people playing on servers 15 years later and probably still will due to it's addictive and competitive gameplay. Strongly Recommend it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've spent so many hours playing this game, meeting new people.  I you've never played this game... what's wrong with you?",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good man 10/10 IGN Even 'Counter Strike Source' is more dead than this even here in 2015 its still funny Man trust me so funny!",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": ";)",
            "review_score": "1"
        },
        {
            "review_text": "This has to be one of my favorite CS games of all time :)!",
            "review_score": "1"
        },
        {
            "review_text": "The old games its the best!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I played this game when it was just a third party mod for half life. I cant tell you how many hours of my life I spent fragging my friends. It is still my old standby and even though steam took it over eventually they preserved its life for an online game. I recommend you play the classic whenever you get a feeling for nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "Best game 10/10 . If you have time you should play it :) Worth it's money,even for an old game,still rocking the shooters market.",
            "review_score": "1"
        },
        {
            "review_text": "I can think back to the days when I had this game on CD, It was amazing. This game IS still amazing.  The game is refreshing to play and is jam packed filled with fun! It is my favourite game from the series due to the fact that this game relates back to the times when I first started computer gaming and is a classic which everyone will enjoy!  Pick this game up now!",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "great one!",
            "review_score": "1"
        },
        {
            "review_text": "CS 1.5 or 1.6 was the birth place for me, to be a PC Gamer - 10/10 !!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, proving graphics aren't everything. Recommend buying the game and enjoying the PRO experience!",
            "review_score": "1"
        },
        {
            "review_text": "Good ol' CS 1.6, best played on LAN.",
            "review_score": "1"
        },
        {
            "review_text": "The best ever.",
            "review_score": "1"
        },
        {
            "review_text": "Well, what can I say? You know what to do.",
            "review_score": "1"
        },
        {
            "review_text": "really awsome game really recomend it",
            "review_score": "1"
        },
        {
            "review_text": "So good, Classic FPS game. Alive for decades!",
            "review_score": "1"
        },
        {
            "review_text": "Greatset of all time",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever !",
            "review_score": "1"
        },
        {
            "review_text": "old school if you haven't played this game you suck",
            "review_score": "1"
        },
        {
            "review_text": "It's Counter Strike.",
            "review_score": "1"
        },
        {
            "review_text": "This is Counter Strike 1.6 Recomanded !",
            "review_score": "1"
        },
        {
            "review_text": "Simply, the best fps game ever.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "It's ok I guess",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Cs 1.6 FOREVER!",
            "review_score": "1"
        },
        {
            "review_text": "thats pefect to pro players with steam you can make screenshots and upload it on steam account and facebook too. thats got very good 3D settings that settings helps to low videocards . if you download it you can play original and good game with official files i like steam",
            "review_score": "1"
        },
        {
            "review_text": ":********",
            "review_score": "1"
        },
        {
            "review_text": "this game should have a game search, i have a hard time finding a game i like. This game is Awsome i would recommend this game. :D",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "this is a good game for kids as it's not real life graficts. and servers with mods are sometimes good.",
            "review_score": "1"
        },
        {
            "review_text": "You Kill Someone They Die.   You Get Killed You Die.  Heart breaking story",
            "review_score": "1"
        },
        {
            "review_text": "the best multiplayer game ever :) . .. .",
            "review_score": "1"
        },
        {
            "review_text": "Simply classics.",
            "review_score": "1"
        },
        {
            "review_text": "nothing to say 1.6 - classic",
            "review_score": "1"
        },
        {
            "review_text": "5/5",
            "review_score": "1"
        },
        {
            "review_text": "Over 1000 Hours and still playing!",
            "review_score": "1"
        },
        {
            "review_text": "Great and cheap multiplayer awesomeness!",
            "review_score": "1"
        },
        {
            "review_text": "This game has a odd aiming system compared to CSGO and CSS so this is a true classic and it is still fun today but it does show its age a little. 8.9/10",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't need no intro.. I mean come on, this is CS1.6. The godfather of all competetive tactical shooters! Best FPS to date. _O_",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever...spent more than 10 happy years playing it. Beware of cheaters tho. GL &amp; HF",
            "review_score": "1"
        },
        {
            "review_text": "good game but can be frustrated! :D",
            "review_score": "1"
        },
        {
            "review_text": "Whenever I play this game I have the urge to go back to high school then smoke some dank buds and tell my mom to go to hell. Linkin Park 4 ever.",
            "review_score": "1"
        },
        {
            "review_text": "One old, but good thing :)",
            "review_score": "1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "its a cool game ",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, thanks valve for making it. I know its very old tho =D",
            "review_score": "1"
        },
        {
            "review_text": "Not B + R Friendly. Came for the dusters, stayed for the rats.   11/10",
            "review_score": "1"
        },
        {
            "review_text": "It fu‪‫‬‭ckin sucks, It suckin fu‪‫‬‭cks, It fu‪‫‬‭ckin blows, It's a piece of sh‪‫‬‭it, and I don't like it.",
            "review_score": "1"
        },
        {
            "review_text": ",",
            "review_score": "1"
        },
        {
            "review_text": "Great Game^^ 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Its a nice Game",
            "review_score": "1"
        },
        {
            "review_text": "classy",
            "review_score": "1"
        },
        {
            "review_text": "game for nerds ,bad story line.",
            "review_score": "1"
        },
        {
            "review_text": "after reinstalling steam ALL SERVERS ARE LOST!!!!!  Sometimes cant find servers...",
            "review_score": "1"
        },
        {
            "review_text": "1.6 the best",
            "review_score": "1"
        },
        {
            "review_text": "The best game &lt;3....",
            "review_score": "1"
        },
        {
            "review_text": "I played this since 15 years, i still playing it. Totally Reccomended",
            "review_score": "1"
        },
        {
            "review_text": "ONLY GAME THATS I PLAY!!! YOU CAN KEEP ALL THE FANCY GRAPHC GAMES _ NOTHING COMPARES TO THE ORIGINAL 1.6",
            "review_score": "1"
        },
        {
            "review_text": "Learnt russian because of this game 999999/10 -ign",
            "review_score": "1"
        },
        {
            "review_text": "The Best",
            "review_score": "1"
        },
        {
            "review_text": "what a classic game!",
            "review_score": "1"
        },
        {
            "review_text": "Only played a little, but it was fun.",
            "review_score": "1"
        },
        {
            "review_text": "The best of the best ! OLD SCHOOL !",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "The best.",
            "review_score": "1"
        },
        {
            "review_text": "That is so good :) !",
            "review_score": "1"
        },
        {
            "review_text": "It's an awesome game.I wish for a long time to buy it on steam and finally I did it.And now I am enjoy it.I have more possibilities and more 'doors opend'",
            "review_score": "1"
        },
        {
            "review_text": "!",
            "review_score": "1"
        },
        {
            "review_text": "The best game in the world at one time. But now, it's time to admit that other, newer games have taken its spot. There's little reason to play the original CS other than for historical curiosity.",
            "review_score": "-1"
        },
        {
            "review_text": "Probably best action game ever! This game is so old and still so popular!",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever. Too bad noone plays it anymore. CS GO is alright, but this was the bomb.",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece of an FPS! This game revolutionized FPS gaming forever. With some of the elements still being used today. For a game released at 1999, this aged surprisingly well, with over 1000 servers still up. Still as addicting and fun as in 1999",
            "review_score": "1"
        },
        {
            "review_text": "great old school game, had the best mod support back in the day.",
            "review_score": "1"
        },
        {
            "review_text": "Best of our class in that time.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Fire in the Hole Simulator",
            "review_score": "1"
        },
        {
            "review_text": "omg this game has the best graphics ever 69/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice game !",
            "review_score": "1"
        },
        {
            "review_text": "Best Game Ever, This game fill me with my all history from this game &lt;3 I fill now so good. I remember how I play this game when I be like 7-9 years old :) This game still hard to me :( I better in 'CS:GO' :)  Thx for reading. -Max",
            "review_score": "1"
        },
        {
            "review_text": "I come back to this game as often as possible. Truly the best shooter out there and a timeless classic.  10/Bomb has been planted.",
            "review_score": "1"
        },
        {
            "review_text": "------------------------------------------------------------------------------------",
            "review_score": "1"
        },
        {
            "review_text": "Best of !",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "iam prafesionel playaer fruom russan fedeeraton",
            "review_score": "1"
        },
        {
            "review_text": "A classic mostly got this to to play GMOD. Had a bit of fn playing online, people still play!",
            "review_score": "1"
        },
        {
            "review_text": "Need to fix Viewmodel , Cuz Used to other cs things , Rest : Awesome :) Old is gold , yeah :)",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "This game is LIFE! &lt;3 CS 1.6 forever green !",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold!",
            "review_score": "1"
        },
        {
            "review_text": "I think this is the game I have played most in my lifetime of gaming and I thank Valve for keeping it updated throughout this whole time. You will always be remembered!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I never played it much because of other great counter-strikes but I wish I had, out of all of these I have enjoyed this the most, high fps, decent graphics and simplistic. Good game to enjoy with friends and is totally worth the money, if not it is worth more! Just because it came out in 2000 doesn't mean you have to stop caring. CS:GO is good but no game is ever better than this!",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game",
            "review_score": "1"
        },
        {
            "review_text": "old game, but still good. ;3",
            "review_score": "1"
        },
        {
            "review_text": "It's very simple and is the best",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Skins are free. I now have a Bayonet. 10/10 better than csgo",
            "review_score": "1"
        },
        {
            "review_text": "this game totally isnt outdated!  1/10 would fire in and/or outside a hole again",
            "review_score": "1"
        },
        {
            "review_text": "The definitive shooter that pioneered the online genre as you know it today...",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME SHOULD BE REQUIRED ATLEAST 100HOURS LOGGED BEFORE ANYONE CAN PLAY CSGO.",
            "review_score": "1"
        },
        {
            "review_text": "World's Number 1 online action game.",
            "review_score": "1"
        },
        {
            "review_text": "Servers that include boats, but sometimes...",
            "review_score": "1"
        },
        {
            "review_text": "You should get this game not the best graphics but its fun.",
            "review_score": "1"
        },
        {
            "review_text": "I heard that when i was made it was a huge succsess and now it's still popular. :D",
            "review_score": "1"
        },
        {
            "review_text": "counter strike is my life.",
            "review_score": "1"
        },
        {
            "review_text": "the most legendary game of all time it was released in 1999, but players do play in 2015 so the game itself tells alot about it. moreover it's version r updated about every 4 to 5 years latest is now i think is COUNTER STRIKE GLOBAL OFFENSE . some of the most famous players were markeloff,potty,get_right,guardian nd some famous teams were - NAVI, SK GAMING, etc. in india there r teams like NSD who won asian champoinship from 2006 to 2012 till cs go released . it was now suffering from DDOS attack in india nd because of that players r shifting to csgo.  THANKYOU",
            "review_score": "1"
        },
        {
            "review_text": "playing since 2009 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "gr8...still needs better graphics",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing since the days before steam. I've spent hours upon hours playing and I still talk to some clan-mates from our 'CAL' days. Great times, great game.",
            "review_score": "1"
        },
        {
            "review_text": "Russians:The game",
            "review_score": "1"
        },
        {
            "review_text": "The CS 1.6 Community is 90% Mexican, 9% Russian, and 1% English",
            "review_score": "1"
        },
        {
            "review_text": "AHA POLECAM TO GOWNo",
            "review_score": "1"
        },
        {
            "review_text": "After a long break i decided to download CS and see if it's still alive. It is... barely. All these years on and still the best game ever created. Good memories! Better than any CS games that followed. They just don't make games like this anymore. CS:GO is a joke next to this classic.",
            "review_score": "1"
        },
        {
            "review_text": "i cant find the skins i bought valve why",
            "review_score": "1"
        },
        {
            "review_text": "Cool game)",
            "review_score": "1"
        },
        {
            "review_text": "Best shooting game ever &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "may be old but still fun if ya want to play CS GO with out the items and just play then ya better get this or source its way more worth it . the graphics suck but the gameplay makes up for it",
            "review_score": "1"
        },
        {
            "review_text": "Cool oldschool FPS game",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't crash in 4k 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is not bad and a classic",
            "review_score": "1"
        },
        {
            "review_text": "this is the best game i play before cs:go  i recomand it because it has everithing do you need when you are tired",
            "review_score": "1"
        },
        {
            "review_text": "Old but good :D",
            "review_score": "1"
        },
        {
            "review_text": "I missed this game. This is the best game of all time!",
            "review_score": "1"
        },
        {
            "review_text": "Play hard, go pro!",
            "review_score": "1"
        },
        {
            "review_text": "No FPS game will ever come close to the original Counter-Strike. It's a shame the days when everyone played it are over.",
            "review_score": "1"
        },
        {
            "review_text": ":*",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "The best (CS) game of all time obviously. No talk. No questions.",
            "review_score": "1"
        },
        {
            "review_text": "Classic..",
            "review_score": "1"
        },
        {
            "review_text": "Old but very beautiful game",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold",
            "review_score": "1"
        },
        {
            "review_text": "The most influential FPS game of all time. Probably the best one too.   11/10 i ♥♥♥♥ing love this game.",
            "review_score": "1"
        },
        {
            "review_text": "After all these years this shooter remains to be a classic that can't be ignored. No other shooter is as accessible, easy to play, simple nor skillful as this. It can be enjoyed anywhere with the 64MB portable version for LAN parties. It's all about aim, accuracy, quick reflexes but does have a strategical element since it is a tactical shooter and there's no respawning. This game was a major turning point in the history of FPS, and this game is what made online multiplayer competitive gaming so popular.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold!",
            "review_score": "1"
        },
        {
            "review_text": "Good clasic game to revise on and realise how far this game has come :)",
            "review_score": "1"
        },
        {
            "review_text": "Cs is Goood!! ",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Almost the only game that is played after more than 10 years.",
            "review_score": "1"
        },
        {
            "review_text": "nostalgy everywhere but servers in my country is full of cheaters, so sad it's they lost btw i'm from bosnia",
            "review_score": "1"
        },
        {
            "review_text": "PLUSES: good gameplay, good game mechanics, epic community, flashbang are too good. CONS: Potato graphics looks like minecraft in a toaster",
            "review_score": "1"
        },
        {
            "review_text": "Memories! Miss it alot. ",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. One of the best ever made, veterans will understand.",
            "review_score": "1"
        },
        {
            "review_text": ";)",
            "review_score": "1"
        },
        {
            "review_text": "I Like this game",
            "review_score": "1"
        },
        {
            "review_text": "Really great game :)",
            "review_score": "1"
        },
        {
            "review_text": "Best Game In the WORLD !!!",
            "review_score": "1"
        },
        {
            "review_text": "A must-play game in my gen haha",
            "review_score": "1"
        },
        {
            "review_text": "I like this game",
            "review_score": "1"
        },
        {
            "review_text": "Can't really play it anymore but it never gets old!",
            "review_score": "1"
        },
        {
            "review_text": "Is a super first person game ;)",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best game in the world. I’m lovin' it. Always Counter-Strike. Just play it.",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the world! :D",
            "review_score": "1"
        },
        {
            "review_text": "The only game that lets you have a 5 kill streak and a defuse with 300+ ping",
            "review_score": "1"
        },
        {
            "review_text": "Simply a timeless classic",
            "review_score": "1"
        },
        {
            "review_text": "Best game on earth",
            "review_score": "1"
        },
        {
            "review_text": "Cool game, old but good.",
            "review_score": "1"
        },
        {
            "review_text": "If you have ten dollars to spare or if you get it in one of the valve bundles or in a humble bundle or something to that extent DEFINITELY check it out. I may only have 75 hours on this as of now but I used to play it all the time before I knew it was on steam. If your a person who doesn't mind graphics but likes counter strike I would definitely buy it because, while I don't necessarily like classic on this version all of the custom maps and game modes make well worth ten dollars. *Alert* A lot of the gun names and the amount of guns is pretty different from CS GO but there are probably guides and once you get past your first hour-ish its fine.",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of potential in this game, Valve please don't leave it, we need your patches. Gaben, please add skins and destroy them cheaters with your almighty power.",
            "review_score": "1"
        },
        {
            "review_text": "Classic game.",
            "review_score": "1"
        },
        {
            "review_text": "Is Nice game!!!",
            "review_score": "1"
        },
        {
            "review_text": "oustanding",
            "review_score": "1"
        },
        {
            "review_text": "Nice to play .",
            "review_score": "1"
        },
        {
            "review_text": "First game where I was addicted as a kid. Great gameplay and a lot of mods give me Thousands hourse of gameplay. Since I was a kid and didnt know much about steam I played this non-steam and even now after I have newest games to play I just buy it cause of sympathy. If you ever play this game non-steam or just looking for very good shoter similar to CS: GO this game is for You.  I totally suggests you to buy this beauty game",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely great! I'm really dissapointed I didn't get this game years ago!",
            "review_score": "1"
        },
        {
            "review_text": "One thing I need to comment on. Why can't I customize a game and play with bots? Besides that this game is a gem obviously. Playing on the italy map led me to buying csgo, and I can't even get bored of it. My gameplay was on another edition not from steam so don't pay attention the gameplay hours.",
            "review_score": "1"
        },
        {
            "review_text": "best cs there is!",
            "review_score": "1"
        },
        {
            "review_text": "-Open game -Activate your cfg -Find a server -And 'b 4 3 b 1 4' if u r ct -If u t 'b 4 2 b 1 4' -GO! GO! GO!    After 3 seconds   Me : U hacker. Someone : hahaha noob Hacker : O Hockor hohoohoh noob Me : /admin Admin : He is not hacker Me : U know what ? u guys are S*ck. All of u. Did u hear me? N*gga ! Me : And i'm not racist.  And i'm banned.",
            "review_score": "1"
        },
        {
            "review_text": "Every online game aspires to be conterstrike, and why not?",
            "review_score": "1"
        },
        {
            "review_text": "After countlessly playing CSGO, Counter Strike original called me for no odd reason. I decided to buy it and wow, the game does lack graphics and resolution, but brings so much memories to almost 4-5 years ago! It's a classic. I hope they could remaster or somehow bring back Counter Strike original so its graphics do get improved and see how different they both looked from year 2000 till today   11/10 :D awesome game, brining back heaps of memories.",
            "review_score": "1"
        },
        {
            "review_text": "full of indonesians and the wallbang is just so realistic 10/10",
            "review_score": "1"
        },
        {
            "review_text": "guys who did negative reviews: -kids -angry players - who thinks that 1 error=bad game -noobs -and the guy who wants a second chance",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike is a cool game. I play this game in 2015 and it's still good.",
            "review_score": "1"
        },
        {
            "review_text": "Be the best, ♥♥♥♥ the rest",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would ♥♥♥♥ again",
            "review_score": "1"
        },
        {
            "review_text": "Played this game already for 12 years. Best FPS game ever!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best fps ever",
            "review_score": "1"
        },
        {
            "review_text": "This game was amazing but now it feels really clunky and pointless interms of gameplay. There is a safe way of playing this game and that is to spray like crazy. Sense this game is very old headshots are far to easy to land making sprays all the more cheap, you are litterally being rewarded for being a reckless player.  if you want to get a better feel of Counter-Strike just get Counter Strike: Source. Its pretty much CS but fixed with a better physics, online sync, and better hit detection.  This game doesn't hold up with games today.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "Best game gr8 10/10 lonnie , spoopy lenny would play it.",
            "review_score": "1"
        },
        {
            "review_text": "This game will always carry treasured childhood memories.",
            "review_score": "1"
        },
        {
            "review_text": "Best old shooter game ,)",
            "review_score": "1"
        },
        {
            "review_text": "wtf happened to the fps? did they put a limit on it?",
            "review_score": "-1"
        },
        {
            "review_text": "This is best game ever",
            "review_score": "1"
        },
        {
            "review_text": "First game=Death Second game=Death Third Game=I suck at this game.",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold!",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░░▄▄░░░░░░░░ ░░░░░░░░░█░█░░░░░░░░ ░░░░░░░░▄▀░█░░░░░░░░ ░████▄▄▄▀░░▀▀▀▀▄░░░░ ░████░░░░░░░░░░█░░░░ ░████░░░░░░░░░░█░░░░ ░████▄▄▄░░░░░░░█░░░░ ░▀▀▀▀░░░▀▀▀▀▀▀▀░░░░░ ░░░░░░░░░░░░░░░░░░░░",
            "review_score": "1"
        },
        {
            "review_text": "On my old steam acconut over 2500+ Hours..memories,  Signed by  PGL/Oldheaven",
            "review_score": "1"
        },
        {
            "review_text": "this game rulz",
            "review_score": "1"
        },
        {
            "review_text": "4444",
            "review_score": "1"
        },
        {
            "review_text": "its a very grate game but i cant add bots can somone send me a message on how to add bots i will be very happy if you can send ma a message over how to instal bots. overall its a good game and its the only game on my libary that runs on 60 fps",
            "review_score": "1"
        },
        {
            "review_text": "Propably mother of most tactic-FPS games, classic and perfect at the same time, includes alot of fun moments and makes players want to sharpen their skills.    The game that teaches us that you run faster with the knife .   For some reason scout sniper rifle appears to be the lighter than knife. Doh.",
            "review_score": "1"
        },
        {
            "review_text": "Good old times :S",
            "review_score": "1"
        },
        {
            "review_text": "In its day, CS 1.6 was the shining example of a multiplayer FPS experience. It was just one of those games that, if you didn't own it, you were just statistically worse than everyone else. Oh, how the might have fallen. Nowadays, the game is plagued with a general lack of interest, as most of its fans have moved on to its vastly superior brothers, CSS and CSGO, and for good reason.  I would recommend playersonly play on servers they trust. This is because apparently one server overwrote all of my unused keys to connect to 'xdd.ms-shadow.ro:27015', which is also a server i would recommend avoiding at all costs.  This game is a relic, a fossil from an age of gaming long past.",
            "review_score": "-1"
        },
        {
            "review_text": "plant the bomb and get to tha choppaaaah",
            "review_score": "1"
        },
        {
            "review_text": "world's best game ever",
            "review_score": "1"
        },
        {
            "review_text": "Good Old Game, When I play this game let me remember my little past.",
            "review_score": "1"
        },
        {
            "review_text": "Its csgo but without skins and worse texures. At least it has the Mp5",
            "review_score": "1"
        },
        {
            "review_text": "I played a couple games, seems fun.",
            "review_score": "1"
        },
        {
            "review_text": "Old But Gold &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "NYC GAME :p",
            "review_score": "1"
        },
        {
            "review_text": "the best shooting game ever",
            "review_score": "1"
        },
        {
            "review_text": "Ive been playing this game since june 2014. I really enjoy playing this game. i reccomend this game to everyone who enjoys playing computer games. Also the GSU server is the best. GO Gsu!",
            "review_score": "1"
        },
        {
            "review_text": "Still love to play :D",
            "review_score": "1"
        },
        {
            "review_text": "Nice training for GO.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Because this game never gats old, its still interesting after 17 years... Audio 10/10 Graphics( at that time ) 10/10 Community 10/10 Matchmaking 8/10  It was created in 1999... Still best First person multiplayer shooters of all time!",
            "review_score": "1"
        },
        {
            "review_text": "....",
            "review_score": "1"
        },
        {
            "review_text": "this game is sh*t literaly. Most of the servers are ok but when you shoot your gun you really cant tell where your bullets are landing after that. Also the registration is crap as well. Dont buy this game unless you want to get sh*tted on by a bunch of perubian butt pirates who cant afford anything or run anything else besides this terrible game.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best game ever, i will play this in 50 years to!",
            "review_score": "1"
        },
        {
            "review_text": "This is always going to be a great game in the eyes of CS fans",
            "review_score": "1"
        },
        {
            "review_text": "Real ♥♥♥♥♥♥ game nowadays. Not playable anymore. Go Source or Global Offensive.",
            "review_score": "-1"
        },
        {
            "review_text": "finally no more ♥♥♥♥ ♥♥♥♥♥s",
            "review_score": "1"
        },
        {
            "review_text": "counter-strike 1.6 is my favorite game i first on played shooter game wheen i start playing shooter game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "I can speak spanish and portuguese fluently after playing on NA servers.",
            "review_score": "1"
        },
        {
            "review_text": "Can't run CSGO? Get this! Unfortunately the FOV looks really low when on 16:9 resolutions, and a lot of the servers are spanish. Still fun though. And you can't waste your money on skins in this one!",
            "review_score": "1"
        },
        {
            "review_text": "The dead wish is come to cs 1.6 :p",
            "review_score": "1"
        },
        {
            "review_text": "Best first person shooter game ever.",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold.",
            "review_score": "1"
        },
        {
            "review_text": "This game is legendary. This started back in 1999 and haven't got lost the pleasure of playing it. The graphics are not the best, it's an old game, but it's FUN! That was the point of the game! It's one of the best first person shooter in the world, it's not me saying that, all over the world people consider Counter Strike 1.6 one of the best shooter games. And it had lans and big event until CS:GO showed up in 2012. It's still played by LOTS of people. 17 years old and still rocks!!",
            "review_score": "1"
        },
        {
            "review_text": "timeless classic",
            "review_score": "1"
        },
        {
            "review_text": "Still the best game :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Classical Shooter Game 5/5 Still love to Play.",
            "review_score": "1"
        },
        {
            "review_text": "1111",
            "review_score": "1"
        },
        {
            "review_text": "good. i paly after school becouse have 0 frends :-)",
            "review_score": "1"
        },
        {
            "review_text": "  welp cs is an good game and it still for now cause its keep the idea of FPS &amp; fun &amp; ect .... aaaaaaaaand i suggest to ppls of FPS games to buy it  ",
            "review_score": "1"
        },
        {
            "review_text": "When you have a really sh*tty computer",
            "review_score": "1"
        },
        {
            "review_text": "counter strike 1.6 aka nostalgia strike 1.6  since this is a classic i would probably get ddosed, hacked and many other horrible things done to me if i were to talk badly upon this magical game  ------------- Le Good stuf -good old maps (dust2, vertigo etc.) -the riot shield (im probably the only person who likes the riot shield) -night vision (good for camping in dark spots with an awp while eating doritos you fat russian) -actual sprays (not the BS that you have to pay for in csgo) ------------- Le bad Stuf  -no bots  though this can be easily fixed through Zbots, just google it up and it shouldnt be too hard to get working  in the end i give this a 9/10 really good game, not too shabby graphics, and a fun waste of time if your bored ",
            "review_score": "1"
        },
        {
            "review_text": "my life :D &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game,must buy it!",
            "review_score": "1"
        },
        {
            "review_text": "  Old is Glod xD :D",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game",
            "review_score": "1"
        },
        {
            "review_text": "  OMG its the best game after CS:GO . MUST BUY !!!     LIE&lt;3",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever ! Nice feeling to see it 16 years later still played and live! Gud work GAAAAABEN",
            "review_score": "1"
        },
        {
            "review_text": "This game was the reason i first installed Steam. A classic 'must have' that all gamers should own.",
            "review_score": "1"
        },
        {
            "review_text": "Old but Gold still the best game of all time",
            "review_score": "1"
        },
        {
            "review_text": "The game is 16 years old and is still the best Counter-Strike. Eat your heart out Global Offensive.",
            "review_score": "1"
        },
        {
            "review_text": "Old is gold~",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, needless to say one of the most competitive games ever, and one of the highest skill-ceilings",
            "review_score": "1"
        },
        {
            "review_text": "Been decade since it was released but still rocks ;') memories",
            "review_score": "1"
        },
        {
            "review_text": "I don't care how old this game is. It's still my favorite, I played it when I was 9 and I'll keep on playing until I'm on my 70s.",
            "review_score": "1"
        },
        {
            "review_text": "Best game of all time. Make sure to use the AWP",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "old but gud",
            "review_score": "1"
        },
        {
            "review_text": "It's so funny game :)",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely insane... this game is eternal... playing it for almost 11 years and there's still community.",
            "review_score": "1"
        },
        {
            "review_text": "Old school, memories, deagle, no op five seven or tec 9, just rexal",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold",
            "review_score": "1"
        },
        {
            "review_text": "whatever",
            "review_score": "1"
        },
        {
            "review_text": "Good game and fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "No matter how many new editions of this game will be released, this was the first.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games of all time, still worth playing!",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of old time",
            "review_score": "1"
        },
        {
            "review_text": "5/7",
            "review_score": "1"
        },
        {
            "review_text": "Since starting this game in 2000, it's hands down my idea for the best game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the history of steam.",
            "review_score": "1"
        },
        {
            "review_text": "play this game for 10years, still the best FPS Ever !!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the sense of my life !",
            "review_score": "1"
        },
        {
            "review_text": "all time classic, must have no#1",
            "review_score": "1"
        },
        {
            "review_text": "Classic game, old school.",
            "review_score": "1"
        },
        {
            "review_text": "  I woke up with VAC ban, for no reason",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold!  This game was the best experience in my past. It won many awards and was the world number one in online gaming. I played it over ten years in many clans and 5on5 teams, in few leagues and many cups.  My best experience was the 6 months in Electronic Sports League Pro Series 2005 and in Electronic Sports League World Cyber Games 2005 Qualifiers.  This old game never had so many cheaters and players under 13 as the new one Counter-Strike: Global Offensive...  I miss the gold old time!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, my childhood",
            "review_score": "1"
        },
        {
            "review_text": "Why are you even reading these reviews, you already know what this is and waht it's like...",
            "review_score": "1"
        },
        {
            "review_text": "First time I've played this game was on 2008 or so.. I still remember how excited I was playing this game for hours each day.. Even if I don't have many hours of Counter-Strike on Steam, I played it Non_Steam Mode. I recommend this game to any person who like shooting games! ^^",
            "review_score": "1"
        },
        {
            "review_text": "Just a great classic Counter strike, I love it ^L^",
            "review_score": "1"
        },
        {
            "review_text": "cant buy skins, cases, keys, stickers - gaben cant steal our money 10/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "Getting dominated by Mexicans in public servers",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! It's amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like sex, but much better",
            "review_score": "1"
        },
        {
            "review_text": "Almighty Game of All time !!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the test of time 100%! :)",
            "review_score": "1"
        },
        {
            "review_text": "Classic.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best team FPS game to ever exist",
            "review_score": "1"
        },
        {
            "review_text": "best of the best!",
            "review_score": "1"
        },
        {
            "review_text": "Best and most classic CS game to ever exist (IMHO). Love the nostalgia it brings to me just for looking at the screen shots. This piece of art is a loving part of my younger years. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "  It's good..",
            "review_score": "1"
        },
        {
            "review_text": "Old memories...",
            "review_score": "1"
        },
        {
            "review_text": "Good game.Just not quite picture quality, very classic.很好的游戏，就是画质差了点，非常经典。",
            "review_score": "1"
        },
        {
            "review_text": "All time best game! Must play it",
            "review_score": "1"
        },
        {
            "review_text": "One game one love CS 1.6",
            "review_score": "1"
        },
        {
            "review_text": "My fav game of all time. Love youuuu CS 1.6",
            "review_score": "1"
        },
        {
            "review_text": "This Game Makes You Addictive to it :) and believe me this addiction is much better than all those drugs and other addiction :D",
            "review_score": "1"
        },
        {
            "review_text": "Old But Gold",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever after 1.5, which is best game after 1.3",
            "review_score": "1"
        },
        {
            "review_text": "I lost years (I'm really not exaggerating here) to this game. There are better games out there now but for it's day this was a trailblazer. Still a lot of fun now.",
            "review_score": "1"
        },
        {
            "review_text": "All of those highschool feels",
            "review_score": "1"
        },
        {
            "review_text": "A very good game! Maybe it's a bit old but it's still good. If you don't care about the graphics or have a crappy computer and you want to play a really good fps - This game is for you",
            "review_score": "1"
        },
        {
            "review_text": "Play and keep calm.",
            "review_score": "1"
        },
        {
            "review_text": "Old school FPS. The one that started it all when it comes to modern shooters. Still fun, fluid game play. I cut my teeth playing CS, my first fps game I played. Takes a bit more skill. Many, many good times!",
            "review_score": "1"
        },
        {
            "review_text": "Classic, a must have for shooter fans.",
            "review_score": "1"
        },
        {
            "review_text": "This game is legend",
            "review_score": "1"
        },
        {
            "review_text": "Good Stuff.",
            "review_score": "1"
        },
        {
            "review_text": "The best FPS shooter ever.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS SO AWESOME. BUY IT",
            "review_score": "1"
        },
        {
            "review_text": "It is one of the best FPS games ever made. Graphics does not matter, it is all about the gameplay :)",
            "review_score": "1"
        },
        {
            "review_text": ";)",
            "review_score": "1"
        },
        {
            "review_text": "Loved the original CS, actually quit playin when csSource came out, wasnt as hooked to it and missed it ever since. Came back to try csGo",
            "review_score": "1"
        },
        {
            "review_text": "Old but GOLD",
            "review_score": "1"
        },
        {
            "review_text": "Good game to learn how to aim :)",
            "review_score": "1"
        },
        {
            "review_text": "The one true CS.",
            "review_score": "1"
        },
        {
            "review_text": "It truly was one of the best first person shooter games at the time. I still play it to me graphics dont matter, the playing of the game matters.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best multiplayer FPS ever. Even 12 years after its official 1.0 release, its still the most played action game online. While other big online multiplayer FPS's have come on gone with a lot of fanfair(i.e. Battlefield 1942, COD 2, Battlefield 2, UT 2004, Counter-Strike:Source, Quake Live, COD 4, etc etc etc) this game has remained a constant favorite in E-Sports and amonst FPS fans. Lets hope CS:GO can continue the CS tradition of teamplay, great maps, competitivness, and unmatched gunplay. LONG LIVE CS!",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun old game with flaws but worthy of a buy",
            "review_score": "1"
        },
        {
            "review_text": "If you join the army or some special force, you have to buy your own gear. The heck?",
            "review_score": "1"
        },
        {
            "review_text": "Simply addictive!",
            "review_score": "1"
        },
        {
            "review_text": "A Game For All Professional Counter-Strike Players!!",
            "review_score": "1"
        },
        {
            "review_text": ":-)",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet: An fps classic, shame on you if you don't own it...",
            "review_score": "1"
        },
        {
            "review_text": "always the best ! ",
            "review_score": "1"
        },
        {
            "review_text": "the standard in FPS.",
            "review_score": "1"
        },
        {
            "review_text": "This is most skillfull game!",
            "review_score": "1"
        },
        {
            "review_text": "Fun times in the good old days.",
            "review_score": "1"
        },
        {
            "review_text": "The best fps game ever and the most addicted ! XD",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike it's really amazing, but today really it's bad we can't play good, just before are good. Server are Sh~# PPL are Sh%$ really it's BAD  People Play free, Play Clean, Play to your mode, and OFF HACK, OFF cheating , OFF Scripting, OFF ALL    Play Fun :)",
            "review_score": "1"
        },
        {
            "review_text": "all time favourite game till this day.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game!",
            "review_score": "1"
        },
        {
            "review_text": "For OldSchools!",
            "review_score": "1"
        },
        {
            "review_text": "EPIC Game Better than all other fps games exept CSGO but If you dont care about graphics and love the competitive scene then play this game :)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much the best game ever. period.",
            "review_score": "1"
        },
        {
            "review_text": "Always in my heart. An all time classic that I can never forget. I still love to play the eagle catch the chicken on de_dust 2. This game is just FUN! I don't give a ♥♥♥♥ about the graphics but this is better than all of the other.",
            "review_score": "1"
        },
        {
            "review_text": "Man Simply Awesome Game &lt;33333333333",
            "review_score": "1"
        },
        {
            "review_text": "Great game ",
            "review_score": "1"
        },
        {
            "review_text": "CONNECT 46.174.50.29:27211",
            "review_score": "1"
        },
        {
            "review_text": "Fun game , but outdated !",
            "review_score": "1"
        },
        {
            "review_text": "top games",
            "review_score": "1"
        },
        {
            "review_text": "Great game that spawned a great franchise",
            "review_score": "1"
        },
        {
            "review_text": "the best game ever!",
            "review_score": "1"
        },
        {
            "review_text": "Classic.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say. The game that made competitive FPS what it is today!",
            "review_score": "1"
        },
        {
            "review_text": "For some reason it does not work on my fresh 13.04 ubuntu installation with wine. When I want to join ANY cs server I get the message, that blabla map is not  correct.",
            "review_score": "1"
        },
        {
            "review_text": "Why are yo playing a game over a decade old?",
            "review_score": "1"
        },
        {
            "review_text": "One of the most played and known games in the world. You can't get bored of this game. Really recommand it.",
            "review_score": "1"
        },
        {
            "review_text": "hmpf...",
            "review_score": "1"
        },
        {
            "review_text": "this is really fun",
            "review_score": "1"
        },
        {
            "review_text": "play for funn",
            "review_score": "1"
        },
        {
            "review_text": "classic best game",
            "review_score": "1"
        },
        {
            "review_text": "coooool and awesome game! worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a must buy. If you don't care about graphics and such, this game is a gem. The community is pretty.. died. Atleast the competitive community. Anyways, this game is a must buy!",
            "review_score": "1"
        },
        {
            "review_text": "nice best game of the world &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I stil play this game today its that good, anyone who dont have this game should get it immediately!",
            "review_score": "1"
        },
        {
            "review_text": "old school game :)",
            "review_score": "1"
        },
        {
            "review_text": "Really good tactical game, balanced and very fun to play, an old but gold. Get it free by reediming Half-Life 1 retail version's code.",
            "review_score": "1"
        },
        {
            "review_text": "Very Good Game Like It :)",
            "review_score": "1"
        },
        {
            "review_text": "Addicted &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Revolutionized FPS gaming &amp; pretty much made it what it is today. Literally was the greatest FPS games back in the day.",
            "review_score": "1"
        },
        {
            "review_text": "THIS UPDATE SUCKS ON STEAM.NOT LAUNCH CS 1.6",
            "review_score": "1"
        },
        {
            "review_text": "what's wrong with counter strike ? if i want to play it's says 'couldn't load library'",
            "review_score": "1"
        },
        {
            "review_text": "Great!",
            "review_score": "1"
        },
        {
            "review_text": "This is what got me into FPS  with my pentium 3 750 mhz, 128 gb ram, geforce mx 32 mb video card...  ahhh the good old days",
            "review_score": "1"
        },
        {
            "review_text": "Great game, most time plaing this :P",
            "review_score": "1"
        },
        {
            "review_text": "i love it...awesome game...play hard go pro....:P",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Good old game , Altough its old , we still love it , and we still play it. Its counter stike :D ! Give a thumbs up if you agree with me",
            "review_score": "1"
        },
        {
            "review_text": "the best game in EU",
            "review_score": "1"
        },
        {
            "review_text": "The Classic Counter Strike , this is the old ♥♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "what can i say ? most played fps ever with a reason",
            "review_score": "1"
        },
        {
            "review_text": "Great",
            "review_score": "1"
        },
        {
            "review_text": "If i could find out how to play this game it would be awesome i click on cs and then i see a black screen and then steam main menu is there ? ",
            "review_score": "1"
        },
        {
            "review_text": "You know, I don't mind this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS of decade!",
            "review_score": "1"
        },
        {
            "review_text": "The Original FPS game for everyone!",
            "review_score": "1"
        },
        {
            "review_text": "3 Words , Old but Gold !",
            "review_score": "1"
        },
        {
            "review_text": "CS",
            "review_score": "1"
        },
        {
            "review_text": "Throwing grenade in doors will open 'em  10/10 for realistic experiance",
            "review_score": "1"
        },
        {
            "review_text": "Best game iver ever played!",
            "review_score": "1"
        },
        {
            "review_text": "Classic superb multyplayer game, But till STEAM the hot air is out. Is it the servers? the players? The stupid fan-mods? I don´t know....",
            "review_score": "1"
        },
        {
            "review_text": "bes game of the world",
            "review_score": "1"
        },
        {
            "review_text": "Jucam Un Ce Se :)? ",
            "review_score": "1"
        },
        {
            "review_text": "A clasic. Tied with Source as the best game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game))",
            "review_score": "1"
        },
        {
            "review_text": "this game is a legend! CS 1.6 For Life!",
            "review_score": "1"
        },
        {
            "review_text": "This game played a huge role in my childhood :D Still the best fps for competitive play, but unfortunately steam ruined this game with the latest updates :(",
            "review_score": "1"
        },
        {
            "review_text": "say notthing it just awesome!",
            "review_score": "1"
        },
        {
            "review_text": "The best Game In the World .",
            "review_score": "1"
        },
        {
            "review_text": "Very Nice!",
            "review_score": "1"
        },
        {
            "review_text": "aWsM :D",
            "review_score": "1"
        },
        {
            "review_text": "6 points out of 5",
            "review_score": "1"
        },
        {
            "review_text": "great game, i miss it competetively",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥k this game i love it :c",
            "review_score": "1"
        },
        {
            "review_text": "5/5",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Play hArd Go Pro ... \\m/",
            "review_score": "1"
        },
        {
            "review_text": "play hard go pro! :D",
            "review_score": "1"
        },
        {
            "review_text": "What could I say about this that hasnt been said already. Im glad I have this in my collection and 11/10 for the memories of playing this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "You just must play this game if you're fan of FPS games.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most awesome games ever to exist. I recommend it to everyone who likes FPS games.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "This is a peanut butter and jam sandwhich with the crusts still on the bread and missing the peanut butter.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game!!! Epic!",
            "review_score": "1"
        },
        {
            "review_text": "classic fps game, everyone knowing this game 'Counter-Strike' since 2000 until now this game still famous !!!",
            "review_score": "1"
        },
        {
            "review_text": "Still the game that has had it's share in building the foundation of multiplayer gameplay. Really one of the first games which demanded tactical gameplay, good aim and sometimes a bit of luck to be victorious.  Though the community is not that big anymore, you should ask yourself: 'Can you really call yourself a gamer if you haven't played counterstrike?'",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS game, its so awesome get it its totally worth it",
            "review_score": "1"
        },
        {
            "review_text": "If you need to be told what this game is, I'd prefer it if you weren't on my team in any FPS, ever.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Either everyone uses Aimbots or I really suck. Probably the second one.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good",
            "review_score": "1"
        },
        {
            "review_text": "A game of skill. Master this game and you'll be able to dominate in any other FPS games.",
            "review_score": "1"
        },
        {
            "review_text": "Get the complete pack when it's on sale and you can play some fun maps with your friends !",
            "review_score": "1"
        },
        {
            "review_text": "Old.",
            "review_score": "1"
        },
        {
            "review_text": "a very good game ",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game ever!!",
            "review_score": "1"
        },
        {
            "review_text": "Very Good game the Best!",
            "review_score": "1"
        },
        {
            "review_text": "An amazing old shooter that is really great fun with friends after you get some experience.",
            "review_score": "1"
        },
        {
            "review_text": ". ",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "da grafics r bad but dis game is still good",
            "review_score": "1"
        },
        {
            "review_text": "You can also play ping only at the beginning of a great",
            "review_score": "1"
        },
        {
            "review_text": "Classic CS (Counter-Strike) never gets old, Ka_ maps were the best game type for me, loved round after round dodging blade swings and countering with a sweet headshot, no game mode more tense than Knife Arena, getting stormed at by several opposing team members hungry for frags, using all skill and wit at a 5:1 ratio and coming out victor.. EPIC!",
            "review_score": "1"
        },
        {
            "review_text": "Good game!! Very nice!!",
            "review_score": "1"
        },
        {
            "review_text": ".....",
            "review_score": "1"
        },
        {
            "review_text": "This game is legendary HANDS DOWN",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, I'd recommand it.",
            "review_score": "1"
        },
        {
            "review_text": "The best shooter. Я отвечаю =)",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "stay alive ...",
            "review_score": "1"
        },
        {
            "review_text": "This is an old-school game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the game that really defined cooperative play. A classic that to this day is one of the most played online games ever and should be for many years to come.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most popular online Shooters!! Your Role affects your Team success and Your Team Success affects your Role!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best cs ever ^^",
            "review_score": "1"
        },
        {
            "review_text": "Good for netbooks.",
            "review_score": "1"
        },
        {
            "review_text": "I spent 10 years playing this game. What more can be said?",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best American Football game I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Great Game, Worth having in your steam account!",
            "review_score": "1"
        },
        {
            "review_text": "The original recipe of counter strike. Play it or Die!",
            "review_score": "1"
        },
        {
            "review_text": "The original Cunter Snipe! The only nonsource game actualy played by people!",
            "review_score": "1"
        },
        {
            "review_text": "The one of my favourite games of all time i played it since 2000 so it was a lot of fun for me to play if u dont have it buy it now!!  Ruined my social life too 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS OLDSQL GAME - MY BROTHER PLAYS I MORE THEN MYSELF, BUT IT WOULDNT BE BORING :P:P",
            "review_score": "1"
        },
        {
            "review_text": "For like 10 Years the No. 1 Ego-Shooter in the E-Sport Scene, Best Mod of Half-Life and (sadly) scapegoat for many killing frenzy´s. Was one of the most innovative Games that time.",
            "review_score": "1"
        },
        {
            "review_text": "Simply THE BEst :D POWAH !!!",
            "review_score": "1"
        },
        {
            "review_text": "The classic orginal that started one of the best FPS MP games of all time! This game is still really good, and a classic now, but there are not as many servers as there used to be. It is great to go back and visit though.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay: 10/10 LAN Fun: 3/3  Good Servers: 2/7  Counter-Strike, perhaps the most competitive game of it's time, hasn't aged well graphics-wise, but the gameplay remains more precise and consistent than most FPS games today. This game is a  great  LAN game for get-togethers, but otherwise you may have come too late on perhaps one of the greatest games of all time. Servers that I have connected to show that I have horrible ping, and the lag assures me of that. I have come across a server or two that I can connect to and enjoy, as well as being vanilla-CS, considering all the servers that mainly run modded games (which is about 4/5 of the servers). So here are the reasons to buy the original Counter-Strike:   Pros  -Can run on a potato -Plays smoothly no matter the settings. (However, you can connect to a server somewhere in Latin America or the Middle East, and lag like heck.) -Great fun to play with friends, as it can get really competitive, but at the same time your friends may not have this ancient gem, so this is dependent on the situation. -Solid gameplay. Nothing else really compares to the precision that went into it over the years. -Large map selection, as well as custom-maps found all over the internet. -Mods, but many are not as good as some of the others. You have to dig through garbage to find the fun ones.   Cons  -Very few good servers -Hard to convince people that don't already know how great this game is to buy it, considering it's more than a decade old. -So...many...sound...file...downloads...from...servers... -Custom maps are very rarely as balanced as maps packed in with the game.   Verdict  If you've got the money, and are curious as to what this legendary game is like, then it wouldn't be a complete waste, but if you are coming here from the latest CS or CoD or Battlefield, without having played other older FPS games, then you might regret the buy because this is a game that is quite outdated in terms of UI and such, and might not be appealing.  Overall 7/10 now, after more than a decade since release.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend playing it !",
            "review_score": "1"
        },
        {
            "review_text": "my mouse is stuck while playing counter strike i can use the arrows button only to turn left or right its only with this game , there is no problems with counter strike source or other games .. please help   thanks .",
            "review_score": "1"
        },
        {
            "review_text": "a:D",
            "review_score": "1"
        },
        {
            "review_text": "The best FPS game ever,from 1999 to now...",
            "review_score": "1"
        },
        {
            "review_text": "nice game ever",
            "review_score": "1"
        },
        {
            "review_text": "Rumored to be a CS:GO clone.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game 2358 Hours :P",
            "review_score": "1"
        },
        {
            "review_text": "game of the year 2014",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever developed.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game best multiplayer for me .... :D",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS SPARTAAAAAAAAAAAAA!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "gali pashierint cs?",
            "review_score": "1"
        },
        {
            "review_text": "SO OLDSCHOOL ONLY ♥♥♥♥♥♥S CAN UNDERSTAND THAT",
            "review_score": "1"
        },
        {
            "review_text": "1337",
            "review_score": "1"
        },
        {
            "review_text": "The best murder simulator. Trust me, I've killed 13 people.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is a 2. Best FPS. The 1. is a Half-Life",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Recomand ♥♥ :P",
            "review_score": "1"
        },
        {
            "review_text": "Legend ..... wait for it ...... dary !",
            "review_score": "1"
        },
        {
            "review_text": "..",
            "review_score": "1"
        },
        {
            "review_text": "I love this GAme More than my life :-* ",
            "review_score": "1"
        },
        {
            "review_text": "It reminds me on my good old childhood - still love it! :)",
            "review_score": "1"
        },
        {
            "review_text": "I recommend to other players its very cool.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion: CS is the best game ever made! CS 1.3 was my personal favorite update, but 1.6 is and always will be amazing. I still pub a de_dust2 server daily.",
            "review_score": "1"
        },
        {
            "review_text": "if you never played counter strike before  get ready to be scrubed on       you nub",
            "review_score": "1"
        },
        {
            "review_text": "most addictive game ever made!",
            "review_score": "1"
        },
        {
            "review_text": "play on",
            "review_score": "1"
        },
        {
            "review_text": "The Best and the Legend among MP games :) &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "CLASSIC AND A MUST HAVE GAME!!! I highly recommend this game to everyone who enjoys killing games! It a rather simple game with simple onjectives either to deactivate the bomb, kill the other players, or rescue hostages. In my opinion its worth every dollar! :D",
            "review_score": "1"
        },
        {
            "review_text": "My first love :') &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "still one of my favourtie games of all time ... :'D",
            "review_score": "1"
        },
        {
            "review_text": "Where it all started",
            "review_score": "1"
        },
        {
            "review_text": "Great game to spind late nights with. The time just flies into space and you wake up in another time the future. excelent game then and certainly is now.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the most addictive team-play based game out there.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "counter strike 1.6",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "This is game was good ten years ago...and still is",
            "review_score": "1"
        },
        {
            "review_text": "💙",
            "review_score": "1"
        },
        {
            "review_text": "This is a really awesome classic game! If anyone ever played it, she/he will never forget about it! Deservers the 8 euros, and also you will get Condition Zero!",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game since I was very young. Now, I'm still playing it. I still remember the times when I was playing with my friends on our own server; such great days back then. 11/10 without any doubt.",
            "review_score": "1"
        },
        {
            "review_text": "good game, I guess.....",
            "review_score": "1"
        },
        {
            "review_text": "Great game ,nothing can be changed !",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Its Amazing!",
            "review_score": "1"
        },
        {
            "review_text": "This game will always be my favorite counter-strike and it's a game from my younger years that I enjoyed. Not alot of people play it anymore but it's still good. I'd just get a bunch of friends to buy it and have a 5v5 lan. c: :3 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Very old game, but is still one of the best fps games ever. This is accepted as the best Counter Strike ever and I can agree. The mechanics feel great and the weapons are all very fun to use. rating 10/10  Chris",
            "review_score": "1"
        },
        {
            "review_text": "Even if this game was released in 1999, it's still one of the world's most played games! I really recommand this game, to any person who like shooter games! ;)",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "One of the most revolutionary FPS Online games ever. It's an superb FPS Team Tactical shooter game that has few different game modes with lots of great maps! Highly recommend it to other's out there that is looking for great competive challenging online gaming.",
            "review_score": "1"
        },
        {
            "review_text": "A really nice game :D",
            "review_score": "1"
        },
        {
            "review_text": "this will always be one of my favorite shooters, great fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Wohohooh",
            "review_score": "1"
        },
        {
            "review_text": "Much fun, surf, HNS, deathmatch, zombies, causal mode, Clan matches and so on! Good game! ;)",
            "review_score": "1"
        },
        {
            "review_text": "This game is legendary!!! Any online fps fan should play it.",
            "review_score": "1"
        },
        {
            "review_text": "top player ; top gamers ; old",
            "review_score": "1"
        },
        {
            "review_text": "GREAT ♥♥♥♥ GABEN! I r8 8/8 m8 its rly gr8",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game",
            "review_score": "1"
        },
        {
            "review_text": "This is my favourite game and also from my point of view the moust interesting shooter game ever made. Is best to play it with friends or with other people to test your skills.",
            "review_score": "1"
        },
        {
            "review_text": "old school game ....it was a pleasure to play it thanks valve",
            "review_score": "1"
        },
        {
            "review_text": "I know what you're thinking. 'Did he fire all 7 shots or only 6?' Well, to tell you the truth, in all this excitement, I've kinda lost track myself. But being this a .50 Desert Eagle, the most powerful handgun in the game, and it is a one-shot kill with a headshot, you've got to ask yourself one question. 'Do I feel lucky?' Well, do you, punk?",
            "review_score": "1"
        },
        {
            "review_text": "the best ever :D",
            "review_score": "1"
        },
        {
            "review_text": "Would be still fun if it werent for hackers. fun servers are goone",
            "review_score": "1"
        },
        {
            "review_text": "Decent game with low price!",
            "review_score": "1"
        },
        {
            "review_text": "*Enter server* *Killing a child (admin)* *Get permanent banned* Nailed it.  10/10 Gr8 m8 i r8 8/8.",
            "review_score": "1"
        },
        {
            "review_text": "The game of the games",
            "review_score": "1"
        },
        {
            "review_text": "Fun old shooter",
            "review_score": "1"
        },
        {
            "review_text": "Best shooter ever! Better than CoD! 'Cuz you don't need perks or upgrades or killstreaks! JUST YOUR SKILLZ!",
            "review_score": "1"
        },
        {
            "review_text": "Still the 5th best games evar and still better than Call Of Doody!",
            "review_score": "1"
        },
        {
            "review_text": "I shoot the guns.",
            "review_score": "1"
        },
        {
            "review_text": "The BEST FPS Game to get addicted with &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Where it all began!",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing this game a LOT 10+ yrs ago and it is still being played today, not as much as the current CS GO and not as much as back then, but it has stood the test of time none the less.",
            "review_score": "1"
        },
        {
            "review_text": "4 years .. one game -_-",
            "review_score": "1"
        },
        {
            "review_text": "actually this was a good game back in 2011 i played this a lot and i love this",
            "review_score": "1"
        },
        {
            "review_text": "My childhood is here  ALL of it &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "i think this game is one of the best games what ever coded in the written history",
            "review_score": "1"
        },
        {
            "review_text": "Polecam fr2ps.",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game once. It looks like minecraft o.o",
            "review_score": "1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "Who likes getting rekt at video games?  This is the game for you :D",
            "review_score": "1"
        },
        {
            "review_text": "Legend game&gt;love this",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold!",
            "review_score": "1"
        },
        {
            "review_text": "Install CS 1.6 now: Go back to the glory days when the game wasn't a trading and gambling arena with a shooting mingame attached!",
            "review_score": "1"
        },
        {
            "review_text": "I recomemend Counter-Strike 1.6 and my servers if you are from sweden you can get admin from 10 kr - 20 kr.",
            "review_score": "1"
        },
        {
            "review_text": "Played Csgo for 800 hours, decided to play cs 1.6 and gets wallbanged almost every round. Decided to quit cause of 'hackers'. Watches youtube and see's that mostly every map is wallbangable and deletes the game. 11/10 would Wallbanged again.",
            "review_score": "1"
        },
        {
            "review_text": "CS",
            "review_score": "1"
        },
        {
            "review_text": "A very good game i love it. this games proves that graphics doesnt matter.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is Just Awsome..",
            "review_score": "1"
        },
        {
            "review_text": "This is a classic! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game",
            "review_score": "1"
        },
        {
            "review_text": "Nice game ;]",
            "review_score": "1"
        },
        {
            "review_text": "If you're on Steam and you haven't played, or own this game, just kill yourself.",
            "review_score": "1"
        },
        {
            "review_text": "beast game eva",
            "review_score": "1"
        },
        {
            "review_text": "Game is good for any lower spec PCs, but may have a little lag. Overall a decent game.",
            "review_score": "1"
        },
        {
            "review_text": "it is my ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "nice skill-based game, i recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Hands Down. It's Counter-Strike the GOD DAMN SEXY Half-Life Mod. No Other-Mods that makes HL into an AWESOME Multiplayer FPS Game. Introducing Bomb and Defuse , Hostage , etc.   Pros :  - Gameplay is Fun!  - A Hell lot of Server  - Large Community ( did i said large. i mean ♥♥♥♥ing huge )  Cons :  - The Steam Version doesn't have Bots ( except cs:cz ) ",
            "review_score": "1"
        },
        {
            "review_text": "never gets bored of this game :)",
            "review_score": "1"
        },
        {
            "review_text": "CS",
            "review_score": "1"
        },
        {
            "review_text": "Best for the Best!!",
            "review_score": "1"
        },
        {
            "review_text": "!",
            "review_score": "1"
        },
        {
            "review_text": "It is one of the best FPS game available online. Even today its craze has not ended. From a NaVi player i heard that steam version provides very low lag due to which i purchased the game and for sure i was 100% satisfied. You would not believe my ping dropped to 19~21 from 200~1500.",
            "review_score": "1"
        },
        {
            "review_text": "What a GAME!!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Better than csgo, 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing shooter!!! it would definitely be in my top 10 shooter games of all time",
            "review_score": "1"
        },
        {
            "review_text": "This game are best VERY BEST's !!!! 2001. Oh yeah, 1992 1.5 &lt;3  Like GAME &lt;3 !!!",
            "review_score": "1"
        },
        {
            "review_text": "Play the original that started it all. complete with no skin no crates no keys and a whole lot of nostalgia!",
            "review_score": "1"
        },
        {
            "review_text": "the good old days",
            "review_score": "1"
        },
        {
            "review_text": "This is the game that got me into CS and furthered my career in this game lovd it from the start and enjoying every minute of it! If your on CSS come and join me on the Australian DTK ( Dying To Kill) Servers, i am an admin on De_dust 2 deathmatch! looking forward to kicking some ♥♥♥ with you! mwhahah",
            "review_score": "1"
        },
        {
            "review_text": "Good enough for FUN. BEsides that try Global Offensive.",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "Yes I very recomand this game !!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game of all the CS games. The only downside is that it is an outdated game, and it's not really worth getting into it now. If you're barely getting into Counter-Strike, then just go for Global Offensive, it's the better choice for the new players.",
            "review_score": "1"
        },
        {
            "review_text": "it's like sex for the first time",
            "review_score": "1"
        },
        {
            "review_text": "game of all time.Old woman cs 1.6",
            "review_score": "1"
        },
        {
            "review_text": ":",
            "review_score": "1"
        },
        {
            "review_text": "1",
            "review_score": "1"
        },
        {
            "review_text": "how could one not like this",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike is everything forever =) Play with your friends,win,and have fun!",
            "review_score": "1"
        },
        {
            "review_text": "582",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the world :)",
            "review_score": "1"
        },
        {
            "review_text": "old school , old game , recomaneded !",
            "review_score": "1"
        },
        {
            "review_text": "ALL-TIME FAV",
            "review_score": "1"
        },
        {
            "review_text": "That's the best gamer ever and over 10 years the 1!",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike 1.6 Never die! The Best game in the WORLD!",
            "review_score": "1"
        },
        {
            "review_text": "Game of the Gods =)",
            "review_score": "1"
        },
        {
            "review_text": "(:",
            "review_score": "1"
        },
        {
            "review_text": "So much fun. Cant explain. Thats why i`ll stop the review here. Ty",
            "review_score": "1"
        },
        {
            "review_text": "The most amazing game i have ever played in my life. WORTH PLAYING!",
            "review_score": "1"
        },
        {
            "review_text": "twas teh game",
            "review_score": "1"
        },
        {
            "review_text": "deathmach",
            "review_score": "1"
        },
        {
            "review_text": "The good one, without screaming scrubs like in CS-GO",
            "review_score": "1"
        },
        {
            "review_text": "+++++++++",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "It's a classic. ",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Only one word..INSANE!",
            "review_score": "1"
        },
        {
            "review_text": "Back in the early days of steam, this was litrally the only game I owned.. I sunk my life into it.",
            "review_score": "1"
        },
        {
            "review_text": "Spent way over a thousand hours in this game back in the day. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This Game is GOOD",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold",
            "review_score": "1"
        },
        {
            "review_text": "Its classic",
            "review_score": "1"
        },
        {
            "review_text": "best game ever even it's graphics are low as compared to now. &lt;3 1.6",
            "review_score": "1"
        },
        {
            "review_text": "Even after all these years still sort of fun, when you look past all of the insta-killers and quickscopers and the large community of hackers.   ",
            "review_score": "1"
        },
        {
            "review_text": "CS 1.6 will outlive CS:GO. Or any other game, for that matter :)",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": " Joins server. Joins Counter-Terrorists  'Oh finally a classic server I can play on'.  Group of Spanish talking players starts yelling at me. Gets banned permanently  'Amazing'  11/10 - Best game experience ever. If you don't speak Spanish, it's going to be a rough time.",
            "review_score": "1"
        },
        {
            "review_text": "The memories :)",
            "review_score": "1"
        },
        {
            "review_text": "i love the game but there is alot of people that dont speak english which sucks if you dont speak other languages but english dont talk :)",
            "review_score": "1"
        },
        {
            "review_text": "awsome game",
            "review_score": "1"
        },
        {
            "review_text": "If you havent played Counter Strike you're not a gamer!",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game, i am playing this game since i was 7 years old. Yup it's quite old but gameplay with friends make this game really special. !!!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ shield.",
            "review_score": "1"
        },
        {
            "review_text": "Low fps but legendary! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Ruined my life playing this game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The game.",
            "review_score": "1"
        },
        {
            "review_text": "Two words for this game - F*cking awesome.   Been playing this game for almost 3 years and never got bored out of it. Every single day I learnt more &amp; more about the game, and still learning. This game way grips you with simple yet effective gameplay, which you will hardly or rarely find in any FPS games nowadays.  This game is the Father of all CS versions. If you are a CS:GO player and haven't played CS 1.6, then you are missing the most amazing thing.   TRY IT &amp; GET ADDICTED!",
            "review_score": "1"
        },
        {
            "review_text": "It's ok, I guess ..",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the best shooter ever made. Completely balanced and not tampered with.",
            "review_score": "1"
        },
        {
            "review_text": "who hate this game?!",
            "review_score": "1"
        },
        {
            "review_text": "It is Counter-Strike, of course it's good.",
            "review_score": "1"
        },
        {
            "review_text": "When you play CS:GO and then you remember the GoldSrc engine and the sprays... I think a flashlight too.  Then you realize - Everyone on 1.6 will most likely kick your ♥♥♥ no matter how good your rig is. Get it if you like getting your ♥♥♥ beat by people you will assume are hackers (when they're usually not) or have a crappy computer and want to get good at FPS's.",
            "review_score": "1"
        },
        {
            "review_text": "A game that still exist after 15 years, what else do you need?",
            "review_score": "1"
        },
        {
            "review_text": "Just Awesome  ",
            "review_score": "1"
        },
        {
            "review_text": "Best shooter game ever",
            "review_score": "1"
        },
        {
            "review_text": "Game of the millenium &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Most played multiplayer game !",
            "review_score": "1"
        },
        {
            "review_text": "The Best Steam Game of all Time!",
            "review_score": "1"
        },
        {
            "review_text": "Well the best childhood game! Feels nostalgia when I play. Its been 5 years since last time I played this. From past six months I've been playing. But recently purchased! LOL  ",
            "review_score": "1"
        },
        {
            "review_text": "FAVORITE GAME!",
            "review_score": "1"
        },
        {
            "review_text": "It's like pleasuring a woman with your hand, your fingers get tired, your wrist starts to hurt but you just have to keep going.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Recommended",
            "review_score": "1"
        },
        {
            "review_text": "it's really cool game! u can be one of ten pimps and have a big disco club!",
            "review_score": "1"
        },
        {
            "review_text": "Being a player only thing I can say is.. 'RESPECT' Go hell with Far Cry or GTA or Even any FPS . CS 1.6 RoxXxX.... \\o/",
            "review_score": "1"
        },
        {
            "review_text": "the original is still the best. if you think your good at shooters. play with the veterans of this game and they will school you so hard you will want to put you fist through your screen. but like a martial arts master they will teach you the ways and you will eventually become more then you could have possibly imagine.",
            "review_score": "1"
        },
        {
            "review_text": "A Legendary FPS Game!!! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Nothing can beat the original, except for being dead.  I want ye glorious days of olde to come back.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game",
            "review_score": "1"
        },
        {
            "review_text": "Great!",
            "review_score": "1"
        },
        {
            "review_text": "Great game gg",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Best in Steam series cs games. Wish valve would go back to 1.5 days",
            "review_score": "1"
        },
        {
            "review_text": "CS:GO without the :GO.  10/10 would try to play it but then remember I own csgo and play that instead again",
            "review_score": "1"
        },
        {
            "review_text": "Ya good old classic",
            "review_score": "1"
        },
        {
            "review_text": "Good Game!!! Old but good!",
            "review_score": "1"
        },
        {
            "review_text": "Addicted !",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game Ever!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Top notch game",
            "review_score": "1"
        },
        {
            "review_text": "classic. :]",
            "review_score": "1"
        },
        {
            "review_text": "^^",
            "review_score": "1"
        },
        {
            "review_text": "Still better than CS:GO.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game , i recommended this game !!",
            "review_score": "1"
        },
        {
            "review_text": "A OVO TE RADI, NE DA TI MIRA !",
            "review_score": "1"
        },
        {
            "review_text": "Classic great game still fun to play",
            "review_score": "1"
        },
        {
            "review_text": "CS 1.6",
            "review_score": "1"
        },
        {
            "review_text": "10/10 will bang this game",
            "review_score": "1"
        },
        {
            "review_text": "true legendary game, still on the cutting edge of the scene.",
            "review_score": "1"
        },
        {
            "review_text": "old school",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "good game infested with hackers",
            "review_score": "1"
        },
        {
            "review_text": "its ok",
            "review_score": "1"
        },
        {
            "review_text": "Gaming has its own classics. Oldschool!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game :D ",
            "review_score": "1"
        },
        {
            "review_text": "Best of the FPS genre.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like games that don't lag? Do you like games without fps drop? Do you like games with flawless movement? Do you like games you can run on low end PC's? Do you like games were you actually can hear footsteps? Do you like Heaton?  Then this is for you! Easy to learn, hard to master.",
            "review_score": "1"
        },
        {
            "review_text": "Help me i have cs 1.6 steam but i'm playing like a noob i play better with non steam  what's happening PLZ HELP",
            "review_score": "1"
        },
        {
            "review_text": "111111111",
            "review_score": "1"
        },
        {
            "review_text": "play this end go hard lvl  ",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold :)",
            "review_score": "1"
        },
        {
            "review_text": "if you heared this game, you will be agree with me .. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice game!",
            "review_score": "1"
        },
        {
            "review_text": "  Good shooting game :D",
            "review_score": "1"
        },
        {
            "review_text": "how to download the skins and models???",
            "review_score": "1"
        },
        {
            "review_text": "my second best game",
            "review_score": "1"
        },
        {
            "review_text": "  CS",
            "review_score": "1"
        },
        {
            "review_text": "Best fps game of all time!",
            "review_score": "1"
        },
        {
            "review_text": "More content. Custom content. Casual content. Less chance-to-be-kicked content. Modded servers content.  Less graphics content. Who cares?  Buy this and a couple of new keyboards, just a recommendation.   You can run this on fruit for a computer.",
            "review_score": "1"
        },
        {
            "review_text": "its good game",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would play for life.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay holds up great 16 years after release, and can run on a potato.   10/10 would fire in the hole again",
            "review_score": "1"
        },
        {
            "review_text": "bots",
            "review_score": "1"
        },
        {
            "review_text": "  Perfect!",
            "review_score": "1"
        },
        {
            "review_text": "Best fps game 2016",
            "review_score": "1"
        },
        {
            "review_text": "Not old at all",
            "review_score": "1"
        },
        {
            "review_text": "  Nice game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "all my playtime is from windows pc. Bought mac and there is no menu on there :/ so i can play, but i cant see whats on scoreboard etc, only console DOES work, nothing else. Game runs fine, but there is no hud at all :/  +classic counter strike + you know this is good game :D  - no optimalisation on mac ;/   6/10, would be 9/10 if there was an optimalisation on macs, but there isnt",
            "review_score": "1"
        },
        {
            "review_text": "spent almost 4000 hours playing the bootleg version of CS1.6 since I was 13. Now I can finally afford it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "-Join a server -Gets wallbanged -Loses round  -Wallbangs someone on the next round -Gets accused of hacking -Gets kicked -No 7-day cooldown 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Well since a friend made a review of this game for me and just put 'game Succs' I now have to give a proper review  Counter-strike well Is Counter-Strike it's now too diffrent for me to play it anymore ever since CS:GO and thats fine it shows that this game had great roots! I can't review too much since I havent Played this game in years making any recalling fuzzy and inaccurate. If you are new to the franchise it's kinda hard to start here since time hasn't been on it's side I'd Say Play CS:GO for awhile then this but if it's someone who has played plenty of CS:S and CS:GO then why not complete the whole Trio!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game...!!! all time ever best lan play",
            "review_score": "1"
        },
        {
            "review_text": "Pro Player ( . Y . )",
            "review_score": "1"
        },
        {
            "review_text": "Since 2001 my favorite FPS game! Started to play in CS 1.5 and still addicted these days! Played so much time in LAN houses before getting on Steam. JUST CLASSIC!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 please keep this game alive.",
            "review_score": "1"
        },
        {
            "review_text": "CS 1.0-1.6 (2000-2009): 4000+ hours",
            "review_score": "1"
        },
        {
            "review_text": "kept me sane when my pc died and i only had a dinosaur",
            "review_score": "1"
        },
        {
            "review_text": "  Back to school !",
            "review_score": "1"
        },
        {
            "review_text": "The game that spawned numerous Counter-Strike 'clones' since its release. Still entertaining after all these years.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely in love with this game.. Playing since 2008 with over 3k hours on second acc and some hours here as well. Old but gold , same as CS:GO these games have a special place in my heart.",
            "review_score": "1"
        },
        {
            "review_text": "An intense game when playing online! i suck at this game :(",
            "review_score": "1"
        },
        {
            "review_text": "Very good old school game",
            "review_score": "1"
        },
        {
            "review_text": "ahhh old times is great times... I love this game &lt;3 brings back memories :D",
            "review_score": "1"
        },
        {
            "review_text": "Old times Good times",
            "review_score": "1"
        },
        {
            "review_text": "I love cs 1.6",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game need ♥♥♥♥in fix !!!! every time i click on a key it sends me to other server or reopen the server",
            "review_score": "-1"
        },
        {
            "review_text": "Classic.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely Amazing Game . It has the proper amount of violence , bloodshed and effects a gamer wants and expects . MustPlay , Highly Recommended",
            "review_score": "1"
        },
        {
            "review_text": "The GOAT",
            "review_score": "1"
        },
        {
            "review_text": "it's was and still no. 1 online game",
            "review_score": "1"
        },
        {
            "review_text": "Nice game its very old but i think it is a good game still!",
            "review_score": "1"
        },
        {
            "review_text": "  One of the best fps ever",
            "review_score": "1"
        },
        {
            "review_text": "Original game but it doesn't have AI . it's modern game  Another version of its. ",
            "review_score": "1"
        },
        {
            "review_text": "You better not hope coming back outside once playing this game, your just going to want more of it each time  Why you should buy it after all these years:  . The Orginal Counter Strike . Gameplay over Graphics . Awesome mods . Doesnt have a nurfed Deagle :P . Still has the 2 guns that got removed which are the MP5 and the M4 that could be silenced and not at the same time with 30 bullets :D . Overall the best counter strike in the series",
            "review_score": "1"
        },
        {
            "review_text": "10/10.",
            "review_score": "1"
        },
        {
            "review_text": "C U N T E R S T R O K E",
            "review_score": "1"
        },
        {
            "review_text": "Super cool old school game :)",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Best Multiplayer FPS of all time",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "The best counter strike I've ever played. The original FPS shooter is still pretty good, and fun to play.  L4KESIDE.",
            "review_score": "1"
        },
        {
            "review_text": "How much time will be this game alive for god sake ? =))",
            "review_score": "1"
        },
        {
            "review_text": "If you ever get bored of cs go, just hop on the older version to be attacked by Chinese people instead of Russians.",
            "review_score": "1"
        },
        {
            "review_text": "1337",
            "review_score": "1"
        },
        {
            "review_text": "Cool game no comments !",
            "review_score": "1"
        },
        {
            "review_text": "100/100",
            "review_score": "1"
        },
        {
            "review_text": "    The best game I have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game for 10+ years now and it's still a damn good time. Took a break for a while, but coming back to it like nothing has changed ( except the graphics and a few perks) makes it that much more fun. Keep it up Valve.",
            "review_score": "1"
        },
        {
            "review_text": "ty for this game",
            "review_score": "1"
        },
        {
            "review_text": "   Pluses :  nostalgia, simple gameplay.    Minuses :  graphics of ten-year prescription.    Game Counter Strike is recommended who missed game clubs and the school and student's days spent to us! ",
            "review_score": "1"
        },
        {
            "review_text": "Was, still is and always will be the best online FPS game ever!",
            "review_score": "1"
        },
        {
            "review_text": "cs 1.6 forever",
            "review_score": "1"
        },
        {
            "review_text": "Hello  When i start to play Counter-Strike, especially Cs 1.6 i like it because you can modify what you want in the server interface. I don't realy like the game from the begining, in time i start to like even the game. It is the most simple game to play ever exist. It is nice.  Thanks.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game!",
            "review_score": "1"
        },
        {
            "review_text": "great classic game!",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever my childhood depends on this :D",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most played PC fps game ever? Even if I am wrong this one can't be forgotten with it's groundbreaking popularity and playstyle which I dont think any other fps has really come close to get this good. Since we're now 17 years after the release it might sound a bit meh to get but there are some fun servers and the game is absolutely not dead.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "Nice Game but more hackers valve please new update",
            "review_score": "1"
        },
        {
            "review_text": "Clasics never die, still play to this day! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "the best",
            "review_score": "1"
        },
        {
            "review_text": "This is used to be my love &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Weird playing cs after csgo lol makes me remember the good old days",
            "review_score": "1"
        },
        {
            "review_text": "  its a very good game",
            "review_score": "1"
        },
        {
            "review_text": "Everyone needs to play this game...and lose to Mugatu",
            "review_score": "1"
        },
        {
            "review_text": "One Of The Best Game I have come through. Really awesome",
            "review_score": "1"
        },
        {
            "review_text": "The start of it all!! Take me back to the days of 1.5 and 1.6!! So much fun!",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS game ive ever played!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is where 'eSports' started",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever",
            "review_score": "1"
        },
        {
            "review_text": "Fire in the Hole Simulator 2016",
            "review_score": "1"
        },
        {
            "review_text": "  ♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Best Game of the Cs series without a doubt. Great communities Such as m3 has over 1000 maps. SO MANY custom maps and they're still making them. No cancerous kids just adults/ 16-19 yr olds playing. Best game in the series by far 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "great game!",
            "review_score": "1"
        },
        {
            "review_text": "The is actually great in every point like tactical, teamplay, individual skill, movement. But after the year go by the game more and more got into a slump and they started to nerf the game in any points. Spraydowns, tapping and else",
            "review_score": "1"
        },
        {
            "review_text": "The best fps game ever !!!",
            "review_score": "1"
        },
        {
            "review_text": "Best 'Fire In the Hole' Simlulator of the Year",
            "review_score": "1"
        },
        {
            "review_text": "10000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000/10 IGN its the best game in the world",
            "review_score": "1"
        },
        {
            "review_text": "The only game I havent maxxed out my moms credit card(s) in!",
            "review_score": "1"
        },
        {
            "review_text": "‌‌‌",
            "review_score": "1"
        },
        {
            "review_text": "  ....",
            "review_score": "1"
        },
        {
            "review_text": " Old but gold ;)   ",
            "review_score": "1"
        },
        {
            "review_text": "  3213",
            "review_score": "1"
        },
        {
            "review_text": "classic :]",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks but the guys in the menu is hot sso it will recieve 10/10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "Where it all started... I haven't played this game too much myself but I can definitely recommend it because it's such an original game and it's a MUST HAVE.",
            "review_score": "1"
        },
        {
            "review_text": "got counterstrike 1.6 in my steam games pack  i was like OMG IM OLDSCHOOL 1.6 FTW!  i played  ♥♥♥♥ the textures the game is awesome  wait servers?  meet like 5 hackers  returned to cs:go and never played cs 1.6 again  would buy again 9/11 like the game.  ",
            "review_score": "1"
        },
        {
            "review_text": "If your looking for a review on this game you've come to the wrong place, but if your looking for an outstanding pie recipe you've come to the right place.  Ingredients: 1. 6 tablespoons unsalted butter 2. 1/2 cup white sugar 3. 1/2 cup brown sugar 4. 1/4 cup water 5. 1/4 teaspoon cinnamon 6. 1 pinch salt 7. 5 apples - peeled, cored and sliced 8. 1 pastry for double-crust pie   Directions: 1. Preheat oven to 425 degrees F (220 degrees C). 2. Combine butter, white sugar, brown sugar, water, cinnamon, and salt in a saucepan over medium heat. Bring to a boil, remove from heat and set aside. 3. Roll out half the pastry to fit a 9-inch pie plate. Place bottom crust in pie plate; pour in apple slices. 4. Roll out top crust into a 10-inch circle. Cut into 8 (1-inch) wide strips with a sharp paring knife or pastry wheel. Weave the pastry strips, one at a time, into a lattice pattern. Fold the ends of the lattice strips under the edge of the bottom crust and crimp to seal. 5. Pour butter-sugar mixture over top of pie, coating the lattice, and allowing any remaining sauce to drizzle through the crust. 6. Bake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake until the crust is golden brown, the caramel on the top crust is set, and the apple filling is bubbling, 35 to 40 more minutes. Allow to cool completely before slicing.",
            "review_score": "1"
        },
        {
            "review_text": "Back in 2000, this was homework for me. 10/10 would go into the net cafe to do homework research again.",
            "review_score": "1"
        },
        {
            "review_text": "Counter-Strike, oh Counter-Strike... so, so many hours of playing 1.6 back in high school, getting on the local campus server and playing de_dust, cs_office, de_aztec adn so many more, my first 'modern' FPS. While it has had enhancements of Source and GO, the core CS remains a tight, amazing game with plenty of players. Well-balanced weapons, well-designed maps, no real skill cap, if you need a great multiplayer FPS experience that can run on almost any piece of hardware (I ran this on my Pentium 4 with integrated graphics and 512 MB RAM back in 2004!), then this is for you. My only real complaints is that I do like a single player campaign (though to be fair this is a Half-Life mod), and nowadays you really do need to be excellent to do well!  8.7/10",
            "review_score": "1"
        },
        {
            "review_text": "THIS LEGENDARY GAME IS MY CHILDHOOD!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I had vac ban plz remove this",
            "review_score": "1"
        },
        {
            "review_text": "recommended",
            "review_score": "1"
        },
        {
            "review_text": "Great😉",
            "review_score": "1"
        },
        {
            "review_text": "‌",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game!!! no explaination needed !! &lt;3 ",
            "review_score": "1"
        },
        {
            "review_text": "Count the strikes, 1.6",
            "review_score": "1"
        },
        {
            "review_text": "This game is much more popular in Georgia than another one &lt;3 eXtrem",
            "review_score": "1"
        },
        {
            "review_text": "600+ hours enjoyed every bit now i play cs go   7/10 got bored of it, plus alot of the servers are dead",
            "review_score": "1"
        },
        {
            "review_text": "Its great!",
            "review_score": "1"
        },
        {
            "review_text": "Well that's a fantastic game to play, reminded me the old good days when I was a little kid. Worth to buy!",
            "review_score": "1"
        },
        {
            "review_text": "Still better than the glove cancer.",
            "review_score": "1"
        },
        {
            "review_text": "Its old but still in heart :)",
            "review_score": "1"
        },
        {
            "review_text": "  My friend gifted me this because we are hardcore CS:GO fans. So i started playing this and i was obssesed. This is sooo good, i can say it's better than CS:GO gameplay wise.  Playing is easier than GO and it seemed i'm Global Elite within 1 hour. Definitly buy it, great value for the money you pay! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Started playing this game non steam from 9 years ago Now I don't even thanks to the hax",
            "review_score": "1"
        },
        {
            "review_text": "~",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is COOL",
            "review_score": "1"
        },
        {
            "review_text": "Old game but still good",
            "review_score": "1"
        },
        {
            "review_text": "  This is one of the best multiplayer shooter of all times! Definitely better than CSGO!",
            "review_score": "1"
        },
        {
            "review_text": "the best counter strike out there",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold",
            "review_score": "1"
        },
        {
            "review_text": "  Didn't played much.",
            "review_score": "1"
        },
        {
            "review_text": "Steel played",
            "review_score": "1"
        },
        {
            "review_text": "18-June-2016 !  Counter_strike is now 17 years OLD ! 17 years !!!!!  OMG !",
            "review_score": "1"
        },
        {
            "review_text": "  With the advent of CS: GO intr`un ruined everything incredibly unpleasant ... and know when it appeared all CS Source scorned but if I look better now and compare it to CS Source CS: GO was well ... 1000 times Source CS now cool to be in this ♥♥♥♥ instead of the CS: GO ...  The Valve have been very foolish when they pulled CS: GO instead of doing eg CS 1.7 ... and great contests just ... pulled CS 1.6 and CS have shoved GO ... including PGL ( Romanian competition) and now what has become of them now? As I looked a few days now and prizes were ITEM game when the time CS 1.6 were like $ 1000 + products ... Well I think that would gather several clans CS 1.6 ...  A total disaster ... in Romania do not think that there are clans of CS: GO as they were before TeG CS 1.6 and the rest of ... everything is dead ... we are worse than in 1999 on a national / world .. . 0 barred. And do not think that would matter ... eventually I get if I'll do any MILLIONAIRE competitions CS 1.6 ... putty that sign four teams and play VS 'gunmen West' instead of all TeG it's better than playing CS: GO ...",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME ",
            "review_score": "1"
        },
        {
            "review_text": "hello itsme",
            "review_score": "1"
        },
        {
            "review_text": "THE BEST GAME EVER!!! IT NEVER GETS OLD!!!",
            "review_score": "1"
        },
        {
            "review_text": "bestofthebest",
            "review_score": "1"
        },
        {
            "review_text": "The best game of the series",
            "review_score": "1"
        },
        {
            "review_text": "Classic.",
            "review_score": "1"
        },
        {
            "review_text": "Its very fun! ",
            "review_score": "1"
        },
        {
            "review_text": "    Back in my day!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my first and favourite FPS. I've spent a lot of time of my life on this game, and I dont regret it. Counter Strike 1.6 is the real Counter Strike, even if the future goes on, 1.6 will remain unique. Beyond frags, kills, fun with friends and mods, I love this game mainly because of old memories.",
            "review_score": "1"
        },
        {
            "review_text": "Well, just a game of my childhood, my presence and my future. Love it",
            "review_score": "1"
        },
        {
            "review_text": "#thebest",
            "review_score": "1"
        },
        {
            "review_text": "You can do anything you want in this game, would recomment hide n seek!",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "A stone age game as some people might call it but it still lives on as one of the most popular competitive fps games out there.With a community nearly as vast as its counterpart Counter Strike Global Offensive this title packs a punch! Go for it :D",
            "review_score": "1"
        },
        {
            "review_text": "  Good gmae for Kids ",
            "review_score": "1"
        },
        {
            "review_text": "Loved dis game",
            "review_score": "1"
        },
        {
            "review_text": "When I first played this game it was like: WHAT THE ♥♥♥♥ IS GOING ON!?!? DID THAT GUY JUST HAXXX!?!? Now it's like: Mkay  420/69 CS:GO is still my favourite ",
            "review_score": "1"
        },
        {
            "review_text": "This game alwayse in my heart",
            "review_score": "1"
        },
        {
            "review_text": "i shoot at man. he expire.",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS game in the world!",
            "review_score": "1"
        },
        {
            "review_text": "I had High FPS Models installed,these models were looks like in minecraft.Also there's better hitboxes",
            "review_score": "1"
        },
        {
            "review_text": "  still playing in 2k16",
            "review_score": "1"
        },
        {
            "review_text": "The original and best game in the series",
            "review_score": "1"
        },
        {
            "review_text": "It's just THE game",
            "review_score": "1"
        },
        {
            "review_text": "Classic! There are better multiplayer shooters nowadays, but this brings memories of long hours playing with friends,",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best game of all times! :)",
            "review_score": "1"
        },
        {
            "review_text": "The original remains the best. Countless of hours was poured into it pre-Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Feels good to play the old CS",
            "review_score": "1"
        },
        {
            "review_text": "It's just THE game",
            "review_score": "1"
        },
        {
            "review_text": "17 years old and still going strong",
            "review_score": "1"
        },
        {
            "review_text": "Best secong game ever",
            "review_score": "1"
        },
        {
            "review_text": "It's a simple game that you can play great with your friends and others. Even if is an old game is still playable and you can't get enough of him and you won't stop playing it from the time you will began!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the only reason I got steam. The WON servers went down and we were forced to migrate - that's why I was a week late getting steam; ddint get it til I had to. I've been on steam for 13 years and it's all because of this game. I wish steam would have kept track of hours back then - I would have several thousand.",
            "review_score": "1"
        },
        {
            "review_text": "Best Cs All of Time",
            "review_score": "1"
        },
        {
            "review_text": "  @@@@@@@@@@@@@@@@@",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold!",
            "review_score": "1"
        },
        {
            "review_text": "  Good game is pro comunitty!",
            "review_score": "1"
        },
        {
            "review_text": "why i can't play Counter Strike with the BOT in offline mode?, please help me.",
            "review_score": "1"
        },
        {
            "review_text": "Just For Level :)",
            "review_score": "1"
        },
        {
            "review_text": "Life is one, but Counter is 1.6",
            "review_score": "1"
        },
        {
            "review_text": "This is where the online team-based FPS all started.",
            "review_score": "1"
        },
        {
            "review_text": "it an old game, but it's FUN!",
            "review_score": "1"
        },
        {
            "review_text": "For me, the best FPS game made ever :D",
            "review_score": "1"
        },
        {
            "review_text": "i feel its first legendary eSports series fps",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for the 'Just 5 more minutes' award",
            "review_score": "1"
        },
        {
            "review_text": "LAN-Party favorite",
            "review_score": "1"
        },
        {
            "review_text": "'The' FPS multiplayer game",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game, 2016 and this game is still alive!",
            "review_score": "1"
        },
        {
            "review_text": "Legendary.",
            "review_score": "1"
        },
        {
            "review_text": "XD this game is ♥♥♥♥ed",
            "review_score": "1"
        },
        {
            "review_text": "Makes me wish that I could go back to 2008 :'( rip 1.6 nvr 4get     ",
            "review_score": "1"
        },
        {
            "review_text": "Very Addictive",
            "review_score": "1"
        },
        {
            "review_text": "Still the best game ever !!!",
            "review_score": "1"
        },
        {
            "review_text": "Best of the best!",
            "review_score": "1"
        },
        {
            "review_text": "Best childhood game ever. Every kid should play this ♥♥♥♥ before they plei cs pajehale",
            "review_score": "1"
        },
        {
            "review_text": "The Best for Ever",
            "review_score": "1"
        },
        {
            "review_text": "Best Game from 2005 year",
            "review_score": "1"
        },
        {
            "review_text": "This game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing. Never gets old.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Game :D",
            "review_score": "1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold :D",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS online game ever. Gameplay is so challenging and addictive that you just can't keep yourself from playing it. Hard game for a beginner because shooting requires a lot of skill but it is very enjoyable moment when you pop a headshot and kill a better player and maybe even win the round with that one. In most of the cases it's pure luck speaking but hey, who cares. At least you made a headshot and had a one round of glory!  Only downside is the server list, which is hijacked and showing fake servers. Use gametracker or other sites like that to see the real servers. Valve should do something to this but it's been going on for years so I guess it's not gonna happen in near future.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "The origin of 'How to spend all of your free time in internet caffee' era.",
            "review_score": "1"
        },
        {
            "review_text": "Goood game. Old but gold",
            "review_score": "1"
        },
        {
            "review_text": "I firstly played this game when I was 9. Now Counter-Strike is my lover.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just amazing it got's a big history behind it i recoment checking it out get ur friends and have fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game fps &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Classics...Classics never die.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best FPS games",
            "review_score": "1"
        },
        {
            "review_text": "My first ever played CS ",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "Better that Csgo Galen can't steal our money",
            "review_score": "1"
        },
        {
            "review_text": "Am i the only one that still plays this and has this game on steam?",
            "review_score": "1"
        },
        {
            "review_text": ";)",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game i love it",
            "review_score": "1"
        },
        {
            "review_text": "The original and the best one.",
            "review_score": "1"
        },
        {
            "review_text": "it is fun",
            "review_score": "1"
        },
        {
            "review_text": "The experience on this game is huge ... it's a big diference between Counter-Strike Global Offensive versus Cs 1.6  The good old memories when we has kids :)) But the hackers are so easy to clear up like an admin... :) A good old game deserv a good review :)",
            "review_score": "1"
        },
        {
            "review_text": "The original and the best one.",
            "review_score": "1"
        },
        {
            "review_text": "To crush the sham of life with gun. To annotate the essence of life with friendship.",
            "review_score": "1"
        },
        {
            "review_text": "cool game, cool time",
            "review_score": "1"
        },
        {
            "review_text": "The game which is still loved by everybody :) !",
            "review_score": "1"
        },
        {
            "review_text": "The best.",
            "review_score": "1"
        },
        {
            "review_text": "  best cs",
            "review_score": "1"
        },
        {
            "review_text": "Basic version of Counter Strik , from where it all started.One of the Best FPS game ever created It has been more than 16 years since the intial launch of this game but people still play it. You must play this game if you like FPS games",
            "review_score": "1"
        },
        {
            "review_text": "Classic game. Feels bland compared to todays content filled games but nostalgic",
            "review_score": "1"
        },
        {
            "review_text": "I hate bunnyscripting guys but its cool",
            "review_score": "1"
        },
        {
            "review_text": "the best game of the entire series",
            "review_score": "1"
        },
        {
            "review_text": "  .",
            "review_score": "1"
        },
        {
            "review_text": "the best game of the entire series",
            "review_score": "1"
        },
        {
            "review_text": "Good old school game. Some cheaters though which admins on servers need to watch for. Lots of servers still up to play in.  FPS, buy guns and complete objective.  Can become repetitive and boring.",
            "review_score": "1"
        }
    ]
}