{
    "app_id": 1002,
    "name": "Rag Doll Kung Fu",
    "release_date": "2005-10-12",
    "developer": [
        "Mark Healey"
    ],
    "publisher": [
        "Mark Healey"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Indie",
        "Fighting",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 17,
    "price": 5.99,
    "description": "Featuring a wide collection of single and multiplayer games, either online or with multiple mice, Rag Doll Kung Fu provides players with one of the most creative and unique game experiences delivered in years.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/1002/header.jpg?t=1447350828",
    "minimum_requirements": "Pentium3 800 MHz (or compatible), 256 MB RAM, GeForce 2 (or compatible), Windows 98, Internet connection for Steam  Will be choppy with 8 AI players or in a big online game. Multi mice will only work with Windows XP Recommended: Pentium4 1500 MHz (or compatible), 512MB RAM, DirectX 9 compatible graphics card, Windows XP, Internet connection for Steam  Will work fine with most DirectX 9 compatible graphics cards.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Old game, still spectacular silly fun. ",
            "review_score": "1"
        },
        {
            "review_text": "Creative and fun. And the reason I joined steam.",
            "review_score": "1"
        },
        {
            "review_text": "Install it, Tries to play, The game crashes, uninstall, reinstall, still doesn't work Money Wasting Simulator 11/10",
            "review_score": "-1"
        },
        {
            "review_text": "1st 3rd party game released on steam 1st regrettable purchase made on steam",
            "review_score": "-1"
        },
        {
            "review_text": "The game is actually good, just not for the price.  I picked this up for three dollars, it came with another game and it was at Dollarama in a physical case. I figured multiplayer on Steam was a thing, since I originally bought a copy for my friend from the same Dollarama and noticed it had steam.  I'm a bit disappointed that it still doesn't exist, same with a lot of features that you'd expect. However, it seems to be ready for multiplayer to be added, as well as the ability to support never-incoming workshop content, since the mods are all really simple reskins.  The game is very simple and fun, and the story is mature, B-movie level garbage, as if Kung Pow: Enter the Fist was directed by Cheech and Chong.   If anyone can find Mr. Healey and get him to mend in workshop and multiplayer or pass the license off to someone willing and capable, it might do a whole hell of a lot better, rather than abandoning it for the PSN version, or even the iTunes comedy doodle version.  Worth 3 bucks, not 10.",
            "review_score": "-1"
        }
    ]
}