{
    "app_id": 10150,
    "name": "Prototype™",
    "release_date": "2009-06-12",
    "developer": [
        "Radical Entertainment"
    ],
    "publisher": [
        "Activision"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Open World",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 3702,
    "negative_ratings": 904,
    "price": 14.99,
    "description": "You are the Prototype, Alex Mercer, a man without memory armed with amazing shape-shifting abilities, hunting your way to the heart of the conspiracy which created you; making those responsible pay. Fast &amp; Deadly Shape-Shifting Combat: Reconfigure your body to the situation at hand.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/10150/header.jpg?t=1534443367",
    "minimum_requirements": "OS: Windows® XP (with Service Pack 3) or Windows Vista®                     Processor: Intel® Core™2 Duo 2.6 GHz or AMD Athlon™ 64 X2 4000+ or better                     Memory: Vista 2 GB RAM / XP 1 GB RAM                     Graphics: All NVIDIA® GeForce® 7800 GT 256 MB and better chipsets. All ATI Radeon™ X1800 256 MB and better chipsets                     DirectX®: Microsoft DirectX 9.0c                     Hard Drive: 8GB of free hard drive space                     Sound: DirectX® 9.0c compliant sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Truly epic game, the free-roam mode is what makes it best, you really feel badass jumping skyscrapers and watching entire US Army trying to stop you and fail miserably. RPGish progress where you spent evolution points on power upgrades and new tricks is well done. Surprisingly the story is pretty good as well, and there is a decent plot twiss. The graphics were dated when this game was released now they are pretty crappy but that does not take the awesomeness of the game. Flaws? Well the graphic for one, bad side-missions, repetitive NPC models making you feel like in clone wars. Nothing major.The combat can get a bit repetitive if you don't mix things up. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to kidnap someone and throw them off the empire state building? well now you can.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much I bought Alex Mercer's Jacket a couple years ago. One day, when I was a bit high off of laughing gas from a hospital visit, I truly felt that the jacket gave me his powers and tried to clear a tall building in one leap. Boy do I miss having all ten toes :(",
            "review_score": "1"
        },
        {
            "review_text": "I love the Anti Hero concept as well as the feeling of having power. For it's time this game was amazing (2009) as of right now it is still worth owning. Great free roaming game, will recommend :)",
            "review_score": "1"
        },
        {
            "review_text": "- Crashes with AMD cards  - Optimized terribly + Open world hack n slash horror game + Challenging bosses + Explosions and fun ways to traverse map.",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of HULK - ULTIMATE DESTRUCTION on PS1...which is all great fun to wreak havoc in NYC  But it got boring fast. I found the quests pretty similar, the AI is as dumb as nails, and the Hunters kick your butt ...until you get the pin down power.   Buy on sale :)",
            "review_score": "1"
        },
        {
            "review_text": "Prototype is a game that accepts the fact that Open World games are defined by their movement mechanics, that much I learned from parkouring through the streets and over cars, running along the sides of buildings and gliding from the tallest skyscrapers.  The story and characters has a certain grey mentality to it that just appeals to me. You're not a hero. You might not be the big villain either but you're certainly not a good guy either.  The gameplay, besides running around Manhattan, revolves around using various evolved weapons to kill enemy soldiers, tanks, helicopters and mutants of varying sizes. The weapons are defined enough to keep you entertained even if you will find a favorite rather quickly, for me it was the whipfist.  Graphically the game is not impressive but the backdrop of a destroyed city where constant battles between the military and the mutants take combined with a decent view distance makes this acceptable.  One of the best open world games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "DESTRUCTION N' CHAOS :) Also acceptable story, keeps you motivated to destroy even more.",
            "review_score": "1"
        },
        {
            "review_text": "I freaking love this game.  There's no such thing as too much caos and destruction :3  Also, big giant worm.",
            "review_score": "1"
        },
        {
            "review_text": "Became an old lady lifting a car and sprinting up walls  69.69/10",
            "review_score": "1"
        },
        {
            "review_text": "A solid proof that even viral outbreaks can be incredibly fun, if done right.  Eat . Sleep . Consume . Repeat .  Oh, and you are kind of OP !  10/10, will consume again.",
            "review_score": "1"
        },
        {
            "review_text": "I want to like the game, but with the sound issues, and all the work arounds, and there never been a patch, I just can't honestly recomend the game on Steam.  Is fun, no doubt, and the story is pretty interesting. The mechanics are awesome, the skills are really cool to use, etc etc etc, but the sound, and only being able to play for about an hour at a time without having issues happen, or going in and deleting files to remove sound issues, whatever. Is just ... not really worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "TL;DR (even though it's a quick review): Purchase this if you appreciate open world, fast-paced storylines with no restriction of smashing skulls and being properly badass, as Alex Mercer, the prototype.  An intriguing storyline collates with a self-explanatory prototype human being resurrected into life, or exploration of death rather; with powers unheard of - to create a vast mess of gore and chaos. I didn't even take any notice of the graphics because I focused much on the storyline to genuinely optimize my knowledge of the graphics. The game is captivating enough to draw me away from sensing if the graphics are too minimal or too maximum. I ran mine on the lowest settings I could acquire as I have a simple HP laptop, and the game looks incredibly smooth.  gr8 r8 4 dis m8 11/10 would play again  [ Edit: I now have an actual computer and not the laptop mentioned in my review - I still play this game from time to time as it's just fun to go back to - the story is repeatable and the gameplay is fluid. ]  [ Second edit: I can still verify that this is true. I don't get addicted but I can play and relive the nostalgia as easy as clicking your fingers. ]",
            "review_score": "1"
        },
        {
            "review_text": "in this mad LSD Trip you become the bio-weapon called 'Alex Mercer' who seems to be a normal human BUT you have things like Claws, a blade, a hammerfist thing, armor and other crazy ♥♥♥♥ at your dudes disposal, he looks like one of the assassins from ♥♥♥♥ing assassins creed, on top of that you have the military hunting you down, cause you escaped dulce base, then you meet another mutant who starts a zombie apcoypse and then thats it from there (all of this happens in NY) and you dudes a shapeshifter (you consume ppl, then take thier apperence...)   PROS - crazy lsd trip of a game, you are an assassin bioweapon, vehicles everywhere, powers are OTT, but cool, SKIN MODS, you can side kick helicopters!!  CONS - Missions are a pain in the ♥♥♥, powers also require missions to unlock them  (Still gonna update this if i get a 100% save)  EDIT - I got a 100% savegame  UPDATE, Figured out how to mod it with texmod by putting the files into the documents and the local files for it, adds waaay more gametime, and looks for mercer &gt;:)",
            "review_score": "1"
        },
        {
            "review_text": "Wanna be a Virus that can shapeshift to anyone,any weapon but Fire Power,well...you can grab the Soldier's Machine Gun,Heavy Machine Gun,Grenade Launcher and a Bazooka,but you can't shapeshift in to Guns and  stuff,so?........then  welcome to Hell.",
            "review_score": "1"
        },
        {
            "review_text": "buy it it's pretty good",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of but better than SPIDERMAN, the controls are a lot easier to manage. It is straightforward and has chaotic elements that is reminiscent of GTA only a bigger scale of destruction. The storyline is decent. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good open world game that makes you feel bad@#$ while not quite being OP.",
            "review_score": "1"
        },
        {
            "review_text": "I liked Prototype but it is aging and I hope the sequel fleshes things out further.   For once the storytelling makes up for the problems with the story; I had fun and looked forward to seeing the events happening.   The game has great mechanics. Alex truly feels powerful which reduces the army to mere hurdles to overcome. I loved the variety of powers and their destructive finesse. Unfortunately the missions boil down to the same things over and over and I would have liked to see more variety in this sandbox New York like what was available in GTA4. The visuals are good, but nowhere near the levels of GTA4 and Just Cause 2; -if that level was matched this would have been tremendous. The gore and visuals really sell the creepy tone.  The item collection gets boring since you only stumble upon them... no hunting possible. Recharging your health in the giant fights at the end is annoying, but early in the game is so easy there's not too much challenge.  $20 or under is appropriate.",
            "review_score": "1"
        },
        {
            "review_text": "it is so fun!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very poorly optimised HOWEVER Very fun, and probably one of my all time favourites, I'd recommend using a controller.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. There's so much to do, so much to collect, so much to... kill. I do wish it had more detailed graphics but I guess it only makes sense since there are literally hundreds of characters on screen sometimes. It plays great with a controller. Consuming enemies just feels so right. I love taking over choppers, running on rooftops, taking over military headquarters. There are no limits. The bossfights are pretty epic, sometimes even hard. Also, there are tons of moves. So many that I don't think a lot of people will even try them all out, or even unlock them. It's a great first game and I can't wait for the second one. But I do hope they'll improve the graphics. And I hope they leave the consume ability fully intact (sounds and the way you have to pull it off). Fun fun fun !  [Rating: 88/100]",
            "review_score": "1"
        },
        {
            "review_text": "Do you like eating cops? Then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty frickin' awesome game, though some parts are mind numbingly hard it's still a fun game fer when yer crazy and outta yer mind like me and fer when ya just wana rip people apart and wade through some entrails...all over all a very wonderific game!",
            "review_score": "1"
        },
        {
            "review_text": "The story is good and awesome. even though there's no 16:4 ratio.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game when it's on sale. 5.99 is an awesome price for this. The great part comes in running around eating people and going on violent rampages. It's just a pile of fun. The same cannot be said for the story. This game hits its peak in free roam.  If you enjoy mindless violence this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": " This game could be better if it was/had:",
            "review_score": "1"
        },
        {
            "review_text": "Hard to review without considering other games that are very similar, and I would compare it to The Hulk/Spiderman with Grand Theft Auto.  Pros+ Graphics are very pleasant. Story has potential. Gameplay is Awesome, running up walls, super jumping, and taking down helicopters.  Cons- Abilities feel overwhelming. AI seems very robotic and lacking more than one technique. Controls are a little stiff, but with everything you can do, could be a tough fix.  I can tell you this much, I won't be returning it.  Especially since Steam saved me money compared to Sony's similar sale.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game! Great campaign length. And just fun when you feel like messing around ;)",
            "review_score": "1"
        },
        {
            "review_text": "Prototype a shape shifting game and a monster who comsumes is easy to play and good game :D",
            "review_score": "1"
        },
        {
            "review_text": "This pleasantly surprised me. It is one neverending brutal massacre in which you feel as a complete bad ♥♥♥ and have a great time. Very fun game, with some of the best movement mechanics I have seen. Just running and jumping over cars and buildings is fun in this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game's great! But the best part of the game was...  *Heavy breathing*  Alex Mercer: 'TAGGART! YOU SUICIDAL MORON!'  I guess Alex doesn't give a sh!t on that Taggart guy.  10/10 would cuss-fest again.",
            "review_score": "1"
        },
        {
            "review_text": "You're Akira in the Central Park",
            "review_score": "1"
        },
        {
            "review_text": "Play Prototype 2.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Skyrim with infection.",
            "review_score": "1"
        },
        {
            "review_text": "Really really awesome game! I played it 3 times!",
            "review_score": "1"
        },
        {
            "review_text": "This game has frustrating gameplay and a stupid story... if you follow the story that is. If you come home after a frustrating day and play the sandbox mode however, the running up buildings, destroying of tanks and horrific murder of innocent civilians, it will be a cathartic delight. 4 stars.",
            "review_score": "1"
        },
        {
            "review_text": "Shape-shift, jump building to building, slice and dice, smash and bash, infiltrate and investigate, deploy and destroy, consume and assume, and plainly annihilate. Prototype has it all.  Feel like a god.",
            "review_score": "1"
        },
        {
            "review_text": "In Prototype you play as a man named Alex fighting against a shadowy government entity that he’s very mad at for giving him godlike superpowers. I would try to explain the plot further, but I honestly can’t. The volume drops inexplicity to whispers in all of the game’s cutscenes - it’s as if the voice actors themselves are embarrassed at taking part in this travesty.  You’ll battle the government and the plague monsters infecting an island that looks as if someone attempted to draw Manhattan without ever having been there - or even Googled it to see what it looks like. Fortunately, you’ll have a lot of cool powers at your disposal to help you. Unfortunately, thanks to Prototype’s overly complicated control system, you won’t figure how out how to use half of them. It doesn’t help that, despite Alex’s ability to hijack a helicopter in midair and bodyslam a tank, he can’t properly block. This becomes a problem as the creators of this game think that the way to make Prototype’s later missions be more challenging is for them to simply throw thousands of enemies at your face. The longer the game goes the more frustrating it becomes.  Ultimately, Prototype can be a fun way to spend a few hours, but you’ll quickly question why you keep playing it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game if you don't have it then save up because this game is beast.",
            "review_score": "1"
        },
        {
            "review_text": "EY! Wanna know, what happens when you make a bilogical weapon? And some crazy kid steals it and breaks the glass? ♥♥♥♥ING THIS, YEAH. You create a fan♥♥♥♥ing tastic mother ♥♥♥♥ing mutant.  That can, kill old people, eat old people, drag him/her along with you, throw him/her from top of a skyscraper. Or you can Drag the old man/women to the top of a skyscraper throw him down, surf on hes/hers corpse grab and eat him/her, killing her. THEN YOU CAN BECOME HER/him!   Terrorise the city with the world strongest and fastest super human old man/women.  THE WORLD WILL FEEL YOUR WRATH, FOR NOT ALLOWING YOU YOU'RE RIGHTS TO NAG AT PEOPLES EARS ALL DAY LONG ABOUT THE WEATHER OR WHAT EVER THE ♥♥♥♥!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "DIS GAME IS THE BEST GAME IN THE WORLD",
            "review_score": "1"
        },
        {
            "review_text": "Don't see why people hate this game for PC. 'Oh the port is bad' Is it? Like, is it really? It's completely perfect for me. 8/10. Would be 10/10 if it wasn't the same old thing after a while. But running around doing what you want, causing complete mayhem is just doesn't get old.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great plot and a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "i recomend prototype cause it is FLIPING AWESOME!!!!!!!!!!!! And at times challenging",
            "review_score": "1"
        },
        {
            "review_text": "I think I killed the entire population of Manhatten, but then it respawned.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 My favorite game of all time. PS: Badass Anti-Hero.",
            "review_score": "1"
        },
        {
            "review_text": "Please note that some some people are having issues with this game, but I am not. It is worth it to dig into their problems to ensure that you will not have them as well.  That having been said, graphically, this game is nothing special (though to its credit, it is half a decade old at this point), and the controls can be a bit difficult at times. But overall, I do recommend this game. it is a fun game to just unleash h*ll on random civies (as there are no penalties for it). The powers are very fun, and when you get used to the controls, zipping around the city is pretty fantastic. The story is nothing too special, but still fun to go through. And some of the missions can be a bit annoying on higher difficulties.  Basically, this game is a fantastic ammoral d*ck simulator, and well worth the low cost imho. You can just run around streets with a car over your head, smashing everyone like bowling pins. You can go nuts with machine guns or helicopters. Quite frankly, this is a great sandbox game to play, even if it does seem to lack depth in most departments (although they do have a cool feature where you can affect the map through your actions, even if it is temporary)  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game for just running around and doing whatever while listening to music.",
            "review_score": "1"
        },
        {
            "review_text": "Used to play spiderman 3 by activision on PS2. This ♥♥♥♥ is the same but better!",
            "review_score": "1"
        },
        {
            "review_text": "ok so this is a great game but the blackwatch are everywhere! The longest time I spent not being notorious was 3 minutes, this was due to the sheere amount of blackwatch troops everywhere!! Other than that i'm having alot of fun playing this game!",
            "review_score": "1"
        },
        {
            "review_text": "i must admit while i do like this game get it on sale for atleast 70 off it gets really annoying note this is not a bad game just not worth what else you could get like saints row or this war of mine ",
            "review_score": "-1"
        },
        {
            "review_text": "Overall good game but... sometimes you can try to fight hunters and think that there too much overpowered even in EASY mode and I mean it",
            "review_score": "1"
        },
        {
            "review_text": "i hate it becuse the timer on the roof gives u 4 secs and im stuck :( ",
            "review_score": "-1"
        },
        {
            "review_text": "Really good for the first two thirds, except for a couple of difficulty spikes, but the last third of the game is awful. These developers had no idea how to do difficulty right.",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't age well, graphics are choppy as hell, even the cut scenes. And no my computer is not crap, its very good.",
            "review_score": "-1"
        },
        {
            "review_text": "Eww  7/10 game 3/10 optimization. GET IT FOR CONSOLE YA PEASANTS",
            "review_score": "-1"
        },
        {
            "review_text": "So, i tried playing this game on my Windows 7 PC. It is pretty much as good as those with Windows 7 go, but the game is stuck on constant 5 fps, making it barely playable. Apparently it is connected to HID, which would be fine. IF this was the year 2009. Seven years later, this gamebreaking error is not fixed, and has to be manually looked up and dealt with by players who want to play this. To people who want to play a singleplayer game for once because their internet is too ♥♥♥♥ to play online, this is just infuriating. So basically, i bet i would like this game, if i could play it. But due to this error, i wont be able to, and seeing as this is left unfixed for seven years now, there is no hope for me to play this game in the future either.",
            "review_score": "-1"
        },
        {
            "review_text": "Wont run in 1080p because I have 'To much' vram. And now crashes everytime I load gameplay. Terrible unsupported port, and a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "It works for the first few minutes but it crashes afterwards. It was a good game. It's a shame that it does that. I wouldn't recommend buying this game at all. It'll be a waste of your time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "  i complete all main misson after 15h, feelso powerfull, Not heroes just take back what ur",
            "review_score": "1"
        },
        {
            "review_text": "Viral infection in a sandbox world 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Became an old lady take a machinegun and shoot everyone   11/10",
            "review_score": "1"
        },
        {
            "review_text": "I should have listened to all the bad reviews for this game and not bought it, but not for the reasons I thought...  when I started the game it was stuck at 1080 x 800 p or something like that. which means I could not get it to go fully full screen no matter how hard I tried.  I was ok with this though. to me the gameplay was worth it, enough to bypass this.  then I found out how the music just wouldn't play much outside missions menu's and combat. again I was ok with this.  I was even ok with the fact that most of the voices did not work forcing me to read subtitles.   I imagined everyones voices pretty well in my head.  but then came the thing I was not ok with. I call it the stupidly complicated frustrating mission of ultimate bullsh*t!!  it starts of with you entering a science base. I totally messed up at the stealth but got in anyway. I thought the game was quite forgiving, and I was so so wrong...  right after getting in and watching a cutscene I am told to lead these big tanky infested zombie things to a military base. and they one of THE most rage inducing stupid enemy designs ever!  they can run faster then you, chuck stuff at you with perfect aim and worst of all their close combat attacks track you. its like they have hacked aimbot into their fists!!  sure you can doge them if you run around like a mad man like i did, but to really hurt them you need to hit them with close combat combos, and when you do they just go 'NOPE F*CK YOU!!' and interrupt it with an attack that is faster than yours.  then they stunlock you until you are nearly dead. so the game ever so helpfully recommends that you kill them for more health. you could always try to kill other things for more health like enemy soldiers but they like to focus on you and only you.  so when you do try that they beat the sh*t out of you until have have as little health as you started with.   but the mission... oh the mission you fight them on is so much worse...  first 3 of them come in and you have to kill them all, then 8 more after that and 10 more after that!  all the while alex mecer (main guy of the story. the one you play as) is saying stuff like 'bring more! ill kill them all!' and 'i could take on a 100 more!' NO YOU CANOT YOU STUPID LITTLE BABY! NOW SHUT UP!!  so then after running around in circles like a mad man while the miltary shoots them like I did, or you somehow mange to kill them by yourself (in that case I am in awe of you!) you are told to blow up a bunch of fuel tanks to kill the stunlockers of doom, by using the rocket launchers and granade launchers that are impossible to aim, while somehow not getting stonlocked to death.  once you do that it triggers a cutscene were the zombie monsters are killed by the explosions.   only moments before they were face tanking 12 rockets at once!! so the fuel tanks explode the monsters die, and alex mercer stands right there as the ENTIRE BUILDING FALLS ON HIM!! without taking a scratch when ingame rockets do hurt him!!  the players reward for all that? a smug c*cky grin from alex mercer and bullets in your face as more soldiers shoot you right afterwoods.  just die already you stupid game and stupid baby face alex mecer!   3/10 already anyoing issues, game crashes for some,it won't even start for others and controller breaking frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "what can i do to my game so i can play it it says prototype not working ",
            "review_score": "1"
        },
        {
            "review_text": "I don't have it",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't work well with a keyboard and mouse. The game also gets boring after some time. The gameplay is too repeitive.",
            "review_score": "-1"
        },
        {
            "review_text": "Sucks ♥♥♥. Won't even ♥♥♥♥ING START",
            "review_score": "-1"
        },
        {
            "review_text": "Broken piece of crap. Sorry, can't put it any other way.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad controls, bad animations, bad dialog, bad ballence. This is a bad game. It's not ♥♥♥♥, it's not like i'm mad they got my money, it's just bad enough I wish I didn't own it because I'm not going to play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, I find this game to be extremely boring and repetitive. It all comes down to two big things; you vs military, you vs big bad monsters. And as you advance in the story, the enemy simply get a power-up (as well as you).  The missions are all the same, you either infiltrate a military base/destroy monster base or kill the 'boss' (which is simply one of the power-up enemies that you will now find everywhere).  If this wasn't enough, the controls are actually quite clunky, camera/targeting is extremely confusing at times.   Also the story was quite a letdown.",
            "review_score": "-1"
        },
        {
            "review_text": "I equate this game to herding a bunch of sheep into a very small corral and then squishing them all at once with a giant hammer. That may sound weird but its the way it is. This game story makes no sense and all of the npc civilians just wander around waiting to be mass squished. They dont even react to whats happening in their environment in any logical way(I mean, at least sheep would try to run away in real life). Anyway, on metacritic I notice its mostly young guys who give this game high marks. Guys who get a kick out of squishing mass quantities of npcs for no particular reason. If thats what you're looking for then buy this game! If you prefer a story behind your squishing, or a story with a hero you can relate to in some way, or ANYTHING else to go along with your squishing, DONT buy this game. You wont be happy. Gameplay is fun for about the first hour and then you realize you are doing the same thing over and over and over and none of it makes sense.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a warning, this game is absolutely terrible. As soon as I start up the game I attempt to configure it for my 1080p screen and there is no 1080p option!!!! I felt like I was just slapped in the face!! I looked up this issue on the internet and found that the developers limited the resolutions based on the graphics cards memory, below 512mb and you are severely limited. My graphics card has 2 GB of memory and yet it doesnt allow me to have a 1080 resolution, this feature is severely broken.  Then there is the issue with the stuttering. My graphics card is very good and the processor is also high end but when I move my mouse around to look it moves as if there are set directions you can look at instead of a fluid motion that allows you to look wherever you want.  Conclusion, the game is not playable in my opinion. And this is not even considering that the game provides no challenge whatsoever, it makes you a unstoppable war machine. Don't get this game until it's free (ie, never)",
            "review_score": "-1"
        },
        {
            "review_text": "29-Jan-2016 : Finished main story Equipment : MSI GT80-2QE Notebook  REVIEW :  Boring, bad story, bad mechanics. This is the kind of game that you play casually, if you just want to blow some steam off. But in this case, you will be frustrated instead.  CONCLUSION : Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "DON'T BUY THIS ♥♥♥♥♥♥ NIGER OF A PC PORT! The game crashes every time it tries to load a save, and I have literally found 10 USELESS FORUMS! NOBODY CAN FIX THIS! THE GAME DOES NOT ♥♥♥♥ING WORK! ♥♥♥♥ YOU ACTIVISION! YOU ARE CORRUPT ♥♥♥♥♥♥♥S!!! BUY ON PS3!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "After more than two hours of attempting, this would not run on my PC (Win 7, 64 bit, can run basically every game on Steam).  Activision no longer supports the game.   Buyer beware.",
            "review_score": "-1"
        },
        {
            "review_text": "Cutscenes are broken on Windows 7, frames are dropping very often but at least story and gameplay is good enough to make you play it. Play it first before Prototype 2 cos of huge spoilers. Better buy on 75% off sale.",
            "review_score": "1"
        },
        {
            "review_text": "I have a tag in my steam library for 'Will Never Play Again'.  This game is the sole resident.  This game made me create this category.  If you must, play Prototype 2. It's better in every single respect.",
            "review_score": "-1"
        },
        {
            "review_text": "I had this game on the PlayStation3 and it was kinda enjoyable. Ripping and tearing apart innocent citizens and soldiers alike, destroying everything, ellbow-slamming a tank - there will be gore and explosions everywhere. Sounds decent, right?  A little.  Only problem is the controls where a bit clunky (even on the PS3) and I had massive problems focussing and attacking the enemy I actually wanted. Another funbreaker is the fact that you're easily being bounced back, even by small and weak enemies. It's even worse when stronger enemies and helicopters chase you. Sometimes you're feeling like a ball in a pinball machine.  This game has so much potential and with proper implementation this propably would have been the best anti-aggression-game and there is. I mean, you have all those amazing powers! From disguise to running at super speed to hammerfists (lets you smash tanks), clawhands (rips and tears everything apart), whiplash (for taking down distant enemies), superjumping, semi-flying (gliding). You can even throw buses into helicopters and stuff, the list goes on and it's awesome.  But you're almost not able to live it up.  The story is ok and acceptable. The missions are way too hard and not fun at all (I'm not a good gamer, though). In one mission you have to flee. Excuse me? I'm a godlike creature and can destroy a tank with a single blow with my ellbow, why the heck should I flee?  That's boring and uninspiring. It's like getting a Lamborghini in a racing game and the game tells you to drive not faster than 30 miles per hour. Unfortunately, I didn't find any cheats or mods for this game. I think with a little effort like removing all the time based missions and the bouncing this would be just awesome.  If you can get this game for a decent price (it's under 10 dollars mostly, on Humble Bundle even cheaper) and if you do like gore, GO GET IT and happy ripping and tearing bodies apart for a while. I really hope you could do an devastator attack on some people out there who are wasting so much potential. It hurts, especially as a creative person.",
            "review_score": "-1"
        },
        {
            "review_text": "Not the game, but the port is poor. I booted it up to have major sound issues where everyone talked so fast they sounded like a record skipping. This was atop poor resolution issues, and I coudln't get far enough to say if the controls were wonky or not. Don't buy unless you're willing to play tech support hero to make the game run.",
            "review_score": "-1"
        },
        {
            "review_text": "The most I've ever disliked a sandbox game. Boring, tedious and stupid.",
            "review_score": "-1"
        },
        {
            "review_text": "been stuck on the loading screen for 127 minutes now, hopefully it comes around",
            "review_score": "-1"
        },
        {
            "review_text": "While I do love the detail put into the dismemberment and gore of this game, the story falls short and well, to be honest, some things feel weird.  I know, I know... 'It's an old game.' But that's not an excuse for the cars to seat deformed polygonal people inside. Some little things like that broke the inmersion and overall experience for me in big ways.  I'd say check out Saints Row 4. It's this game on steroids but add some personality, mature comedy and a slew of mini-games as well.  This isn't a terribly bad game, there's just better alternatives that are now available on the Steam market and well, this isn't worth the asking price. A fair price for this game would be 25% of what they are asking for.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad pc port  Just like gta iv  screw this män",
            "review_score": "-1"
        },
        {
            "review_text": "Big arms and Flesh everywhere. It was bad. (3/10)",
            "review_score": "-1"
        },
        {
            "review_text": "If you like slaying zombies, be creative while you slaugter and play free-roam games, then Prototype is for you! The past 24 hours I have played nothing but this, and I have found myself on the edge of the seat constantly. This game pretty much let you do what you feel like, wether that acting like a total loony and just kill everything in sight, or run around and do missions. I myself is a mix of both, plus I also like to be creative when it comes to throw things after other things. Ever tried throwing a car at a helicopter? In Prototype you will do it all the time! This game is like GTA on crack. I strong recommend it - it's fun, full of action and hours of creative murdering!",
            "review_score": "1"
        },
        {
            "review_text": "Grab a girl, run up the Empire State Building, throw her off a good mile out, jump down, live, loose 0 health, Press M2+E (Default) release 1000 tenticles killing everything on an entire block.",
            "review_score": "1"
        },
        {
            "review_text": "reminds me of ultimate spiderman, where you play as Venom, but better! if you like blowing things up and mass distruction.... this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "this is a amazing game try to get it",
            "review_score": "1"
        },
        {
            "review_text": "Great fun game to play. You get to be ausome and do heaps of cool fighting moves. Best to play with an xbox controller. A good port to teh PC and easy to get teh hang off.  Good storyline and graphics arent bad considering this game is a few years old. If you can get it on special its woth the money. Also quite long so you will get heaps out of it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for anyone who like action and hack and slash types, alot like devil may cry but much more brutal ';.;'",
            "review_score": "1"
        },
        {
            "review_text": "Overall a fun game.    The story is basically resident evil.. virus outbreak although unlike it you are insanely overpowered even on hard diff..    I like the fact that you fight both the military and the infected however the AI on the military is just sad you can literally do the most insane ♥♥♥♥ right in front of them and they won't react never mind the fact that you are obviously not human or that you are supposed to be a 'priority target' even if you do get in trouble you can kill all of them or evade them without much of a struggle.    The infected are even less of a threat then the military. Once you learn the move set of the enemy they become closer to tedious then to a challenge including what is supposed to be bosses which just take more time to kill and are still easy to evade sins you are extremely fast.    Apart from the protagonist characters somehow don't feel complete.    The gameplay is pretty cool. Basically you are very fast and agile. Most of the time you will be jumping from one rooftop to another. Has a good variety of weapons and powers and you can even steal tanks and helicopters from the military and use them to your advantage. The stealth system is just about the only thing i dislike in the gameplay sins all the NPC's are blind, deaf and suffer from a rare disorder in which their mind goes blank and forget everything every 5 seconds or they might as well be in a coma.    I'd go ether way with the recommendation depends on what you want to play.  Even with all the issues it has it is still fun to go fight endless waves of enemies and see how long you are going to last. That is until you learn how to heal up fast and that the waves are not actually endless...",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong, the game has a good side.  This is one that I just do not feel a drive to complete. The story is kind of flat, and the camera is insane. Controls get a bit wonky when the camera does things.  Were I playing this back when I was all about superhero games, probably would not bother me as much(I really enjoyed the first Spiderman on N64 and Dreamcast). It is a decent concept, and my kids enjoy free running and smashing things. It is not a bad game, just a bit flawed and kind of boring to me.  On sale, I think it is a decent budget game for low spenders who want a lot of playtime for the money.  I have a ton of games, this one is not making a priority among them. I would rather rate it Up than Down, but only because it is a working game with a story and system. This is not one of my favorite titles.",
            "review_score": "1"
        },
        {
            "review_text": "There is no way I could put this down...It is like InFamous, yet involves more stealth than InFamous. I love nothing more than killing Elizabeth Greene brutally and consuming her deformed flesh to gain power and, more importantly, all she knows.",
            "review_score": "1"
        },
        {
            "review_text": "Grabbed a bus, ran up a building, threw the bus off the building. Grabbed a dude, ran up a building, threw dude off building. Ate people.   Can't eat tanks 1/10  Can eat hulk zombies 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love the game. The main protagonist is a completely uncaring sociopath (think ♥♥♥♥ Cheney, but badass,) who thinks nothing of riding a tank through Central Park mowing down infected and any uninfected schlub that happens to get in the way. But he loves his sister, regardless (and probably is nice to his mother and randomly stops the carnage to pet puppies and kittens, or something.) In short, the perfect protagonist for an apocalypse.",
            "review_score": "1"
        },
        {
            "review_text": "Amizingly fun game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but the controls are ♥♥♥♥ and the ingame targeting system is worthless. I would recomend the game for the story, not for the gameplay.",
            "review_score": "1"
        },
        {
            "review_text": " Warning: You might have to mess around with the game files and community patches to support your resolution.",
            "review_score": "1"
        },
        {
            "review_text": "Okay this game is good now i say that as in its not bad, but could be better. And how they couldve improved on that is the story. Now the story to me its not quite clear what your main objective is because might i say Alex is a bit of a dumba$$ but we will forgive him, buit not knowing exactly what your main goal is, is...just not quite right but its still okay and pretty interesting of course leaving out the part of alex being an idiot. But then there are the cutscenes, the cutscenes with alex in them makes them confusing, not complicated just confusing because alex has the IQ of a rock his dialog is......not on the inteligent side making it hard to follow the storyline now for JUST THE STORY i would give it like a 7 or a 7.5 strictly because of how dumb alex is. But at this point youd be like ew bad story i dont want to sit through that. Well learning the fact that after you beat one mission you get more bada$$ powers drives you to want to play the story more. So if you want this game buy it more in the idea of your going to run around and kill people with awseome powers and upgrades not in the aspect of the story that much. My opinion but had to point it out.",
            "review_score": "1"
        },
        {
            "review_text": "+Pros I'm only 7 years late but heres a tip: Civilians are test dummies for new powers  bonus: their screams of agony and terror   -Cons  Forgot to buy my other games during sales because i was too focused on this",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "solid gameplay, and part 2 is coming out soon. Try it out.",
            "review_score": "1"
        },
        {
            "review_text": "The storyline is good, but the side missions get repetitive and tedious. Still a super fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Prototype is the kind of game that shows how bad and destructive one can be. As some type of genetic superbeing, you are free to explore the city of New York any way you like. Have fun killing people, destroy the bases of the police/military or just look around for sidemissions and things to collect. In between you do a story mission to advance the plot and gain new abilities. By the end of the game you are almost unstoppable. The free world to explore, the many sidequests, awesome powers and interesting story with some twisted elements make this game a solid title.",
            "review_score": "1"
        },
        {
            "review_text": "You need to have used this product for at least 5 minutes before posting a review for it (0 minutes on record).  i got this warning for my review of antichamber  now for the prototype review  its prototype. meh",
            "review_score": "1"
        },
        {
            "review_text": "Crackdown + Spiderman - ♥♥♥♥♥♥ness = Prototype",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of sand-box games, I can recommend picking this one up when it's on sale. It's a mess of an experience and tries to pad itself with missions that require you to repeat activities or run across the world just to show off the fact you can fly about with gore shoowing out of your wrists. Mercer is completely unsympathetic, and the story collapses on itself when you think about it for more than five seconds.  But it's fun. There's something primal about dropping down into a group of twenty soldiers and just tearing them apart before devouring their commander so you can call down artillery on their heads. It's ultimately ironic when they give you all these powers and upgrades, it's impossible to use nearly any of them because of how predators hunt you down and rockets home in on your location. Often missions devolve into hiding behind buildings, eating civs and waiting for a chance to rush back in and deal a littel damage. The bosses are definitely the low part of the game; they are all immune to even your basic attacks and it comes down to cheesing your way to victory.  Glad I played it, because it really helps me appreciate where games have come from and where they are going. Sort of Infamous' lesser brother.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, I recommend this game, its cheap.",
            "review_score": "1"
        },
        {
            "review_text": "This game was... alot better then I expected! I'm usually not keen on the whole 'invincable killing machine' but this one was really fun. The powers worked though I usually prefered to use military weapons over them usually but thats just my preference. Theres alot to do but its its not too impossable which I like. The story is ok but you really don't get very interested in the life of Alex Mercer. Still, I really enjoy the fact that there are so many cutscenes! I have never seen a game with so many mini cutscenes. So this game is loads of fun and I can't wait to play the next one! This is a must play!",
            "review_score": "1"
        },
        {
            "review_text": "one of my favorite games really like the story. and the game play is freaking awesome 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Well I played it backwards with Prototype 2 first lol so the badass hero I play here is already bad there but Its still awesome and I actually love knowing the story behind why Alex Mercer is who and what he is and if you wanna know more you WILL PLAY THIS EFFING GAME!!",
            "review_score": "1"
        },
        {
            "review_text": "Great action packed super villain game! Lot's of mini quests and a big story to follow. The story is a bit weak but the action does make up for it most of the time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun as hell!",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly a lot of fun. Took me way too long to play it.",
            "review_score": "1"
        },
        {
            "review_text": "Ever thought to yourself, I wish GTA would let me pick up a car, run up the side of a building, and throw it at a helicopter? That's Prototype.",
            "review_score": "1"
        },
        {
            "review_text": "Get this, its fantastic on so many levels. Who wouldn't enjoy running up buildings and throwing cars at helicopters?",
            "review_score": "1"
        },
        {
            "review_text": "It's basically a GTA on steroids with a more engaging storyline. Pretty cool combat mechanics with all kinds of different combos. Graphics feel like could have been better as it's really not that old. It also needs a little more optimization. Overwall it's a great game, I got P1 &amp; P2 + DLC from amazon for like $7.50 a few months ago, great deal.",
            "review_score": "1"
        },
        {
            "review_text": "It is a good game for exactly 8.5 hours, after which time, an enormous ♥♥♥♥♥ juts from your CPU tower. Did not finish after that.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much, I didn't play it as soon as I got it and I completely regret it, the gameplay and story are amazing but I had the sound issue where I couldn't hear anyone talk, I had to download a sound program and put on different headsets just to hear them talk. I swear all the pc ports of this game are ♥♥♥♥ed we need more support from Activision, I know Radical Games went under but Activision still owns this games and they should be doing more to fix this.",
            "review_score": "1"
        },
        {
            "review_text": "even though ths game came out in 2009 im playing it in 2014 and its still impresive. the combat is joius and it is amaxingley gory and brutal some compare it to hlks ltimate destruction and i mst agrey it is the more mature cousain who doesnt mind showng you what you can be if yo complete the game. there is a new game plus+ so that yo can feel like a god when yo replay it whch some games shold do. im looking at you dishonored. this is one of the best games i have ever played and say that it is a 9/10 its not perect because the main persone you are fightng s easyer than the first fight.",
            "review_score": "1"
        },
        {
            "review_text": "Uh, I thought I liked this a lot. But it turns out I think it's a bit meh. Not ♥♥♥♥ enough to not recommend though.",
            "review_score": "1"
        },
        {
            "review_text": "I ♥ this game",
            "review_score": "1"
        },
        {
            "review_text": "It's really unfortunate that Radical Entertainment had to shut down. They've been bringing us wonderful games for nearly twenty years. Prototype is one of my all time favorite video games. The year it came out, I begged my mother to let me rent the one game in Hastings with a fairly simple yet attractive cover. The moment the game started, I'd found myself absorbed by the dark setting and the unique concept. Growing up on Super Mario World and Illusion of Gaia, I fell in love. The gameplay itself starts off slow and above the average civilians around you. Alex Mercer, Project Zeus. You're the star of the show. You're everyone's problem. Alex can climb on walls, judo-kick helicopters, absorb monsters for their power, and so much more.  Unless you have a weak stomach for blood and gore, then I recommend this game to anyone who can get their hands on it.",
            "review_score": "1"
        },
        {
            "review_text": "Overall: not a bad game, but has many annoyances that will add up and impair your fun:  -several sections of the game are just plain obnoxious (getting swarmed with enemies that knock you down every few seconds EACH)  -due to above obnoxiousness, standard strategy is to /not/ use your mutant ability arsenal and instead steal a tank and fire from a safe distance.  -Web of Intrigue is cool but no way to tell where targets are unless you are very nearby, so getting a full Web means running on foot through every street.  -Abilities are interesting but only 2-3 'modes' are well developed  -events are repetative and bland (kill x within y, time trials)  -City is big and parkouring is fun, but its visually boring.  -On the plus side, the stealth AI is hilariously inept. You can literally drive a tank down the streets, mowing over civillians and cars, and still be completely undetected.",
            "review_score": "-1"
        },
        {
            "review_text": "did you know you can somehow kill in one hit",
            "review_score": "1"
        },
        {
            "review_text": "An amazingly fun game, with fluid combat, and a gripping story, looking forward to the sequel!",
            "review_score": "1"
        },
        {
            "review_text": "The story is kinda cool and it would make a good movie if it was done right. but the thing that makes this game so addictive and awesome is how well the unique concept is carried out. It's just... simply... very ♥♥♥♥ing cool and loads and loads of fun. The character upgrade system is also well thought out and you get upgrades at a pace that fits mastering each new move and/or combo. The action is intense and gets even more intense as the game progresses and the stuff you can do is really awesome and fun. I should probably play through again and use the heli's less, but they were so much fun!!!  One thing that's weird though in the game is the AI. While half of the city is in chaos, the other half of the city is just gingerly getting on with their days, oblivous to the other half being infected by hideos mutants tearing people limb from limb and infecting those that don't escape. I suppose though, that this is comparable to good old GTA where hiding from the cops for 5 minutes makes them forget that you've commited genocide and burned half the city down.",
            "review_score": "1"
        },
        {
            "review_text": "My oh my so much blood! Prototype is by far one of my most favorite games of all time (and despite what critics say, i look forward to playing the next one once it comes out on PC o_o). To make this review short and sweet, i will just explain the basics- The Incredible Hulk for original Xbox on steroids o___________o. Turn your every body part into a blade of somesort and raage an immense open wolrd New York with your hellish fury after a long day at work. With more dismemberments then a SAW film, if your twisted (like me) you may get a giddy school girl laugh every time you watch a sliced in half torso fly through the streets. Speaking of flying, you CAN fly in this game (Sort of, its gliding but it means the same thing i guess). You can consume ANYBODY in the game and become them to evade from the nosy police and the Marines. Did i mention blood thirsty zombies and huge mutants? I didnt? Well they are trying to kill you too. (OUT OF SPACE, CLICK VIEW COMMENT TO READ THE REST)",
            "review_score": "1"
        },
        {
            "review_text": "prototype is an open world wonderland with endless hours of gameplay",
            "review_score": "1"
        },
        {
            "review_text": "In something like 2010 my friend played this on xbox while we were chilling and it looked so ♥♥♥♥♥♥ awesome and when i played it i couldn't really master everything inmediatly but like 3 years later another friend of mine has it and he already played it to death and said i could borrow it and i was liek ♥♥♥♥ yeah! played that game untill i got all the events and all them upgrades... and now while it was in the sale i bought it again and 10/10 would buy it again 6 years after release and already having played out the entire game.  10/10 game, must have",
            "review_score": "1"
        },
        {
            "review_text": "This game belong on ♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "First off, I would like to say that I love this game, for me, It seems that games like this make me think overwhelmingly positive, because of all the destruction and all the crisis, but this game could not suite you, so you should just try to find a game that works well for you.  I recommend this game to anyone who is looking for complete chaos.",
            "review_score": "1"
        },
        {
            "review_text": "It's kinda stress-relieving if tearing people apart is your natural high.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended by me. Reminds me of Just Cause 2 when it comes to game play BUT so much more darKer and brutal &gt;:D  ~ Love It!",
            "review_score": "1"
        },
        {
            "review_text": "more like phototype because of the bad frame rate",
            "review_score": "-1"
        },
        {
            "review_text": "This game is simply awesome. You have many powers to choose from and they are all superbly destructive. After a while i developed my own game and played endlessly just as a soldier with a rifle fighting against the hoard of twisted monstrosity that had swept through the city. That is until I would get bored and then slaughter everything in sight. Give this one a try if you have harbored any desire to be a soul sucking metamorph that is neigh indestructible.",
            "review_score": "1"
        },
        {
            "review_text": "SOOOO MUCH BETTER THAN PROTOTYPE 2.  Pros: Alex Mercer is the only playable MC for me. Movement feels smooth Not Prototype 2. VERY FUN Story could be better, but I loved it. Amazing unexpected ending. YOU CAN'T NOT HAVE FUN KILLING PEOPLE. The game looks pretty good The transformations are awesome One of my favorite games of all time.  Cons: The sidemissions do get repetitive. Not much character development. Story could be better Wish it was longer. Wish it had a better sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Probz the most fun i have had in a open map video game, Its the only one i prefer that you DON'T use a tank xD, they just really slow you down.  The Story is pretty good, the way it goes back and forth is really ♥♥♥♥ing cool. I just ♥♥♥♥ing love the powers you get XD, they are SUPER fun and they never get old, at all. And the farther you get into the story, the more ♥♥♥♥ing cool the powers get  10/10 - ign: still playing it, but once im done it: would play again",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a good story. Can be a little frustrating at times with the controls but overall great game.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing quite like running through the streets while holding a car above your head and watching everything in your path fly away.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun super'hero' games after ps2 era. BUT this port has really unstable time with starting the game, and is limited in screen resolution options. Otherwise doesn't crash and runs well.",
            "review_score": "1"
        }
    ]
}