{
    "app_id": 102200,
    "name": "Runespell: Overture",
    "release_date": "2011-07-20",
    "developer": [
        "Mystic Box"
    ],
    "publisher": [
        "Mystic Box"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Card Game",
        "RPG",
        "Indie"
    ],
    "achievements": 35,
    "positive_ratings": 257,
    "negative_ratings": 76,
    "price": 7.99,
    "description": "This role-playing game, set in an alternate medieval Europe, combines poker mechanics with power ups and collectible cards.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/102200/header.jpg?t=1447353993",
    "minimum_requirements": "OS: XP / Vista / 7 Processor: 2 GHz Intel Pentium 4 / AMD Athlon 64 Memory: 1GB RAM Hard Disk Space: 350 MB Video Card: 256 MB Shader Model 2.0 (Geforce 6 series, Radeon X1000 series) DirectX®: DirectX® 9.0c Sound: DirectX® 9.0c compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Runespell Overture (Card/Poker/RPG/Strategy Hybrid)  For options we have Graphics Quality (Fastest, Fast, Simple, Good, Beautiful, and Fantastic), Windowed or Fullscreen, Drag and Drop or Click and Click (when moving cards around), and Sounds (Music and SFX). You can also choose a screen resolution anywhere from 640x480 to 1920x1080.  The tutorial is very well-done, teaching you the ropes without being annoying.  So what kind of game is this? It looks like an RPG that you play with cards, but that's not it at all. The primary thrust is actually a solitaire game... It's battle-solitaire-poker with RPG elements! *evil grin* Whee~!  How does that work? Looking at the screenshots will help a bit. As you can see, we and our opponent are each dealt a set of cards, solitaire-style. Ours is on top, theirs is on the bottom. We need to create poker hands by grouping cards in sets of five. If you don't know the poker hands, no worries -- the game will show you what groupings are 'legal' to play. Each 'hand' will deliver a certain amount of damage, depending on the cards you've chosen. For instance, a pair of cards (the other three cards in the group would be non-related) will deliver less damage than a flush.   In each round, you have three moves, and then your opponent gets three moves.   But wait, there's more!   You can steal your opponent's cards, and vice versa! If you grab a card from his area (or the other way around,) the card underneath does NOT flip over until it becomes his turn, but whenever you clear a pile on your side, you can immediately have access to whatever card is next in the pile (assuming that it's still your turn.) You CAN'T grab more than a single card from each others' piles -- if something is stacked on the other side (grouped,) it's off-limits to you. You can of course move multiple, grouped cards around on your own side.  Here's an example of how it might work:   You already have three Kings grouped, and take a fourth King to add to the pile, then grab a King from your enemy's cards to make five-of-a-kind (yes, unlike real poker, you can have five of the same card.) You use your third turn to select the five kings and deal damage.  This is where the strategy comes in. Now that it's too late and you've used all of your turns, you see your adversary grab that Jack of Hearts from your cards to complete a Royal Flush! EEEK~!!  Here's what you could have done to prevent it and still get your five Kings:   Forget about your three Kings for right now, grab his king, and place it on your single King, making a pair. Grab the Jack of Hearts and put it on top of another card -- ANY other card! It's better if you can do something with it, of course, but the point is to keep that card AWAY from your opponent. Now you can do one of two things: Do something beneficial (like moving a card to help yourself and/or hurt his progress) or you can move the pair of Kings on top of the three-of-a-kind, and make your attack in an upcoming round.  But wait, there's more!   Along the way we earn (via battles) and find special-use cards that can do anything from give you extra moves before your turn is over to poisoning to shielding yourself, to adding to your hit points, and more! You can only have a certain number of cards with you at the time of each battle, and (most of) the cards have finite-uses. When they run out uses, you can use the money you earn to recharge the cards.  Be sure to SAVE before each battle! You can abandon your progress if you wish -- it's an option to exit or go back to the main menu without saving.  There a bit more to it than that, including a storyline, but I'll let you discover that for yourself. ;)  This game was a huge surprise to me -- I never expected it to be so fun and addictive! A definite thumbs-up from me!",
            "review_score": "1"
        },
        {
            "review_text": "Make sure you like the core poker-styled game mechanic before you buy because that (and the nice presentation) carry the game. If you like the gameplay, this would be a good game for you. If you're unsure or not especially enthused, there are other games that might suit you better.  Took me a couple of tries to finish the game; I stopped playing and restarted a couple times because I got bored with the game mechanic or early grinding for silver.  Not a very long game once you learn how to properly win games. The story is really like a prelude to the 'real story' which is never revealed. The ending is pretty lackluster. As far as I can tell, there is no reason to Continue+ (for achievements, it's better to just not do the last stage so don't have to unlock all the map again).  Almost all allies are either impractical or unnecessary. Hrodbrokk is a pretty good source of damage for the RP/AP it takes; Brin is usually a waste of a turn because you should be better off moving cards around for bigger damage and using the RP elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best card based game I have ever played. And now it's a real bargain, you cannot have good enough reason to not buy it. ;-)",
            "review_score": "1"
        },
        {
            "review_text": "Promising start, with really polished UI and tutorial, but game crashes upon leaving the first village, and there's no known solution nor support available. Until I figure it out, or find a computer on which it doesn't crash, I cannot give a better review. But watch out for this if you want to buy the game.",
            "review_score": "-1"
        },
        {
            "review_text": "A good game in the beginning but later it gets boring and eventually even frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "As a avid player of Match-3 games, and appreciator of the Puzzle Quest saga, I convinced myself to give Runespell: Overture a shot, intrigued by the fact you play with a standard deck of cards instead of coloured gems.  The first battles were interesting, the poker-like combos felt novel. Diving more deeply into the game, it got more depth with the addition of magic cards and sidekicks.  Unfortunately, it appeared that most of the magic cards are just copies of the same basic spell (unlike other games where fire, ice, lightning and poison have different tactical effects).  From that point, the battles felt too much similar to sustain interest, and the constant sight of these clubs, diamonds, hearts and spades turned the fantasy background into the trivial one your regular Solitaire.  These kind of games are supposed to be easy to develop on a reasonable budget, deliberately limiting fancy graphics to focus solely on gameplay depth. Sadly, this game is a living testimony of a team being too lazy or too tired to make a truly great game.   Maybe they lost faith in this game at some point. No wonder this happened to me too.",
            "review_score": "-1"
        },
        {
            "review_text": "Hard to tell the difference between clubs and spades especially. Sometimes I make the wrong diamonds and hearts also. Fix this, please.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of those games that makes me wish we had a 'thumbs in the middle' button. I liked it overall, but there were times where my experience just felt frustrating, and I don't think it was my playing poorly or anything like that, I think it's just an awkward design at times. If you're looking for a card game, there are better games, but it's not the worst one on the market.",
            "review_score": "1"
        },
        {
            "review_text": "The most bad ♥♥♥ poker game around. With great music/graphics and gameplay...this game will make you pumped to play poker. Simply awesome.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fairly terrible, but I can't stop playing.",
            "review_score": "1"
        },
        {
            "review_text": "Runespell is a decent puzzle, nice poker mechanics and visuals. Obviously influenced by Puzzle Quest, but not that deep. It's not very short, you can easily get 15-20 hours out of it, also there are achievements and New Game+. Music is great. all 3 tracks, so it gets quite repetitive. Multiplayer and dlc would be great additions, but apparently this game is abandoned by the developers.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, although about poker, none poker skill require. Kinda half strategic gameplay (make your hands stronger, while prevent opponent from getting stronger hands and using powercards) and half luck (all cards come out ramdonly). Still, the only thing I really hate in this game is some enemies' powercards are cheating.",
            "review_score": "1"
        },
        {
            "review_text": "nice little solitare/poker card game. The humor is alright. No bugs. the only complaint i have is there is no autosave but you can save manually so if you computer turns off etc and you for got to save your poop out of luck. (I'm clearly talking from experience.)",
            "review_score": "1"
        },
        {
            "review_text": "Wish there was a neutral rating for games like this... Not bad because I like card games combined with RPG elements but this one has some serious flaws (too repetitive, lack of content etc) and mostly the end game. It sucks so much...",
            "review_score": "1"
        },
        {
            "review_text": "Runespell: Overture - Solid 7/10 TL:DR; Looks like a port from Mobile, but plays well enough to let you enjoy it. Good graphics, bad sound, decent gameplay idea.   Graphics: 8/10 Game appears behaving like a typical mobile title, with big icons, colourful sprites, single click interface. This is rather small title, so not much can be expected - but it does not disapoint anywhere.   Sound: 5/10 Absolutelly atrocious music, unfit for a title, where you need to pause for a while and think about your choices.  Sound effects are average to say at best, nothing that will make a lasting impact or increase immersion. Could be worse.  Storyline: 7/10 There is a story line, suprisingly, quite decent one. There seem to be no nonsense in story arcs, characters do all fit the setting. Unfortunatelly dialogues are absolutelly atrocious. You have a medieval world full of legends with dialogues using words from modern teenagers dictionary. Unpolished dialogue lines are possibly the greatest issue I had while playing that game (after I turned off the music).  Gameplay: 7/10 There are issues with a screen display and game settings not being saved correctly.  This is quite visible, because the game is best played in 30m to 1h bursts rater than as single continuous experience.  And the experience is sometimes uneven.  This game features poker-like mechanism of matching cards in 5 sets of poker type hands to perform 'attacks' that damage health of your opponens. This is as fun as it sounds, but wait, there is more! You can steal cards from your opponent hand, you have runecards (effectively magic, limited use), companion cards (unlimited use), passive cards that increase your stats.  This extra layer of cards is put separate from your regular playing cards that you match during a duel.   This is as cool as it sounds, however the single duel can take a long time and its outcome is quite often random - as the card you get are randomized - which means that in 30m of gameplay you will have 3 to 5 duels (five being lucky) and some story line.  Past that it is really repetitive and that is why playing this game in short sessions is recommended.  Solid 7/10, recommend buy if a fan of a genre, wait for sale if not.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting twist on Poker with RPG elements",
            "review_score": "1"
        },
        {
            "review_text": "This game has a simple card playing mechanic where you play poker against an enemy to win. Powerups and collectible cards also help with gameplay and has an RPG style story that's interesting. A casual game that's easy to pick up and get addicted to. Great little game overall.  ",
            "review_score": "1"
        },
        {
            "review_text": "A very good casual RPG-poker game with perfectly fitting music and visual style.  Worth the weight.",
            "review_score": "1"
        },
        {
            "review_text": "An entertaining poker + solitaire combo with decent production values behind it. Probably won't take more than a week to beeat, but I bet you'll have fun while doing it. I particularly like the music, and the combat is fast paced and fun... for a card game.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! What a great game. Neat take on turn-based strategy. Good story and characters as well. And a great price to boot!",
            "review_score": "1"
        },
        {
            "review_text": "WOW! I mean, this is just an awesome game! It offers the wonderful stragetic aspects of poker, with the bejeweled like rush of just creating attacks and chaining them. Sure, the poker aspect can be offputting for some people, but the liberal moving of the cards makes this game a lot more fun!",
            "review_score": "1"
        },
        {
            "review_text": "If you like card games, you will like this competative version of poker and roll playing. I had so much fun with the demo, I had to purchase the full version. Only complaint, it's too short. Give it a try, you'll like it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a mix of solitaire, with a bit of poker and elements from RPGs that is really addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Cannot change volume",
            "review_score": "-1"
        },
        {
            "review_text": "Really liked this game. I'm a big sucker for card games and have wasted X amout of time on Windows Solitaire so this was a given. If you don't like poker or fantasy you shouldn't bother though.",
            "review_score": "1"
        }
    ]
}