{
    "app_id": 10230,
    "name": "Dead Mountaineer's Hotel",
    "release_date": "2011-10-28",
    "developer": [
        "Electronic Paradise"
    ],
    "publisher": [
        "Akella"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 25,
    "negative_ratings": 63,
    "price": 5.59,
    "description": "The remote hotel stands atop an ominous snow-peaked mountain, and death permeates every inch of the place. A crime has been committed here obviously, and the remote nature of the retreat means that the culprit is still roaming the halls. Which of the guests is capable of this? Whose past hides sinister truths and who has the most to gain?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/10230/header.jpg?t=1447354813",
    "minimum_requirements": "OS: Windows XP/Vista/7Processor: Pentium IV 2.7 GHzMemory: 1024 MB RAMHard Disk Space: 2.3 GBVideo Card: 256 MB DirectX 9-certified 3D video card (GeForce 6600 or higher)DirectX&reg;: 9.0Sound: DirectX 9-certified sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "'A call button... purple maybe....'  OPTION A: *PRESS IT?* OPTION B: *DON'T PRESS IT?*  *SELECTED: OPTION A*  '...PRESS it...!' *Presses button.  And then... well... yes.  CONS:   1) Bad voice acting: Atrocious. 2) Gordon Ramsay didn't give his permission to be the main character, or in costume. 3) The ending.  PROS:   1) It's so stupid it's amusing at times. 2) A dog is a scholar, apparently.  Do I recommend? Oh gawd, no.   Was it gifted to you? Good luck with that!  ..then again, it's so bad it's amusing... watch a 'Let's Play' or something instead :)",
            "review_score": "-1"
        },
        {
            "review_text": "There's some good stuff here, interesting characters, and setting thanks to the novel it's based. I would say it's better than the film of that novel, which can be seen on youtube, but it's all so very slow, the hotel is quite large and as soon as your character gets to one end of it, he's sent back to the other. Also there are too many puzzles and tasks which don't actually require any puzzling. I would recommend it if you're interested in the Strugatsky brothers (of Stalker(aka Roadside Picnic) the Inhabited Island, and Hard to Be a God) but not to anyone else.",
            "review_score": "-1"
        },
        {
            "review_text": "Voice acting alone killed it for me. I would just call it voice reading a script.",
            "review_score": "-1"
        },
        {
            "review_text": "It's bad... trust me....",
            "review_score": "-1"
        },
        {
            "review_text": "Ready for a mystery game? Then grab scooby doo jump in the mystery and drive it off a cliff, just end it all now if you plan on finishing this game.  The voice acting sounds literally like their reading off a page, no matter what the characters are doing, walking, or running, in danger, their voice stays the same flat or unconcerned. Get ready for ALOT of bad voice acting since this game is story driven. The main character sounds angry at everything when he talks, just looking at in game items makes him mad. I am guessing he is mad for being in one of the worst games ever made. I got five minutes into the game and got stuck, unable to continue, with no hint system or anything I turned it off and deleted it.  Every single time you move to another screen the game loads like an old Resident evil game, except in this game its not passing through a door, just walking to the other side of a room makes the game load. This game is so bad it makes you feel dirty for owning it, the kind of dirty you cant wash off.   Rating: 0/10 Value: $-9.99 (Notice that is negative, we should be PAYED to play crap like this!)",
            "review_score": "-1"
        },
        {
            "review_text": "ugh... where to start with this game... lets see if i can put this nicely, this game makes me want to punt babies and kittens... broken from the get go and crashes constantly, however the opening scenes are ok. the good thing is that the best part... before it crashes...",
            "review_score": "-1"
        },
        {
            "review_text": "i recommend that you dont buy this ♥♥♥♥♥♥♥♥ game , i cant even get guy to move from spot i started game at . and i hit every key possible hehe ",
            "review_score": "1"
        }
    ]
}