{
    "app_id": 102600,
    "name": "Orcs Must Die!",
    "release_date": "2011-10-11",
    "developer": [
        "Robot Entertainment"
    ],
    "publisher": [
        "Robot Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Action",
        "Strategy"
    ],
    "achievements": 27,
    "positive_ratings": 5371,
    "negative_ratings": 180,
    "price": 7.99,
    "description": "Slice them, burn them, skewer them, and launch them - no matter how you get it done, orcs must die in this fantasy action-strategy game from Robot Entertainment. As a powerful War Mage with dozens of deadly weapons, spells, and traps at your fingertips, defend twenty-four fortresses from a rampaging mob of beastly enemies, including...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/102600/header.jpg?t=1537484197",
    "minimum_requirements": "OS:Windows XP, Windows Vista or Windows 7 Processor:2GHz Dual Core Memory:2 GB RAM Graphics:NVIDIA GeForce 6800 or ATI Radeon x1950 or better with 256MB VRAM DirectX®:dx90c Hard Drive:5 GB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Here we have a very fun game, but it can get you very angry when you try to complete it perfectly. I completed with multiple rage quits.  The proposal is simple, tower defense, prevent the orcs from reaching the portal, there are different types of enemies with different behaviors. The fun is to develop a strategy with the available traps, exploring the scenario in order to exterminate all. The vision in the third person possibility you to actively participate in the struggle, something different in these types of games.  With a fun and intuitive gameplay, the graphics also pleases with his cartoonish appearance, the sound of stacks of orcs being crushed and torn is comforting. The plot is simple, just an excuse to kill orcs in many ways.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, totally love it &lt;3.  It has everything to spend a great evening: +Cartoonish but high quality graphics - Great animantions of everything - traps, spells, orcs deaths. Lovely. +Variety of enemies (and even allies) - different enemies, different approaches. +Gameplay: provides awesome replayability which is just great for a singleplayer game - this is a towerdefence game AND you are playing as a hero that places those towers, so you can play with more offensive traps so they do everything for you, you can put more effort into leveling your character and kill all the orcs manually, or you can buy some troops and make more defensive traps to block the enemies. Great game. Good level design and nice story. +If you lucky enough - you can catch this game for 90% on sale - instabuy (dont forget the dlcs they are very usefull) +3 difficulties +Nice OST  Overall, i loved everything about this game. Very well done.",
            "review_score": "1"
        },
        {
            "review_text": "For those who don't know, it's a third-person tower defense set in a fantasy world. You're a war mage and your job is to defend the human world from the invading orcs. That's the synopsis in a nut shell without giving too much away, the rest is orc slaying fun history.  There's a variety of useful items including but not limited to 2 main weapons, 4 spells, 10 ground traps, 4 wall traps, 3 ceiling traps, 2 minions, and 3 'Weavers.' All of those have various uses and abilities and it's all up to you as to how to best deploy them against the enemy. That's not even including the DLC. Weavers are simply menus with available upgrades you can purchase with cash earned from waves. You get a limit of which items you can use per mission, the max being 9 available slots. You are also able to upgrade traps when the time comes with 'skulls' earned after each victory. So it's somewhat tactical, you need to strategise your approach when starting a new map. It gives you a moment of grace to choose which traps to use and to scout the map.  The music is upbeat and catchy, it compliments the protagonists witty commentary and the bloody orc slaying perfectly. I haven't encountered anything negative to say about it.  The sounds effects are crisp and simple, nothing special of note here. The one sound that got on my nerves was the Autoballista firing sound, it's a loud  WHOOOOSH  and drives me nuts when I have a lot of them. Other than that, I don't mind the rest, it's very atmospheric. The sound that sent chills down my spine was the sound a flock of Fire Babies makes, it's very ominous.  There's no endless mode, if you want an endless mode then get the second game. However, you can create a mod of the existing levels and add or modify waves. It's hands-on and takes patience and some planning on your part to do this, it's not an in-game feature.   Pros:",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, I'm waiting for next part.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is gritty, easy to learn, and difficult to master. The game is quirky, doesn't take itself too seriously, and is easy to pick up, but hard to put back down. It has a few shortcomings (no CoOp), and Nightmare isn't quite as difficult in this original as it was in the sequel, but the gameplay is still going to challenge players of every skill level.  For those of us who love Tower Defense/FPS hybrids, this game is a solid purchase at anything under $10, and a steal when it dips below $5. If you play through the achievements (all of which are reasonable), you can expect about 15 hours of very enjoyable gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Fantastic mix of tower-defense and FPS genres, allowing you to tailor your experience to whichever you prefer. Additionally, decent graphics and music, and hilarious tongue-in-cheek narration (you may recognize the voice actor as Axton from Borderlands 2 Cons: Extremely difficult to get 5 skulls in some of the levels, which requires many replays (it reminded me of the rating system for Angry Birds in that way) Recommendation: Buy the game. It's so addicting.",
            "review_score": "1"
        },
        {
            "review_text": "1",
            "review_score": "1"
        },
        {
            "review_text": "I got this game from a bundle sale, I wasn't expecting it to be good.  After some months after buying this game I gave it a try and the experience is sweet!  The game offers you a simple yet challenging gameplay.  Like a tower defense game you only need to prevent the enemies (in this game Orcs,Gnolls,Ogres,etc.) from getting into the Portal (Rift).  You can plant traps and use you hero to cut them,shoot, and kill them with spells, this makes the game more interactive. (which isn't like other tower defense game where you have to wait and watch after planting your towers)  The story is good too simple and funny which makes getting to another level somehow enjoyable as you get to know what and why the orcs are attacking.  The Hero isn't boring either and you get to somehow love the guy as his humor and sarcasm is pretty entertaining and funny.  Grab this game and have some fun. (Have some fun and watch what the traps do to the Orcs.) ",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of my favourite games. Truly it is fun setting up traps and slashing/burning/shooting/etc these orcs.",
            "review_score": "1"
        },
        {
            "review_text": "Orcs Must Die! is a fun, addictive game that combines twitchy, arcade shooter goodness with tower defense mechanics to hold back the neverending tide of Orc invaders. The levels are well designed and the traps are some of the most unique I've seen in the genre. From bubbling pools of lava, to spring boards that launch enemies into ponds of acid, as well as the classic spike and arrow traps, you'll have more options than you know what to do with. The story is basic but complimented by funny banter from the main character and is told through voice over and still images.  Perhaps the games greatest strength relies in the the 3rd person shooter elements. You're not relegated to simply laying traps and hoping for the best. Instead, you can fight alongside your machinations, whether it's with a spear, crossbow, or magic; you yourself lend a hand in achieving victory. It's fun and fast paced and keeps the player engaged in each level as well as providing room for error when setting up traps. This is something, I feel, the genre as a whole is in need of. Too often in these style of games, the player is relagated to one or two winning strategies that are only uncovered through tedious trial and error. In Orcs Must Die!, the player can create endless combinations to achieve victory precisely because they can shoot and stab the orcs alongside the traps.  In the end, it's a fun, addictive game with 3 difficulty levels and plenty of replay value. There's also a sequel worth mentioning. So if you like tower defense games, this is a must buy. If you don't, I'd still check this out on the cheap during a steam sale. It just might surprise you.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome because ORCS MUST DIE!!! Seriously now, awesome from all points but the bad thing is : FFS why not co-op !!!",
            "review_score": "1"
        },
        {
            "review_text": "Orcs Must Die! is an surprisingly fun and satisfying tower defense/action hybrid based around slaughtering hoards of Orcs in some very creative ways. Playing as a war mage, you use a combination of traps, weapons, and spells to beat hordes of orcs, ogres and other bad guys. The game play is fun, and it's really satisfying to watch the enemies get ripped apart by your traps. There are several levels of difficulty, so even the most skilled players can find a challenge here. The fact that you can upgrade your traps is very handy especially as you move through the levels and there are several DLC for this game as well expanding this game even more. Orcs Must Die! is a very good take on a tower defense game with lots of features and nice graphics. I didn't expect much from this game at first, but it turned out to be surprisingly good!",
            "review_score": "1"
        },
        {
            "review_text": "I love Tower Defense games and this definitely has a unique twist to it. Instead of towers, you set traps and fight as yourself in 3rd person. You are rewarded for comboing multiple traps and slowly unlock new traps and powers. I also like the cartoony art style, makes me not feel as bad for slaughtering hundreds of Orcs. Very fun times.",
            "review_score": "1"
        },
        {
            "review_text": "very fun game, a slight twist in the tower defence formula, you have to defend a rift by placing traps, guardians, etc and using your own weapon too to defeat the invading orcs  for old-school gamers, the closest comparison will be 'The Horde', although with less zany humor :p (still quite funny though)",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes, i almost feel bad for the orcs. Except... not really.",
            "review_score": "1"
        },
        {
            "review_text": "There is only one thing you must know.   And that is this:  Orcs Must Die.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome single player game, cool story line!",
            "review_score": "1"
        },
        {
            "review_text": "Orcs Must Die! is tons of fun! Tower Defense at it's most fun. The trap variety is great, giving you ample opportunity to come at a map from wildly different directions, and the character dialog is laugh out loud funny! This is a wild and faced paced ride.",
            "review_score": "1"
        },
        {
            "review_text": "While there's a fair amount of window dressing in the form of traps, guardians, and rifts, Orc Headshot Simulator is the single best game for shooting orcs in the face with a crossbow. Even Orc Headshot Simulator 2 doesn't compare, except for coop mode.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, What to say here. First this game is worth 50$ Because I have played similar Big name games of this Sub genre and they could not compare at all. Any Fans of Tower defense games or the dungeon master series will not be dissapointed. Gameplay is superbly fun since there are so many different ways you can build your Defense, You can either build defenses and Stay back or get up in the action and hack and slash. All in All i would definetely give this game 5 Thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Well orcs must die. Now go KILL SOME ORCS!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Think Dungeon Defenders, but Single Player only, and more chaotic. Basically, you're this warmage guy that needs to defend these portals called Rifts, and you need to defend it from the orcs and other enemies that try to go through it.  You can lay traps, place guardians, use a bow or sword, or even use magic such as fire, ice, lightning, or even wind to defeat the orcs.  A pretty fun title overall, it has a good amount of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is kinda similiar to Plants vs. Zombies but in 3D.In here you can cast spells, upgrade weapons.There are multiple pathways to defend which needs a bit of exploration so you can decide the positioning or placing of weapons before unleashing the orcs (Orcs and additional enemies may varies depending on what level are you in).It's actually enjoyable imo.",
            "review_score": "1"
        },
        {
            "review_text": "Orcs Must Die is a game where there's orcs... and... they must die. Why? ♥♥♥♥ing, I don't know, they're evil and they're breaking into your castle or some ♥♥♥♥. Anyway, it's basically like a 3D tower-defense where you play as a ♥♥♥♥♥♥♥♥♥ with a crossbow who can put traps in places to mercilessly slaughter all the orcs. You gotta make sure they don't all get through, or else you'll lose, or if you're like me, if one gets through, then you gotta start over because that's prevented you from getting the highest possible score. In all seriousness though, this is really fun game, and if you can catch it on sale, consider yourself lucky.",
            "review_score": "1"
        },
        {
            "review_text": "A very pleasant game. I think there are quite a few traps you won't be using at all, simply because you can't do without the few basic ones (and you only can take a few kinds of traps into each mission.) That's a shame, but not really a big deal.   I was quite surprised how the game managed to drag me in and kill my entire evening in a 'just one more level and I'll go to sleep' fashion, on multiple occasions.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to give this game a legitimate chance before I wrote my review. I am an avid tower defense gamer; there is just something undeniably satisfying about stoping someone from reaching their goal.... its actually kind of sick really. This brings an intresting change of pace. The humor is pretty engaging, I find myself eager with each new level to hear what kind of quip the War Mage will say. The traps are creative and encourage you to find new ways to supress the Orcs. Will your bombard them with Archers while they are arduously walking through a tar pit, or perhaps you would like to take them on yourself while cattle them into a grinder. Whatever menacingly creative way you wish to protect the rift, this game has something for you.  Play it if : You love tower defense (I assure you, you won't be dissapointed) Avoid it if: You are an Orc Lover, You are not creative, or obviously if you don't like tower defense   9/10 in my book The only thing holding it back is no mutiplayer, but the second game remedied that issue",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game for Tower defense lovers, all that you love with a twist. Good combination between being a hero and also the builder.",
            "review_score": "1"
        },
        {
            "review_text": "A tidy, charismatic point defence game that deserves to be up there with the big names like PvZ yet strangley only came to me attention in the last week. Well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "cute and fun. More fun than 2? Harder as it's single player only though.",
            "review_score": "1"
        },
        {
            "review_text": "Like tower defense games? How about in third person? Also do you like killing lots of orcs? Well then Orcs Must Die is the game for you as it has all 3. It's a really fun and addictive third person tower shooter game with really good gadgets and varied and tough enemies. You get to be really creative with the defense using all the neat gadgets in your arsenal. Also, the A.I is good in this game. Overall, if you like tower defense games, you'll have plenty of fun times in this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game out of all 3 games is the best  The first orcs must die is for solo play and its good !!!!!  The second orcs must die is the game for 2 players coop !!!!  The third I dont know what happened turned to garbage",
            "review_score": "1"
        },
        {
            "review_text": "The Game is fun an outrages!!! 8/10!",
            "review_score": "1"
        },
        {
            "review_text": "Get this now, loads of fun action and tower defense. Funny main character.",
            "review_score": "1"
        },
        {
            "review_text": "Orcs Must Die is a drama of apocalyptic dimensions. You’ll run around killing them with a mixture of clever traps and third person shooting but this tower defense game is really the story of the poor Orcs that you decimate. Every Orc’s story is told with a hallucinatory intensity, whether they were tossed off a cliff by a spring, slowed by tar before being perforated by poison arrows, burned to a crisp by ground based fire traps, or stabbed to death by the merciless protagonist. Orcs may not be real, but their trials and tribulations have taught me more about the fragility and splendor that we call life.  I can’t express how transformative this masterpiece is. Let’s be clear, it’s not just a masterpiece of the tower defense genre, but of humanity itself. Orcs must die has turned me into a better person. As a result of this game I’ve decided to clean up my act. I will no longer leave spike traps on the floor lest my future offspring trigger them. Also, I will try being friendly with strangers rather than freezing and shattering them.  ",
            "review_score": "1"
        },
        {
            "review_text": "Orcs Must Die! is not just an average Tower Defense/Third-Person... It's something special.... Take a moment, and imagine this: You're a Knight. You have a powerful Cross Bow and long Sword. You slay Orcs day and night. And best of all, the adventure is in YOUR hands. How will you kill Orcs? Why must we kill Orcs? Simple. Orcs. Must. Die.",
            "review_score": "1"
        },
        {
            "review_text": "ONE OF THE BEST GAMES I EVER PLAYED I OWNED THE GAME BEFORE ON ANOTHER SITE BUT ITS SOO GOOD I HAD TO GET IT AGAIN ON STEAM SO THATS HOW GOOD IT IS SO GOOD GOTTA BY IT TWICE ONE OF MY FAV GAMES IT IS WORTH EVERY CENT",
            "review_score": "1"
        },
        {
            "review_text": "Excellent tower-defense action game. Really. It's also not DLC infested like dungeon defenders.  Only complaint could be the lack of CO-OP but then again, orcs must die 2 is right around the corner. Can't wait for it.  This game is more action oriented than Dungeon Defenders, so you're contanstly doing something.  This game offers many traps and 3 different difficulties. And yes, the hard mode is hard. Not impossible though.  One of the best tower-defense i've ever played.  Overall: 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is so very unique! A good break from my usual games and a great deal of fun! It deserves the GOTY reward it earned.  So many fun mechanics! Love the gameplay! flatout 9.75/10 It earned it :D:",
            "review_score": "1"
        },
        {
            "review_text": "The most offensive orcs game I ever played but who cares. It's fun XD",
            "review_score": "1"
        },
        {
            "review_text": "I buy it now! And.... i can confirm on HD graphic it's play well :)   Game it's good and a lot of fun!  Now will try org must die! 2! :)))",
            "review_score": "1"
        },
        {
            "review_text": "What you need to know about this game:  It's a First Person Shooter Tower Defence game, where you are up agains a army of hundreds of thousands orcs...  The music and grafics are brilliant, and the humor of the game is simply brilliant! (you get alot of 1 liners while playing the game) and the game have an insane about of replayability, especially if you are the kind of person that loves to complete a map 'perfectly' like me (a perfectionist) and even if you aren't the game is still well worth its price.  I highly recommend this game :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is freakin great. Hilarious, extremely fun, and incredibly attractive. The graphics aren't necessarily technically stunning, but when I think about good-looking games, this one always comes to mind. Unfortunately, the DLC items are overpowered. For a better experience, don't use the alchemy bombs. They make it way too easy.",
            "review_score": "1"
        },
        {
            "review_text": "A real fun game, with some mindless orckilling, and some not-so-mindless killing. Place the traps right when you can, and you're good!",
            "review_score": "1"
        },
        {
            "review_text": "Fun. Try out OMD 2.",
            "review_score": "1"
        },
        {
            "review_text": "Jean Kirstein strongly approves of this game.",
            "review_score": "1"
        },
        {
            "review_text": "I feel sorry for the female orcs..........",
            "review_score": "1"
        },
        {
            "review_text": "Hands up who wants to die!",
            "review_score": "1"
        },
        {
            "review_text": "Orcs Must Die, what are you waiting for? buy the game, or no, hold on, now that hte second one is out buy the second one.",
            "review_score": "1"
        },
        {
            "review_text": "A Great Singlepayer Third Person Tower Defence, If that's what you're looking for and If that's not what you want then buy it anyways",
            "review_score": "1"
        },
        {
            "review_text": "Wow, the tower defense titles these days actually improve on what is already a fun game genre. In Orcs Must Die you control a warmage, in third person view. So instead of building traps in an isometric sort of view, you now run around setting up traps and actively killing enemies with your character. There's never a dull moment and the fact that you gain new traps after finishing a level gives incentive to keep playing. You'll want to come back for more, it's THAT fun. Other than that, the game mechanics are pretty much the same as any other tower defense game; you kill enemies, earn cash, upgrade traps, and try to prevent enemies from taking over your rifts. Only downside, in my opinion, is that it's a single-player affair. I'm sure it would've been more fun when played in co-op mode but maybe that's something for the sequel. Don't let that stop you from buying it though !  [Rating: 87/100]",
            "review_score": "1"
        },
        {
            "review_text": "Pretty accurate marketing.",
            "review_score": "1"
        },
        {
            "review_text": "A little rough around the edges but a fun little td type action game.",
            "review_score": "1"
        },
        {
            "review_text": "Boring too quick",
            "review_score": "1"
        },
        {
            "review_text": "Orcs and more need to die.  Traps traps traps, kill kill kill Good fun.",
            "review_score": "1"
        },
        {
            "review_text": "Its actually not bad",
            "review_score": "1"
        },
        {
            "review_text": "A great Tower Defence + FPS, must have!",
            "review_score": "1"
        },
        {
            "review_text": "Theese",
            "review_score": "1"
        },
        {
            "review_text": "there be goblins",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great times! Funny easily enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game for lovers of third person ",
            "review_score": "1"
        },
        {
            "review_text": "ANOTHER freaking tower defense game? Okay so long as it's THIS one.",
            "review_score": "1"
        },
        {
            "review_text": "It's an action Tower Defense game. You place traps then you help shooting monsters down before they reach the goal.  Buy the second one. Skip this one. The second even has most maps from this game, and has co-op which is missing here. Feels more like an incomplete and simple game.",
            "review_score": "-1"
        },
        {
            "review_text": "it's like skyrim with orcs",
            "review_score": "1"
        },
        {
            "review_text": "This game is like Dungeon Defenders but without the gear treadmill and useless cash-grabs.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun until you realise it is just a regular horde game and you can't really combo the traps together very much. Just get the sequel.",
            "review_score": "-1"
        },
        {
            "review_text": "this isnt a tower defance game, this is a hack and slash game with 2 weak weapons with an idiotic loud mouth duchbag charecter.  traps and defences are useles and weak, and too expensive to buy or update.  money is too low and hard to come by.  way to hard and repetative to eaven bother. and there is the occasional crashing.  nope.",
            "review_score": "-1"
        },
        {
            "review_text": "That was a nice game but boring as hell. Sequel is much better.",
            "review_score": "-1"
        },
        {
            "review_text": "ERROR:Failed to load 'shaders\\FixedFunctionShaders.ShaderLib' Engine will not run.",
            "review_score": "-1"
        },
        {
            "review_text": "Orcs Must Die is one of my least favorite games. I think this would be a great game if it was sort of like Torchlight II. You really need a pet or an ally to help you. This game reminds me of an old game called Lemmings. It was impossible for me to prevent the Orcs from destroying everything. I never could master the gameplay. The demo was fun to play. The rest of the game was a nightmare.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate this.",
            "review_score": "-1"
        },
        {
            "review_text": "Why continue to propagation of the wide misconception in our society that orcs are intrinsically evil and therefore must be slain. It is this kind of hatred propaganda that we need to have removed from our society and place out of reach of the impressionable minds of our youth.",
            "review_score": "-1"
        },
        {
            "review_text": "I've only played this game for a few hours but so far it has been a very fun experience. The early levels are fairly easy but it gets trickier and more strategic as the number of possible enemy paths increases. The cartoon graphics are an acquired taste but bring an appreciable casual twist. A good aray of weapons eventhough the crossbow is completely OP!  I do regret the fact that there is no other game mode available different from 'Campaign', keeping in mind each level warrants a second or third playthrough due to the ability to utilize newly acquired upgrades in played levels to increase score. THIS IS A SCORING GAME. If that is not your thing, you might be dissa.pointed by a too short game. However, if you find it a under 5$ (Holiday sales yay!). It's totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great tower defnse game that I could play for hours on end! the combat is fun and making awesome defenses adds to the fun of the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good. You basically slaughter orcs with traps and tower defense skills, but you are also in the thick of the action shooting orcs with a crossbow and other useful weapons.   Cons  This game is racist against all orc kind. For the Horde! Gameplay gets repetive after a while",
            "review_score": "1"
        },
        {
            "review_text": "Funny dialogue, solid mechanics, creative traps, and well-designed levels add up to an addictively challenging and fun game. I'd suggest getting the bundle, since OMD!2 is even bigger and better.",
            "review_score": "1"
        },
        {
            "review_text": "This game is much more fun than I expected. Nightmare mode is a bit too intense though...",
            "review_score": "1"
        },
        {
            "review_text": "Most definitely the best indie game I've played. BY FAR!",
            "review_score": "1"
        },
        {
            "review_text": "I only bought this for the Steam achievement but it turns out to be an excellent game. Tower defence plus stubbing, and the Orcs MUST Die.",
            "review_score": "1"
        },
        {
            "review_text": "Not just your average tower defense game. Really clever with a fun sense of humor.",
            "review_score": "1"
        },
        {
            "review_text": "Do you think it's a game in which you only kill orcs? Think again! Even though you're in a slaughter-roll, it's all about strategy. With various traps and spells you have to make the best choise in order to defeat them. So.. be free my dear apprentice and show them that they're no match for you xD",
            "review_score": "1"
        },
        {
            "review_text": "Cocky mages, large breasted Elves and swathes of Orcs. Swoon.",
            "review_score": "1"
        },
        {
            "review_text": "You're killing orcs. Hordes and hordes of orcs. Burn them, spear them, drop them in acid, freeze them, shoot them, chop them up, make orc stew. I can't think of a more fun way to waste an entertainment hour than to kill a few hundred more orcs!",
            "review_score": "1"
        },
        {
            "review_text": "Fun take on tower defense. Third person over the shoulder with traps. Plus it's nice and cheap!",
            "review_score": "1"
        },
        {
            "review_text": "A tower defense/action game, really fun and varied, great for anyone looking for a new TD game",
            "review_score": "1"
        },
        {
            "review_text": "Saying that this game is just slightly addictive would be completely unjust. If you're a fan of tower defense and hack and slash games then this game combines the best of both worlds. Plus this game has tons of load out options for each level, requiring your choices to be well thought out depending on the layout of each level. The game doesn't just entertain you with great gameplay but also with a quirky sense of humor. I definitely recommend this title be bought and played!",
            "review_score": "1"
        },
        {
            "review_text": "A single player tower defense action game. As the name suggest your character must defend a room from an onslaught of orcs. The orcs will come through a door as their starting point. Each will proceed to the end goal at the opposite end (usually) of the room. You will run around setting up traps of all kind. Along floors, walls, and ceilings. Traps consist of lava, tar, spikes, and so on. Unlike alot of other defense games this game has more interaction. During and in between rounds you can purchase and lay your traps through out. However, you can also attack the oncoming orcs with one of two weapons. A melle and range weapon set this game apart. Being able to actively attack enemies makes this that much more fun. No need to feel as just a spectator to the game. Most enemies wont attack you as they are driven to their goal. However, as the levels proceed difficulty increases. With newer enemies comes new threats, and new threats begat new traps to counter. If strategy and defense is your cup of tea. I highly recommend this title as the ability to attack will bring something new that you will enjoy. However, if it is not your cup of tea. I still recommend it for the very same reason.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just plain awesome. Worth every penny. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun to play, humerous, great music, and an all round fantastic game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!!!! so much fun",
            "review_score": "1"
        },
        {
            "review_text": "This is what Aliens: Colonial Marines should have been like!",
            "review_score": "1"
        },
        {
            "review_text": "The foremost trap defense &amp; hack&amp;slash hybrid, Orcs Must Die! provides a very gratifying experience to the gamer looking for something different yet familiar.  Following the traditional tower defense formula, you protect one or more rifts from a wave-based offensive by a large variety of baddies by placing traps on their path to said structures.  Following the not-traditional tower defense formula, after placing your traps and/or NPCs, you're allowed to join the fray while the orc/ogre/goblin/otherwise offensive is raging. Add your bladestaff, spells and/or crossbow to the mix and help defend the rifts.  Add some very nice music and voicework, and you get one of the definitive games of 2011.  I'll add jokes next time.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, really nice puzzle+action game with loads of fun ... kind of gets too hard too quickly, for my liking, but it's bearable.",
            "review_score": "1"
        },
        {
            "review_text": "Of all the recent first-person tower defenses to come out recently, OMD wins on variety and comic relief. A bit annoying you can't take your upgrade points back, though.  One note: Get the Artifact DLC. The poison satchel has saved my butt several times, and it alone is worth the price of the pack... well, the sale price anyways.",
            "review_score": "1"
        },
        {
            "review_text": "SO much better than I thought it'd be. Got hours of enjoyment out of this.",
            "review_score": "1"
        },
        {
            "review_text": "Funny tower defence-type game, which has good graphics, great music and lots of orcs to kill.",
            "review_score": "1"
        },
        {
            "review_text": "Never has mass murder been more fun! Those poor Orcs never stood a chance. Even going back to 'perfect' levels was entertaining. Simple premise, months of fun as you find yourself going back now and again. ",
            "review_score": "1"
        },
        {
            "review_text": "Fun, no bugs met, fast-paced. If you these series only now, starting from first is still a good idea.",
            "review_score": "1"
        },
        {
            "review_text": "Good lord, this game is addicting! Tower defense + third-person action = Complete Win! If you enjoy tower defense or third-person RPGs, this game will kick you square in the ♥♥♥ with awesomeness. GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "it was a realy fun game",
            "review_score": "1"
        },
        {
            "review_text": "A real surprise, it's a fun game and has lots of replayability. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "80%",
            "review_score": "1"
        },
        {
            "review_text": "Great game, lots of fun. Set up traps, watch orcs die. It's also fun revisiting old levels with new tools that you have earned and playing through it a completely different way.  The Artifacts of Power DLC has some fun toys in it; I've found the Floor Scorcher particularly useful.",
            "review_score": "1"
        },
        {
            "review_text": "Nice tower defense and shooter",
            "review_score": "1"
        },
        {
            "review_text": "Pooty and the ♥♥♥♥♥♥♥♥'s Official Seal of Approval.  (Seal represents a game that we've actually completed. These games may not be the highest critically reviewed in every case, but there was something about them that carried us through to the end. When your library has grown as large as ours have, this means something special.)",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games - a tower defense shooter with a load of ingenious traps, humor, and fast-paced action.",
            "review_score": "1"
        },
        {
            "review_text": "This game is addicting. It's a ton of fun and why aren't you playing it yet?!",
            "review_score": "1"
        },
        {
            "review_text": "Orcs most definitely need to die. This game allows you tons of freedom to make them do just that. Great frantic fun and if you want something more on the cooperative side then Dungeon Defenders offers a similar experience but for 4 people.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! After a long day, just give this a whirl. 10 minutes of Orc killin' fun, and a very big smile will be yours!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with good graphics and lots of hard challenges and enemies,very good weapons like the Bladesword (or whatever it was called...),Magic Crossbow,Advanced Arrow Trap,Spike Trap,Pit Trap,Lava and Acid Pit.Suitable for gamers of any age  Love it :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is very awesome. A third person, defense game. What more could you ask for? shooting orcs with a crossbow and using traps to kill those ugly ♥♥♥♥♥♥♥s.   Overall great game and is fun for the average gamer.",
            "review_score": "1"
        },
        {
            "review_text": "Gets my vote for Game of the Year for 2011. Not bad for a budget title eh? I've replayed sooooo many of the levels.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the funnest games Ive played in a long time. Tower defence and third person action combined makes for an AWESOME game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but gets old pretty fast. The multiplayer options in the new one might keep it alive a little longer, but once you've defended against a few rounds you feel like you've pretty much gotten the full experience. If you think a third-person shooter/tower-defense game would compell you to play for multiple hours then it's a pretty good game. Doesn't have much longevity for me.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Addictive! Handle with care.;)",
            "review_score": "1"
        },
        {
            "review_text": "This game is unadulterated fun. It's simple to start, simple to understand, but the carnage that follows is undeniably addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Coool",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how I went so long without playing this game, but it is, without a doubt, the single greatest tower defense and hack and slash game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Its awesome and entertainment game",
            "review_score": "1"
        },
        {
            "review_text": " The Master  should be proud of me",
            "review_score": "1"
        },
        {
            "review_text": "Massive dose of fun!   Introducing spike traps to the orcs and making a disney villain like ex apprentice take down a notch is always fun.  Especially loved the beginning. 'One slip, on a kobold's blood...' lol  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Very nice third person TD,unusual,but very nice,enjoying playing it",
            "review_score": "1"
        },
        {
            "review_text": "I never knew funneling a bunch of orcs into wall axes and commiting mass orc genocide would be something I enjoyed. Thanks for proving me wrong Robot Entertainment! 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, I like it better than the sequal",
            "review_score": "1"
        },
        {
            "review_text": "great game to chill with",
            "review_score": "1"
        },
        {
            "review_text": "Lovable protagonist and simple, addictive, and actually challenging gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Ah, how I love tower defense games. I love this just the same. maybe a little more since i can clean up the messes my tower wont. only been playing a few hours and already addicted. bought it during their 90% steam sale just cause it was cheap and, now I wonder, 'WHY DIDN'T I BUY THIS SOONER?!' It has humor, fun, decent strategy, good music, decent voice acting, and even a story to go with it. Whats not to love?",
            "review_score": "1"
        },
        {
            "review_text": "Best orc slaughter simulation I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A game that i wasnt that interested in to begin with. But i got it during the steam sale. And it was well worth it, it was so much more fun then i had thought looking at those trailers. So go get it even if you are just a little bit interested in it.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, like the name says, you have to kill orcs, there is a single player campaign where you have to defend so called 'rifts'. you can fend of the orcs by creating traps, using magic or kill them with your crossbow or bladestaff. also very funny!",
            "review_score": "1"
        },
        {
            "review_text": "Classic tower defence game, it rules.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed it. Incredibly addcitive. Its nice to see that the ex-ensemble guys are still doing good work. If you like third person action or tower defense you should pick it up. its only 15 bucks. totally worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "Fun in that it becomes addictive, and you get satisfaction out of getting your fix.",
            "review_score": "1"
        },
        {
            "review_text": "I found the game pretty addictive. It's a tower defense game with a wide variety of traps and weapons to choose from. Negotiate with orcs? No! Orcs Must Die!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Cool Tower Defence! Its a little bit challenging i love that!Can't wait to try Orcs Must Die 2 :D",
            "review_score": "1"
        },
        {
            "review_text": "good 3rd person tower defence",
            "review_score": "1"
        },
        {
            "review_text": "What I learned from this game: Orcs can get pierced, slashed, crushed, burnt, frosted, exploded, desintegrated ... and the really nice cartoony graphics make this look even funny. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game. It's kind of like Sanctum but with a fantasy setting instead of a science fiction setting. Build traps, unleash the horde and kill waves of orcs with your crossbow/sword and the traps you've build. At first I thought it was a little easy, but obviously the further you progress teh harder the levels become. I recommend this game to everyone that likes towerdefense-shooter hybrids. The only downside is the lack of multiplayer, but that's what Dungeon Defenders is for I guess.",
            "review_score": "1"
        },
        {
            "review_text": "Loved Orcs Must Die! So much fun and very satisfying setting up your traps for the orcs. Can be quite challenging in parts. Really looking forward now to Orcs Must Die! 2...",
            "review_score": "1"
        },
        {
            "review_text": "Totally addictive, very easy to start, but after a while it starts to test your skills. It's a very fun game to play, really worth the price  100 out of 100 of course ;)",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is similar to tower defense games, but instead of towers, you defend rifts. You prevent orcs from crossing the rifts by setting up traps AND fighting them using your crossbow/blade/spells (3rd Person). You can also customize your warmage (minor spoiler) by using the weavers, which give specific boosts whether you prefer casting spells or being crafty with traps.  Highly recommended for the casual gamer, it's easy to pick up and go. Maps typically has 15 rounds which take no more than 3-5 minutes each (much faster if you are good)",
            "review_score": "1"
        },
        {
            "review_text": "You like orcs? Plenty of them! You hate orcs? What are you waiting for, slaughter them!",
            "review_score": "1"
        },
        {
            "review_text": "A fun, cartoony, tower defense/FPS hybrid game. The controls are fluid and easy to pick up. There's a satisfaction that doesn't come with normal tower defense games where you just sit back and watch. If you liked Sanctum, this is better.",
            "review_score": "1"
        },
        {
            "review_text": "Not only is it one of the best tower defense games ever, but you get to join in the action first-person. And there are so many ways to do it, the maps have a great deal of replay value. I've logged on 100+ hours already, and I'm not done yet.",
            "review_score": "1"
        },
        {
            "review_text": "This game has one liners and orcs, I laugh my ♥♥♥ off every level.  Hwever, if you DON'T want a main character that quips every time he puts a trap down (Step right this way, mister orc.) or when you get a kill streak (Awwwwws, look who has no arms...) You'll probably hate it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the perfect game to just start blasting away at every once in a while. Don't expect to get caught up in it for more than a few days, but while you do, it's great. Plain old orc-blasting ogre-hacking fun. Classic hack n' slash that's simply good at what it does.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite tower-defense game as of now. No co op unlike others, but it doesn't spoil the fun.  Approximately 20 levels with 3 different difficulty settings, nice graphics and charme. Wide variety of traps/spells/npcs to help you kill ALL the orcs!",
            "review_score": "1"
        },
        {
            "review_text": "Great tower defense, but it may get repetitive.  Rating: ★★★☆☆ ",
            "review_score": "1"
        },
        {
            "review_text": "Quirky, easy to play, fun for anyone tower defense game. KILL THEM ORCS!",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game!!!! MUST HAVE!!! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is HIGHLY addicting. If you're a fan of Tower Defense games then this is for you. You just want to see Orcs getting slaughtered by the thousands!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply a must-play for anyone even remotely interested in the tower defense genre. Orcs Must Die blends together strategic trap placement and 3rd person action seamlessly as it delivers a short but sweet experience that you will not soon forget.",
            "review_score": "1"
        },
        {
            "review_text": "What do you need to know that the title doesn't tell you?  This is a great introduction into what is quickly becoming one of my favorite series of games.",
            "review_score": "1"
        },
        {
            "review_text": "there is only one word to describe this game..... AMAZING!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Burst the orcs into pieces! Quite a few weapons and tons of traps promise orc-slashing fun. Nice mechanics, pretty good overview, and a funny background story (which is not all too important, I claim :P ).  All in all a rather nice game to play.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun and well put together tower defense game. In a similar fashion to Sanctum, you place traps in the path of your enemies to protect the gate from every wave of increasingly stronger Orcs. You can also use multiple spells and weapons at your disposal to help even the odds. Managed to get 15 hours on my first play through so lots of good gameplay there for the price!  TL;DR: Game is good n' ♥♥♥♥. Go buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly addictive and fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "what can we say, splendid splendid stuff, great fun that we keep coming back to and it's damned hard at times too!",
            "review_score": "1"
        },
        {
            "review_text": "A really good, entertaining and challenging game with a lot of replay value that will test your true abilities in the tower defense genre. It is a game that doesn't hold your hand at all and can only be truly mastered by practicing and playing the game through trial and error, how it should be in my opinion. A definite buy for any lover or tower defense games.",
            "review_score": "1"
        },
        {
            "review_text": "It's like tower defense meets action RPG. Orcs Must Die! is quite fun.",
            "review_score": "1"
        },
        {
            "review_text": "DEff one of the best indie games ive played this year!!!",
            "review_score": "1"
        },
        {
            "review_text": "fun game...plays smoothly...not overly hard but some maps you do have to plan accordingly or you might let a few get through",
            "review_score": "1"
        },
        {
            "review_text": "Damn, this is some great tower defence meets FPS meets rivers of orc blood.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome tower defense game combined with a third person shooter. Super addicting!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, give the demo a try!",
            "review_score": "1"
        },
        {
            "review_text": "A great mix of Tower Defence and Shooter .",
            "review_score": "1"
        },
        {
            "review_text": "Orcs Must Die! is a very enjoyable mix of the tower defense and third-person shooter genres with plenty of comedy mixed in. The objective of the game is to place traps in order to prevent waves of orcs from making their way through to your world. As you progress, you unlock more traps which you can also upgrade. Furthermore, you can supplement your traps by attacking the orcs directly.  I highly recommend this game. The gameplay and comedy are highly enjoyable. For those looking for a co-op experience, you'll want to check out Orcs Must Die! 2. Which as a bonus includes levels from Orcs Must Die! in addition to it's own, new, levels.",
            "review_score": "1"
        },
        {
            "review_text": "Most of us have a collection of games that we bought for low prices and have never installed. I know I have probably two dozen. This was one of them until today. If it's one of your 'someday' games, change it. Now.",
            "review_score": "1"
        },
        {
            "review_text": "Are you a MASSIVE racist that hates orcs for no rational reason? CONGRATULATIONS! Play this game, and you will have your reason, because they're being bad and invading your rift. You are a loveable idiot (So just like real life), who can dance like nobody's business, and he's humanity's LAST HOPE against the incoming Orc threat. Set traps, headshot orcs, and become the orc-discriminatory hero that the Rift needs.",
            "review_score": "1"
        },
        {
            "review_text": "Great tower defense style of game with a large variety of traps to get you through the levels. Having a third person character to aid your traps adds to the fun.",
            "review_score": "1"
        },
        {
            "review_text": "I played the crap out of this game on my friends xbox 360 and loved every minute of it.  Pros: Orcs Must Die is just witty, funny, entertaining, strategy driven tower defense with a 3rd person shooter slapped on top of it, utilitizing traps to push back hordes of orcs and other monsters . This game is just great 100%.  Cons: Honestly there is no cons to this game that I find worth mentioning.  Overall: 9.9/10 because on warmaster this game is intense.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredibley fun if you love seting up your on personal sen's funhouse and killing orcs like its an average day at the office. So have fun commiting genicide.",
            "review_score": "1"
        },
        {
            "review_text": "I did not expect this to be anywhere near as stupidly fun as it is!",
            "review_score": "1"
        },
        {
            "review_text": "If you have played Dungeon Defenders, this feels just like it expect it's single player. It is a great game, all the traps and weapons feel really nice and the game will always give you a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "An action oriented tower defence game, where you are right in the midst of the battle, tossing down traps, casting fireballs and building crazy trap combos. Good mechanics, cheerful aesthetics, funny lines... The comboing mechanic is cool, but a bit under used. Especially if you don't care about getting the high score and would rather concentrate on getting a perfect run.",
            "review_score": "1"
        },
        {
            "review_text": "Not quite tower defense, not quite action game, but it is definitely awesome. It's fast-paced, quite replayable, very humorous, pretty challenging. Music's pretty cool as well. I love this game to pieces... with traps.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of traps, even more orcs, rifts, egocentric and big-headed apprentice. Funny taunts and dialogues in the midst of flying spare body orc parts everywhere. Yes, that's this game. Silly thing it is =]",
            "review_score": "1"
        },
        {
            "review_text": "A fun and awesome Tower Defense game, has plenty of strategic oppertunities and is really fun 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A rather fun and whacky game where you defend and let no orc pass thru.. Use a dozen of different traps, weapons to slay and mutilate orcs hahah... Fun and very challenging! :D",
            "review_score": "1"
        },
        {
            "review_text": "Best orc-slaying experience you´ll get, besides the second part of course. Building traps and getting the best rating on the highest difficulty in every level got me quite some time but damn, worth it, so much fun!",
            "review_score": "1"
        },
        {
            "review_text": "What do you get when you combine tower defense and action? Here it is - Orcs Must Die! An innovative twist to tower denfence genre is what you can look forward here. The use of a variety of traps and your action skills are a must to survive each wave of orcs. It's comical to watch how the orcs suffer from your well placed traps, flying through the air and meeting to their ultimate end with a lovely Ode to Joy BGM as the icing (BGM imagined in your head). And you can unlock gifts in Orcs Must Die 2 if you have Orcs Must Die. Surely a must have for those who love tower defence with a sadistic sense of humor. =)",
            "review_score": "1"
        },
        {
            "review_text": "Insanely fun game to play! All I can really say is that ORCS MUST DIE!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazingly addicting. Fast paced castle defense and shooter mix-up kind of thing. It's a unique blend of awesome.",
            "review_score": "1"
        },
        {
            "review_text": "I...I think I just realized I don't like tower defense games after all the ones I've tried. I can recognize this as being a well made hybrid of that and a third-person shooter, and there are definitely things about it I can appreciate, but even after trying it twice a couple years apart, I've bounced off it both times. Thanks, Orcs Must Die. You seem like a good game...for someone else.",
            "review_score": "1"
        },
        {
            "review_text": "They must all die.",
            "review_score": "1"
        },
        {
            "review_text": "The best rgp 3ird person Tower defance I hav eevery played well the only one I have played but still worth it the sequal is comming out soon also worth it the only bad thing is you will get tired half why through need commitment",
            "review_score": "1"
        },
        {
            "review_text": "This game is a blast, fun form the get go.. and it only gets better. Its tower deffence on setroids. Bored with those 2D tower deffence games, then give this a try..",
            "review_score": "1"
        },
        {
            "review_text": "funny story lines and hillraious character.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but short.",
            "review_score": "1"
        },
        {
            "review_text": "Orcs Must Die. Just Orcs Must Die. This game got me hooked since the moment I put a feet on the world of rifts, as the successor of the 'Old Man'. The different waves of orcs and different abilities you get after each level encourages playing, the graphics are amazing, the music is epic and I think I found one of my favorite all-time games. Can't wait to play the sequel. 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Tower defense with strategy. Rather, it's strategy using tower defense. The 'towers' aren't so much towers as they are traps. Oil traps, impaling traps, arrow traps, launcher traps, and so on. Set them up at the right spots, and watch the orcs go flying back the way they came, or dying on the spot.  Oh, and don't forget to listen to what they say while you're killing them, or what your character says while he's killing them. That's always amusing.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourites in 2011",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that I consistently come back to.  Orcs Must Die is a 3rd person action tower defense game. You are given a countdown timer to run and place your objects, road blocks, and towers before the doors break down and a horde of Orcs, Goblins, Kobalds, Ogres and more come storming through. It's up to you a battlemage to use your spells and wepaons to stop them from running into a portal that takes them into your kingdom.   After a certain level, you unlock Weavers which give your character special bonuses and skill trees. To an extent it's a level-by-level RPG as well. You choose from a backpack of skills and utilities that you have hot keyed to your 1-9 keys.   I got this game for $3.74 during a special, but I'd recommend it at full price no matter what. It's really worth it.  This game has no multi-player, however Orcs Must Die 2 is multi-player.",
            "review_score": "1"
        },
        {
            "review_text": "An instant classic. Shame it's only single player - we hope that OMD 2 will have a coop feature.",
            "review_score": "1"
        },
        {
            "review_text": "Decent Game. The second one is better in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible!! Tower defense + realtime action + comedic humor = HOURS of great mindless entertainment. Highly recommend this to anyone!!",
            "review_score": "1"
        },
        {
            "review_text": "Killing Orcs in a FPS/Stragedy world.. How does it get any better.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game with orcs that must die",
            "review_score": "1"
        },
        {
            "review_text": "While writing this review, I have not yet beaten this game. In fact, I'm pretty sure I still have ways to go. However, after quite a bit of anticipation, I'm glad to say that this game is worth its weight. Its a unique spin to a genre that is getting more popular and offers a ton of variety. Without having to due any calculation whatsoever in terms of placing down this or that, I simply go with what I prefer. There is plenty of choice and strategy.    The flow of the game goes quite well with its style of humor and aesthetics. It reminds me a bit of Heretic/Hexen in terms of weaponry/magic and the music strikes a resembling similarity to Warcraft 2.   My only complaint is the lack of multiplayer. While a great game on its own, having the ability to play with someone else would make it much much more entertaining. However, one can only hope that it will be future content... otherwise I'll just get Dungeon Defenders when it is released.  5/5 Rating",
            "review_score": "1"
        },
        {
            "review_text": "It might be singleplayer only, but I haven't had this much fun with a game since I first played Team Fortress.",
            "review_score": "1"
        },
        {
            "review_text": "All the same things from Orcs Must Die 2 apply to Orcs Must Die. If you own both games, the levels from the first can be played from within the second game. I'd recommend playing it from the second game as all the new customisation features will apply to first game's levels, and you'll be able to play as the sorceress.  If playing this from the first game there are a couple of things to note:  * Its customisation system is not nearly as good as the second game. * There isn't as much variety as there is in the second game. Applies to weapons, characters, traps and monsters. ",
            "review_score": "1"
        },
        {
            "review_text": "Excelent game, highly recommended, try the demo.",
            "review_score": "1"
        },
        {
            "review_text": "A great combination of strategy and real time FPS. Your maze making, and trap combinations will either save your bacon, or doom you to difficult last second battles against hoards of Orcs and other nasties. The balance is great, the visuals fresh and smooth, and there’s more of a story than it first seems, (Cocky apprentice takes over for crotchety old wizard. How many times have we seen that right?) with actual character development. This is 'must buy' in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Play Orcs Must Die! It's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great, fast-paced point(s) defense game with oodles of ways to dispatch your enemies! So spice!",
            "review_score": "1"
        },
        {
            "review_text": "this feels like a Disney cartoon gone horribly wrong. which is a good thing. probably the most fun I had with an action game all year.",
            "review_score": "1"
        },
        {
            "review_text": "Hell O' Game!! Definate replay value here. Reminds me of what Plants Vs Zombies would look like in 3D.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of tower defense, third person shooting, headshots, and Orcs then this is a must buy. Also look into the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "The launch trailer was made to 'The Hall of the Mountain King', performed by Apocalyptica. If you need any other incentive, you are a strange man indeed!",
            "review_score": "1"
        },
        {
            "review_text": "Quite nice TPP tower defense game. A bit like Dungeon Defenders but less spammy, and no local multi.",
            "review_score": "1"
        },
        {
            "review_text": "Dead Orc = Good Orc",
            "review_score": "1"
        },
        {
            "review_text": "very short, but sweet none the less  good balanced gameplay, strategy is used, but it could be expanded a lot",
            "review_score": "1"
        },
        {
            "review_text": "Verry nice, and fun game, the best game to come down if you are mad :D",
            "review_score": "1"
        },
        {
            "review_text": "You get a nice amount of choice of style in this Defense game, balancing between the amount of damage you do yourself and the amount of damage your traps do. And it's nice to see orcs explode in tiny bits or run screaming while they are on fire.  I would like it if there were more different lines of combad shouting. Perhaps in a DLC?",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! One of the best in Hero Tower Defense genre.",
            "review_score": "1"
        },
        {
            "review_text": "Get this game. It's got a great art style, cartoony - but not excessively so, bloody - but not excessively so, and fun - excessively so (sic).   The DLC is worth every cent as well, the few new traps and spells are great fun, and the new missions are challenging as heck. Turn it up to Nightmare for additional fun and frustration.   This game makes me feel like the defense of Helms Deep, every single mission. It's you against hundreds, thousands of orcs. Cannot recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, quirky tower defense game that is simple to pick up, and allows you to defend your castle the way you want to. With all of the DLC(new weapons/traps), you are given a wide array of weapons and traps to set up to help you kill invading orcs. Just take a look around your map, learn the path the orcs are going to be taking to get to your Rift(the 'main base' you're trying to protect, if you will), pick your arsenal for the map, and let it begin! Each Rift will allow only a certain number of orcs to be let through, but let any more than the maximum run through it and it's game over. Campaign lasts a good 7-11 hours depending on how fast you play and how good you become at the game, and then the rest is just playing the game because it is a fun way to pass the time. Recommended for those who enjoy strategical games.",
            "review_score": "1"
        },
        {
            "review_text": "A truly awesome tower defense style game. Incredibly addictive and can also be a fun party game, hours and hours of fun. The difficulty level actually means something in this game, I would recommend to anyone 95/100 one of the best games in 2011 in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "A fun tower-defense/third-person-action game. The story is just a vehicle for funny voice overs and different maps, but the gameplay is great.",
            "review_score": "1"
        },
        {
            "review_text": "I downloaded the demo on both Steam and XBLA and was so blown away that I jumped at the first sale of the game on Steam and fully intend to get it on XBLA whenever it goes on sale there as well. Definitely one of those 'must own' titles for me.",
            "review_score": "1"
        },
        {
            "review_text": "Humorous, entertaining and great replayability. A must have for the sequal to unlock the classic levels. (9/10)",
            "review_score": "1"
        },
        {
            "review_text": "I never thought towerdefence and third person mixed well until now",
            "review_score": "1"
        },
        {
            "review_text": "So much fun! Seriously, no ♥♥♥♥♥♥ jokes, this is an excellent game that might be one of the most fun out there. Unique weapons, characters and it's also pretty funny.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great to play when you want to have a quick fun. Each party does not last more than 20 minutes, so you can play it every now and then.   The gameplay is easy to grasp and the challenge is well balanced so you get the incentive to start over some levels to get all the points.  I'm going for 100% achievements for this game, because it makes me feel like I can do it.  I will do it at my pace, one play at a time, every now and then.  And when I'm done with it, I'll download the sequel to keep the fun going.  That makes for a fun game, that I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking to have a lot of fun with great humor and no hard thinking, this game is for you! :-)",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, arcade-y yet surprisingly deep tactical game play. This is 1 to keep.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for a Insanely fun and bloody TD/TPS,If you like killing orcs,Then this is the game for you! Orcs must die! 1 has many unique traps,weapons,trinkets and spells which you can experiment or play with,I recommend that you play this before you play the sequel because it has a story to it,If you don't like singleplayer tower defense/third person shooters then go over to the sequel if you like :P I want you to grab you're money and buy the ♥♥♥♥ out of the game because it is ♥♥♥♥ing worth it and i like you to play the game for yourself because i don't want to spoil all the stuff it has :P",
            "review_score": "1"
        },
        {
            "review_text": "This is so ace",
            "review_score": "1"
        },
        {
            "review_text": "Now this game I spent hours on my crapy labtop, Just killing the dam orcs all day made my own day.",
            "review_score": "1"
        },
        {
            "review_text": "It's really fun, definitely worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!  It has lots of levels which will supply you with hours of gameplay.   Every level you get a new spell or trap to use against orcs.  The game has very good graphics and dosn't lag on my $400 computer.  Over all I give it a 10 of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Tower Defence game that has a significant Third Person action combat. Just to give you a gauge of how much the action combat impacts the game, it usually makes up 1/4 to 1/3 of my kill count. Makes build and wait a thing of the past.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and yet suprisingly stratigic compared to what it looks like upon first glance. While I am only partialy through the game, I have to say that this is a must get if it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Not since Lemmings has a game so seamlessly mixed engaging mechanics, humor, cuteness, and gleeful cruelty.” 90/100 – PCGamer   I AGREE!",
            "review_score": "1"
        },
        {
            "review_text": "This is a brutal TD, Hack n Slash game that blew my mind. Its so damn badass that you cant even imagine it! I bought it for 5 Euros (MediaMarket) plus all dlcs. It runs well and fast on my kind of old computer and its MUST BUY FOR ALL OF YOU TD, STRADEGY AND Hack n slash FANS  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥ is just some GOOD CLEAN FUN. Must play!  Seriously, great game. Guess you could say it's RPG trap defense. Third person shooter, puzzle, whatev. Damn good gameplay. Smooth as a ♥♥♥♥♥s ♥♥♥. The sequel is even better!  10 / 12",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "The mechanics for this game are truly brilliant. Animation, interface, sounds, visuals, balancing of weapons...not a whole lot of thinking for the user, but enough to be satisfying. Kudos to the developers for creating something pleasing to both the thinking man and the non-thinking man, and every man in between.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome defense plus action game, and amazing soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fairly simple game with a fairly simple concept, but it's fun as ♥♥♥♥. You play as a mage killing orcs in numerous tower defense styled maps, that's it. I give this game a 3/5.",
            "review_score": "1"
        },
        {
            "review_text": "Hordes of Orcs and unlimited traps",
            "review_score": "1"
        },
        {
            "review_text": "this game is so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "great game, challenging, but not impossible :)",
            "review_score": "1"
        },
        {
            "review_text": "Funny game Must buy on sale",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game for any and all pc gamers.",
            "review_score": "1"
        },
        {
            "review_text": "All kinds of fun - good strategy game with a big leap in dificulty and a nice sprinkle of humor.  Easliy the best £2.99 I ever spent.",
            "review_score": "1"
        },
        {
            "review_text": "This is a brilliant core defence/tower defence mixed with action combat. With the well thought out ability to upgrade perks within the levels, high customisation of object placement and damaging objects already built into the maps ready for you to trigger; this is a must have title for any core defence lovers.  The only downside I have found so far is the inability to foresee what is coming on the next wave so you can plan accordingly.",
            "review_score": "1"
        },
        {
            "review_text": "A nice tower defence game that makes you scream ORCS MUST DIE!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Better as OMD 2. worth a price.",
            "review_score": "1"
        },
        {
            "review_text": "wow what a good game",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Bad ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "It's like lemmings, except instead of babying them along you kill them in a creative way. Oh it's tower defense too.",
            "review_score": "1"
        },
        {
            "review_text": "Approved!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun mix of combat and tower defence, very funny humor, and challenging. Great game aside from not having multiplayer (the 2nd one will).",
            "review_score": "1"
        },
        {
            "review_text": "Tons of Orcs, tons of fun, plays like dream — get this one!",
            "review_score": "1"
        },
        {
            "review_text": "Great fun and easily worth 14€ . Easy to play and just the right amount of challenge.",
            "review_score": "1"
        },
        {
            "review_text": "+ Great story ! + Awesome art and characters ! + Great weapons and traps ! + hours of story  + The only tower of defence game i like &lt; trust me thats an achivement !  ------- IF YOU GRAB THIS BE SURE TO GET GOTY OR ALL DLC --------- without them its just a little less fun but all those are worth your money !",
            "review_score": "1"
        },
        {
            "review_text": "Yo dawg I heard you like killin' orcs so we put some traps in your fortress so you can kill orcs while you kill orcs.",
            "review_score": "1"
        },
        {
            "review_text": "What a great twist on the tower defense genre. This game will have you killin orcs for hours",
            "review_score": "1"
        },
        {
            "review_text": "If you can pick this up cheap, its worth a weekend of fun. 3rd person shooter with Tower Defense style gameplay. Set traps and use them to stop the horde from comming through.",
            "review_score": "1"
        },
        {
            "review_text": "A great time consumer! Poor Orcs... Not! :) +like this game",
            "review_score": "1"
        },
        {
            "review_text": "FANTASTIC, simple, tower defense game. Upgrading your tools/traps leads you to replay levels and dominate the levels more efficiently to get better ratings for more upgrades. It's an addicting formula with a great sense of humor mixed with gratuitous violence. If only there were more levels out there..",
            "review_score": "1"
        },
        {
            "review_text": "Watch 'em dyin'",
            "review_score": "1"
        },
        {
            "review_text": "You can kill Orcs, IGN 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Traps, fast thinking, lot of fun, good humor. It's a must have in your library. Get it when it's on special at worst you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "1 time i played i could not stop its like abc mouse if you have seen the comercials they say there child just can not stop and i can not stop so its a great game in all i just got a regular computer and its smoother than jazz.I love this game!!!!!!!  :) :)",
            "review_score": "1"
        },
        {
            "review_text": "extra fun with controller",
            "review_score": "1"
        },
        {
            "review_text": "Great game - exactly what I had hoped Dungeon Defeneders would be. Just the right weight of game for me - not too heavy/long, but not so light/simple that it isn't fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is awesome! Only thing it is lacking, whish is a major thing.. is cooperative gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "This game is much more fun than it has any right to be. It's a blend of the Tower Defense and First Person Shooter genres, it's extremely frenetic, and the main character is an entertainingly over-the-top ♥♥♥♥♥♥♥♥♥. If you're not sure about it, grab it when it's on sale; it's a pretty minor investment for a solid game.",
            "review_score": "1"
        },
        {
            "review_text": "+nice graphics &amp; art style +well optimised and constant frame rate +simple game premise well executed +cheap +can fling orcs onto spears to impale them +replay value - trying different tactics   -repetitive",
            "review_score": "1"
        },
        {
            "review_text": "Simple gameplay but very enjoyable and replayable.",
            "review_score": "1"
        },
        {
            "review_text": "I've never killed so many orcs in my life!",
            "review_score": "1"
        },
        {
            "review_text": "This game is surprisingly clever, and a fantastic tower defense game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is vomiting painful but enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "My all time favorite tower defense type game. The price is too cheap for it's worth. Love the style and the humor in the game. The only flaw that I can find on this game, there's no Co-Op.",
            "review_score": "1"
        },
        {
            "review_text": "This game ts like Dungeon Defenders but i kinda consider this game much better since you have the ability to place traps pretty much anywhere (ceiling, walls, and floors).   What this game dosent have though is co-op and can make the game quite boring after awhile of playing it...still fun though...  you also can't remap the controls for this game  ---My Rating--- 7.3/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game. Easy to pick up and just play. Snag it if its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defense-style game ever. Still holds true to this day.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best 'tower defense' out there. Solid gameplay with equal hilarity to match. I highly recommend giving this game a shot :)",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best 15 bucks I've ever spent :)",
            "review_score": "1"
        },
        {
            "review_text": "*kills orcs and wins*  Sounds easy enough  TO BE CONTINUED ",
            "review_score": "1"
        },
        {
            "review_text": "A very underrated tower defense with an action twist that keeps your attention and adrenaline flowing. The second one is better but this is a good place to start.",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding controls, unique style and nothing but fun. You will not regret adding this modern classic to your library.",
            "review_score": "1"
        },
        {
            "review_text": "9.5/10",
            "review_score": "1"
        }
    ]
}