{
    "app_id": 102810,
    "name": "Gatling Gears",
    "release_date": "2011-08-30",
    "developer": [
        "Vanguard Games"
    ],
    "publisher": [
        "Vanguard Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "achievements": 12,
    "positive_ratings": 87,
    "negative_ratings": 20,
    "price": 7.99,
    "description": "When the Empire begins its reign of destruction in a thirst for natural resources, it’s up to Max Brawley, a retired Gatling Gear pilot, to stop them.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/102810/header.jpg?t=1447354510",
    "minimum_requirements": "OS: Windows XP SP3, Windows Vista SP2, Windows 7 SP1 Processor: Intel Core 2 Duo (or equivalent) running at 1.8 GHz or greater, AMD Athlon X2 64 (or equivalent) running at 2.0GHz or greater Memory: 2048 MB or greater Hard Disk Space: 2GB Video Card: ATI Radeon X1300 256MB and the Nvidia GeForce 7600 256MB cards DirectX®: DirectX June 2010 Sound: 100% DirectX9.0c compatible sound card and drivers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Gatling gears is an oldie. but goldie. i have to be honest they just dont make games this good anymore. you remember the days when there was a big buzz about games. and massive interest not just by gamers but by the guys making the games. and the way they was describes in demo mags. they use to love showing off what they done. showing you how much better there games had got and giving you demos etc so you could see for yourself how good it was. those days was golden. its just not the same anymore.   i definatley recommend this game. its an arcade shooter platformy type. you run around in what they called a walker back then. and you can modify it build it up improve it get better weapons and even change the way the walker looks.  its just one of those games that got a lot of love and attension. and its so easy to see. as soon as you pick up the controller the movements feel great, everything is very well put together. its also a really nice looking game. with nice lighting and shadows and sun glare. black smoke effects that look great. nice explosiojns. and so much more to enjoy.   i promise you this is a game you wont regret buying and its so good value now. a must buy ive loved this game for years. its kinda special. and big.",
            "review_score": "1"
        },
        {
            "review_text": "Nice graphics, addicting and great story. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics, great gameplay, balance, controls and amazing soundtrack. This is definitely one of the best schmups ever made. They really need to make Gattling Gears 2 soon!   5 Stars!",
            "review_score": "1"
        },
        {
            "review_text": "Requires origins to play. Don't buy it, it's a trap!",
            "review_score": "-1"
        },
        {
            "review_text": "Fun little twin stick shooter. Campaign is about 5 hrs long. It's enjoyable if you have time to burn.",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of polished Amiga titles like Chaos Engine and Disposable Heroes. Noisy 3D shoot-em-up that gets quite difficult but challenges in a good way, best played with twin analog stick controller.",
            "review_score": "1"
        }
    ]
}