{
    "app_id": 104200,
    "name": "BEEP",
    "release_date": "2011-05-06",
    "developer": [
        "Big Fat Alien"
    ],
    "publisher": [
        "Big Fat Alien"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 4036,
    "negative_ratings": 731,
    "price": 1.59,
    "description": "A combination of platforming with a gravity gun, BEEP is an amazing physics-platformer. Despite its friendly art style, this is a hardcore platformer in the truest sense.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/104200/header.jpg?t=1497669601",
    "minimum_requirements": "OS: Windows XP/Vista/7/8  Processor: 2.2Ghz Dual-Core  Memory: 2 GB Hard Disk Space: 512 MB  Video Card: OpenGL 2.0 drivers on GeForce 8 series or Radeon HD series (or better)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Now THIS is a fun little platformer, adding little quirks to it that makes it just that little bit more unique. Now I'm not a big fan of platformers (except for the good old original mario games and a few rayman games) but I absolutely loved this one.  I like how you can fly your ship around and choose where you want to do. Just everything about it feels fresh, like a whole new spin on how platforming games are made.  You play as a robot with a variety of abilities, you can jump around, grab items, drag them around and do all sorts of things with them. You can even shoot if you want. But I like defeating enemies with gravity, it's amusing.  It's hard to describe the game without showing it, so definitely check out video footage of the game and see if it's for you. If you're a fan of platformers, you won't be disappointed with this game. If you're like me and you're not too much of a fan, give it a go if you can get this on the cheap, I was pleasantly surprised and you may be too. I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "One might think it's a cheap crap. Well. You know. True, it's cheap but... GOOD platformer! Simple but hi-res visuals. It makes your mind work a bit to complete a level. And the sound of colliding asteroids is so sweet! :-)",
            "review_score": "1"
        },
        {
            "review_text": "A great platformer that soothes your nerves after a long tensed day!",
            "review_score": "1"
        },
        {
            "review_text": "I gotta say, so far I'm loving this game! I liked it enough that I bought a copy and sent it to the dudes at Steam Train. I hope they have as much fun playing it as I did :D",
            "review_score": "1"
        },
        {
            "review_text": "Fun little platformer with a nice physics engine, a nice combat and a very forgiving difficulty. At the current price it's a must have for all.",
            "review_score": "1"
        },
        {
            "review_text": "BEEP... The BEST...ROBOT...EVER!",
            "review_score": "1"
        },
        {
            "review_text": "-Buy this game on sale -Get trading card -Sell it  Profit $$",
            "review_score": "1"
        },
        {
            "review_text": " An awesome platforming game with a robot",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, is intuitive and easy to waste time on. Also it is cheap and the level select is cool! 8/10 would BEEP again",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. It was a interesting little platformer. Some interesting powerups, and collecting all the antimater pieces.",
            "review_score": "1"
        },
        {
            "review_text": "Press R to re-load your weapon.  that should be included in the tutorial.  no other complaints, great game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is intimate and funny. And the price is good and if you wait for a good deal you can buy it cheaper than 0,99€ but I think it is good price. And you can get trading cards.",
            "review_score": "1"
        },
        {
            "review_text": "Who buys this at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Great game :D",
            "review_score": "1"
        },
        {
            "review_text": "this is great indie game ever..that reason why i love play indie than else",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Platformer!!  Bought it on sale for less than 1 dollar, simple graphics but really fun  Can`t use a gamepad, only keyboard + mouse. anyway once you get use the control is excellent.  ",
            "review_score": "1"
        },
        {
            "review_text": "Get it soon now, as it got big discount, only cost few bucks. It's a good game to wasting your times btw",
            "review_score": "1"
        },
        {
            "review_text": "This game is bra",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, Kinda high price for just a flash game tho, And fps issues. But still its cute and stupid af",
            "review_score": "1"
        },
        {
            "review_text": "This is a very interesting game! 'BEEP' is a game for kids who want to learn some smartness! :D",
            "review_score": "1"
        },
        {
            "review_text": "This is a very interesting game! 'BEEP' is a game for kids who want to learn some smartness! :D",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic little platforming game. Does a pretty good job of mixing it up and introducing new mechanics at regular intervals: each world has a unique set of properties and hazards. Lovely art, along with an excellent and fitting soundtrack, make this a gem of a game.  Possibly the best dollar you'll ever spend; well worth the asking price.",
            "review_score": "1"
        },
        {
            "review_text": "Nice BEEP... Game BEEP...",
            "review_score": "1"
        },
        {
            "review_text": "Imagine a space colony star trekking with rovers from planet to planet, collecting cores and annihilating resisting inhabitants, only to deny the laws of physics with said rovers. That is BEEP. I still wish it came with a horn I could honk with ingame.",
            "review_score": "1"
        },
        {
            "review_text": "CUTE BEEP.",
            "review_score": "1"
        },
        {
            "review_text": "The good:  -Art; -Space traveling being 'the levels lobby' for missions; -Gameplay is polished for this platformer; -60Hz; -Trading cards;  The bad:  -Menu Options; -User Interface; -Repetivity.  Score: 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "Simple but addictive Game, 10/10 Amazing for its price. Would love to see a multiplayer ;)",
            "review_score": "1"
        },
        {
            "review_text": "I bought it for low price and had no problems with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Plus: Fun, casual little side scroller. Good physics, challenging gameplay. No annoying timers or limited lives. Minus: Redundant graphics and music. Does not include many Boops, per capita of Beeps.  AMD Phenom II X6 1100T 3.3Ghz. 6GB DDR2 2.5TB 7200RPM, 16MB, SATA II 16MB/s Cable/N300 Wifi XFX 2GB Radeon 6950 Vizio 42' 1080P 3D LED",
            "review_score": "1"
        },
        {
            "review_text": "The itself is so boring but beep is so cute he'll have you coming back for more &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game that is quite simple but still makes fun. Recommended if you like Puzzle/Indie games.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for 19 cents. Walked away for 7 hours. Got 3 trading cards and sold them all for 27 cents. 11/10 would profit again.",
            "review_score": "1"
        },
        {
            "review_text": "BEEP is a very fun and Enjoyable Platformer Game But I Would Prefer it Even More if there was Controller Support but that might just be me!",
            "review_score": "1"
        },
        {
            "review_text": "IT's ok i guess.",
            "review_score": "1"
        },
        {
            "review_text": "cannot enter the game. tried several times but it always freezes when loading  I believe it is a good game such a pity :(",
            "review_score": "-1"
        },
        {
            "review_text": "  Worth every penny",
            "review_score": "1"
        },
        {
            "review_text": "Nothing noteworthy about this side scroller. The gameplay is fairly tedious and doesn't really incentivize someone to keep playing.",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't expect much - after all, the game was just 19 cents. But nevertheless, I started playing and actually it's not bad. It's a lot like Super Mario Bros., but you're a robot that shoots rocks instead of a short, fat, Italian dude with a handlebar mustache. On sale I would definitely recommend it, but even a full price it's still pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "Super cute. Just a fun little Mario-inspired side scroller, with a side of Wall-E.",
            "review_score": "1"
        },
        {
            "review_text": " It's boring, save your money  - even if BEEP were free, it wouldn't be worth your time.  BEEP feels like someone's first learning project in a game engine. The story is pointless, the mechanics are boring, the gameplay is too simple, and the art is bad. For example, BEEP can fire bullets at enemies and obstacles - that's cool, but what is the point in having an option to reload if you have infinite ammo anyway?  If this was a mobile game, my review would be different. BEEP is okay for throwing a few minutes into here and there, but as a computer game, entertainment feels forced and I quickly lost interest.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so *BEEP*",
            "review_score": "-1"
        },
        {
            "review_text": "Kinda janky, and feels pretty cheap.",
            "review_score": "-1"
        },
        {
            "review_text": "Classic platformer with good idea. I liked it =)",
            "review_score": "1"
        },
        {
            "review_text": "Beep Beep Beep. That's will you feels whenever to play this game. Somehow this game also pretty dark fo me. Especially when you already found the finish line but still couldn't find the rest of orbs in the map and the OST is catchy enough.",
            "review_score": "1"
        },
        {
            "review_text": "It reminds me Wall-E :) What do you want for 19 cents ? :D :D :D I made 5 cents profit :D   9/10",
            "review_score": "1"
        },
        {
            "review_text": "and i love this game all ready... BEEP!!!",
            "review_score": "1"
        },
        {
            "review_text": "Really nice game for only 5€, one of my favourite indie games!",
            "review_score": "1"
        },
        {
            "review_text": "I have some problems with my desktop(even if i have the right resolution it stilll syasy that it cant this display in this res,but this happens to me to other games too,so..),but my m8 that does have a steam account(wont share cuz he doesnt wnat to ,and we arents friends on steam XD)let me play it when i visited him and it was fun AF",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. It has a Maria Galaxy kind of vibe, but of course that isnt a bad thing. If you are into that kind of gaming i recommend BEEP to YOU yes YOU. Another point it is dirt cheap! I got this game on sale for $0.19! I was amazed at how cheap it was for such an awesome game I totatally recommend.",
            "review_score": "1"
        },
        {
            "review_text": "It has cussing robots in the game and random anime in the arkwork section  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Cute little lovely cool game and i like the grafichs ther colorful and defently recomand this game",
            "review_score": "1"
        },
        {
            "review_text": "Poorly put together puzzle game. Enemies are much more annoying then hard.",
            "review_score": "-1"
        },
        {
            "review_text": "I got stuck on pressing the 'New Game' button. Not even worth it if you go it for free.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring, repetitive, waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "How to enjoy this game -Leave it on like 3-4 hour while your busy -Get and sell the cards  -Delete and never play this game again :D",
            "review_score": "-1"
        },
        {
            "review_text": "very boring",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awesome and fun! I reccomend it!",
            "review_score": "1"
        },
        {
            "review_text": "It's like one of those browser games everyone played when they were younger.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awesome and fun! I reccomend it!",
            "review_score": "1"
        },
        {
            "review_text": "I made profit from selling trading cards I got from this game.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as Bernards but still pretty nice game.",
            "review_score": "1"
        },
        {
            "review_text": "yo this game's gay",
            "review_score": "1"
        },
        {
            "review_text": "Actually very fun. It's childish but still fun, loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Crap game with boring level design and ♥♥♥♥ performance on a pretty decent laptop. Didn't enjoy having to search every inch of every level to progress.",
            "review_score": "-1"
        },
        {
            "review_text": "-no exit menu  -levels repetitive -do not buy this game  -its cheap but not worth it",
            "review_score": "-1"
        },
        {
            "review_text": "Great game i love how when you order pizza and they deliver you frosted flakes ceral, its just well made game, you guys took your time in fixing my car and making me cookies, you're such a doll, this beats mw2 and csgo put together and a dash of mtn dew. thanks and have a wonderful doritos",
            "review_score": "1"
        },
        {
            "review_text": "if it is on a offer, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice and simple look, great physics engine, what's not to like.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome platforming game with a robot  I had doubts about this game on the first try, choosing the levels were weird for the first time, but after a few levels, it became clear for me, that level choosing is awesome and creative. The game in overall is lovely, story is a bit weak, but I don't think platformers are about the story.",
            "review_score": "-1"
        },
        {
            "review_text": "its a good game but not worth 5 bucks. buy it when its on sale for 20 cents.  10/10 would sell 4 strange weponds again",
            "review_score": "1"
        },
        {
            "review_text": "I haven't actually played this game but it looks nice",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I play it all days!",
            "review_score": "-1"
        },
        {
            "review_text": "CSGO: 300-350 FPS  Minecraft: 500-600 FPS  BEEP: 35-55 FPS  Best optimization 2012",
            "review_score": "-1"
        },
        {
            "review_text": "Wasting money simulator 2015",
            "review_score": "-1"
        },
        {
            "review_text": "OMG this game does not worth $14.99 eventhough i bought it for $0.99. This game is so boring and low budget, kinda like Mario for 2 year-olds and boring boring and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun is all i can say :P",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: THIS WAS FIXED! :D Thank you Developers! Before you read: I have tried to send this to the support email, but I couldn't find it. I would recommend this game but as soon as I start it up it crashes. It gives me a blank white screen and a pop up. I'm running Windows 7 Home Premium. 64 bit operating system. I bought the game for 2 of my friends and myself. Seems to work for them but not for me. I'll change this review to positive once this is fixed.  This is what it says:    Problem signature:  Problem Event Name: APPCRASH  Application Name: BEEP.exe  Application Version: 0.0.0.0  Application Timestamp: 4de80ab3  Fault Module Name: fmodex.dll  Fault Module Version: 0.4.32.3  Fault Module Timestamp: 4cadf0ad  Exception Code: c0000005  Exception Offset: 00019edd  OS Version: 6.1.7601.2.1.0.768.3  Locale ID: 1033  Additional Information 1: f15c  Additional Information 2: f15c5f683107b4382ab134b3b30e3b0a  Additional Information 3: f589  Additional Information 4: f589e7c3cb2c3feb155ce682264d5b67   ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty puzzle game !!! its Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "nothing special",
            "review_score": "-1"
        },
        {
            "review_text": "It's Great! It's a lot of fun playing and I really do enjoy the game play experience, as well as the story line. Travelling the universe, exploring and discovering new planets, as well as creatures. The fighting is fairly straight forward and I always dispose of my enemies by using the gravity gun and whack them around a bit before I throw them into a pit of despair! Overall, a fun and adventurous game.  Great job! :D",
            "review_score": "1"
        },
        {
            "review_text": "It was good in the 5 minutes I played of it. I got it on sale for 19 cents. the first levels awesme, same with the world map. thx for reading. 999999999999999999999999999999999999999999999999999999999999999/10",
            "review_score": "1"
        },
        {
            "review_text": "got it for 19 cents , made it back and a profit from trading cards , it is also a really enjoyable game , with some puzzle features to it , I do recommend this as it is just a generally fun game and is a great time passer",
            "review_score": "1"
        },
        {
            "review_text": "Lovely 2D platformer with beautiful artstyle.One thing that annoyed me was that the game looked so good in 2D but the checkpoints,nuggets,anti-matter etc. were kind of 3D and I felt that wasn't really fitting in.8/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome so far! One bug i have noticed that is a little annoying, is when youre in windowed mode and not full screen if you click escape to enter the pause menu, the game crashes. Well it does on my laptop anyway- which is not that much of a potato. Lol. But anyway! new game! low cost! I'm sure it'll get fixed and improved. In the mean time, i'm having a lot of fun just playing in full screen, but it is handy to play in windowed mode when multitasking etc. THANKS! :D",
            "review_score": "1"
        },
        {
            "review_text": "I really liked this game. Nice design and a perfect structure. You should check it out.",
            "review_score": "1"
        },
        {
            "review_text": "I should buy this for my sweet sister Not a bad game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game! It somewhat compares to Super Mario Bros. 3, but way more awesome! It has a cool soundtrack, awesome mechanics, and cool level design. But recently it keeps crashing, which is a shame... Great game though!",
            "review_score": "1"
        },
        {
            "review_text": "Thanks for the 96% off sale! :D &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "great game ",
            "review_score": "1"
        },
        {
            "review_text": "It's as if someone took Winona's Gym from Pokemon Ruby, put in a shooter element, and extended the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Although I haven't played too much of this game (around two and a half hours), I can say it's deftinately worth it's cheap price (96% off)    PROS   -Great Graphics -Loads of levels -Nice mechanics -Brilliant Gameplay    CONS   -Somewhat poorly optimised: I have quite a good machine - an intel i5 4440 and a GTX 660. It runs pretty good however I can tell it sometimes drops for no reason. -Repetitive music  Overall, it's a good game if you can get it on deal but I wouldn't pay the full £3.99",
            "review_score": "1"
        },
        {
            "review_text": "it's anoying... the gameplay, the sound (except the bird sound, that's awesome), the enemies it's monotone, and not more than any free online flashgame",
            "review_score": "-1"
        },
        {
            "review_text": "Such Cheap Much Card Very 10/10 Wow",
            "review_score": "1"
        },
        {
            "review_text": "relaxing game 8.4/10",
            "review_score": "1"
        },
        {
            "review_text": "A very nice game  relaxing",
            "review_score": "1"
        },
        {
            "review_text": "this game is pretty fun",
            "review_score": "1"
        },
        {
            "review_text": "BEEP is a cool game. Would be cool if we could use controller but oh well.",
            "review_score": "1"
        },
        {
            "review_text": "It's nice.",
            "review_score": "1"
        },
        {
            "review_text": "very fun platformer! easily worth the 49 cents it cost me :)",
            "review_score": "1"
        },
        {
            "review_text": "I don't like platformers, but sometimes... Damn it, sometimes i play games like BEEP much time.",
            "review_score": "1"
        },
        {
            "review_text": "not bad game, you must play it ! :)  nice graphics with great control. ",
            "review_score": "1"
        },
        {
            "review_text": "Great for kids. Its like portal without the portals...and for kids. Id say 12 and under more than likely. I couldnt handle the cuteness after 20 minutes",
            "review_score": "1"
        }
    ]
}