{
    "app_id": 10460,
    "name": "The Club™",
    "release_date": "2008-02-20",
    "developer": [
        "Bizarre Creations"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Third-Person Shooter",
        "Arcade"
    ],
    "achievements": 0,
    "positive_ratings": 47,
    "negative_ratings": 50,
    "price": 9.99,
    "description": "The Club™, created by critically acclaimed developer Bizarre Creations, is a new breed of third-person shooter, combining fast-paced run and gun gameplay, destructive environments, and lethal weapons. You will fight to survive in a shadowy underground blood-sport controlled by a faceless, obscenely wealthy and influential elite who place...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/10460/header.jpg?t=1522078802",
    "minimum_requirements": "Supported OS:  Microsoft® Windows® 2000 or XP with latest service packs installed Processor:  2.0 Ghz Intel Pentium 4, AMD Athlon XP 2000+ processor Graphics:  100% DirectX 9.0c compatible 64MB video card with latest manufacturer drivers DirectX Version: DirectX 9.0c Memory:  512 MB RAM Hard Drive:  6 GB uncompressed free hard disk spaceRecommended: Processor:  2.5 Ghz Intel Pentium 4, AMD Athlon XP 2500+ processor Memory: 1 GB RAM  Graphics: ATI Radeon X800 series or higher video card with latest manufacturer drivers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I dont really understand why everyone hates this game i honestly think its one of the funnest games ever seriously if you go to the gunplay mode then give yourself a set of events (try to make the list huge) give yourself awesome guns and youll have a blast playing this. Plus its a great game to play if you dont know what to do and just wana pass the time i often find myself coming back to this game when i get bored and it always cheers me up, (usually i play it on xbox though) the character selection is good SEAGER is awesome and NEMO is a crazy guy.  i rate this game 10/10 some may think why and not take my opinion seriously but i give it this score because iv had nuthing but fun from it iv had zero issues with GFWL either",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite addictive, it has great level design, good gunfights online and I have to say that I instantly fell in love with that chase camera when you run, absolutely awesome. The game is a solid arcade shooter with a different levels of challenge, from 'casual' to 'real', and they do a great job in keeping the game fresh offering a good challenge. Try the demo, and see that chase camera, see the game flow, see the graphics and then decide. I bought this game for cheap and I don't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice game but GFWL on pc completely ruined it. Now that GFWL is no more and The Club DOESN'T use steamworks, there is no reason whatsoever to buy it on steam other than for collection. Pretty sad, since game won't even save your progress.  As for game itself, 7/10 if singleplayer, can get up to 9/10 in multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend you DO NOT buy this game. DO NOT buy it. You have been warned.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont know what i expected. but a multiplayer arena game wasnt it. loaded it maybe once or twice but havent gone back.",
            "review_score": "-1"
        }
    ]
}