{
    "app_id": 105000,
    "name": "A New Beginning - Final Cut",
    "release_date": "2012-12-11",
    "developer": [
        "Daedalic Entertainment"
    ],
    "publisher": [
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Indie"
    ],
    "achievements": 28,
    "positive_ratings": 1000,
    "negative_ratings": 314,
    "price": 7.99,
    "description": "A New Beginning is a cinematic adventure-thriller done graphic novel-style.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/105000/header.jpg?t=1524053758",
    "minimum_requirements": "OS:Windows Vista/7/8 Processor:2 GHz (Single Core) or 1.8 GHz (Dual Core) Memory:1500 MB RAM Graphics:OpenGL 2.0 compatible with 256 MB RAM (Shared Memory is not recommended) DirectX®:9.0c Hard Drive:5 GB HD space Sound:DirectX compatible",
    "recommended_requirements": "OS:Windows Vista/7/8 Processor:2.5 GHz (Single Core) or 2 GHz (Dual Core) Memory:2 GB RAM Graphics:OpenGL 2.0 compatible with 512 MB RAM (Shared Memory is not recommended) DirectX®:9.0c Hard Drive:5 GB HD space Sound:DirectX compatible",
    "reviews": [
        {
            "review_text": "A New Beginning - Final Cut is a point and click adventure game that contains a strong graphic novel aesthetic to all its cutscenes, but it’s the beautifully rendered 2D artwork that brings the world to life.  Daedalic’s previous releases such as Deponia and Edna &amp; Harvey had a similar aspect but overemphasized color and cartoony humor. The tone here is much darker as it complements the rather dire storyline.   The backdrops are beautiful and the character models have a much more realistic style to them than we’ve come to expect from the developer. The mixture of early 80s haircuts and futuristic technology somehow goes well together.  It also helps the aesthetic that the music in this game is perfect with a sensational orchestrated soundtrack that goes beyond expectations.  While it can be a bit preachy about using up all natural resources, melting the polar icecaps, and destroying Earth through human ignorance and greed, you feel a bond between characters, and even the world, that a lot of games fail to establish.  The characters evolve through the story, properly accepting their roles and feelings towards certain situations.  It's not often that I consider a game hard to put down, but I found myself getting deeply invested in the plot as it unravelled thanks to its convincing characterisation and an increasingly gripping storyline. Although there's an obvious environmental focus, there's also a strong heart to the story and it's this that powers your desire to play on.  The puzzles are solid as I have found myself stumped on several for near half an hour.  In short, I highly recommend this game to those who enjoy point and click games. Be sure to check out the Deponia trilogy if you have not already.",
            "review_score": "1"
        },
        {
            "review_text": "A New Beginning is a point and click adventure game, by the German based developer Daedalic Entertainment. Hence, the English dub of the game leaves a lot to be asked for. Many of the intonations are painfully out of place, though the voices do match the characters to some degree. The German version suffers from none of these issues and is quite nicely voiced. If you're able to, I'd recomend playing that version. The game itself is your standard adventure, not really genre defining or groundbreaking, but the puzzles are well designed and have a good flow to them. There is relatively little scrounging around for items, and although you may be stumped from time to time, you probably won't require a guide to help you through. The visuals are also quite nice, the game has a comic book aesthetic which is a good match. The game's biggest failing probably lies in its heavy handed plot which is constantly trying to shove the dangers of global warming and nuclear down your throat. Though the writing is at times quite clever most of the time the game sounds like that environmental science class you had to sit through in 7th grade. The story is generally pretty sound, but starts to fizzle out at the end. Overall it's a well-crafted game with a plot that doesn't live up to the polish of the rest. I recomend it if you're a fan of adventure games, but if you aren't you're not missing out on much.",
            "review_score": "1"
        },
        {
            "review_text": "Out of all honesty, for those who are thinking about getting this, ask yourself if you're willing to spend time on a game that will boggle your mind with puzzles, if you find that fun, then you need to buy this game. If you don't like puzzles and go for the plot, you can still search the walkthroughs on a website, but although you will find it less entertaining that it normally would go out as a gameplay experience. If you hate puzzles thoughout then obviously its a no-no.  Fay: The girl you play in the game, has the best plot story, although i'm almost done with it (1 chapter left) i find her character development a great balance between what the plot indicates and situational events occuring around her.  Bent: I find it difficult to understand his reasons of collaborating within the plot, first half he goes into denial, the second half he goes through reasoning and his character development doesnt change through that and when you arrive at the Labratories at the Sea you might think it is boring, and yes because our limited options prevents us from doing anything at all by that stage.  Gameplay: Crazy as it may seem I loved the gameplay, its just a few minor tweaks that may help it out, a bit of specification would be nice, and the atmosphere really does get to you when you're feeling the situation current at hand.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "My Take: An okay point and click adventure with a nonsensical plot about climate change. It's fairly short, if you're dedicated to playing it, then it shouldn't take more than about 6 hours. The puzzles are dull and convoluted at times.  Graphics: The art is fairly well done, but the animations can be a little jittery at times. While the resolution can be set to widescreen, the game is played in 4:3; so you've got pillarboxing and unnecessary screen scrolling.  Sound: Voice acting is wooden and mostly boring. Not too much happening in the sound effects department. Prepare to hear a lot of clicks.  Music: Enjoyable enough to make this game a less arduous task.  Controls: Not really a fan of the “left click to bring up options wheel” scheme when left click is also move. Right click opens/closes your inventory.  Did I Finish It: Yes.  Will I Play it Again: If I really am bored and want to grab the four remaining achievements, maybe. I doubt that'll be any time soon though.  Should You Buy It: If you really wanted to play every point and click adventure on Steam, you could probably do worse than this.",
            "review_score": "1"
        },
        {
            "review_text": "nice plot. nice atmosphere. nice game ))",
            "review_score": "1"
        },
        {
            "review_text": "Solid but not exceptional point and click adventure. A bit preachy on the environment.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous visuals, a nice and moral story about ecology ( maybe too simplistic and preachy sometimes ), solid puzzles results in an above average point &amp; click because of mediocre translation and voice acting.  Not the best point &amp; click out there but absolutly not the worst.  PS : A game about time travels without puzzles using it, are you kidding me ?",
            "review_score": "1"
        },
        {
            "review_text": "the 2d graphics make it seem dated, and its riddled with little bugs that cause it to hang from time to time, but for $1.50 I suppose it's passable. The story is fairly heavy, and the English Voice Acting is kinda weird (tone varies wildly, doesnt match the current event) but its just a medium to pass a story across",
            "review_score": "1"
        },
        {
            "review_text": "Really loved it! Story is good, gameplay is just fine and the voice acting is actually great! I also liked the music and the few puzzles it had.",
            "review_score": "1"
        },
        {
            "review_text": " Overall it's not that bad.",
            "review_score": "1"
        },
        {
            "review_text": "'Mankind will only react to immediate threats'",
            "review_score": "1"
        },
        {
            "review_text": "Great point n' click adventure done in classic Lucasarts style. The plot, involving time traveling to save the earth from an environmental disaster is a bit preachy at time, but the puzzles were among the best i've seen in this genre.",
            "review_score": "1"
        },
        {
            "review_text": "I am glad to finally see an adventure game that uses its narrative potential to address some important ecological themes and ideas. Even though the conclusion of the sci-fi story seems a little unrewarding, I always had a good time playing the game. Puzzles are generally solid, the hand painted graphics are beautiful and most of the (German) voice acting is well done. A New Beginning may not be perfect, but it's mature, surprising and quite simply fun to play.  Cartoony graphics contrast with a mature story that deals with a serious subject of climate changes caused by human carelessness and is devoid of humor. Instead of puns and wordplays we get well written, intriguing dialogues between believable characters with vivid personalities.",
            "review_score": "1"
        },
        {
            "review_text": "just finished it and i should add that it is brilliant. interesting story, gripping cinematics and a good twist. for those that have played any of the broken sword games and enjoyed them this is the game for you however i should mention that this game is nails compared to broken sword as you have to look quite hard for things to pick up as they tend to blend into the background. but overall i would rate the game 9/10 and i dont give that very often.",
            "review_score": "1"
        },
        {
            "review_text": "Nice adventure game. The programming wasn't top notch though - sometimes 'action menues' would be in random wrong languages but the voiceover would still be in the selected language, so no biggie.",
            "review_score": "1"
        },
        {
            "review_text": "love it already!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty nice for a point n' click game although the ending was kinda weird, had fun though. If you like point and click games this sure is a game for you but don't get too excited, the game is just *nice* Had fun playing though!  6/10",
            "review_score": "1"
        },
        {
            "review_text": "One really entertaining point-and-click adventure with not too hard puzzles, well-written characters and actually great story. Moreover, it often comes with a huge discount, so you see what I mean.",
            "review_score": "1"
        },
        {
            "review_text": "One of the better old-school type 2D puzzle adventure games, filled with many clever puzzles many of which have sensible solutions, other than slightly wonky voice acting and some localization issues this is a brilliant addition to every puzzle adventure gamers collection. Also check out the same developers Deponia series which I highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "A great adventure game with a logical and current storyline but most of the voice acting is just terrible.",
            "review_score": "1"
        },
        {
            "review_text": "It was alright. Decent story but it took me way too long to figure out that I could click through all the annoying dialogue and double click on paths to go there immediately.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous art, Fantastic Story, some of the puzzles are challenging but that is what makes it so good, if you are like me and dislike easy obvious no brainers. I love how it has a comic feel to it at times. There are a couple things about this game I disliked   1. Horrid voice acting/overs, just terriable. 2.English version has mispelled words at times. 3. Every once in a while the english point and click commands were in a different languge(but i had the commands pretty much memorized at that point) Over all I recomend this game, the good def outwieghed the bad and I wasn't bothered enough to stop playing. In all actuallity i had a hard time stoping I would look at the clock and oh my it was already 4 in the morning! This game is worth the money :-) and I look forward to playing more games by Daedalic.",
            "review_score": "1"
        },
        {
            "review_text": "Well, it's definitely less irritating than The Whispered World is, though the comic-book-style cutscenes are almost COMPLETELY incompatible with captioning--which itself is heavily typoed and often out of synch with the dialogue. The animation is lovely and only a handful of the puzzles have that Guide Dang It element to them. Worth a playthrough, though, and even a second to get the missed achievements.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game. It has an interesting story that really makes you want to keep playing to find out how its going to end. The bad voice acting that everyone's talking about didn't bother me that much, but i'm not English myself, so I don't really notice all the faults. The way they portrayed the female lead character bothered me, they made it seem like she was a little dumb and almost child-like at times. It was a little disappointing, but it's Daedalic so I'm not suprised. However, if you like point and click games with a exciting story, this is the game to buy!",
            "review_score": "1"
        },
        {
            "review_text": "I still have to begin this game.",
            "review_score": "1"
        },
        {
            "review_text": "I bought the game during the steam summer for just 1 € and it was worse the money. Some puzzles are very hard and you may have to google for some help. (e.g. in the case you have overseen an item with the size of a few pixel.) But the overall story is nice and the comic like videos tell the background story well.  I enjoyed the time with the game.    ",
            "review_score": "1"
        },
        {
            "review_text": "This is really one of the good ones out there. Very good attention to detail and good art. Voice acting could have been beter, but its a minor flaw in an otherwise great game",
            "review_score": "1"
        },
        {
            "review_text": "Fun point-and-click adventure game, good time-waster for casual gamers but not for serious gamers.",
            "review_score": "1"
        },
        {
            "review_text": "I rather enjoyed their other point-and-click game arc, Deponia, so I picked this game up and thought I'd give it a try. While it was entertaining and the storyline was interesting enough (although a little predictable/foreseeable in areas) to keep me interested, what really appealed to me was the animated, comic style cut-scenes. The puzzles are challenging enough and you have the option to skip them after several minutes, which appeals to both player types. The point-and-click game play rarely has excessive long-walking-to-interact sequences, as it incorporates quick keys for interactive areas/travel, which is also appealing. The gameplay graphics themselves are decent enough, probably a tad lower in quality than Deponia. Replayability is probably minimal.  As with some of their other games, you can tell that English is not the first language for this game. Unfortunately that does make dialogue a bit painful to listen to as sentences are overly structured and not quite 'real'. There are even game play areas where translation was missed, so actions or words that are presented are in a different language. The audio recordings for the two main characters, oddly, were the most difficult to listen to as it sounded robotic in extended conversations (which may be the case).  All in all, the game provides enough entertainment to justify purchasing and can provide you with a couple nights adventure.",
            "review_score": "1"
        },
        {
            "review_text": "a very awesome story with nice puzzle. love this:) recomended",
            "review_score": "1"
        },
        {
            "review_text": "Solid point and click adventure with some good puzzles. decent voice acting and interesting story. Would definetaly appeal to lovers of the genre!",
            "review_score": "1"
        },
        {
            "review_text": "i fell asleep and woke up 3 hours into the story.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad. The two main characters are great; and although the game drags in some points, I don't regret buying and playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Its ok, not terribe, not terrific. The voice overs are pretty bad especially for the main character. Also the feminist/global warming aspects of the game get annoying but i guess everyone pushes their agenda.",
            "review_score": "1"
        },
        {
            "review_text": "Nice adventure, feels very old school. Yes the story and dialogues are not great but at least they pick up a realworld issue. Controls are very much console-friendly which was annoying because I played with a mouse. Regarding the puzzles: They are hard, especially the optional ones. You also have to rely on trial &amp; error a lot of times.",
            "review_score": "1"
        },
        {
            "review_text": "Overall - lacking. The graphics are pleasing enough, and the music is nice. That said, the English voice acting is simply atrocious. A reader program is better to listen to, the intonation has nothing to do with the emotional content of the dialogue, and sometimes it's just plain wrong for English. Oh, and the character design. Why does Fay have a uniform including a sweater that ends under her boobs? And does she have a back problem? She stands and walks with her spine bent in a highly unnatural shape, which is just painful to look at. The characters themselves are also shallow, and even though in some reviews I've read about 'character development', that mostly means that they grow from one-dimensional to maybe two. And that's for the protagonists. About one of the main supporting characters, Duve, all I got to know was that a: he's upset with his father (understandably) for sacrificing their family for his work, yet b: he continues his father's work out of some sort of duty perhaps, though he claims to hate it, and c: he's gay. The latter had nothing whatsoever to do with anything, apart from mentioning that Bent 'would have been okay with it', and providing a clue for solving a puzzle. Talk about token minority. The plot seemed forced sometimes, and after the final plot twist, had motivation issues at some points in retrospect. All-in-all, it felt rather forced and didactic, and the conclusion really didn't make much sense to me. Certainly not a game I will ever play again, and not one I could recommend, as much as I'd like to promote eco-conscious games. Only reason I played it through was that I hoped for satisfactory ending. I didn't get it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was not terrible, but to be very honest, I expected more from Daedalic.  Pros: - Art style is aesthetically pleasing - Interesting graphic novel style retelling - Good thematic concerns - An effort at a plot twist  Cons: - Storyline is very draggy - Characters not entirely likeable, which prevents you from becoming fully invested in what happens to them - Some very strange and unintuitive uses and combination of objects - Awkward English voice acting - Errors in translation (to English)  Generally, this was a rather slow and unexciting game. Even if you're a big fan of point-and-click, I'd only recommend you this title during a sale. Or just go play the Deponia series.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought A New Beginning during a phase where I bought a lot of adventure games. I had just played a few good ones and wanted more of the genre. So I got a lot of them queued up when they were on sale.  A New Beginning looks good if you can ignore the dated 4:3 aspect ratio. I especially liked the layered comic book style cinematic sequences. And although some of the puzzles required leaps in logic or pixel hunting that I found hard to stomache they were mostly par for the course.  That's the end of the good things I can say about this game though. The writing is bad and the voice acting is shockingly  worse . Truly abysmal. I think it might take the cake for worst voic acting I've ever heard in a game. By the end I just turned on the subtitles and started skipping through the sequences. If I had to hear either of the main characters deliver even one more sentence I would've thrown my speakers against the wall.  The interface is clumsy and buggy. I repeatedly ran into parts where untranslated cyrillic appeared instead of the English options. Talk about not knowing what to do.  Honestly, all of that pales in comparison to the real problem: the story. I like the idea of traveling through time to save the environment, but the writers got all the possible details wrong. It's like this game was paid for by coal and oil companies. They blame nuclear power for the end of the world. It's the worst kind of naive reactivism. Just to be clear: nuclear power is the cleanest, most sustainable way forward for human civilization. To pretend otherwise and preach it publicly in a game like this is the worst kind of sin. Even if everything else about the game were perfect I still wouldn't be able to support it. But there's plenty else wrong.",
            "review_score": "-1"
        },
        {
            "review_text": "This one isn't so exciting. It's part of the Daedalic bundle but it's not finely polished. There are bugs and the story is pretty dry. You have the power of time travel and you don't nip the problem in the bud? Most silly.  PROS 1. Not so Sure Not sure what to say.  CONS 1. Dry Story All about climate change and time travelling agents who could control the world but decided to use the most inefficient methods of protesting and eco-terrorism.  2. Gameboomer Well, I don't think a game should be that difficult that you have to check every single detail in the game. E.g. Giving the orange-juice wine cooler. Where did you get the orange juice? From a mop closet.",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe these kind of games are not for me, who can say.  What i know is i got really bored after a few hours of playing. I looked for a walkthrough to see how much torture i would get by finishing the game and i noticed i only made maybe 20% of it. So this is it, can't bare more hours of this.  More about the game, conversations are strange and annoying. People don't act natural. I can understand conflict as long as it's justified. However people in this game act like ♥♥♥♥ with no reason, which turns a nice story into a drama worse than Days of our lives.  I'm sorry i paid for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Hard to take due to the Shatner-esque in-game dialogue.",
            "review_score": "-1"
        },
        {
            "review_text": "The initial puzzles are cryptic.  Worse, this game provides dialogue 'options' that aren't actually options. As far as I've gotten there's always only one dialogue choice that has any impact which removes all player agency. The conversation with the stupid psychologist is especially awfull. Forcing the player to select the magic words to get out of a phone conversation instead of, you know, hanging up and helping the woman coughing up blood is terrible. If the story requires certain dialogue paths, just run through them; don't force the player to be complicit in the tragedy being shoved down their throat.  ",
            "review_score": "-1"
        },
        {
            "review_text": "The only good aspects of this game are the graphics and, a little bit, the story whereas the gameplay is awful and illogical (the kind of illogicality you usually find in games like monkey island or sam&amp;max, ect.) and in light of the themes involved (pollution, extinction and similar, dealt in a serious way above all) you find yourself confused because it's not a humorous game neither thriller or horror game, so what? It's a mild game?! And due to this I get stuck a lot of time because I couldn't figure out what should be the 'action' to let move along the game (I had to use the walkthrough too many times, very too!). I think the gameplay need to mirror the type of game is adopted to; so, for me, thumb down.  Buy it, only if it's on really low discount",
            "review_score": "-1"
        },
        {
            "review_text": "Well, it's hard to rate it, but I will lean towards 'NO' because although the story and riddles are solid the whole game lacks the excitement factor and it seems rather flat. I completed the game, but did not feel any urge to do so other than that I need to finish it and move to another. So, all in all, if you are a fan of point and click, I think there are better titles out there.",
            "review_score": "-1"
        },
        {
            "review_text": "This is going to sound harsh, and its going to sound like I didn't do enough of my research or that maybe this just isn't my game, and although those things are probably all true, there is no way I could have continued after the second hour of the most terrible voice acting I have ever witnessed. It's a point and click, which I have played and have enjoyed previously, but this one just has so little action and puzzle that I sit there eventually skipping through lines to get to the good stuff. I feel like I don't need to say this for anyone who has access to watching some gameplay, but the voices--the voice acting--is terrible. Constantly line after line, the characters lead off into everchanging moods and tones so that one sentence they are mourning the complete annihilation of San Francisco and then the next line that literally overlaps their own voice, they are making a joke about an antenna.  The story is really cheesy too. Scientists are coming back from the future to make people in the past recycle more. I feel like this should be maybe one episode of a children's show, and then nothing past that, I would be satisfied. Keep it in the very front of your mind that I am reviewing my personal experience of the game and someone else might like it, don't get upset that I'm bashing your favorite game (but seriously, your FAVORITE GAME?! What are you, 5?)  It needs more pointing and clicking and solving of puzzles.  Overall: 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "I appreciate that this game really tries to be an eye-opener for humanity's apathy towards climate change with a comic-book-esque feel. However, I didn't really enjoy the characters or the game play.",
            "review_score": "-1"
        },
        {
            "review_text": "Main character looks like typical pedophile. Horrible.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy the point and click genre for the pure nostalgia of playing games on Windows 95/DOS computers. However, being a byproduct of late 80's-early 90's television I had the whole enviromentalist agenda crammed down my throat. All I ask is if you want to make enviromentalism a part of anything, PLEASE keep it subtle. With that in my mind, despite my no for recommending this game, I would give it a whirl if something like enviromentalism doesn't phase you.",
            "review_score": "-1"
        },
        {
            "review_text": "DONT BUY THIS unless you're a tree hugging green freak. This game is UP ITS ♥♥♥ IN MESSAGES. Probably funded by an activist group. I kept playing through this game hoping it would get past all the politics - then the game ended. It's like they took 3 or 4 global warming theories made it into a propaganda film, went bankrupt because no one took them seriously, then decided to make this game showing how everyone is going to die to recoup their losses.",
            "review_score": "-1"
        },
        {
            "review_text": "Another dud. The story had me interested but the English voice acting is like listening to a robot; I couldn't stand it. The point and click felt really clunky and the load times are terrible for an adventure game.   Good thing I paid as much as a cup of coffee for this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting plot but the userinterface isn't friendly at all. the left click menu is a hassle. the game bugged a few times on my so i couldn't left click anymore at all, which screwed up my game.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy anything from this developer. They're pathetic and greedy.  The old version of their game, 'The Whispered World' was removed from the store, so they could put up the 'Special Edition.' See, the thing is, there isn't anything special about the 'Special Edition' because it's just a patch. The only difference between the old version, and the 'Special' version is that there's a commentary track, the soundtrack, achievements, and trading cards. That's all stuff (well, maybe not the soundtrack, but that could just be sold as DLC) that a respectable developer would have in the game, for free.  They've shown their true colors. They're just a sad, money-grubbing developer, who in a perfect world, would never get any business ever again.  Avoid at all costs.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Beautiful art and landscapes  Cons: Poor controls Puzzles that just feel tedious Unrelatable and unlikable characters Horrible script Shallow story  In my opinion this game wasn't worth the time or money",
            "review_score": "-1"
        },
        {
            "review_text": "Preachy, obnoxious, environmentalist ♥♥♥♥♥♥♥t. There is nothing special about this game, and it certainly isn't worth $10. I would wait until it eventually get placed on dumptruck sale for 95% off.",
            "review_score": "-1"
        },
        {
            "review_text": "this is so stupid don't get this game.",
            "review_score": "-1"
        },
        {
            "review_text": "just from the get go, the voice acting is poorly cut together, the characters are unrealistic and depressing and this game looks to be a bleak way to spend an afternoon.",
            "review_score": "-1"
        }
    ]
}