{
    "app_id": 105100,
    "name": "Lume",
    "release_date": "2011-05-09",
    "developer": [
        "State of Play Games"
    ],
    "publisher": [
        "State of Play Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Indie",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 206,
    "negative_ratings": 251,
    "price": 4.79,
    "description": "With a set built entirely out of paper and cardboard, and sumptuously filmed, Lume is a game with a style unlike any other.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/105100/header.jpg?t=1447354205",
    "minimum_requirements": "OS: Windows XP, Vista, 7  Processor: 1.8 Ghz  Memory: 1 GB RAM Hard Disk Space: 25 MB available hard drive space  Video Card: 800 x 600 minimum screen resolution",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Simple puzzle game. I love solving the puzzles.  Too bad it's kinda short. But at the end it said that this is Lume: part 1. I'll be waiting for the next part.",
            "review_score": "1"
        },
        {
            "review_text": "Too short to absolutely love. Looks more like a teaser than a game. Good as a present though :) P.S. Come on guys, make this cardboard world alive!",
            "review_score": "1"
        },
        {
            "review_text": "This is really visually-stunning and one of a kind. The way the camera moves is amazing and the puzzles were harder than I expected - and that's great! But it's very very short. Bear in mind you're paying for a game you'll be done with in 30 minutes (longer if you take your time to appreciate the looks and cuteness - something I highly recommend!).",
            "review_score": "1"
        },
        {
            "review_text": "I just looked at the store page of this game and saw that this game has way too many negative reviews. It's kinda short, yeah. The puzzles are quite hard and you wouldn't really think of the solutions quite often, yeah. But damn, the artwork and soundtrack are both so nice I just can't give it a thumbs down. If you see it in a bundle or for a dollar or so, get it. It's really nice and it will keep you entertained for about an hour (unless you're too lazy to think, that is).  5,5/10, short, hard, pretty, atmospheric",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet. Waiting for the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "I found the puzzles fairly easy, but couldn't find the door! Liked the style though and hope part 2 gets made.",
            "review_score": "1"
        },
        {
            "review_text": "A very quick game with lots of little puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "A very very short point-and-click game which features a beautiful landscape made entirely by the hand. It follows through with a simple and basic storyline where Lumi helps to power up the house and lights as she waits for her grandfather. The puzzles are not brutally difficult, though some do require some thought. Honestly not fantastic, but in my opinion, it serves as a stepping stone to its recently launched sequel -- Lumino City. Now that, is something which is remarkably beautiful and am looking forward to playing too!",
            "review_score": "1"
        },
        {
            "review_text": "The puzzles are few, not fun and very easy. The story is pretty much non-existent and the game doesn't really make any sense. It is like a demo version, and it took less than one hour to finish. Not a very interesting game... The graphics are quite nice though, and I think with a little polish (more details to the story, harder puzzles, much longer game) it might make for an interesting experience. I got this from a bundle that I bought to get another game, so it was practically free, but otherwise I wouldn't pay anything for it. Don't buy this unless there's a really good sale (maximum $1), or you will be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "I understand the negative reviews. 6 bucks IS a fair amount for such a short game, it's only about an hour and a half long, and its more of a setup for a yet to be released sequal called Lumino City. Despite all of this, I reccomend getting this game on sale. The art style is unique, and the paper art style of the characters clashing with the realistic background is actually very appealing to the eye. It is one of the cutest games I've ever played. Even more unique are the puzzles. I would recommend not using a guide to this game, it makes completing the game that much more satisfying, Overall, If you can get this game on sale, or you are willing to spend $6 on ad hour and a half of gameplay, I would definatley pick it up",
            "review_score": "1"
        },
        {
            "review_text": "Shortest $3.99 I've ever spent on here.  On a postive note, it is beautifully illustrated (artwork) and we are disappointed it's over already. Noticed it was made in 2011. When will Part 2 be out?",
            "review_score": "1"
        },
        {
            "review_text": "A relly lovely game, made with detailed pictures and sweet in-between-sequences. The results for the riddles are sometimes not easy to find (the lock on the cupboard door), but they are not absurd as know from other games.",
            "review_score": "1"
        },
        {
            "review_text": "'C'. Less of a puzzle adventure right now and more like a standard room escape puzzle. Just EP1 right now. Very short, all the puzzles are shown in the game demo vid.",
            "review_score": "1"
        },
        {
            "review_text": "A charming little flash-based game. Too short. It's really a demo of more to come later. I have no clue if what comes later will be added in for free or not (probably not is my guess). Still, this is worth a couple bucks if you see it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Lume is a cute but challenging short adventure/puzzle game. Emphasis on the short! Start to finish this will take an hour, depending on how difficult you find the puzzles. Definitely feels like the first chapter of a longer game.   Lume's visuals are incredible, and I'm looking forward to Lumino City, which I assume will be full-game length... Recommended for adventure game fans, but the $6 asking price is a bit much for the length. Look for a sale or a bundle purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Really love this game.",
            "review_score": "1"
        },
        {
            "review_text": "The game is nice, but very short (finished in under an hour). However, it's still a nice little adventure with logical puzzles and pretty visuals.  Consider buying it during a sale and with it's sequel Lumino City.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this game. There are insanely hard puzzles, so I had to use a guide for some puzzles, as the clues for them were confusing and frustrating, and I felt I was just wasting my time trying to solve them.  The game is not complete, as they state in the end (Lumino City is the complete game now, so this game is like a prequel to the main game), so I'd only try getting this if it' part of a bundle.  Pros:  - Cute graphics - Some easy puzzles  Cons:  -Hard and confusing puzzles - Annoying music - Restricted to one place, with few scenes - Incomplete",
            "review_score": "-1"
        },
        {
            "review_text": "For $6.99 there is an absolute abysmal amount of value to be had with this game. I beat it in 52 minutes. You could rent several two-hour long movies at that price. Apparently this is part one in a series, unfortunately the developers seem to have given up after episode one. It's cute, has a great aesthetic... it's just so incomplete. Some puzzles aren't as obvious as they should be. Poor design. Don't bother if you don't want to feel let down or suffer from buyer's remorse.",
            "review_score": "-1"
        },
        {
            "review_text": "Twenty minues of point and click Flash fun. Why did I buy this?",
            "review_score": "-1"
        },
        {
            "review_text": "English:  It is a game for 5 minutes. But one or two of the puzzles are absolutly NOT doable! Really. In every Walkthrough I had to watch, they also said that those puzzles are not possible! And after ( about 5 puzzles ) the game ( well. 'part 1' ) is over.  Really disappointing! I really wouldn't buy it for 7€! Thank God I paid only 2€.. that is too much either .. sadly!   Deutsch:  Ein Spiel das nach gefühlten 5 Minuten zu ende ist! Dennch sin ein bis zwei Rätsel absolut nicht zu lösen! Also wirklich nicht zu lösen! Selbst die Walkthroughs ( Komplettlösungen ) die ich mir anschauen musste ( um im 'Spiel' weiter zu kommen ) sagen sie selbst, das dies absolut unmöglich ist! Das Spiel beinhalten ca, 5 Rätsel danach ist das Spiel ( nunja 'Part 1' ) zuende. Absolut enttäuschend und keine 7€ Wert! Zum Glück habe ich es 'nur' für 2€ gekauft... Immernoch zu viel.. Schade! ",
            "review_score": "-1"
        },
        {
            "review_text": "The game has nice visuals, but that's about all there is. Rather boring 'story', a few puzzles, and some melody in the background. It's more of a technology preview than a proper game. Play it only if you can get it for free or for a few cents. Definitely not worth more than a dollar.",
            "review_score": "-1"
        },
        {
            "review_text": "Variety of puzzles presented in real cardboxes.",
            "review_score": "-1"
        },
        {
            "review_text": "Nicely done, but really too short. Seriously.",
            "review_score": "-1"
        },
        {
            "review_text": "The most ridiculous game i have ever played.It is a flash game and the puzzles are too easy.I didn't even try to beat the game.If i didn't get this for free i definitely wouldn't buy it.The price is too damn high.",
            "review_score": "-1"
        },
        {
            "review_text": "Too short, feels incomplete and puzzles are either too easy or way too counter-intuitive and unnecessary complex.  But, yeah, the main thing is... this game is just a demo. Not a 'Part 1' - maybe a half-decent prologue. Maybe LuminoCity is a more complete experience. I haven't played LuminoCity and don't intend to anytime soon.   Who knows maybe LuminoCity is a 'part 2' of an even 'larger ongoing story' - brrrr.   The art style is great and you can tell that it takes a lot of time and resources to prepare these in-game scenes. So it definitely is worth some of the positive press it got (though, some of the press I 've read might have been way too positive for what the game actually is).   Perhaps Lume could be appended to (read: included with) LuminoCity because on its own it stands poorly.  So, maybe it's worth picking up at a sale, provided that you are aware that you are buying a short-even-for-a-demo of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "I played a little bit of Lumino City before i discovered there was a game before that. I love Lumino City so i went and bought Lume. SO disappointing! The puzzles makes no sense at all. I had to look at a walk-through while playing. If the puzzles had been logical 'as they are in Lumino City, it would have taken 10 minutes to finish which is not worth anyone's money. I do like the art and the characters. It's very cute and very well made.",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful art style and music. The first two puzzles were fairly simple. After that, they are practically impossible without a guide. I would not recommend this (unless you are really into puzzle games and can see patterns in an instant).",
            "review_score": "-1"
        },
        {
            "review_text": "Lume feels more like a Demo than a full game. When you first play the game your first impression will be of the lovely visual style but then you will wonder why you cannot play this in actual full screen (The game is presented in a small box with no options to enlarge it what-so-ever). So the game looks lovely and you start to explore, you see a city in the background and I truly thought that was meant to be level 2 or that I would get over there and have more puzzles to complete... NOPE.   You complete barely a few puzzles and the game ends. The puzzles are not very hard, I think one or two were just annoying but thats it. I think there was 7 puzzles in total and that is the whole game, don't expect anything extra.  So finally do I reccomend the game? YES....... If it was free or a demo but to actually PAY for this is absurd. The game had potential, I would forgive the easy puzzles if it was just level 1 but no, it was the full game.  Luckily I got this title as part of a bundle so I sorta paid for it but sorta didn't.",
            "review_score": "-1"
        },
        {
            "review_text": "Cute but short. It was mostly meh.",
            "review_score": "-1"
        },
        {
            "review_text": "Upshot: If you love artistic games, and are okay with limited amount of 'game' content, go for it, it's gorgeous. If you want a significant chunk of story/plot, you will come away wanting more. This is the first part of a series, and feels very much like an introduction or tutorial to a longger game.  Absolutely beautiful, with some highly enjoyable and unique puzzles, this still left me disappointed. My two complaints:  1. The game ended after what felt like an introduction. I am aware that this is the first part of a story that is to be continued, but I think too much effort was made to cram a full complement of puzzles into a small setting without enough actual story to go with them.  2. The justification and structure of some of the puzzles seemed overly contrived. Why store innocuous and highly useful items in an undersink cabinet with an incredibly complex lock? That goes beyond the character justification of Grandpa loving puzzles.  It's not inherently a flaw, but this game also has one of my personal least favorite puzzle structures- a seemingly-unrelated document that you must figure out the significance of and how to use its contents to solve an unspecified other puzzle. In this case, exacerbated by the stretch of my suspension of disbelief that the protagonist somehow picks this one document out of an entire bookshelf. Doesn't bother some people, bugs me badly.  I really wanted to love this game, and I will probably get the next installment, despite the flaws, but given the sense of dissatisfaction I felt at the end, I am glad I got this as part of a bundle. I would be very displeased if I had paid full price. I would have been happier with a bit more room to move, and either a bit more story, or less hinting that there was going to be more; if I had known from the beginning that literally _all_ I was going to do was turn on the lights, I might have been okay with that.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy it. I totally hated this game. I usually enjoy this kind of artistic little indie game but I dont exactly know why but this game is really annoying. Doesn't worth $6.99 and doesn't worth wasting your time and money even on sale. It's about 30 minutes long, it's really childish and and puzzles are whether really easy or impossible. The graphic style is really cool but the overall game doesn't worth playing.",
            "review_score": "-1"
        },
        {
            "review_text": "'This game forms Part 1 of a larger, ongoing story.'  When I bought this, I expected more parts to be coming. Since nothing has happened for 2,5 years, it seems clear that there will never be any other parts.  It feels a bit like paying for a movie and getting only the trailer. It's annoying because you feel like someone stole your money, but it's also annoying because the trailer was really good and left you wanting.",
            "review_score": "-1"
        },
        {
            "review_text": "The art style is nice, but the game itself isn't worth seven bucks at all. Puzzles go from really easy to impossible without a guide, and there's only like seven puzzles in the entire game. You could beat it in less than an hour, even if you got stuck. Spend your seven bucks on something else, like one of the dungeon keeper games off of GOG.",
            "review_score": "-1"
        },
        {
            "review_text": "Some clever puzzles, but at least two are infuriating with their logic. Less then an hour of game play.  Wait until it's free.",
            "review_score": "-1"
        },
        {
            "review_text": "While this got many awards, and is a fairly innovative looking game as far as design, it is far too short, and devoid of challenges for a puzzle game. Unless you can get it for free, I would skip this one.",
            "review_score": "-1"
        },
        {
            "review_text": "I have bought this game after playing lumino city, which I liked a lot. Although 'lume' has a similar gameplay, I felt really disappointed when it finished after only a few puzzles. The game is definitely way to short, giving a poor value for money (I paid 2.88 Euro against the recommended 5.99 Euro). It would have been brilliant as a 'low-cost/for free teaser demo' for lumino city.  Bottom line: if I had known the game was as short as it was, I would not have bought it.  My recommendation: skip this one and go straight to lumino city, which gives a much higher value for money.",
            "review_score": "-1"
        },
        {
            "review_text": "The visuals are lovely, but the story is generic, almost absent, and there is no logical way to arrive at the answer to many of the puzzles. The clues are there, but there are dozens, sometimes hundreds of ways they could be interpreted rationally, and you just have to *know* which method the developers used.",
            "review_score": "-1"
        }
    ]
}