{
    "app_id": 105300,
    "name": "Critical Mass",
    "release_date": "2011-06-20",
    "developer": [
        "Manic Game Studios"
    ],
    "publisher": [
        "Manic Game Studios"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Puzzle"
    ],
    "achievements": 27,
    "positive_ratings": 293,
    "negative_ratings": 77,
    "price": 1.59,
    "description": "Critical Mass is an action puzzle game that takes traditional match 3 and brings it into the world of 3D.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/105300/header.jpg?t=1447354297",
    "minimum_requirements": "OS: Windows XP, Vista, 7  Processor: 1GHz  Memory: 512MB Hard Disk Space: 50MB  Video Card: 64MB graphics card with latest drivers  Additional: Internet connection required for some features",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Critical Mass is an action puzzle game where you match colored blocks to remove them. The more of a color you remove, the bigger the combo. This review is from a disabled gamer (I only play with a mouse).          YouTube™ Video:  Can I Play... Critical Mass?&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "A funny little game.  So I have palyed a small amount of this game, andI I can say it feels like Bejewled. Not the way it plays, but more like the fact that it`s a time killer, it`s ment for you to play like 10 minutes, and then come back to it.  The game is about maching colloured blocks, that are stuck in a cluster in the middle. There are some power ups like a time slower and a multiplier, which will come in handy.   Overall the game is really fun, and there are tons of modes to play. Of couse the goal are the same, but it becomes a bit more of a challenge, when the timer you have to work on is halved!  The problem I have with this game, is that I find it boring, much faster than many other time killer games. I don`t really know what it is. Maybe it`s the play still or the presentation, that gets me off  I give this game a thumps up. 4 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Critical Mass is a rare specimen. It is the first game I have ever seen that actually looks like it would be easier to play on a tablet. To me that is amazing, I mean... touch screens are usually so finnicky and unreliable, and as a society we have used computers for decades, we've been brought up on them! But Critical Mass is actually hard to play using a mouse... A touch screen would make this game great.  Props to the developer for thinking of a playstyle that would be completely at home on the huge boon of tablet devices out there today.  On steam? Yeah it's alright. Time based, 3D match 4 game. Match 4 blocks, they explode. Clear the board before the mass of blocks goes critical and blows you up (I'm guessing that's what happens). Feels awesome, looks awesome (fantastic UI) and has worldwide leaderboards for each level and game mode. As stated, it's finnicky to play, but rewarding, and I could see some people really getting into it.",
            "review_score": "1"
        },
        {
            "review_text": "11/10",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun, super addictive. Try it out!",
            "review_score": "1"
        },
        {
            "review_text": "Will make think so hard great music to do the puzzles to worth the money to get and time killer for all",
            "review_score": "1"
        },
        {
            "review_text": "so great....simple but makes you think :)",
            "review_score": "1"
        },
        {
            "review_text": "This is an addictive and challenging puzzle game. But beware: it can be very rage inducing. Avoid playing this game when you're angry",
            "review_score": "1"
        },
        {
            "review_text": "Challenging game and mind numbing, but it is a great and addicting game. I hate it when you place the block in the wrong place!",
            "review_score": "1"
        },
        {
            "review_text": "Ahhh this game is to addicting! It's like Diamond Dash, but better! Best game out there! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Interestign little puzzle game.  try it out and see, fun for thoses in to puzzles. ",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of tetris, but in 3D!  Fantastic puzzle game. Tetris with a twist, one might say. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "An easy going, relaxing puzzle game. Sorta like tetris, because of falling blocks and matching colors and things, which is good. The only thing I don't like is that every mode is timed, which is good for some modes but sometimes I just want to relax and let the block fall at my own pace.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome. I do wish you didn't have to start from scratch every time or that the levels were randomized or something, the replay value gets worn down by replaying the same thing over and over again. But otherwise I liked it and it's good to pass a little time :)",
            "review_score": "1"
        },
        {
            "review_text": "I found the game very intriging, after a couple of minutes I had to stop playing as I became a bit addicted. I don't recomend this game for people whom are easily addicted to games and have things to do, but if you don't have anything to do and you have anything to do, then by all means do it.",
            "review_score": "1"
        },
        {
            "review_text": "Picked this up on sale for $.50 - worth every penny and then some.   Critical Mass is an action puzzler in which the player races to eliminate all of the colored puzzle pieces by placing incoming pieces straegically to connect four connecting colors. Despite the description, it's not particularly 'innovative.' The game is similar in style to something like Tetris in which you have to manage the incoming colors in order to reduce size before it reaches, well, critical mass. Everything works smoothly, and the menus are swift. All works together perfectly to keep you in the action. I only have two complaints for this game. First, the player is unable to rotate the shape (it slowly rotates on its own), so the camera angle can sometimes obscure the best place to insert a block. Secondly, every time I lauch the game on my MBP, it searches all available drives - I launch and then my optical drive fires up. I have no idea why this would ever be necessary for this game (or any other). Regardless, it's loads of entertainment for the prce. 12/13",
            "review_score": "1"
        },
        {
            "review_text": "Recieved this game as a gift and it's very addicting. Basic strategy, fast paced-tetris like. If you have an addictive personality and are looking to get sucked into hours of fun nothingness then grab this game.",
            "review_score": "1"
        },
        {
            "review_text": " tl;dr -&gt; Match 3 game that reminded me of my childhood playing with those lego-like voxels in elementary school. 11/10 nostalgia feels good.   I got this game gifted to me by a generous friend and was excited to play it because I enjoy match 3 games, especially any that try to do the genre in a novel way. I was very satisfied with my gameplay experience.  If you like the match 3 genre, score attacks, and playing on a 3D-plane, then you will enjoy this game.  The aesthetics are simple but nice - you are playing with different-colored blocks in a space theme. The music is nice and calming (drum &amp; bass-like), however, there is only one track, so I quickly muted it and used my own. You can listen to the track on the store page video to know what you'll be listening to.   The controls are very simple - everything is done with the mouse. There is a brief tutorial popup when you start playing, however, I feel that a bit more information could have been provided. The learning curve is minimal to moderate depending on your experience with match 3 games and speed at searching/scanning.   Gameplay consists of you rotating a jumble of blocks around while adding a single block with every mouse click. Feedback will always be given on what color the block will be. Although it is a match 3 genre, you need to actually connect 4 blocks of the same color before they are eliminated. Chaining longer combos will give you a higher score multiplier. More importantly, larger combo chains will give you more time - the blocks move closer and closer to the screen (your time limit). Every time you clear blocks, the jumble will move back a distance depending on how big your combo was. As the jumble comes closer, the edges will turn red to signal that you are about to lose; the music will also stop and the blocks will start shaking.   An interesting element is how ONLY same colored blocks will be eliminated when you match a minimum of 4 blocks. I initially thought that any pieces that were separated from the main body would also be destroyed - they actually stay floating in space. This is a cool concept because it allows you to try creative ways to achieve larger combos. When you eliminate a color, you will not spawn it until the next level.  There are a variety of game modes to play: classic, survival, meditation, and rush. Classic mode is your typical match 4 setup - powerups charge depending on the length of your combo. The three powerups include a score multiplier, slowing down time (jumble moves toward screen slower), and a mass reducer (I believe this allows the pieces to exceed past the screen, which would normally cause you to lose). Survival mode periodically adds more blocks to your jumble. Meditation mode is a more relaxed experience and a good way to just play around. Rush mode constantly subtracts from your total score, forcing you to act quickly.  Overall, the game is a great title in the match 3 genre, and anyone interested in score attacking and being challenged should give this a try.  Recommend!  Cheers, DJSF  @DJSF's Rogue Reviews ",
            "review_score": "1"
        },
        {
            "review_text": "I hate bashing on Ozzie companies. ;p And this isn't an evil, unplayable game. My first impression was good, I played it for a bit, expected to play more, had it installed forever, yet every time I fire it up, I close it after 5 minutes.  It's a match 3 game with some 3D tetris elements. The concept is good. The graphics are polished. The music isn't bad. The controls feel annoying at first, but they're actually mostly okay. The problem is, the gameplay doesn't feel satisfying. It expects (and rewards, scorewise) big combos and long term strategy. It also expects you to be fast and responsive. This should theoretically work, in that zen-like way games like this work, but it doesn't. The rythym and pacing feels all off, it feels like the speed jumps from 1,2,3,4,5 to 50 to 150. Once you get into the zone and start planning ahead for later big score combos, it feels like you blink and the game jumps speed, asking you to go for quick, 'just don't make a mistake' placement. That may be totally subjective of course, or it could be that the feeling gets exacerbated by the clunky cube placement process. It simply isn't visually always obvious or easy to correctly target the location you want on a constantly rotating cube, which really hurts the game when it picks up speed. People misplace blocks on tetris too, but usually feel it's their fault, here it feels like the cube jumps place three times before you can be sure it's where it should be. By which time the game has jumped two speed gears and you're basically done with.  Again, not a bad game, in theory. I just never feel like playing it long, because it doesn't feel very enjoyable. The thumbs down is just trying to balance a 'very positively' reviewed game, with an 80 something metacritic score that few people seem to actually play much (notice the curiously short play times of the majority of the positive reviewers?). So I'd suggest to approach with caution, and at least play the demo first.",
            "review_score": "-1"
        },
        {
            "review_text": "For the 5 minutes that I played, the 6 second loop of a soundtrack ♥♥♥♥♥♥ me off to the point of shutting off the game.   And even if they had hired a better composer, it's still just a mediocre match 4 puzzle game that is very difficult to make combos in because there's no way to see inside the puzzle.",
            "review_score": "-1"
        },
        {
            "review_text": "3D cube matching game where you must race to match colors before the whole structure gets too big and hits Critical Mass. You basically have two options: rotate or place and the gameplay doesn't get any more complex than that. There's 4 different game modes, but they really don't feel vastly different. The game doesn't even provide basic gameplay elements like a heads up about what the next color is so you can strategize accordingly. It's a different spin on the classic Tetris game, but it was unable to hold my interest for more than a couple hours.",
            "review_score": "-1"
        },
        {
            "review_text": "I really don't know bout the #1 achievement...",
            "review_score": "-1"
        },
        {
            "review_text": "Mouse controls just a bit too fidgety for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Dime a dozen tetris inspired game.  Decent controls. Casual is harder than I would expect for casual, perhaps they shot for the thing to be very hard?  Nothing of note for this game.",
            "review_score": "-1"
        }
    ]
}