{
    "app_id": 105700,
    "name": "Tobe's Vertical Adventure",
    "release_date": "2011-07-18",
    "developer": [
        "Secret Base"
    ],
    "publisher": [
        "Secret Base"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Adventure"
    ],
    "achievements": 13,
    "positive_ratings": 80,
    "negative_ratings": 50,
    "price": 0.79,
    "description": "Two unique characters and a total of 4 islands and 16 levels to explore, Tobe's Vertical Adventure shall bring you back to the 16-bit era.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/105700/header.jpg?t=1447354389",
    "minimum_requirements": "OS:Windows XP, Vista, 7Processor:1.8GHzMemory:512 MB RAMGraphics:128 MB, Shader Model 2.0DirectX&reg;:9.0cHard Drive:200 MB HD spaceSound:Direct X9.0c compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Tobe's Vertical Adventure is one of those games that makes me long for a ~Meh~ option for steam reviews.   Right, right, so what've we got here? Well, Tobe's Vertical Adventure is a Side-Scrolling... Er, Up-n'-Down-Scrolling(?) platformer where the idea is to get from the top of a cave to the bottom and then make your escape back to the entrance, all while collecting gems and animals as you descend/ascend. It offers two different playable characters for singleplayer and multiplayer story modes across four different worlds, each with four levels. So lets get started shall we?   First of all I'd like to mention the presentation. The majority of the game is represented in the form of sprites, with some art slides that are used as cutscenes and such. The style of the art is nice; it's a simplistic style where everything is gratuitously round for some reason or another. I'm being told it's cute, but something about the hips of both characters being twice the size of their heads puts me off... Anyway, it works, but it's nothing I can say is spectacular. The in-game sprites also look okay and have decent animation to them, but I noticed that a fair few of them were blurry or lacked sharpness, specifically the character sprites. Overall, it's a quaint artstyle, but it's nothing to write home about.   Audio is also just okay. Not a lot of music to listen to; There's the menu music, one track for each world, and then some cutscene music. Once again, none of it is /really/ good, just kinda okay. I suppose I liked the 1st and 3rd world's music the best, seeing as I remember them the most, but it's still all... Whatever y'know? Sound effects as well, which really wouldn't even be noted in this review if it wasn't for the fact that many sound effects occuring at the same time will cause the sound to increase in volume exponentially. Collecting gems becomes a little less fun when you start hearing 'ding, Ding, DING, DDDIIIINNNGGG' as you pick them up in groups.   Put hey, as long as the gameplay if fun, right?... Er, well, it's okay. That's the word of the day folks. As previously mentioned, you start at the top of the level and must make your way down to a chest at the bottom. You'll encounter stage-specific traps and collect power-ups such as balloons and ropes... Which is to say those are the only items you collect. Balloons allow you to float down for a short period of time and ropes can be thrown to the ceiling where they'll hang down and you can climb them. In all honesty though, I never really /needed/ these items. Aside from using balloons to break my fall simply so I could go down a vertical shaft a little more quickly for my own convenience, everything can be done almost, if not just as easily without these items. They /can/ occasionally be used to make speedruns easier, but speedrunning, while encouraged, is not the main focus of the game.   The worlds don't have a whole lot of diference in them either. The first one is just a cave; there are some enemies that walk back and forth, nothing really special. The second world is an ice world that introduces horizontally positioned ropes, and has invisible blocks as one of it's level gimmicks. There's also a trap that's, like, an impossible-to-see fake wall that'll drop on you from the background, but it only appears twice and it's where you'll be running so fast that you'll pass them without a second thought. Third world is the lava world, so there's lava and stuff. This world has these bubbles that'll pop and bounce you up when you land on them, which make the platforming a little more interesting. Thing is, these bubbles reform waaayy too fast, so you'll encounter vertical shafts with unavoidable bubbles in them so that you can quickly ascend, but on the way down will only bounce you up and reform before you fall beyond them. Lastly there's the pyramid island. There's some shooty traps, there are some annoying spike traps, and some crushers. Nothing entirely notable really.   What IS kinda cool about this game is the escape bit of the levels. Once you get to the bottom, you have to unlock a chest which causes the cave to crumble while you make your escape. You have a limited amount of time, which can be extended by 10 or 15 seconds depending on how well you do on the chest unlocking QTE. At this point in time, the level changes, destroying certain walls and platforms to allow for certain shortcuts and various hazards. It can also make getting the collectibles easier, but you also have a time limit, so you kinda have a risk/reward thing goin' on there. You can even see what blocks will be destroyed when the cave crumbles, so you can semi-plan your escape route on your way down!   Finally, lets talk about the characters. There's not a whole lot to say about them; both can grab ledges, wall-jump, and roll. Tobe, the yellow one, is faster and can do a short wall-run. The controls for the wall-run are fairly clunky and imprecise though, so I'd always screw it up at vital points in time. Nana, the pink one, on the other hand is slower, has less health, but has a double jump. This double jump allows her to make ascend quickly, break a long fall, take short cuts, and basically wall-climb. She is by far the easier character of the two, as reflected by the stricter speedrun times in the achievement sections. The game was short enough as it is, but even after clearing the game 100%, Nana got me through it in a little under a half hour.    And that's kinda the whole problem with the game. It's pretty short, and what little there is of it has a lack of substance. Playing through the game as both characters was probably an hour's work, and that's with doing the previously mentioned 100% completion. And that's not even mentioning the various glitches I've come across, including but not limited to being clipped inside of a wall consistantly after being hit on a particular level, or stuttering scrolling during co-op play. Match that with head-scratching desgin choices like unnoticable but sparsley placed wall traps, or quickly respawning bubbles, and this game is a short, unpolished, substance-lacking 'meh' of a game.   The one place where this game shines to it's fullest though is it's co-op, which is still flawed in a way thanks to the lack of duo-controller support and the fact that it's local-only. Still, in co-op, there are some extra moves you can pull off such as head bouncing or pulling the other player up a ledge, which made for some interesting multiplayer-specific shortcuts. Two players also collect gems and animals more quickly and efficiently, making the experience a touch more streamlined. Good luck finding someone who'll play it with you though, even if it would only be a half-hour.   But hey, that's all just my opinion. Cross reference mine with others and determine if this is a game for you. Though personally, there's juuuust enough wrong with the game to lean it towards the negative side of meh, and I really wouldn't pick it up unless it was on sale or something.",
            "review_score": "-1"
        },
        {
            "review_text": "Tobe's Vertical Adventure is a vertical platformer where the player must decend levels, then ascend them with a time limit and a slightly different layout. There are three modes, each with the same set of 16 levels: Tobe, Nana, and Co-op. Tobe has basic controls while Nana is slower and has a shorter jump. However, Nana can double jump, which beaks the game (you can get almost anywhere). You're given ropes to get up to places more easily and balloons to make longer jumps, but I found myself rarely using them. Animals and treasure chests are placed throughout the level to collect and some are put in tricky places (as Tobe, at least). For a small game like this, the soundtrack is nice.  My gripes with the game are its controls and its length. Sometimes the controls were unresponsive/odd (on an Xbox 360) controller and there were unpolished aspects. As said before, it's the same 16 levels and the game only took me a couple of hours to beat. If it interests you, I'd only get it at 75% off.",
            "review_score": "1"
        },
        {
            "review_text": "Just another wonky controlled, delayed response, buggy platformer with standard enemies and bad collisions unfortunately. Nothing much else to say.",
            "review_score": "-1"
        },
        {
            "review_text": "This game suffers from some clunky controls, even after you remap the keyboard to have less ♥♥♥♥♥♥♥♥ keys (which by the way, also requires a lot of effort to do). The levels are short and in each one you decend to some treasure before re-climbing in a timed escape. When you are under pressure to get out quickly, falling to your death because of un-responsive controls is not fun.  This game isn't without its up-sides, but it usally just ends up you longing to play a different, better game, live Noitu Love 2. Better controls, better music, a choice of 3 distinct characters instead of 2 basically-the-same-but-one-is-worse characters. This recommendation is actually a recommendation for Noitu Love 2. Go buy that game, and screw this one.  2/5",
            "review_score": "-1"
        },
        {
            "review_text": "I DON'T LIKE IT",
            "review_score": "-1"
        },
        {
            "review_text": "I do not know what people see in this game. Off the bat it is to cluncky and wierd. Also the game is a platformer with no controller support? Really?  ♥♥♥♥♥♥ programming with mainstream gaming makes this a game I can't recommend.  Also the changes in gravity and friction for no reason just makes it hard to play. Stay away from this game if you know what is best for you.",
            "review_score": "-1"
        },
        {
            "review_text": "It looks like Spelunky, and it´s a really funny game!",
            "review_score": "1"
        },
        {
            "review_text": "What a charming little game. Its rather easy to beat if you know what your're doing. But its a good challenge as well. There are alternate modes after you beat the game as Tobe. They are different and harder. Good to a light great.",
            "review_score": "1"
        },
        {
            "review_text": "Oh why you can't play this online, I'm so sad about it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little game, but there's a lot of little things that will make you rage.  The game is short. I'm not sure if it's a good thing or not because you get around the material pretty quickly.  Buy it if you're looking for a game you can quickly drop out of if you're just waiting for your girlfriend to put some makeup on.",
            "review_score": "1"
        },
        {
            "review_text": "Jumping, that's my first word on this game. Falling and jumping, and QUICKness.  That's what to do.  It was really fun game and nice to play~! I recommend this game c:",
            "review_score": "1"
        }
    ]
}