{
    "app_id": 107200,
    "name": "Space Pirates and Zombies",
    "release_date": "2011-08-15",
    "developer": [
        "MinMax Games Ltd."
    ],
    "publisher": [
        "MinMax Games Ltd."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Space",
        "Action",
        "Indie"
    ],
    "achievements": 48,
    "positive_ratings": 2315,
    "negative_ratings": 202,
    "price": 6.99,
    "description": "Explore a randomly generated Galaxy populated with factions, enemies, missions, and items providing you with a unique experience each time you play.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/107200/header.jpg?t=1552001940",
    "minimum_requirements": "OS: Windows 7/XP/Vista Processor: 2.5 GHz Processor Memory: 1 GB Available System Memory Hard Disk Space: 250 MB Available HD Space Video Card: 256MB 3D DirectX 9 Compatible video card DirectX®: 9.0  Additional: OpenGL: 3.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Gets repetitive after 350+ hours :'(",
            "review_score": "1"
        },
        {
            "review_text": "Space Pirates and Zombies (SPAZ) is a top down space shooter game with a level up system for technology and a rudimentary economy system. The majority of the game is space combat similar to the old multiplayer game “Subspace” but with no power ups (and you kind of design your own ships).  SPAZ technically has a story but you probably won’t pay attention to it for most of the game since you’ll be exploring the galaxy for long stretches between “story missions.” You play part of the crew of the Clockwork, a ragtag mother ship headed for the galactic core to mine precious minerals. Unfortunately the galaxy is mostly controlled by the UTA, a powerful organization kind of like the Empire in Star Wars, except not really evil. The UTA has its own problems though, the colonies are rebelling, and everywhere you go in the galaxy there will be fighting between UTA and colonial warships.   The game’s galaxy is randomly generated when you start a new campaign and is made up of about 100 different star systems randomly connected like a spider’s web (if you’ve played FTL, it kind of looks like that, only much bigger). Each star system has a number next to it, representing the “tech level” of the star system. In practical terms, you can think of this as the “difficulty” of the star system. In order to progress to different stars, you need to somehow unlock them. For example if you go to one star, it might be connected to 2-3 other stars and each of those 2-3 stars has a separate warp gate that needs to be unlocked. You can unlock a gate by either killing all the UTA ships around it, or by bribing the UTA to let you through.   This bribery brings up an important aspect of the game. Every time you enter a star system you are given a relationship status with the colonists and UTA. If you’re hostile to one of the 2 factions, they’ll attack you on sight and you won’t be able to trade with them. To bribe the UTA, you need to be on friendly terms with them. You change your relationship status by taking missions for that faction. For example to raise status with UTA, take missions destroying colony ships (which will lower your colony relationship). The relationships aren’t galaxy wide. You can be friends with UTA in one system and their enemy in the system right next door. You do not get chased from planet to planet no matter how bad your relationship is.  Combat in SPAZ is pretty straightforward. You control one of three ships in your little fleet and can switch freely between them. The mothership stays in a safe place rebuilding your ships if they get destroyed. When enemy (or allied) ships are destroyed, they drop a “blueprint” which you can pick up to unlock that type of ship. Later ships require more copies of the same blueprint. For example to unlock a particular fighter, just destroy it and pick up the blueprint it drops. “Data clusters” dropped by destroyed ships are the “experience” of the game, and you gather those to level up. On level up, you can put skill points into various technologies, such as shields, beams, missiles, etc. This allows you to use more powerful tech (that you have to buy separately). Money in the game is a mineral called rez that you can mine from asteroids or pick up from destroyed ships. The money is used to buy tech from space stations (as long as you’re friendly with that faction). New tech items are actually pretty scarce; you need to make do with your combat skills most of the time.  Pros: +The game is surprisingly complex. This would be a great game if I had no backlog to keep me going. Years ago when I had not many games to choose from, I would have spent a lot of time on SPAZ. +There is no difficulty option, but if you’re having a hard time, just go to a lower level star system. There is nothing keeping you from backtracking or skipping entire star systems. Also, very often a star system will have open battles between UTA and colony ships when you are neutral to both factions. You can just sit there in the battle and wait for a ship to be blown up so you can snag the data/blueprints. Obviously this works better on high level star systems where you’re too weak to fight either side by yourself. +Interesting weapon / defense dynamic. Beams do extra damage to shields, cannons do extra damage to armor, and missiles do extra damage to hull. Your ships can only load 1 or 2 weapon types each so you need to have a nice variety in weapons to be able to take on all enemies. Plus, combat is very fast paced and some weapons are easier to hit enemies with than others (missiles are homing).   Cons: -As I mentioned above, new tech is few and far between. A star system will probably only be selling 1 item, and it probably won’t be what you’re looking for. And in order to actually buy the item, you need to be friendly with the faction that’s selling it. That means doing missions for them (and ♥♥♥♥♥♥♥ off the other faction). -The game is a tremendous grind. The faction relationship thing mentioned above is one example. Another is unlocking additional ships. You have to hunt down and destroy specific ship types to unlock them. Not so hard in the beginning, but in the end these are massive battle cruisers that can easily kick your ♥♥♥. And you need like 10 blueprints to unlock them. -The technology level up system is weird. You need to save up skill points to unlock higher levels of tech, for example unlocking level 3 missiles requires 3 skill points, level 4 requires 4 skill points. Yet the game will keep nagging you if you try to save the points. If you try to diversify, you’ll end up at a disadvantage. (If you’re playing an RPG, you don’t put a point into every skill).  Overall, I’d give Space Pirates and Zombies a tentative thumbs up. You can sink a lot of time into the game if this is your cup of tea, but for me there’s too much grinding. The pluses outweigh the negatives, but only just barely. ",
            "review_score": "1"
        },
        {
            "review_text": "A great top-down space game with good combat, OK story and a decent amount of replayability.  The ship customisation is key to the game, and while it isn't as free and expansive as some other space games, the amount of variety is significant and creating that ultimate ship (or fleet of ships) that mows down everything in its/their path is very satisfying.  Unlocking every blueprint and reaching the highest tech levels can take a long time, so focus is generally what will be needed.  The standard missions in the game, to earn reputation with the factions, currency and experience are fairly varied but eventually you'll have seen them all; however each time will have different ships which can alter the difficulty and reward you with new parts.  Sometimes the random generation of the map is extremely unfair - there was a point where I had access to systems up to level 50, and the connection to systems above that (including the story objective at the time) were linked by just one system, which was level 68. It took a awhile of grinding on the lower level systems before I managed to force my way through the gate. This is a game where going up against ships 5 levels higher can be brutal, but can also be fine, depending on what the ships are given in the area by the random generation.  The addition of bounty hunters gives another edge to the game, with their special challenges (which involve a specifically designed ship and not yours) based on skill, not your current progress.  The game mixes it up when you reach act 3 by introducing the zombie faction, which plays against the other two factions (Civs and UTA, or 'police'). While the first two can be befriended, the zombies are always aggressive. When a zombie ship is killed, it explodes into spores and zombies, which can corrupt your ships into zombie ships. This can be devastating if they get your best ship.  In the final act, act 4, the game again changes it up my adding a system control element because (story spoilers:)   the zombies are now a much larger threat so the UTA and Civs now work together with you as allies  . This bit feels a bit weird, but these systems now gather resources for you (rez (main currency), goons (crewmen, secondary currency) and data (experience)), which can help in the endgame area, where your ships cost significantly more, your levels take a lot of data, and you chew through goons and rez upgrading systems.  In summary, good fun game, great combat, eh story, can get grindy at times and the ship customisation is great.",
            "review_score": "1"
        },
        {
            "review_text": "SPAZ aptly named as the game play is crazy and adictive. Careful not to put it on hardest difficulty as it is hard and ends up a bit grindy if you have max stars. Otherwise fight for you rights in this galaxy exploring ship combats simulator where you customise almost everything!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and many other reviews say so. What I want to talk about here is MODS. As you know, a game can be several times funnier (and longer lasting) with mods, and SPAZ is great modding material. On the official game forums you can find several, from small ship adjustments up to game overhauls. My personal suggestion is to get a mod to increase the size of your fleet. Not only the game gets prettier (moar lazers), but also it helps to make the endgame more interesting.",
            "review_score": "1"
        },
        {
            "review_text": "  Originally posted on October 28, 2013    SPAZ reminds me why Escape Velocity excited me when I was a kid. It's an all out blast of a top down space shooter, and has a cool sense of humor as well. There are a solid variety of balanced ship types and weapons, and the faction relationships being different for each star system makes it hard to really mess up. The one complaint I had is it felt like a real grind having to build yourself back up after losing a big fight. There should be a faster way to regain resources at high level. Other than that, the game is a great. I would definitely check it out if you're into that sort of thing.",
            "review_score": "1"
        },
        {
            "review_text": "One of best, if not the best game in genere. Great game for on-the-go devices(laptops, netbooks).",
            "review_score": "1"
        },
        {
            "review_text": "I don't like indie games at all but after playing this through the free weekend i was wrong about them! SPaZ is an awesome game and definitely worth a buy, it's like Chicken Invaders except a million times more exploration and in-game time! It is a game like Minecraft where if you want to relax and game at the same time then you have got the right thing in front of you.",
            "review_score": "1"
        },
        {
            "review_text": "8/10  Something new and rare. Gets stale after a while but other than that its great.  Could need more story/dialog since you'll feel really alone in space sometimes what makes it very lengthy/long-winded. Yet Im already waiting for the second installment of this series. Not bad at all. Recommended for action/strategy fans.",
            "review_score": "1"
        },
        {
            "review_text": "I put 91 hours into this. That may involve a lot of leaving the game open and trying to figure out what to do, but it also involved a lot of shooting stuff. It's a bit slow and repetitive, especially in the later part of the game, but it is entirely worth the ride.",
            "review_score": "1"
        },
        {
            "review_text": "If Faster Than Light and Space Miner had a baby, it would be this.  This game is insanely addictive it's really satisfying to finetune your individual ships and customize them to suit your needs. That combined with resource management and hectic combat makes for a great game. I wasn't expecting to like this game at all, but once I started playing, I found it really hard to stop.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best spaceship managment game, must have.  Feature: - Tons of upgrade for space ship and mothership - Custom spaceship - Zombies! - Good story - Random galaxy - Bounty hunter - Side quest - Stealt system - Different crew on mother ship and MOAR",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic space RPG/arcade shooter with meny hours of gameplay. Reminds me of Elite 2 I played on my Amega 1200.  ",
            "review_score": "1"
        },
        {
            "review_text": "Interesting expansionist game with more of a arcade action flavor than strategy. Don't get me wrong, there is a little of both. Gets repetitive, but I like the arcade action aspects of the battle system. The game does get some what repetitive. If you like to collect everything the game will force you to undo alliances you've made in order to gain access to tech sitting with another faction, only to make you work to re-establish your prior alliance two solar systems away in order to get their tech again.",
            "review_score": "1"
        },
        {
            "review_text": "Now this, ladies and gentlemen, is a piece of work. It's got an interesting storyline that surprises you with not exactly plot twists- but... surprises. I was using some awfully small ships when I encountered a group of extremely large enemies coincidentally sitting right where an object I need to grab is. I was told to take them out. With difficulty I finished the job. Now, that may seems insane, but when you learn how the CPU ships are going to try to attack you, you'll set your ships to different modes to make use of their evasive moves and such. This game is great, there is a ton to do, from persuading people you're on their side to blowing up bases. Before you know it, you'll have played so much (if you like it as much as me and my friends do) you'll go from taking out a weak Dart ship to blowing up Lvl 3 Bounty Hunter Bases. There's always somewhere to go to upgrade your gear or to open warp gates and such. Fun game. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "great game with plrnty of playabillity, always good fun.",
            "review_score": "1"
        },
        {
            "review_text": "good fun cant wait for the new one",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Slightly biased opinion though :) ",
            "review_score": "1"
        },
        {
            "review_text": "Very good game :)) Its only 10 $ so buy it , first time i was thinkink oh another bad space game but its very very good sapce strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Will probably end up spending a thousand hours playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "&lt;3 this game wish it had some kinda co-op tho :3",
            "review_score": "1"
        },
        {
            "review_text": "Top-down space shooter &amp; strategy game, fluid gameplay, wide variety of components to add to your ships and lots of freedom over what to do and how to do it.  Downsides include bad jokes, limited components and not enough variety in the side-missions.  Still a good game and fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of elements, in my personal opinion, were borrowed from EVE and it makes it a good game. There's a lot of grinding and a bit of a curve, but after that it's really fun...  Edit: It's extremely underrated for what it currently is, especially for the price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great fun!",
            "review_score": "1"
        },
        {
            "review_text": "Overhead, 360 degree asteroids-type shooter with RPG mechanics and trade. Loved it for a while but the grind to improve my fleet became too slow to enjoy anymore, and I could no longer survive in any uncharted systems. It's worth $5 at least. I had a lot of hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Overall Score 8/10  A very solid game. Simple and enjoyable topview space shooter with RPG elements. I poured a great deal of time into the humble bundle version of this game. I was very surprised as to how much gameplay was there. Hours and hours can be poured into developing your small fleet into a force to be reckoned with. I keep playing it over and over again. Well worth your dollar.",
            "review_score": "1"
        },
        {
            "review_text": "Love it, reminds me of Armada for the dreamcast.",
            "review_score": "1"
        },
        {
            "review_text": "177 hours, and I beat this game years ago. Playing again because it's nice to look at, and the game mechanics are fun.",
            "review_score": "1"
        },
        {
            "review_text": "SPAZ ( and bounty hunters ) is a very good game . The 2 d style works wonderfully , its a verry colourfull game, the planets in the background make you want to visit them . The story is captivating though to advance you have to get to higher levels so you will be able to do the missions , since if you didn t grind you get overpowered by the enemy fast , and the grinding takes too long . Even so you have a lot to do : upgrading ships , destroying ships to take black boxes for more blueprints to have more ship models. ",
            "review_score": "1"
        },
        {
            "review_text": "This game delivers on what it says, Zombies - check, pirates - check, space - check. Most honest game this year.",
            "review_score": "1"
        },
        {
            "review_text": "Curator Review:  Space Pirates and Zombies and Bounty Hunters! This top down space, indie, strategy game takes you, a rogue pirate, and sends you towards the galactic core in search of cash. What you find on the way changes everything. The galaxy is fragmented. Will you side with the Civilians? Maybe the UTA? Or will you be a true pirate, down to the core? This game does a good job of progressing the story and the overall game concepts very well and ultimately it does exactly what you'd expect, merge space and zombies in an effective and fun way.          YouTube™ Video:  TaP: Space Pirates and Zombies&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I normally do not write reviews but i had to do it for this game.  SPAZ (Space Pirates And Zombies) is really a beautiful love letter to the old days of top down space shooters.  Pros: Stellar Presentation (hehe)    good 2d graphics    nice music    upgrades    ship fitting    challenges (bounty hunter)    different enemy types    even asteroid mining is fun    mutliple ships in your fleet    fun and diverse combat (lasers/cannons, fighter drones, cloaking, mines, rockets, bombs, boarding, ...)   Cons:    Can sometimes become a little bit grindy, but there are almost always ways around the grind.   Btw. I absolutely love TotalBiscuit (John Bain) as the narrator.  Buy it, play it, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun light arcade space shooter. If you liked Star Control, Space Rangers or Starflight you're sure to like this one too.",
            "review_score": "1"
        },
        {
            "review_text": "I could spend all day exploring star system after star system in SPAZ. Every minute is full of crazy events like fighting whole squads of military ships, to crazier things like collecting waste to produce food (you read that right!). But with the zombies along with an already amazing adventure, this game deserves at least one playthrough (but will probably get many more).",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive and beautiful game. Gameplay and writing are both fairly enjoyable, but not for everyone. Will suck you in for dozens of hours if you stick with it past the first bit and get the ball rolling.   Definately a good buy for the price.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite indie games on Steam - a true gem. Even though it's made by a two-man team, this is an awesome 2D space combat game. It's not laden with overly complicated interfaces and rule systems like a lot of strategy games, yet has enough customizability and complexity to keep the player engaged. Ignore the story, and focus on configuring your ships. My 40 hours on a single playthrough is proof of how much fun I had. Some may find the combat repetitive eventually, but I found the steady trickle of new weapons enough to keep me invested. I love this game and am very excited for the sequel!",
            "review_score": "1"
        },
        {
            "review_text": "Top game! I have a lot of fun with this game. I mean it contains pirates, zombies, bounty hunters and is in space!!! That must be awesome...",
            "review_score": "1"
        },
        {
            "review_text": "Very fun light arcade space shooter. If you liked Star Control, Space Rangers or Starflight you're sure to like this one too.",
            "review_score": "1"
        },
        {
            "review_text": "I could spend all day exploring star system after star system in SPAZ. Every minute is full of crazy events like fighting whole squads of military ships, to crazier things like collecting waste to produce food (you read that right!). But with the zombies along with an already amazing adventure, this game deserves at least one playthrough (but will probably get many more).",
            "review_score": "1"
        },
        {
            "review_text": "The best space opera I've played since Master of Orion 2. Cuts back on the resource management of other games in its class and focuses more on the strategy of ship building and space combat. A great RPG with a pretty solid story that doesn't take itself too seriously.",
            "review_score": "1"
        },
        {
            "review_text": "The two Devs who made this were right, they don't make them like they used to. I love top down games and I love SPAZ. If you ever played inner Space back in the win 3.1 days and were dissapointed that you never found anything like it ever again, give SPAZ a try.",
            "review_score": "1"
        },
        {
            "review_text": "Something like a 2D version of Star Wolves, but slightly similar to Freelancer or some other solar system hoping quest. Story isn't the most interesting thing; It's pretty much there to keep you going along. Exploring, collecting, researching, and getting ever more powerful ships makes this a great and addictive little game.  'Star Control 2'/10. Would recommend to those looking for a procedural sci fi romp around the galaxy with your small wing of space ships.",
            "review_score": "1"
        },
        {
            "review_text": "Whilst fun and all, this top down space shooter is unforgiving if you dont pay attention to what you are doing and where you are going",
            "review_score": "1"
        },
        {
            "review_text": "Space pirates and zombies contains just what it sais on the package.  You play as a space pirate and venture into danger.  The gameplay feels nice and if you are playing on a low difficculty and huge galaxy the difficulty is not raising too much. If that is too boring then there are still some higher difficulties and some nice bounty hunter challenges. Certainly one of my favourite games of all times.",
            "review_score": "1"
        },
        {
            "review_text": "Action game with significant RPG like progress system.  You control one ship of 2-4 ship group. The other ships follow yours around, you outfit all of your group with shields, weapons, engines etc. that you unlock as you progress.  I found significant time spent farming was required, although the combat is the heart of the game, so that wasn't too big a problem.  The story is nothing special. Graphics are fine for an indie game. This game is for those looking for a spaceship squad based ARPG.",
            "review_score": "1"
        },
        {
            "review_text": "The first thing you'll notice about SPAZ is the customization. Do you want to play in a massive galaxy? Do you want to be starved for technology? Do you want to turn off the Bounty Hunters entirely? You can do that. The customization of course applies to the many different ship types, such as what armament to use and even the level-up system, so maybe you want to focus on shields first or maybe you like the punch of cannons so you focus on those.   SPAZ is not an RTS, but it has some elements, like having resources to manage (albeit it's just REZ for money and Goons for slave labor), which you use for the production of your up to four ships for your small fleet, and both are used for the purchase of new weapons blueprints. You also have to maintain relations between you and two factions, or three with the included And Bounty Hunters expansion. Do you fight the UTA for the benefit of the CIVs, or do you backstab both groups for your own profit? This is complicated by the fact that every sector has its own faction relation to you, and anything you do in one sector has no effect on the rest. But that's where the Bounty Hunters come in. There are light RPG elements too, mainly in how you spend your upgrade points in what trees to bolster your ships and enable the use of better equipment.   There is a good variety of missions, like destroy X many crates without being seen, or destroying a big ice meteor before it plows through a research station, or the simple 'kill everyone of this faction' and everything rewards you with money, people, and typically a change in faction relation. Or maybe some new equipment, or even a little bit of story. The game changes pretty drastically during the final chapter, though you are given advance warning before this point. And you don't even have to do missions all the time. You can just pop by the mining colony and chip away at meteors for money...only for one of the groups you ticked off to suddenly warp in and you're now scrambling to send away your mining ships for battle ones.   There's a good bit of stuff to do and collect and kill in this game. I especially like the fact that you can custom-tailor your experience to start, though there's no way to change that once you've started. Battles are oftentimes difficult and relying on your AI allies is an exercise in frustration, but learning the nuances of the weapons and how much impact the different gear you can equip to every ship is essential for victory. Do you want a massive battlecruiser with extremely strong shields and armor? Or maybe a tiny ship with extreme speed for hit-and-run tactics? Why not both? You can only directly control one ship at a time, but the ability to swap at any time might be essential to keep everyone alive and to keep your coffers full.  And this game has no discrete 'game over' condition, as you can always fight back from zero even in the final chapter, though it will be tedious and difficult to rebuild your fleet when you've no REZ nor Goons. And while you're slowly chipping away at stray rocks in the Short Bus after a massive defeat, you'll be thinking up a plan to exact your revenge. It will be glorious.   So yeah. SPAZ is a game I like.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. I have a saved game from 2012. I am where I was now and am hoping to beat the game soon. Wish Spaz2 was cheaper :( ",
            "review_score": "1"
        },
        {
            "review_text": "Love this game",
            "review_score": "1"
        },
        {
            "review_text": "Buy it &lt;&lt;&lt; Helpful Review.",
            "review_score": "1"
        },
        {
            "review_text": "great game   10/10 would provoke bounty hunters :)",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Runs well on Linux.",
            "review_score": "1"
        },
        {
            "review_text": "Classic Space RPG and Shooter fun. Top-down classic akin to Space Rangers 2, from an Indie dev team of two. High gaming value.",
            "review_score": "1"
        },
        {
            "review_text": "It is a great game",
            "review_score": "1"
        },
        {
            "review_text": "9/10 I would absolutely recommend this game, unless of course you don't like fun.",
            "review_score": "1"
        },
        {
            "review_text": "Did you love Star Control 'back in the day?' Well then this game is for you. You start out with a crappy ship and over the gameplay you get better tech and ships and eventually have a tiny fleet. I really enjoy this game and I give SPAZ a hearty recommendation.  ",
            "review_score": "1"
        },
        {
            "review_text": "I'd seen SPAZ go on sale a few times but never really paid much attention until it went on sale for $2 and I had a spare bit of change in my Steam wallet.  Best $2 that I've ever spent, unless you could the 3 sausage rolls for a pound (about 2 dollars more or less) from Greg's bakery.  I am a huge fan of Star Control and never thought that any game could live up to the standard that it set way back in the days of the Sega Megadrive. I was wrong. Whether it was inspired by SC or not, I don't know, but if you liked SC and want a modernized version of it, SPAZ is the best that there is.  If you haven't played Star Control, I will give you the gist of what SPAZ is. Spaz is a top down space shooter. You are in command of a band of Space pirates. With humble beginnings, you can gradually work your way up and become more powerful, reverse engineering ships that you destroy, gathering resources to build researched ships and to buy blueprints for new modules to go on them. You can fly into combat with a small fleet of AI controlled allies, toggling between the ships at will to command for yourself.  If you like games with depth and action and don't care about graphics, I fully recommend this game. I got it for a bargain, but even it's full price is well worth the expense. A must have.",
            "review_score": "1"
        },
        {
            "review_text": "Great combination of space, fast action, and RPGlite. Expansions make replay worthwhile.",
            "review_score": "1"
        },
        {
            "review_text": "Borg-esq type Ufo's to shoot Recommended",
            "review_score": "1"
        },
        {
            "review_text": "2D Elite on crack without all the flying around trying to get to places? Lots of flying around shooting stuff, collecting things, upgrading your stuff and all that good stuff. Fairly easy to get into. Also, stuff. :7",
            "review_score": "1"
        },
        {
            "review_text": "SPAZ is really addicting, it may not look like much but it's really complex, from making alliances to travelling between stars. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I got this game in a bundle that cost less than this game. So I was bored one day and decided to play this game. This game was great because you can build your own ships. It is kind of repetitive though.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, everyone should grab this up!",
            "review_score": "1"
        },
        {
            "review_text": "SPAZ is really addicting, it may not look like much but it's really complex, from making alliances to travelling between stars. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is highly addictive, I've been caught playing this in the office a few times. And yes because of the low pc requirements, I've been able to sneak in some playtime of this game. Give it a spin if you see it in a free weekend/steam sale, I can guarantee that you'll have a blast with it.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game, seriously, do it now. Had it for 2 days and ranked up 13 hours of gameplay already and by the looks of things I'm not even half way though the game yet. Different layout each time you play though due to randomly generated maps. There is a little message that pops up at the start of the game that explains that it was made by two guys working out of their homes for 2 years but how it plays you would think it was made by a standard developer.",
            "review_score": "1"
        },
        {
            "review_text": "Frustrating, tedious, hard. Sometimes SPAZ makes me want to eat my keyboard at times.  Yet I come back to it. Why? Why? Why?  Update: The frustration outweighed the fun, finally. I stopped coming back to this game. Too grindy later in the game.  Actually, I know why. The game doesn't have the most balanced mechanics, nor does the difficulty ramp up all that smoothly (more like, brick-walls on you if you aren't careful). But it's a 2D space combat simulator with a teeny little bit of RPG tossed in for good measure and a heavy exploration element, and by God's Bones, they dun make games like this no more.  There's lots of ships to unlock and lots of goodies to toss onto said ships, so at least if you feel bored using one sort of build you can swap it for another.  If you put in lots of hours in games like StarControl, Escape Velocity: Nova, StarFlight and Solar Winds, then buy SPAZ and enjoy it. If you have no idea what any of those games are, then you might want to pass. Then again, it's on sale at times for just a few bucks, so what do you have to lose? Aside from a few bucks.  Pros:  * Nobody makes these kinds of games anymore, OH WAIT, they did! * Lots of ships and weapons/upgrades to discover. * Big universe to explore. * Nice visuals and sound effects.  Cons:  * Big universe to explore. Becomes tedious after a while since systems must be unlocked one at a time. * Chunky and slow during big space battles, especially later in the game with lots of ______'s flying about spewing chunks. (*Spoilers!) * Space battles can end up near-stalemate battles of attrition, which take a long time to resolve. * Less story-telling versus games like EV:Nova, etc.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome top down space game with that accent that if you die, you can just go to another ship. WIth this action, it allows you to get deeper into the fleet combat that other top down space games do. With many different ships, weapons, and parts to choose from, you can easily customize your fleet to match your fighting style. Beware that this game and many other top down space games take a lot of time to complete, because of the jumping from system to system and the difficulty of getting money. Space Pirates and Zombies is a great game, and was well worth the $10 I spent on it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a space RPG where you play as the ships. You start on the outside of a galaxy and fight your way through worlds and space police checkpoints to get to the center og the galaxy where everyone prospers. There's a decent backstory behind it.  At times the game really feels like a grind, but thats okay, it's an RPG. You fight, gain exp, and upgrade your stats. The usefulness of stats are: small passive bonuses (aka armor bonus, % health increase, etc) and your skill level allows you to slot the different parts (weapons, armor, etc) onto your ship. There's like 12 -15 different areas to level up in i believe. Like shields, armor, hull (general structure integrity once armor is gone, aka ship health), engines, reactors, beam weapons, etc. It's pretty in depth.  If you like games like atom zombie smasher, you'll like this. You are given a top down view of where you fly in space. There's hot keys to do various things, and you can switch between any ship flying with you in the same sector at any time. Say, your ship gets destroyed or sent to repair, you can control another one in live battle. There's factions, whether they like you or not in each sector gains you access to parts, or you can try to take them down yourself. They act as bosses bt provide decent xp.  Yeah, just get the game. ESPECIALLY if it goes on sale. Right now it's 80% off so it's $2 ($1.99). There's no reason not to buy this at such a steal. They're currently making Spaz 2. Can't wait. Oh, TB does some voice acting. The character voices kinda suck, but it's cool.  Downsides: Can be a grind regardless of skill/ level (its an RPG) Sometimes too much reading (i get lazy) Voice acting sucks (this doesn't affect gameplay)",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game to play around with. I love the customization and the the selection of ships that the player can chose from. The combat is also very satisfying and I cannot wait for the second game.",
            "review_score": "1"
        },
        {
            "review_text": "love it, can't wait for SPAZ 2",
            "review_score": "1"
        },
        {
            "review_text": "very fun! challenging!",
            "review_score": "1"
        },
        {
            "review_text": "Ok I bought this game on a whim because it was on sale, played half an hour and stopped for over two years.  Now I picked it back up again because I been craving space games and DAMN!  What was I thinking not liking it from the start?  Grind missions and currency, trade off captured enemies or use them to strengthen your base and ships, fight against the government and get rich!  It is light, casual, cool and fun. Don't pass this up if you like RPGs and time wasters that can hold your attention.",
            "review_score": "1"
        },
        {
            "review_text": "Just wow, this game is amazing buy it, buy it now.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing A-mazing. This is a highly underrated steam game. Excellent gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games I've played. Crazy how this came from a two man team. Definitely worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, even if the story is a bit predictable.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, Another one of those cheap gems.",
            "review_score": "1"
        },
        {
            "review_text": "This is a damn good game. A wonderful old school space shooter with a lot of challenge. You will spend many hours in this game blowing up tons of others ships for their resources, their upgrades, or just to blow through their stargates. It can get a bit repeditive, but if you're experiancing that, then go to a system that's a higher level than you, and you will find yourself with more than enough challenge. I'm astounded by the quality of this two man made game, and I look forward to their updates, and anything else they make in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Somehow, Steam is allowing me to write a review for a game I don't own and have never played. I think upon seeing this badass gameplay preview, that I am going to recomend Space Pirates and Zombies to others. It looks like a game that I would play. I'm excited to one day experience this one for myself! Cool game 10/10 IGN.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game. It is fun to explore the galaxy and build up your ships. It is also a nice twist that you are not exactly a good or bad guy, but a pirate with questionable morals that happens to get thrown into saving the galaxy.",
            "review_score": "1"
        },
        {
            "review_text": "Very very fun game, probably one i my favourite and this is one of the rare gems imo.  I suggest you buy and play this one through and wait for the second to come out.  Pros:  - art style  - space ships  - zombies  - massive customisation  - good story  Cons:  - no multi :(  - no voice acting past intro",
            "review_score": "1"
        },
        {
            "review_text": "Similar to that underplayed Starport game (that nobody knows about). It's plays perfectly, although it needs some multipalyer action to be recognized in my opinion. That's where SPAZ 2 jumps in, once it releases. It's a great game altogether, but can get boring and repetitive at times.",
            "review_score": "1"
        },
        {
            "review_text": "Tired of too much free time? Destroy it with this awesome game. Don't blame me if you forget to sleep or eat...",
            "review_score": "1"
        },
        {
            "review_text": "actually a fairly ballanced game good buy",
            "review_score": "1"
        },
        {
            "review_text": "its not too bad i suppose!",
            "review_score": "1"
        },
        {
            "review_text": "Really great indie game, I've burned over 50 hours on this one. You run around the universe trying to make a buck, fighting whoever you need to fight at any time, changing allegience as you see fit, upgrading your ships, ... oh, and there's a neat little story in there, too.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Randomly generatled galaxies. Ok storyline with some funny off the wall side missions. You get to blow up other ships. You also get to shoot zombies hurling themselves through space that  try to eat your crews brains. Nice price.  Cons: Tends to get a little repetitive if you play it for to long in one sitting.   Overall :  Great game at a decent price.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great little 2D action game mixed with some 4X mechanics which brings a blend between fast paced playing and strategy. The 4X parts aren't all that, but the constant upgrades of your spaceships and ability to modify them to your needs is great. The game has also gotten free post release updates which are worth checking out. It starts off very simple, but gets increasingly deeper as you go along without ever getting too complicated.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really low-strategy 2d space action game. It's less strategic and more action-y than, for instance, AI War. I very much enjoyed the first few chapters of this game, but then a story event happens that causes you to lose all the territory you took, and at that point it wasn't worth it anymore. I don't know how it ends, and it's really not worth finding out.",
            "review_score": "1"
        },
        {
            "review_text": "Start with a tiny space ship. Kill some other tiny space ships. Kill a big space ship. Build a big space ship. Keep making space ship bigger until all space ships are smaller than you. You are king spaceship.   The zombies bit is mids, though.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive, just one more go, old skool style shooter. You'll be wanting to get those bigger ships!",
            "review_score": "1"
        },
        {
            "review_text": "Cute with a ribbon on top. Definatly buy it to support future development. Amazing AI for such a 'simple' game.",
            "review_score": "1"
        },
        {
            "review_text": "Score Based  Challenge - A-    Game is intuitive, presents a reasonable difficulty progression, and a excellent learning curve    Starting Tutorial is fun and engaging presenting the necessary information without being boring    Minus a few points for content that wile interesting, where also tedious and overly time consuming.  Game Quality - C    Game is very well designed and provides a fresh and unique feel that sets it apart from other similar games.    Content is fun and varied, supports a large number of play styles and tactics, all retaining use throughout the game    Biggest hit was for low Replayability. after beating the game i just didn’t feel any need to keep playing.  Refinement – A    Played the entire game, start to finish, and never once crashed or encountered a noticeable bug     Balance and effectiveness of ship types and equipment scale well with difficulty (altho some ships never get used due to late availability in the game, making some of the contents use questionable)    Developers seam to take an active role in the games player community (very impressive for only a handfull of people)  Presentation – B    Not a graphics intensive game, however what is included is well themed and well implemented    User interface is intuitive and easy to use    Kind of hokey in an odd sort of way. Story line is a little weak, however still fun and interesting enough    Hype was dead on. This game is exactly what it looks like, exactly as advertised, and well worth the play time.  Additional Content – B+    Game supports all manner of Mods and additional content    Developers have released a small number of fun holiday themed mods for community use    Modding utilities have also been released to general community, they are complete and effective they do however require some investment in time, energy, and learning to use correctly     Relatively active player community, including a functional wiki, and several active modding forums.  Fun – C+    Surprisingly Immersive, despite its rather primitive look, engaging and enjoyable    Intensive enough to keep the players attention, however some aspects did become tedious and frustrating.    Wile not in my top 10. It defiantly has several core quality’s that make it a 'Must Have' for any game collection   Total Grade – Solid 'B+' this is a very good game. A solid experience all the more impressive due to volume of content, and the relatively small development staff. At the time of writing, this the game is priced at $9.99 and it is worth every penny. Will likely get SPAZ 2 when it comes out.",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive, and loads of fun. You collect resources, fight battles, gain levels, build bigger and better ships to take on bigger and better enemies and further unlock an impressively expansive galaxy. It's not a complicated game, but it can challenge you (and that's a good thing), which is where the addictive quality of SPAZ comes along.  You never feel overpowered (not yet at least) because there are always more solar systems to explore with higher levels required to clear them, but you never feel underpowered either, because you get out as much effort as you put in to leveling up. You have to level up, and you have to explore, but level-grinding doesn't seem so bad because there are so many activities to do with a certain ammount of variety to them. I also like the fact that you can play both sides of the coin when it comes to making allies or enemies out of the two factions of SPAZ's lore, and take on missions according to how your favor with either faction benefits you. I've sunk in about a dozen hours so far and have barely scratched the surface of the universe I'm exploring because of the game's exploratory rewards feeding the kleptomaniac in me. Highly reccomended. Oh, and did I mention that this game is loads of fun?",
            "review_score": "1"
        },
        {
            "review_text": "An updated Star Control for today's gamer. Well worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "Super deep, a randomly-generated open-world with hundreds of star systems, and great combat mechanics with fully integrated physics. Love it",
            "review_score": "1"
        },
        {
            "review_text": "I loaded up this game to see what the big deal was, and well oooh Purdy Colors and the next thing I know it's hours later and I'm spacing goons and mining and making alliances so I can get through different jump gates. Definitely a fun time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is way too much addictive, play with a clock beside you!",
            "review_score": "1"
        },
        {
            "review_text": "A fun game with ships and explosions. Fly around and blow stuff up and do some missions to progress along. Gets a little grindy in the later parts of the game trying to get new ships and tech, but still a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Solid playstyle and many conscious decisions that you can see the developers made. Fun and Addicting, and can run on my 2006 laptop with an hd movie running on another screen. The graphics are beautiful for what this game draws.",
            "review_score": "1"
        },
        {
            "review_text": "do u even zombies bro well this game does spaz is a game about space exploration the first thing you want to do is take off and explore but dont go too fast or youll get blown up by a much larger ship XD i dont want to spoil too much but the blank blank is a zombie spy'ish gather recoucers make ships get them blown up make more i just have one more thing to say BUY THIS GAME FOR CRYING OUT LOUD JUST BY. ps blank blank is a spy (-i-) d (U)",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the most fun indie games that I have ever played. The feel of it reminds me of the origonal Masters of Orion. There are a tons of space games, but very few well programmed ones that are fun to play. I would highly recommend this game to anyone interested in arcade style space games.",
            "review_score": "1"
        },
        {
            "review_text": "If you were a fan of the old school 'escape velocity' or 'escape velocity nova', this is the game for you. This is by far the best Space Combat Adventure game to modern date with similar graphics and gameplay. I have replayed this game more than six times already. Most of the Main Mission Quest Cutscenes are voice acted. Can't wait for the second game in the series. If you are you new to this genre of space combat adventure style game i would suggest picking it up and playing it on 'easy'. The beginning is somewhat easy, but towards the mid to end of the game deaths can be pretty costly if you play reckless like i do. Easy to learn and pick up, but hard to master... Suggest to casual and hardcore space combat enthusiasts alike.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun. Can't wait for the sequel. Very addictive.",
            "review_score": "1"
        },
        {
            "review_text": "I was blown away by how awesome this game is! It piqued my interest because it looked vaguely similar to a game I used to play in my younger years (Inner Space, look it up!) but I was not prepared for the awesomeness contained within. This game is my new addiction, I can't get enough of it! The upgrade system is stellar, the different ships and upgrades are varied and lend to an amazing assortment of strategies, suited for multiple play styles. The reputation system within each system independant of each other means you can have fun and not screw up what you were doing in another place. I just love it. I can't wait for #2 now!",
            "review_score": "1"
        },
        {
            "review_text": "This game is way too much addictive, play with a clock beside you!",
            "review_score": "1"
        },
        {
            "review_text": "Robotron: 2084 (1982) Smash TV (1990) Llamatron (1991) Total Carnage (1992) Operation: Inner Space (1994) Geometry Wars (2003) Starscape (2008) Spore, specifically the space stage (2008)  If you liked any of the above, try this out. It most closely resembles Operation: Inner Space and Starscape. Try the PC demo, it's free.",
            "review_score": "1"
        },
        {
            "review_text": "A space scum captain and morality unhindered scientist drag their passive aggressive conscience around the galaxy wiping out and enslaving solar systems for every minor tech upgrade. Narrated by Total Biscuit doing his impression of the most boring voice actor ever. Managing the bits and bobs on your ships to create the ultimate slave-running death boat team is fun and the Bounty Hunters dlc adds a ship that is a forward wall of lasers. Worth the meager pricetag",
            "review_score": "1"
        },
        {
            "review_text": "spaz is a good game and is good graphics.  i like the gameplay andthe ships the graphics are great. ",
            "review_score": "1"
        },
        {
            "review_text": "Great mechanics, charming graphics, large variety of ships, variable difficulty, good story, lots of replayability.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty darn fun, easy to start playing and stop at liesure. Quite addicting in the short time I've had with it.",
            "review_score": "1"
        },
        {
            "review_text": "Game rocks! I bought it for 2 bucks and put 50 hours in it. I love the different ships you can aquire and there's so many builds and ways to play! The is a blast to play and the controls are great. It's a really arcade-y feeling game but there's so much depths and upgrades to get (and the upgrades aren't just linear ones).",
            "review_score": "1"
        },
        {
            "review_text": "Lost in space With Zombies and bounty hunter all while your just trying to collect and upgrade . it is great for anyone that loves pick your own way games if you got the balls you can attack the stations, love to kill than kill anyone, love to trade than avoid the fights. this game is great for all your space game needs with simple to use controls",
            "review_score": "1"
        },
        {
            "review_text": "If you remember Escape Velocity and miss the good-ol-days of 2-D space battles, then SPAZ may satisfy your hunger. The very beginning is hard, but the difficulty smoothes out over time and you can expect to be butchering the enemy towards end-game (on the non-insane difficulty settings). A surprisingly well-polished game for only a two-man indie crew. The only real gripe I have the lackluster AI which seems to only have one rule set: KAMEKAZI! and the lack of mission types. Expect to be going from point A to point B and killing everything or collecting X amount of things.  Overall an enjoyable game with a good amount of customization.",
            "review_score": "1"
        },
        {
            "review_text": "All the fun of a top-down space shooter and RPG. Very reminiscent of Star Control II in many ways. Fun strategy and great battle and upgrade options. Story is OK - but like many RPG's, can get a little repetetive and straightforward.",
            "review_score": "1"
        },
        {
            "review_text": "Scratch the surface and it soon becomes deeper than a rather deep hole.  Much pleasure to be had shooting escape pods and watching the lil sods writhe in agony as their atmosphere vents exposing them to the vacuum. Or forcing them aboard only to vent them from the airlock anyway-!  That'll teach you for shooting at me with yer frikkin lasers.   Shoot &gt; Research &gt; Resource &gt; Equip &gt; Shoot like a badass &gt; Research Badass Gear &gt; You see where this is going.  Simple yet satisfying.  9.2 / 10",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Played it enough, better be good :-)",
            "review_score": "1"
        },
        {
            "review_text": "Easy to learn, hard to master. Lengthy campaign that is allot of fun. The programmer's kept it simple, and knew how to manage their efforts well.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, great gameplay, great mechanics. LOVE it!",
            "review_score": "1"
        },
        {
            "review_text": "Space! Pirates! Zombies! Need i say more?  However to say more, it is a Great game but somewhat repetitive.  Pros: Choose the way you Play Massive amount of Parts to choose from Easy to Intall Mods  Cons: Turns into a Grind-fest later in the game The Number of Systems can be Overwhelming  Overall its a Fine game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game of a style (had I the time and the talent) I have always wanted to make. It's a very pleasant combination of genres. The closest game I can think of that would be similar is Starscape.  Shoot asteroids for resources, kill ships for xp and crew. Defeat a new type of ship and you get their blueprint. Get enough of that blueprint and you can build that ship. Blast your way through blockades, or trade and bribe your way past.  The loadout interface is surprisingly easy. It's fun experimenting with different components and weapons on different hardpoints of different hulls. Do I add a way stronger blaster and hope I don't run out of reactor power in the middle of a fight? Do I prefer speed or maneuverability? Cloak or shields? Bombs, drones, torpedoes or missiles? Tracking turrets or forward-facing sheer oomph?  The middle-end of the game gets a bit grindy, but the collector/completionist in me still has plenty to do. The developers are cool and keep adding stuff!",
            "review_score": "1"
        },
        {
            "review_text": "This is a excellent action space rpg. Multiple technology trees, tons of different ships, in a very easy to use package. I'm 10+ hours in and have only scratched the surface.",
            "review_score": "1"
        },
        {
            "review_text": "A fun Asteroids-esque space combat game with RPG trappings, and lots of variety.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with lots to do. Great action. Most gamers should enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, modern StarControl",
            "review_score": "1"
        },
        {
            "review_text": "Fans for spacewar and star control series rejoice. Not an especially deep game, but super fun. Very space trader esque without the trading :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, rare to find good space shooters",
            "review_score": "1"
        },
        {
            "review_text": "Its cool I guess. Badgers",
            "review_score": "1"
        },
        {
            "review_text": "Space. Pirates. Zombies. Can't go wrong with this one.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Fun, challenging... Absolutely worth its price.",
            "review_score": "1"
        },
        {
            "review_text": "the game is amazing, you can truly see that this game aint a get rich quick scheme, would buy again =D",
            "review_score": "1"
        },
        {
            "review_text": "Fun and adictive.",
            "review_score": "1"
        },
        {
            "review_text": "I loved it all the way through, can't wait for SPAZ 2!",
            "review_score": "1"
        },
        {
            "review_text": "This one great value in a game. Lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Put simply, this game is amazing! You can upgrade your ships (you choose how and what). You unlock new ships as the game progresses as well as new weapons. Controls are pretty good and what you upgrade matters (never upgrade your engines and your ship will be super slow and turning will require a huge radius and will be super slow. The game looks really good and actually has a pretty good story.   Bottom line, buy this game already! its well worth the price and there is lots of replayability. I definitely got my moneys worth here :)",
            "review_score": "1"
        },
        {
            "review_text": "I played it yesterday all day long... this is the kind of game that sticks to your subconscious and stays there, I continued playing it in my dreams... all night long. That's why it is difficult to let it go. The crave to advance and enhance your ships, and the way to do it just drains your volition dry. I suspect the design of this game was made taking in to account our neural responses. There is even an evil satisfaction when your crew picks up hostages from the floating escape pods... and some of them will be jettisoned out into space, and teared appart by the ships because they refuse to be recruited... allright I confess I have ran over many of them. Pretty scary. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love this one and SO STOKED for the second.  Good action/RTS/RPG elements in Spaaaaaceeeee!  9.1/10",
            "review_score": "1"
        },
        {
            "review_text": "I want to congratulate you for the great work you have done with this video game. It's incredibly addictive, has a good design and there are zombies in space. good job",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but I want more options still.",
            "review_score": "1"
        },
        {
            "review_text": "if you know me you know i play games constantly until i beat them this game is Great, if you played the demo and liked it, i reccommend you buy it 205 hours of game time, and i've beaten it twice",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Stellar Frontier with better graphics, the ability to move to a new solar system once you've wiped out everybody then add big frakkin' guns and lots of 'splosions!  It's pirates and zombies in space! All it needs is ninjas and this game would be perfect! (I hear that's coming in an update...)",
            "review_score": "1"
        },
        {
            "review_text": "SPAZ is an excellent combo of fun, weird, easy to play, strategy, and action! Just the right amounts each of simplicity and complexity. Easily jump in for a little fun, or play for hundreds of hours. Great replay value with random galaxy-creation, randomized quests, and many different ways to build your ships! The developer is so cool that when they finished the Bounty Hunters expansion, which adds a lot to the game, they sent it out as an automatic free update for everyone who already had the game!",
            "review_score": "1"
        },
        {
            "review_text": "awsome game",
            "review_score": "1"
        },
        {
            "review_text": "Addictive, just one more go, old skool style shooter. You'll be wanting to get those bigger ships!",
            "review_score": "1"
        },
        {
            "review_text": "Everything you want in a PC game. It is like MOO and SC combined.",
            "review_score": "1"
        },
        {
            "review_text": "I recently purchased this game and I must say, I love it!   Dont judge it by its initial appearance. I mostly play games like X3 Albion Prelude which are 3d games with 6 point rotation. The more I played this game the more addictive it became. The game play is really good and entertaining not to mention it has lots of things to blow up. It doesnt require a powerful pc to run it either. It has plenty of help features and It was able to pretty much answer all my questions as I have played so far. Might I mention it also has a good story line to it so far and did I mention it has good explosions lol. If you love space games you will want this one as well. I am glad I purchased it. The price I paid was almost unfair to the developers of this fine game. Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "There is lots of Space, You (not really a spoiler)are the Pirates and eventuallly Zombies; Bounty Hunters will sai hi when you get their attention enough.  You have a mother ship that has enough space for certain ammounts and sertain sizes of ships. You go around getting more data untill you level up. you get new weapons from trades or drops (depends if its a friend or enemy). you can bribe your way and avoid fights or not.  2d top down with an area scanner that pauses the game. lots of weapons an ships, and a lot of vialble combos that you can use. lots of replayabllitly with 2 holiday themed mods built in.",
            "review_score": "1"
        },
        {
            "review_text": "Solid but basic game. Starts out fun and stays fun, although it can get tedious if played for too long at a time. The gameplay doesn't suit long sessions very well. The story is likewise basic but serves the game quite well.",
            "review_score": "1"
        },
        {
            "review_text": "For a two-dimensional space shooter, this game has a lot to offer. It makes me think of what EVE Online might have been if it had been concieved as a single-player game back in 1995 or so. It excells as a casual stress reliever and is pretty much guaranteed to keep a player engaged in short bursts for a good time. However, the set pieces begin to repeat themselves after a while- after all, it is still a work in progress- (In the same manner that Team Fortress 2 is a work in progress.) but a damned good one at that.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game. Pirates, zombies, bounty hunters.  Its a little slow at times and a little grindy, but its actually a crazy fun game. THUMBS UP",
            "review_score": "1"
        },
        {
            "review_text": "Yes! I got this on sale for 1.99 and got a great deal. This game is worth full price if you ask me. It's hard to compare but my best effort says...think of asteroids with depth and upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "Its good! cant stop playing it. graphics arnt bad and it has really good progression. definatly a worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "This is quite a charming little game. It has a unique gameplay which reminds me of many other space shooter games, but it has a small twist of strategy and RPGs, which grants a good deal of customization.   Despite what its looks in the begining, its graphics is actually rather pretty, lending a sense of deep, dangerous space, filled with lots of bright colors and galatic bodies.  From 1 to 5, I think I would rate this 4, but being very close to 5. Some multiplay, more variation (there is allot variation, but the game can be rather long so becomes repetative) and less reading could proberbly get it up on the 5. But to be honest, Its a very satisfied 4 :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a really interesting game... It has a weird storyline.... and the story kind of started out weirdly... but its really fun once you get into the game and you know how to play it correctly. Its would be a great game for all people who like space games.",
            "review_score": "1"
        },
        {
            "review_text": "It scratches my Armada itch (wish I still had a Dreamcast) and then some. Fun and addictive!",
            "review_score": "1"
        },
        {
            "review_text": "(edit- after finishing it) Brilliant space combat game made by two people. A balance between action and strategy, leaning a bit on the action side. Collect resources, crew, research data, blueprints for tech, and different ship hulls. My main critisisms are lack of variety in missions and crazy difficulty spikes in the last chapter. Best game I've played on steam in a long time, give the demo a shot!",
            "review_score": "1"
        },
        {
            "review_text": "be pretty good if i new what i was doing :P",
            "review_score": "1"
        },
        {
            "review_text": "If you like 'old school' space games (talking about Comodore 64 to win 98 times here, lol) this is really a game for you. And even if you don't, try the demo, you might like it ;D Devs add new content every now and then and there is much room for additions ;)",
            "review_score": "1"
        },
        {
            "review_text": "Much fun! Basically kind of an Asteroids RPG, but with more action! Good game!",
            "review_score": "1"
        },
        {
            "review_text": "Old school fun done perfectly; a ton of fun, extremely replayable, a great bargain. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome retro style space shooter. A bit of a grind at times but fun progression as you unlock upgrades and new space ship designs.",
            "review_score": "1"
        },
        {
            "review_text": "This is a lot of fun u guys should check it out. Its mostly a stragety game cool story too.",
            "review_score": "1"
        },
        {
            "review_text": "A priceless indie jewel, SPAZ is an amazing game. Take asteroids, give it steroids, add enemies that shoot back, factions, awesome weapons, upgrades, several new dynamics, add in some good ol' zombies, and put it on a galactic scale, and i think you'd have this game. The 15$ is DEFINITELY worth it.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting 2D shooter with RPG and strategy elements. There is not as much variety to weaponry as I would like, however this can be rectified with 3rd party mods. The moment to moment gameplay usually consists of blasting enemy ships to pieces, then swooping over their dropped black boxes to pick up blueprints to build more ships, and resources to level up and purchase new weapons.  The Zombies in the game do provide an interesting mix up to the standard space combat, manifesting as infected ships that can shoot zombies at you. The UI could be more intuitive, some interesting options are buried in drop down menus that may not be obvious to most players; the ability for turrets to autofire is extremely useful, but is hidden in a drop down box and thus went unnoticed for a very long time.   Graphics wise, the game will win no awards; however the textures and effects are servicable and lean more toward the humorous side of things. The tone of the game is not overly serious, this is quite succintly conveyed by the cheesy dialogue. The story is enitrely forgettable, as is the back story. It all reads like some terrible work of fan fiction; I understand that such a small dev team is unlikely to be able to afford a decent script writer, but attempts could have been made to hone their writing skills through free online courses.  The game is fairly customizable upon start up, and runs well even on a back - up Intel GPU on a laptop. Overall, given the price, I would highly recommend this game to anyone interested in space games or 2D shooters. It is obvious that a lot of love went into the production of this game, you are even greeted with a thank - you from the developer every time you start the game up. I look forward to the impending sequel, and wish that there were more games of this type floating about on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Its cool I guess. Badgers",
            "review_score": "1"
        },
        {
            "review_text": "an awesome, simple game with a hint of adictiveness. recomended for when you are waiting for a full team of five in LoL or late night time killing :) Soooo much better than (for example) Minecraft.",
            "review_score": "1"
        },
        {
            "review_text": "Yay. It works.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great 2D game. You need to get past the fact that it is 2D. This game is highly reccomended to those people that played Star Sonata or those gamers out there that like top down games. I have had a lot of fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "An Amzing game where you can spend endless hours and still not be half way done the game.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this on sale a while back. It's not bad, easy to pass a few hours wandering around in space blowing things up.   There are many ships t choose from each with own strengths/weaknesses. While you sometimes do have to use strategy, I have found halfway through the game that it's easy to just explore and outlevel the story missions if they are too hard. Sometimes you'll need to tailor your ship enhancements to whatever encounter is giving you trouble.   I'm usually not too into these types of games but this one has been very entertaining, and through communicating with them on Reddit I've come to like the developers. I think it's worth a look if you have not found anything fresh lately on the market.",
            "review_score": "1"
        },
        {
            "review_text": "A little slow at first, but once you get your first few blueprints for new ships, the amount of customziation you can do is amazing!  Fun top-down space shooter, a blend of space invaders, battletech, and Duke Nukem [the humor]. The grahics are both fun, and don't seem to get old very fast. Space shooter plus customizable space craft &amp; tech tree to support your particular playstyle. Like missles or lazers? Want to use mega-bombers, or carriers with a small fleet of its own craft? You get to decide which ships to build in your 'home base', how they are armed, etc.  Well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Completely insane story, however with addictive, simple gameplay. Try it out when you can for cheap!",
            "review_score": "1"
        },
        {
            "review_text": "really great space fighting game with a good story",
            "review_score": "1"
        },
        {
            "review_text": "Dude. This game is so freakin huge and epic it's ridiculous. It's like the dope ♥♥♥, hugest, deepest sequel to Asteroids that no one even knew they wanted. Buy this game for real dude.",
            "review_score": "1"
        },
        {
            "review_text": "I think there is very little bad I can say about this game, which has taken so many hours of my life. It is just about as much fun as I know how to handle in a space shoot 'em up.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of retro style top-down shooters with space themes and RPG progression elements SPAZ is a good bit of fun. That said, if you're the type that becomes frustrated with unbalanced and in some cases broken ability trees I would avoid SPAZ (and any sequels) until it becomes sufficiently cheap for you to not care.",
            "review_score": "1"
        },
        {
            "review_text": "Great game:  + tactical battle,  + good story  + space zombies!   - weapons are poorly balanced, beams became quickly obsolete",
            "review_score": "1"
        },
        {
            "review_text": "one of best games i have played really fun",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Love the story, love the mechanics, love the combat and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game is easily one of my favorite Steam discoveries. Imagine a two-dimensional Freelancer and you're pretty close.",
            "review_score": "1"
        },
        {
            "review_text": "Space Pirates Awesome Zombies. Top down SHMUP with management part. Also Indie!",
            "review_score": "1"
        },
        {
            "review_text": "Love it, it's like astroid the RPG! Just what i was looking for!",
            "review_score": "1"
        },
        {
            "review_text": "This is very nice This is a complementary review.  The difficulty settings are thouroughly thought. Any complaint about difficulty, rebuilding, etc.  Is the player's fault. The difficulty settings, and map/campaign customs at the begining are directly related to adapt the game to you. if your a massive noob, choose the according settings!  This is a complementary review.",
            "review_score": "1"
        },
        {
            "review_text": "I want to congratulate you for the great work you have done with this video game. It's incredibly addictive, has a good design and there are zombies in space. good job",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. I've put 45 hours into it and i'm not sure if i'm even halfway through!",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly fun and addicting, I couldn't stop playing it. Anyone who enjoys a really deep top-down shooter should love SPAZ.",
            "review_score": "1"
        },
        {
            "review_text": "Love it, it's like astroid the RPG! Just what i was looking for!",
            "review_score": "1"
        },
        {
            "review_text": "somewhat tediacious, but really fun to mess with different combos. (missles vs. beams vs. drones etc.) Try it! spaz 2 should be good.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Eagerly awaiting the sequel. Seriously, buy this...very worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, worth the buy tenfold. Just 1 playthrough took me 46 solid hours, and it was worth every minute.",
            "review_score": "1"
        },
        {
            "review_text": "WOW... didn't think I'd like this but it got my Masters of orion / Star control / Imperium galactica fix out of the way.... Nice game... at $11.00 it was a bargan!! You can pace your self , but it still 'feels' turn based. Space combat is clean. done very well.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! this game just might be my fav indie title this year. brace for unaccountable lost time.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. That is all I can say.",
            "review_score": "1"
        },
        {
            "review_text": "Really Really awesome! Sucked up 47 hours of my life!",
            "review_score": "1"
        },
        {
            "review_text": "Its a really fun 2D space shooter with zombies and a good backstory you should check it out",
            "review_score": "1"
        },
        {
            "review_text": "Very fun",
            "review_score": "1"
        },
        {
            "review_text": "Great game I keep coming back to. Great developers as well.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: +Long Story. (80-120 hours+) +Addictive Gameplay +Challenging +Customization +Terraria Style Hardmode revamp of map.  Cons: -No DLCs for additional ships.",
            "review_score": "1"
        },
        {
            "review_text": "Good overall strategy game but gets monotonous as the game is the same set of quests over and over again in order to get enough goons and other resources to continue.",
            "review_score": "1"
        },
        {
            "review_text": "A really good game , It's more complex then most indie games full of detail, Upgrade System is really thought out, makes you want to find more rez and level up to get better ships . This game is a lot to take in but really easy to get use to thanks to the user friendly interface and a help system that gives you enough info at a time to know what your doing and to make this fun.I would recommend this to anyone. tons of features. A game only two dedicated people made from their houses, show a lot of effect from them. A game truly made by gamers for gamers.",
            "review_score": "1"
        },
        {
            "review_text": "Offers everything anyone could hope from a game.",
            "review_score": "1"
        },
        {
            "review_text": "If there is one word to describe SPAZ, it would be 'ambitious'. If there are two words, they would be 'over ambitious'. It has all the parts needed to make a grand space adventure but ultimatly the various systems are not deep enough to support this. The game is divided into two parts.  The strategy part has you designing ships, plotting a course around the galaxy and managing relationships between three factions. But those relationships carry only over between systems for one of the factions so there's no long term planning in relationship building. And those relationships can be turned very easily so ticking someone off only takes 1 or 2 missions to fix. The one faction that does perist relationships is only ever hostile towards you so your interactions are limited. The ship design system is deep enough but it requires way too much farming. Advanced ship designs require several blueprints which can only be obtained by destoring enemy (or friendly) versions the ship. Advanced weapons also require several blueprints which can be bought or stolen from the faction bases. On top of all that, the weapons can only be used if you reach a certain tech level which again means more farming.  The second part of the game is the tactical action combat. This part has you commanding your ships and piloting one of those ships in space battles. This is where you use the ships you grinded for. Ships handle differently and learing to lead your shots and manage your momentum is key to success in this section of the game. However, because of the slow build of new ships and weapons many battles are the same.  But despite all the negatives, it is possible to loss yourself in the universe and just enjoy the ride. It's a fairly cheap game and is often on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Though initially i was drawn into SPAZ, after a few hours i realized that the bulk of the game boils down to grinding the handful of recycled randomly generated missions you will come across in every sector. Its not really avoidable, to avoid being steamrolled by each group of enemy ships you will have to grind data to ensure your tech level is consistently 5+ levels higher than them not to mention you'll need to grind for blackbox data to build better ships. Assuming youve stuck it out that long you'll find yourself with extremely limited hangar space, which means that in the vast majority of battles you are greatly outnumbered by superior ships.   I tried addressing the game's shortcoming with mods but the modding component of the game appears to be broken as none of them function and i cant be arsed to fix something that should be working when the game is just not compelling enough to warrant it.",
            "review_score": "-1"
        },
        {
            "review_text": "Would love to love it, but the game doesn't love me back.  It's fun and easy until you reach act 3. Then it is just punishing and takes all fun away. Cannons maxed, shields maxed, lots of point im secondary system, almost no points in unused systems... get wrecked by AI ships. Well, sometimes it's still pretty ok, but then you have two enemy ships with equal tech as yourself, but you don't need to know a lot about the game that this won't work. Searching for answers about how to deal with this brings up countless players having the same issue. Trying other stragtegies is no fun because of the random nature of the game and the fact that losses will end up in grinding money to get on track again. Add to this that every respec costs tons of data/XP and stops your progress for hours.  Very disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "If you want to grind rice to make porridge, this game has enough grinding to do just that",
            "review_score": "-1"
        },
        {
            "review_text": "This game could be so good, but you're so underpowered and even the lowest enemies take a solid 10 minutes of laser fire to kill. You have to constantly get these 'resources' called 'rez' for some reason to build ships, but each of your ships can only hold about 2 units of 'rez' before it has to take it back to base. But you can't make it back to base, because your ships are basically made out of paper and you have ♥♥♥♥ing flashlights for laser beams and you keep getting torn apart by every enemy in sight. So you have to keep using resources to build more ships, which keep getting blown up...  It just feels like everyone's having a party and I don't belong there. ♥♥♥♥ this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I have had enough of this game slow progression. Its nothing but a slap in the face and a grind whether you are supply locked or starved &amp; forced to farm areas for goons or rez. The real kick in the teeth is being out gunned by lower tech, even copying you fail. Stealth meter missions are a joke because AI ships are ♥♥♥♥ing ♥♥♥♥♥♥♥♥ and you ahve to micro manage them. This is the 3rd wall ive hit which is unprecedented for me in games for sticking it out this long is beyond me.",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks",
            "review_score": "-1"
        },
        {
            "review_text": "this game is not for kids!! it would be fine if not for all the unnessesary swearing ... you should release a family friendly version ",
            "review_score": "-1"
        },
        {
            "review_text": "First impressions... Pretty bored, it only took 60 minutes before larger enemies started swarming me, and when that happened I ended up getting knocked back to the lowest level ship in the game and had to sit there mining ores for literally a little more than 30 minutes",
            "review_score": "-1"
        },
        {
            "review_text": "Has a YouTube celebrity narrating the intro.",
            "review_score": "-1"
        },
        {
            "review_text": "This games was very bad, the summery of this game is pretty mutch like the space-age of spore barley eny instructions, wandering around endless space untill you find something to kill theres pretty mutch no point to this game in my eyes. ",
            "review_score": "-1"
        },
        {
            "review_text": "now i understand why this game is called SPAZ",
            "review_score": "-1"
        },
        {
            "review_text": "Tried to get into the game but found it very boring.",
            "review_score": "-1"
        },
        {
            "review_text": " What I liked:      Ship designs and variety in weapons     Space combat with your 4 ships     Starting out with small ships, working toward the big ships   What You Need to Know:      You mine asteroids for resources, ( can let the game automine for you)     Half of my playtime is me leaving the game to mine while I do something else ( you lose resources when your ships die     The halfway mark of the game switches to fighting only zombie ships ( I quit at this point, they are not fun to fight)     Zombie ships heal and can take over your ships really fast ( they are cool when mixed with other enemy types)     This game is very grindy ( not in the good way)    My Score:",
            "review_score": "-1"
        },
        {
            "review_text": "ENG:  I do not know nothing about this game, cluttered and a bad combination pirates and UFOs. A bad game!  FIN:  En tajua tästä pelistä mitään, sekainen ja huono yhdistelmä piraatteja ja ufoja. Huono peli!",
            "review_score": "-1"
        },
        {
            "review_text": "It's pretty good in some senses. In other senses, it needs more variation. It really is just do the same thing over and over - or if it isn't, it's done a good job of tricking me into believing that it is.",
            "review_score": "-1"
        }
    ]
}