{
    "app_id": 107600,
    "name": "Waves",
    "release_date": "2011-11-16",
    "developer": [
        "Squid In A Box Ltd"
    ],
    "publisher": [
        "Squid In A Box Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Twin Stick Shooter",
        "Action"
    ],
    "achievements": 54,
    "positive_ratings": 974,
    "negative_ratings": 60,
    "price": 3.99,
    "description": "Set in a Neo-Cyberspace arena your system is being overrun by bugs, errors and viruses and the only solution is to kill every rogue process before it kills you.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/107600/header.jpg?t=1542302574",
    "minimum_requirements": "OS:Windows XP SP2, Vista, 7 Processor:2.0+ GHz or better Memory:1 GB RAM Graphics:Shader Model 3 Compatible video card DirectX®:9.0c Hard Drive:250 MB HD space",
    "recommended_requirements": "Processor:Dual Core Memory:2 GB RAM DirectX®:9.0c",
    "reviews": [
        {
            "review_text": "This game is both nerveracking and delightful at the same time. I love the music and the CONCEPT of the game is easy. That's about all. Getting high scores and surviving in the multiple modes is addictive. I've just played for a total of 2 hours and my brain feels like it's gonna explode! I would definately recommend this game for everyone with a gamepad. I haven't tried playing without it yet, mostly because it's hard enough WITH a gamepad.",
            "review_score": "1"
        },
        {
            "review_text": "intense fun game with good music. I love playing this game and enjoy the feeling you smash your space button, wishing you could do a combo to make an explosion in order to save your ♥♥♥ from those evil little chasing balls :D. This game is easy to play and hard to challenge.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing waves for a while now I can now get up to 928,000 points. It's a very fun game and for you people reading this I say yes for you, if you like shoot em' up type games this just might be your game!",
            "review_score": "1"
        },
        {
            "review_text": "If you like dual joystick shooters, this is a good game in short bursts with enough unique mechanics to differentiate itself from the crowd.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game in the vein of Robotron and Geometry Wars. The gameplay is great and slowly ramps up to give you a chance to learn how to best approach each of the enemy types you face. It has a great feel with points, powerups, and bombs. Check it out if you have any interest in the aforementioned games, because this is well worth the price (at $0.99 at time of writing).",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly addicting. Extremely simple, yet insanely complex. Amazing soundtrack, too!",
            "review_score": "1"
        },
        {
            "review_text": "Great Geometry Wars clone with a very satisfying combo system. Nothing feels better in this world than dropping bomb after bomb and enjoying the light show.",
            "review_score": "1"
        },
        {
            "review_text": "What a fun game it is. Different modes and stuff and once you keep and keep going farther it gets harder and harder. Great game :D",
            "review_score": "1"
        },
        {
            "review_text": "Arena shmup prefected.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing shooter. The different game-modes offer a lot of diversity.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly i wish i installed this sooner, its intense, great graphics, great soundtrack. lots of fun, i love my arcade styles. still cant workout how to plant bombs but thats what draws me back ",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful, and I recommend it to anyone who wants a a good arcade shooter that works with 3D Vision.",
            "review_score": "1"
        },
        {
            "review_text": "Awessome game.Its simple and not so hard to enjoy,i bought it on sale",
            "review_score": "1"
        },
        {
            "review_text": "I seriously recommend this game, it is a lot of fun ! If you like scoring and Geometry Wars, this game is for you ! :)",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyably frustrating. It scratches the same itch that Geometry Wars and Beat Hazard scratches, while still being its own game. Much fun.",
            "review_score": "1"
        },
        {
            "review_text": "What does a person do when departing from others, in order to relax in solitude?  *waves*  ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, but not happy that there is a score cap! Pointless to try and master!",
            "review_score": "1"
        },
        {
            "review_text": "Addicting little game that is a perfect way of passing the time. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutly amazing. a friend told me to get it to challenge his score and not only did i beat it i absolutly demolished it in the survival gamemode. this game has a few different gamemodes and its definatly worth a shot since its very cheap anyway.",
            "review_score": "1"
        },
        {
            "review_text": "'why you no use slowmo? is your uncle a monkey?!' 11/10 would not use slowmo again!",
            "review_score": "1"
        },
        {
            "review_text": "Energetic and colorful topdown shooter with different game modes, good if a bit repetitive soundtrack and achievements! I would play the hell outta this game if I could play it on my phone.  Яркий и красивый шутер с видом сверху. Тут есть несколько крутых режимов игры, няшный, но короткий саундтрек и аж пятьдесят ачивментов! Если бы такая игра шла у меня на телефоне, я бы никогда больше не заскучала в автобусе.",
            "review_score": "1"
        },
        {
            "review_text": "A casual game to play for a few minutes or a few hours. If you're a fan of geometry wars, you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Make an ok bullet hell shooter... ....and set a max score reaching which literally terminates the game  FOR WHAT PURPOSE",
            "review_score": "-1"
        },
        {
            "review_text": "★ ★ ★ ★ ☆",
            "review_score": "1"
        },
        {
            "review_text": "Boring and frantic arcade shooter. Maybe fun on mobile devices. $5 way too much. Unbearable soundtrack. What's this doing in 201x?",
            "review_score": "-1"
        },
        {
            "review_text": "It's an o.k. frustration, rush,rush, game but the difficulty progresses way too fast. Worth about 5 minutes of play. Not my idea of a fun game at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Simple old school gameplay with decent graphics. I've been having fun showing my son who the dominant old school gamer is.",
            "review_score": "1"
        },
        {
            "review_text": "great twin-stick fun 😃 ",
            "review_score": "1"
        },
        {
            "review_text": "Great game to jump into if you only have a limited of time to play. Addicting for sure!",
            "review_score": "1"
        },
        {
            "review_text": "ASSlicking good time☺☺",
            "review_score": "1"
        },
        {
            "review_text": "Music 10/10 Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game If your completly bored.",
            "review_score": "1"
        },
        {
            "review_text": "I think about 30 seconds into playing this game for the first time, I was already smitten. Tons of fun already... deserves its 95% rating for sure.",
            "review_score": "1"
        },
        {
            "review_text": "This game lack from high replay moment like Beat Hazard but the graphic is quite nice and good soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced &amp; fluid pick-up-&amp;-play fun for a quick &amp; colorful gaming fix.",
            "review_score": "1"
        },
        {
            "review_text": "Waves is an arcade style twin-stick shooter that's so much fun, I broke my laptop by trying to shove quarters in the SD slot.  Totally worth it.  Also, it has stunning visuals and a great soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty cool game, but honestly Geometry Wars Retro Evolved and Geometry Wars 3 are better.",
            "review_score": "1"
        },
        {
            "review_text": "Best two bucks I have ever spent! Super addicting and pretty murphed out sountrack.",
            "review_score": "1"
        },
        {
            "review_text": "nice music and gamesystem",
            "review_score": "1"
        },
        {
            "review_text": "Good for a wee game. Nothing amazing but fun none the less",
            "review_score": "1"
        },
        {
            "review_text": "Great relaxing tool! Love this game!",
            "review_score": "1"
        },
        {
            "review_text": "Very classic casual game. worth the penny especially when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Waves is a great example of what's possible with UDK from an indie perspective. It enjoys beautiful visuals and fast paced action.",
            "review_score": "1"
        },
        {
            "review_text": "This shoot 'em up game offers a few different modes to keep you entertained and techno music to keep your mood u. Can I just say I LOVE the smell of exploding geometry?",
            "review_score": "1"
        },
        {
            "review_text": "A addictive game that will keep you amused for ages.",
            "review_score": "1"
        },
        {
            "review_text": "BEWARE TO ANYONE BUYING THIS GAME: This is one of the singlemost additive games of its kind. be prepared to waste alot of your precious time, as this will suck you in like a vacuum cleaner. The only thing I would like to see if a bigger variety in music, as good as the soundtrack is at the moment, it feels way too small (with having only 4-5 tracks). A music update with an extended playlist would be hugely appreciated :3",
            "review_score": "1"
        },
        {
            "review_text": "Not a game about surfing.",
            "review_score": "1"
        },
        {
            "review_text": "Arcade-indie game, I bought it when it had a discount, but totally worth the price it has now!",
            "review_score": "1"
        },
        {
            "review_text": "This game is truly something magical. It has all the qualities of a 'geometry' shooter along with a beautifull ambient styled soundtrack that will mezmerize you everytime you click the Start Game button. If you've always enjoyed playing ambient shooters, definetly consider buying this one.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Twin Stick Shooters out there you can WASTE HOURS on this thing trying to get best your score.",
            "review_score": "1"
        },
        {
            "review_text": "Poster child of a twin stick shooter!",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly Awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Waves is a game very much in the same mold as Geometry Wars: you control a little abstract gun platform and you move and shoot in twin stick fashion with the left stick moving and right stick aiming and shooting. Like most games of this ilk the fun is in the relentless and frenetic action of the unceasing hordes that home in on you and the satisfaction comes from the 'dodging raindrops' finesse you acquire when 'in the zone'. There's even a charging bullet time effect to help you out in a pinch.   As a bonus there's some extra game modes available, but the primary action is the best. There's a trippy electronica soundtrack and a lot of glitzy effects to go with the excellent color palette choices.  My only beef is that there's not an escalating sense of your own lethality which means the climb in intensity levels off and you just continue fending off the frenzy, which while fun can lead to weariness if you're able to pull off a long survival streak. Other than that it's a delight!",
            "review_score": "1"
        },
        {
            "review_text": "Yes it may be very much like Geometry Wars but it certainly has refined it to a absurd degree in terms of gameplay and design, making it my go-to game for twin-stick shooter fun. The differnt game modes coupled with the numerous enemy types makes me always want to give it one-more-try. Definitely give this a try if you like shooters, puzzle, or twitch like gaming.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the nicer dual-stick arcade shooters I've played. It has a relaxed vibe despite all the chaos on-screen, and the many different modes ensure that you'll find at least one way to play that suits you. The concept and execution are great; it's only a shame that due to engine licensing, this game didn't see a release on GNU/Linux. I recommend this game to anyone who enjoyed Beat Hazard or Geometry Wars.",
            "review_score": "1"
        },
        {
            "review_text": "This is a unique twin-stick shooter with great visual effects and sound. A really great game for old-school Asteroids fans.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty and manic, it's essentially Geometry Wars with a slow-motion button, but that's not a bad thing.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game to test your reflexes :)",
            "review_score": "1"
        },
        {
            "review_text": "i cant aim right ",
            "review_score": "1"
        },
        {
            "review_text": "Strategy + Sarcasm + Shapes = Waves",
            "review_score": "1"
        },
        {
            "review_text": "More challenging than Geometry Wars, however there is a severe lack in diverse polygon-based enemies",
            "review_score": "1"
        },
        {
            "review_text": "I kind like remind of Geometry Wars",
            "review_score": "1"
        },
        {
            "review_text": "OK, here is the test for whether you should get this game. Go play some free twin-stick shooter, like Echoes. Did you like it? Then you're going to ♥♥♥♥ing love this game. The controls are awesome and tight. The enemies are all interesting and unique. But the coolest part is the mechanics. The 4 moves are: Move, shoot, bomb, and slow down time. The first two are self explanitary, after a ten hit combo you have a second to activate a bomb, and you slowly charge a buffer, that can slow down time and get you double points while you do so 'because it looks awesome'. Oh, and you also get double points for shooting enemies at point blank 'because it looks awesome'. This game is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Mad as hell twin-stick shooter [a controller is a must!], my only complaint is the sounds could be somewhat heavier - a la Robotron - then it would be pretty much perfect! The scoring system is a bit different, but the plan is to stay alive as long as possible...there are other game modes besides survival...should you wish to.",
            "review_score": "1"
        },
        {
            "review_text": "I always wanted an arcade-style game that would tell me how ****ty I am and I finally own one!",
            "review_score": "1"
        },
        {
            "review_text": "bombing run is really fun!",
            "review_score": "1"
        },
        {
            "review_text": "Colours: The Game",
            "review_score": "1"
        },
        {
            "review_text": "10/10 just for the soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "It's really fun! But I have a REALLY big problem! When I play the game it has an error. Please someone talk to me about this!",
            "review_score": "1"
        },
        {
            "review_text": "Best twin stick I've played on PC. Much better with controller though, for some reason mouse controls don't use raw input and it just feels weird.",
            "review_score": "1"
        }
    ]
}