{
    "app_id": 109500,
    "name": "Fowl Space",
    "release_date": "2012-03-21",
    "developer": [
        "Pixelante Game Studios"
    ],
    "publisher": [
        "Pixelante Game Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Memes"
    ],
    "achievements": 0,
    "positive_ratings": 116,
    "negative_ratings": 77,
    "price": 3.99,
    "description": "A heroic rooster sets forth on a ridiculous space adventure to DESTROY THE SUN!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/109500/header.jpg?t=1447355433",
    "minimum_requirements": "Operating System:Windows XP, or laterMemory:512 MB RAMDirectX&reg;:9Hard Drive:70 MB HD spaceAdditional:Adobe Air 3.0, or higher",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It can't seem to find its own style, it tries too hard to be Castle Crashers, while trying to look like Limbo. Trying to be hilarious by being whacky solely for the sake of being whacky, it just doesn't have any flair. Jokes that an unwell 3 year old could write between brain operations with all the charm of a half eaten burrito hanging shamefully out out of the bin from the night before.  The controls are sloppy, nauseating and plain awkward. You know you're doing something wrong when every level feels like the ICE LEVEL! Slip slide and clunk your way across the same looking backdrops with a slightly different colour hew each time.  I'd put this in a room somewhere with Bad Rats as company, equally as poor.",
            "review_score": "-1"
        },
        {
            "review_text": "Why is this a thing?",
            "review_score": "-1"
        },
        {
            "review_text": "Short, but comedic. Besides, who doesn't love a bloodlust crazed rooster? Got it on sale, I'd advise to do the same!",
            "review_score": "1"
        },
        {
            "review_text": "Is best game.",
            "review_score": "1"
        },
        {
            "review_text": "Why would you waste 4,99 on a terrible platformer with horrible graphics and gameplay, when you could have a 5mV 532nm laser for that same amount of money?",
            "review_score": "-1"
        },
        {
            "review_text": "As the wise Uncle Yem i have proven this game to be classic piece of knish from last night that mama forgot to put in the fridge cause her shows were on and had better things to, then when you get up the next morning you smell the onions and the rotten potatoes and think to your self..'mama is a piece of ♥♥♥♥ just like this knish lying here on the table'. So this game is my careless mother's responsibility in cleaning up the left over knishes.",
            "review_score": "-1"
        },
        {
            "review_text": "Poor controls, low framerate, not funny.",
            "review_score": "-1"
        },
        {
            "review_text": "neds mor memes plz, groceries.",
            "review_score": "1"
        },
        {
            "review_text": "Its awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "I only cared about the sexual innuendo jokes, they were pretty funny. This game is pretty funny. The gameplay is pretty funny. The sounds are pretty funny. The maymays are pretty funny.   This game is triggering me sOMETHING FIERCE",
            "review_score": "1"
        },
        {
            "review_text": "Chickens shooting ♥♥♥♥ with laser beams. It's not bad.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy that ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the most intellectually compelling piece of digital content I have ever had the priveledge of owning. This single digital downloa- NAY, digital ART will drive you to laughter, tears, anger, and happiness all at once as you fling exploding white cats at questionably-evil space vikings from within the sun as the one and only 'Astrocock' with varying degrees of difficulty! The concept is simple and the graphics mimic such games as Limbo (to a degree) with most characters being three-dimensional sillouettes. Despite this, the game is simply beautiful. Honestly, if you have yet to buy this magnificent game, I question your mental stability as of right now.",
            "review_score": "1"
        }
    ]
}