{
    "app_id": 110600,
    "name": "Astro Tripper",
    "release_date": "2011-09-15",
    "developer": [
        "PomPom"
    ],
    "publisher": [
        "Pom Pom Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Shoot 'Em Up"
    ],
    "achievements": 8,
    "positive_ratings": 30,
    "negative_ratings": 26,
    "price": 3.99,
    "description": "Astro Tripper is a furious shoot-em-up experience inspired by the painful, knuckle busting video games of years gone by.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/110600/header.jpg?t=1447354543",
    "minimum_requirements": "OS:XP,Vista,7Processor:1.6GHZ or betterMemory:512 MB RAMGraphics:DirectX 9.0c compatible Shader 2DirectX&reg;:dx90cHard Drive:75 MB HD spaceSound:DirectX 9.0c compatible",
    "recommended_requirements": "DirectX&reg;:dx90c",
    "reviews": [
        {
            "review_text": "Let me start with saying that this game has frustrated me to no end at times with its difficulty and insta-death scenarios. Its a shoot'em'up kind of game in limited arenas of sorts and you beat the level once all enemies are dead and cleared out which you have to do under a fairly strict time limit. A lot of its design choices feel like the are taken or at least inspired by old arcade games since if you die and game over on the third out of four levels in a zone you will need to beat the first two again to retry that area....something that will infuriate you on the harder levels.  The game has a challenging mix of achievements for doing various specific tasks on specific levels or bosses making the game even harder then just playing it normally. Some of these will only take a try or two while others (specially 'Sneeky Incursion' that took me 20+ tries) will test your patience and skill quite a bit.   Time to 100%:  2-5 hours (depending on skill and luck)",
            "review_score": "1"
        },
        {
            "review_text": "Sort of Uridium C64 revisited. Old school side-scrolling shooter, with a graphics flourish and fairly unforgiving gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "I've played in previous version of this game - SpaceTripper. And i have to say that visually it was more stylish less color-mess then this one. I like old one a lot. Not this one =(",
            "review_score": "-1"
        },
        {
            "review_text": "The game is poorly optimized (my card is GTX 680). laggy and framedrop make it unplayable. Do not buy until it is fixed.",
            "review_score": "-1"
        }
    ]
}