{
    "app_id": 111000,
    "name": "The Clockwork Man",
    "release_date": "2011-08-10",
    "developer": [
        "Total Eclipse"
    ],
    "publisher": [
        "Total Eclipse"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Casual"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Hidden Object"
    ],
    "achievements": 0,
    "positive_ratings": 40,
    "negative_ratings": 32,
    "price": 4.99,
    "description": "Explore a fantastic vision of the Victorian era in The Clockwork Man, an epic hidden-object game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/111000/header.jpg?t=1447354487",
    "minimum_requirements": "OS: Windows XP, Vista, 7Processor: 1.6 GHz or betterMemory: 512 MB or moreHard Disk Space: 150 MBVideo Card: 32-bit DirectX 7.0 compatible video card or higherDirectX&reg;: 7.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This was an interesting hidden object game. As opposed to the usual one-screen puzzles in other HOGs, this has huge side-scrolling, vertical scrolling, and zoom-able puzzles that contain hundreds of potential objects, of which you need to find 15-20, many of them tiny or partially-obscured. It is especially difficult considering there is no delineation between the foreground and the background, so clickable items can potentially be on any pixel of the screen.  Being a Victorian-set, European-produced game, I also found the items weren't always labelled with word choices I recognized. I ended up having to use the in-game hints for a handful of French, Italian, and archaic historical terms. However, there is no penalty for using the hint system, and the game features several levels of hints, with the 'I need a slight nudge' level recharging faster than the 'just find this thing for me because I give up' level.  The plot feels almost like a maguffin to get you to solve puzzles, and I don't know if it quite resolves itself satisfactorily. Also, even though the protagonist is supposed to be a 'strong female character,' it doesn't really feel like she's a hero because she spends the majority of the game being bossed around, patronized, and tricked by other characters, and having to clean up after their messes. On a related note, there is a recurring plot-point of 'hidden object puzzles only exist because all of our characters are either slobs or victims of disaster.' All of the hidden object scenes look like they just dumped a random assortment of junk all over the landscape, with no real rhyme or reason to the layout, and no location-specific theme (except for one gimmick level that was hilarious).  All that being said, the art was beautiful, the few mini-games and point-and-click sections were intuitive enough, the voice acting was hilariously over-the-top, and the music was cinematic-quality. It also does a pretty good job of maintaining a steampunk atmosphere throughout the game. Additionally, unlike other HOGs, this has almost no backtracking. You simply either automatically advance to the next area, or you click on the map to jump to a puzzle of your choice from the available options.  For a casual time-waster game with no achievements to worry about, it is worth a chance if you pick it up on sale. While the hidden object scenes are definitely challenging compared to other HOGs I've played, I appreciate the scope of what they tried to accomplish with the scrolling views.  Overall, I would give this game a 5.5/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like the genre, this is one of the better ones. However, it's very short.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the genre, this is one of the better ones. However, it's very short.",
            "review_score": "1"
        },
        {
            "review_text": "Primarily a hidden object game that includes a few other minor puzzles, such as placing items into your inventory, combining them and then using them on the environment.   The art is nice but set at a smaller box resolution, the Steam overlay doesn't work and the story and voice acting are rather dull. That leaves you with the meat of the game, finding objects! The environments are nicely drawn and you have a list of 10-20 objects or so to find in each scene. A robot ally can spot items for you at the expense of some of his slowly replenishing energy--the game's form of hints.   Objects you need to find are repeated quite often considering the game is only about two hours long. There's a free mode after finishing the game where you can spot to your heart's delight, and playing the game again is supposed to shift the scenes. I don't know why anyone would want to because it's a bore.",
            "review_score": "-1"
        },
        {
            "review_text": "The story is intreaging and all, but the screen is small and I can hardly decipher anything from my usual distance from the screen. Like another HO game I have to stick my face to the screen to be able to see clearly. It's very tiring. I got irritated many times playing it. I wouldn't really recommend it.",
            "review_score": "-1"
        }
    ]
}