{
    "app_id": 111100,
    "name": "Snuggle Truck",
    "release_date": "2012-02-03",
    "developer": [
        "Owlchemy Labs"
    ],
    "publisher": [
        "Owlchemy Labs"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Casual",
        "Racing",
        "Indie"
    ],
    "achievements": 11,
    "positive_ratings": 363,
    "negative_ratings": 81,
    "price": 3.99,
    "description": "Welcome to Snuggle Truck, the award winning over-the-top physics-based indie driving game. Save your cargo of crazy animals by delivering them to the zoo unscathed in the least amount of time. Tilt your truck, catch the fuzzies, drive over armadillos, and rocket your way through hills, caverns, and deserts.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/111100/header.jpg?t=1513875027",
    "minimum_requirements": "OS: Windows XP SP2 or later Processor: 1 GHz CPU Memory: 512mb (1gb for Windows Vista or Windows 7) Hard Disk Space: 100mb Video Card: Video card with 64mb of memory DirectX®: 9.0c Sound: DirectX 9.0c-compliant sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Snuggle Truck attempts to do something very simple in what it offers, and for the most part it succeeds. The main problem comes with the frustration of acquiring all medals available.  The basic premise of the game is to go through groups of increasingly difficult levels and achieve specific goals in order to earn medals. There are easy, medium, hard, and extreme groups of levels. In easy and medium, it's actually fun to hone in your skills and fight for all the medals. In the hard levels, the fun begins to diminish into something comparable to an annoying task or a dreadful job. The extreme levels are so much worse than the hard levels, that the experience ceases completely from being a game and fully becomes a terrible chore, or a punishment.  If getting the basic medal for all levels is enough to please you, then you'll be able to easily beat the game in less than an hour. On the other hand, if you're a perfectionist, and getting all possible medals is your goal, I'm sure that there may be at least ten hours of entertainment here for you. There are also some bonus developer created levels, as well as thousands of user created levels for you to download from within the game, but actually wanting to experience this much content will depend on how patient you are and how much fun you are able to get out of Snuggle Truck.  Snuggle Truck is okay.",
            "review_score": "1"
        },
        {
            "review_text": "Just bought the game for the Brony Mode XD I like the game ;)",
            "review_score": "1"
        },
        {
            "review_text": "Snuggle Truck is quite possibly the greatest game ever made. From an objective standpoint, nothing else comes quite close to delivering the kind of experience that this game is capable of. If I were to choose one game in existence to prove to somebody that video games are art, it would definitely have to be this masterpiece.  Firstly, I would like to begin this review by asking the question: what is a video game? Some people would simply answer this by saying that video games are an interactive medium with the sole purpose of delivering entertainment to the players. Others prefer to give long philosophical answers which tackle every facet of this age-long riddle. After playing Snuggle Truck I can honestly say that any answer to this question is meaningless, and one only needs to play this game to fully appreciate the marvellous wonder of this pastime known as 'video games.'  With that said I would like to break the game down as much as possible within the limitations of purely text-based reviews; after all Snuggle Truck is a deep, complex experience which would transcend standard, traditional review formats. One of the most notable things I would like to bring to the forefront is Snuggle Truck's graphics and visual style. When I first loaded this game and began playing, I thought the game had crashed. Let me explain: I'm an avid fan of trucking in general, and as a result my desktop background is a constantly-changing slideshow of truck imagery. The visuals in this game are so incredible that I mistook graphical images for photography. The animation is also so incredibly smooth and lifelike that I actually started to feel brief motion sickness after only a few seconds of play.  This soon passed however as I quickly became immersed in the truly innovative and revolutionary gameplay found in this work of art. Snuggle Truck takes similar games such as Euro Truck Simulator 2 and completely slaps them in the face with its own brand of hyperrealistic physics and gameplay scenarios which leaves a completely before-unseen impression on the player. Because of how intuitive, responsive and predictable the controls felt, I was very quickly able to adapt to how the game must be played; and it even left me thinking 'hot damn, this is so lifelike, I could probably do this in a real life truck.'  That's not to say the game is easily played, however. While the game presents itself as being extremely accessible through its controls and simplstic gameplay objectives, this game has a very steep difficulty curve which constantly demands the player to step up their game. The difficulty is fair and never feels artificial, and if you mess up, it's 100% your fault.  The audio in this game is beyond noteworthy. No lie, when I finished playing this game because I had important things to do - such as sleep so that I would have enough energy the next day to play more Snuggle Truck - I basically had to leave the game idling on the title screen because the music is so incredible. It's insanely catchy and would make great classical composers of past ages such as Bach and Mozart weep with envy.  With everything said, I believe it stands to reason that Snuggle Truck should be considered one of if not the greatest game ever made. If, after reading this review, you still have any doubts as to whether or not you should buy this game, you are probably literally Satan; though I doubt even the dark lord himself wouldn't get a kick out of this truly magnificent magnum opus.",
            "review_score": "1"
        },
        {
            "review_text": "I could NOT resist! Bringing cuteness into physics, and a somewhat reminder of Line Rider, the ability to create your own tracks - I had to buy it! It's yet another incredible indie game, and well worth the price. Get it!",
            "review_score": "1"
        },
        {
            "review_text": "If you like games with cute graphics, catchy music and simple fun gameplay you could do much worse than this.   With only accelerate, decelerate and tilt as your controls, the objective is to take your truck through an obstacle course without allowing your cuddly toys to fall out.   I really like it. It's the kind of game you can play for 5 minutes and then put down, and the upbeat music puts a nice big grin on my face.   What more can you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "Snuggle Truck is a game on Steam that was previously a flash game called 'Smuggle Truck', a game commenting on the trials of immigration to the United States from Mexico. This is a narrative thread with satirization that works quite well.  Snuggle Truck is about transporting stuffed animals to the zoo, which makes for incredibly confusing commentary. First of all, where are the stuffed animals trying to escape from? Are they escaping from the bedrooms of a particularly stultifying suburb? Suburb living is the safest, blandest living there is to offer in the United States. Are they going to Burning Man or something?  No, they are going to the zoo. For some reason. Why? Are you playing as an international stuffed animal trafficker? What kind of demented mind steals teddy bears and stuffed elephants from the bedrooms and playplaces of children everywhere to take them to the zoo? What is to be gained from this action, especially when there are real animals to look at and already existing stuffed fascimiles to buy fresh from the gift shop at manufacturer suggested retail prices? THIS GAME MAKES NO ♥♥♥♥♥♥♥ SENSE AND THE MESSAGE IT OFFERS TO THE PLAYER IS ♥♥♥♥ING CLOWNSHOES.  It is a solid physics flash game and it'll entertain you for twenty minutes before it starts to get boring. BUT IT MAKES NO SENSE.",
            "review_score": "1"
        },
        {
            "review_text": "very nice game cute and funny and all the ♥♥♥♥ that entertains sometimes!",
            "review_score": "1"
        },
        {
            "review_text": "Ok, Snuggle Truck (and Smuggle Truck) are pretty fun little games. Sometimes I like to relax with a casual game like this for a few minutes, I picked this up months ago.  But just now they added 'Brony Mode'... They snuck bronies into my Steam game collection. My Steam list is tainted forever now. Jerks.",
            "review_score": "1"
        },
        {
            "review_text": "Snuggle Truck is a strange little game that I purchased because I was dumb enough to buy something simply because it featured something related to something completely different. That is not to say that it was necessarily a bad decision in the end, rather something that I have learned not to do. None the less.  The game is a simple physics game requiring you to get from point A to point B while still keeping your cargo inside of your truck. There isn't really much more to it than that. It's a bare bones game that is great when you feel like having some stupid fun, but is definitely something that could use a little more polish. It gets boring if you play too much of it at once. I suppose in the end it is worth the price of $5.00.  Also, for those curious of the origin of the name, the game was originally named Smuggle Truck and required you to bring foreigners past the border. See, learning can be fun!",
            "review_score": "1"
        },
        {
            "review_text": "GOTY all years, marvelous gameplay, stylish graphics, great replayability, fantastic sound, insanely creative, an absolute must if you call yourself a hardcore gamer. BUY NOW!!",
            "review_score": "1"
        },
        {
            "review_text": "Would snuggle again - 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Pricetag completely justified.",
            "review_score": "1"
        },
        {
            "review_text": "But ♥♥♥♥, it was 99 cents.",
            "review_score": "1"
        },
        {
            "review_text": "I made this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is way more entertaining than it should be! :)",
            "review_score": "1"
        },
        {
            "review_text": "This title screams 'started life as a mobile game.'  It's mindless fun and probably worth picking up on sale and you want that kind of experience on your desktop. The graphics, music and level design are all competent. My main complaints would be the inability to distinguish obstacles from harmless background art and the 'baby fuzzy' mechanic is a little undercooked. I don't see myself going crazy unlocking all the medals but if you're a relentless completionist there's a lot of reasons to go back and replay levels. But if you just want to play all the levels it's certainly within your grasp, nothing about the game is frustratingly impossible and the learning curve is reasonable.",
            "review_score": "1"
        },
        {
            "review_text": "A delightfully fun physics-based game. Don't let the name fool you; while it may seem like a game for children, it can get ridiculously difficult at times. This game can certainly entertain you or a group of friends, no matter the age.",
            "review_score": "1"
        },
        {
            "review_text": "More entertaining and challenging than you might expect going in.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Addictive iOS gameplay",
            "review_score": "1"
        },
        {
            "review_text": "It be funtastic!! The soundtrack is cool too.",
            "review_score": "1"
        },
        {
            "review_text": "It's adorable, it's challenging, and you will feel terrible each and every time you lose a poor little fuzzy to your terrible driving skills.",
            "review_score": "1"
        },
        {
            "review_text": "Snuggle Truck, life or video game? Once you play this game it WILL become your life. It is an obsession you will be unable to fufill because Snuggle Truck is life and thus unless it is your life you will be unable to fufill the desire that is Snuggle Truck.",
            "review_score": "1"
        },
        {
            "review_text": "Snuggle Truck is a relatively fun casual deliver x stuffed animals in x time game. It has a nice amount of content, levels and an awesome editor meaning the community can make levels giving an unlimited amount of playable content. However, the game itself has too many minor errors making it not worth the hassle and here is why:  Pros:   ♦ Decent Graphics and Sounds (These are alright for what it is, they are not amazing but fit the game) ♦ Medal Concept is Great (Unlocking medals for completing x goal in a level is nice as it gives you something to do in the level and adds a nice amount of content to the level) ♦ Gameplay is fun and works with minimal glitches (Driving through the level and delivering x stuffed animals in x time just works. It is pretty fun if you are the type that likes to be number one on the leaderboards and must complete all level challenges. If you don’t like playing a game for leaderboards or completing challenges, then you probably won’t find this as fun as I did) ♦ Easy to 100% with Achievements (Has a nice number of easy Achievements which are mainly unlocked by just using features of the game and completing the game) ♦ Steam Trading Cards (This is always a bonus) ♦ Each level design is unique (This is nice as every level feels different and no two levels feel as though it is a repetitive copy of the last level) ♦ Decent level editor (Amazing level editor that allows anyone to create a level and upload for anyone to play. This is an awesome feature as it adds an potentially unlimited amount of levels and content to the game) ♦ Truck and Stuffed Animal skins are very detailed (Custom Skins are designed very well for what they are and add a nice little bonus to the game) ♦ Price is reasonable ($5 for a game is decent as if you look past all the cons you’ll get your $5 worth)   Cons:  ♦ No Steam Cloud Storage (I’ve had to restart this game 3 or 4 times for the sole fact of no Steam Cloud Storage and me always losing my save file. You could say I should’ve backed up the savefile, but there is no easy way to tell which games you own have SCS. Therefore, as the game progresses by completing one level to unlock the next, SCS would be relatively beneficial. Plus, If a game is on Steam and doesn’t make use of this free feature, then in my opinion it shouldn’t be on Steam) ♦ Method to activate custom skins is annoying (Firstly to be able to even use them you have to go and enable them in a “+more” menu. The “+more+ menu doesn’t lead on to what it is until you click it which is annoying as I had no idea what It was until I clicked it. Though, once you’ve enabled all the custom skins, you have to then get into a level and click the truck until your truck has the skin you want. This concept would be fine if it didn’t mean you had to waste a play through just to enable a skin. The skin should be able to be enabled and selected from within the “+more” menu) ♦ Lacks Steam Workshop (This is bad as the game makes you upload to their servers and for some reason created levels don’t always stay. I say this as I created a level a while ago and started playing Snuggle Truck again only to find my level deleted. Plus, custom levels not moderated properly as the only way is by a star rating which doesn’t explain much. With Steam Workshop levels would be moderated by the community via ratings and comments etc and would be more likely to stay in the game)  ♦ Has DLC activated automatically (This is a weird concept as the game calls certain features DLC but you can’t actually buy any DLC for the game. This confuses me as to why it’s even called DLC) ♦ Custom level highscores don't load and you have to quit the game to continue playing (When you click the highscores in Custom levels made by users, it just shows a spinning loading circle and does nothing else. You can’t close out of the spinning loading circle, meaning you have to close the game and re-open it if you want to continue playing) ♦ No way to delete a Downloaded Custom Level (This is annoying as I stated not all levels are moderated. Therefore, if you download a bad level there is no way to easily delete it within the game. This is annoying as it fills your list of custom levels with a lot of potentially unwanted ones making it hard to find the ones that you actually enjoyed and work) ♦ Has impossible times in highscores rendering them broken (Highscores just work, however some scores are obviously impossible and hacked in some way. There needs to be some sort of moderation of highscores or a global reset to make number one even achievable) ♦ Pressing escape to go back to the main menu at times loses the mouse cursor making the menu unusable (This is annoying as not being able to use the mouse on a menu means you can’t actually select anything. This ultimately means you have to close the game and re-open it to continue playing) ♦ Alt+Tab brings up a pause menu that doesn’t act properly (When you press Alt+Tab and return to the game it brings up a pause menu, which is nice ingame but out of game on the menu it still comes up and trying to return to the game or close this menu doesn’t function properly) ♦ Makes use of Steam Global Leaderboards via Steam Stats but they don’t function (This is a nice feature to have, but for whatever reason there are no entries in these leaderboards and one of the level entries is “Test” which shouldn’t be the case)  Overall, even though gameplay seemingly works and is fun, the game is cheap and has a decent amount of content, I can’t recommend this game. I can’t recommend it because there are too many minor errors within features of the game that should have been eliminated in early beta stages. Plus, having no cloud storage is a big factor for me not to recommend a game like this.",
            "review_score": "-1"
        },
        {
            "review_text": "Go buy yourself a hot coffee, then, remove lid and put it in your car. Now, drive a bumpy road somewhere with jumps and watch your coffee being spilled all around. That's what this game is.",
            "review_score": "-1"
        },
        {
            "review_text": "While fun, not very fit for a PC game, buy it on mobile instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Snuggle Truck sounds like a creepy van where you will either get murdered or ♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "A game with Bronies in mind. Amusing for 5 minutes and that's about.",
            "review_score": "-1"
        }
    ]
}