{
    "app_id": 11200,
    "name": "Shadowgrounds Survivor",
    "release_date": "2007-11-14",
    "developer": [
        "Frozenbyte"
    ],
    "publisher": [
        "Frozenbyte"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Trading Cards",
        "Includes level editor"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Sci-fi",
        "Isometric"
    ],
    "achievements": 0,
    "positive_ratings": 328,
    "negative_ratings": 239,
    "price": 6.99,
    "description": "Surviving is only half the game. The award-winning atmosphere and gameplay mechanics of the original Shadowgrounds make a triumphant return in this spin off/sequel armed with a slick new feature set! Shadowgrounds Survivor tells the story of the last remaining humans on Jupiter's moon Ganymede, where the alien onslaught is in full force.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/11200/header.jpg?t=1547127016",
    "minimum_requirements": "Supported OS: Windows® XP / Windows® Vista Processor: 1.5 GHz Processor (2.0 GHz+ recommended) Memory: 512 MB RAM (1024 MB RAM recommended) Graphics: DirectX compatible 128 MB graphics card (512 MB recommended) DirectX Version: DirectX® 9.0c Sound: DirectX compatible sound card Hard Drive:1 GB Hard Drive space Gamepad required for co-op play NOTE: Shadowgrounds: Survivor uses PhysX, which is a physics library by NVIDIA. It works on all graphics cards, including AMD and ATI. Installing the free PhysX Legacy drivers may be required for the game to launch.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Totally worth a dollar.",
            "review_score": "1"
        },
        {
            "review_text": " Shadowgrounds: Survivor  was first released 7 years ago as a sequel to the original  Shadowgrounds . It's a pretty well-made game, all about shooting hordes and hordes of pesky zombies from a top-down perspective. The story isn't remarkable in any way: three survivors of a massive alien attack try to 'get out' in any way possible.  Developer Frozenbyte has however improved upon the original in several ways. First of all, the three characters manage to come across as individuals, not as thirteen-in-a-dozen heroes, mostly thanks to the excellent voice-acting (although it's sometimes over-the-top, but better this than bland voices). Secondly, the weapons-arsenal is pretty neat, with a very distinctive 'feel' about every weapon and individual weapons for all three character. Added to this is a well thought-out weapons- and character upgrade-system, which adds a light rpg-flavour to the game. Don't expect any keep of delving deep into weapons' customization or character builing, but still, it's pretty well done and really adds some much-needed depth to the gameplay.  The original Shadowgrounds already had some solid graphics and these are markedly improved upon in Survivor. Especially light&amp;shadows, explosions, fire effects (awesome flamethrower!!) and physics-effects are really impressive. Just as in the original, level-design is more than decent, with several items to search for and a logical built-up of each level. I found the game to be a tad short: after just under 5 hours I was through the singleplayer-campaign, not even having unlocked all of the character and weapons-upgrades. This can be done in the six unlockable missions where you have to keep alive for as long as possible, but since the leaderbords are dead now, that's fairly useless. Actually I wanted to play along for a bit longer, which is always a good sign. Alas, there have been seven years past since its release, so it seems like this little 'franchise' will stay at two items forever.  All in all, this is totally recommendable game for anyone who fancies shooting dozens of zombies in a no-brains way. I feel it's a bit expensive (7 euro at the moment) for a small-scale seven years' old game, but it gets discounts quite often, especially in a pack together with the original Shadowgrounds. Steam trading cards are a welcome addition too, Steam achievements are not here.  Overall score: 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Survivor takes the game to a basic marine and 2 other characters. The plot switches between them. It's nice to have a different camera setting but the default is the best. In Survivor every new area gets a voiced dialogue. It really adds to the atmosphere. All the loading area's become a bit annoying. It's a fun game over all. It's still a grind fest of enemies with weapon parts to upgrade them for more damage.",
            "review_score": "1"
        },
        {
            "review_text": "Spending less than what a sandwich costs on the shadowgrounds + shadowgrounds survivor pack was money well spent (bought it on sale for 1,50€). Survivor is a good 'sequel' to the first, improving on many features. The new physics, the same (or better?) lighting, shadows and shaders for a game not really demanding, the hordes of aliens, with the occasional variety in them, improved weapons, skill upgrades, experience, fun survival mode, some secrets you can pick up to spice up the old campaign from now and again, a cheesy but okay story, fitting the style for people who like movies like Aliens but are fine with not taking everything so seriously. Not many bugs, I did have the physx problem, but a quick look into the community forums resolved that (had to download a legacy driver, then it worked just fine). It's refreshing to see when a developer takes an old idea, the top-down shooter with the sense of style of gunning down hordes of aliens, and mixes it up a bit with working ideas, adding what you can do in a fight; from throwing a grenade with the now-added grenade button, to doing a special attack, to fleeing, flashlight alters at least the spiders behaviour, to simple shooting, also having an alternative attack at your disposal, which varies with the weapon and also needing to be upgraded.  The design of the levels and aliens are obviously inspired by many iconic films and characters, but still made in their own unique way which is appealing for a light game of this nature. There are drawbacks, some cinematic animations can be mediocre (animations in general are simple in nature), as with the voice-acting, but I can let that slide, seeing as the atmosphere and gameplay still holds up as giving much more than what I paid for.",
            "review_score": "1"
        },
        {
            "review_text": "I would define Shadowgrounds Survivor as 'Weekend light fun'.  It's almost the same as the original, just a bit deeper: Different characters blasting their whay through alien hordes using different weapons and skills, going from point A to point B grabbing supplies, shooting everything and discovering secrets.  As simple as that, the game is short and limited: Three characters, each one with two different weapons and a tipe of grenade, not a big amount of enemies to shoot at, some levels with the smallest variation (There's some defense zones, and in the end you get a mecha) and.. nothing else.   The campaign lasts over 3.6 hours (Or that's what Steam says). After beating it, two new difficulty levels are unlocked, several survival maps and extra options (If you found enough secrets) to help you or make things silly in the second playthrough (If you want to do it). Also it has a map editor and coop, although I don't think that it has a very active communitty.  In short, is a REALLY short game that does not a lot of things, but it does them right. Its not a great game but it is also not a bad game. If its on sale and you want to spend some time killing aliens, this is a good choice (Even better if it comes with the original), if you are looking for something more than a short distraction, look elsewhere.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, very fun however can finish the entire game relitivly quickly",
            "review_score": "1"
        },
        {
            "review_text": "Quick pace and lots of action.   PS- Try not to stand in one spot for to long or you might get killed.",
            "review_score": "1"
        },
        {
            "review_text": "It was given away free and has steam cards so thats at least 30p profit.  Dont actually play it though, the shot gun man does not fire/reload correctly.",
            "review_score": "1"
        },
        {
            "review_text": "Good game and great bargan at less than £1. Gave me around 3 hours of gameplay before completion. Shame there are no achievements as there could have been a lot. Secrets are interesting enough to want to hunt out as they give bonus 'cheat' modes you can apply to a new game, awarded to you once you complete the game for the first time. That gives you a little reason to replay but not much. Game is a big challenge on the hardest difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "it says 'coop' differently from shadowgrounds 1 , but it's like the other ones, it's offline coop",
            "review_score": "1"
        },
        {
            "review_text": "WHERE DID THIS COME FROM LOL",
            "review_score": "1"
        },
        {
            "review_text": "Another classic .. Can't recommend this enough :)",
            "review_score": "1"
        },
        {
            "review_text": "The second part to the series. The story doesn't continue but it takes place on the same moon (Ganymede).  The graphics are better this time around and the dodging has been improved. The main characters (yes you get to play multiple characters throughout the campaign) don't go around rolling like crazy men/women anymore.  Also each character can't lug around 10 weapons at a time, which is a bit unrealistic imho, but only 4 weapons out of which one would be standard hand grenades. The other three weapons are unique to each character.  The upgrade system has been revamped. This time around you can upgrade your character as well as your weapons. And different characters have different upgrades.  Again not much of a story but definitely very fun playing. Also allows local co-op, but I havent tried it yet. If the sale is on, then I would say go get it. Fun timepass.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is incompatible with current versions of PhysX, so you need to download Nvidia PhysX Legacy if you want to play.",
            "review_score": "1"
        },
        {
            "review_text": "Basically the same thing as the first Shadowgrounds but continuing the story and more character/weapon customization. The soundtrack is also pretty nice. Short game but a cool top-down shooter.",
            "review_score": "1"
        },
        {
            "review_text": "WHERE DID THIS COME FROM LOL",
            "review_score": "1"
        },
        {
            "review_text": "Another classic .. Can't recommend this enough :)",
            "review_score": "1"
        },
        {
            "review_text": "After finally getting this to work because the game doesnt install the drivers it needs (doh) i might not have really bothered. Don't take it the worng way this is a really really good game and I do recomend it. However I totally recomend you play this before Shadowgrounds - simply because there is actually more game to play in shadowgrounds. The levels in this game feel smaller than its predecessor and they are smaller - a lot smaller. Also the enemies seem to come in waves as opposed to patroling in areas or instance based this I found to be a real downer and completely removed the stealth and strategy that shadowgrounds did really well to incorporate into its gameplay. There are a lot of good points to mention but really after playing shadowgrounds this game feels like a step backwards. I can see how they have tried to vary the gameplay and experience by introducing 3 chars and splitting the weapons betwen them and introducing char specific skills which do indeed give a new gameplay experience, its just not as satisfying as Shadowgrounds. Also the biggest factor why this is a pale sequel - it seems to have no real narrative - no real story - nothing that makes you want to explore the levels even more mostly because they are too small but also there is no storyline reasons to really except go from here to there and kill waves of aliens.  The gameplay in itself is as smooth and as polished as the first one but the lack of story and msaller level size make this a poor sequel.  A very good game. A very poor sequel.  If you do buy the shadowgrounds pack - i would play this first - there isnt really any spoilers. Shadowgrounds is far superior piece of work with a kick ♥♥♥ story to boot and doesnt deserve to be spoilt by playing this after that. Play this before that.  ",
            "review_score": "1"
        },
        {
            "review_text": "Survivor doesn't run 'out of the box' on modern machines. The devs have offered a workaround but until it's remedied in the Steam build I can't recommend buying it - If it's good enough to sell, it's good enough to get into saleable condition.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT PURCHASE! Game crashes shortly after startup!",
            "review_score": "-1"
        },
        {
            "review_text": "The first game was boring, but this one somehow managed to be even more boring,  1.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Same as first... not good enough",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes on me every time no matter what settings i try, even reinstalled, and also verified. this is the msg i get when on win7 norwegian: problemhendelse: APPCRASH  Programnavn: survivor.exe  Programversjon: 1.0.0.1  Tidsstempel for program: 4805edd8  Navn på feilmodul: survivor.exe  Feilmodulversjon: 1.0.0.1  Tidsstempel for feilmodul: 4805edd8  Unntakskode: c0000005  Unntaksforskyvning: 001e8298  OS-versjon: 6.1.7601.2.1.0.768.3  ID for nasjonal innstilling: 1044  Tilleggsinformasjon 1: 0a9e  Tilleggsinformasjon 2: 0a9e372d3b4ad19135b953a78882e789  Tilleggsinformasjon 3: 0a9e  Tilleggsinformasjon 4: 0a9e372d3b4ad19135b953a78882e789",
            "review_score": "-1"
        },
        {
            "review_text": "I bought both Shadowgrounds and Shadowgrounds: Survivor in a sale and played the base game just fine. However, this game would NOT LOAD RIGHT! Every time I tried to play it, it would crash. Don't understand how this is but considering the fact that I could play the original and can't play this, I cannot reccomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage from a dev who uses Early Access.   There are much better games than this, like Alien Swarm which is free.",
            "review_score": "-1"
        },
        {
            "review_text": "Game doesn't work!!!!! Crashes just after the load screen everytime. Needs to be fixed. Don't know if it's a steam or developer issue. But DO NOT buy this game. Otherwise you're just wasting your hard earned $$$$",
            "review_score": "-1"
        },
        {
            "review_text": "i can't play this game! it error",
            "review_score": "-1"
        },
        {
            "review_text": "Meh, just more of the same here.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is a slight improvement over the original. Still, the gameplay is repetitive and there is still no online co-op. Back to Alien Swarm, people!",
            "review_score": "-1"
        },
        {
            "review_text": "Shadowgrounds Survivor,an clear point to me back to the past,but not in a good way. But why?Lets talk about it.  Warning,this part of the Review will contain Spoilers of the first game,Shadowgrounds(the ending of it).if you don't wanna Spoil it skip this part to the next Head-text",
            "review_score": "-1"
        }
    ]
}