{
    "app_id": 11240,
    "name": "Space Trader: Merchant Marine",
    "release_date": "2008-10-23",
    "developer": [
        "Meridian4"
    ],
    "publisher": [
        "Meridian4"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Space",
        "FPS"
    ],
    "achievements": 40,
    "positive_ratings": 299,
    "negative_ratings": 310,
    "price": 3.99,
    "description": "Start as a Rookie and earn your way to Master using shrewd trades, back alley deals, bribes, a well-placed bullet and more in Space Trader!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/11240/header.jpg?t=1511279025",
    "minimum_requirements": "Supported OS: Windows XP/Vista                      Processor: 1.0 GHz Processor                         Memory: 512 MB RAM                      Graphics: DirectX Compatible 128 MB Video Card                     DirectX Version: DirectX 9.0c                     Sound: DirectX Compatible Sound Card                      Hard Drive: 300 MB of Available Hard Disk Space",
    "recommended_requirements": "Supported OS: Windows XP/Vista                      Processor: 2.0 GHz Dual-Core processor                     Memory: 1 GB RAM                     Graphics: DirectX Compatible 256 MB Video Card                      DirectX Version: DirectX 9.0c                     Sound: DirectX Compatible Sound Card                      Hard Drive: 300 MB of Available Hard Disk Space",
    "reviews": [
        {
            "review_text": "Space Trader is a very casual trader game. You mostly trade stuff and try to make as much profit as possible in a predifined timelimit. Trading side is like playing the old drug wars but it has some extra quests dialogs and events added.   On top of that there are bounties you can collect which take you to combat mode. If you catch the target, it's just more money. Additionally you will occationally get boarded by officials who try to make you pay taxes. If you are greedy, you will try and fight em, which will make the game even more interesting. Hard Stakes =) While the basic game is easy, the challenges can feel ridicilously hard giving something extra to the game.  If you are looking for something special you will definitely be disappointed, but I found it to be a fun and easy going game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the coolest games I have ever played. For the price, I think it is the best game you can get.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game and pretty cheap. The one problem I have with it is the chapter setup makes it seem rather limiting and you seem to lose all progress between the chapters. That said, its fun for what it is. The bounty missions are a nice change, explore mode (i.e. walking around) has some nice suprises in it and trading (the reason I played in the first place) works well and is what I expected. So buy, play, enjoy, just don't expect a deep several hundred hour trading game.",
            "review_score": "1"
        },
        {
            "review_text": "best game ever its better then any other game on the market.this game has potention to be the next call of duty with its real world stratigy and top of the line first person shooter action i would highly recommend this game.not only does this game have a better story then the last of us it also has better graphics then any next gen games out on the market.them feelings are real this game will make you cry your eyes out... i know i did... i filled a whole soup pot with tears from the heart warming story.If u get this game add me on steam so we can play the multiplayer lol..................  Ratings Gameplay 10/10 story 10/10 graphics 10/10 dem feels 10/10 voice acting 10/10 audio 20/10   ",
            "review_score": "1"
        },
        {
            "review_text": "i dont understand what should i do in this game... i got it free on GiveAway...Well its worth (highest) 1$...Thats my thinking :)",
            "review_score": "1"
        },
        {
            "review_text": "'It's like Skyrim but with traders in space'  -IGN",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would Ethnic Cleanse",
            "review_score": "1"
        },
        {
            "review_text": "I can trade stuff in space. Doesn't get better.  10 Space/25 Lightyear g8 game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game for a low price, definitely worth it",
            "review_score": "1"
        },
        {
            "review_text": "Friend made me buy it.  10/10  In all seriousness, it's a great game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would trade for Bananabis again.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how or why, but I actually like this game even though it's kinda crap. Is it worth $0.50 on sale? Maybe not for everyone. If you like crappy trading games it might be worth it.",
            "review_score": "1"
        },
        {
            "review_text": "★ ★ ☆ ☆ ☆",
            "review_score": "1"
        },
        {
            "review_text": "This game is probably the best one on my list. I rarely play it though, because I don't want to wear it out. The gameplay is timeless, the voice acting flawless and the graphics represent the state of the art.  The story has me on the edge of my seat everytime I play.  I think GameFocus got their numbers mixed up, because this game is definitely worth of 98%, not 89% as they have given it.  Must buy.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot say why I like this game, but, I like this game, though I am not too fond of the FPS aspect or the inability to save progress adequately. I have had to re-start hour-plus segments of gameplay due to the aforementioned; thankfully, the game is strangely fun, and so I did not mind it. Would love to see some tweaks to make it an easier game to pop in and out of...  Verdict: [ 6 / 10 ]",
            "review_score": "1"
        },
        {
            "review_text": "I personally enjoyed this game throughly. Has 'in' references to popular games, sucha as when one robot quotes the Slylandro Probes from Star Control 2. There are lots of things to do and it is fairly easy to beat. Sure, it is better suited to the casual gamer, but it is cheap and fun.",
            "review_score": "1"
        },
        {
            "review_text": "I had a lot of fun playing this game. It has a simple core mechanic: buy goods at your current location, pick another location to travel to and sell your goods there then buy new ones - repeat. It has a secondary mode as a FPS that can largely be ignored if you don't like it. As a fan of merchant/empire games and FPS games this was great for me. They even have a plot and side missions voiced by a hilariously small cast of actors obviously altering their voice to be different people.  Would have liked it to be longer and would definitely buy a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game in the Action indie pack. buying and selling mixed with fps action 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Trading Simulator......Sheeeet",
            "review_score": "1"
        },
        {
            "review_text": "Worth.    $0.50!",
            "review_score": "1"
        },
        {
            "review_text": "I bought it on the cheap for 50cents and it seems like a good deal sofar. Though because of this game I'm probably gonna start playing the X series again to get that visceral space combat feel back. I Like the fps part even though it is a bit barebones and small. Wish more games would mix the genres in a single game to give the complete feel of a proper space sim. FIGHT / EXPLORE / TRADE / BUILD / AND DO ALL IN SHIP OR ON FOOT FPS. This game only does a small part of that so the price fits the game.....anymore $$ and I couldn't really see getting it. Not a recommendation, but since steam only lets me say yes or no....I would say 'try' only if you like a barebone space trade/fps fight sim for a cheap price.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it for 30 Cents - for that price its a pretty decent game. It has some nice trading with optional, but quite necessary shooting sequences. The shooting feels unresponsive, but its just a small part of the game. The graphics are acceptable, as you cant expect a triple A graphic for this little money.  8/10 Gameplay 4/10 Graphics 7/10 Price/Perfomance (If you buy it in sale - i wouldnt pay 5€ for it!)",
            "review_score": "1"
        },
        {
            "review_text": "little fun stock market game, whit a space twist, recommended for all of those who like this kind of stuff, even tho its a little old and graphics are almost poligons, still enjoyable (extra note, the game CAN'T be played on window mode, gotta go Full screen for the click to work correctly, also, controll default arrange is weird, need to reconfigure it to play, but those are user fixable problems that will be one time only/5 min consuming)",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. If you love violent/monster games forget it. Slow paced. Who cares about graphics. If you are a kid and calling people chicks and dudes this is the wrong game for you. Some violence with no blood and easier than most shoot 'em up games. Basically a laid back game with story lines based on trading plus one story line with several chapters. Achievements but most are easy to get.",
            "review_score": "1"
        },
        {
            "review_text": "If you just want something to kill time then its an ok game, very basic FPS scenarios that you can do when collecting bounties and such in missions and basic buy cheap/sell for a profit system...the only downside to this game is there is not a sandbox mode...which ends up making the game dull and redundant when you have to start from scratch every time you complete a mission.  Def not worth the full price...worth the 49 cents I paid for it while on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "I only played 6 minutes of this crap and already I knew I'd hate it. I'm by no means a graphics ♥♥♥♥♥ but this hurt my eyes just looking at it. I want my 50 cents back.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting concept for a game, but was unplayable on a mid-to-high level machine which has specs way above the recommended. Graphics were choppy even for an older title. Not worth the price, even on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "| 4.5 out of 10 |   For the whole game , you'll spend your time move around 9 different maps ( very small ) , hunt down criminals whose look alike (even some of them have the same last name) to become a master trader.  I do not recommend STrader:2M if you are not into bussiness nor strategy.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible. Just... ugh,  This game looks, and at times plays, like Sonic Adventure, a game originally released for the Dreamcast in 1998. This game was released in 2008. Take Sonic Adventure, remove all charm, combine it with the crappest of Doom clones, and then set it on fire, and you'll still have a better game than this.  Full price is £3.49, I think I bought it for maybe half of that, and I still paid too much. Steam should expect my bill in the post. Ugh.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is old and it shows. Very opened game with ground combat, no space combat. I could not get into it because the graphics, physics, and combat were too dated for my liking. The game takes the normal buy here and sell there will a sprinkling of shooting people in the face.   You might enjoy this game if: Like old, and I do mean old, shooters paired with trading. ",
            "review_score": "-1"
        },
        {
            "review_text": "A poor resource trading game with awful FPS missions.   Pros:  + You pick and choose which way to do some missions  + some of the characters are quite interesting.   Negatives: - everything else - the FPS sections are absolutely awful, non-skippable and punishingly hard. - 90% of sidequests are fetch quests,   I continued playing after the first level as it felt as if it was building into something quite enjoyable, but it didn't...",
            "review_score": "-1"
        },
        {
            "review_text": "Well game would crash every time I tried getting past the starting menu with a 'can't use values or keys with 'a' '........and I didn't do anything. Someone else had this problem and they couldn't find a fix. Apparently judging from the rest of the reviews I didn't miss much, as this 2008 budget trading shooter has poor trading and worse shooting, leading to an overall boring and repetitive game. So I guess it was a blessing in disguise. 0/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Its Just Not That Fun At All",
            "review_score": "-1"
        },
        {
            "review_text": "If this was a game on a BBS during dial up days... I would have liked it. I got it for less than a dollar. I should have tossed that dollar towards a homeless man.",
            "review_score": "-1"
        },
        {
            "review_text": "Clunky graphics, controls, plot, and mechanics. I don't think there is one redeeming factor about this game except the limited number of offerings in the 'space trading' genre",
            "review_score": "-1"
        },
        {
            "review_text": "I hoped this was good but it isn't The FPS part is complete ♥♥♥♥, and so simple you could even win without trying The merchant part is retardly simple and not fun",
            "review_score": "-1"
        },
        {
            "review_text": "LITERALLY ONE OF THE WORST GAMES IVE EVER PLAYED AVOID IT LIKE THE PLAGUE",
            "review_score": "-1"
        },
        {
            "review_text": "Well... not my cup of tea.",
            "review_score": "-1"
        },
        {
            "review_text": "Disappointed.  + 1st person view  - very little exploration due to small world unsatisfying commodity trading section sub par shooter sections old looking graphics basic animations repetitive since you start from scratch on each mission no sandbox/open ended game mode",
            "review_score": "-1"
        },
        {
            "review_text": "Why do I even have this? I have no ♥♥♥♥ing idea, don't buy it, there is no reason to buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "Good concept ruined by implementation.  Buggy, can't progress. Nicht gutt.",
            "review_score": "-1"
        },
        {
            "review_text": "Oof, has not aged well. Fun, but buggy and doesn't perform well enough to be enjoyed past it's glaring flaws. I wish it was better, as it's premise is airtight and fun-sounding.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolute ♥♥♥♥♥♥♥t. Seriously. Dont buy it.  Fails as any sort of trading simulation, has combat that has less depth than the first DOOM game. The majority of the game is spent staring at lists of buy/sell prices, or the litirally 5 minutes worth of 'content' that you can see by walking your avatar round the worlds least-interesting and empty spacestation.   Avoid. At all costs.",
            "review_score": "-1"
        },
        {
            "review_text": "although i play this game and enjoy it beacause its vintage i dont recomend to buy it  cons *small enviorments *save-load doesnt exist (only autosaving which is useless) *if you lose you must repeat the whole chapter *bounty missions take place only in 2 diffrent place's *Every chapter is timed and the timmer goes down with every travel (planet,bounty hunting,mission teleporting) *The whole game is buy sell... nothing more  *around 2-3 options when you speaking whith a NPC  *i plays on a small window and you cant play it in full screen (belive me its really tiring for your eyes) *graphics are bad for a game of 2008 it is more like game from 80s (goldfinger was far better than this and it was a game that realished 1986...) *In every travel a stupid android pop up and say NOT GREAT AAAAAAAAAHHHHHHHHHHHHHHH   I dont recomend you to buy it,i think its really not worth the money even if its in 4 euros if you going to buy it dont waste more than half of its price",
            "review_score": "-1"
        },
        {
            "review_text": "1993!  This game is just not my kind of game, it is very boring and the graphics are a disaster! It feels like it's made in the 90's. I don't know why steam includes this game in their store?! It takes a long time to get into the game and i'd rather put some time into trading up my items from Counter-Strike: Global Offensive than trading space merch with bots.  I however think this is a great game for the people who wants to play retro games and have a lot of time.",
            "review_score": "-1"
        }
    ]
}