{
    "app_id": 11280,
    "name": "Penguins Arena: Sedna's World",
    "release_date": "2008-12-18",
    "developer": [
        "Frogames"
    ],
    "publisher": [
        "Frogames"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Casual",
        "Indie"
    ],
    "achievements": 10,
    "positive_ratings": 902,
    "negative_ratings": 129,
    "price": 4.79,
    "description": "Penguins Arena is a thrilling and innovative First Penguin Shooter with quick, hectic rounds and where the magic of reincarnation, combined with the supernatural ability to return to the game as a ghost, ensures that your character has every chance to change your tribe's fate, even in the afterlife.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/11280/header.jpg?t=1478073822",
    "minimum_requirements": "Operating System: Windows Vista/XP                     Processor: 1 GHz Processor                      Memory: 256 MB RAM                     DirectX version: DirectX 9.0c or higher                      Graphics: DirectX compatible 32 MB graphics card                      Sound: DirectX compatible sound card                     Hard Disk Space: 50 MB Hard Drive Space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "THIS IS THE ONLY REASON WHY YOU WOULD PURCHASE THIS INDIE PACK FORGET ABOUT YOUR 'SKILL' IN TRIBES AIRSHOTS, COD 360 NOSCOPES AND TF2 ROCKETJUMPING AND TRY TO AIRSHOT A PENGUIN WITH A SNOWBALL 2 TIMES IN A ROW WHILE AIRSTRAFING TO STAY ALIVE AND NOT GET EATEN BY A SHARK YOURSELF AND TRYING NOT TO HIT YOUR TEAMMATES  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's like skyrim with penguins",
            "review_score": "1"
        },
        {
            "review_text": "Club Penguin: Advanced Warfare",
            "review_score": "1"
        },
        {
            "review_text": "i actually found this game fun, not something i would play often but its a guilty pleasure for me.  10/10 its like fallout 3 but with penguins",
            "review_score": "1"
        },
        {
            "review_text": "For only $6, you can have an epic snowball fight on an iceberg with penguins. Do I need to say more?  Pros:  -Wonderful penguin models  -Wonderful gameplay -Wonderful animation -Wonderful environment  Cons:  -Its too awesome ",
            "review_score": "1"
        },
        {
            "review_text": "A First Person Shooter where the characters are in fact penguins and you shoot snowballs. Penguins Arena starts from an original idea and delivers an appreciable little game. It's something you should consider buying during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "At first when I played this, I was a bit worried that I had wasted my money.  I WAS HORRIBLY MISTAKEN. This game is a GREAT game for when you are bored, or just looking for A COMPLETELY AMAZING TIME. I would highly reccommend this to anyone out there looking to play the next game of the year 2016.  Great concept, great controls, I WANT MORE!",
            "review_score": "1"
        },
        {
            "review_text": "It's like Super Smash Bros Dodgeball",
            "review_score": "1"
        },
        {
            "review_text": "Games are meant to have fun, and what did I get from this game!? Fun, I got fun, not instantly though. I played this game for a good 1 hour and I immediately regretted it, so in order to redeem my gaming fun. I decided to play Call of Duty, the all superior game that beats everything, so I was playing then I realised every kill I was getting was a 360 no-scope cross map with no hitmarkers at all. Then  I realised that this game taught me how to be Faze in almost every fps game I've ever played. Now though, it's even  affected my life, whenever I pick up food from my cafeteria at school, I have to do a 360 which spills my food all the time. It's uncontrollable, I can't sleep without 360-ing continuosly in my bed. This game ruined me. I can't hug friends/family. Noone loves me anymore. I can't pay attention to school. I can't love.  Otherwise it's a great game  10/10 - Faze SpongeCake",
            "review_score": "1"
        },
        {
            "review_text": "Wish it could be better. A fun,well made game,but due to some non implemented features,it could be just better. Still,its a good one to try out.",
            "review_score": "1"
        },
        {
            "review_text": "What else can you say about this ground breaking game better then any other shooter that ive played even check my hours. Truley the Qauke smash experience  2 good worth the pruchase",
            "review_score": "1"
        },
        {
            "review_text": "best 8 minutes of my life",
            "review_score": "1"
        },
        {
            "review_text": "good decent game but im not recieving my trading cards",
            "review_score": "1"
        },
        {
            "review_text": "Was looking for a well-made, action packed fps to play for hours on end and still never get bored.      then I said f*ck it and bought this instead.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 #Gameoftheyear2014 just go ahead and buy it you wont regret it! (much)",
            "review_score": "1"
        },
        {
            "review_text": "Great game, if you are a RIC FAZERES fan!",
            "review_score": "1"
        },
        {
            "review_text": "Forget all your skill in every other game, this is the real deal.  Intense action packed snowball throwing, yellow snow free.   Airshotting a penguin will now replace every trick shot you've ever imagined yourself making. This intense action AAA title will blow your socks off",
            "review_score": "1"
        },
        {
            "review_text": "Want a true Smash Bros and not this Brawl crap? Play Penguins Arena. The game is fast-paced and actually has gameplay with some depth in it. You can combo kicks and throw projectiles that affects how much you push your foes. This is a true PC gaming experience and remembers the basics such as lan-based multiplayer and windowed support. Taking advantage of PC Hardware, offers a true HD 60fps experience, something consoles wont give you. If you are a true pc gamer, or gamer in general, and this game doesnt have 500 hours of playtime on your account, you are a terrible person and should be ashamed of yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like penguins? Liar. Everybody likes penguins.  P.S. I also once found 2 servers playing this game simultaneously. I think it's a world record.  P.P.S Got it for free, anyway.",
            "review_score": "1"
        },
        {
            "review_text": "penguin arena inspired me to have a penguin fighting ring that is valued at $50,000 thank you penguin arena",
            "review_score": "1"
        },
        {
            "review_text": "10/10 best game 2012, 13, and 14",
            "review_score": "1"
        },
        {
            "review_text": "Its actually an amazing game! The advert and picture does not do it justice, i was sceptical about buying it, but as it was on offer for £1.09 i though 'why not'! So i got it, played it, and i can tell you somthing: i am on the edge of my seat when i play it! Its great fun, just need some better multiplayer servers now, but im sue that will kick off when more people play! Definatley get this game!",
            "review_score": "1"
        },
        {
            "review_text": "Its actually an amazing game! The advert and picture does not do it justice, i was sceptical about buying it, but as it was on offer for £1.09 i though 'why not'! So i got it, played it, and i can tell you somthing: i am on the edge of my seat when i play it! Its great fun, just need some better multiplayer servers now, but im sue that will kick off when more people play! Definatley get this game!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game too far back to remember, and just left it sitting in my library, untouched. I started it up earlier to let it run in the background to get the cards, but thought 'What the heck, name sounds interesting, I'll play it for a minute.'   This game is extremely underrated! Seriously, if you're browsing the reviews and don't know whether to buy this game or not.... BUY IT! Seriously, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "This game supports animal abuse, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Ees good gam. has dank pingu memes, is cool, n its accually pretty good. it doesn't really look like an accual game, but it is. buy it. i think. get it on sale. ye. do that.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, theres so much skill needed. You have to try and knock each other a ice berg while not trying to die yourself. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game changed my life. Let me explain. I was playing my call of dutys modem warface 4 and I see in the bottom corner \\'♥♥♥♥♥♥82 has started playing Penguins Arena: Sedna\\'s World\\' my ♥♥♥♥♥♥♥♥ screamed to me but after that insane game of cal off dooty it was to tight. I find my wallet in the steam sale safe (that\\'s so gabeN does not eat it) I take the needed amount of money out and insert it in to my steam machine.i relax. But then my ♥♥♥♥♥♥♥♥ becomes unclenched and screams \\'NOOO WHAT HAVE YOU DONE YOU ♥♥♥♥ING GAY\\' sadly it was to late I was already installing it. That was the pizza money oh no what have I done. The game... the game it it it will consume you. 10/10 better than cunter stroke",
            "review_score": "1"
        },
        {
            "review_text": "Meh. Only buy it on sale. I wouldn't put it as a priority either.",
            "review_score": "1"
        },
        {
            "review_text": "please make this game cheap again my friend needs it",
            "review_score": "1"
        },
        {
            "review_text": "This game its awesome",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best multiplayer FPS game on steam to date! pure adrenaline!",
            "review_score": "1"
        },
        {
            "review_text": "GAME OF THE YEAR ALL THE YEARS. MUST HAVE FOR EVERYONE. IT'S LIKE TRIBES BUT WITH AWESOME PENGUINS SO IT'S LIKE 20045 TIMES BETTER.",
            "review_score": "1"
        },
        {
            "review_text": "This, is the end, the only end.  The ground was melting, the food getting scarce , the war erupted. But with our food so reduced who were the ones who had the idea to use fishes as weapons? Was it a warrior from the stern Pinks or a fisher from the dumb Yellows ? Who started to lure the children with booby trapped fishes ? The angry Greens? All these weeks after, I still don't know . All I know is that it was us, the noble Blues who scorched the land with mines stolen to the humans.   All these fights, all this war, the endless labour, the running, the sliding, the teeth in the water, the brief moments of elation: soaring into the air , flying even, just to descend as the flipper of Sedna to angrily push our ennemies off the ground, to push them in the water, to the teeth waiting in the water.   The Blue became the avatars of death, fighting all the other tribes in the ambient chaos of mutual assassinations but in the end we prevailed. Like Sedna said, there could be only one tribe of penguins.  Now, only the Blues. The ground is melting still. The food is scarce again. The teeth in the water. The teeth, in the water.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, awesome, fabulous dodgeball game. Very addictive and lots of fun! The best thing I have played in a while. I never had my hopes up for anything and went in blind then was delightfully suprised to see what kind of game it was. Shame it's badly translated from French though and that you can't choose a team. But this is a great casual thing to play when you just need cheering up or some quick fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of ps1 era games, on good way. I'ts actually very fun game, but gets dull very quickly if you play it alone, that goes for gameplay and for music (which seems to be a bit surferish). This game would be even better if it had better physics. Don't be afraid to try this game, but be cautious - playing this game solo is boring!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best ♥♥♥♥♥ you'll ever play.   Graphics: Not that bad, seems like a game from the fawking mid '00s, but who cares? Saying COD has better graphics than this masterpiece is seriously debatable.  Gameplay: Awesome! Tired of those fake FPS games like Battlefield, Medal of Honor and Call of Duty? I'm sure this is the game for you. Droppin' bombs on innocent penguins all day every day. Conclusion: Although the game has its flaws, it's a must buy. Greatest game I ever played.  4/20. Would seriously consider smoking this.",
            "review_score": "1"
        },
        {
            "review_text": "  Somehow this game can be very funny...",
            "review_score": "1"
        },
        {
            "review_text": "Good game, and it get better playing multi-player, but theres the problem, the community its dead. 84/10",
            "review_score": "1"
        },
        {
            "review_text": "GAME OF THE YEAR ALL THE YEARS. MUST HAVE FOR EVERYONE. IT'S LIKE TRIBES BUT WITH AWESOME PENGUINS SO IT'S LIKE 20045 TIMES BETTER.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game of the pack! Worth!",
            "review_score": "1"
        },
        {
            "review_text": "Hi Im Steve Love me like I love this game",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite childhood games,only buy it if you wanna play with friends,otherwise you will get bored really fast because there aren't any servers online,only hosted by players.",
            "review_score": "1"
        },
        {
            "review_text": "best game on steam",
            "review_score": "1"
        },
        {
            "review_text": "It is a snowball fight.  I really can't say NO, but I would not buy this game again.  I snagged it when I first got on Steam a very long time ago, and it is not a bad or broken game, I am sure a lot of love went into it.  It is just a basic arena game, much like Fur Fighters multiplayer battles IMO  If you do not mind that it is an outdated feel and a rather short and small game, it might be worth your money.  I hate to give a thumbs down based on my opinions over the game being broken, so I am still giving it a thums up.  I am sure some niche will enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "how is this in my library?",
            "review_score": "1"
        },
        {
            "review_text": "best game on steam ",
            "review_score": "1"
        },
        {
            "review_text": "Good game, and it get better playing multi-player, but theres the problem, the community its dead. 84/10",
            "review_score": "1"
        },
        {
            "review_text": "This game helped me heal my depression, tuberculosis, HPV and syphilis.",
            "review_score": "1"
        },
        {
            "review_text": "A cute game, where you must protect your penguin 'tribe' by pushing all the other tribe members off an iceberg (global warming, people!)  Interesting concept, fast gamplay which involves hurling bombs, fish and snowballs at the opposing penguins.  Since Steam requires you to say yes or no, I'm afraid I'll have to give it a no (even with the pitiful amount of time I've spent on this). The reason being - as can be seen from other reviews - the multiplayer is a barren wasteland. The AI isn't much fun, and doesn't look like anyone is playing this anymore...  I picked it up for free, but wouldn't recommened unless it sees a massive surge in popularity.",
            "review_score": "-1"
        },
        {
            "review_text": "Wtf is wrong with this game ?",
            "review_score": "-1"
        },
        {
            "review_text": "Maps are poorly designed and hitboxes are nearly nonexistant. You can always buy it as a joke, but that's the only fun you'll probably get out of it.",
            "review_score": "-1"
        },
        {
            "review_text": "Why am i writing this.",
            "review_score": "-1"
        },
        {
            "review_text": "It is... alright, y'know those old Shockwave games you might have played, back in the day? This isn't Shockwave, but it feels very much like one of them. Except a lot better. That should give you a fair idea.  If you're a kiddo who doesn't remember those olden days, then let's just say it's about on par with a Flash game.    But it's also ridiculously priced, so don't get it.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh man... This game is so bad, I guess most of the positive reviews are fakes or trolls. First game, game crashed. Second game, I spawned 'dead' so I couldn't do anything but watch. Third game I finally got to play, and it sucked. There was 2 people in whole world playing this game same time as I, and it only has multiplayer, so it's worthless... Stay away!",
            "review_score": "-1"
        },
        {
            "review_text": "is a dead multiplayer only game (4 player peek a day). It has some value in fighting against bot on online server",
            "review_score": "-1"
        }
    ]
}