{
    "app_id": 11340,
    "name": "Larva Mortus",
    "release_date": "2009-03-19",
    "developer": [
        "Meridian4"
    ],
    "publisher": [
        "Meridian4"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Top-Down"
    ],
    "achievements": 25,
    "positive_ratings": 523,
    "negative_ratings": 161,
    "price": 3.99,
    "description": "Larva Mortus is a fast-paced action horror game that has you hunting monsters of the supernatural in a dark and ominous atmosphere full of undead, terrifying and demonic nightmares.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/11340/header.jpg?t=1516645482",
    "minimum_requirements": "OS: Windows XP/Vista                     Processor: 1.5 GHz Processor                     Memory: 256 MB RAM                     Graphics: DirectX compatible 128MB graphics card                     DirectX®: 9.0c                     Hard Drive: 55 MB of available hard disk space                     Sound: DirectX compatible audio card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a top down retro shooter. Each level is randomly generated, and you must clear every bad guy in the room before progressing. If you die, you start the level again on a new completely random map. I normally would find it annoying starting all over again, but this mechanic stops you from just running trial and error to eventually get through.  You get a pretty standard set of guns, twin pistols, shotgun etc, all of which can be upgraded.   I ran into no bugs and the games run very well on new operating systems.  The price is right and the game play is good. If you like the horror genre, and love the arcade games from the past, then you will get plenty of enjoyment out of Larva Mortus",
            "review_score": "1"
        },
        {
            "review_text": "This game lacks any remarkable quality that justifies buying it, even on a sale. It's basically a twin stick shooter (without controller support) where the player scuffles through randomized (but persistently unstimulating) dungeons, fending off flocks of uninspired enemies to tediously grind through a few repetitive mission objectives, all tied together by the most perfunctory of stories.  The game's design and visuals transpire blandness. Enemy variety consists of the trite assortment of bats, spiders, skeletons, zombies, werewolves and respective supersized variants. Moreover the monsters are afflicted by extremely constrained behaviour types, limited to either rushing the player, casually flying around or throwing the odd missile. This cognitive impairment makes the enemies prone to getting stuck behind objects and frequently kamikaze into the environmental traps, and the only challenge comes from the occasional overwhelming numbers of enemies.  Due merits for the low hardware requirements, which allow to run it in a modest 5 year old computer, but when the game looks over 10 years old that's hardly a redeeming feature.   This is an inexpensive game that nevertheless feels too cheaply made for its price, and I can't find any reason to recommend playing it even if it finds its way into your steam account after a bundle sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool game, worth buying it! :)",
            "review_score": "1"
        },
        {
            "review_text": "I would say this game is a hidden gold nugget, not a gem, but a nugget. Its a fun top down twin stick shooter that often makes me think that SAS Zombie assult and Rouge Legacy (vaguely) had a secret affair and this was their offspring the that they hid well. As weird as that last sentence was this is a really good game. Although there is short commings that are budget and story realted it doesn't take too much away from the overall game. It keeps me coming back and I can quickly load it up for a quick five minute game or spend a chunk of time just having a ton of fun. I'm not sure if it gets repetative yet but if you can get this game for a good price it is very fun and worth it. I bought the action Indie pack for $1.49 not expecting much but was joyfully suprised to find this hidden, unapperciatied game. Also I thought I might as well bring this up but it can be occationally be scary, not enough to send the weak hearted away but enough to be creepy. The creepy music, the horrific groans and screeches given off by some monsters, the glowing red eyes in the darkness every now and then, there is also disturbing faces that show up on the screen every now and then. Not fast enough to qualify as a jump scare but they get me (or at least gives me an usettling feeling) every time.",
            "review_score": "1"
        },
        {
            "review_text": "An old but not superannuated adage is applicably germane. Don't judge a book by it's cover. Presented in glorious 1024x768, Larva Mortus is a pleasing overhead arena shooter with an RPG component and weapon and item drops to facilitate your pilgrimage through the ho hum narrative. A more than decent arsenal compliments the massacre of an array of imaginative aberrations under an umbrella of vampiresque themed music. More than meets the eye and worth a play through if your taste encompasses arena shooters.",
            "review_score": "1"
        },
        {
            "review_text": "Larva Mortus is dumb as hell. Larva Mortus has a name that is dumb as hell. Larva Mortus is a 'twin stick' shooter. Larva Mortus is filled with zombies.  However. HOWEVER. Larva Mortus is better than Destiny.",
            "review_score": "1"
        },
        {
            "review_text": "A cheap little roguelike game to pass some whiles. Has defects of design as can see them quickly, but it fun for a few times; if you search quality or long campaigns, there are other options.",
            "review_score": "1"
        },
        {
            "review_text": "A cheap little roguelike game to pass some whiles. Has defects of design as can see them quickly, but it fun for a few times; if you search quality or long campaigns, there are other options.",
            "review_score": "1"
        },
        {
            "review_text": "Just love this game :D",
            "review_score": "1"
        },
        {
            "review_text": "Unless you're one of those players who always plays with the default controls, do not get this game.  There is no support for key bindings. Not reccomended because of lazy development.",
            "review_score": "-1"
        },
        {
            "review_text": "The story was well writen and filled with great plot twists, on of the Best FPS games ever made 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Oh boy, another top-down zombie slaying massacre, snore.",
            "review_score": "-1"
        },
        {
            "review_text": "MUST NOT BUY, this game is probably one of the ♥♥♥♥♥iest one I've ever played, seriously pass on it...",
            "review_score": "-1"
        },
        {
            "review_text": "This is an amazing, and fun game. Randomly generated dungeons add challenge to it, and its very nice. I haven't expiercend any bugs yet, so that's good. 8.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Little good indie game for some time burning 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Great indie game! A lot of action connected with simple game principles.",
            "review_score": "1"
        },
        {
            "review_text": "Is a cool obscure fun overhead action game. Although what you do in the first 15 minutes is exactly what you do until the end of the game so it is extremely repetative. But hey, you blast the fk out of tons of zombies and monsters and it can be challenging so it is worth a go for some mindless fun. A lot of the enemies can shoot at you, and since your main goal will basically be to take as little dmg as possible, you will be constantly circling enemies and shooting them to avoid projectiles, so stay on the move. Use melee when possible to conserve ammo. It can get really hard because you take a lot of dmg with each hit and some boss fights are hard as fk because your guy is a pu--y and dies in only a few hits. All the weapons are about the exact same weapon lineup you would find in Quake 3, including the lightning gun, and also a flamethrower and dynamite. If you want to change the game's res you have to change it in the windows appdata folder. Search the games forum for tips on this including my addition to the post with information on how to do it if you have Windows 8.1.  Game is 7/10, fun but extremely repetative.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard coded to 1024x768 which means this engine is extremely incomeplete",
            "review_score": "-1"
        },
        {
            "review_text": "is veri good yes, played 5,89 houz and i liek it",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really good game to play on our laptop if you don't have internet connection :) I got really suprised when there was so many guns to get, Although the graphics isn't the best but the game are pritty fun to play if you are bored and have nothing to do xD",
            "review_score": "1"
        },
        {
            "review_text": "Larva Mortus Mask dead in Latin which is what I think they are going for because there certainly weren't any larvae in the game. Name aside, you are a priest (I think) with various weapons against hordes of monsters. The view is third person overhead, and you use WASD to move and can shoot/aim with the mouse. As you kill monsters you'll occasionally find buffs to damage/armor/speed and level up which allows you to improve speed/life/regen/item drop rates/debuff length/etc. Leveling doesn't really increase damage though so its not very useful once you get near the end of the game since monsters start to be able to one shot you.  The Good: Initially fun to play, good challenge and has nice art in the cut scenes.  The Bad: The game drags on quite a bit, especially if you are going for achievements. There is not enough variety in monsters weapons or tactics to keep you interested, since most monsters can be defeated by strafing around them, and the ones that can't slow you and one shot you. The bosses have so much life that it can become quite boring rotating around and around them.  Takeaway: Not the worst game ever, but it might start to seem like a chore later on.  The Achievements: You don't need to beat the game to 100% it oddly, but beating the game is actually easier. On any mission, some rooms can spawn one of 25 rare items, or ammo or a key. The problem is that getting one of the rare items doesn't take it out of the pool so getting that last one can be very frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "Monster shooter which is viewed from the top.  Also contains randomly popping 'scaryfaces'. And organ music. And RPG elements.",
            "review_score": "1"
        },
        {
            "review_text": "The game lacks visual polish; it's kinda rough on the eyes and looks dated, but the gameplay is sound. It has a 'Smash TV' vibe to it set in the early 20th century. The gameplay isn't something that's ground breaking or changing the plane of this game genre, but it'll give you your money's worth. Fun game, worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "It's your avarage top-down shoot'em up.  You can find better versions of this kind of game for free.   You'll get tired of it in a half hour.",
            "review_score": "-1"
        },
        {
            "review_text": "Binding of Isaac + Hotline Miami + Nosferatu wrath of malachi = Larva Mortus  LARVA MORTUS with a title like that you cant go wrong. Fast paced action combined with creepiness. Perfectly captures the best pros of games I listed above  Binding of Isaac - Level desing Hotline Miami - gameplay Nosferatu - mood and universe, also oldfashioned weapons ;)  Also It has one of the best soundtracks ever. Its almost even better then the game! Im speechless about the music, just listen to it yourself  But the game doesnt cost much right? what are the cons, you may ask - Sound effect of the sword makes me want to puke (its just unfitting and annoying, especialy if you like fighting with sword) - Why does everything explode? It sure is cool n stuff, but... I hit a crate with a sword BOOM... dafak is wrong...  ",
            "review_score": "1"
        },
        {
            "review_text": "A simple top-down adventure game where you go around, collect weapons, defeat monsters and complete an equally simple plot.  The game scales passably, with more difficult monsters appearing as you reach higher levels, but the in-game difficulty rater is terrible, ranking simpler missions like 'locate survivors' where you have to find survivors lost in monster-filled buildings, as more difficult than 'defeat monster champions' where you must defeat powered-up versions of normal monsters, often multiple at a time.",
            "review_score": "1"
        },
        {
            "review_text": "Actually a fun game. Smash Bros type gameplay where you move with WADS and aim and shoot around you with the mouse. The stroy line keeps you interested, however gameplay does get a bit repetative. You will sometimes find yourself 'grinding' out to reach the next level. All in all though a good game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty decent game good for a day or two. It's very challanging, the weapons are good, the story is decent, and its a good third person shooter. For 50 cents I'd say I easily got my moneys worth out of this. Meredian 4 is good at producing short games that are really good for a tiny amount of money and thats why I like it. If you can enjoy these kinds of games, then definitely get this the next time its 50 cents to a buck.",
            "review_score": "1"
        },
        {
            "review_text": "For a low price game, I wasn't expecting much. But, I have to say that what I got out of it was an enjoyable 'Window game', something that you can watch a movie or tv show while playing. 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "I ended up getting this game for less than a dollar via a coupon from crafting cards. I figured, 'Heck, I got a bit left on my wallet, why not?'  Simple, yet fun. It has that nice arcadey game feel to it, without all the crying to mom for 'just one more quarter.'   Might as well get it if it's on sale. It's fun enough if you're bored.",
            "review_score": "1"
        },
        {
            "review_text": "If like the early Zealda games, and binding of Issac, you might want to give this game a shot.  The levels, and graphics are much better than Issac, and the story is really compelling.  The random generated games is a major plus.  Reccommend using xpadder, or some sort of controller emulator, it makes a really good twin stick shooter.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty similar to Dracula Undead Awakening (PSP game) both in terms of gameplay and of lore (killing vampires and evil creatures), difference is; this is not a survival game, you have an objective. Both are actually pretty good games despised the lack of content but this one would win for the simple reason that it is not survival only unlike Dracula Undead Awakening which is a survival only game, no objectives. Some great additions would be a level editor, more sort of levels (outside, snow, Hell, etc etc), random generated levels, more weapons, more enemies and more different objectives. If it had all that, I'd probably give it 8.5/10 but since it is not the case, in my humble opinion, this game deserves 7.5/10",
            "review_score": "1"
        }
    ]
}