{
    "app_id": 11480,
    "name": "Soldiers: Heroes of World War II",
    "release_date": "2014-07-03",
    "developer": [
        "Best Way"
    ],
    "publisher": [
        "1C Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "World War II",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 273,
    "negative_ratings": 61,
    "price": 3.99,
    "description": "The player can take control of American, British, Russian, or German forces to play out battles that are set in World War II. The game is primarily a strategy game, but the player can take control of his or her forces and direct them with the keyboard and mouse for additional depth of control.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/11480/header.jpg?t=1553175528",
    "minimum_requirements": "Supported OS: A 100% Windows 2000/XP-compatible computer system (only)                     Processor: Pentium III or Athlon 1GHz                     Memory: 256Mb RAM                     Graphics: Supported 32Mb Graphics Card                     DirectX Version: DirectX 9.0b                      Sound: DirectX 9.0b Compatible Sound Card                      Hard Drive: 2GB Hard Disk Space",
    "recommended_requirements": "Supported OS: A 100% Windows 2000/XP-compatible computer system (only)                     Processor: Pentium 4 2Ghz or AthlonXP 2000+ and above                     Memory: 512Mb RAM                     Graphics: Radeon 9xxx and above, nVidia FX and above                     DirectX Version: DirectX 9.0b                      Sound: DirectX 9.0b Compatible Sound Card                      Hard Drive: 2GB Hard Disk Space                      Recommended Specification Cards: ATi Radeon 8xxx, 9000, 9100, 9200, 9500, 9600, 9700, 9800 nVidia nForce 1 &amp; 2, GeForce 2, GeForce 3, GeForce 4, GeForce FX 5200, 5600, 5700, 5800, 5900, 5950 Not compatible with all integrated sound/graphics solutions including laptops     In order to play the game on modern operating systems, it has to be run in Compatibility Mode (Windows XP SP3).",
    "reviews": [
        {
            "review_text": "I played this game many years ago when it first came out. So I bought it on Steam to to preserve until the end of time...  This game is absolutely fantastic! This is a RTS game but basically you take control mostly 4-5 soldiers per missions. So it is commando like and more tactic than gathering resources and build build and train troops... You always have to focus on the mission objective and you can solve any way you want to get the job done. Maybe this sentence as an example will be a bit spoiler so I warned you: the mission is to destroy 2 battery guns, you have 4 soldiers against lot of enemies, you can easily sneak to the first battery gun and instead you blow it you can use to take out the other gun on the other side of the map rather fight your way through the enemy... then just blow the first one and get out.  Spoiler ends.  If you start with only handguns, kill a few enemy and take their weapons. There are 4 campaigns, each with 4-5 missions. If you preserve your troops from the beginnig, you can use the same troops on the following maps with the same inventory. Note however, the American campaign a bit different.. and if anytime you screw the map and have to restart a mission you loose your own man and will get default troops. So keep saves on different slots.  You can destroy anything if you have the correct weapon in your hand or under your a+s+s... Oh, you dont have tank, kill its crew then repair and use it. Your tank have run out of ammo, neutralize another one (dont blow it) and take its ammunation. You dont have AT weapons but there are strong vehicles in your way? hmm.. you have molotov cocktail! Aim at the engines and watch the firework! Use covers all the time, lean from edges or just lure the enemy out from a field with lighting fire. Are you surrounded with enemy troops, blow a hole in the wall and escape. There are 50+ enemy heavy tanks, you have katyusha......  Do you like write history again? Then you are a Hero of World War 2.",
            "review_score": "1"
        },
        {
            "review_text": "I now understand very well why tanks tend not to do well in urban combat. (It takes too long to destroy everything with HE so you actually have a clear field of fire.) AT grenades. I hate AT grenades so much. D:&lt;  On the plus side, Michael Wittman driving into Villers-Bocage with one Tiger and leaving with five Shermans, a Chaffee, and a Matilda is one of the most fun things I have done in a long time. Even if it's totally ahistorical. Especially if it's totally ahistorical. It's a pity the Katyusha mission only gives you three men, or I would have driven away the entire tank company, and the trains, too.  It's the sort of game that I sit down and decide to play half an hour of at 8pm, and look up after a while and it's suddenly seven in the morning.  tl;dr: 10/10 battlefield looting simulator would loot again",
            "review_score": "1"
        },
        {
            "review_text": "Rare to find a RTS as unforgiving as this! This game will make you thank god for quicksaving! Really rewarding, Incredible detail and extensive campaign that'll keep you very busy!  11/10 All time favourite RTS!",
            "review_score": "1"
        },
        {
            "review_text": "When it came out the WWII RTS games weren't that much, and it was easy to tell this is a very good game. I played it first before 11 years and I still love it, trying every mod I can find.  If you are into WWII RTS, don't hesitate to play it .. it's really good and will run smoothly on today's PCs, try 2Pz mod and you'll be blown out by the long and rich gameplay even with all the 'Men of War' games available today. Controls are easy, 10/10 game.  Update: 200 hours and counting, can't get enough of it I hope more modders become interested in developing mods for it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the game that defines having ridiculous fun with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Bullets fear the brave!",
            "review_score": "1"
        },
        {
            "review_text": "Realistic hardcore twin-stick shooter set in WW2, where you can put live chicken in your pocket. Sure.",
            "review_score": "1"
        },
        {
            "review_text": "Game decided to f*ck me up at the 2nd campaign with a nasty bug where 'Odetta Viera' or w/e just dissapeared into thin air.... well im gonna jump into face of war :) 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY!!! Waste of money and time!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Basically an older version of men of war assault squad 1 except its not as squad orientated and the campain and bonus missions are alot more fun, download Evolve and add me if you're down for Co-op or Skirmishes",
            "review_score": "1"
        }
    ]
}