{
    "app_id": 115120,
    "name": "Iron Brigade",
    "release_date": "2012-08-13",
    "developer": [
        "Double Fine Productions"
    ],
    "publisher": [
        "Double Fine Productions"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Captions available",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "Action",
        "Mechs"
    ],
    "achievements": 23,
    "positive_ratings": 573,
    "negative_ratings": 124,
    "price": 10.99,
    "description": "Join The Mobile Trench Brigade and protect humanity from the evil Monovision menace!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/115120/header.jpg?t=1479171014",
    "minimum_requirements": "OS:Windows XP, Vista, or 7 Processor:Intel Core 2 Duo at 2 GHz, or AMD Athlon 64 at 2 GHz  Memory:1 GB RAM Graphics:256 MB NVidia 8800+, ATI 3850+ DirectX®:9.0c Hard Drive:1800 MB HD space Sound:DirectX Compatible Sound Card Other Requirements:Broadband Internet connection.",
    "recommended_requirements": "OS:Windows 7 Processor:Intel Core 2 Duo at 2.2GHz, or AMD Athlon 64 at 2.2GHz Memory:2 GB RAM Graphics:1 GB NVIDIA 200+, ATI 4500+ DirectX®:9.0c Hard Drive:1800 MB HD space Sound:DirectX Compatible Sound Card Other Requirements:Broadband Internet connection.",
    "reviews": [
        {
            "review_text": "This game was 're-launched' a month ago, removing a performance-killing bug along with the terrible Games for Windows Live nonsense. Great news right?  Unfortunately, a new bug was introduced that causes the game to crash if more than 2 players start a game. Since the whole point of this game is multi-player, this is a critical gamebreaking bug. It has persisted for over a month now, and the devs have honestly said that they are more interested in the supporting the recently kickstarted Massive Chalice than supporting this game.  It's shameful, and another example of DoubleFine giving their customers the shaft. Get it together.  Update 12/3/15:  Revisited the game tonight with 3 other friends based comments from DoubleFine that 'Multiplayer is Fixed!'. No, multiplayer is not at all fixed.  The synchronization error crash seems to be fixed (edit 1/16 - it's not, according to posts in the forums), but the game is just as choppy as it ever was two years ago. My group got through ONE multiplayer map, then the second map stuck on an endless loading screen.  My review stands. Do not buy this buggy pile of garbage. Not even for a buck fifty.",
            "review_score": "-1"
        },
        {
            "review_text": "A really great game worth every penny i spent on it, long campain, interesting story and theme on the enemy and loads of unique weapons that feels great, i read that this game would be riddled with bugs but so far niether me or my friends have had any problems with connecting to each other or any ingame bugs.  The biggest negative about the game is that it uses windows live and getting that to work a little of an pain in the ♥♥♥ to but as soon as you get over the windows live stuff and get into the game i have had no problems whats so ever.",
            "review_score": "1"
        },
        {
            "review_text": "Armored Core meets Dungeon Defenders. Excellent 3rd person shooter / tower defense hybrid, with a humorous story, beautiful art, and unique WW1-styled mechs.",
            "review_score": "1"
        },
        {
            "review_text": "  Iron Brigade ",
            "review_score": "-1"
        },
        {
            "review_text": "A fun tower defence game. Customize your mech (known as trench) and go out into the field to defend the objective. Iron Brigade combines the 3rd person shooter combat with the classic tower defence gameplay of strategically placing turrets of various kinds to help you make a stand.  There is a large variety of enemies, which are introduced bit by bit throughout the campaign, ranging from fast fliers to slow yet durable Big Willies, to suicidal Blitzers, and hordes of spiky balls known as the Knobs. Each enemy has its own strengths and weaknesses and therefore you are required to outfit your trench with optimum weaponry for each mission in order to be effective. Most of the enemy designs were pretty creative and had a sort of personality.  I've played throughout the whole game solo. The early missions are fairly easy, but latter ones do pose a substantial challenge and might require several tries to get your strategy up to perfection. It's fun if you like a challenge. The game also has a handful of boss fights, so to speak. They do feel kind of different and out of touch with the rest of the gameplay though, especially the final boss of the original campaign.  There were some small annoyances, like there being too little time in between the waves and cutscenes/dialogue not being skippable (not that I've found anyway), but other than this, it was fine.  I didn't realise there was also an expansion act to the game, called 'Rise of the Martian Bear'. After playing the first mission, I'm a bit disappointed with it. It seems co-op play is encouraged much more here than solo play (so I might have to try them out on co-op), not to mention a strange lag that wasn't present in any of the previous missions. You also get some survival missions where you fight an endless horde of enemies.  Overall it's a fun game. It has a nice sense of humour to it with a hint of silliness, but it certainly works and can often give you a good chuckle. So if you like tower defence games, you should find Iron Brigade worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "'Unrefined Gem' is what this tittle is.  (the game has recently moved from GFWL to Steam, good move, but resulting in a hic-cup, nothing major though. dev promises a patch for it already)   The Positive:",
            "review_score": "1"
        },
        {
            "review_text": "Awesomely fun game. Nothing complecated, just upgrade your trench (mech) with bigger and badder guns here and there and shoot the crap outta all the tubes you see. Mindless fun to releave some stress.",
            "review_score": "1"
        },
        {
            "review_text": "So much better since the GFWL removal! Finally can recommend it to my friends. Best played in co-op.",
            "review_score": "1"
        },
        {
            "review_text": "I can't recommend Iron Brigade, though I wish I could.  This is a nice mix of 3rd person mech-fighting misxed with tower defense. The maps are adequate and the weapons are a lot of fun... but multiplayer is broken, which takes away this game's most promising feature: multiplayer coop. Also, the online community seems to be very small.",
            "review_score": "-1"
        },
        {
            "review_text": "Shoddy/Tatty Second Hand Internet Connection, You Must Be 'Avin A Giraffe If You Think I Can Wank Off To This! --------------------------------------------------------------------------------------------------------------------------------- I'm Shocked And Appalled I Almost Cut My Left Bollock Off Whilst Trying To Viciously Masturbate To This! --------------------------------------------------------------------------------------------------------------------------------- I'm Absolutely Disgusted 11/10 Would Wank Off Again!  --------------------------------------------------------------------------------------------------------------------------------- Brilliant Game For Those Who Enjoy Tower Defense Kind Of Games. ",
            "review_score": "1"
        },
        {
            "review_text": "I just love how quickly the review scores skyrocketed once GFWL was removed. I played with two friends last night who'd never played this game before, and before we knew it, it was 5 a.m. This game is definitely worth the price at $14, but $2.99? Why isn't it already in your Steam library?  EDIT: Some people are having issues with the game. I'd like everyone to keep in mind the fact that this is the first time in three years Double Fine have been able to update this game. There are going to be issues. Instead of complaining about them in the review section, why not go and report a bug? Personally, I had no issues running this game. I have a 2GB Nvidia 760 and an Intel 4771 processor, and am running on a 4:3 monitor. If that helps.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game. Gameplay is fun, the writing is funny and the style is fantastic. All that combined it is a charming game to play.  Though despite the removal of GFWL and the move to Steamworks, there are still a lot of issues with matchmaking. The stutter bug still exists unfortunately, despite many saying it has been fixed. Though it is nowhere near as bad as it was back on GFWL. But since TakeTwo now have IP rights, we should see some patches and fixes.  Should you get this game despite the bugs? Definitely. It's 80% off and the developers have acknowledged fixes are on the way. So it will only get better (Also maybe more DLCs are on the horizon? ;D)  10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "the windows live sucks... I must have reg'd under a diff email and now can't play the game, the place where you go to get a password reset, the link doesn't even ♥♥♥♥ing work... great!",
            "review_score": "1"
        },
        {
            "review_text": "Another excellent (tower) defense game. Walk around in your mobile trench and shoot at things until they go ka-boom. Customize your pilot with silly hats and uniforms and your trench with a wide variety of very different weapons. Grab three friends or random people for even more explosions!",
            "review_score": "1"
        },
        {
            "review_text": "Crazy russian television host wants me to die :&lt;",
            "review_score": "1"
        },
        {
            "review_text": "+Game's fun +/-Story is okay +Quips from the leaders from both sides is funny -Lacking some customization but not much +Fun gameplay, keeps you on your toes +Feels like another game I like yet is completely different",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent tower defense game, it's a combination of TD + TPS, good gameplay. The downside is that the port to the PC is very poor. Bad framerates, choppy, buggy, I guess it's worth if bought pretty cheap. Was part of Amazon's Microsoft Indile Bundle (5 microsoft indie games) for $10 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "As of July, 2015, I guess that since GFWL has been removed the scrap stutter bug is gone. I haven't played enough to see if it has and I probably am not going to but I trust other users saying that it has. Even so, my vote still stays at a downvote for two reasons: 1. It is still 30fps capped and 2. It took years for this game breaking bug to be fixed. They blew their chance to have a good game upon release years ago and never fixed it so they get no sympathy from me no matter what their reason is. The game was broke on release and failed and nothing can undo that. Is the game worth buying now? Only if you like games in slow motion at 30 fps. It is a very good game that was broken and forgotten. Now that the scrap bug is supposedly gone, catch this on sale for a fun time. In slow motion.",
            "review_score": "-1"
        },
        {
            "review_text": "This little gem is just sickeningly satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilariously fun, those of you familiar with Tim Shaefer and Double Fine Studios wll already be familiar with the kinds of quirks their games provide and this is no different. Its essentially a tower defence game only its fought in the third person and you control an active unit on the battle field, a massive hulking robot called a Mobile Trench. In each area you have several areas to defend and a certain time limit to set everything up before the enemy come in. Rather than do this from an overhead view, you stomp your trench around and set up assorted turrets on available building platforms, trying to create the right sort of deadly crossfire. You have to think on your feet once the attacks starts as they foes will becoming from all directions and you can only be in on place at a time, so what do you rebuild? Your own trench is heavily armed and can be upgraded between missions depending on your performance. The games atmosphere is an over the top setting remeniscent of a fictional world war one with anachronistic technology. The sense of humour is kinda crazy, I chose as my character a dapper British dude whose trench came equiped with a humidor for his cigars, at the end of every battle he would light up a cigar.......with his pistol. Also has multiplayer as c0-op or competitive. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "Its a great game and really fun! But the Co-op connection issues really take the fun out of being able to play with friends. 2 players is a little unstable, it'll stutter then either crash one player or the game splits like someone left but both players are still playing on their computer solo. 3+ just outright crashes. And some missions are a bit hard by yourself in the later stages unless you do some farming and leveling.  Thumbs down currently do the poor co-op connection.",
            "review_score": "-1"
        },
        {
            "review_text": "C'mon it's Double Fine, you know they make good stuff.   I just wanted to cross this sentence out. ",
            "review_score": "1"
        },
        {
            "review_text": "Good mix of metal, explosions, humor..   If you like Sanctum 1 or 2, Dungeon Defenders, any Hybrid Tower Defense, or even just any shooter where you kill hoards of stuff like Serious Sam... You'll like this game. Game is good. Def worth 3 bucks for the sort of re release they're doin. The game was updated to remove the Games for Windows Live crap, and as for the stuttering people are complaining about. Either they fixed that too or its its a prob with their pc cause the game plays flawless for me. It also has ingame voice chat and so far from the last couple days I'v played the community is pretty cool. Everyone's a comedian..",
            "review_score": "1"
        },
        {
            "review_text": "Fun game until you have to grind for hours to get new guns to make the DLC playable.",
            "review_score": "-1"
        },
        {
            "review_text": "Have played through the first few levels, it's an interesting take on the MOBA genre. Controls are easy, made for an actual controller I bet. Was easy to understand and play. Recommend to those that are new or looking for something quick and easy.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed playing Iron Brigade, whether solo or co-op. The mixture of WW1 and mech asthetics definitely worked for me, especially when mixed with nice touches of humour and the gameplay did not disappoint either. Blending TD with mech combat to overcome ever more challenging levels provides plenty of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I played this extensively when it was new on XBL arcade. It was really fun, and still is. With the fixes and removing GFWL, it's definitely worth buying again, especially if you can get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big double fine fan and the idea of Mechas in WW2 was enough to prompt me to buy the game. It's not a bad game, but it feels really mediocre. The tower defense setup feels like it's wasting a lot of potential here and even though the game says it can be played solo, the boss battles pretty much require at least 2 players.   There's just not enough here to make it worth buying and I really wish I didn't have to say that.",
            "review_score": "-1"
        },
        {
            "review_text": "Anyone familiar to Tower Defense Games like Dungeon Defenders will have an easy time adapting to Iron Brigade. DoubleFine definately brought a nice game to the table with a high addiciton factor for the first couple of hours. Sadly the game is plagued by a bad connection between players which leaves you frustrated hopeing for a stable connection.",
            "review_score": "1"
        },
        {
            "review_text": "fixed FPS number and fixed FOV. Couldn't handle it anymore",
            "review_score": "-1"
        },
        {
            "review_text": "Shoddy/ tatty second hand internet quality, i cant believe its not butter, i cannot use this material for my sexual gaming needs... Dont buy unless you have a beasters computer",
            "review_score": "-1"
        },
        {
            "review_text": "This game was very fun for a while, and don't let the hour counter fool you, I played the first 15 levels because it was very fun. But they give the the very annoying choice of having a good Trench (mech) or good towers. So you have to choose between having a good mech, and only one type of tower, or 3-4 towers and a mech that can't put a dent in the weakest enemys in the game.  This type of choice must have made more sense assuming people would be constantly multi-playering, like certain people could be the heavy hitters, but backed up by lightweights with good towers. I could see it working. But the multiplayer community is a ghosttown. I littereally NEVER found anyone else to go in game with me.   I'm giving this game a VERY RELUCTANT thumbs down. It's a good game at its core, but if you have noone to play it with, it becomes impossible towards the end. BUT if you are planning on playing with a friend, it's loads of fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Deleted my progress with the update. The game was set to NOT auto-update, did anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "Baught the game ran it, stuck on main menu... wont let me do anything",
            "review_score": "-1"
        },
        {
            "review_text": "buy this game m'kay",
            "review_score": "1"
        },
        {
            "review_text": "A fun First Person Shooter Tower Defense game that is enjoyable for a little bit.  Iron Brigade is a FPS tower defense game similar to Dungeon Defenders, Sanctum, and Orc Must Die to name a few. You control a character on a map, the camera is in 3rd person, you have the ability to place towers and traps, and you can also directly engage the enemy. If this all sounds par for the course, that is because it is. That isn't to imply that this is a bad game, it just doesn't do much that is different.  For the most part, the only thing that this game has over other games in this genre is charm. And this can be seen in its visuals, VO, animations (saluting is hilarious), and the general game's setting.   I know a lot of people like to use the saying that you shouldn't judge a book by its cover, but in this case, you can for this game. Watch a trailer or two, and if you enjoyed what you saw, then you'll probably enjoy playing this game. However, if the style doesn't grab you, than there isn't much that the game will do that change your opinion.  In the end Iron Brigade is a competent FPS TD game. And as such it has the same things going for and against it. I personally found myself getting fed up with the game about half way in, when the game's design started to show that the maps were design for multiplayer (big maps, lots of spawn points, and defense mission objects). And given the game's age and popularity, I wasn't able to find any random people to play with. However, even with that being said, I still enjoyed the game, to the point where I feel that other people would enjoy this game too... well, they would enjoy it for a bit.",
            "review_score": "1"
        },
        {
            "review_text": "The best way to describe it is a hybrid of shooter and tower defense. Third person, unlike some others, and in its own way both more and less customization. There are not really defined classes with optimized weapons, however there are different trench chassis, legs, and weapons, each with their own more or less ideal combinations, however you are rarely locked out of a weapon class. You might be unable to carry certain emplacements or weapons on chassis due to size limits or carry limits, but almost every weapon class and emplacement class works on every chassis in combinations. You won't get the biggest guns and five of the strongest emplacements on one chassis, but you aren't truly locked out of something entirely. The weapons handle well, the missions are fairly well made, the survival modes are fun. The game is actually made a lot easier and a lot more fun played co-op. The only downsides I can think of is that a lot of the cutscenes are unskippable, which does get annoying; and there are a few items you get as rewards for completing something, such as gaining a level or completing a mini mission thing that you can't get back if you sell it. Rewards for completing a story mission can be had by doing it again, but the extra bonus rewards are lost for good if you accidentally sell one. It's similar enough to Dungeon Defenders and Sanctum to draw comparisons in how it works; you defend against waves of enemies and build defense towers while also shooting them, and yet it's different enough to be worth having if you enjoy this style of game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. Very FPS/RPG/TD. The art style is very nice. The characters and feel is very good.",
            "review_score": "1"
        },
        {
            "review_text": "A good third-person shooter / tower defense hybrid very similar to the Sanctum series right down the four player co-op mode with only slight difference in the way the games are balanced.  Where Iron Brigade really shines, however, is the aesthetic; your 'mobile trench' (battle mech) looks like it just walked off of an Alt-History WWI battlefield and the weapons and emplacements you have access to as well as the USS McKinley fits right in while the the various Monovision monsters are dark cyberpunk creations that somehow look right facing off against your Diesel Punk combat walker.  A warning is required however as it is difficult/impossible to play co-op anymore due to the game's reliance on the largely defunct Games for Windows Live service.  EDIT: As of a June 2015, Iron Brigade now uses Steamworks instead of Games for Windows Live, improving game preformance and making multiplayer far more easy to play.",
            "review_score": "1"
        },
        {
            "review_text": "  DISCLAIMER: This is a first impressions review, and NOT a full review, if you want a full review, then please read better reviews then mine",
            "review_score": "1"
        },
        {
            "review_text": "Decently fun. Runs ok, but gets screen tearing during certain parts even with v-sync on. Combat is fun, but repetetive. There's a loot system where certain big enemies drop boxes during the match which are usually scripted advancements in 'unlocks' throughout the campaign.  This is a typical tower defense game with a bit of a twist. It starts out painfully easy and ramps up to being borderline unfair and frantic after a few missions.  I recommend this because I got it for $3 off humble bundle and got my moneys worth.",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable Tower Defence. Easy to learn hard to master. Lots of humorous moments, and really fun to play. Only downisde that game was not able to find anyone to play in cooperative mode. ",
            "review_score": "1"
        },
        {
            "review_text": "The most greatest defense game i've played. Pros -Customize your mech whatever way you want -Choose own character -Multiplayer function -Quality voice acting -Decent graphics",
            "review_score": "1"
        },
        {
            "review_text": "Iron Brigade (Also known as Trenched) is a pretty enjoyable game all in all. The gameplay is simple, has flaws, and definitely isn't the BEST shooter/tower defence hybrid out there, but what little it lacks in the gameplay department the game more than makes up for in charm. The setting is portrayed well in a way that, while it acts seriously enough to not be offputting, never forgets the fact that it is a videogame about a bunch of ww2 or so era soldiers riding around in giant robots shooting evil television demons constructed by what is basically the equivilent of a hammy golden age comic book villain.  One of the game's most important and coolest features is customization. Since you're riding around in a mech, you can change your weapons and turrets using a 'slot' based system. Each mech has a certain number of weapon slots and a certain number of gear slots, meaning some machines will have loads of weapons but almost no tower variety, while others will pack only one or two smaller weapons but have hordes of towers that they can place more cheaply and easily. All of the various cores, legs, and weapons change the way your machine looks, so you get a real sense of actually changing your stuff around. The mission select screen is set up to encourage this as well, pulling everybody in your multiplayer party onto the same boat HUBworld, so that you can walk around the ship, looking at and talking about what everyone is customizing and packing while hearing about the mission objectives.  If you are a massive fan of tower defense games, something you should know before buying is that while towers are important, there's much more focus on the shooting aspect in this game. This game has no mazing, there is no way to alter the enemy paths so if you really enjoy tower defenses for the ability to strategically manipulate your enemies' path, you will find absolutely none of that here. Instead the tower strategy consists of finding somewhere safe to put your turrets so that they wont get destroyed easily while hitting as large a range as possible.  So the final question would be whether or not it is worth your money and your time to get this game, and I'd say that absolutely yes it is. So long as you don't mind the absence of certain tower defense mechanics, Iron Brigade is a charming if very slightly dated take on the genre that is solid and obviously had a lot of love put into it by the developpers. If it goes on sale for less? Even better.",
            "review_score": "1"
        },
        {
            "review_text": "Yo.Ok they fixed multiplayer and its a game I recommend to play because you get to pilot a mech. ヅ",
            "review_score": "1"
        }
    ]
}