{
    "app_id": 115220,
    "name": "American Conquest: Fight Back",
    "release_date": "2011-08-26",
    "developer": [
        "GSC Game World"
    ],
    "publisher": [
        "GSC World Publishing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Historical"
    ],
    "achievements": 0,
    "positive_ratings": 151,
    "negative_ratings": 73,
    "price": 3.99,
    "description": "American Conquest: Fight Back is the sequel to American Conquest. The most significant events of that glorious time have found their way into this title.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/115220/header.jpg?t=1547056291",
    "minimum_requirements": "Operating system:Windows® XP / Vista™ / Windows® 7  Processor: 1.4 GHz CPU Memory: 512 MB  Hard disk space: 3.5GB  Video:Video Card with 64MB dedicated memory and DirectX 9 Compatible Sound:Sound card with DirectX 9.0 support DirectX®:9.0 or higher",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "After feeling the old times again, I thought i help the interested people with this review, a bit out.  Alright let's begin with the basic informations about this game. American Conquest: Fight Back is the standalone add-on for the 'American Conquest' the RTS succesor in year 2002. (Fight Back was published one year later [2003]). The Ukrain developer 'GSC Game World' (Who also developed the famous Cossacks games) set a great step towards the massive fights in RTS games, we currently play. With a limit of around 16.000 Units on the map, a big step was made. To cut it short. American Conquest (in addition: 'Fight Back and Divided Nation') has made it's place up to one of the greatest RTS games ever made so far.  Moving on to the Pros and Cons section:   Pros    - 2D Graphics (But don't let yourself get shrekt by that, for a 2003 game, the graphics do look smooth and pretty)  - No running problems on 2003 compared systems (Currently used: Windows 7 Home)  - I only experienced 2 crashes so far after a long play time.  - RTS game.  - Tutorials are existent  - A huge variety of campaigns (Europe site and Native American site)  - A huge variety of civilizations (Europe site and Native American site)  - The units for example the fusilier does never look the same, each civilization has it's unique units  - The AI is challenging even on 'Easy' Mode  - Balanced play  (Europe units are mostly based on gunpowder but cost more and take longer to built, while the natives mostly rely on arrows and a minimum of gunpowder, but are cheaper and faster to built)  - Morale and defenses are pretty well built in the game  - Mechanic of people dying when there is no food left is within the game  - Mechanic of archers not shooting arrows when there is no wood left is within the game  - Same goes for units with the use of iron and coal for gunpowder (KEEP YOUR RESOURCES UP!)  - The price of 4.99€ is worth every cent    Neutral  The neutral section here is a section where i simply can not tell whether it would be good for you people or not.   - The music, does fit, but it can get annoying i guess    Cons    - You need to be fast to built up your defenses (depends on the peacetime you set in the menu)  - The AI how easy they might be, can always find a way around your guarding troops. So be careful and guard well.  - I do experience lag at somepoint in the game if a number of units is produced, but this can be because my computer has to run multiple things in the background  - The game sure can be frustrating if you look more for the economic state of the game (Example: Research everything before you actually produce units/an army) and the AI smashes your efforts with one offensive strike  - Sometimes (atleast if the enemy is the civilization: 'Pueblos' (which i assume are the mexicans) it can happen that the enemy is not attacking at all, but patrolling their city. (To fix this you simply need to attack them)    Conclusion   I played this game around 2005 or so and i loved it. Since steam brought it back into the store, I do play it often. I can only say that every player who likes good old RTS gaming experience, should buy this game. I did not tryout the multiplayer matches, since i do feel like i'm not that good but that's an other story. Still though. Buy it if you feel like it, or feel like you should try out the RTS gaming.  I do hope that i helped with this review, if anyone still feels unsure, feel free to contact me, I'll try to sort things out and answer your questions you might have, as good as possible.  At last a pro tip: DO NEVER EVER MAKE ALL YOUR ENEMIES AND YOURSELF DELAWARES!  Greetings  The Körnäl",
            "review_score": "1"
        },
        {
            "review_text": "Extremeley fun game that has alot of strategy put into it. Much more realistic than other rts games, however this game on its easiest setting is EXTREMELY difficult to win.",
            "review_score": "1"
        },
        {
            "review_text": "I find this game very interesting and fun to play :)",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "8/10 used to play it when i was 12",
            "review_score": "1"
        },
        {
            "review_text": "I would be glad to be able to finish just one random map without a crash and a slight adjustment on this ridiculous speed.  This review will change when the game will be patched to actually works correctly on steam. Nonetheless it's an excellent game...",
            "review_score": "-1"
        },
        {
            "review_text": "Need Help! If I start a Game, it works very nive but in Fast Mode. If i switch it in the slow Mode in the Main Menu and start a new game, the game crashed.. Help me pls! It's a very nice game!!  Sorry Bad Englisch..",
            "review_score": "-1"
        }
    ]
}