{
    "app_id": 115210,
    "name": "American Conquest",
    "release_date": "2011-08-26",
    "developer": [
        "GSC Game World"
    ],
    "publisher": [
        "GSC World Publishing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Historical"
    ],
    "achievements": 0,
    "positive_ratings": 180,
    "negative_ratings": 92,
    "price": 3.99,
    "description": "In American Conquest, Players set sail from Europe to discover new world and conquer its innumerable riches.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/115210/header.jpg?t=1547054300",
    "minimum_requirements": "Operating system:Windows® XP / Vista™ / Windows® 7  Processor: 1.4 GHz CPU Memory: 512 MB  Hard disk space: 3.5GB  Video:Video Card with 64MB dedicated memory and DirectX 9 Compatible Sound:Sound card with DirectX 9.0 support DirectX®:9.0 or higher",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Really achieves a realistic feel for the weaponry, making the European gunpowder units have to reload every shot while the natives can just hammer away with bows, spears, slings and even blow darts. It evens the playing field with the powerful artillary and cavarly of the Europeans, combined with powerful ranged attacks to counter the native size advantage. That being said, it also requires you you always have peasants gathering to support your military. The editor allows you to simply go ahead without any worry and just cause massive death and destruction in any terrain you could think of. In short, this game allows you not only to play as God, it allows you to bombard the hell outta a few native warriors. It combines military fun and destruction with resource managing and the all great Empire building. You'll love this just so you can blow up that fort your neighbor spent so much time and resources putting up in the first place.",
            "review_score": "1"
        },
        {
            "review_text": "You need to buy this game. If you like Age of Empires; if you like American history; if you like RTS games in general. It is underrated and noone's heard of it, but don't let that stop you.   These people made STALKER, too. They know what they're doing, even when it's confusing and Russian.",
            "review_score": "1"
        },
        {
            "review_text": "Classic RTS that works for windows 10",
            "review_score": "1"
        },
        {
            "review_text": "Good:  -Cheap -RTS -Classic -Fun -Time Consuming -Interesting -Good campaign, a lot of information -Learn interesting facts -Huge armies to the slaughter  Bad  -Your units sometimes have a mind of their own -Has to be troubleshooted to run for Win 8  Overall: 9/10  Would install again",
            "review_score": "1"
        },
        {
            "review_text": "does not work on windows ten? help?somebody call me to explain at 7755278740 please.or write. spent money.game does not work.by the way, how am i supposed to enter the key code.where would i enter a key code.",
            "review_score": "1"
        },
        {
            "review_text": "love the game but everytime I try to adjust the gameplay speed it crashes, idk why",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly kind of fun once you figur eout what the hell you are doing haha....not a bad game for a super fast RTS type historical game.",
            "review_score": "1"
        },
        {
            "review_text": "I had the original copy of this, and it was such a good game! but this one has been altered to a point where its not really the same game, the speed has been increased, well past its normal level, making you scroll, and your units shoot across the screen quicker than you can see. When you try to change the setting it freezes the game, so ts hardly playable at all, which is a real shame, because thsi game was absoutly amazing at its normal speed.",
            "review_score": "-1"
        },
        {
            "review_text": "A 10 year old game that thats not updated to run on todays OS and hardware so it runs poorly. Gameplay has multiple fighting bugs. Formations are fun to work with but glitches can ruin the fight. A formation of 100 vs 100.. if 1 enemy breaks away... sometimes your whole formation chases after him while the remaining 99 enemies shoot at you. It doesnt have stats at the end of a battle.. just a 'you win' window and then returns to the menu. After a 2 hr non stop battle, i was wanting to know what my win/loss ratio of troops was like, but zero info given. I would give it a better chance by playing more, but the game speed is terrible.  All the missing components of this game is in a better game called Age of Empires.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this it is not good play it sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Not optimized at all for Windows 10. The game randomly crashes and when it does work, it goes way too fast. I don't understand why Steam allows these types of games to be sold on their platform. It should constitute fraud.",
            "review_score": "-1"
        },
        {
            "review_text": "The Population limit is around 1600, an there is a level editor \\o/",
            "review_score": "1"
        }
    ]
}