{
    "app_id": 115320,
    "name": "Prototype 2",
    "release_date": "2012-07-26",
    "developer": [
        "Radical Entertainment"
    ],
    "publisher": [
        "Activision"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Open World",
        "Gore"
    ],
    "achievements": 43,
    "positive_ratings": 5411,
    "negative_ratings": 2244,
    "price": 19.99,
    "description": "Become the ultimate shape-shifting weapon!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/115320/header.jpg?t=1466106968",
    "minimum_requirements": "OS:  Windows® XP / Vista / 7 Processor: Intel Core 2 Duo 2.6GHz, AMD Phenom X3 8750 Memory: 2 GB RAM Hard Disk Space: 10 GB  Video Card: NVIDIA GeForce 8800 GT with 512 MB RAM, ATI Radeon HD 4850 with 512 MB RAM DirectX®: 9.0C or later Sound: Any DirectX 9 compatible Sound Card Supported Input Devices: Keyboard, Mouse, Xbox 360® Controller",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core 2 Quad 2.7 GHz or better, AMD Phenom II X4 3 GHz or better  Memory: 4 GB Video Card: NVIDIA GeForce GTX 460 (1GB) or better, ATI Radeon HD 5850 (1GB) or better",
    "reviews": [
        {
            "review_text": "  PROTOTYPE 2 – REVIEW",
            "review_score": "1"
        },
        {
            "review_text": "Recomended!  The Good: Feel like the most powerful being, unleash devastating powers on the world, use everything, destroy all and everything. This feeling doesn't go away fast, it feels great!  The gameplay is great!  Using the tendrills is fantastic!  I actually liked the story New game+  The Bad: I see a lot of people saying they have issues. I haven't had a single bug, or crash. It took me 13 hours to go through the story and unlock everything (on normal), feels to short...  The Ugly: James Heller is a very cool guy, yet I'd like to see more of his background known.  Some things are copied from the previous game. Cheesy oneliners.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, solid 10 hour campaign, fun to excessivly and accidentally slaughter everything *in a game*, shows humankinds true nature as monsters. Only has so many negative reviews because it doesn't work with AMD,  Ahhh the time when we reviewed games on how good they were. Recommended if you love action 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is my fevorite game of all time..great powers..flying was great ..they need to make more of these games. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "  WOULD NOT RECOMMEND FOR AMD. Luckily this game was gifted to me, the storyline itself is very cool, and if it weren't for unsupported AMD users I would recommend this game to anyone. The first game was addicting but, even an hour in to this game, it is UNPLAYABLE.",
            "review_score": "-1"
        },
        {
            "review_text": "Now, in my opinion, Prototype 1 is superior to this one in alot of ways, it was one of the best open world games I have played, hacking and slashing your way through New York was really fun. Now, Prototype 2 is a really good and fun game in my opinion. The gameplay is pretty much the same with the controls etc, but the game takes away some freedom you had in prototype 1. And I've heard alot of negative responses because the main character is black, but I personally don't mind. I like this change. The story can also be a bit better, they shouldn't have taken the revenge thingy again, but it SOMEWHAT fits in, if there is going to be another Prototype game, it needs some better lore. Overall, the game is worth playing, and very addicting at that. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "It's different to the first game - better, worse? Just different. There are not as many powers in this game, but then the first one had ones you'd never use. Running around the city in some ways is easier in this game, but I had more fun doing it in the first one - but the fiddly bits of running up buildings have gone, which makes this one better. Obviously the graphics are better in this one.  The protagonist in this one seems to be badly written, and fills too many stereotype boxes. It's not quite blacksploitation, but something about 'Hell ♥♥♥♥in' yeah!' doesn't sit quite right with me. Now if someone can tell me what the hell happened to Alex Mercer between the first game and this one, that'd be great.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay, as expected, 10/10, totally satisfied about it, bought the game only because of that.  The rest is... ugh. Story: Too dull and straight forward, really predictable, just like 'go there and blow everything up' Memories: Unlike on the first one you can't figure out much about backstory only with them, they just focus on information over objectives and plans that you are meant to frustrate. Alex Mercer: While what he wants to do certainly sounds like something Alex could possibly do how he executes his plans, how he talks, how his allies are and his cleverness, are all inconsistent to the legendary Alex Mercer from Prototype 1, he was just turned into a cliche villain that actually doesn't have much participation as one would expect. I repeat, bought this game for the gameplay, because, apart from graphics, it's the only thing better than it was in the first title.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. Your basically a superhero running around a city. The city itself is similar to that of gta3, pushing 4. There's plenty of people on the ground, cars don't really appear, as everything is in a military lock down. You the hero basically run around running up buildings and leap / glide around the world. The level system works well letting you pit skill points where you see fit.  The story is good, your piecing together events from memories of those you consue  Early on the game will bug out when using the claws, there's a affinity bodge that works well and once done you can set the game back to all cores.  I love it ",
            "review_score": "1"
        },
        {
            "review_text": "It's like the first Prototype, but with more skills, weapons, enemies, etc. It's still the pure, endless massacre and you are still playing the super strong ultra-mutant! So if you liked the first Prototype you'll also like this one also.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It more focused on gameplay and story compared to graphics and isnt really compatible with AMD GPU's. Strongly recommend AMD users not to play.",
            "review_score": "1"
        },
        {
            "review_text": "After playing the first one on pc, I was relieved to see that they had help resolve a lot of the frustration from the 'bad' port to pc. Definitely worth it to give it a shot. So far I've spent almost 3 hours playing and have only completed 11% of the Story . I am liking those numbers.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great stress reliever. Had a bad day at work? Do you feel like everyone's talking smack about you behind your back? Load this puppy up and take out some aggression.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the junkfood of sandbox action adventures.  The graphics are nothing to be astounded by, alongside the boring, repetitive enviroment. Nor should you think about the story and it's baby-eating evil cast. On those merits, this game would be terrible.  BUT, what this game does well, is let you run around the streets of New York as an unstoppable monster, fighting both infected and military enemies with incerdible ease. Though the fighting can be a bit fiddly, it's fun, frantic and empowering.  It's quick, dirty and cheap fun. Why not?",
            "review_score": "1"
        },
        {
            "review_text": "I love this game the gameplay is amazing but the story is kinda ♥♥♥♥ but its still awesome.",
            "review_score": "1"
        },
        {
            "review_text": "FUN and Awesome. Not as awesome as Prototype 1 where it was really killing and ♥♥♥♥, this is more stealth and crap.",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is fun. However I cannot save. It said that 'Failed to save data' .",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best open-world third-person view action games! While the story may look ridiculous, it's actually doesn't matter. The storyline is like a good old-fashioned  trash  movie, while the gameplay... that is what it's all about!  Love the game engine - all in one - AI, physics, graphics (game looks yummy even on my low-end videocard) - great. The setting is also a strong part of the game. I did not played the first game, so for me it was a nice surprise. It's like   Resident Evil   except   YOU   are the Biohazard here.  Pretty damn nice, 9.6/10",
            "review_score": "1"
        },
        {
            "review_text": "I barely got through the prologue before i saw what people were complaining about. i have an R9 raideon graphics card, well above needed specs, and the framerate dropped to about 3fps. that is just unacceptable, period.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing game i completed it in two days with 18 hours total gaming. i would recomend this to people with gaming computers as at an average im running at 2 fps on a good computer. Putting lag aside the game is one of the best ive played and i would rate it easily 9/10, but because of the large quantity of lag that many such as i have been experienceing i would have to rate this game 6/10 it may sound harsh but it did ruin the gaming experience I had.",
            "review_score": "1"
        },
        {
            "review_text": "nice fly around game...jump here n there",
            "review_score": "1"
        },
        {
            "review_text": "Sooo Angry!  Prototype 2 is an awesome game, but not for the faint-hearted. With incredibly rude language and brutal excecutions, this game will linger for a while. I only had a problem with the graphics, but that is just my computer. Other than that, this is an incredibly brutal game, with a lot of blood, but not unrealistic.",
            "review_score": "1"
        },
        {
            "review_text": "Another very fun sequel to the previous game. If you enjoyed the first then you'll love this game, with slightly improved controls, fun powers which can be upgraded and if you just generally enjoy to mess things up supremely, then this game is for you.  My only quarrels lie in the fact that we play as Sgt.Heller, which although I think he's a great character, the plot could have been improved to have been about playing as Mercer again, since everyone loves him so much, however if you can see past that, you should enjoy the game!",
            "review_score": "1"
        },
        {
            "review_text": "THIS GEM IS LIKE YO LETS KILL ♥♥♥♥ AND THEN U GET ♥♥♥♥IN BLADES AND ♥♥♥♥ AND GIANT FISTS AND YOU GO LIKE BAM AND EVERYONE IS DEAD AND LIKE SHIIIIIIIIIT BOOOOOOOOM AND THEN U GET EVEN MORE AND THEN ♥♥♥♥ING GIANT MONSTERS COME AND YOU CUT THEM LIKE ♥♥♥♥ING BUTTER EVEN IF YOU ARE A LIL ♥♥♥♥♥ BUT YOU SLICE THEM LIKE SHIEEEEEEET AND THEN YOU TAKE THEIR ARMS AND USE AS WEAPONS AND BOOOOOOOOOOOOOOM",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you like prototype 1",
            "review_score": "1"
        },
        {
            "review_text": "is it cool game i love jump and speed , zombie , soldier",
            "review_score": "1"
        },
        {
            "review_text": "Finished (did the last main mission) after 28 hours. These were ca. 23 pure fun, blood, action and carnage. And the last 5 hours PURE frustration. The last mission.  This really bad last mission which kills all the fun you had all that time. If you would just play the mission without dying, it would be, don't know 15 minutes. It took me 5 hours to beat the END BOSS. ♥♥♥♥ it!  Until then, I had a main stories, some side stories, action without end and the feeling that I am the overpowered king of the city. At least until 3 infected or 4 attack helicopters or worse, all at the same time came at me. Then it would become even more hectic and fun. And sometimes I died... in the beginning.  You get more and more powers, but not so many that you get confused. A lot of your upgrades are passive ones or only useable in certain situations,  like destroy tank with one attack, or do that attack 75% faster or  run x% faster or have more health or have more 'hounds' in your pack.  All updates are useful somehow, you can take enemy helicopters after a while and just use them or glide around the city and do attacks from above or ignore the main story and have fun.  The game did not crash once in these 28 hours. And I do not have a special computer.: Processor Intel(R) Core(TM)2 Quad CPU Q9550 @ 2.83GHz, 2832 Mhz, 4 Core(s), 4 Logical Processor(s) Name NVIDIA GeForce GTX 660 Ti 8 GB RAM  I was able to run it with max details and no fps problems at all.  The game is easier than the first one, which is somehow a nice thing. You had a lot more moving and fighting options in the first one, which was nice too.  However, if you want fun and blood, then this is a very good game. If you can beat the last enemy in half an hour, then you are a semi god at least :)  Really good game, way too hard last enemy. Buy it anyways!",
            "review_score": "1"
        },
        {
            "review_text": "Dont usually play a game multiple times but I went through campaign 3 times on this game.   Consume citizens to save citizens.  10/10 would kill humanity again",
            "review_score": "1"
        },
        {
            "review_text": "Well, i will be brief. Prototype 2 is the sequel to Prototype (1). On my opinion its good game. Brutal, action adventure where you can upgrade your character and his incredible skills. Open world in destroyed New York..Arhhh..YES..It is actually good environment for myself. Lot of people say that have boring campain. Yes, for begginer this can be 'nothing much'. I am fan of this series, but it has some 'errors'. P2 giving new and new abilities and ways how kill someone with STYLE, but lot of these just lost. I liked in P1 feeling, i was an original. In P2 developers made lot of mistakes and P2 is story about 'stupid superhumans' with 'SAME' (always easy to kill them) skills. Yes, P2 has very easy difficulty, something is happening on HARD or INSANE diff....But i still LOVE this game and this little 'errors' don't make me to hate this game.. I really recommending this game. &lt;3  + grafic + gameplay + quite creative + environment and size of map  + character  - enemies - difficulty - some missions ( just hunt and then consume or kill your target) - length of story, you can finish story in 4-5 hours (without bonus missions)  MY REVIEW - 8/10",
            "review_score": "1"
        },
        {
            "review_text": "CON  I'm not a huge fan of games where they tell you whom to play. That said, that's my main grudge against P2 -- you can't really choose what your character looks like, what his backstory is, etc. etc., and the fact that like in P1, it isn't really anyone too likeable doesn't help.  The control scheme now lets you choose two active powers versus Prototype 1's one, and while that sounds nice (especially the option to assign a slow move and a fast move, or a close range one and a long-range / area one), I didn't really find it all that useful in the game (I would assign one fast, close range attack as primary power and use it 95 % of the time, and have something like tendrils -- or later whip fist -- as a secondary for the rare cases where I needed to attack a helicopter or needed an area effect. Using each roughly 50 % for great synergy? Not so much. But maybe, that was just me.). The downside is that while you get twice as many active skills, you have to handle them with the same number of buttons on the controller, and the controls feel less precise than in P1. Ironically, the most annoying issue wasn't even attack related; if you don't get quite the right attack, but still an attack, it's usually non-catastrophic. What I did get often enough for it to be a nuisance however was being on a stealth mission, pressing (B) to interact with some hapless soldier (usually to consume them and gain their memories; sometimes just to stop him keeping an eye on the person you came for), and instead prying lose some feature of the landscape that also happened to be close (but didn't even necessarily look like you could interact with it). And well, prying lose random ACs or oiltanks or whatever automatically raises an alert and ruins the stealth part of your mission. (This can also be an issue during melee, where you get a prompt to press (B) to consume an enemy who's been weakened enough, but who may die soon, and where in crowded locations (B) will then often select bystanders seemingly at random, all while your actual target is bleeding out.  I liked the skill system in P1 better (get XP for everything, then once you have enough XP to improve whatever skill you're interested in (i.e. buy many minor things quickly, or save up for big improvements)) vs P2's 'you'll level up again at so-and-so many XP, and every time you do, you can improve exactly one skill', but in the end, it wasn't a huge factor. (That said, the thing where you can get a skill buy eating the brain of someone who has it still exists.)  PRO  Unsurprisingly, the city looks much better than in P1; the player character looks much better, the voice acting is decent this time, and most of all, while there are certainly repetitive elements (mostly the Blacknet assassinations, which often don't have much in the way of plot -- this is even lampshaded one time: 'So this guy is an APC driver? Doesn't really sound like a big bad mover and shaker ... ah, whatever, I'll kill him anyway.'), the game, especially the main quest, feels much more like a story than the first game did at the best of times, and a sense of urgency is upheld at (almost) all times. Like a soap opera or Baking Bread, it isn't necessarily the cleverest plot on earth, but each mission creates enough of a cliffhanger to make you wonder what will happen next, and it's tremendously easy to get sucked into 'just one more mission before bed.'  As a bonus, much of the optional 'color' of the setting is now told through audio logs you can find (and listen to while you move along), rather than flickering memories with corny visuals that don't really blend with the rest of the game and that interrupt your flow like in P1. Small change, surprisingly big effect. (Technically I guess they're a cross between the landmark orbs and the 'color' memories of P1, but I played P1 and P2 in the same week, so it's becoming a bit of a blur.)  There are challenges and mini-games and somewhat repetitive kill zones, but unlike in Saints Row IV, they're not mandatory -- you can do one once in a while for variety or XP, or do them after the main quest for something to do with your then near maxed-out powers. Or, you can ignore them completely, and just do the main quest. Your choice.  The gliding, especially once upgraded, still won't carry you as far as SR IV's, but it feels world's away from P1's, which never felt much better than plain old falling.  A big plus: Starting maybe 2/3 in, P1 would just try to overwhelm you -- gliding was practically useless, perhaps in an attempt to keep you at street level, and at street level, there'd be a constant barrage -- even if for once, zombies weren't attacking you and soldiers weren't detecting you, you'd frequently ragdoll all over the place simply for getting caught in random crossfire of the marines or blackwatch using tanks and rockets at street level. Yes, it sounds good on paper -- getting swarmed is obviously very much a zombie trope, and the careless use of artillery demonstrated desperation / casual disregard for any survivors, but in reality, it just makes for a really unfun game mechanic when the true challenge of a misison isn't Doing The Thing, but getting there to do the thing. Meh. (This was exacerbated by the fact that using any speed powers could get a strike team called on you.) In P2, you get caught in the cross fire much less easily, you don't get swarmed by the zombies as much, strike teams aren't called in as easily, take longer to arrive, are easier to shake off, and are easier to kill. Heck, it's almost too easy in P2, but I'll take that over P1's traversing the city being a chore any day. P2 has 'joy of movement!' :)  RECOMMENDATION  If you can stomach playing a character that they picked, rather than one that you picked, give it a go, especially if you've played part one, but get it while it's on sale. (It seems pretty much too late to vote with your dollar anyway, now that they've already downsized Radical -- which is actually a shame, I would've been interested in seeing how a Prototype 3 would've come out.)",
            "review_score": "1"
        },
        {
            "review_text": "AMD Radeon R9 290X 4GB, i7 4790k, 8 GB RAM, running on a SSD (so well above the recommended sys req): 720p, medium settings -&gt; under 30FPS. I run Metro on high with max settings at 1080p 60 fps.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Piece of total garbage. Doesnt run for longer than 40 seconds and is buggy as hell within those 40 seconds. Steam. Actually do your job and look at if the game works before making it available.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed this game more than I thought I would. However I did have that glitch early in the game that required me to set my CPU to one core in order to move on in the story, but quickly changed it back to all 4 cores.  The 10 hour single player game is worth the price if you like Third Person open world action games. The game ran smooth with 50+ monsters, helicopters, tanks, soldiers, and stuff flying everywhere. Running around, flying, and parkour all was smooth/fun.  You can pick up guns, do side quests to beef up your char, or just cause massive damage to an area. It has a bit of stealth as well, but mostly not required. The story is just your typical - Rough tough good guy smashing bad guys and getting tricked along the way, but every hour or so you get a new method of attacking and killing so I kept rolling forward.  If you want a GTA Meets Superman, but with Zombies/Monsters/Big Cities then this is the game for you. Just don't expect anything more than a fun smash and bash action game.  Would play again if I didn't have so many other games to play.",
            "review_score": "1"
        },
        {
            "review_text": "Prototype 2 is the typical lackluster sequel if there ever was one. Sure, the graphics are prettier and the gameplay is 'refined', but it suffers the burden of being not only a poor port, but something of a shoe-in title.   The story is less than great and won't keep you invested in the game. While the game itself is fun, it has the potential to be extremely tedious and sometimes purely boring. The 'side missions' are a rinse and repeat formula and strikingly exhausting. Sure, the first few are fun, maybe - but soon they become a real pain.   If you're playing the game with an AMD card, you'll have to deal with constant memory leakage, gradually cranking the game's performance down and leaving you with a sad twitching pile of polygons and laggy blur effects. I had to end up downloading a third party application to have the game run smooth and actually have a chance at finishing it without losing my mind.   If you're interested in an 'open world' superhero game, (the open world is actually not 'open' - it's split into districts of fairly small sizes that require fast travel between them; invisible walls, ahoy!) where you're free to run wild and destroy things and throw people, this game is exactly what you're looking for. If you're looking for immersive story and impressive mechanics, steer clear.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't understand why this game has mixed reviews. I played this game on console for many hours, so I know what I'm talking about, I just recently got it on pc though.   Not only is this game extremely fun and there are endless ways to take out enemies, you literally feel like you're unstoppable. You get many upgrades to your character, new weapons, and a pretty good story. It's extremely gory, so people who like gory games, this is for you. Even when you finish the game, you can still play it and have a good time. Also a good game to play if you're angry lol.   I guess the one thing I could say that makes this game negative, is it is really easy. Some might like that, but some others like a challenge when they play, and even on the normal difficulty, difficulties definitely don't surpass the easy parts. Again, some might like it, some might not. Depends on what kind of player you are.   Overall: 8.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "an amazing;y fun game with interesting story, that blast's it proseser out of the water.",
            "review_score": "1"
        },
        {
            "review_text": "Now this is a bugfest! DO NOT BUY!!! On the first mission you have to manually set the game to use only one core(CPU) to progress in the campaign. -!♥♥♥♥♥ GAEM!-",
            "review_score": "-1"
        },
        {
            "review_text": "Love it. Total blast to play. Definitely has some technical problems which is disappointing, but I was able to work around them.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game. It's just full of bugs. I can't get past one of the first missions, the game crashes during the loading and there is apparently no fix for that specific bug. There are several other glitches that will make your game crash. Ultimately, I think it's kinda rare that someone succeeded in finishing the game. I read everywhere that it's just a very, very bad console port and that there is absolutely no support in case of problems with the game. I regret buying this game.  Edit : Bought a new computer with an nvidia graphics card and the game worked lke a charm. However, because of my past experience, I still can't recommend the game. The game is kinda fun but doesn't add anything to the first. In fact, if you played the first and liked it, you don't even need to play prototype 2...it's pretty much the same but less original. The final fight and the ending leave a feeling of...'I did all this just for that??????'.",
            "review_score": "-1"
        },
        {
            "review_text": "guys this mother ♥♥♥♥er game rocks but still it is not for people who are under 6 or 7 years people but still it is a bit of scary game and they sware a lot as you see in my photo ",
            "review_score": "1"
        },
        {
            "review_text": "Another great Prototype game from Radical Entertainment/Activision. In fact, many people have negative views on this game, probably because of some repetitive missions and the fact that Alex Mercer is not really depicted as a good guy in general. But many of bad reviews seem to come from those people who do not know how to play games like this.  Now, I am not sure if I can just boldly say that Prototype 2 is any inferior to the prequel. In my honest opinion, Prototype 2 was just as good, if not better. There are many missions that make you infiltrate the facilities and consume people and such (Actually, pretty much most of missions are like that) and I guess people might find this rather boring. But in my opinion, I liked the fact that the game was focusing more on the story, rather than action in general. This, does not mean the game is boring at all.  As for the action part, well, the game is certainly easier than the first Prototype. When the first one makes you get real busy with your controller (or keyboard and mouse), I didn't think the second one was like that in general. But this doesn't mean you can just sit back and relax, you still better buckle down, especially the final boss fight. I kind of do not like how the upgrade system changed in this game....I wish I could just buy whatever the upgrade I want to buy if I can afford like I could in the first one. But well, I wouldn't say this is a deal-breaker.   Overall, fun game. Even though I can not really approve the ending and all, as an action game, it is one heck of a ride.   9.8/10",
            "review_score": "1"
        },
        {
            "review_text": "I cannot play this game, I'm mostly just writing this to let others know that this is a ♥♥♥♥ port. Stay away from this on PC, avoid it like it has the plague. I honestly would love a refund for my money, and time spent trying to fix something that should have already been fixed.  Edit: I did get this to start working with my AMD card, there is a wonderful topic in the discussion board that helped, but that still does not change the fact that I would not recommend buying this on a PC, it crashes frequently, and I've had sound cut out on cutscenes at odd times.  As for the game itself the story is actually pretty decent, the game is more of the same of prototype so it is fun at times, but the combat feels lacking compared to the first one, this is partially due to having two powers out at once now, and one button is used for either power.  Overall I would say it's average for fun, but if you did kind of enjoy the plot of prototype, I did, then this is not a must play immediately but I say an eventually, like you know three years later.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite possibly one of the most broken ports of a game ever released. Great job you sure did it!",
            "review_score": "-1"
        },
        {
            "review_text": "Completely unplayable me, as it locks up almost immediately after starting, even after trying all the possible fixes shared in the forum and elsewhere online. Unfortunately for me, I bought it from Humble, so I can't refund. Everyone who's able to play it seems to love it, but if you're going to take a chance on it, buy it directly from Steam so you can get your money back if it doesn't work.",
            "review_score": "-1"
        },
        {
            "review_text": "I like it, It's fun.",
            "review_score": "1"
        },
        {
            "review_text": "I was happy to get this game at first till I started playing it. First thing I always do before starting a game is go into options. That section of the game was broken right of the bat. I wanted to select screen resolution and check key bindings. None of this was possible. Started the game I quickly found out when it said use left mouse botton only, the right botton worked. Then when the game said to use right button to siphon life and restore health, no button anyplace on the keyboard or mouse worked. The game was stuck. I had to alt + delete to quit the game. Did some google searching and found lots of issues with this game starting with non Nvidia Gfx cards to changeing mouse configurations. Meeting the system requirements fully, this should not happen. So I take my thumbs up on this game back and warn others. This game is not worth buying.",
            "review_score": "-1"
        },
        {
            "review_text": "Prototype 2 is a massive upgrade from Prototype. Smoother gameplay, improved combat, a more organized system of upgrading, and amped up graphics (no more odd looking cars).",
            "review_score": "1"
        },
        {
            "review_text": "To people not familiar with Prototype 1, I recommend it, it's a power fantasy and a lot of fun. There are references to the first game but it's not needed to have a fun time. This game is a Power Fantasy and it does that in spades, you feel powerful. Enjoy. My review below is for people who have played and enjoyed the plot and storyline of the original Prototype.   To fans of the original Prototype, this game is about the same. It's a big more organized, with a bit more work put into it. But it has the same progression and feels very much like you are just playing the original Prototype with a few extras added in. If you feel a 'Prototype itch' this may be a decent game to pick up if it was heavily discounted, but I generally do not recommend this game. I do not recommend it because the completion of this game left a bad taste in my mouth. I enjoyed the original Protoype, and loved the story and the plot. But this game throws it all away. Because (Spoilers)    Alex Mercer, the original protagonist, is rewritten as a batshit crazy idiot-ball carrying villian who actively pursues the very thing you fought to stop in the original game. Which, as someone who played the first Prototype who enjoyed and got to understand the complex personality of Alex Mercer, I find to be a complete cop-out, and this just thoroughly destroyed my enjoyment of the Prototype franchise.   ",
            "review_score": "-1"
        },
        {
            "review_text": "This game doesn't load for me",
            "review_score": "1"
        },
        {
            "review_text": "If you ever want to play a single player game then this is it! Its GTA on drugs!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Common issues that cause the game to not run in Windows 7 that were never fixed. There is no support; I do not recommend purchasing this game as there is a 50% chance it will crash upon startup on your system.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game it is a total waste of money.It will not run and if it does it will stay between 5 - 25 fps.And the amount of trouble shooting to get it just to run at 30 fps is not worth it",
            "review_score": "-1"
        },
        {
            "review_text": "Jump twenty metres into the air, and kick a civilian in the face with such power that they die. Proceed to grab a truck, and throw it at more civilians. Make tendrils come out of arms, grabbing and killing more civilians. The hours stretch. More civilians die. By the time you have finished the game, you are questioning your sanity and you will realise your true blood lust. This game will turn you into a psychopathic murderer.  69/10",
            "review_score": "1"
        },
        {
            "review_text": "very good game to play meanwhile you are waiting for dota actulization",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun when it works. Unfortunately, it needed to be tested against AMD hardware, and wasn't. Also it has received virtually zero support from the publisher or developers. It has a known memory leak that causes it to crash after some period of play, issues with resolution, and unpredictable framerates.  However, the game itself is pretty cool. I enjoyed playing it, as much as I was able to. It's unfortunate that it wasn't handled better. Maybe someday it'll be patched, but I don't expect it.",
            "review_score": "-1"
        },
        {
            "review_text": "they should really fix the lag in the game",
            "review_score": "1"
        },
        {
            "review_text": " CAUTION:  I've played this game on my PS3 and it had a very fun storyline, so once I saw it at a bargain price during the 2015 Summer Sale I decided to purchase it to relive a very great game. However, I was wrong. I'm running above recommended PC specifications and I'm struggling to get a solid 20FPS on ultra low. After reading through a few other reviews it seems that a lot of other users are experiencing issues as well; namely AMD systems.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all let me start off this review by stating the the game shipped broken and was never fixed. It always had a bad memory leak and certain missions would cause it to crash. But now since the Omega Drivers release from AMD and the subsequent upgrade to Windows 10 it is time to remove this game from Steam.  The game is completely broken. Under Win 8.1 and the AMD 14.2 drivers you could mostly play until the memory leak ended your fun. If you decide to run an older OS and even older drivers, you can have fun in the game. Really it's not a bad game and at times is quite fun! On a scale of 1 - 100 I would give it a solid 65 with the memory leak lowering the score to 57.  Under Windows 10 the game will actually start, but then the memory leak ends the fun after 5 minutes. Everyone is going to upgrade to Windows 10 for DX12 games. Thus this game is completely dead.  Please Valve remove this game from the Steam Store. There is no reason to leave abandoned games on your storefront. I wish Activision had allowed the original development team to patch the game, but alas that's the current state of PC development I suppose. Release, promote, and run.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game, it crashes every 30-60 with newer graphics cards. Avoid at all costs.",
            "review_score": "-1"
        },
        {
            "review_text": "Game crashes on launch. There is no known fix that works for me and this product is useless. This shouldn't even be for sale, ESPECIALLY at $40.",
            "review_score": "-1"
        },
        {
            "review_text": "I think they could have made the evolving system similar to the first but considering everthing else it was a realy great game.",
            "review_score": "1"
        },
        {
            "review_text": "Although I found this game to be repetitive and the story line was shallow, there were some interesting gameplay aspects and the controls were mostly smooth and intuitive. By now the visuals are dated and not spectacular. But the ability to feel like a powerful being able to take down helicopters was fun. I would recommend this game at a discount price.",
            "review_score": "1"
        },
        {
            "review_text": "Mayhem is the name of the game and you have just the tools for the job. You won't get much more than 20 hours out of this - much less if you just aim for completing the main story - but you will get plenty of fun out of it. And its one of the easiest games to get all achievements in.",
            "review_score": "1"
        },
        {
            "review_text": "Well I've played just about 10 minutes of this and looks great and all. Runs smooth for me (50+ FPS) on a GTX 660 2GB Card with 12 GB of ram on a 4 Core AMD. So for that, it's great but my problem is that I'm a PC gamer that enjoys playing with a Mouse and Keyboard and well, this game does not give 2 farts about my mouse or any mouse I use. Mouse simply does not work at all. No detection. So I am left to use a controller which works fine. But it's not really my thing. Will still play the game cause I freakin' paid for it and the story looks good and general gameplay looks fun.  TL;DR: Don't buy this if you don't have a controller. Mouse won't work or will be buggy.  Will Update when more into the game.",
            "review_score": "-1"
        },
        {
            "review_text": "P1 is ♥♥♥♥, this one however is awesome, no problems whatsoever. Only people with AMD graphic cards will dislike it. So if you are using Nvidia you should definitely buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game.. a really bloody free-running game, and i really like the upgrades for Heller, the only bone i have to pick about this game is how idiotic the zombies act, like really? my ♥♥♥♥ing Grandmother can ♥♥♥♥ing walk faster and do stuff faster then those zombies! If i where to say the best part of prototype 2 it would be the boss battle, prototype 1's boss'es like:' Meh, it still tests your skills and what you've learned.' But NOOO they have to go along and put the ♥♥♥♥ing main charactor from Prototype 1 and make him a boss! All in all, this game is ♥♥♥♥ing amazing, and better if you got the game for 10$ like me!",
            "review_score": "1"
        },
        {
            "review_text": "what a game. just disconnect your keyboard if it doesnt work",
            "review_score": "1"
        },
        {
            "review_text": "Literraly Unplayable, Refunded straight away. Don't buy this piece of ♥♥♥♥ lol.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game if you want to relax, cause some mayhem, kill some mutants or humans. Also a good story, great game mechanics.  WARNING!!! This game may crash on startup or lag while playing. I managed to fix it by changing the language into russian. Just buy this game trough steam and if it won't launch or if it will lag then just ask for refund.",
            "review_score": "1"
        },
        {
            "review_text": "Just Don't. Serious frame rate issues that noone bothered to ever fix. If you need to have a Prototype game on your PC buy the first. At least the uninstall button works",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like it. I want to love it. But I can't. It stutters and stammers and is un-playable. =*(",
            "review_score": "-1"
        },
        {
            "review_text": "Can't recommend this, unfortunately. After installing, I first had to spend about 1,5 hours trying to get the game to run beyond the intro (which was, admittedly, awesome). I finally managed to solve the problem with help from others in the forums and eagerly sat down to play.  I uninstalled the game after 45 minutes of play time.   I loved the original Prototype because of the way that its story was told and because the factions involved (Blackwatch specifically) were interesting. Not dog-kickingly evil, but clearly not nice, either - just trying to prevent the spread. The gameplay was lots of fun too, but that wasn't what led me to get Prototype 2. If you are all about the gameplay, this review might not apply to you.  In the short span of time I played, I was dismayed to find that the interesting-seeming protagonist was, in fact, a violent and stupid thug with no redeeming qualities, easily led and manipulated. The game's villain was apparent right from the start and was all but moustache-twirlingly evil. Blackwatch appears to have become an organization of deathly stupid dog-kicking nazis who (minor spoiler) release infected into 'test areas' apparently just for the fun of it.   The open-world gameplay didn't work for me either; I found the city area cluttered and overly full. The new look works and it makes sense to have people sleeping rough etc., but I missed the clear lines of the first game. The control change for gliding and airdash REALLY annoyed me as well, especially as I had replayed the entire first game and scored platinum on all movement events for the fun of it just before starting the second. I loved the way movement flowed in the first game and it just seemed completely unnecessary to change it in the second.   Some of the mechanics seemed promising (consuming specific evolved to gain certain powers, etc.), but all in all, the cartoonish 'villains' and idiot unsympathetic protagonist killed this game for me very quickly. What a shame.",
            "review_score": "-1"
        },
        {
            "review_text": "Game Breaking bug within the first half hour of the game. Still haven't found a way to fix it and lots of other people on Steam forums are having the issue as well.",
            "review_score": "-1"
        },
        {
            "review_text": "Boss battles are ♥♥♥♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "I just want to play this game without the lag or crashes i know there not going to fix it but if there is anyway that someone could create a patch for this it would be well worth it, i dont see why they gave no ♥♥♥♥s about this game and its franchise as both are extremely enjoyable its a real shame :/",
            "review_score": "-1"
        },
        {
            "review_text": "The worst PC port I have ever experienced. My computer is well within their specifications but the game can barely do 20 FPS at lowest settings, or at any settings really, since this game seems to have an innovative new feature where it LAGS FOR NO ♥♥♥♥ING REASON.  Activision is one of the cancers on gaming, with ridiculous regional pricing, ♥♥♥♥♥♥ rushed games and absolutley attrocious PC ports. Even if this game works fine for you, you'd do best to remember that you gave this ♥♥♥♥-stain the money they need to continue being ♥♥♥♥-stains. I sure do every time I see prototype 2 in my libary.",
            "review_score": "-1"
        },
        {
            "review_text": "Enjoy this buggy port that taught me to never pre purchase a game again.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite buggy, pitty because it's a nice game when it is not crashing",
            "review_score": "-1"
        },
        {
            "review_text": "would be good if it worked, stupid port......",
            "review_score": "-1"
        },
        {
            "review_text": "Welp it been an hour of me trying to fix this crap console port and i've had no luck. The fps at the best of times is 20 which is awful for Pc gamers, this game is broken dont get it!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is unplayable in its current form, and I don't think it will ever be fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "When mission that require you Press Q to search some idiot and this game started annoying me.",
            "review_score": "-1"
        },
        {
            "review_text": "I would've enjoyed this had in not crashed and failed whenever I wanted to play it. Buggy, rubish and a waste of £5..",
            "review_score": "-1"
        },
        {
            "review_text": "This game is pretty bad.",
            "review_score": "-1"
        },
        {
            "review_text": "high end amd/radeon card makes unplayable, too much hastle to get a possible fix, recommend against buying if u own amd components. too old so they will never fix it.",
            "review_score": "-1"
        },
        {
            "review_text": "This must be the most bugged out game I have ever played. Worst even, I can't play the game anymore because of the fact that I own a Radeon card or because the GFX card support in generic by this game is so poor that the game crashes no matter what card you have. If you are considering buying this game... don't.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a weird one. For most people it's OK, but some ahve horrendous issues with this game. It's a damn great game, even with my scepticism I was pleasantly surprised, but the port is meh.   If you can check if it works properly on your system, and it does, BUY IT! It's worth the full price.",
            "review_score": "1"
        },
        {
            "review_text": "  love this game but should have updated ",
            "review_score": "1"
        },
        {
            "review_text": "AMD Hater.... If You have AMD - forget plalying it on decent framerate... If not - the game is good, flying around and kicking shieeet out of everyone is nice.",
            "review_score": "1"
        },
        {
            "review_text": "lovely and great game after frist one , this one is so great and highly recommend to get and play . never seen like this before , shapeshifting and open world game .",
            "review_score": "1"
        },
        {
            "review_text": "This game kicks me out after 40 minutes of gametime, and I have NO idea how to fix it. Studio is shut down, and there are no plans on fixing that problem.  This is a permanently broken game don't buy it",
            "review_score": "-1"
        },
        {
            "review_text": "gta on steroids, 10/10 would throw car again",
            "review_score": "1"
        },
        {
            "review_text": "Think twice before buying, it most likely won't work, it'll just crash on startup. Do some research before buying.",
            "review_score": "-1"
        },
        {
            "review_text": "Many complaining that this is a bad port etc... Compared to many other ports this one is frekkin awsome, imho one of the better ones. Max settings, no lag, nice controls, no problem. Guessing It's ♥♥♥♥♥♥ computers or/and crap behind the keyboard at play here.  As for the game I prefere Prototype 1, can't say why, i just do, it had another feel to it. With that said this is still a really nice game with many fun elements in it. And i do recommend it to ppl that liked Prototype 1 or hack n slash in general.  Is it worth 30€? Few games are as i see it, but a 3 year old game? no and no,,shame on you.! Pick it up on a sale, unless you reheeally want to play it now. ",
            "review_score": "1"
        },
        {
            "review_text": "I LIKE THIS GAME BECAUSE THE STORY IS AMAZING",
            "review_score": "1"
        },
        {
            "review_text": "Love the story, love the concept but would NOT recommend this game.   I have an ok gaming rig with 16gb ram but have the misfortune of owning an ATI 5750HD video adapter which apparently is part of the reason my framerate drops every 30 minutes of gameplay (or everytime there is an epic battle).   From what I can gather the PC version seems flawed and I am not happy having forked out money for something that I need to restart all the time.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy it unless you know you can play it. My computer exceeds all requirements but I have windows 10 now... So I guess that means it won't work even if you run it in compatibility mode. And yes I tried all the other 'fixes' like unplugging all USB stuff and all that. Doesn't work. It used to. That's how I've got three hours on it. But now it just doesn't work and I can't get a refund...",
            "review_score": "-1"
        },
        {
            "review_text": "There is a lot of positive things to say about this, and I love this game but there needs to be a option for contrller support",
            "review_score": "1"
        },
        {
            "review_text": "I forgot how to spell \\' operational \\'.",
            "review_score": "-1"
        },
        {
            "review_text": "COMPLETED 100%  Prototype 2 quite feels like a dumbed down version of Prototype 1 and is impeded by a lack of challenge in both enemies and gameplay structure.  The story is pretty straightforward in this sequel and really nothing to be excited about. As advertised, you play as Venom... I mean Heller this time. A former marine who gets powers from the MC of the first game, Mercer. Eventually they both clash when Heller realizes who the real bad guy is. And that's pretty much how the game boils down to. Missions have taken a step backwards as disguising plays a more important role and you'll find yourself infiltrating enemy bases far more often. It could have been a good thing, if not for the fact that the devs doesnt seem to put much effort into this. The stealth aspect in this game is honestly, laughable. Marred by incredibly dumb AI that's beyond ridiculous. Soldiers see you flying in the air? Jump 100 feet in the air and drop right down? Nope, nothing out of the ordinary. See the infamous James Heller walking right in front of their face? Nope, they just see you as a regular civilian. But do something as small as jump over a table or hop over a comrade? Everyone suddenly goes into red alert.  You don't even to silently consume people if you don't want to. Just grab the guy, consume him, jump over a fence, transform, jump back into the base 10 seconds later and everyone acts like nothing happened at all! The world of P2 is fairly large but is now divided into three separate areas: Red, Yellow, and Green Zone. Each having a different nature and scale of infestation, thus providing for some fresh scenes for free roaming. On the other hand there's only 3 kinds of interiors you'll ever enter in the entire game, and that's military bases, labs and infested lairs. Most of which are just copy+paste in appearance. Missions are where the game tends to get slightly repetitive, particularly in side missions. Find this, kill that, find that, destroy this. There's not much variety in what you do apart from causing destruction and mayhem everywhere you go. That's where the action comes in; it's still fun slicing up enemies and covering the streets in blood and gore. But it's too simple, because the game is that easy. Even worse, you have significantly less attack moves and powers to use, as compared to what the first game offered, which is another disappointment. Prototype 2 suffers terribly from many shortcomings but is still the same old enjoyable fun you can get for an open world title. Sadly not much of an improvement from the first game, if not, at all.  PROS: - The Red Zone is pretty awesome in scale and magnitude - Venom/Carnage simulator - Blood. So much blood and gore. And explosions. Lovely.  CONS: - A few power moves stripped down or removed from the first game - The same old Manhatten open world is nothing new - Sh*t AI stealth mechanics; escaping from an alarm or strike team is like a walk in the park - Too easy to beat - Game is very badly optimized for AMD cards. Forced enable mouse acceleration is another pain in the ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "quit thinkign ur a c00kie baker gai persin and telling meh wen and how i can baek mai 1337 cookies assh0l3",
            "review_score": "1"
        },
        {
            "review_text": "Good OPEN WORLD game 89/100 - some minimal glitches",
            "review_score": "1"
        },
        {
            "review_text": "Prototype 2 is an especially good action game where you play the role of sergeant Heller with lethal surpernatural shape-shifting abilities given by Alex Mercer. During the game Heller wants her daughter back and to stop Balckwatch and Mercer from destroying New York. Missions are excellent and contain a lot of fight against Mercer's creatures and Blackwatch elite troopers. You can consume almost everybody to gain health and to obtin memories that help you to understand better the story. In the city you can find collectibles to be found and liars to be cleared for mutators as a reward. Mutators give you superpowers and you can earn XP points by completing missions. As you level up you can open and obtain upgrades that make Heller more deadlier and give you advantage during the gameplay. The game ends with an epic fight against your creator, Alex Mercer. Prototype 2 has the 'Radnet Access' pack dlc that gives you 5 unique abilities and 50+ challenges to complete. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I cannot get past the opening ♥♥♥♥ing mission! as he is running away from the 'thing with the concrete arm' my game keeps crashing, there are NO fixes and it lags like ♥♥♥♥, there is no way in hell this game is worth 20 quid!",
            "review_score": "-1"
        },
        {
            "review_text": "I really do not recomennd buying this game. I have a computer where i can play most games on highest resolution etc but even if I set all the settings to worst still there are so many bugs that the game is totally unplayable. After every cutscene the game stops and i have to kill its process. I already did some research but it is not possible to fix this. Thanks Activision for giving me a game that doesn't even work and not patching it. I regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all this is not a review of the game but rather the fact that it runs so poorly on my Windforce AMD R9 270X 4GB Battlefield edditon, that I actually thought I was going to have to replace the card. This was until I stumbled upon Forums complaining about poor performance on AMD cards  What makes me angry about this game is the fact that it is so poorly optimised, My £200 Graphics card plays battlefield on ultra @1080p also Bioshock infinite @ 1080p both at reasonable frame rates. But the idea that I have to go tweaking settings to make this game play at 30frames per second is crazy.  Maybe those of you with Nvidia Cards will have better luck  ",
            "review_score": "-1"
        },
        {
            "review_text": "I do not recommend this game if you enjoyed the first one. The plot seems to be a cobbled together rationalization for why there should be another 'Alex Mercer' and the combat has actually been dumbed down from the first game. Yes, it's even simpler, just one button to attack. Forget combos, it's just mash X, press A, mash X.  While in the previous game you obtained your powers and upgrades through simply playing the game, more emphasis is now put on playing the mini-games which completely break immersion in the already weak story.  If you enjoy playing mini-games and searches for collectibles then you will enjoy this game. If you enjoy open sand boxes that you can just run around in and cause general mayhem then you will have fun. If you are looking for a good story, then look for another game in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "So basically to sum everything up: I LOVED the first game and I gave the second one a try a long time ago. I tried to run it on my old PC and managed to get like 15 minutes into the game and after that there was no fix for the constant crash. So after purchasing a brand new PC last year I though i might give it another shot. More than 20 different fixes tried in various combinations and it's a mess.  I can't play further than the first 2 minutes of the prologue. And it doesn't even save a single time, so I had to start over and over again. And now I am at the same Point i was the last time i tried to make it work. SCREW IT!!!  I spent the last 11 hrs trying everything to make this game playable. A refund is not possible. It wasn't after I purchased it and it is not now. Steam is unfortunately supporting developers who sell broken code for a ton of money to naive customers just because they want more of your money.  I like steam but WTF? This can't be real. Why is this game even still up on the market? It violates everything I know and yet steam has the only marketplace on this planet where broken stuff is being sold as brand new without refunds possible!  And to the develpers (or rather Activision, since they propably put development on rest): Shame on you! This is something a company of your size shouldn't be doing! Grow a pair and put someone back on the job to fix the issues! But i know you won't since it still pays you off without needing to make it work properly!",
            "review_score": "-1"
        },
        {
            "review_text": "Cant even run it, crashes on start.",
            "review_score": "-1"
        },
        {
            "review_text": "Refunded game after it did not start up for atleast 30mins and cba cba cba cba cba",
            "review_score": "-1"
        },
        {
            "review_text": "Its the 2nd Prototype and clearly they need a 3rd one cause this was dogshit too",
            "review_score": "-1"
        },
        {
            "review_text": "Runs horrible on Pc. I have a decent computer that runs all of my games just fine, but this game lags to ♥♥♥♥ every five or ten minutes and crashes about every half hour. The game itself is okay. The story is boring and the powers arer kind of fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Everything is great until you come to the running side missions, as a common type of mini game, you have to run to collect packages, with each package collected extending ur time. While these seems normal, theexact amount of time you have and amount of time you get for collecting each package is just enough to get you to the end. Which means, if you acidenly go the wrong way, don't bother trying to fix your directon, just restart, since like I said before you have 'just about enough' time. While this may seems like a minor annoyance, it seems the game devs loved to include this as a side mission, so I have to keep on doing these mission in order to gain perks. I think of them as hard as nails platform level, since if you make one mistake, it doesnt make sense to continue, you may as well just restart. Other than this, the game is epic, just fix this probelm game devs, and ill gladly give this game a thumbs up. (Also, dealing with rockets while trying to climb a building is impossible, if you try to block the missles, you fall, if you get hit, you fall, if u try to avoid them, you can't, leading to an almost impossible game of luck, not skill).  Oh and also, can you disable the automatic manuver that happens if heller runs off the edge of a building (he throws himself off sideways). If you hit space 1 milisecond too late, he does this, and I have no clue what this manuver is useful for, when i go off a building, I either want to glide, or fall straight down. This stupid animation, stops heller from gliding for 2 seconds, by which time, you have lost a considerable amount of height, or you have hit the ground. In the side missions when you have to run from package to package, this single animation has made me have to restart a single running mission more than 50 times (it got to the point I started counted my restarts). There is not use for this animation, and all it does it makes a normal challenge into a touch as nails platformer like challenge, which if I wanted that, I would have turned the game onto hard, but im just playing on normal, so can enjoy the game and the story. This animation is almost like Heller deciding to take control rather than the player controlling him and unless it is a cutscene, I should be the one controlling heller.)",
            "review_score": "1"
        },
        {
            "review_text": "It keeps crashing after like 10 minutes of game play. Since autosave feature you are stuck to same mission forever.",
            "review_score": "-1"
        },
        {
            "review_text": "Another great prototype game, first one was good, this one was just as good, The story, characters etc were all fantastic, game play itself repeats after some time but still enjoyable until the end.",
            "review_score": "1"
        },
        {
            "review_text": "There is a REALLY HIGH CHANCE that this game wont run on pc. Don't buy it unless u're ok with wasting your money.",
            "review_score": "-1"
        },
        {
            "review_text": "It'll try to keep my review short this time. Combat i fun and seems varied but gets repetetive and unchallenging later on. The world is smaller and less interesting than previously. The rpg aspect is limited at best, and annoyingly it's impossible to fully develop your chracter in one playthrough. The main chracter is a huge ♥♥♥&amp;hole. Really, really a hatefull jerk. The daughter and family parts don't match the character you play and seem like they were added last minute to make him more likable, they do not. Seeing that that didn't work the makers of the game apparently decided to make Heller seem less like a collossall deuche, by making all enemies into even bigger ♥♥♥^holes. This i consider a cheap move which ruins any story. This is best shown in Mercer, who is out of nowhere a psychopath. I was most angered by that, as i liked him in P1. So yeah good going, P2 story team.  All in all, Prototype is a good for a bit of combat, but not much else. I don't recommend it. Even if it is on sale, there are better games for you to play.",
            "review_score": "-1"
        },
        {
            "review_text": "meh. beat the whole thing in 18 hours ",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to give this game a chance, but when you try to move with 2-10 fps at the lowest settings, it becomes very difficult. It could've been good, but the fps was the main deterrent for me.",
            "review_score": "-1"
        },
        {
            "review_text": "nice superpower gta kind of game",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game and worth playing till the end, zero replayability though, so grab it on sale if you can.",
            "review_score": "1"
        },
        {
            "review_text": "Worth every Penny, Vastly superior to the first game in every way, smooth movement, brilliant controls, a fine story and graphics that ♥♥♥♥ on almost every other game of its genre, plenty of space to run around in and plenty to do, hard to find in games these days.",
            "review_score": "1"
        },
        {
            "review_text": "Prototype two was a good hack n slash. The graphics were nice and the animation was fluid. The part I liked best was the open sandbox world which could be explored and I could just start mayhem at any given time. The enemy gradually becomes stronger as the game goes on and it's interesting to watch how the city deteriates through gameplay.  Another cool thing is that I didn't need to play the first one to understand number 2. They even have optional recap you can watch about the previous game, but Prototype 2 has it's own story that doesn't really depend on the first.   Challenge mode was fun too, I found myself spending a good hour on one challenge trying to achieve a gold award.   I didn't finish this game though, perhaps I will later. I ended up losing interest after about 12 hours of gameplay because the story isn't really that in depth. You can tell they tried though, just not a lot of meat to the storyline so to speak and running around brutally murdering crowds of people gets old after awhile.   Overall I give this game 6 out of 10 MF Falco's.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, just started playing today and really am enjoying it!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game ive put in alot of hours and i come back to it when im bored, just a bunch of mindless fun easy to play but not too simple give it a shot if you've never played it before thaty is if you like large doses of carnage.",
            "review_score": "1"
        },
        {
            "review_text": "Had to change my review after countless hours trying to get it to work with an apparently common issue freezing on loading screens. Solid game. Felt a little stiff and old for my tastes but good overall. Kinda meh.",
            "review_score": "1"
        },
        {
            "review_text": "Surprised how much fun this was. I didn't finish GTA4, but I wanted to finish this, if that tells you anything. Be advised it contains tons of blood, gore and tendrily-bits.",
            "review_score": "1"
        },
        {
            "review_text": "consumes a body of a woman carrys on walking then suddenly turns into a monster with claws this game is brilliant superb fantastic i love it i actually play this on low settings too but dont give 2 ♥♥♥♥s even the lags and its great wish i had a better computer.",
            "review_score": "1"
        },
        {
            "review_text": "If you like sandbox games then you'll love this as it is so addictive.  The first Prototype was fun but ultimately repetitive such that I got bored of it less than half-way through. This sequel takes everything that was enjoyable about the original game, i.e. the cool power-ups and mayhem you could cause with them, but manages to maintain the interest for much longer, thanks to constant rewards and more variety in the missions. Add in Challenge modes and collectibles and you have one fun game that might not win many Game of the Year awards come the turn of 2012 but will definitely be one of your favourites nevertheless. I guarantee it.  Graphics are an improvement on the PS2-era visuals of the original and the engine does a fine job of handling dozens of enemies and explosions on the screen at once. I especially love the way that the game shows a scene from the game running behind the main menu and as soon as you select Continue it jumps straight into the game... no loading at all!",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Went around a city wreaking havoc everywhere  10/10 would wreak havoc again",
            "review_score": "1"
        },
        {
            "review_text": "I had fun with this game once i was able to progress past that certain point at the very beginning",
            "review_score": "1"
        },
        {
            "review_text": "Not much in the way of improvements over the original, but a nice cohesive continuation to the story from the first.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished it, awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "I found this game, while deeply enjoyable, to be not quite as good as the original, and I'm having trouble figuring out why. The characters are more interesting, the gameplay is more intuitive, the visual asthetic delivers the feel of a city truly experiencing a disaster of this level where the first game failed in that regard. I suppose that my real problem is that Heller feels invincible, while Mercer felt very vulnerable in the first - and he survived a nuclear warhead from a few meters away. The sandbox is smaller, the new enemies feel a little tacked on, and none of the bosses really inspire that gut wrenching terror that you got in the original Prototype (none of them made me want to toss my computer out the window either, and the first game definately brought me to that precipice).  All in all, it really delivers a long, fulfilling and well rounded experience. Oh yeah, and you can rip a tank in half with your bare hands if you level your character right.",
            "review_score": "1"
        },
        {
            "review_text": "quite a lot shorter than the first game, but all around good choice for your money if you can get it for 75% off. 30euros/dollar i too much for this game considering it took me 14,5hours to complete all sidequest and the main game.",
            "review_score": "1"
        },
        {
            "review_text": "Become the ultimate shape-shifting weapon!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, when you sad, u can play PROTOTYPE 2 and kill everyone, but i can get 1 achievment.",
            "review_score": "1"
        },
        {
            "review_text": "I've played the hell out of this on the Xbox 360. If you want to play a game which is so fun to play, and easy to get a hang of, get it.",
            "review_score": "1"
        },
        {
            "review_text": "Improves on the first game in every way possible. Better story. Better balance of gameplay. It's just more fun and focused. The only realy downside is the lack of variety for indoor missions. Every Lair and Base looks exactly the same, which is disappointing but not a huge deal breaker. If you liked the first, you should play this. It's more of the same, sure, but it's even more fun.",
            "review_score": "1"
        },
        {
            "review_text": "Just for the record, when it works, this game is really good. For people not knowing what to expect, this is what Volition tried to do with Saints Row 4 (movement-wise). But still, dont buy it. I got it to run after approx. 4-5 hours of work on my old Laptop. That one had a Nvidia Card, but since I got my new rig with the R9 280x, it runs on a constant 4-5 fps. Tweaking doesn't change anything of this, I tried several times. None of the (unofficial) Patches I used helped, so, even if I had some hours of good fun with this game, I don't recommend buying it, since Activision doesn't give a flying ♥♥♥♥ about this game and its community.",
            "review_score": "-1"
        },
        {
            "review_text": "WARNING!!!  No AMD/ATI GPUs Support  ABANDONED BY DEVS ... unless you fix it yourself",
            "review_score": "-1"
        },
        {
            "review_text": "Unable to finish game to do freezing at cutscene. I forget which. It's not even that far in. Running Windows 10.",
            "review_score": "-1"
        },
        {
            "review_text": "i7 4790k overclocked @ 4.8ghz, nvidia 980ti, 16gb of ram and the game crashes when I start it up... this game doesn't only have issues with AMD but also nvidia even when you're way above the recommended specs. It's a shame that this is utter garbage since I was really looking forward to it.... even bought that DLC, glad steam does refunds though.  After some research I think I might've hit the problem, this game DOES NOT work on versions after windows 7.... so win10 users like me here would've gotten ripped off if it weren't for the refund system.",
            "review_score": "-1"
        },
        {
            "review_text": "extreamly fun and entertaining",
            "review_score": "1"
        },
        {
            "review_text": "A really good game if you want to feel like a wrecking ball and destroying everything in your path. Awesome way to blow off steam, lots of fun! It's hugely underrated though.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the first, but still a lot of fun. The lack of morality system is a refreshing change from most RPGs these days. Graphics are better, but the main character isn't as interesting (think Rico from Killzone) and i don't like that you have to fight Alex from the first game and still learn nothing about Pariah (aside from a single hint in one memory cutscene). You also have a lot less upgrades to get, which makes it less fun, although dual-wielding your bioweapons is neat and bio-bombing people is fun. Worth playing, but the first was better.",
            "review_score": "1"
        },
        {
            "review_text": "that game is good overall but is there anywaymu can fix it for me i payed for it and downloaded it and i double clicked it , it said running then it disappeared and the result in 10 mins of waitin was nothing anyways im still giving it a thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "Beating the ♥♥♥♥ out of gross demon-looking ♥♥♥♥♥s is exactly as fun as it sounds!",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious. I fight cars with other cars.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, the glitch with operation fire hawk in the beginning was annoying, but the rest of the game was awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Not quite a spectacle fighter but a LOT of fun. Does not have the replay value of something like Batman: Arkham City. Requires the DLC to get enough playtime, though. Wait for a -25% or -50% sale so you can get the whole package.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the first, you will enjoy the 2nd.",
            "review_score": "1"
        },
        {
            "review_text": "The ending is not about stopping the virus of infections, it carries on. The focus is on alex mercer, and.... his friends. ^.^  10/10 regardless! 8/10 for lack of fashion for npcs in the green zone :p",
            "review_score": "1"
        },
        {
            "review_text": "it plays well, however there are to many controls for my taste.",
            "review_score": "1"
        },
        {
            "review_text": "the two major flaws in the first prototype were the glitchy stuttery cutscenes (even on high end gaming computers there was no way to generate enough FPS to get it smooth) and the tendency to just throw crap on the screen to make a challenge more difficult improved graphics, improved gameplay, cutscenes play correctly the major flaws of the original release have been addressed and other than the occasional NPC stuck in a wall i havent seen much glitching.   glad this game finally went on sale as $39.99 for a discontinued title from a shuttered publisher was pretty steep. the new abilities are fun, and the story seems pretty interesting. i havent finished the game but it looks like our hero from the first episode might be doing a heel turn in the prototype 2.   unless the second half of the game is just an unmitigated disaster i would recommend this as a fun hack and slash wreckage and destruction title! buy it on sale though, its not a $40 game. its just a shame there isnt going to be a part 3 since the publisher went under.",
            "review_score": "1"
        },
        {
            "review_text": "i recommed this game. the only thing i am hoping to get fixed is the lag while im playing. i dont know if its my operating system(windows 8) or what. any help would be great.",
            "review_score": "1"
        },
        {
            "review_text": "developed graphic, increased map, added sub quest But, downgraded freedom",
            "review_score": "1"
        },
        {
            "review_text": "I was a fan of the first and had been waiting to get this one. So happy I picked it up. I was surprised by the turn this story took, but it makes me very curious (and anxious for) a thrird one.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Step Up from Prototype 1 with fancy new features!",
            "review_score": "1"
        },
        {
            "review_text": "Good continuation of the prequel's story, also includes a recap. Still an open-world stealth and action mix, the gameplay ist exactly like the first part, but challenges seem a bit more forgiving this time. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Wow I loved this game. I really enjoyed the first one also. I think this is one definitely the better one. The combat is improved 100% by the new shield ability. It’s great fun open world superpower action. The story is interesting enough to keep your attention. The enemies are varied and all fun to fight. It is a console port but personally I think it is quite a good one, with one exception. The game has a really bad memory leak with a constantly increased amount of memory being used. This is simply fixed by alt-tabbing out of the game every 20 min or so. Overall I would recommend to nearly anyone, especially if you played the first prototype.",
            "review_score": "1"
        },
        {
            "review_text": "This game was very motivational for me to play over and over. Despite everyone's disappointment in killing Mercer, it didn't afftect/bother me much because I got to play the skin of Mercer through the campaign with all upgrades. I felt.... invincible! Very fun to play I reccommend it to anyone!",
            "review_score": "1"
        },
        {
            "review_text": "So much ruthlessness and gory mayhem. If your out for something Gory id say this fits pretty well.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game - I never get tired of ripping a tanks turret off and then smashing the tank with it. Definately recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Really very fun game, best played with a controller. Feel incredible leaping up buildings and consuming your enemies/throwing cars into the sea. Horrible console port which makes the game stutter from time to time, but deal with it in order to play this amazingly fast, action-packed gem.",
            "review_score": "1"
        },
        {
            "review_text": "It's a solid follow up to Prototype. Bought it for under $10 and it's well worth the money. The graphics are improved and the controls are a little better but the story is lacking, very typical 'tough guy' protagonist. However if your a fan of Prototype I say get when its on sale, its a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "its an awesome game !!   hmm like the graphics bit of an upgrade from the first one   mission wise but challenging if u ask me :D  still good fun just killing everyone XD  recommend this if ur a psycho killer",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game and definately worth the purchase",
            "review_score": "1"
        },
        {
            "review_text": "it wont get past the the inital loading thing just freezes while i recommend it i am ♥♥♥♥♥♥ it stoped working",
            "review_score": "1"
        },
        {
            "review_text": "something is wrong with the ♥♥♥♥♥♥♥♥ game!!! it just keeps lagging,lagging and lagging!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Prototype 2 is a free roam hack n slash adventure revolving around the story of Sgt. James Heller who was turned into what's known as an 'Evolved' by Prototype 1's protagonist, Alex Mercer. As you progress through the game, Heller learns of the horrors that Mercer has wished to cause, ultimately having a plan for the whole of humanity with malicious intent.  Apart from the story, the game is honestly relatively the same as that of Prototype. The only differences being that Heller has a fifth power known as Tendrils and has the ability to summon Brawlers (a medium-sized infected monster) varying between 2-4 to aid him in combat. The game itself offers only a scant amount of enemy variety from that of the first game, adding in only four new enemies, Juggernauts, Goliaths, Flyers (can't remember if they have an actual codename or if that is their actual codename, but they're pretty much just infected birds), and Evolved.  When Evolved were introduced as an enemy in the game, I myself was personally excited. 'To be fighting against those with similar powers to mine, damn what a refreshing experience!' Unfortunately, I was only like that for the first few Evolved units I fought. After the third one went down, I realized that they all had the same attack pattern, same dodge and attack qte, and generally the same weapon types. There were only a few times where evolved were different, and that was when you encountered Evolved with the Pack Leader and Whipfist abilities, to which you simply beat their face in and consumed them promptly, attaing their respective powers. The fact that they didn't give any extra variety to these guys was staggering, and honestly kinda saddening. I would have loved to have fought off Evolved trying to slice me up to bits with Claws or the Blade power, or dodge out of the way when an Evolved would try to pummle me with Hammerfist. Unfortunately, everyone had little bitty sword hands. It may have been stated at some point that others don't have the ability to maintain advanced forms due to their genetic make-up, but at least give us some different forms of combat.  Aside from the bad enemy variety, everything else was alright. The story developed in a good Prototype fashion, there are collectibles and side missions aplenty, and a new perk system that allowed the player to have more variety with how they went about playing their James Heller.   If you aren't a hardcore Protoype fan but are a fan of hack n slash games, I'd suggest waiting for this game to go on sale for $10 maybe $15. The game offers a decent 10 hour single-player experience (this of course means not collecting everything) and is an alright grab for a low price.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, better than first one in gameplay and mechanics. If you enjoyed first game you will love this one.   I bought both games in a pack and played throught the first one to know the story, 4h forced myself playing it. For now I played this game 20h and I want more (Insane NG+ planned)   One big setback is a story that looks like it was shortened by force, I feel like the ending should be totally different.",
            "review_score": "1"
        },
        {
            "review_text": "Ignore the script, skip the movies, if you get stuck during the tutorial look online for the 'affinity fix'. Once you do all that enjoy destroying a city.",
            "review_score": "1"
        },
        {
            "review_text": "I loved the first Prototype, I even bought Prototype 2's collector's edition for Xbox 360. It's sitting on a shelf above my head right now. This is a fun game, no doubt about that. Once you actually gain all your powers, you start to feel like a god, but the game has a natural progression. You start with your fists, gain a power, gain more power, until you can stand up to your maker. My only gripe is where Alex Mercer from the first game felt like a depressed teen with super powers, Heller feels so angry that I expect him to turn into the Hulk so I can play Ultimate Destruction. Literally every line from him is '..♥♥♥♥...' '♥♥♥♥♥' '♥♥♥♥' 'swear word'. I understand his family was taken from him, and that is one of the most traggic things in a person's life is when your family is killed. But, seriously? Almost every line? I can't fault the game in its gameplay as the devs really took care of what they worked on, but Heller felt overly angry at everything. A character who is a part of Mercer's 'evolved' *spoilers I guess* is helping Heller from inside Gentek to try and bring down Mercer as she's in it for herself. All Heller does is say 'you got me intel that could get you turned into goop or experimented like a lab rat? ♥♥♥♥♥, get more!' At least try and be a bit more friendly to the only Evolved who seems to be on your side, is in a very advantageous position and in a way you could spot for miles away betray you at the end to get into Mercer's good graces.   The soundtrack is great, offering some very emotional and slow melodies or fast paced tracks that really feel like this is something to be hyped over. The voice acting is also very good, hitting the right marks as you do feel for these characters, but Heller sounds like he's Bruce Banner from 'The Avengers' where he reveals that he's always angry, but he shows it all the time.  In closing, I'd say if you weren't a fan of the previous one, then this is a pass, but if you're like me and loved the first one, then this is a buy. Just remember though, Heller does tend to swear in almost every sentence, I think Prototype 2 beat '♥♥♥♥- a documentary on the word' for amount of times he said '♥♥♥♥.'",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, I liked it a lot. This game might not be for some of the younger kids though.",
            "review_score": "1"
        },
        {
            "review_text": "game doesnt work, cant get a refund. ♥♥♥♥ing ♥♥♥♥♥♥♥t.",
            "review_score": "-1"
        },
        {
            "review_text": "I've tried many times now, can't even get through the intro without it crashing. I give up.",
            "review_score": "-1"
        },
        {
            "review_text": "This should not be 2nd. In simple terms:  Pros: 1. Awsome thing you can't do in the older game. (Pack) 2. It has more interesting fights.  Cons: 1. The main character is always trying waaaaaaaay hard to sound like a badass which simply makes you hate the story. 2. They completely changed the original heros personality (a.k. Alex Mercer) which is sad.  3. Nothing to do after you finish it. (Got all the collectibles plaied around with the dlc pack which was only fun for around 10 min, and then you have nothing to do. while in Prototype 1 you could have fun with bases.   So warning: If you have this game then play this first THEN play Prototype 1. As a seperate game I give this 7/10",
            "review_score": "-1"
        },
        {
            "review_text": "though i've seen many complains due to lag on high end system, i do not have that issue, probably because iGPU is disabled in BIOS.  it's a neat game, with a plot twist on how alex mercer turned to protagonists. the downside is the textures are lowered for unknown reason, cutscenes have better textures. power is similar to alex except james have one original power.  final boss fight is hard though, you'll need to switch weapons quickly. it's ok if there's no sequel, a story has to come to an end and with alex mercer gone, who knows?  still, james is more human than alex in this game",
            "review_score": "1"
        },
        {
            "review_text": "Protoype 2 received criticism for being too similar to the first game, and I can sympathise with that. It is very similar, but to me it's like Assassin's Creed where AC2 was similar to AC1, but in both cases the second game was definitely better. I finished Prototype 2 and wanted more...with Prototype 1 it was great but wore off quickly and I never finished it.  Bottom line on this game was that it was an absolute blast. A video game with no pretences. Just smash the $h*1 out of anything that moves with all kinds of abilities that make every second of the game pure unadulterated joy.",
            "review_score": "1"
        },
        {
            "review_text": "Game fails to launch everytime. The screen will go black for a second and then it will say the game fails to launch. Is there any fix action for this?",
            "review_score": "-1"
        },
        {
            "review_text": "Couldn't play on my PC. It got stuck on the loading screen.",
            "review_score": "-1"
        },
        {
            "review_text": "An extremely underrated series, I see it as a game chewed up by Activision which was obvious during it's release. The game is very fun but I wish there was more heart in it, there is something there but it hasnt had a good enough dev team bring it out yet.",
            "review_score": "1"
        },
        {
            "review_text": "Performance on AMD GPUs is horrendous if you try playing for more than 5 minutes at a time. I'm running a Sapphire Fury card, and my frame rate would peak around 45 and slowly drop to below 20. This is a known issue, and it remains unfixed. DO NOT PURCHASE THIS IF YOU HAVE AN AMD GPU.",
            "review_score": "-1"
        },
        {
            "review_text": "such an awesome game, loved the first one, still playing the second i would recommend this game to anyone who is into those kinda gorey games. Story is also cool aswell.",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't work. DO NOT DOWNLOAD THIS GAME! GET IT FOR CONSOLE! It doesn't work for me. I get halfway through the cutscenes and BAM! Says there's a 'problem' and force quits prototype 2. I don't recommend buying this until they fix the problem or, if they never do, get it on console. It would probably be less laggy than this.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game at all... I do have R5 AMD ... After a driver update my game was running well. :) Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Prototype 2 is basically the first game with little bit more powers for the hero, better graphics, nicely polished and even more destruction. There are not a lot of changes to the game system. The game finally works better and I have not encountered any technical issues. I much rather not recommend this game and say go play the first game, if it was not for performance issues of 1st game. The worst thing about this is the main protagonist who acts and sounds like brainless ♥♥♥♥♥♥♥♥ ♥♥♥♥♥♥♥s who just screams profanities and is permanently ♥♥♥♥♥♥ off.",
            "review_score": "1"
        },
        {
            "review_text": "I am usually not a fan of parkour-based FPS games, as they often require a lot of coordination. Nevertheless, this game is different than games like Dying Light as far as parkour, which is a breeze in Prototype 2. The RADNET DLC is a must-have for more casual gamers given the incredible abilities it can provide.  There is certainly a storyline, though it is rather predictable. Nevertheless, I find the gameplay is absolutely amazing and I reallly enjoy the destruction one can create on such a massive scale! As far as the original Prototype, I played it for a bit, but personally I feel Prototype 2 has a richness the original lacks.  Nonetheless, that is simply my personal opinion. Being an older and more casual gamer, I tend to gravitate towards games with difficulties that can be more easily scaled like this one. After only a day of playing, I knew this would end up on my 'Favorites' list.",
            "review_score": "1"
        },
        {
            "review_text": "a great game ",
            "review_score": "1"
        },
        {
            "review_text": "I found it a lot of fun. Running up buildings. Driving tanks around mowing down pedestrians. Blowing up stuff. I got it on sale, haven't finished the story line but still enjoying it.",
            "review_score": "1"
        },
        {
            "review_text": "I am really enjoying this game, it has a level of freedom with the gameplay that allows you to immerse yourself in the story!",
            "review_score": "1"
        },
        {
            "review_text": "the best game ever",
            "review_score": "1"
        },
        {
            "review_text": "You want to know if you should buy this game? YES. BEST GAME EVER,  I feel like the develop asked their Sempai/Senpai what kind of game hey wanted to play and what they wanted to be able to do in it, and they responded with 'yes.'  The civillians on the street have real conversations and if you bump into them, some of them threaten you. You can put that ^%$^%%#$^%$*@#@#$ in a one handed chokehold, sprint and jump across the city, run up the tallest building, change physical form, infect with a deadly disease that makes him explode after you let go, and throw him off of that building.  Also, controllable Tanks and Helicopters with miniguns and rockets that you can use to demolish the army or infected, or anyone who gets in your way.  I'm not gonna tell you how to live your life, but if you've never played this game, is it even fair to say that you are 'living your life'? 10/10 would recommend. ",
            "review_score": "1"
        },
        {
            "review_text": "now that the mouse issue is fixed it is a great game to play",
            "review_score": "1"
        },
        {
            "review_text": "TL; DR: PURE RAGE. Consume and destroy. Glorious catharsis.  PROTOTYPE 2: MEAT IS MURDER. You are the meat, and you are the murder.  The goal is rampage, and Prototype 2 delivers, mixing smooth stealth infiltration with fast-paced combat drenched in blood and power. Your enemies are cartoonish caricatures of evil, because they would HAVE TO BE to deserve your meat-monster wrath as you slash them limb from limb and devour their bodies. You are The Incredible Hulk, you are Carnage, you are also The Punisher.  It's not a hard game. You're more than a match for your enemies and checkpoints are generously dispersed. Some of the more obnoxious elements from the first game have either been toned down (super-soldiers no longer require a GoW-style QTE to not die to) or removed entirely (no virus-scanning drones).  The story is told in epileptic, edgy montages. You are James Heller, family man and hardass soldier who has lost his wife and daughter in the second outbreak of the so-called Mercer Virus, believed to be spread by Alex Mercer, hero(?) of the first Prototype. James is infected by Mercer with the power to kill and eat everyone, which sends him on a quest of consuming vengeance.   Prototype 2 is an overall smaller game than the first Prototype. The city is split up into three compact districts. The morass of point-buy powers has been replaced by a steady trickle of upgrades from doing side quests and finding collectibles. Backstory nuggets are delivered through a collection of easily found black boxes strewn throughout the city rather than buried in a sprawling story web of random people's brains. This works to its benefit, as no one part of the game overstays its welcome, and in the first game everything did.  It's a fine example of a compact XBox 360-era action game, and an excellent outlet for your constant building anger. You are angry all the time now, right? Right? Is it just me?",
            "review_score": "1"
        },
        {
            "review_text": "Nice Story line, and amazing game play",
            "review_score": "1"
        },
        {
            "review_text": "Great game, just wish there would bbe more to it like a multiplayer game mode or co-op.",
            "review_score": "1"
        },
        {
            "review_text": "game is broken, lags even with low settings on a good PC that runs newer games. needs patching",
            "review_score": "-1"
        }
    ]
}