{
    "app_id": 11590,
    "name": "Hospital Tycoon",
    "release_date": "2009-02-13",
    "developer": [
        "Deep Red Limited"
    ],
    "publisher": [
        "Codemasters"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Management",
        "Singleplayer"
    ],
    "achievements": 0,
    "positive_ratings": 175,
    "negative_ratings": 301,
    "price": 3.49,
    "description": "Develop your own hospital drama and manipulate the results to your best advantage! In charge of a rapidly expanding hospital, your job is to cure the patients with your army of doctors and nurses while successfully managing the facilities and taking care of everyone's needs.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/11590/header.jpg?t=1447351434",
    "minimum_requirements": "Supported OS: Windows XP                     Processor: Pentium 4 @ 1.6 GHz or Athlon 1600+                     System Memory: 512MB RAM                     Video Card: GeForce 3 / Radeon 8500*                     Sound Card: DirectX Compatible Sound Card                     DirectX Version: DirectX 9.0c                     Hard Disk: 750 MB Hard Drive Space                    *Supported Graphics Cards:                     ATi Radeon 8500, 9000, 9100, 9200, 9500, 9600, 9700, 9800, X300, X600, X700, X800, X1300, X1600, X1800, X1900, X1950                     nVidia Geforce 3-series, 4-series (Not MX), FX5200, FX5600 FX5700, FX5950, 6600, 6800, 7100, 7300, 7600, 7800, 7900, 7950, 8800.                      Not compatible with all integrated sound/graphics solutions (inc. Laptops).",
    "recommended_requirements": "Supported OS: XP/Vista                     Processor: Pentium 4 2.8Ghz or Athlon 2800+ or above                     System Memory: 1GB RAM                     Video Card: GeForce 6600 / Radeon X1300 or above*                     Sound Card: DirectX Compatible Sound Card                     DirectX Version: DirectX 9.0c                     Hard Disk: 1.5 GB Hard Drive Space",
    "reviews": [
        {
            "review_text": "a failed attempt to remake the wonderful Theme hospital , but it couldn't capture anything and it is really dull ,with terrible sense of humor and game mechanics and a silly story that has nothing to do with the game it self . who said that a sim should have a story ?",
            "review_score": "-1"
        },
        {
            "review_text": "Camera angle could be alot better, Theme Hospital is alot better",
            "review_score": "-1"
        },
        {
            "review_text": "Enjoyable game but not much of a challenge, you hardly get any patients in your hospital. Would like to see a mix of this and Theme Hospital.",
            "review_score": "1"
        },
        {
            "review_text": "This game its easy, short, and boring.   All levels are the same.  Characters are a little funny thats all.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not Theme Hospital but it tries hard to be and succeeds mostly. So far I am on Season 3 Episode 3 and am enjoying it in story mode. It's not nearly as hard as Theme Hospital is. However the only thing I can 100% guarantee you will want to do is turn off the sound. When they talk it's the Sims gibberish and it just repeats over and over and over and over and over and over and over and over and over and over and over and over...  The graphics are not quite up there with Theme Hospital either but that is because Theme Hospital was Sprites while this went with a very early 3d model engine. So the 3d models are not nearly as detailed or look as good as the sprites do.  Overall I am quite enjoying my time with it. Is it the classic that Theme Hospital is? Nope. But it's a fun little romp through a soap opera Theme Hospital wannabe.",
            "review_score": "1"
        },
        {
            "review_text": "Hospital Tycoon is not as good as the 10 year older Theme Hospital.  The story mode has an awfully written story. It is supposed to be made like a drama, but the whole story arc is shallow and just bad. The graphics are the strongest point of this game, despite weird animations.  There are some crucial programming errors like pathing problems (Receptionists not doing their job and patients dying in the rest room) and script errors in the story, where it is impossible to finish a level after missing an instruction.  There are no graphs at all, just some basic stats listed for your staff. This game should not even be named a Tycoon game.",
            "review_score": "-1"
        },
        {
            "review_text": "Eh, this is what i would call the BAD HD, steam port, for theme hospital, i'd recommend getting the original, Theme Hospital. I wish there were a type of tutorial, i wish you could zoom further out, I'd like it to have a simpler User Interface. 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most hateful games I have played in a long time. The interface is rubbish, the theme is annoying and the hospitals you manage are all the same but without any continuity (you build the same things over and over every level). I wouldn't wish this game on anybody!  Thankyou Steam for letting me remove it permenantly from my Library!",
            "review_score": "-1"
        },
        {
            "review_text": "It's more or less a reboot of 'Theme Hospital', right down to the dry British 'humour'. But it's still a solid game.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like an ok game, you are basically Cuddy instead of House - just wish i could turn off the annoying 'The Sims' voices.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly adore tycoon and simulation games. I had a spare couple dollars and this was on sale a little while back so why not try it? Well... This is the only review I have written so far.  I have music playing, and the noises the receptionist or whatever she is was still annoying me. I just turned the sound off and that wasn’t an issue any more.  The thing that gets me about this game was the main story mode. Sexy male ab workout guy can’t marry the nurse because of his dedication to the job. What compelled them to do something like that in a tycoon game? It is just extremely awkward especially for this kind of game.  On a side note, I wish some of this stuff was cured in one doctor visit.",
            "review_score": "-1"
        },
        {
            "review_text": "Can you distinguish between a piece of poo and a dog? Neither can I, but this game teaches you the value of not knowing how to do that. Why is this important? Well to begin my subpoena, I would like to first mention that Abraham Lincoln was not only one of the greatest presidents, but he was also the king of the rap game back in the 13th century. Sounds strange, but the Virginia Internation Institution of Cosmetics and Applications of makeup in modern society discovered that Abraham Lincoln did order that the declaration of independence be written in a style reminiscent of the new hip hop song 'White men cannot eat nor poop before taking a gun into the street'. George Washington, however in the last minute, changed it to sound more like the old Beatles song 'Slavery is not fun, but we will tolerate it'. Pretty bad for George Washington, and that is the sole reason why you should not only purchase this game for it educational prowess, but also revel in its glory by sacrifing your closest friend in honor and reincarnation of Abraham Lincoln into a small, albino Goat.",
            "review_score": "1"
        },
        {
            "review_text": "Its a creepy, sexist Theme Hospital clone.  0/10",
            "review_score": "-1"
        },
        {
            "review_text": "same as airliner tycon   its poo   all be warnd",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics are nice, but the gameplay is just dull. The game has some comical humor attached to it, but that's the only good thing.   I can't recommend to buy this title, not even while it's on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Why did I do this to myself.   Not the tycoon game I was expecting. Glad I spent less than a dollar on it. Learnt my lesson.",
            "review_score": "-1"
        },
        {
            "review_text": "Too cumbersome to be fun...   The idea of the game is nice enough, but the user interface makes the game cumbersome to play. Lots of scrolling around the hospital, and some times things you build don't work with no clue why. The dialog noises would be better just simply turned off.",
            "review_score": "-1"
        },
        {
            "review_text": "dont buy and never play",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible ripoff of the original, you'll wish you never purchased it.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to enjoy this game as I enjoyed Theme Hospital so much, 100's of hours on that but this... I couldn't enjoy any part!  The building is horrible, gameplay is horrible and animations are... horrible!  I hate to say this on a building type of game but 'Thumbs Down'...  Most of the 10-20 minutes playing this I placed trash cans, coffee machines and watched people with headaches' that looked like their brains were in a 850w microwave! UGHHH AVOID PLEASE!..",
            "review_score": "-1"
        },
        {
            "review_text": "a bad attempt at remaking the classic hospital tycoon. cumbersome interface, boring gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game for a buck and some change. After accepting that cartoon-styled graphics and the cheesy humor, I felt like the game had more depth than I had originally bargained for. I played for a little over an hour to get the feel for the game. In terms of playability, the game is okay. Even with fast-forward it felt like more waiting time than necessary. The objectives don't seem to change very drastically, just a lot of 'build this room, build machines, hire staff, decorate, repeat.' As a side note, the camera angles are the reason I stopped playing when I did.  It's not a horrible game, but I'd feel cheated if I paid more than a buck for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't play game - it keeps scrolling to the top left",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst tycoon games I've played. Uninspiring, unrewarding.",
            "review_score": "-1"
        }
    ]
}