{
    "app_id": 116100,
    "name": "Super Toy Cars",
    "release_date": "2014-06-06",
    "developer": [
        "Eclipse Games"
    ],
    "publisher": [
        "Eclipse Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Indie",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Indie",
        "Multiplayer"
    ],
    "achievements": 26,
    "positive_ratings": 201,
    "negative_ratings": 132,
    "price": 6.99,
    "description": "Super Toy Cars is a tabletop arcade combat racing game featuring fast and cool looking cars, impressive tracks made of everyday objects and a bunch of power-ups that will let you destroy your opposition.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/116100/header.jpg?t=1447358809",
    "minimum_requirements": "OS: Windows 7 Processor: 2GHz Intel Core 2 Duo or equivalent Memory: 2 GB RAM Graphics: 256MB with Shader Model 3.0 support DirectX: Version 9.0c Storage: 512 MB available space Sound Card: DirectX 9 Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I'm a sucker for the arcade racing genre, so I purchased this game early on (it might have been early access, I don't remember now), and I pretty much immediately wrote it off. More than anything the chunky hit boxes and punishing reset mechanics made for an infurating experience. That said, I'm glad I re-downloaded and gave it another shot. It's still not perfect but it's a whole lot better. In some ways the racing experience is among the most satisfactory of the arcade racers I play (among them, Bang Bang Racing, Mini-motors EVO, Little Street Racers) because it feels like the AI cars neither cheat nor are handicapped in an unrealistic manner. What remains imperfect are the hitboxes on some areas of some maps, which occasionally will find you stuck on parts that should clearly be traversable. Also, the heavily-mined elimination maps in career mode are almost hair-on-the-tongue annoying, at least if you're the sort that tries to get first on every map. I would rate myself as mediocre at this genre, for what it's worth, so if you're an ace at driving games, this might be too simple for you.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! Many hours of gameplay, especially when trying to win on every track with the Sputs Golem! Great for evading mines but the top end and short duration of the boost made it very difficult, at least for me. There was another car that i spent quite a few hours trying to win in, but i forget now. Once you do win with one of those cars though, it's like 'YESSS!' The devs, namely Barkley, has been here since day one and is still here solving any issues that arise and just letting the player base know that the game is being backed by Eclipse Games , the creator of STC. I am impressed and hats off to Barkley!",
            "review_score": "1"
        },
        {
            "review_text": "I really love this fun racing game because of it's many games modes. There's Career, Quick Race, Online Multiplayer, and Track Editor. All of these game modes are super fun and worth the time. There are some downsides like 'bad' physics but the creativity of this game balances it out.",
            "review_score": "1"
        },
        {
            "review_text": "My first few races I didn't really care for this game, but after you get use to the drifting and boosting, it becomes really fun. You can drift nearly the whole time, even on straight aways, and it makes it way more fun trying to see how long you can keep it going.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy racing and drifting around at the speed of Super-Fast HotWheels cars this is the game for you! With different modes and car customizations too. The game is also easy to 100% Complete.  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "highly recommend if you just want to have a fun with friends family or girl/boyfriend",
            "review_score": "1"
        },
        {
            "review_text": "funny good racing game! good graphics! good music. race car control physics are ok.  i have a nvidia 960m (laptop), game graphics are nice and good!",
            "review_score": "1"
        },
        {
            "review_text": "Looks nice, but the cars' handling feels off and I got stuck in the track a couple times. Maybe if it's really cheap, but you're probably better off waiting for a sale on Sonic &amp; All-Stars Racing Transformed instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Subpar game in all regards. Music is decent but vehicle sounds and general sound effects are very crude. Gameplay is rudimentary and isn't satisfying. Mario Kart gameplay without the awesome.",
            "review_score": "-1"
        },
        {
            "review_text": "Table of Contents: - Foreword - Graphics - Gameplay - Sounds - Controls - Quality - Overall Experience   -Foreword I expected way more than i got. I've played a RC Car game yesterday which was like 10x more enjoyable.  -Graphics The graphics are really bad. Some textures are only loading when you're in the range of 10m.  -Gameplay The gameplay was weird. Quick races are only for local multiplayer, so i've only played one race of the carrer. Didnt even try the multiplayer. I cant expect many people to play it. And even less i believe that it works flawless.  -Sounds Thats the main point why i quit the game so fast, besides to it being weird and bad. The Sound Effects had such a low bad quality, only the music quality was good, i didnt like the music though. There is no sound for crashing into a wall, which is definetly way more important than many other sounds it actually features. Well, all sound bad.  -Controls The game uses the arrow keys when started first. I changed it to WASD, Handbrake was on CTRL btw...  -Quality The overall quality was just really bad. I know some people will probably say i cant judge about a game after 10 minutes of playtime, but i think i can. Its clearly much worse than other 'Toy Car' games. Also, the game says 'Are you blind man?' and something else when driving backwards and then just resets your Vehicle...  -Overall Experience Bad. Seriously, i would not recommend you to get that game. Search for other games instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Very short. Too easy. Such review. wow          YouTube™ Video:  &nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Yep! Old micromachines were better. What I didn't like in this game: permanent camera view, camera is too close, there is no ability to drive out from the road, too strong drift effect, turbo is not for this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad Game. -No content. -Game play sucks. -Multi broken.  Dont buy it",
            "review_score": "-1"
        },
        {
            "review_text": "The Idea is great  The execution is bad  Sound and fluidness is terrible I switched of the music after race 10 because it was always the same song  Overall the game is kinda ok to play if its for free, to actually pay for this game is a no go.",
            "review_score": "-1"
        },
        {
            "review_text": "It looks like a fun game, then why the negative review? I cant control the car, I have a 360 controller, an xbox one controller and mouse and keyboard, for some reason, I CANNOT throtle, or break for that matter with anyone of them, even after rebinding keys for the keyboard, but I am able to turn the camera... I wont even bother to unplug the controllers to see what is causing the conflict.",
            "review_score": "-1"
        }
    ]
}