{
    "app_id": 12110,
    "name": "Grand Theft Auto: Vice City",
    "release_date": "2011-01-10",
    "developer": [
        "Rockstar Games"
    ],
    "publisher": [
        "Rockstar Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Open World",
        "Action",
        "1980s"
    ],
    "achievements": 0,
    "positive_ratings": 9817,
    "negative_ratings": 819,
    "price": 5.99,
    "description": "Welcome to Vice City. Welcome to the 1980s. From the decade of big hair, excess and pastel suits comes a story of one man's rise to the top of the criminal pile.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12110/header.jpg?t=1543431247",
    "minimum_requirements": "OS: Microsoft® Windows® 2000/XP Processor: 800 MHz Intel Pentium III or 800 MHz AMD Athlon or 1.2GHz Intel Celeron or 1.2 GHz AMD Duron processor Memory: 128 MB of RAM Graphics: 32 MB video card with DirectX 9.0 compatible drivers (&quot;GeForce&quot; or better) DirectX Version: Microsoft DirectX® 9.0 Hard Drive: 915 MB of free hard disk space (+ 635 MB if video card does NOT support DirectX Texture Compression) Sound Card: Sound Card with DirectX 9.0Recommended: Processor: Intel Pentium IV or AMD Athlon XP processor 256(+) MB of RAM Memory: 1.55 GB of free hard disk space(+ 635 MB if video card does NOT support DirectX Texture Compression) Graphics: 64(+) MB video card with DirectX 9.0 compatible drivers (&quot;GeForce 3&quot; / &quot;Radeon 8500&quot; or better with DirectX Texture Compression support)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Two words:  FLASH FM.",
            "review_score": "1"
        },
        {
            "review_text": "Ignore my steam playtime, i've played this for hundreds of hours back in the day. -----------   Grand Theft Auto: Vice City, released in 2002. It was set in 1986 in Vice City (Fictional name for Miami Beach, Florida, i guess it's not hard to tell). A game that is still one of the greatest games of this era, in 2003 everyone was crazy about it. You can judge if this is a masterpiece or not by just looking at it's popularity even nowadays, how many games that are 11 years old are still played today? Not many.   The atmosphere you find in this game is perfect, your ears are delighted with great tracks from: Michael Jackson (Never liked him, but he had some great tracks), Megadeth, Anthrax, Cutting Crew, The Whispers, The Outfield, Bryan Adams, Iron Maiden, Loverboy, Slayer, Judas Priest, even Frankie goes to Hollywood, and the list goes on more of course.  The graphics were absolutely amazing at the time of release. Gameplay was, and still is great, the mechanics are friendly. You ave a variety of weapons to choose from when it comes to slaughtering random people on the street, including hookers and old ladies.  The cars you find in this game, are mostly sport ones, you also can find scooters and motorbikes.  You play as Tommy Vercetti, a mafia member that just got out of the prison. You are involved in a deal that gone wrong and you need to find the people who 'backstabbed' you'.   In my opinion, this is the greatest GTA game released, shame that GTA V kinda 'dodged' the actual GTA feeling there once was, but hey, we have to move forward!. I would love to see a GTA: Vice City remake, nonetheless.  As for the technical stuff about this game. It works on Windows 8.1 flawlessly, without any compatibility options set, or any patch or modification. It recognizes new resolutions (1440x900 user here).   A perfect game that gave me hundreds hours of fun many years ago.",
            "review_score": "1"
        },
        {
            "review_text": "Vice City is probably the best GTA that has been made to date. Obviously, as a PC gamer, this opinion does not include GTA V as that one was never released by Rockstar on my favourite platform. I personally liked GTA IV a lot and the reviews on the latest installment were very promising - I just think Vice City was more captivating than the rest.  Vice City looks dated, yes. Please bear in mind that this is an eleven year old game and considering the capacity of our smart phones this game is accessible as an Android application as the game's engine can easily be handled by our phones' hardware. Its atmosphere, however, is still captivating even a decade after its release so playing such an 'old' game on a widescreen monitor with next-gen hardware is no shame!  You play as Tommy Vercetti (voice by Ray Liotta) and you are in the '80s. You have cars, music and even film references from this era. Some scenes remind you of Miami Vice while others are clearly a nod to Pacino's character in Scarface. How cool is that?  You have dozens of missions available. Some continue the main story while other are just side missions. Each includes a cutscene with amazing voice acting so it is a crime to skip any of the available missions. Oh, you don't want to do any of these? No problem: Vice City allows the player to just cruise in the city, steal cars, crash these cars, harass citizens (with these cars, too). You can drive a cab and earn some money at your leisure. Or steal a police car and become the terminator of vigilantes.  There are tons of things to do in GTA. And while Vice City is certainly an outdated game nothing else out there can remind you how cool the '80s were than this piece of treasure.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Scarface; You'll like this, mang.  10/10 - Cubans steal your coke.",
            "review_score": "1"
        },
        {
            "review_text": "Grand Theft Auto: Vice City puts in the adventure of Tommy Vercetti who tries to find rich and prosperity in the infamous city of Vice City during the 1980's. There are a lot of similarities between Vice City's story and the movie Scarface; I'll let you see for youself.  Unlike Grand Theft Auto III, Vice City is wild, colorful and of course, BAD. The world truly captures the 80's feeling, not just with cars, people or the environment, but with music. The first song you are guaranteed to hear, is Michael Jackson's Billie Jean. Other notable songs include Killed the radio star. Heck look at the tags for this game 'Great soundtrack', speaks for itself.  Bottom line is, buy it, play it, love it.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy riding your swaggio into the sunset while listening to kickass 80s music, this game is for you.   10/10 for the soundtrack alone.   The helicopter mission was my personal favourite. Best crash simulator ever. ♥",
            "review_score": "1"
        },
        {
            "review_text": "Unlike GTA 3, Vice City is pefectly enjoyable to play and explore, even today. SilentPatch and Widescreenfix essential for playing, though.",
            "review_score": "1"
        },
        {
            "review_text": "My first game when i was 6",
            "review_score": "1"
        },
        {
            "review_text": "Bright sun, blue ocean, green palm trees, girls, hawaiian shirts and long nights.  In 2003, the day you've bought a CD with this game for the first time was a festival.",
            "review_score": "1"
        },
        {
            "review_text": "The game art features a woman in a bikini I never saw any women in this game Except the ones i was running over with my tank",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! It's awesome!",
            "review_score": "1"
        },
        {
            "review_text": "  GRAND THEFT AUTO: VICE CITY  The story of a real soldier  Unlike his shiftless brother who did time for selling drugs, Victor Vance until the last moment tried to be in trouble with the law. He even went to the army, to obtain government protection, knowledge and money, which always lacked. But even this did not help him to avoid bad influence: doing another 'civil' job of his commander, he violated the Charter and in a moment was outside the gate of military garrison.  The prospect of washing the nights dishes in the restaurants did not suit him, so the route remained single — hires apprentices to local gangsters. But how can you take seriously these clowns? The first lives in the port hangar and drunken, and the second rat and a misogynist, and a third for hours talking about their genitals. The last straw was returned from prison lance caught shaped jerk: he immediately began does business behind Vick and communicate with corrupt police. Long endure such an environment was impossible — I had to take the command in his hands.In the brothel — in a helicopter  Vice city eighty-fourth is a reduced copy of Moscow of the early nineties, when the 'white' business did not exist in principle, but the negotiations much to decide the fists and 'trunks'. Therefore, to build their own criminal Empire have literally brick by brick. Victor goes to the neighboring areas, captures the building and makes them his property, after having disposed of the former owners.  After several hours of heavy activity, he becomes owner of several brothels and gangster dens and pairs of points on the sale of drugs, bringing considerable income. The process is no less amazing than the result — I feel like a young entrepreneur who works like a bee from morning till evening. And no matter what it does not built kindergartens and hospitals — market laws are the same for all undertakings.  No, crazy action when porting from one platform to another turned into an economic simulator. Just in Rockstar's once dared to change some well-established principles, and the most striking example — a system of unarmed combat. If earlier the clothes that were only stupid to thrash arms and legs, Vic is able to conduct suffocating grappling and lock techniques of the opponent (due to military training?). Traditionally, when the desire on fighting and shooting may be time to close my eyes and instead, steal a fancy convertible, going to the waterfront to admire the red-orange sunsets, ride a jet ski on the water channel or to look at the city from the helicopter.  So good games under the brand name Grand Theft Auto that are not forced to adhere to a strictly defined lines of conduct. Vice City stories respects tradition and relies heavily on the attention of the public familiar with the series. Terse and business Victor fits perfectly into the role of the godfather of the city, continuing the tradition of predecessors: he can work before losing momentum and in a big way to relax. Sorry, will shoot him in the Prime of life at the peak of fame. But the writers released him two years he will hold in his pleasure.  The programmers at Rockstar Leeds to make the most of outdated engine everything: the picture quality here is even higher than in the original Vice City for the PlayStation 2. Even the wheels of the machines of steel volume, explosions are more colorful, and the animation movements are smooth and natural. Local radio stations for any musical taste and still pleased with the work of competent DJs. The rest of Vice city is mostly quiet and calm, as befits the relaxed southern city. Only the sound of gunfire and sirens occasionally break this idyll. The next 'Stories' turned out to be perfectly optimized for the features of the platform: helicopters obediently 'float' in response to the command, shooting at enemies easier mode avtopritselivaniya, and to steer the car even just at high speed. If here and there an accident, mostly the fault of other road users. Some missions seem impenetrable and can only be after a dozen fruitless attempts, however, after mastering all the intricacies of the task management clicking like nuts. However, neither one of them is not like another — and have the crowd of bandits to the ground to lay, and seniors home to deliver. A true Paradise for the budding gangster. This is not a standalone project, and another story on the life of gangsters that fit into the events of the series. Not just a game but a real world in which you want to return again and again.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game six times this year and I still want more. Help. I'm addicted.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite gta games. You don't need a top level game engine to make a great game. Rockstar, please wake the hell up.",
            "review_score": "1"
        },
        {
            "review_text": "Vice City is a brilliantly stylized game and was just spectacular to play when it came out.  Of course it hasn't aged very well since 2002 but don't let that dissuade you. Since you've probably heard tales about it's amazing soundtrack of 80s Hair Metal and glamourous open world city. But your not liable to listen to me, and chances are if your reading this you probably already own it.",
            "review_score": "1"
        },
        {
            "review_text": "Its a really cool game and the music is legendary! Worth to buy it cu+ ",
            "review_score": "1"
        },
        {
            "review_text": "Played this recently on pc after playing it on the xbox in the good old days. Like GTA3, this game has replayability that the more modern GTAs just don't have. The main story is just long enough not to get boring and although there are a host of side missions they do not become overbearing or repetitive. The setting is the real star with the gorgeous weather efffect, interesting characters, musical gems, and funny dialogue. o#only cons are the mapping of the keys to controller is imperfect, especially with regards to the gun fights and the buying of assets serve very little purpose especially if they completed late in the game. Defintely 9/10 for me.",
            "review_score": "1"
        },
        {
            "review_text": "you can run over old people in magnum pi's car while listening to gary numan  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Yes it's old.  Yes the graphics are dated.   But that doesn't matter diddly squat with a game as awesome as this!! :-)  And WHAT A SOUNDTRACK!! :)",
            "review_score": "1"
        },
        {
            "review_text": "one of the best game of my chilldhood :D:D",
            "review_score": "1"
        },
        {
            "review_text": "brings back childhood memories",
            "review_score": "1"
        },
        {
            "review_text": "an absolute classic that brings back alot of memories. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good old times when you were a little kid.",
            "review_score": "1"
        },
        {
            "review_text": "Today's games may be better at graphics, gameplay, shooting &amp; driving mechanics, scenario etc... But, Vice City is a very good game for nostalgia-lovers. It has kinda basic mechanics, bad graphics, old-tech-gameplay, but, I couldn't find any better atmosphere in any other Grand Theft Auto games. Florida theme, colorful world and enjoying gameplay makes this game beautiful. Everybody will enjoy from taking a sports car, switching to Flash FM, driving around city when listening Billie Jeans from Michael Jackson or spawning a tank and being a destroyer or buying M-60 with lots of ammo and being a badass etc... There are too many options to enjoying this game. Anyways, I think everybody had better buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Vice City has since I played it for the first time on Playstation 2, been my favorite Grand Theft Auto Game.  Vice City takes place in the 1980s, where you are playing as Tommy Vercetti. Tommy Vercetti has lost a lot of money, and needs to get them back. He is starting to work for people in Vice City, so he can pay Sonny Forelli back.  One of the things I was most happy for in Vice City was the music. So if you like the 80 and 90s music, you will like most of the music in Vice City.  The PC version includes a lot of new features, here are some of them:   Custom Resolutions   (Choose your own Resolution)   Better Graphics   (There is better Graphics and also custom Draw Distance)   Custom Radio Station   (Upload your own mp3 and make your own Radio Station)   Frame Limiter   (By disabling Frame Limiter, you can play Vice City in 60fps)  There is of course a lot of other new features, this is just some of them.  Vice City is of course recommended, and is a game you must play! ",
            "review_score": "1"
        },
        {
            "review_text": "A great classic!",
            "review_score": "1"
        },
        {
            "review_text": "My favorite GTA from the PS2/3D era!",
            "review_score": "1"
        },
        {
            "review_text": "Ah, nothing like driving around the beaches of Vice City, listening to the sweet sound of the radio whilst running over civilians on beachmats and escaping the entire Vice City military.  Getting serious, this game was, and still is, golden. Rated 94/100 by Metacritic, and 100/100 by me, this game is a must have.  Also, something to note: I played this all the time back when I had it on an earlier console. I have been thinking of doing a playthrough, and my currnt hours was purely from me messing about and doing a small percentage of the storyline.",
            "review_score": "1"
        },
        {
            "review_text": "The world isn't that big en the graphigs aren't that great but the story is gold. It is a old but gold game. When I was young I loved playing it and I do still now",
            "review_score": "1"
        },
        {
            "review_text": "welcome to vice city papa mia",
            "review_score": "1"
        },
        {
            "review_text": "It's Grand Theft Auto in the 1980's...what's not to enjoy?  Unleash Hell on Vice City and sport a grin doing it.  12/10 - Undeniably Groovy.",
            "review_score": "1"
        },
        {
            "review_text": "Back in the day, I probably put around 100~ hours (if not more) into this game on my old PS2 (May he rest in peace)  Now, this review may be a tad biased, due to nogastalia, but let me tell you first handedly, that this is a good game. My second favorite GTA game didnt age terribly well, but there arent many open world 80s games, are there now? Without further ado, I will now make a Pros and Cons List to give you a better sense of the good, the bad, and the ugly of this game.  Pros: Pretty good story, if not a little cheesy Plenty of properties to buy Nice costumes for the character Likeable PC 80s vibes all around The soundtrack is good, and has many licenced songs in it such as Billy Jean, and Video Killed the Radio Star Decent controls, they are by no means great, but they aren't to clunky either. Nice but repetitive NPC dialog Some really nice sidequests Not many bugs/glitches Decent weapons collection  Cons: The graphics havent aged too horribly, but they do look very dated The occasional bug/ glitch may still be found you lose all of your guns/ammo if you die/get busted :(  Now, even if I rule out nostalgia, I will give this game a solid 8.5/10. The fun gameworld and story, paired with the soundtrack, make for a very good game. Some may not be able to look past its graphics, but underneath, this id a good game.  TL:DR - 'Meh' Graphics are over looked by the fantastic soundtrack and gameworld, and a decent story to go with it. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Theres nothing like the classics",
            "review_score": "1"
        },
        {
            "review_text": "Very informative and very educational to young minds.",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't bought this game yet, you should. Really fun. Trust me, you'll like it.",
            "review_score": "1"
        },
        {
            "review_text": "I bloody love this game... 9.8/10 :)",
            "review_score": "1"
        },
        {
            "review_text": "Its got an amazing soundtrack. Great game mechanics, etc... Its a GTA game, get it an dtry it out, I love listening to some Love Fist and driving a comet whilst being chased by the police and shooting them. Yes the game has some bugs that are almost game breaking and there are also levels that are so tedious that it is like trying to ask out a lesbian friend of yours to prom, but nothing is impossible and she says yes! ( Referencing to the helicopter mission in which you must move dynamite from one place to another for like 4 minutes, whilst you drive an Toy Helicopter that is beaten by angry construction workers and security guards but otherwise I can look over that. 4/5 the level took me months to pass.",
            "review_score": "1"
        },
        {
            "review_text": "Its got an amazing soundtrack. Great game mechanics, etc... Its a GTA game, get it an dtry it out, I love listening to some Love Fist and driving a comet whilst being chased by the police and shooting them. Yes the game has some bugs that are almost game breaking and there are also levels that are so tedious that it is like trying to ask out a lesbian friend of yours to prom, but nothing is impossible and she says yes! ( Referencing to the helicopter mission in which you must move dynamite from one place to another for like 4 minutes, whilst you drive an Toy Helicopter that is beaten by angry construction workers and security guards but otherwise I can look over that. 4/5 the level took me months to pass.",
            "review_score": "1"
        },
        {
            "review_text": "I first played GTA: Vice City on PS2 and was so immersed in the culture of the 80's it almost felt like I was there. The soundtrack was amazing, the gameplay was amazing, and the story was amazing. Even the little references were great.",
            "review_score": "1"
        },
        {
            "review_text": "This game takes place in the most glorious decade of them all - The mothershizzling 80's!  It would take a long time for me to explain the impact this game had on me back when it came out and the following years. It's still tons of fun and if you get all of the references in the game, it's just that much better.  Oh yeah, and don't forget this is the definitive version of Vice City. Pick up some mods and expand its longevity!",
            "review_score": "1"
        },
        {
            "review_text": "GTA Vice city is one of the most graphically advanced titles of its era, considering it came out in 2003, its graphics are stunning visually and ascetically. Its story line is interesting and always seems to keep you entertained and immersed in action, as the Grand Theft Auto series is renowned for, the Miami feel to the game, in where it is situated, gives it that beech going immersed experience. This game personnaly is a great title and i would reccomend to anyone wanting another take on the Grand Theft Auto series.",
            "review_score": "1"
        },
        {
            "review_text": "The first GTA I beat 100%. I give it 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Hell of a fun game, and easily my favorite soundtrack of any of this type of game I've played! Not that you don't know that. You've already played it, and you already agree.",
            "review_score": "1"
        },
        {
            "review_text": "[?/10] (all you need to know is GTA series always better than any other games)   Grand Theft Auto, best game Series in human history. Thank you, Rockstar Games.",
            "review_score": "1"
        },
        {
            "review_text": "Grand Theft Auto: Vice City  Positives:  + Perfect storyline, well made.  + Amazing reconstruction of the 1980's with authentic music on radio stations, similar cars and clothing to the time period. + Characters, especially the central one (Tommy Vercetii) are interesting. + Large array of weapons to choose from, military grade assault rifles, pistols, a plethora of melee weapons, rocket launchers, sniper rifles, the list goes on. + Open-world game where the only limit is your imagination.   Mixed:  ~ Graphics are OK, the game is over a decade old now but still entirely 3D.   Negatives:  - Game can be viewed as short, takes around 20 hours to finish.  Overall Score: 8.5/10  Grand Theft Auto: Vice City is a fantastic tale of the criminal underworld in the 1980's. Hugely entertaining game and well worth the price considering it's quite cheap nowadays.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best stories in gta history",
            "review_score": "1"
        },
        {
            "review_text": "This is the first GTA game I actually ever played, though it's my second favorite in the series. Second only from the length of gameplay though does it fall behind San Andreas, excluding that it has the best campaign of any GTA I've ever played. I remember when it came out that my desktop could barely run it maxed and now my laptop maxes it out with an Intel HD 3000. I decided to mod it up to modern expectations and after many google searches and overhauls I settled on Vice Cry as a base for expansion. Vice Cry tripled the view distance, replaced the meshes for the cars with the xbox versions (higher detail), applied a wide screen and resolution fix, and many other little things. It doesn't replace the Ginput system with the Xinput system (for 360 and PS3 controllers) but there were many guides to replacing it in the community guides that I found in a few seconds. If you can't get your mods running just use the old no-cd patch, name it gta-vc.exe, and Steam will run it fine allowing CLEO and dependent mods to run. NOTE Vice City modders prefer the 1.0 no-cd exe for compatibility reasons but I chose to use the 1.1 exe, no particular reasons, so either works if you have picky mods or crashing. ♥♥♥♥ cheats, get VC Dream and forget about them.",
            "review_score": "1"
        },
        {
            "review_text": "Mental game, crush PHILLIP's DREEEAAAAAAAAAAMS NOW! xD",
            "review_score": "1"
        },
        {
            "review_text": "Gta Vice city and Gta 3 are my best Gta games i like. If i were to choose 2. Ive noticed the setting the different gta games put you in, vice city and gta 3 are one of the best. especialy if you have grew up playing the old school gta's it really brings back memories, Awsome games, Highly Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Police officer: This is just like training! So in training they sent a psychopath with a minigun to murder you and your friends and army men?",
            "review_score": "1"
        },
        {
            "review_text": "I know they say its only compat with WIN2000/XP, but they dont even give you the option to install this when running other operating systems :|",
            "review_score": "1"
        },
        {
            "review_text": "Saw this for £1.74 or something back in the Autumn sale and couldnt turn it down. My most loved game ever for so cheap! Highly recommend it to anyone who hasnt played it! Even better than GTA5, yes its that good.",
            "review_score": "1"
        },
        {
            "review_text": "Ahh, one of my first Grand Theft Auto games I've ever played, brings me such good memories playing this on my PS2. Absolutely one of the best Grand Theft Auto classics, ever made.",
            "review_score": "1"
        },
        {
            "review_text": "So I got this game during the steam Christmas sale, I have to say its amazing, I played some of it on the ps2, but the PC version is even better, so if your looking for a great game to play, I highly recomend this one. BUY IT NOW",
            "review_score": "1"
        },
        {
            "review_text": "80's miami on the top of my hand. What more could I wish for?",
            "review_score": "1"
        },
        {
            "review_text": "Vrock - the rock radio station The best music in this game Rockstar R*",
            "review_score": "1"
        },
        {
            "review_text": "SNORT SOME ♥♥♥♥ BEFORE THIS",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "this man can drive, pilot a helicopter, shoot ♥♥♥♥ing rpg rounds, can operate a tank, can windstand a 20m blast, can resist pain of 50000 bullets, but  can't swim .   11/9 would want a remastered version.  ",
            "review_score": "1"
        },
        {
            "review_text": "80's! And I can chop heads with a katana!",
            "review_score": "1"
        },
        {
            "review_text": "This game is by far the best in the GTA franchise and one of my favourite games of all time. I played it way too much back in the days (over 12 years ago as of this review) and since I now upgraded my computer I thought 'why the heck not?' and even today this game still delivers! The soundtrack, 'Miami', 'Scarface', humour, memorable characters and so on. There is simply an endless amount of things to do in this game. I loved taking over the city and owning businesses, collecting money as well as messing around with all the side missions/collectables that actually gave me some useful bonuses.  I played through this game in about 16 hours and loved every second of it. This is a standard that games of today never will reach again. I got the complete experience for less than ten euros while other games offer less than half the entertainment for 50-70€ (let's not forget DLC and season passes). Since the game is on sale at the moment I can warmly recommend it to anyone who is even the tiniest bit interested.  Buy this game! You will not regret it! 10/10.   Note! If you are playing this game on a high end PC you may encounter various bugs and glitches. 90% of them are hilarious but the annoying ones you can easily fix using google.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the best games of my childhood. A true masterpiece. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Voice acting from Ray Liotta, Burt Reynolds and the legendary Danny Dyer. In the same game!  That's got to be worth a go...",
            "review_score": "1"
        },
        {
            "review_text": "From 3 to Vice City even though this game was made in 8 Months after GTA 3 it is a much better game. The Vibe, Story, Graphics all of it sold this game for me. It is a fantastic experience. I liked the combat even though it wasn't too much improved from GTA 3. The Story is much better than 3 (The Main Character actually talks) and is a lot like the Movie Scarface. (Tommy Vircetti = Tony Montana pretty much) The Radio has much more better tracks in my honest opinion. (Even Michael Jackson is on the radio) The graphics were slightly better than 3 not too much improved but improved. The Missions range from assassinations to flying an RC helicopter or to being chased by a chef. Even if some missions are repetitive and annoying and if you fail it you have to DRIVE all the way back. The map is a 80's spoof of Miami, Flordia and it looks and feels fantastic. a All in all it is a fantastic experience and well worth the 10 dollars I spent on it. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game... I played it on the PS2, the xbox and now on the PC. If you love the 80's you'll love this, just don't expect next gen graphics. Though there are attempts to update this to the RAGE engine (which drives GTA IV).  I still hold out hope that VC will make it to the Next Gen one day.",
            "review_score": "1"
        },
        {
            "review_text": "This is a Great Game, Set in the 80's, It's an Old Game (2003) but it's one of the best GTA Games in my opinion.  It's Great for Low End Laptops like Mine, One downside is it has a 30 Frames Per Second Cap, But honestly, that's smooth. I mean it's truly a fun game, and even though the graphics aren't great you can have a fun few days beating the game.  I know I've said it already, but I love how it's such a fun game, yet the graphics aren't great, so it makes you run 30 fps on the cruddiest of computers.  The 80's feel is nice, there are a lot of odd NPC's on the Street, and you can have a lot of fun playing this game.  Cheat Code: I'm not going to get in to all of the Cheats on GTA VC, but one of the cheats I like is 'ILOOKLIKEHILARY' it turns your Character in to Hilary King.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. It's GTA, do I have to say more?",
            "review_score": "1"
        },
        {
            "review_text": "THE best GTA game in the series",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game better then GTA 3 ",
            "review_score": "1"
        },
        {
            "review_text": "guys this game is too cool i have never complained about graphics so it did not bother me. but its filed in all the islands top to bottom with 80s style fun from night clubs and radio stations all the way to the great people in the game. it also has a sh*t load of weapons and a great story line that never leaves you bored ever! the best part is after you beat it its almost the best part. the game is fun to mod and put awesome cheats in! play it now buy buy buy ",
            "review_score": "1"
        },
        {
            "review_text": "Started a fight with a grandma walking down the street. She decided she wasn't taking no junk and started throwing kung-fu moves back my way. Knocked her %$@ out into Kent's checkpoint and started my next mission.   10/10 would beat G'ma again.",
            "review_score": "1"
        },
        {
            "review_text": "hands down out of the Grand theft auto games this and san andreas have the most memories for me. i still remeber when it came out for ps2 i had so much fun playing it back then so to be able to play it now on pc i couldnt ask for more, this game has funny characters a great story, its a must buy for anyone who likes open world games",
            "review_score": "1"
        },
        {
            "review_text": "amazing game with great setting 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game added exactly what needed to be added to the franchise. Bikes and helicopters.  There is little to criticize when a game just does everything it needs to do and does it well. Grand Theft Auto: Vice City is one of those games.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed everytime I played it. Never got bored of it",
            "review_score": "1"
        },
        {
            "review_text": "This game is really awesome. Its set in early 90's miami-esque island paradise. You are playing as the main protagonist in a blue shirt named Vicecity. He is a really cool guy and wants to take over the city paradise, but he's dirt poor so he has to do bad jobs for bad people. he uses nuttertools to get his weapons. and leavemealone to get the police off his tail. But the guy- Vicecity has a problemo, he cant swim. Akshely noone in this game can! i rate it 5/7!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "WOW! this game is the best. When i first played this (3-12-2014) i couldent help but think 'WOAH! those graphics are amazing!' The game made ma hard, although it is expensive. $5.00 is a lo of money. 100/10",
            "review_score": "1"
        },
        {
            "review_text": "Best GTA game in the franchise",
            "review_score": "1"
        },
        {
            "review_text": "Soundtrack. Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "It brings back my Childhood :D",
            "review_score": "1"
        },
        {
            "review_text": "Amazing all i have to say on all my years on gta this one is amazing so start on this one first don't like it try san andreas ",
            "review_score": "1"
        },
        {
            "review_text": "Tommy Vercetti, remember the name!  11/10 would remember the name again",
            "review_score": "1"
        },
        {
            "review_text": "It's the eighties, do a lot of coke and vote for Ronald Reagan.  Almost everything about this game is perfect, even on PC. Despite being one of the earlier PC ports of the 3D GTA titles it's relatively easy to control. There's a surprisingly large amount of graphics options for such an old game and especially one to come out in this time period when consoles were king in developers' eyes, so kudos to Rockstar for actually thinking this out.  I really think that the 80's are the perfect decade for GTA. The decade of decadence. Crime was getting more common, drugs were getting harder and easier to get, and the media was getting more violent. It was a time of total unhindered immoral activity. It basically screams Grand Theft Auto.  The soundtrack is amazing. I'm really into heavy metal and new wave, so I'm very biased when it comes to this kind of thing, but trust me, there's nothing like running over pedestrians in a muscle car while listening to Iron Maiden's 'Two Minutes to Midnight' or fleeing from the police in a taco truck while blasting 'Video Killed The Radio Star' by The Buggies.  There's a wide variety of melee weapons, and while the guns are nice I think the wide variety of weapons such as the chainsaw (straight out of Scarface) and a ♥♥♥♥♥ really set the tone for the game.  Tommy Vercetti is also a great character. He's beautifully two dimensional and the writers didn't try to ♥♥♥♥♥foot around that. He's a cold blooded Mafia hit man who's been released from prison after killing 11 guys and he's still ♥♥♥♥♥♥ off. He's not an Anti Hero like Niko Bellic who's just trying to get the American Dream, nor is he an Anti Hero like CJ who's trying to protect his neighborhood from drugs and rival gangs. He's just a really bad guy. If you cross him, he will kill you. If you mess up a job he's on, he will kill you. If you don't pay him, you guessed it, he will kill you. It's that simple. His American Dream is making others' lives a nightmare.  However, there are two things I don't like about this game though. One is the graphics. The models, especially the character models, are terrible. They haven't aged well, and the game was obviously made in 2002. This is especially noticeble when the various 'sexy' female characters are onscreen, because while they are obviously human, they basically look like they had their breasts and hips glued on. The wacky 80's hairstyles have a simaler problem, as do the brightly colorerd clothes that the majority of the main characters (and Tommy himself) wear. They look as if they've been painted or nailed on to some kind of puppet or mannequin. I honestly think that the models in System Shock 2 looked better than this.  The second thing is the lack of multiplayer. Add the fact that MultiTheftAuto is terrible and you have a huge problem. I understand that when Vice City came out, the main focus was on the PS2, which at that time still didn't have online multiplayer capabilites, so it is forgivable, but still, it's disappointing.  Overall, I think this is the greatest Grand Theft Auto game out there. Yes, even better than San Andreas. It's just totally tubular.",
            "review_score": "1"
        },
        {
            "review_text": "  iwonnt my money back",
            "review_score": "1"
        },
        {
            "review_text": "A big jump from GTA III and still my favorite after all these years.  Can you say perfect?  -Tommy Vercetii",
            "review_score": "1"
        },
        {
            "review_text": "When the latest installment in the Grandma's Toffy Autopsy franchise was announced at E3 next year, I Instantly peed my pants and cried like a baby until I fell asleep on my dog and killed it. I got a beta key from Gabe Newell so I had early access and the ability to review the game before anyone else. It wasn't really epic and random like Saints Row XXXVI so I didn't really like it. You play as Tommy Versace, a man who fights crime for the sake of New York and to avenge his recently murdered great uncle, Jimmy Dean. I think it takes place in Las Vegas.   8/ate",
            "review_score": "1"
        },
        {
            "review_text": "Classic! The soundtrack is the best.",
            "review_score": "1"
        },
        {
            "review_text": "this game has always been one of my favorites lots of replay value",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun. Like all the GTAs but the only diffrent thing between all the GTAs is the graphics but they all are fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Demolition man = Game over",
            "review_score": "1"
        },
        {
            "review_text": "Feels just like 1985 no matter what year you play this in.",
            "review_score": "1"
        },
        {
            "review_text": "For the first time i buyed it, and you know what? I love the 80's, i mean, this musics, make me feel good, i have 13 years but i love that musics (i love SOAD too)! And obviously i love this game, so cool, and these lens flare effects, i played it 10 years ago, when i was a little kid, and i still liking it today! Recommend it too much!",
            "review_score": "1"
        },
        {
            "review_text": "let start pros 1. good controls  2. mods 3. good story cons 1. mouse glitches every now and then i dont have a gaming pc and i can still run the game no problem 60fps",
            "review_score": "1"
        },
        {
            "review_text": "I still remember this masterpiece being released back in 2002.   This game, which is set in the 1980's not only combines my favourite time period, but also a great film - Scarface!  Much of this game has missions which relate to Scarface, and the 1980's in some way. It's a great gem, which is perfect for 1980's fan boys like myself.  The graphics on this game look similar to Minecrafts, but try not to let that put you off. This game is worth it for the story. It's a magical GTA, and one of rarity.  Rockstar unfortunately haven't experimented with a GTA game since Vice City in terms of the time period, and story telling. This is why you must try this game at all costs. I doubt Rockstar will tell a GTA game similar to that of a classic movie again.  If you love Scarface, and if you love the 1980's, then this game will rock your world. Just beware that it has out-dated, crappy graphics.  I hope one day Rockstar re-release this game with up-dated graphics, or either a GTA Vice City 2. PLEASE! :)",
            "review_score": "1"
        },
        {
            "review_text": "Thank God for Tommy Vercetti and VCPR. Everything else is fine, but those two elements alone should just convince you to buy this classic! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "its a good game",
            "review_score": "1"
        },
        {
            "review_text": "This game is all I could think about when I first saw the Test of Time Award. There we go, Tommy boi.",
            "review_score": "1"
        },
        {
            "review_text": "The 3D Grand Theft Auto that got me hooked. I was a fan of the original GTA on the Playstation. When I got older, I got the GTA III/ Vice City two pack for Xbox. I wasn't a big fan of III, but Vice City was, and still is, awesome. I love the setting. The music, the clothes, the culture, it's all cool.   If you play this on the PC, I would recommend two mods. First is ginput, which allows you to play the game with the 360 controller. Make sure you download the extra stuff so it uses the same controls as GTA IV. The second is the widescreen patch. It fixes the aiming issues I was having while using widescreen mode.",
            "review_score": "1"
        },
        {
            "review_text": "Nice shirt.",
            "review_score": "1"
        },
        {
            "review_text": "Classic sandbox game with lotsa cool cars, a big world to explore, loads of stuff to do, and totally radical 1980s pop culture references and parodies tying it together.",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "it's cool",
            "review_score": "1"
        },
        {
            "review_text": "A classic GTA game, yet pretty outdated. Great story, AMAZING soundtrack, but comes with many frustrating mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "i do like this game but if you are looking for a old gta than get gta sa",
            "review_score": "1"
        },
        {
            "review_text": "This game brought back memories *-*",
            "review_score": "1"
        },
        {
            "review_text": "Best GTA ever.  Best sandbox ever.  Best in-car radio ever.  Infinite/10 - would own in 4 different formats.",
            "review_score": "1"
        },
        {
            "review_text": "JUST LOVE IT. MY CHILDHOOD IS IN THAT GAME.",
            "review_score": "1"
        },
        {
            "review_text": "multiplayer mod such fun wow 10/10",
            "review_score": "1"
        },
        {
            "review_text": "does not work unless you fix settings it i a good tho o it is worth it to do just a lot of WORK",
            "review_score": "1"
        },
        {
            "review_text": "She was more like a beauty queen from a movie scene I said don't mind, but what do you mean, I am the one Who will dance on the floor in the round She said I am the one, who will dance on the floor in the round  She told me her name was Billie Jean, as she caused a scene Then every head turned with eyes that dreamed of being the one Who will dance on the floor in the round  People always told me be careful of what you do And don't go around breaking young girls' hearts And mother always told me be careful of who you love And be careful of what you do 'cause the lie becomes the truth  Billie Jean is not my lover She's just a girl who claims that I am the one But the kid is not my son She says I am the one, but the kid is not my son  For forty days and forty nights The law was on her side But who can stand when she's in demand Her schemes and plans 'Cause we danced on the floor in the round So take my strong advice, just remember to always think twice (Don't think twice, don't think twice)  She told my baby we'd danced till three, then she looked at me Then showed a photo my baby cried his eyes were like mine (oh, no!) 'Cause we danced on the floor in the round, baby  People always told me be careful of what you do And don't go around breaking young girls' hearts She came and stood right by me Just the smell of sweet perfume This happened much too soon She called me to her room  Billie Jean is not my lover She's just a girl who claims that I am the one But the kid is not my son  Billie Jean is not my lover She's just a girl who claims that I am the one But the kid is not my son She says I am the one, but the kid is not my son  She says I am the one, but the kid is not my son  Billie Jean is not my lover She's just a girl who claims that I am the one But the kid is not my son She says I am the one, but the kid is not my son  She says I am the one, (you know what you did, (she says he is my son)breaking my heart babe) She says I am the one  Billie Jean is not my lover Billie Jean is not my lover Billie Jean is not my lover Billie Jean is not my lover (don't Billie Jean) Billie Jean is not my lover Billie Jean is not my lover",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would kill Lance again.",
            "review_score": "1"
        },
        {
            "review_text": "Ah GTA Vice City. Such an old gem, it may not be as favorited as San Andreas was (even though this came out a year or 2 before San Andreas) it's still a great game and my personal favorite. Memorable characters, great story, plenty to do, tons of great music on the radio stations (my personal favorite station is VRock) and it all takes place in a Florida setting. I mostly played the PS2 version of the game and find it more fun because of the controller, but the PC version is still good. But if you have a PS2 laying around and don't have this game or if you don't have a PS2, but luckily have steam. Buy this game. Seriously just buy this ♥♥♥♥ing game. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "One of my first GTA Titles I played. Highly recomended if you're new to the GTA franchise",
            "review_score": "1"
        },
        {
            "review_text": "most gun sounds are more realistic here than in San Andreas",
            "review_score": "1"
        },
        {
            "review_text": "One of the wierdest and most fun fps games ever! Some people call it hat simulator and I can see why there are tons of hats from strange hats to unusual hats this game is all about hats!",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best Grand Theft Auto ever made. Remember to wear a cop uniform if you're going to the army base!!",
            "review_score": "1"
        },
        {
            "review_text": "GTA Vice City is an undying classic that every gamer should own! I bought this game twice. I own it on IOS and PC. I completed GTA VC 4 times and it's fun!",
            "review_score": "1"
        },
        {
            "review_text": "This is a Classic! Playing this game in 2016 I am having as much fun as I did when it came out!",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion the best GTA to date. The story is good, entertaining, and the music is the best in all the series. Worth the buy 100/100 times.",
            "review_score": "1"
        },
        {
            "review_text": "Best GTA game to come out. Amazing",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun imo, just one of them online car games with a serious upgrade, definitley worth the £2 i spent on it in the sale.",
            "review_score": "1"
        },
        {
            "review_text": "Memories man, i could not resist to buy the game for the third time. I didnt know how to reward the developers in one form or another so i decided to buy the game three times.....god 14 years agoo  10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the Best GTA",
            "review_score": "1"
        },
        {
            "review_text": "It's not like i remember it from being a kid but who cares I miss this game so much and i'm glad I can play it again because my ps2 lost somewhere in my attic lol",
            "review_score": "1"
        },
        {
            "review_text": "I GUESS THE RAINS DOWN IN AFRICAAAAAAAAAAAAAAAA  10/10  member berries south park season 20 lol",
            "review_score": "1"
        },
        {
            "review_text": "Still love this game",
            "review_score": "1"
        },
        {
            "review_text": "I played this game in the past for hours on end and recently rebought it because I no longer got the original to work on Windows 7.  It's a classic, with tons of things to do, a big open world (they even say its the biggest next to GTA V) and a 'back to the eighties' feeling with cool music on the various radio stations.",
            "review_score": "1"
        },
        {
            "review_text": "+  Great graphics; Open World sandbox game; Nice story; Nice voice acting, now including the protagonist with VO; Sound options; Now it has ingame map; Various radio stations to choose from and they are great; Nice resolution options even for laptops; Purchasable properties; Drivable vehicles like cars, bikes, heli, boats, etc; The saturation is great on this one and the game feels more lively.  -  No graphical options apart from resolution option and minor; Can't swimm, he dies instead;  Played it at 1366 x 768 x 32 with 30 Fps cap, max allowed on my laptop.  Score: 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Good GTA game, even if outdated today. It is still very fun, though",
            "review_score": "1"
        },
        {
            "review_text": "11/1",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly the last truly fun GTA game without a sad ♥♥♥♥♥♥♥ storyline.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Too old to be played today. stop bothering my steam library",
            "review_score": "-1"
        },
        {
            "review_text": "If this wasn't such a bug ridden port, I'd probably play this, but I can't enjoy my favorite game of all time because on PC it is BROKEN.  Mouse problems Black Screens Saves lost And the list goes on...",
            "review_score": "-1"
        },
        {
            "review_text": "Mouse bugs out immediately. Unplayable. Windows 7.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice game, ♥♥♥♥♥♥ port. Even if you are dying to play it, I would tell you to pirate it. It is not worth it. It's unplayable.  It makes my mouse's sensibility go higher on the Y axis than on the X axis. Tried googling it, downloaded some mods, tried changing settings but nothing.  Regardless of the port, I think this game is outstanding, and deserves to be played at least once, so with all the GTAs.",
            "review_score": "-1"
        },
        {
            "review_text": "doesn't work! application has stopped working. win 7 64 bit i have read some forums, and did what they write, but still doesn't work !",
            "review_score": "-1"
        },
        {
            "review_text": "Alright, it is an older game so the graphics is understandable, what is not are all those little things that make the gameplay rather annoying and make you wish there was an invincibility code. But that wouldn't help because with the poor camera work and irritating movement you can't complete some of those quite difficult quests.  The pluses are for the funny characters, radio tracks and interesting quests, but the above minuses took a lot from me to enjoy the game. If you want a similar type of game it's better to play Saints row 2.",
            "review_score": "-1"
        },
        {
            "review_text": "this game keeps crashing",
            "review_score": "-1"
        },
        {
            "review_text": "do NOT DOWNLOAD IF RUNNING a windows that is quite new for the screen resoloution does not go low enough. i think...correct me if i'm wrong...just won't run on my computer.",
            "review_score": "-1"
        },
        {
            "review_text": "I purchased this game when I finally got a job about a year ago and I haven't been able to play it. Error after error, I feel like I was robbed after paying for the trilogy and only have San Andreas work. If you really think you can get away with selling a game without fixing it, you're ♥♥♥♥ed up. Even SEGA tweaked JSR after the port (and SEGA is pretty much the laughstock of the neighbourhood). ",
            "review_score": "-1"
        },
        {
            "review_text": "It hardly ever runs on my super computer.Still fun even though it's almost 10 year old game.used to play this on the playstation 2,i have over 200 hours on the PS2 on Vice City not as fun on the PC.",
            "review_score": "-1"
        },
        {
            "review_text": "this game f**king sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Constant Alt + Tab for cutscenes to show, (running on very high spec PC I'll add), crashes having to do 10 missions all over again. terrible PC port, great game otherwise if these problems from 13 years ago were ironed out. this and GTA IV are buggy and crash non-stop, yet San Andreas (with many mods) and GTA V (also running a ton of mods) runs at 60FPS no problem... whats wrong? beats me... 3/10 PC \\ 8/10 PS2",
            "review_score": "-1"
        },
        {
            "review_text": "Not compelling, realistic, or pleasant to look at in-game.",
            "review_score": "-1"
        },
        {
            "review_text": "I like the GTA games, but this might be ok if the graphics weren't locked on minimum settings on this steam version, the controls and responses seem a little clunky compared to more recent games like Sleeping Dogs, which I think is much better. The game somehow feels older than it is even, but it's still fun to try to evade the police for as long as possible before getting taken down.",
            "review_score": "-1"
        },
        {
            "review_text": "grand theft autism",
            "review_score": "-1"
        },
        {
            "review_text": "Dear Steam-   What the ♥♥♥♥! I bought this game a year ago and it woked fine! Now the game doesn't even start! There is no reason for this to be happening! I am dissapointed with you steam and rockstar. This is a great game with no windows vista, 7, or 8 support! what the hell? It worked fine before on this computer until it stopped having compatibility for the newer windows operating systems. My opinion is to either not buy the game at all, or wait until it has windows support again. Because it is uneededly hard to boot this game up! For some people (including ME) its impossible! This is the best GTA game with no support! So the guys who have to wait for GTA V cant play any of the better GTA games! This is unacceptable and it needs to be patched in the near future or i want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game. But it's impossible to play this steam version. Disgusting mouse Y-axis flying all over the place and apparently I can't fix this because it's through steam. Grrrrrrreat. ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "This port is garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "i can open this game i wan't a refund and ima get it or ima fight for a refund",
            "review_score": "-1"
        },
        {
            "review_text": "being the godfather to one of the greatest game series of all time i sadly do not recomend this to any seasoned pro at any of the GTA games because this isnt like any of them, no aiming, random crashes, and cutscenes that announce stupid ♥♥♥♥ that arent skippable",
            "review_score": "-1"
        },
        {
            "review_text": "On the playstation 2 I absolutely loved GTA:Vice city. Before I get into particulars i'll broad-stroke the premise. GTA: Vice city was launched for the PS2. It can best be described as a sandbox adventure game. Youre given various missons and objectives by people and advance the game by completing these missions. Theres not a whole lot of missions aside from the main story but who needs sidequests when you are wreaking havock at every turn?     A large part of this game is the fun you make for yourself. Walking into this I was very excited to relive some old memories with crispy graphics, tiny load times and nearly endless draw distance. What I found was just that, except for a few small details that ended up being big problems. Remember on the good ol' PS2 when you would boot up Vice City and you had the time to walk away, get some snacks, maybe use the bathroom and sit back down and only have to wait a few moments more for the initial load? No more! Load times and load zones are no longer an issue here.     So was pretty stoked. I couldnt wait to see all(or most) of vice city rendered as once in the highest of resolutions. And this game delivered that for me too. It was a wonderful trip down memory lane, that is, until I had to take control of the main character. Unfortunately, the controls dont translate well to mouse and ketboard. At first it wasnt a problem, I used a ps3 controller. There are too many commands that have to be mapped to too many buttons, it wont let you have the same controls that you did on the PS2 version. I tried many different control schemes and ideas but none worked the way I really wanted them to. Eventually I gave up.    There ARE programs and doodads that you can use that should give you a better expierience with the controls. Also, vice city is very playable as is, out-of-the-box. I just couldnt get comforable with any controll schemes I tried. If youre looking for a GTA game you can play on an older computer I'd reccomend GTA:San Andreas. It's slightly more easier to play on mouse and keyboard. If you are looking for a little bit of nostalgia, you would be better off booting up you PS2, and digging out your old copy.",
            "review_score": "-1"
        },
        {
            "review_text": "It is OK But you are much Better Of With GTA San Andreas Because Of The Shi**y graphics",
            "review_score": "-1"
        },
        {
            "review_text": "The BEST game. First game to show me how much I love sandbox games, way back in the day. Only drawback is the outdated graphics, which is easy to get over.  Story 9/10 Graphics 6/10 Soundtrack 10/10 Playability 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I finished Demolition man with 1sec left in one try!!! 11/10 great story,such wow,much love it.  play it too!! its classic but worth it :)",
            "review_score": "1"
        },
        {
            "review_text": "Graphics might be a bit old, but the music, the atmosphere... it's a timeless classic!",
            "review_score": "1"
        },
        {
            "review_text": "Still the best Grand Theft Auto available ATM",
            "review_score": "1"
        },
        {
            "review_text": "Again Another Classic Childhood Game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and enjoyable, has an amazing soundtrack and a pretty good story. tommy (the main protaganist) isnt all that likable (well to me he isnt) but it doesnt really take away from the overall experience with the game. although i have had some problems with the frame rate and some controls not working when you turn off the frame limiter. if you can deal with those small problems then it is definetely worth a buy in my opinion. if you have are used to a smooth 60 fps on all your games and you dont think you could handle your frames being limitied to 30 fps, and a fair bit of stuttering every now and then. i dont reccomend that you get this game. but if there was one piont of vice city that i would like to push on you, it is the soundtrack. it is great and there is a radio station for pretty much everyone. but if you are after that 1980s miami vibe i would suggest Emotion. so once again, if you arent too bothered with not having a flawless and mooth experience, get this game. but if you are one of the few that could not handle even looking at a game unless it is running at a buttery 60 fps. i suggest you to give this game a shot, it really is great. and if you dont like it its not much money wasted. its GTA vice city after all",
            "review_score": "1"
        },
        {
            "review_text": "Good game, always loved GTA Vice City. Was the start of the GTA Franchise for me. Funny to think back in the day the graphics were amazing.  Controls were a little bit off though. Had difficulty playing initally because my mouse would not work, but switched to windows 98 mode and that fixed that issue.   Game play also feels a little bit faster than I remember, but that might only be because it has been so long. My theory was because of the better computer specs it runs a little faster than on the PS2. Found fast cars almost too fast to drive and would take the slower ones. Plus in a shoot out amour and health would go down so fast.   Still a great game even with the minor issues, good to play when bored.  4/5 for me!",
            "review_score": "1"
        },
        {
            "review_text": "Pre-marital sex with ♥♥♥♥♥♥♥♥♥♥s never satisfies so my baseball bat is my refund policy. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Ahh, no nostalgia filled and fueled run through of retro games would be complete without 2002's finest edition of pure Florida carnage.",
            "review_score": "1"
        },
        {
            "review_text": "Absolute classic! Great gameplay, amazing 80s atmosphere, fitting soundtrack, funny as hell.",
            "review_score": "1"
        },
        {
            "review_text": "good game i advise everyone to play it once",
            "review_score": "1"
        },
        {
            "review_text": "This game is as amazing as i remember, the soundtrack does not dissapoint amongst the humerous radio stations, mayhem and destruction that GTA is well known for. This game should take between 8 - 12 hours doing just the storyline quests, not to mention if you wish to take part in the many other parts that this game has to offer including purchasing property, car collections, races, rampages etc.  I deffinately reccomend this game if you are a fan of new or old GTA or just enjoy sandbox games, but keep in mind that this will not be as expansive as the newer GTA games or san andreas.  It is well worth having this game in your library.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a true teenhood classic for me. It has the best soundtrack and storyline of any GTA and is difficult but realistically 100% completed. I have played through the game twice on PS2 and twice on PC and everytime I hear 'I Ran (So Far Away)' or 'Cars' I want to play it again.",
            "review_score": "1"
        },
        {
            "review_text": "Controls on keyboard need fixed",
            "review_score": "-1"
        },
        {
            "review_text": "What can I say. Grand Theft Auto: Vice CIty. An icon in the sandbox/open world genre, this game delivers intense action gameplay, as well as an artistic flair of Miami Vice, Scarface, and Florida, all in one. Few of us will ever forget driving through the streets of Vice City for the first time.",
            "review_score": "1"
        },
        {
            "review_text": "See you around handsome ( ͡° ͜ʖ ͡°) 10/10 would be handsome again.",
            "review_score": "1"
        },
        {
            "review_text": "Preetty good i guess ",
            "review_score": "1"
        },
        {
            "review_text": "Will beg for someone to complete RC quest",
            "review_score": "1"
        },
        {
            "review_text": "What we have here is without any doubt the best Grand Theft Auto in my opinion. Superior even to GTA 4 in means of atmosphere story and soundtrack. Runs great on Vista, almost for free so buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Complete edit: I take back everything I said. Yes, the game is fantastic, and it is a fine port with little bugs. I don't know what happened before but now I wholeheartedly recommend this fantastic game.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game! Used to play this on my PS2... like... 5 or 6 years ago now. Contains the best music in the whole GTA series. The storyline is good, yet again, one of my favourite in the GTA series.  It may not feel like the original PS2 version but it's still an astonishing game however it is played.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Instant Classic  Pros: +I own every GTA game from GTA 1 to GTA V and this is the best one. Game is a masterpiece. I have beaten it maybe ten times on PS2.  +The plot, characters, setting, and music are phenomenal. Cons: -Graphics are obviously dated and not very good by modern standards, but after a few minutes you get used to it. -Missions are pretty easy, I think it was harder on PS2 due to aiming with the controller. As far as the PC port goes, this port is okay, runs smooth 1920x1080 32 bit without any problems out of the box. The controls are kind of odd. Vice City can probably run maxed on any computer sold in the last decade. My OS is Windows 7 Pro 64 bit. You should disable aero theme or modify the game .exe setting in the steam install directory to disable themes. Otherwise, your mouse will not work correctly.",
            "review_score": "1"
        },
        {
            "review_text": "Step 1: Find game with better soundtrack Step 2: Come to terms with your failure    Additional Information:",
            "review_score": "1"
        },
        {
            "review_text": "How can you say no to this piece of nostalgia?",
            "review_score": "1"
        },
        {
            "review_text": "Win 7 x64. I bought the GTA pack and GTA3 didn't work. I was disappointed when vice city also didn't appear to work. I then discovered that running the testapp.exe in the vice city folder worked. It takes 2 attempts but it always works after the second try. The only downside to this, is the time isn't counted on the steam app.  Obviously it's a bit dated now but it was a good game in its day with a good selection of songs on the in game radio. I recommend playing this before San Andreas. It might be hard to come back to if you try the newer ones first.",
            "review_score": "1"
        },
        {
            "review_text": "I bless the rains in Aaaaafrica!",
            "review_score": "1"
        },
        {
            "review_text": "'The 1961 Ferrari 250 GT California. Less than one hundred were made. My father spent three years restoring this car. It is his love, it is his passion..'  '..It is his fault he didn't lock the garage.'",
            "review_score": "1"
        },
        {
            "review_text": "Now we're talkin FUN. This is a great fun action shooter adventure roleplay game. I never had so much fun beatin up 'hehe you figure it out' than I did in this game. Boy did I beat the crap out of them the only thing missing was tar and feathers for them and a rail to run them outside of town on. ;) (there's a hint) hehe",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing badass classic game. love it!!",
            "review_score": "1"
        },
        {
            "review_text": "Bad graphic stripping. 10/10 would buy GTA 69",
            "review_score": "1"
        },
        {
            "review_text": "Such a good game but spoilt by one MAJOR flaw that no other GTA game has: There are exactly 22 main story missions! On the other hand it is a brilliant game with lots of different things to do and see like the porn shoot or ice cream van drug dealings.",
            "review_score": "1"
        },
        {
            "review_text": "it is a blast from the past re minds me of the ps2 games i had when i was growing up",
            "review_score": "1"
        },
        {
            "review_text": "What can I say?...One of the bset games ever made springs to mind!",
            "review_score": "1"
        },
        {
            "review_text": "Love this classic GTA so far! The story is great. I highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Great action game!",
            "review_score": "1"
        },
        {
            "review_text": "The best of the series, not only do they get the story down, but also the 80s atmosphere, witty humour and music hits right home with this one.",
            "review_score": "1"
        },
        {
            "review_text": "I, personally, favor San Andreas, but hey, this is more for the awkward 'trying-not-to-be-racist-because-I'm-paranoid' crowd. Very 80s, lots of hispanic and white people. It's Vice City meets Scarface with a dash of Grand Theft Auto. I'd recommend this one to burned out San Andreas Players.",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia at it's finest. forgot how graphically bad this game is but it still makes me happy to play it again thanks to the scarface story line.",
            "review_score": "1"
        },
        {
            "review_text": "Just like the old console version, albeit with faster load times, mods, and an odd control scheme.",
            "review_score": "1"
        },
        {
            "review_text": "The second best entry in the GTA Series. The ambientation is masterfully done and recreated, lacks a little bit in the techincal standpoint (12 year old game) but still really playable. May have some issues with Windows 7/8.1/10 and 1080p monitors, but nothing that can be fixed with mods. Frame limiter may be needed in some missions because of the engine having issues with the game running at more than 30+ fps, making some speed needed missions harded than they would be normally.",
            "review_score": "1"
        },
        {
            "review_text": "controls are terrible no trigger or dpad support on xbox 360 controller",
            "review_score": "-1"
        },
        {
            "review_text": "Radio has Iron Maiden, Slayer, Megadeth, Anthrax, Judas Priest, Twisted Sister, Ozzy Osbourne, Motley Crue, David Lee Roth, and more that I can't think of at the top of my head.",
            "review_score": "1"
        },
        {
            "review_text": "It works well enough, but crashed often. I beat it back in the day on the PS2 and wanted to relive some of it with this version. If you can survive the random crashes it seemed good enough to play through. The old cheats still work too.",
            "review_score": "1"
        },
        {
            "review_text": "The first GTA I played was GTA V, so obviously I was a bit disappointed by the graphics. It is a fun game, but I highly recommend you play this game on a console, not a computer. Otherwise, this is still an enjoyable game with some fun missions. Its very irritating how easily the cars blow up and the controls on a keyboard suck. I really enjoy stealing a taxi or an ambulance and doing those missions.",
            "review_score": "1"
        },
        {
            "review_text": "Remembering good old days, about killing hokers for money. Good times indeed.",
            "review_score": "1"
        },
        {
            "review_text": "Great Nostalgic Game, Flash FM For Life &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This is still the Greatest GTA game ever well maybe tied with San Andreas.  Is my steam controller compatible with this game? Ive had problem getting it to respond",
            "review_score": "1"
        },
        {
            "review_text": "classics that'll never get old",
            "review_score": "1"
        },
        {
            "review_text": "one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "The best GTA game.",
            "review_score": "1"
        },
        {
            "review_text": "The game still holds up today. I love exploring the city and finding little secrets and places to have a shootout.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game, definately my favorite gta to date. Though its a bit dated thats nothing a few mods wont fix.",
            "review_score": "1"
        },
        {
            "review_text": "Vance, I still hate you",
            "review_score": "1"
        },
        {
            "review_text": "Very nostalgic. Might be old but still a really fun game.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion this is one of the best games in the series. The graphics may be dated but the gameplay is solid. I would recomend this Game to practically anybody.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "always a treat to play this",
            "review_score": "1"
        },
        {
            "review_text": "Fantasic enironment with lots of improvements made after GTA3. Best soundtrack in the series as well.",
            "review_score": "1"
        },
        {
            "review_text": "it awesome well its not too awesome buts its ok :)",
            "review_score": "1"
        },
        {
            "review_text": "great game a must have for any game collection",
            "review_score": "1"
        },
        {
            "review_text": "wow, so 80's, such miami, very pink, much atmosphere 10/10 best gta ever!!!",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING. BUY THIS GAME. NO QUESTIONS ASKED.  But the shooting is a little wonky.",
            "review_score": "1"
        },
        {
            "review_text": "SO TAKE. THESE BROKEN WINGS. AND LEARN TO FLLLYYY AGAIN, LEARN TO LIVE SO FREEEEEE. AND WHEN WE HEAR. THE VOIIICES SING. THE BOOK OF LOVE WILL OPEN UP, AND LET US IIIIINNNNNNNN",
            "review_score": "1"
        },
        {
            "review_text": "This game is stright up fun, its like a blast from the past game, if you know what i mean. Just fun to play mess around and enjoy a 70s free roam game",
            "review_score": "1"
        },
        {
            "review_text": "Quality game with award winning graphics for an old gta. I love the game, i suggest that you pick a copy up",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best GTA´s that i´ve ever played! Years ago it was a gift that i got from a friend for the PS2. It took months to realize that there are Cheats which make it possible to fly with cars or something like that. Now i don´t need Cheats to have fun with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome games that brings back memories. I really like the atmosphere of the 80's, and especially the music. Entertaining missions with a lot of humour and references to 80's movies/ tv-series. The game mechanics isn't the best and especially the aiming feels off, but that's minor flaws in a otherwise great game. The amount of mods makes the game very customizable and can be renewed for numerous play-throughs.",
            "review_score": "1"
        },
        {
            "review_text": "Again what ♥♥♥♥♥♥ mouse controlls....but anyway i never actually got a chance to play vice city when i was a kid...sad....this game is awsome and in my honest opnion its way better then sanandreas...but dont tell rockstar. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "GTA: Vice City is an amazing game, It's a classic from my childhood memory when my brother finally bought a PS2 and I watched him play for hours/days before he would even let me play but when he did I was hooked. To this day I still play the GTA series and own every game. Driving through Vice City with the old music playing really made you feel like you were cruising around Miami back in the 80's and especially if you pay attention to the storyline. I highly recommend if anyone like playing the new GTA's they should definately purchase the old ones!",
            "review_score": "1"
        },
        {
            "review_text": "GTA games all seem to be good. Some are better than others, this is one of those, infact the best of the GTA's I have bought this game so many times due to loss, different platforms, etc. I do not regret buying it any of the times.   My brother introduced me to this game, at first i would just watch him play for hours (yes, even that was fun) and when I was allowed to play I didn't stop for quite a while, I rember recommendin L4D2 and saying that it was 'the best FPS game ever!' I was wrong as I clearly didn't think of this game, this is not just the best FPS game ever, it is the BEST GAME ever.  For just £5.99, 7.25 EUR or $9.29 This is a bargain for that price, (prices may be different from time of recommedation) normally you get rubbishy little games for £6, Vice City is so under-rated because it is dated, but it was only 2 years before San-Andreas (Another good one by the way) yet everyone seems to dismiss VC.  I really can't say enough to explain how amazingly outstanding...",
            "review_score": "1"
        },
        {
            "review_text": "This isn't a brilliant game but it is good and fun to play. I said in my review on GTA III that I didn't like it that much but this is also an old game yet I love this game SO FAR as I have not yet completed it as I have been playing other games. With this game, you never feel like playing it but when you do, you just get dragged into addiction mode and you will play it for the rest of the day. Great story line so far, fun free roam and unlimited action. If you hate games where the cops are dumb then I do not reccomend this. The cops are absolutely stupid so it's really fun to mess around with them. The map is nice and the graphics are quite good compared to GTA III. If you like GTA then this is another MUST HAVE for when you get bored. Plus it's cheap for such a beastly old game!  Downsides to it are the cars are a bit difficult to drive and the aiming is a bit bad but don't worry! The rest is fine.  I rate this 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Best GTA episode ever ! Buy it, play it !",
            "review_score": "1"
        },
        {
            "review_text": "To me, Vice City is the best Grand Theft Auto game, period! I have played every GTA since the first one (which is a blast by the way) and was dissapointed by the stereotypical tone and gameplay of San Andreas. Vice City on the other hand is very clever in it's writing, the sandbox element is great, the soundtrack is one of the best in video game history (look it up if you don't believe me) and the 'sexual content' is not tastless and vulgar as the last two games. Vice City had that cool 1980s feel and I loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awkward with the keyboard controls... I can't get it to work quite right. But still alright if you are patient with it. GTA IV is better fun for not that much more.",
            "review_score": "1"
        },
        {
            "review_text": "If it asks for CD download the Audio folder from a less legal source and put it into your documents\\gta vice city user files folder ",
            "review_score": "1"
        },
        {
            "review_text": "This was one of my all time favorite on ps2 and still fun to play love radio in this game makes it feel just right",
            "review_score": "1"
        },
        {
            "review_text": "Simply one of the most consistently entertaining games you'll ever play. Violence, comedy and 100% '80s everywhere you go! ESSENTIAL!",
            "review_score": "1"
        },
        {
            "review_text": "still the best GTA game ever made in history",
            "review_score": "1"
        },
        {
            "review_text": "You play as Tommy Vercetti.A guy who did 15 years behind bars because of a story that happend in Vietnam.Now he's off into Vice City to make a drug deal.But as it goes they get ambushed,friends got killed and you need to find the drugs and cash back for your boss Sonny Forelli.Games awesome.Lots of things to do,immersive storyline and lots of side mission,dark humour,lots of easter eggs and hints and much more.Buy it it's worth it in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Play this if you like having a cruel sense of humor and enjoy stealing tanks and running people over in mo-peds",
            "review_score": "1"
        },
        {
            "review_text": "Even though its old, its still a goldie. It's one of the better GTA's. Just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "The best GTA",
            "review_score": "1"
        },
        {
            "review_text": "The best of the GTA III Era!",
            "review_score": "1"
        },
        {
            "review_text": "This game is just as amazing and nostalgic as I thought it was gonna be when I went out of my way to get this. Thankfully, since it's an over ten year-old game, it'll run smoothly on what ever machine you have. It has memorable characters, beautiful design that just oozes 80's, fun gameplay, and my favorite element of all.....the soundtrack....good god is the soundtrack perfect! You got it all: Iron Maiden, Hall and Oates, The Pointer Sisters, Herbie Handcock, Judas Priest, Forigner, Toto, and Many more! There are a few nitpicky things that I have with the game, like some of the graphics are really dated, and when you beat the game, there's really nothing much to do, and I wish there was No Cops at all cheat. But aside from that, It is a true masterpiece, and being my first GTA and M rated game I ever played, I loved this game when I first played it all the way back in 2004, and I still love to this day. It never gets old, and I think it's a good way to get introduced to the GTA universe.  And with that, it earns a...... 10/10! Must own! Especially at it's normal price.",
            "review_score": "1"
        },
        {
            "review_text": "This is bull ♥♥♥♥ like red bull but without bull so red ♥♥♥♥ and red ♥♥♥♥♥♥♥t. What ever ...",
            "review_score": "-1"
        },
        {
            "review_text": "if the soundtrack was available i would be so happy   complete gold",
            "review_score": "1"
        },
        {
            "review_text": "This is what Scarface: The Video Game should've been.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game when I was at school, probably about 12 and still love it!   I would recommend this game to anyone, especially if you're kind of new to the GTA series, granted the graphics and engine is not the best but the fun never ends :)  Pure nostalgia going back and playing this, true classic!!   Now stop reading review and buy it already :P",
            "review_score": "1"
        },
        {
            "review_text": "Another GTA sequel in my games collection. If you love old games, not realistic graphics, open world, it's worth buying!    10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Vice City as a game is brilliant and I know I'm not the only one who played close to its release and had a blast with its interesting story, charming characters and beaming setting. Memories such as the Malibu Club, Lance Vance Dance, Love Fist, Candi Suxx and of course the Mall are still present in my mind to this day.   Sadly however, as of 2015 when I am writing this review, enjoying this game, at least on PC, seems to no longer be possible.   The game has a frame limiter that is on by default that limits the game to 30 fps, however, there is an option to turn it off. Usually all would be fine and dandy from here, however, upon turning the frame limiter off a plethora of problems emerge, such as crashing, slow reversals in veicules, cutscene audio being out of sync and HUD flashing. This overall means that if you wish to even play the game steadily, you must do it at a constant 30 fps, which is really really noticeable on a game that already looks severely dated (as one would expect of course, being over a decade old).   I truly wish I could recommend this game to those who haven't played it before or those like myself who wanted to replay it again for the nostalgia as it truly is an absolute gem, sadly however, I find this port simply to be more trouble than its worth in its current state and the chance of Rockstar ever updating this game so long after its release is so unlikely it's not worth anticipating.",
            "review_score": "-1"
        },
        {
            "review_text": "Miami '80 is THE best GTA setting, period",
            "review_score": "1"
        },
        {
            "review_text": "I don't think this game requires a review, you know it's awesome.  Some key points that I will have to name however;  AWESOME music, you'll love it even if you have a horrible taste like listening to Justin Bieber or something silly. Graphics are dated now, but really not game-breaking at all, it has it's charms. Driving is far from realistic, but GTA 5 has taken the same approach as in this game again, very arcade, unlike GTA 4. Story is awesome too, I haven't played through it all the way yet but it's good, believe me. Wish there was multiplayer.   Even for nostalgic purposes, a must-buy!",
            "review_score": "1"
        },
        {
            "review_text": "Had this on Playstation 2 and I have to say having it on steam is amazing!!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "So nostalgic, I've played so much Vice City years ago, I miss those times!",
            "review_score": "1"
        },
        {
            "review_text": ".. A part of my childhood ♥  Funny cheat codes that you'll never find in Saints Row 3 or Just Cause 2 (unfortunately) ! Even motorcycle stunts are a pure pleasure!! Epic radio songs!! Must try , and don't rush missions, spend more time doing ♥♥♥♥ in the city instead ^^",
            "review_score": "1"
        },
        {
            "review_text": "Concept seems great, but controls are terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "This game made my childhood happy, thank you &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Arguably the best GTA there has been. It has an undeinable charm and the one and only Ray Liotta voices the strongest anto hero in the series so far. Mix that with great gameplay and a drop dead gorgeous setting, you have a legendary game.  Oh, and the endless mods are, for a better phrase, '♥♥♥♥ing insane'.",
            "review_score": "1"
        },
        {
            "review_text": "This game is undeniably fun, but it doesn't work properly on newer versions of windows. I used to play this on Win XP, and I had no issues, but when running it on windows 7, I get no mouse response in the game. It would work in the menus, but any mouse input in-game would be completely ignored.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game in the entire series.",
            "review_score": "1"
        },
        {
            "review_text": "This is the game that got me into GTA. I've spent more than 200+ hours on it and I've never looked back.",
            "review_score": "1"
        },
        {
            "review_text": "If you've not played a 3D GTA game I'd recommend you start here. I know GTA III was great, and many people claim it to be better, but for me GTA:VC was, and still is, one of the best games ever to exist. It's dated, yes, but even to today's standard of game it offers things that many haven't since. There are referrences to classic films throughout, and every sign is funny. San Andreas was bigger, yes, but with that space came... space, empty space. In Vice City around every corner was another little joke, or referrence. Every mission made sense in a weird and psychotic sort of way, and you really felt like Tony Montana (something that the Scarface game released after this failed to provide).",
            "review_score": "1"
        },
        {
            "review_text": "you see a building? blow it up. you see a cop car? blow it up. you see your reflection? blow it up. no destruction engine or anything it's just stupid fun with a rocket launcher.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "if you do 7 missions and quit the game without saving you'll probably be upset when you launch the game again",
            "review_score": "1"
        },
        {
            "review_text": "Love this game... I dedicated whole friday to this game, finished the whole game in one sitting. 8 hours... So much memories. Ugh. All aboard the feel train... After finishing this game I feel empty inside. Just like the time I finished wathching the last episode of 'The office' or 'Breaking bad'. 'GTA VI Vice City'. Please... (Did you see that? GTA  VI ce city) HAlf Life 3 confirmed...",
            "review_score": "1"
        },
        {
            "review_text": "Scarface: The Game  Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "&gt; Went to a pizza place stared at the employee for 2 and half hours  &gt; Told my dad about the game told me to get out of the room 1 min later i come back and he... spent all my money on houses and guns  10/10 -Pustachio",
            "review_score": "1"
        },
        {
            "review_text": "Best Grand Theft Auto. Always will be.",
            "review_score": "1"
        },
        {
            "review_text": "Grand Theft Auto: Vice City is my all time favourite Grand Theft Auto game. It is set in the 1980s in Miami. The missions are very well thought out and are very creative. For some reason the map of Vice City I played today feels a lot smaller than what I once thought it was playing it on my PS2 when I was younger. The soundtrack is just as good as I remembered. My favourite Radio Station was Flash FM. Although the soundtrack is amazing it is not what makes this game so good. As stated before, the missions are very good. These include Hitman missions, Rescue Missions and some of those God Damn annoying missions which involve you flying RC planes and helicopters attatched with bombs. Gang missions and Stealing missions. All these make a Perfect game. Although this game doesn't have much Replayability, when you finish the game there is a lot of stuff still to work on such as collecting all the packages. As grindy as it sounds, it actually is very satisfying when you finish it and you feel a sense of achievement.  - 10/10 Such a classic game. Absolutely beautiful in every way",
            "review_score": "1"
        },
        {
            "review_text": "I still recommend although I do have to say with this game I get an issue where only the game doesn't detect my mouse anymore but my computer still does its rather frustrating and unsurprising given the game developer, come on Rockstar can we get just one console to pc port that just runs well and doesn't have a bunch of little bs annoying issues. Although it is nitpicking at that point it would still be nice if these issues weren't as apparent in games from one given developer such as Rockstar.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics look good for its age. Good cheats. and just pure fun (does that make sense?) But if you have money to spend get it.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game and my favorite GTA game of all time! This brings back so many great memories for me! This is a 10/10. They do not make music like they used too. Over the years I have owned this game many times! Vice City is so important to me! If you havent played this game i recommend you giving it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Me: Lance. Lance, get in the car. *Lance keeps jumping and bumping into the nearby wall, losing some of his health. Me: LAAAAANCE! *Lance gets into the car.* Me: Awright now. Let's get you to the hospital... *Diaz's cronies show up in cars, shooting at us* Me: Ffff♥♥♥♥. *Driving to evade the gunmen, crashing into everything in sight* Me: don'tblowup,don'tblowup,don'tblowup,don'tblowup,don'tblowup... *Flames* Me: ♥♥♥♥! THAT'S ALL I NEED RIGHT NOW- *Quiet Riot comes on the radio* Me: ♥♥♥♥ YEAH! Radio: ♥♥♥ on, feel the noize! Me: *doing my best impression of a hair metal vocalist* GIRLS GRAB YOUR BOYS,  Both: WE GET WILD, WILD, WI- *Car explodes, killing Lance and I.*  100/100 - We get Wild, Wild, Wild.",
            "review_score": "1"
        },
        {
            "review_text": "Played the whole game once. This game is great except for one thing. The remote control helicopter mission. I think that I will have to use a trainer mod to complete that part.",
            "review_score": "1"
        },
        {
            "review_text": "it wont Run on my laptop or desktop.. can someone help me out ?? kinda like to play, still recommend the game tho",
            "review_score": "1"
        },
        {
            "review_text": "SO TAKE THESE BROKEN WINGS AND LEARN TO FLY AGAIN LEARN TO LIVE SO FREE",
            "review_score": "1"
        },
        {
            "review_text": "The game rules but the Y axis of the mouse is super out of wack and non adjustable. making the game a headache to play. BUT you can download a mod out there that fixes this and numerous other problems. You will have to down grade the game to its original version to run these mods, but it is all relatively easy. Just be prepared to do some work before you can really play this game. All the old PC GTA's have issues Rockstar never fixed (because Rockstar NEVER fixes any of their games) and apperantly really does not know how to make a game for computers, only consoles.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ can't really get more OG than this",
            "review_score": "1"
        },
        {
            "review_text": "MOTHER MERCY OF GOD THE MOUSE SENS FOR LOOKING UP AND DOWN IS BROKEN AS ALL HELL! BUUUUUT I FOUND A FIX ONLINE THAT WORKED 100% FOR ME. YOU DOWNLOAD THIS FILE ON THIS YOUTUBE VIDEO AND IT WILL WORK HOW IT YOU WOULD EXPECT IT TO!! shame on you rockstar for this!  google 'gta vice city mouse fix! pc 2014'",
            "review_score": "1"
        },
        {
            "review_text": "I arrived at my destination, but the song is too good for me to leave the car. :(",
            "review_score": "1"
        },
        {
            "review_text": "Now, gamers and gentlemen, what you see here right now is 'GTA: Vice City', one of the world's most epic PC game mankind ever created. The game's a open-world; you could go out and massacre everybody, destroy gangs, steal cars, and call in the FBI and the army and fight till the death. One of the new features is building investments, which is also a great feature that teaches you to stop wasting money on chicks and to get your head into the game. Great graphics for 2003 as well as the game engine. The story's a meh but who the **** cares; it's GTA. A 10 out of 10!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's Grand Theft Auto in he 1980's, what more do you want?!   Pros  +It's an open world game +There is actually a story (Looking at you GTA III)  +The graphics are ♥♥♥♥ing beautiful +The weapons are balanced out nicely +Interesting characters +You can fly choppers acrossed the map + An in-game radio with an ecxellent choice of songs  + Motorcycles are back from GTA 1 + It's a 1980's game in Miami +Gangs    Cons  -You can't swim  - It takes some configuring to get the controls just right - It won't work on Windows 8 (I play on Windows 7)  That's about it, now time to play more Vice City!",
            "review_score": "1"
        },
        {
            "review_text": "Focusing on the specifics of this is old game can actually run: It can, but with some caveats. If you have a controller plugged in, you may experience the whole 'spinning around uncontrollably until you unplug your controller' bug that seems prevalent in old games. Also, there seems to be some bug preventing the options menu from changing resolutions.  Other than that, the game does run, even on windows 10, without even requiring compatibility mode. Doesn't seem to want to crash. You can feel safe indulging your nostalgia and buying this.",
            "review_score": "1"
        },
        {
            "review_text": "Impressive at its time, only OK in today's standards.   Seeing that this game was released in 2003,it was a massive improvement over GTA 3, Rockstar gave it a voiced protagonist, polished world, better mission designs and tons of nostalgia. And here is where the fun ends,  By today's standards, the game is clunky, the mouse acceleration when you aim, the horrible controls for vehicles, bad optimization for keyboard and mouse users. And sure, you had your new helicopters, planes and boats, but the missions that had those were nightmares to play, namely bombs away and demolition man. You are better off playing it on a smart handheld device like a phone or tablet.   By no means is Vice city a bad game, it's OK. I guess due to hardware limitations, there was little space for a longer campaign and more missions, but for those who want to play a grand theft auto game on a low-end pc, buy San Andreas.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best Grand Theft Auto game ever.  Seemed like a steal for £5.99! ($7.90)",
            "review_score": "1"
        },
        {
            "review_text": "8/10  Pros: +Great map +Cool characters +Very long story +Cool guns +Great story  Cons: -Flying controls are ♥♥♥♥ed -Aim is really jumpy making it impossible for an accurate shot. -Can only save when you go to your safehouse. (Trademark but annoying if you have to go do something irl) -No restart mission option. You have to die in order to spawn next to a cab that will take you back.  Overall: One of the greatest games ever made!",
            "review_score": "1"
        },
        {
            "review_text": "The ultimate 80's loitering in cars simulator. I just park the car in a parking garage, and zone out listening to the radio. It's a really great musical experence!  The rest of the game? It didn't age so well, and now feels as dated as Miami in the 80s.",
            "review_score": "1"
        },
        {
            "review_text": "Ach, the always good Vice City. Those missions, this city, this radio. Awesome. And those babes on beach, och come on!",
            "review_score": "1"
        },
        {
            "review_text": "Exelent driving physics. Boats are hard to board. If you fall the water is lava.  Get into the millitary base, Gets wanted, Gets chased with a high wanted level, Drives into a pay an' spray, ???????? Profit.",
            "review_score": "1"
        },
        {
            "review_text": "Man, when I bought this game, I played for HOURS.  It improves so much from GTA III  +Bigger choice of weapons. Including the Kruger, Clever, Hammer, .357, and a Smoke Grenede. +Crouching, yes, CROUCHING, OMFG, CROUCHING, BEST F*CK!NG GAME EVAR, ITS GOT CROUCHING. +Many many more vehicles, like a pizza Faggio, PCJ 600, Admiral, VCP Maverick, and much more! +Cops are harder to get by, gangs no longer shoot you on site. +Purchasing guns, food to get health, and property is possible. +Bigger map. +Map menu +Clothes can be changed, also useful to get away from police. +80's copyrighted music +80's in general. +VCPR, VRock, funny commercials, stupid right wing 'mothers' +Can run on flashlight without lag. + etc.  What stayed the same from GTA III.  :Character has a quiff :Good story  What sucks.  -A few graphical glitches, but don't effect the game often, normally these are in areas you normally don't go in. -Hard as hell. -Hard to go forward with the Maverick. -Fernando -Vehicles can run you over and kill you with 100% armor and 100% health.  Its still a friggin epic game, I recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "It is a game fit for a warrior.",
            "review_score": "1"
        },
        {
            "review_text": "fun yo play again after so many years",
            "review_score": "1"
        },
        {
            "review_text": " What I liked about the game   • Interesting characters with stellar voice acting, especially Ray Liotta who did a fantastic job voice acting Tommy Versetti. The game also has well done cut-scenes which have a comedy element to them.  • There's so much to do, from doing main missions to doing rampages and Ambulance missions. The game is very rewarding as well, for example there are packages scattered throughout vice city and every ten packages you find you will get rewarded.  • I really enjoyed the 80's theme of the game. The soundtrack is absolutely fantastic; you will never get bored of it. The Dj's are funny and interesting to listen to.  • I liked the 80's look-alike cars, for example the cheetah looked like the Ferrari Testarossa, and the Infernus looked like the Lamborghini Countach.  • A large selection of weapons to choose from; Unlike other Gta games Vice City has a tool shop you can go to with a large selection of melee weapons. • I liked the Scarface references. • Big improvement from GTA 3; you actually have things to spend your money on now; like condos and businesses. This time round you can fly planes and helicopters, not some Dodo with its wings missing.    What I disliked or was disappointed with    • You can't swim. • When you buy houses or condos it's a shame there's no interior.  • You have to mess around with the control customization if you want to fly planes and helicopters, which is vital for success in some missions. • I wish there were more main missions.    Conclusion   Fantastic game with an amazing soundtrack. If you enjoyed the other GTA games or games which are similar, then I highly recommend you play this. 94/100  ",
            "review_score": "1"
        },
        {
            "review_text": "'knows that willy likes his ladies underwear, eh?'   when this is a casual line in your video game that you decided to play, you know you're in for a treat.",
            "review_score": "1"
        },
        {
            "review_text": "All time classic with maybe the best soundtrack/radio you can find in a game",
            "review_score": "1"
        },
        {
            "review_text": "- I put my head out of the gutter for one freakin' second, and fate shovels ♥♥♥♥ in my face. - Go get some sleep.",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the world &lt;3 :D",
            "review_score": "1"
        },
        {
            "review_text": "It only seems like Yesterday.....when it looked so rich and vibrent....now obviously things are different.  Love this game and everything about it.  Cant figure out how I used to think those graphics where the best we were ever going to get lol.",
            "review_score": "1"
        },
        {
            "review_text": "Best GTA Classic nuff said",
            "review_score": "1"
        }
    ]
}