{
    "app_id": 12130,
    "name": "Manhunt",
    "release_date": "2008-01-04",
    "developer": [
        "Rockstar North"
    ],
    "publisher": [
        "Rockstar Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Gore",
        "Violent",
        "Stealth"
    ],
    "achievements": 0,
    "positive_ratings": 816,
    "negative_ratings": 433,
    "price": 5.99,
    "description": "You awake to the sound of your own panicked breath. In Manhunt, you must run, hide and fight to survive. If you can stay alive long enough, you may find out who did this to you. This is a brutal blood sport.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12130/header.jpg?t=1478120404",
    "minimum_requirements": "OS: Microsoft® Windows® 2000/XP Only Processor: 1GHz Intel Pentium III or AMD Athlon processor or equivalent Memory: 192 MB RAM  Graphics: 32 MB 3D card  DirectX Version: Microsoft DirectX® 8.1 Hard Drive: 2.3 GB uncompressed free hard disk spaceRecommended: Processor: 2GHz Intel Pentium 4 or AMD Athlon XP 2000+ processor (or better) or equivalent Memory: 512MB RAM Graphics: 64MB 3D card  Sound Card: DirectX 8.1 compatible sound card with hardware positional sound",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "You play as a older Jimmy Hopkins. As Detention spirals you into a depression. Hopkins kills Russell the bully sending him to jail! Now after a 'execution' James has to get out alive of the people he gave swirilies and wedgies to in highschool. They are out on a vendetta and guess who was behind it! Gary from Bullworth academy!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most underrated titles from Rockstar Games. Manhunt is a brutal stealth game that heavily relies on the player to execute their enemies by sneaking up from behind. At the time, the game's premise and tone were unique for being quite depressing and brooding, causing massive controversies that continued with the release of its sequel, Manhunt 2. Yet inside of Manhunt's nihilist ♥♥♥♥♥♥♥t was a solid stealth/action game that directly engages and intimidates you. The only massive problem with Manhunt is its age, with its primitive cover and shooting mechanics, yet they are easy to adapt to after playing for a while. Even if you're not interested in Manhunt's gameplay, it's perfectly acceptable to own it as a piece of history, when video games were significantly pushing the envelope on the portrayal of violence. Whether you like it or not, Manhunt is one of the most important games of the last decade, and owning a copy is highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Rockstar Fix your ♥♥♥♥ !   With the amount of money you have, you could at least have the courtesy to do a quick fix on this game, I had to download a 'fix' from members of the community that helped me get to the first gate, the AI then didn't move from the first gate due to my frame rate being over 60fps, apparently I have to download another program called Nvidia Inspector to limit my frames as you didn't decide to include a v-sync option...  Stuff this, have a thumbs down you turds.  Shame as this game has such a good atmosphere and I really wanted to run through it again, but i ain't downloading stuff I shouldn't have to.",
            "review_score": "-1"
        },
        {
            "review_text": "A good game, however for some reason the steam version of this game always crashes on me, be wary when buying.",
            "review_score": "-1"
        },
        {
            "review_text": "no problems on windows 7, Previously had a .dll fixer so maybe that helped, but i didn't use any of the special .exe or patcher. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but one problem... if you play this game with '' Windows VISTA, 7, 8 This game is going to crash every 6minutes -..-",
            "review_score": "1"
        },
        {
            "review_text": "Need to download a crack to play a Steam game.  Would download again 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game if you can run this game.",
            "review_score": "1"
        },
        {
            "review_text": "Dont listen what Steam is saying,this game works on eny Windows without eny mods or stuff like that.You will have a problem at the start of the game with the gate but go in Community Hub and find mods to fix it(its legal).Overall this is a one of the goriest games i ever played and if you dont have a weak stomach definetly BUY THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "This is one sick motha♥♥♥♥er. And unlike others, I actually enjoyed the gunplay. But the stealth is where the meat is at.",
            "review_score": "1"
        },
        {
            "review_text": "There is much to be said about manhunt. If you do not already know, this game was surrounded by tons of controversy, this is the singular game your soccer mom does not want you to play. If you do not know the story behind the controversy, grab a drink and get comfortable, because this is a long and interesting story. When the game was first released, nobody really paid much attention to the game, critics gave it mixed reviews and the game almost fell into the category of overlooked. But of course this did not happen, on July 28th 2004 14 year old Stefan Pakeerah had been brutally murdered by his best friend Warren Leblanc. Now, when something like this happens, we as humans go through what I call a “moral panic”, meaning when we have been wronged in some way it is so much easier for us to find a boogie-man to pin all of our problems on, so that way we don’t have to take responsibility for these tragic actions. And in this case Leblanc’s parents had their own moral panic and rather take responsibility for not noticing their kids dwindling mental stability, they found their sons copy of Manhunt, a perfect boogie-man to go to court with. Fortunately the 50 million pound (or 81,156,500 dollar) lawsuit was dropped, however the controversy never went away and has since then followed Rockstar Studios to this day.  Now on to the game itself. The gameplay is very violent, and you will be murdering in systematic and unique ways. Honestly, in my opinion, it’s really not that bad. There are so many other violent and brutal games out there that make this game look like Super Smash Bros. in comparison. It is a stealth based game so you will learn to work on baiting your enemies into a trap where you will slowly pick them off 1 by 1, engaging head-on will get you absolutely nowhere. The AI can be a bit frustrating with their dead on aiming and their ninja reflexes, but bear in mind this is a very old game and the AI is very simplistic by our standards. Don’t let that be a turn off, the plotline mysterious and ominous.  Overall I would highly recommend this game to anybody who is looking for a fun and plot oriented action game. This game really did not deserve all the controversy it received and I think it’s a real jewel that has slowly faded out of the spotlight.",
            "review_score": "1"
        },
        {
            "review_text": "Whether you're prowling or growling or going full ♥♥♥♥ing Faulkner with lots of sound and fury, you cannot miss.",
            "review_score": "1"
        },
        {
            "review_text": "This game works fine on windows 7 or vista",
            "review_score": "1"
        },
        {
            "review_text": "The game looks good on the PC considering its age. I ran the game fine on Windows 7 Ultimate 64bit with minor issues. Occassionally I experienced minor bugs such as certain parts of audio continuously looping until I either died, saved and quit, or progressed through the level, very minor graphical glitches such as a small white trail when moving the character, and if you have more than monitor your mouse tends to move over to the next one; I downloaded cursor lock to prevent this.  Overall it's a good game with a great atomsphere and if you can overlook the few glitches I've detailed it's definitely worth picking up and playing.",
            "review_score": "1"
        },
        {
            "review_text": "Manhunt, one of the most disturbing games from my childhood. When I first got this game I was around 9 years old when it was given to me by my older sisters friend and It was a game that gave me nightmares. I did not play the game again until recently and once I played it I was hooked. What a rush it was expecially the second time around when I completed the game on Hardcore difficulty. 80/100 Final score which I was very impressed with.  This game is a Hardcore murder simulator and has sprung up alot of negetive controversy. Despite all of that Manhunt Is a work of gory art that should be respected and played.",
            "review_score": "1"
        },
        {
            "review_text": "who would have known rockstar could make good games? 10/10",
            "review_score": "1"
        },
        {
            "review_text": "smashing people's heads to pieces is fun",
            "review_score": "1"
        },
        {
            "review_text": "I would get this, if it only would work in windows newer than XP. I tried this last time when it was on sale in Steam. I had Windows 7 back then, but I was not able to make it crash free no matter what I did (googled instructions). Game always crashed in the first level.  Still miss Windows XP ;)",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this game its sooooo brokein",
            "review_score": "-1"
        },
        {
            "review_text": "Too bad it doesn't support Windows 7 cause this game looks really sick to play. Always wanted to practise my sodimy with a drill.",
            "review_score": "1"
        },
        {
            "review_text": "Very horrific game but non the less enjoyable with an element of stealth and horror in games we rarely see these days ;)",
            "review_score": "1"
        },
        {
            "review_text": "'FOLLOW THE DAMN RABBIT CASH' ~Big Starkweather",
            "review_score": "1"
        },
        {
            "review_text": "! ! BRUTALLY ! !...However, does not function on Win 7  ",
            "review_score": "1"
        },
        {
            "review_text": "Crash / dont wors so cant go on with story",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game hoping to have a great horrer+stealth+survival experience, but I was unable to have that experience do to my operating system. If you have windows 10 do not buy this game, the A.I. is so messed up that you can't even pass the tutorial level. There were many supposed patches on the internet, but none of them worked.",
            "review_score": "-1"
        },
        {
            "review_text": "This was a great game! I played it years ago and it still looks good but, DONT BUY IT NOW ITS TOO BUGGY NOW ROCK STAR will not fix the bugs they abandoned the series and will never fix it. the game will crash on first level and u are ♥♥♥♥ed dont know why steam would even sales it anymore! come on steam give us more warning help out the players that dont try to steal the game!",
            "review_score": "-1"
        },
        {
            "review_text": "WEN I GO HAUT SIDE I STARE RITE AT TEH SUN ",
            "review_score": "1"
        },
        {
            "review_text": "Do not purchase. This game will freeze in the first 5 minutes if your machine is any older then windows XP. Waste of ten dollars.",
            "review_score": "-1"
        },
        {
            "review_text": "love this game but it keeps crashing on me so i cant get past the first part. the gate wont open no matter what button i push",
            "review_score": "-1"
        },
        {
            "review_text": "I dount we'll ever get fix for this game at this point plus I don't trust any link sent me even if the person say's it helped them",
            "review_score": "-1"
        },
        {
            "review_text": "for some reason it exits after i kill the first guy",
            "review_score": "1"
        },
        {
            "review_text": "Mine always gets to the second 'hunter' part and then doesn't respond.",
            "review_score": "-1"
        },
        {
            "review_text": "its very laggy ",
            "review_score": "-1"
        },
        {
            "review_text": "this is ♥♥♥♥. its keeps ♥♥♥♥ing crashing. waste of my ♥♥♥♥ing money",
            "review_score": "-1"
        },
        {
            "review_text": "Most brutal game ever made.. if you have a weak stomach this game isn't for you xDD",
            "review_score": "1"
        },
        {
            "review_text": "This game is so awesome that I bought it Twice. First on Playstation 2 and now On PC.  This game Is still funner as it was in my Ps2 days. Im glade I bought it on PC because now I can mod it :)",
            "review_score": "1"
        },
        {
            "review_text": "kill in anyway possible. rockstars big hit",
            "review_score": "1"
        },
        {
            "review_text": "Before I begin, this game is NOT for the faint of heart. If you are squeamish, offended easily, or even get scared easily, then this is NOT the game for you.  --  Rockstar's most controversial game is right here. Its dated and its gritty as ♥♥♥♥, but its pretty groundbreaking for 2003. Its almost a shame that this game that this game was so underrated and scrutinized by some of the world's scummiest politically correct politicians.  Now, let's get to gameplay. This game is very frightening in the fact that while you're given the option to fight the opposing scumbags, but not only will you get your ♥♥♥ kicked harder than a queer at a jhock convention, but it is also more rewarding to take them on from the shadows. Its not until you're armed with guns that you'll feel secure taking on the hordes of low life ♥♥♥♥♥♥♥s out to hunt you down.  The executions in this game are also pretty damn rough. Even though many games now have begun to feature some pretty gruesome things, this game was 2003, and the executions you can deliver to your enemies can range from harsh to ♥♥♥♥ing brutal. And not to mention that you can blow people's brains out quite literally with a shotgun.  But what's most intriguing about this game is that there is a story behind it as you progress. What this story is about and why you're out killing various nut jobs... well, that's for you to find out.  All in all, this game is well rounded for what it is. It has some rough spots, and it needs a little work to get the game up and running (especially if you don't have XP), but it'll be a well made purchase if you like horror survival. Hell, this game has made me jump a few times, and I don't scare easily. Five Nights At Freddy's, eat your heart out.  7.5/10 - A diamond in the rough.",
            "review_score": "1"
        },
        {
            "review_text": "STAB PEOPLE IN THE EYE WITH A GLASS SHARD. CHOKE THEM TO DEATH WITH A PLASTIC BAG. FIGHT A GANG OF NEO NAZI HILLBILLIES WITH A NAIL GUN. AND FACE OFF AGAINST A NAKED FAT MAN WEARING A PIGS HEAD AND WIELDING A CHAINSAW. THE PERFECT WAY TO SPEND YOUR HOLIDAYS",
            "review_score": "1"
        },
        {
            "review_text": "Educate yourself.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game and its non support for OS",
            "review_score": "1"
        },
        {
            "review_text": "Manhunt is all sorts of things -- an idea about control and the lack of it; about the diminishing sense of identity in our growing world of high-level security; about the rampant level of violence in our culture, and the sick dependence we have for seeing said violence on TV. Yes, it's about all sorts of things. Yes, indeed. But the core of Manhunt is about listening. Listening, reacting to your environment, and adapting. It's essentially the jail-bound, drug-taking step-child to the TV show Survivor, except you're not kicked off the island. You're hunted down and bludgeoned to death -- for fun, entertainment and, because in some strange way, it's sexy.",
            "review_score": "1"
        },
        {
            "review_text": "Despite NECESSARY patching and a complete lack of support from Rockstar, the game remains a unique experience which accurately brings the feeling of a slasher movie to a video game.",
            "review_score": "1"
        },
        {
            "review_text": "My life was better after i removed a man's brains with a baseball bat",
            "review_score": "1"
        },
        {
            "review_text": "Aside from being incredibly gory, Manhunt proves to be a complex stealth action game with a surprisingly cool story. The executions are brutal and I love it. Recommended if you have the stomach for it...",
            "review_score": "1"
        },
        {
            "review_text": "A great game that doesn't run on a computer. Don't buy on Steam for the love of robots, don't buy it here.",
            "review_score": "1"
        },
        {
            "review_text": "just love it and would see manhunt 2 on Steam",
            "review_score": "1"
        }
    ]
}