{
    "app_id": 12170,
    "name": "Grand Theft Auto",
    "release_date": "2008-01-04",
    "developer": [
        "Rockstar North"
    ],
    "publisher": [
        "Rockstar Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Classic",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 199,
    "negative_ratings": 30,
    "price": 0.0,
    "description": "Drive dozens of varied vehicles around three of America's toughest cities. Only the best will be able to tame the fastest cars. Only the smartest will know all the short-cuts and the whereabouts of the hottest wheels. Only the toughest will be able to take on the world and finish the job like a professional...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12170/header.jpg?t=1447363098",
    "minimum_requirements": "OS: DOS 6.0, Windows 95, Windows 98 Processor: 75 MHz Pentium or equivalent Memory: 16 Mb of RAM Hard Disk Space: 80 MB of Hard Disk Space Video Card: 1MB VESA compatible SVGA graphics card Sound: Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Short version: 73%",
            "review_score": "1"
        },
        {
            "review_text": "Fast action, dark humor, and machineguns... What else do you need to have a fun game?",
            "review_score": "1"
        },
        {
            "review_text": "14 years after its initial release, still ALLOT of fun. Not many games have achieved that.",
            "review_score": "1"
        },
        {
            "review_text": "first time i played this the only thing a could was mayhem. damn miss those days",
            "review_score": "1"
        },
        {
            "review_text": "Cant go wrong with the game that started it all",
            "review_score": "1"
        },
        {
            "review_text": "[?/10] (all you need to know is GTA series always better than any other games)   Grand Theft Auto, best game Series in human history. Thank you, Rockstar Games.",
            "review_score": "1"
        },
        {
            "review_text": "BUSTEEEED.  SHOTGUUUUN.  The sounds in game should be modded over to gta v.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT PLAY. YOU WILL HATE IT. TOTAL BORE, TOP DOWN VIEW.",
            "review_score": "-1"
        },
        {
            "review_text": "The classic, the one, the only, GTA. This is free to play off the Rockstar Classics site - so no doubt get it for free if possible, but this really started open world gaming. You need a set million X points to progress - get it with missions (easiest way) or by doing whatever you want - police are agressive, top down view is fast and frentic, and it is damn hard in later levels! Wonderful stuff, then and mostly now.",
            "review_score": "1"
        }
    ]
}