{
    "app_id": 12320,
    "name": "Sacred Gold",
    "release_date": "2008-07-09",
    "developer": [
        "Ascaron Entertainment ltd."
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Hack and Slash"
    ],
    "achievements": 0,
    "positive_ratings": 1489,
    "negative_ratings": 319,
    "price": 6.99,
    "description": "A shadow of evil has fallen on the kingdom of Ancaria. It is a time for champions - a time to journey into the perilous world of SACRED. Battle blood-thirsty orcs &amp; lumbering ogres... Destroy undead wizards &amp; rotting mummies... Slay hellish demons &amp; legendary dragons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12320/header.jpg?t=1546035503",
    "minimum_requirements": "Supported OS: Windows 2000/XP  Processor: Intel Pentium® III 800 MHz Memory: 256 MB RAM Graphics: 16 MB DirectX 8 compatible graphics card DirectX: DirectX® 9.0c Sound: DirectX compatible sound card Hard Drive: 2 GB HD Space",
    "recommended_requirements": "Processor: Intel Pentium® 4, AMD Athlon 1.4 GHz or higher Memory: 512 MB RAM Graphics:  64 MB DirectX 9 compatible graphics card",
    "reviews": [
        {
            "review_text": "You didn't play Sacred back in 2004? You missed probably the best Diablo-clone out there. That's why fans where so dissapointed about Sacred 3 release. But we are reviewing the original game, so here we are.  Sacred Gold is a lassic action RPG where you slash and loot and slash and loot and slash and loot and take some random quests in between. Steam edition includes every single patch ever released, including some Sacred Plus stuff and Underworld campaign. Also the latest 2.28 patch removed the Starforce DRM, which is awesome.  The map is huge, the area you'll uncover in an hour will only take 1% of the whole map. Since this game is actionly 2D, you might think the graphics are way off and the screenshots here might prove it, but it's just steam stretching, cutting and smoothing the image. If you click it, you'll see it's more sharp and actually has some HUD. Also, all screenshots here present the massive close up on the character. While it was the issue back in 2004, I think the developers added the option to zoom out way farther with some patch, so now you can actually see stuff around. The only problem is that the game is locked on the low 4:3 resolution and never was patched for the wide screens, but it doesn't really feel so bad as in some other games. However, having 1080p and actual smoothing would be nice...  The official online servers are down, but you still can play this via Tunngle or another LAN emulator. You might face a certain issue with error 10026 which is not explained anywhere, but in the tutorial I posted here on Steam. Check it out if you'll ever face this issue.",
            "review_score": "1"
        },
        {
            "review_text": "Game doesnt work?   Game is old...  Here, free advice from a Wizard who doesnt give up and write bad review about good, old games.  Go into SteamApps - Common - Sacred Gold. Then open Config.exe. Run the game in 32 bit color depth, filter active and video compatability mode, finally untick Play Movies.   Now right click the Sacred.exe file and run in compatability mode for Windows XP.   Should work.  You're welcome.  Games a classic. 5/7. A Perfect Score",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly good game. Though the plot and setting are as generic-Fantasy as it gets, the game's mechanics make it surprisingly addictive. An Open World Diabloesque, Sacred manages a good balance. It provides plenty of exploration and side-questing, without detracting from the main plot. The difficulty can be a little spikey in places, but good loot is frequent enough to help smooth some of those edges. Builds are relatively easy to construct, though the game has a few gotchas that could have been better explained. While not the best in the genre, it is surprising this did not get more exposure in its day.",
            "review_score": "1"
        },
        {
            "review_text": "I used to play Sacred roughly 10 years ago, before the expansion pack or Sacred Gold even came out. I was absolutely in love with it, and spent ages playing.  The world of Ancaria always had a special place in my heart, so I decided to buy it again now and get back into it.  It is true that getting it to start on Win 8.1 needs some arrangement, but this is fairly easy and you can do it in about 15 minutes maximum. (The description will be at the end of this review.)   Now, on to the game:   When looking at this game, we need to remember that it's a decade old. Even with that in mind, it is still much better than some RPGs that they put out today.     There are 8 characters that you can use: Gladiator, Seraphim, Wood Elf, Battle Mage, Dark Elf, Vampiress and 2 that came with the Underworld expansion pack: Daemon and Dwarf. They each have pros and cons, and various combat arts. I have played with all of them, my personal favourite is the Dark Elf. (I prefer a more aggressive approach, no shields or two handed weapons, instead dual wielding+poison+fast attacks and traps)     The map is huge and there are various kinds of lands to discover. (Tundra, desert, forest, underworld etc.) There are portals throughout the map to help you navigate more easily.     There are tons of missions, named and unnamed sidequests which will occupy completionists for a long time.     There are 5 difficulty levels (Bronze, Silver, Gold, Platinum, Niobium) The ones after silver only become available if you completed the game with the previous difficulty level. Advancing through the levels is necessary to face some real challanges, especially after you character is moderately leveled.     The level cap is high (216, if I'm not mistaken) which means you can finetune your character as you wish.     There is A LOT of loot, which is both a good and bad thing, as it can be overwhelming. I personally find having all these options very entertaining. There are set items, which if you wear together gives you really good bonuses.     You get to have companions throughout the game (some immortal, some can die) and although they are not usually very strong, they still provide some support.     You get to have a horse. I love games that gives me access to animals. (Also the Vampiress has a wolf and 2 bats) The horses have many different stats, the most important one being speed. Also, they can ram opponnents, which is useful especially if you are cornered while on horseback. Mounted combat is also an option.     The characters have many spoken lines (Which is important in my opinion, for example Dragon Age: Origins -another game I really like- only has a couple of lines for the player controlled character, which get really boring to hear after a while 'Can I get you a ladder, so you can get off my back?' Ugh.)     There are TONS of pop culture references all over the world. I strongly recommend going grave-robbing.     I have found 3 easter eggs by myself, and have read about others. So go exploring off the beaten track.     The graphics are not the best, but considering how old the game is, I think it's pretty good. It's enjoyable.    Overall: The game has interesting characters, huge world and mythology to discover, entertaining sidequests and storylines, good leveling mechanic and a lot of items to work with. I bought the game on a sale, but I still think it deserves the price it has now.   Don't bother with any other Sacred games though, this one is the best. It all goes downhill from here.    And here is the Windows 8.1 guide, ask if you need help with any of the steps.[/b]      Update your graphic card drivers.    Go to the Local Files of the game. (Right click the game in your library, click properties, then local files, then browse local files)    There are 4 exe files there (config, game server, sacred, testapp). Change all of their settings so that they Run as Administrator always, and that they run in compatibility mode to Win 7.    Click the 'config.exe' and select '32-bit' and 'video compatibility mode' They need to be checked.    Enjoy the game!   At first the game didn't run for me, and after that I had a graphics glitch. They were both fixed by these steps. There are some alternatives, ask if you wish. ",
            "review_score": "1"
        },
        {
            "review_text": "Good or bad? Well... both. It depends what you're looking for, though.  Sacred's an old game. Like reaaaaally old. This brings with it some issues, unfortunately. The game itself is good, but the problems may be off-putting, so let's cover the technical issues first as they can be a dealbreaker for many people given what they are.   First off, Sacred is hard-coded to be 1024x768 resolution; this means that, under normal circumstances, it will fill a 4:3 square on a widescreen monitor with large black boarders on the sides. There are a few workarounds, but the largely involve forcing it to stretch out the horizontal which makes everything look remarkably fat. This also means that the resolution can't normally be increased, and it won't get prettier or fit more stuff on the screen.  The second major issue is that multiplayer is not naturally supported by steam, steam does not give out CD-keys when you buy the game, and it's irrelevant anyway because the servers for the game are down regardless. Hamachi, Gameranger, and most other options will flat out not work. Evolve, found at  evolvehq.com , is the only one known to be able to run it (though some have reported that Hamachi can run it by changing some setting, but I don't speak german so have no idea what they changed). Evolve, however, can link itself to your steam account which... is a little unsettling. I didn't want to play sacred with friends quite THAT badly, so for me, it's stuck being a single player game.    With that out of the way, if you're still interested in the game despite the technical difficulties and problems with it being ancient, let me state that the game itself is actually quite good with nice gameplay elements.  Yes, it's old, and no, it won't be better than Path of Exile (which is free), but it has a certain charm and feel to it that makes it quite enjoyable. If you pick it up for $5 or under, it's probably worth the cost.  A few major things:  - There are quite a few different classes in the game (races, acutally...) and each get their own unique set of spells and melee attacks. They each play fairly differently, and have enough customization that each playthrough can potentially feel quite different even if playing the same class.  - Skills are a bit odd in that you don't get access to all skills; each class begins with two skills and get a number of new skills unlocked at levels 1, 3, 6, 12, 20, 30 and 50. Interestingly enough, you just get to PICK a new skill at these levels (starting at 3) but have more options than you can choose from, so you customize your character each time you play. This means you can have a melee mage or a fire mage or a mage that specializes in a wide range of elements or one that spams out a small number of choice spells more often, one which autoattacks, or one which utilizes combo attacks as their primary method of damage, or even one which tanks (well, alright, not so much a tank mage =P ). The point is, you get some pretty good customization so two players can both pick to be the seraphim and play her entirely differently and not step on each other's toes. Assuming you get the multiplayer to work from the earlier issue. *Cough*  - Mounts exist in the game and you can ride a horse. In fact, you can even learn mounted combat, use your horse to charge over people, or teach it to run faster. It's kind of a neat system, but isn't really explored too much, yet moreso than probably any other game of the genre.  - Combat's pretty fluid, enemies have easy to see radial healthbars around their feet which indicate their relative difficulty, level and remaining health clearly. You can highlight items on the ground as well, which is handy. It's especially fun to bounce around the battlefield unleashing multihit combos and seeing your character do more than just overhand swing 5x in a row, but instead actually use a variety of strikes from different angles, and some will even perform acrobatic attacks, backflips, and so on.  - The storyline's not the best the world has ever seen, but it's certainly not awful, and by diablo-style dungeon crawlers, it's way above average. There's actual reasons for going through the various quests, the world opens up in a reasonable manner as you complete them, bosses tend to make you want to slap them good and hard before you even fight them... generally it does a pretty good job at what it sets out to do.  - The spells in the game are pretty varied, and the characters do distinctly feel different from one another, even if they have a similar role. Sure, the vampiress and daemon are both female melee characters, yet the vampiress gets to change between a knight form and vampire form, preferring physical or magical abilities in nature, can summon wolves and bats to help her, drain health and so on. The daemoness, in contrast, gets things like the ability to fly over terrain, attach elemental properties to her weapons, fling fireballs and enact creepy japanese hentai tentacle porn scenes with dead bodies. No, I am not making that up, and my nightmares would prefer that I were. Alright, they're not nightmares. &gt;.&gt;;;  - Individual classes have different item slots available to them. Most of them tend to share similar gear, though there are a few bits which are very specific to certain classes, such as say... the iconic seraphim's wings.  - Money MEANS something. Zoh. Mah. Gerd. Know how in Diablo 2 and such, you'd get huge stockpiles of gold that were worthless? Or most any other diablo-style game? Yeah, turns out that you can actually buy uniques and set items off of vendors. In fact, if you get the skill for it (sacrificing a combat skill...) some classes can even actually increase the quality of stuff that merchants will sell (along with reducing the cost of such, and increasing the sale price of vendor trash, yay!), making it actually reasonable to build a set to some degree and not feel like your gold is worthless.  - Big bosses. If you fight a dragon, you know bloody well you're fighting a dragon because it tends to not exactly fit on the screen. There's things like 'don't stand in the fire' on bosses as well, stuff that needs to be dodged and so on. As in things that you didn't actually see until much later games for the most part. Sacred's not quite as great as a modern game, but compared to anything else from it's timeframe, it was quite a few years ahead of it's time in this regard.    Overall, it's dated. Sacred has low graphics, major technological problems, and some real massive flaws to it... but compared to other games of it's time, I'd honestly recommend it and say it's quite a lot better than it had any real right of being. It's enjoyable for awhile, and worth a good $5 or so. As of the moment of this review, it's on for $2.49, and for the single player game, I'd say it's well worth the cost. It probably won't be a regretable purchase, as it's really not that bad and does a lot of good things that even many of the modern diabloesque games fail to live up to.  If you ever want to go down a trip on nostalgia lane and play diablo 1 for some reason (I get that every few years myself =P ) I'd honestly recommend playing Sacred for your binge this time around. It's the better game of the two in large part, and has some really attractive features to it. It has some nuisances as well, but hey, it's old, give it a break. NO! NOT THE HIP! NOT THE HIP!",
            "review_score": "1"
        },
        {
            "review_text": "So much time spent in this game in my childhood, when I didn't even know about stuff like Steam. Completed every difficulty on each character. Still best RPG I've ever played. Amazing quests &amp; characters, bugs &amp; easter eggs. Still worth playing in 2016.",
            "review_score": "1"
        },
        {
            "review_text": "Good old game, that will never let me down. I got it on disc, long time ago, before my friend gifted this steam copy to me (best friend ever!)  Nice humor, silly story, funny easter eggs. Repetitive diablo-like gameplay, but it is visually vibrant and interesting. Played for months on my old PC. Loved all playable characters, but my favorite were demoness (she can fly!) and vampiress. Still my old favorite game.  Nominated it for the test of time award.",
            "review_score": "1"
        },
        {
            "review_text": "I've been quite a fan of this game ever since it released in Spain, around 2004 or so. It's been 12 f#cking years, and somehow this game still stands somewhat high between other games of it's kind. But you know, all games have bad stuff on them, and that's where I will start the review, then move up to the best stuff you should know about it before making your purchase.  First and foremost, the game hasn't aged that well. Granted, it could work way worse, but you should totally expect the game to crash a few times, get stuck and not let you use the task manager to shut it down and stay on a low resolution. Infact, it seems to have issues with the videos, so you might have to disable them to even play... And that means missing on some parts of the story as well. It should also be said that the game has no Steam Overlay support.  Second, it has some weird difficulty spikes. The game ain't really too difficult (and if you go with Bronze difficulty you'll rarelly even die), but there are a few parts that seem weird, mainly dragons. You're fighting the damn thing and suddenly it uses a fire-breathing attack and your hp, no matter how tanky you are, will explode. And almost without warning! There aren't much more enemies that are difficult on the game besides them, however then come things that are too easy, the final boss being the biggest example. It's quite the anticlimax when he barely does damage and you whoop his ♥♥♥ without effort. There's also enemies that deal poison as their main source of damage: poison is crap. Barely hurts, it's main effect seems to be slowing you down. That's quite dissapointing, however it also seems that using antidotes doesn't always even fix poison, which seems like a bug to me.  Lastly, the graphics, while neat (specially for it's time), they have issues. The world is mainly a 2D gigantic landscape with semi-2D buildings and lots of 3D characters. The problem comes when buildings and the landscape get in between everything: buildings not letting you see enemies, hills hiding the way you're supposed to be going, objects that seem to be blocking a tight road but it's actually the way you should be going and it ain't blocked at all, it gets confusing a lot of times.  Lastly, and mainly a minor problem, the English voices. They're a mix bag. The main characters actually do have a good voicecast, specially the Dwarf who's my favorite of them all. Then come enemies like goblins and orcs, which talk on their own language AS THEY SHOULD, instead of sh#ttified English, a really nice touch. Then, at the bottom of the barrel come enemies like the Sakkara Priests. The male ones sound okay but a bit forced, yelling each line at the top of their lungs, then come the female ones which SCREAM every line in the most stupidly hilarious accents possible and even keep screaming the most dumb death screams you'll hear in your life as they are decapitated with a damn hammer. I'd say 10% of the voices in the game are bad, only a 10%, but that 10% might even be a nice case of so bad it's actually good.  That being said, what does the game do for itself? Have you played Diablo 1 or 2? It's similar, but in a MMO-sized world. Just think of World of Warcraft in 2D and singleplayer and you'll get the idea.  The gameplay is enjoyable. There are 8 characters to choose (6 from the base game and 2 from the expansion included in the Steam edition) and they all feel quite different, with their own good and bad parts (although I've always felt the Dwarf was way more powerful and had a dumb negative part, not being able to ride horses). There's an insane amount of loot out there to get (and there are items which are only usable by certain characters) and each character has a good selection of skills you can use. It's fun, as you can just play whoever you feel like, and if you don't like it, just change your playstyle.  The map itself should also get a mention as it's actually quite f#cking big for it's time and coming from a not-so-well-known developer team. There's plenty of different areas to explore, all of them with their own kind of enemies and obstacles, towns and different crap. And something that you don't see often is actually getting to visit the towns of the monsters you keep killing, which I like and it's a good touch. Specially since the Devs took the time to add places to the map that you don't have to visit through the storyline, but have quests and other good stuff on them, making you want to deviate from the main quests and just see what you can find.  The game also offers a New Game+ option; you can export your character and then start a new game with it, which is great! It adds more difficulty and replayability to an already long game.  The main characters are also fully voice acted and will usually give their own opinion to whatever is happening, which is fun, specially when they decide to break the forth wall and talk to you directly. The game also has a few references to other games and media, something I do enjoy a lot.  Lastly, the game does have multiplayer... Although good luck finding anybody to play it with. After 12 years the servers are predictably dead and although you can play using third party software with some friends, it might be too much effort when you could just play something else instead.  Do I recommend Sacred? If you like Roleplaying games with big open worlds, yes. Totally. It's a fun game that lasts, with the expansion pack included, around 16 to 20 hours, depending on how well you do. There's tons of stuff to discover and fun to be had, and in a sale it's probably a safe purchase... Just expect some technical problems to stay in the way at first.   I will also say in advance that Sacred 2 is a decent follow up to this game (although more oriented to consoles than PC) and that Sacred 3 is a horrible follow up. You see, Sacred went the same way Dungeon Siege did: the first one is usually taken as the best, although it played it safe. The second one is a decent sequel with good aditions and other stuff that shouldn't be there. The third game however barely even looks like the rest and it's hated for it. If you ever look into this franchise, please stay with the first one, maybe just peek into the second one for curiosity. Ignore the third one, you'll be grateful.  TL;DR Edition: Good open world RPG that's quite long but does have both technical difficulties and some difficulty issues. However it's quite enjoyable to people who can overlook it's age and how bad it works with a modern computer. On a sale, it's a safe purchase, although ignore it's sequels completely.",
            "review_score": "1"
        },
        {
            "review_text": "Great isometrical RPG with a huge world and lots of quests. Still amazing to play today.",
            "review_score": "1"
        },
        {
            "review_text": "An oldie but a goodie. Yes it doesn't support 1080p but I wouldn't expect it.",
            "review_score": "1"
        },
        {
            "review_text": "Sacred Gold's one of the more underrated RPGs out there. I'll throw it in the Diablo category but saying it's better than D2/LOD is more of a preference than fact. Unlike Sacred 2: Fallen Angel (or D2 for that matter), it's not heavily focused on character builds. If anything it's pure dungeon crawling that's comparable to Titan Quest. I haven't finished it yet but 10 hours logged, I find it to be a great game.  Can be a bit tricky getting it to work on Windows 7 though. Major negative with it is there's no option to change your resolution or many graphics settings (all the files are hardcoded, sadly). For all of you with widescreen monitors, you'll want to run this in a window. I have a quad core CPU and my framerate jumps between 25-40 but I'll say it's more of a OS compatibility issue, not directly hardware; even if you force XP Service Pack 2/3. If you see it for cheap, it's worth it. 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Works perfectly (cannot say the same about Sacred 2 Gold how ever)",
            "review_score": "1"
        },
        {
            "review_text": "Nice game with big fantasy, a lot of differrent misions and a FUN.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say it was my childhood and I played it for 6 years. It was my first RPG , and then Diablo 2. For me, Scared is really classic.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Action RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, some people may say the opposite or say that the game has great potential but that it's only 'good', In my opinion, the game is real great, of course, there could be more but what made me really love this game is that there is 8 characters with different starting location and different quests. You can unlock difficulties by playing on the difficulty right before that difficulty. The graphics are awesome In my opinion. The game can be real easy though so if you're looking for a challenging isometric hack n slash action game then this may not be the game for you, the game is still really great to be played because of its World, story and characters. If you want a challenging one, you should try Path of Exile on the highest difficulty on hardcore, it is pretty good.  If you like games such as Titan Quest, Dungeon Siege, Path of Exile, Divinity, Diablo, etc etc then you'll probably love this game.  Personally, I think this game deserves 9/10",
            "review_score": "1"
        },
        {
            "review_text": " Sacred: Gold",
            "review_score": "1"
        },
        {
            "review_text": "HELP ME ;-; (GAME INFO BENEATH): Shortly - any chance you guys could help me with the game? I'm running it on Windows 8, checked the settings in config as it was said in reviews beneath (or above, idk), but only thing I found was how to get the game running when it freezes in loading screen. The next thing is that when I get in game, finally trying to enjoy this amazing world once more, my screen shatters all the time I'm trying to move. Any chance you guys experienced something similar and can give any advice? I'm not really good in technical things, so if you could help me with some step to step on how to fix it, I'd be very grateful :^)  TO GAME: After that I need to say, this is the game you need to play, you just must! It's not from the newest games, but it was godlike at it's time, at least for me. Diablo-like amazing huge world with many choseable classes each with unique spells and playstyle. Only thing is that there is no level scaling with you, so if you run into zone not eligible for your level there is a huge chance you are gonna get one shot by a random dude with levels higher, so I wouldn't risk that, just go and enjoy the world as it is.",
            "review_score": "1"
        },
        {
            "review_text": "This game came off as surprisingly addicting to me. A veriety of characters with a variety of gear means all of the builds you can possibly think of. Gameplay is a bit much to figure out and may feel mindless at first, however. This doesn't hinder the experience because the moment that the game opens up, and it does early on, you will pour hours into it. This old but classic Diablo 2 clone maybe offputting at first, but don't knock it 'til you try it.",
            "review_score": "1"
        },
        {
            "review_text": "could not get to work with windows 8. dont waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "In my opinion ,I think that I prefer the sacred without expansion more than this version because there are any trainers can be matched with this version ,all trainers can't be appied for this version",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great point and click rpg adventure for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "I remember this game from long ago. Me and my brothers liked it very much and where always playing online. Now i am playing this game and it feels just the same as back then.   Just keep in mind that this game has grown a bit old and won´t forfill your action needs. But these where precious memories of mine and in my experience i would give this game a solid 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I have to be honest, I missed this first time around.   My first experience with Sacred was Sacred 2 on the Xbox 360 and I loved it.  I am on a bit of a mission to play some of the games I missed growing up, because I was too busy/broke/playing Diablo 2.  I bought this simply so I could rush through it and move on to Sacred 2 to hammer that and mess around with the builds etc.  I'm loving it, absolutely loving it. The character customisation is very in-depth, you chose a set character but within that character there is a large list of skills to choose from, each skill has a noticable impact on your character and their growth, you have an attributes list that you can actually increase upon levelling(rather than with gear alone like every game since World of Warcraft made every game designer ever lazy as hell so they can knock off work early) and you can find/trade combat arts to give you actions to perform in combat.  The game world is literally massive, everything is hostile so crossing it can become a bit of a drag but it really does add to a sence of living in a huge, hostile world where you are really only a small part of its ecosystem and not even located at the top of the food chain.  Graphics I don't care about, graphics do not a game make but these are really quite nice... I get the feeling that it's hand-drawn maybe. They give the games a certain charm, the visual design is quite brilliant.  I highly reccomend this game, it is one of the most fun RPGs I have played in years.",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't work. Even if you get it to work, you'll have severe graphic and sound glitches. Don't buy it if your oparating system is beyond Windows XP as that's the last one this game supports.",
            "review_score": "-1"
        },
        {
            "review_text": "surprisingly violent game!  Allot of fun also",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game 10 years ago, but...  Resolution fixed at 1024x768. Window mode doesn't work properly in Windows 7, not even in XP compatibility mode.  Avoid this game today unless you have an old/small 4:3 monitor to play it.",
            "review_score": "-1"
        },
        {
            "review_text": "it remind me of time when i payed many many days with gilrl i loved once ;) this is one of the best game of that type back then only few could enjoy playing it",
            "review_score": "1"
        },
        {
            "review_text": "Game is not playable in Windows 8.1",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad game, one of my old favourites. But it is barely working now. If you have Windows XP or lower, buy this game, but if you don't - do not. Seriously, I wanted to play it again and I couldn't. Because it's broken as hell on steam and Windows 7.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is eternal. It's very very long. Very very very long. I haven't finished it.  Its a diablo clone. Mindless play. Because it's all about the items playing on easy is a waste of time.  But starting in normal is very hard. Play on easy to get your levels up and then re-start with the same character on normal.  The best items to socket are the vampire one's that drain health but give it to you.",
            "review_score": "-1"
        },
        {
            "review_text": "Fat Midgets all the way. Dwarves seem to get the best loot for whatever reason.",
            "review_score": "1"
        },
        {
            "review_text": "If you have windows 8 or higher, do not buy this game. parts if the screen will get blocky, textures will be stretched and objects will appear fragmented unless you run it on low setting. It's a shame because back in its prime this game was quite the looker, and for me, the low setting spoils it.",
            "review_score": "-1"
        },
        {
            "review_text": "Get this Jerry, it's a game about nothing! Nothing you do in this game means anything. -1.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "I personally love this game. Sure it's just hack and slash. But I got a thrill from trying to explore to 100% mark, trying to use the gladiator to jump to impossible areas, and discovering Dragons in the middle of nowhere and me being unprepared. Bit of a grind but a good amount of items, spells, and quests.",
            "review_score": "1"
        },
        {
            "review_text": "10 hours, you can say im only at 7~8% to finish the game.",
            "review_score": "1"
        },
        {
            "review_text": "I remember shutting myself in my room and not leaving for days at a time as a kid playing this game.  Started playing it again and still remember just about everything.  If you've never played the sacred series start with this one. its the roots of the series.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is flat out fun.Everytime i play this game i have fun.",
            "review_score": "1"
        },
        {
            "review_text": "What if Skyrim had been constructed as a Diablo clone? That's pretty much what you've got here - open world, tons of quests, and freeform character development (within a few archetypes). For all of its point-and-click simplicity, Sacred will entertain for hours.",
            "review_score": "1"
        },
        {
            "review_text": "This game does not work for a lot of people, I had to refund it due to artifacts and screen flickering.  ...although this is still one of my favourite childhood games, it's a shame.",
            "review_score": "1"
        },
        {
            "review_text": "I love Sacred. If you're wondering wether to get Sacred Gold or Sacred 2.. get Gold. Sacred 2 was a major punch in the nads for oldschool fans.   I've replayed this game a million times over the years, and it never really gets boring. Sure, there's bugs and glitches and whatnot but there's something about it. I can't really explain it, it's one of those games I keep going back to like Diablo 2 - pure hack'n'slash but the skill tree is slightly different from any other game, the skills are interesting.. and it's funny. It's worth it, definitely worth it. I've actually paid for this several times, boxed editions, gifts, you name it. I can't really put my finger on it, it's just ♥♥♥♥ing brilliant.  ",
            "review_score": "1"
        },
        {
            "review_text": "The most addicting game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "While everyone of my friends was playing Diablo I was playing Sacred. Yes this game is very telling for its age but my god does it scratch that itch that Diablo never manged to hit, A robost character system, Each character actually felt different in terms of game play and abilities and the massive world.  Yes the voice over work is terrible. (not as bad as sacred 2 or 3's but still pretty bad)  mainly bought it again so I had a steam and modern computer capable version. ",
            "review_score": "1"
        }
    ]
}