{
    "app_id": 12330,
    "name": "Darkstar One",
    "release_date": "2008-02-13",
    "developer": [
        "Ascaron Entertainment ltd."
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Space",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 256,
    "negative_ratings": 59,
    "price": 6.99,
    "description": "Darkstar One offers a fantastic amount of freedom of choice. The story-based missions gradually lead you deeper into the galaxy to new races, new technologies and ever stronger opponents. Explore a vast array of solar systems in search of hidden artifacts of ancient races, essential objects for upgrading your ship--the Darkstar One.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12330/header.jpg?t=1447351239",
    "minimum_requirements": "Supported OS: Windows XP (32 bit) Processor: 1.6 GHz Intel or AMD processor Memory: 512 MB RAM Sound: DirectX compatible Sound Card Graphics:  DirectX 9 compatible 128 MB graphics card with support for pixel/vertex shader 1.1 (GeForce 3 and above) Hard Drive: 6 GB HD SpaceRecommended:  Supported OS: Windows XP with SP2 Processor: 3.0 GHz Intel or AMD processor Memory: 1024 MB RAM Sound: DirectX compatible Sound Card Graphics:  DirectX 9 compatible 256 MB graphics card with support for pixel/vertex shader 3.0 (GeForce 6/Radeon x1x00 and above) Hard Drive: 7 GB HD Space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A really good addition to the space sim genre, really simple and easy to pick up and play, story is somewhat broken up at times but its more about the journey in the ship and its evolution rather than the over arching story line in my opinion. All said and done its a fun Space shooter game and would deffinately give it a try if your into the spacesim genre.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game. Not a great game. I'd call it good.  Fly around, kill space pirates with your own space fighter, do some trading, complete some missions, earn money, and upgrade your ship. Quite a bit of freedom to choose your own path, and explore different star systems.  Sit through the mostly badly acted cut scenes.  Then play some more, blast away some more pirates. It sounds like it should be more tedious, but I think it's actually a pretty fun game. In spite the poor acting/voice, Darkstar One has some interesting zaniness that keeps you interested, as well as some interesting quests. And there are several different alien races you can learn about, a number of different organizations, lots of interesting news items in the news feed. That's probably a lot of what kept me going--reading about the stuff going on--international machinations, and the various groups that hire you out to take care of one task or another. All while the galaxy inches closer and closer to war.  7.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun space sim. Gorgeous art work, nice ships, good gameplay design...the missions are a little samey, but that is a fault with a lot of space sims. It has it's challenges, but as you mod/upgrade the ship, everything gets doable. Good for a casual player too, cos you can leave it and come back to it without really losing the thread of things.",
            "review_score": "1"
        },
        {
            "review_text": "Quite a fun game. Not much to do but still fun and great dogfights.  It´s ok if you wanna spend 1-2hrs per sess",
            "review_score": "1"
        },
        {
            "review_text": "its like eve but single player, crossed with mass effect; for 2.50 so worth it. Many many hours of good play time. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Big discount on Strategy First games? Okay. Let's see what they have... Hmm, interesting, here's a neat little game.  I won't compare Darkstar One directly to any of the Big Four. In case you have no idea what I am talking about, then let me give you a hint: The Big Four games in this genre start with the letters F, P and X. (Two share the letter 'F' for their name.) These games are held by many of space sim/combat games to be the pinnacle of the genre.  But I'm not going to invoke the Big Four in direct comparison to Darkstar One. Comparing DSO to any of those has been done before in other reviews, and at times, I feel this comparison is unjustified, particularly when people say DSO isn't 'as good' as the Big Four.  I suspect the developers of DSO have played the Big Four. There's lots of elements from those games present in DSO -- And, in fact, I would argue that you couldn't MAKE a space sim/combat game without having those elements, either borrowed intentionally or re-created without realizing it. It's like hold-left-dragging to select units in an RTS game. That is an extremely common and intuitive manner to select lots of units. It's become a common verb in RTS games, and in hind sight seems like a very obvious thing to implement and if you were to create an RTS today, you would implement mass-unit selection in that very manner. To do otherwise would be unnatural and new players would complain. Someone else found the most optimal verb for expressing an intent, and it's become a part of the building bible for the RTS genre.  Therefore, DSO uses a lot of the same verbs as the Big Four. If you've played the Big Four, then practically nothing in DSO will seem out of place. It's all there, it works like you expect it to, and that is what makes this game a lot of fun, even for someone such as myself. I've played practically every major and note-worthy space sim/combat game out there, and that's not really much of a boast considering that I can only think of a dozen in my entire lifetime as a gamer. This isn't a genre that gets a lot of attention.  DSO does it right and does it competently.  If you are a die-hard Big Four fan, you can't go wrong with DSO. Just give it a chance. The graphics are good, the voice-overs are decent, the plot and characters are okay, and the game mechanics are just fine. There's all the elements you would expect from this genre: Exploring, trading, bounty-hunting, alliance/allegiance shifting, pirates, Big Scary Aliens Doing Bad Stuff To Everyone, Mysteries to Uncover, etc. The whole kit and kaboodle.  The only real issue with DSO is that it doesn't bring much new to the table aside from the single, upgradable ship instead of the more typical ladder-climbing of purchasing better ships. I also like how they implemented the cargo carrying system, as it allows your super agile combat ship to suddenly take on the characteristics of a slow, vulnerable cargo vessel without forcing you to switch ships or land at a station first. That was well thought out.  The game is well made and both looks pretty good and plays well enough for what it is. And damn, you can't beat the price. (Under $3 as of this review. I would have gladly paid far more for this game, if I had known about it before hand.)  If you aren't a fan of the Big Four, and in fact if you are confused about what I am talking about: Give DSO a try. It's a good starting point for someone interested in this genre. If you want more, then don't worry. The Big Four are still around and you can pick them up at bargin prices. (For the uninitiated, most of the Big Four are really old games. Like, one of them is a DOS game! See what I mean about this genre not getting much love and attention?)  DSO is worth it, no matter if you are a fanatic of the genre or not. It's not going to blow you away, but it will provide many hours of solid, fun gaming and that's more than can be said for %90 of what is on Steam. :)  Kudos to the developer of DSO for making such an enjoyable game in this genre!",
            "review_score": "1"
        },
        {
            "review_text": "Nice space sim game with relative freedom, tons of side missions, upgrades, weapons and few rpg elements. You have freedom and can do what you want: trade, be bounty hunter, pirate, smuggler and more. The story is not bad either.",
            "review_score": "1"
        },
        {
            "review_text": "I would really like to like this game, but trying to target enemy ships is the most pathetic thing I have done in a game for ages. Aparently this game is not for me!",
            "review_score": "-1"
        },
        {
            "review_text": "(Not the No mans sky fix I was after, but thats my issue )     whats it is -  Pretty enough Runs nice on older system's solid a bit of a generic story  space trading!  REALY bad voice acting, maybe tops hydrophobia  ** Im not very far into it",
            "review_score": "1"
        },
        {
            "review_text": "I do like it, enjoyable, simple, no complaints.... but.... that missile lock alarm. Damn its annoying. You cant switch it off and it goes on automatically no matter the target, friendly or neutral.",
            "review_score": "1"
        },
        {
            "review_text": "First game I ever completed the story line of without cheats, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've only got 83 minutes on steam, but when this originally came out I played through it twice, and have since probably played through it another few times, Why? Each time I would Upgrade my ship it would be different. It's a very simple customisation (speed, manuverability, and weapons) so depending on the ship archeatype you prefer you can build",
            "review_score": "1"
        },
        {
            "review_text": "The game actually has a plot. You are a merchant that moves from one solar system to another solving the mystery to the death of your father. You have a spaceship that you can upgrade to using credits you receive from sale of goods. This game is not worth it if its above $5. Most of the graphics (stars, planets, asteroids) are just copy / pasted over and over again.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a very intresting gamre it reminds me alot of Galatic Cibilization 2!",
            "review_score": "1"
        },
        {
            "review_text": "Quite good fun. Not as open as, say, Elite, but pretty darn good.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game if you play the space sims of old. It was very much like Privateer or Freelancer. You upgrade your ship, fly around doing missions, the story was cool and I beat the game so I must have liked it a lot. This game is worth your time and money if you like games in this genre. I give this game 3 out of 5 Whitestars.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a typical single plotline, with your average cut-scene/screen text narrative. However, this plotline is a product of a professional story writer, so this linearity does not bother you. Besides, the game has so much to offer!   Karma system (although it's harder to be a bad guy, well, the devs are german, so I can see why); Trading system, sophisticated just enough to not to get boring; A very beatiful graphical design - hold Q and make some wallpapers! Diverse in-game moneymaking - fight pirates, be a pirate, trade, smuggle, accomplish a variety of missions... Interesting upgrade system - brings some RPG element into the game. And the game really benefits from it!  Weak sides of DSO in my opinion, are: Small room for maneuver during combat - makes all non-cruiser fights pretty straightforward; Useless minimap; Very small HP indicator when playing 1080p; Bad controller support.",
            "review_score": "1"
        },
        {
            "review_text": "Addicting and engrossing space sim/RPG. Voice acting isn't too great, but the story itself is engrossing enough to keep you coming back for more.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, missions are repetetive, story is medium, combat is basic, graphics is aged, voice acting is meh, but hey ♥♥♥♥ this ♥♥♥♥ this reminds me of my good old times so thumbs up haters gonna hate.",
            "review_score": "1"
        }
    ]
}