{
    "app_id": 12430,
    "name": "SlamIt Pinball Big Score",
    "release_date": "2009-02-23",
    "developer": [
        "Technetium Games"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Pinball"
    ],
    "achievements": 0,
    "positive_ratings": 31,
    "negative_ratings": 69,
    "price": 3.99,
    "description": "Big Score is based around a classic story of police vs. criminals in a fight for a big score. The fantastic action will leave you breathless and will pump-up your adrenaline while you are rescuing your ball, trying to hit that last glowing target.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12430/header.jpg?t=1447351675",
    "minimum_requirements": "Supported OS: Microsoft Windows® XP/VistaProcessor: Pentium 4System Memory: 512MBVideo Card: GeForceFX5900Sound Card: Direct X compatible sound cardDirectX Version: DirectX 9Hard Disk: 200MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Took more time to get it working on Win 7. Won't run on 8. Tech support was OK. Not fun nor interesting. Only 1 table as far as I can tell.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting Objectives, but crashes often. Have only been able to play a full game once out of 10 attempts. Cannot even get it to start after upgrading to Windows 7 from XP, even with uninstalles and reinstalles of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics look nice...that's the only good thing I can say for it.  Controls are garbage, and play is glitchy. Weird lag abounds, and this is on an 8-core AMD Sledgehammer proc @ 4.2GHz and a Radeon 6970 w/2Gb video RAM (sys RAM is overclocked, high performance DDR3, 16Gb).  This attempt an at original take on pinball fails miserably. If they had allowed for turning off the stupid slam play mode and just playing the provided table in traditional mode, it might have been able to be saved...but, as is, this is a do not buy at any price game.",
            "review_score": "-1"
        },
        {
            "review_text": "Picked this on up a while ago on the cheap. Haven’t had any trouble running it (Win7 64bit) but is pretty underwhelming compared to some other pinball games. You might say they're going for an old school look and feel, but it doesn’t quite get there and just feels cheap. ",
            "review_score": "-1"
        },
        {
            "review_text": "Game runs slow and choppy on my high end system. Total fail in my book. Give it a pass.",
            "review_score": "-1"
        }
    ]
}