{
    "app_id": 12460,
    "name": "BC Kings",
    "release_date": "2009-06-16",
    "developer": [
        "Mascot Entertainment"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS"
    ],
    "achievements": 0,
    "positive_ratings": 85,
    "negative_ratings": 76,
    "price": 3.99,
    "description": "BC Kings features several new elements not commonly found in strategy games. In addition to gathering resources, training an army and defeating the enemy, you will have to solve adventure and role-playing elements as well. The campaign is built around the epic story of the brave hero Mradin, and his trusty old friend Giesnik.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12460/header.jpg?t=1447352265",
    "minimum_requirements": "OS: Windows XP or VistaProcessor: 1GHz processor or betterMemory: 512MB memoryGraphics: 3D accelerated graphics hardwareDirectX®: DirectX 9Hard Drive: 300MB of free spaceSound: DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Alright, it's an ok game. If this game was $10, I would not recommend it, but it's good for it's quite cheap price.",
            "review_score": "1"
        },
        {
            "review_text": "I personally just didnt enjoy it!",
            "review_score": "-1"
        },
        {
            "review_text": "Awsome game cant get enough of it.",
            "review_score": "1"
        },
        {
            "review_text": "Everything about this game is awful. It feels like a student project that somehow got onto Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "DONT BUY!!!!!!!!!!!!!!!!!!!!!!!  Its a Basic RTS. it looks fun, and intriguing, but its gameplay is the same as WC2. it is 15 year old tech.  1/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game was not was I thought it was going to be, and I was very disapointed with it.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a good game, I get it for £0.69 but even £5 up to £10 is ok for this. It was developped by a very small team. The programmer and one of two 3D designer is the same guy. It look like a game that have been made in familly. Some good ideas, some bugs as well (I cannot see the cursor on spell casting). You cannot compare this game with warcraft III, that is not the same budget and not the same team. For the price go for it, no matter if you do not like it, the price is so low that you will not lost a lot of money.  One rare STR based on prehistoric age.",
            "review_score": "1"
        },
        {
            "review_text": "Finished it today. Game is fine for it's price and it does offer a lot. I had paid only close to 50cents and already got more out of it. It feels and plays like warcraft 3 but let's say without any voice acting. To understand the story all you gotta do is just read, read and read. I am okay with the reading part but if you're someone who doesn't like to read and find it annoying then you might not like it. Graphically game feels dated but its okay as long as it is able to entertain you. The game has some humour into it and does the does nicely or I should rather say cutely which is good enough to bring atleast a smile on your face. It does offer multiplayer option but I haven't tried it. If you're a fan of warcraft like games then you can buy this game and it will not disappoint you. If possible get it on sale, the game is still fun especially for RTS Lovers.   Edit: I didn't encounter any bugs except just one while trying to play a random match. If you add more than 2 match participants(In Random mode) then it's likely to freeze on loading screen besides that in approx. 26+ hours I didn't encounter any bug or whatsoever. Game is very stable.",
            "review_score": "1"
        }
    ]
}