{
    "app_id": 12470,
    "name": "Port Royale 2",
    "release_date": "2009-06-16",
    "developer": [
        "Ascaron Entertainment ltd."
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Trading",
        "Pirates"
    ],
    "achievements": 0,
    "positive_ratings": 174,
    "negative_ratings": 95,
    "price": 2.99,
    "description": "The Caribbean in the 17th Century - Trade with over 60 towns, create your own production facilities, expand your trading empire and influence the development of the New World. As pirates and military fleets threaten your trade convoys, you'll need escort ships.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12470/header.jpg?t=1447352266",
    "minimum_requirements": "OS: Windows XP / Vista Processor: Pentium III (or compatible) with 700MHz (or higher) Memory: 128 MB RAM (for Windows 98SE or ME), 256 MB RAM (for Windows 2000, or XP) Graphics: DirectX-8 compatible Graphic Card DirectX®: DirectX 9 Hard Drive: 700MB of free space Sound: DirectX-8 compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I can't be the only person who's gotten a pirate ship or spaceship and spent all their time hauling junk around to sell. There's something quietly gratifying about buying low and selling high, and so there should be no surprise there are games that exist to scratch that itch. Port Royale 2 does just that on the surface, and then surprises you with several more layers of fortune-seeking options.  You play an aspiring merchant in the Carribbean of the 1600s, starting with little more than a sloop and some sacks of money. Your ship will get you around to the many ports, each modeled in simple, charming Stronghold-esque 2D. The buildings that comprise each town determine what goods they produce from a list of about two dozen, and the rate at which they consume them. Your job, then, is to learn which towns need which goods, and where the best place to buy them up is.  It's not as simple as finding a town that makes shirts and a town that grows cotton, though. Each location is constantly producing and consuming goods, and their prices are determined by dynamic supply and demand. So, if you bring a huge load of cotton to shirt town you might make a pile of money, but turn around and do it again and that cotton might be worthless because they haven't used up the first load yet. Success in the mercantile business means making circuits around the sea, picking up whatever you can at bargain-basement prices and unloading it at whatever port happens to need it. The world map helpfully displays what good a town needs the most at the time, but there are plenty of other trader that can beat you to the punch.  The dynamic, living world of Port Royale is what keeps it fresh and entertaining, because not only will demand flip on you, you can be the agent of that change. Strike enough deals in a town and they'll grant you building permits to set up your own farms and workshops, allowing you to add new production sources across the map. With enough capital you can move away from buying and selling random goods and instead working your own supply chains for pure profit. You can have enormous merchant fleets at your disposal, moving around huge loads of goods or broken up across the Carribbean to beat the other traders to the punch.  Somehow the developers didn't think that was enough, so if you want to eschew the merchant life for full privateering, even that's an option. Any ship can be designated a warship and outfitted with cannon and sailors to take on pirates or merchants of other nations, or even besiege and ransack ports. Governors in major towns will even give you missions to eliminate particularly troublesome captains if you need guidance. There's real-time combat between ships that's functional but basic compared to other high-seas simulators, and comes with the odd handicap of letting you command one ship at a time while your opponents have their full fleet.  Still, the combat is an engaging and welcome addition atop the robust economic simulator, and it isn't even the only one. You can also choose to ferry around settlers and construction materials to help grow towns, gamble in the many taverns of the world, piece together treasure maps, and more. A series of four extensive tutorial scenarios will help you get a grip on the game, and then you have four challenge scenarios or the wide-open freeplay mode to enjoy. The chunky 2D graphics might not have aged very well but they certainly don't detract from the relaxed atmosphere, and the soundtrack is exactly what you'd want in a low-key trading sim. Anyone with even a passing interest in being a high-seas merchant is sure to find something to enjoy here.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome exploration era trading/ship fighting game",
            "review_score": "1"
        },
        {
            "review_text": "great game whrer you can build your own empire and loot diffrent nations  you choose be nice and trade or be a pirate",
            "review_score": "1"
        },
        {
            "review_text": "Good game for very little £££ in the steam sale. It's showing it's age, but nether the less it is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "I couldn't tell you since the game refuses to start up. Nice waste of money! So I can't give it a good review.",
            "review_score": "-1"
        },
        {
            "review_text": "best game out of all of them and one of the best trading sims out there to get this working for win 10 64bit go to library port royal 2 browse local files in propeties and set compatibility for all 3 exe not including uninstall exe to windows 98/me works fine loving the experience i am new to port royale but hardcore civ fan and anno if you like trading buying low sellling high and making a name for your self you will love this game already love it best out of all of them and cant moan as i got it on sale for 40 p or so lol same like civ 5 98 quids worth of 16 titles i bought for 8 quid yummy . seriously though its easy to getinto as well you just have to pause game took me a while just to find how to build building until i accidently pressed B good game.........so many negative reviews only because they cant get it to work if you follow my method 80 percent time it will work good luck have fun",
            "review_score": "1"
        },
        {
            "review_text": "Looks like a cool game, but has serious reliability issues. It's a gamble whether it will work or not. Hopefully, they'll patch this.",
            "review_score": "-1"
        },
        {
            "review_text": "Jean Kirstein approves of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Game fails to open up into 'applications', it only goes as far as opening up into 'processes', so the game is broken...",
            "review_score": "-1"
        },
        {
            "review_text": "THis game has ports and royale and it may or may not have water!! I mean how cool is that?",
            "review_score": "1"
        },
        {
            "review_text": "As old as this game is, it is still one of the most complex games of its time. Very fun to play and incredibly addictive. The amount of history in it is quite amazing, As well as the amount of in-game depth. Downside is the occasional compatibility issue.",
            "review_score": "1"
        }
    ]
}