{
    "app_id": 12480,
    "name": "9th Company: Roots Of Terror",
    "release_date": "2009-12-03",
    "developer": [
        "Noviy Disk",
        "Lesta Studios Inc"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Military"
    ],
    "achievements": 0,
    "positive_ratings": 86,
    "negative_ratings": 67,
    "price": 6.99,
    "description": "9th Company Roots of Terror is an action-oriented real-time strategy game based on actual events that took place during the Soviet military campaign in Afghanistan. 9th Company follows the story of a ragged band of young recruits undergoing brutal training in Uzbekistan’s Fergana Valley and culminates with a bloody stand against the...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12480/header.jpg?t=1447352677",
    "minimum_requirements": "OS: Windows XP SP2/Vista  Processor: Intel Pentium 4 2400 MHz and higher Memory: 1024 Mb (2048 Mb for Windows Vista) Graphics: 3D accelerator with 128Mb video memory (NVIDIA GeForce 6600 or ATI Radeon 9800 Rro and higher) DirectX®: DirectX 9.0 or higher Sound: DirectX-compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Great RTS game. I enjoyed every aspect of this game. Some of the missions were actually difficult to complete, especially when you get ambushed while trying to clear a mine field. Some might find the fact that your reallly need to keep close watch on all your troops movements at all times, especially if you split them up into 2 groups for a 2 pronged attack, a bit tedious, but I liked having to be constantly aware of my soldiers because you never could tell where the enemy would hit you next or when you would run into a MG nest. If I had to pic anything that was annoying, it woul dbe the AI's constant targeting of my medics, but to be honest, that made it that much more challenging and realist, 'cause the enemy probably would target medics if RL anyway. Anyway, great game and I would recommend getting it if you like rts style games.",
            "review_score": "1"
        },
        {
            "review_text": "this game is ok but its a bit fiddly and slow paced for the average RTS gamer   its some what realistic but unfortunately realism does not always mean something will be fine like in real real life you scout ahead locate the enemy set up then attack the enemy however it takes a while to set up for the actual engagement and its over so quickly that its not very enjoyable a lot of the time you can simply send a hind in to engage then send infantry in to mop up whats left   it has decent mechanics but the guns on everything are very inaccurate to make up for the distance of engagements there is also an issue with not being able to access other soldiers inventory meaning if your medic gets killed or is down then everyone is going to be on the ground writhing in pain  if you want a semi realistic RTS then go ahead but don't expect a fast paced action pact game because this is not really that",
            "review_score": "-1"
        },
        {
            "review_text": "It looks to be an okay game, but... I thought it was free? I mean, it's not something I'd play, I don't like RTS games, but if you're into RTS games, then pick this up for free/cheaply!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the biggest ♥♥♥♥ I ever played",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't have the patience for it. Despite the tutorial and clear objectives, you still feel lost. On top of that unit movement is painstakingly slow and the vehicle AI is not very intelligent, causing them to collide into ♥♥♥♥♥♥♥♥ things and having to back up, slowly pivot, and then continue. Also very difficult to keep your units together even in formations and hard to spot exactly where enemy fire is coming from.  Seems like it might be an okay game, but not good enough to make me want to deal with the headaches.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros-Unique setting. Cons-Confusing how to play.  This is another instance of good movie bad game.",
            "review_score": "-1"
        },
        {
            "review_text": "HATE IT",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible, I moved my men up a mountain and they all died within the first 2 seconds, i couldn't even see where the enemy was and this is a Rts game. What?",
            "review_score": "-1"
        },
        {
            "review_text": "Dont Buy !!! (Men of war is better) al of the men of war games",
            "review_score": "1"
        }
    ]
}