{
    "app_id": 12710,
    "name": "Overlord™: Raising Hell",
    "release_date": "2009-11-12",
    "developer": [
        "Triumph Studios",
        "Virtual Programming"
    ],
    "publisher": [
        "Codemasters"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Villain Protagonist"
    ],
    "achievements": 0,
    "positive_ratings": 946,
    "negative_ratings": 75,
    "price": 6.99,
    "description": "How evil can you get? Discover how corruptible you are in Overlord, the twisted fantasy action adventure where you can be evil (or really evil). In the game's seriously warped fantasy world, players will become the Overlord and get first-hand experience of how absolute power corrupts absolutely.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12710/header.jpg?t=1469618484",
    "minimum_requirements": "MINIMUM Supported OS: Windows XP/Vista Processor: Pentium® 4 2.4 GHz or Athlon 2400+ Memory: 512 MB RAM Graphics: Any video card with 64MB or higher DirectX Version: DirectX® version 9.0c or higher Hard Drive: 4.5 GB free",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is a LOT of fun, &amp; worth every penny i spent on it. When on sale this game is a NO brainer &amp; every1 should have a copy of it. Seems when i started playing this game i jumped straight into 'raising hell' so i'am not exactly sure what the differences are from the original Overlord. I want more games like this &amp; wondering why a overlord 3 hasn't been made or in developement. MUST buy/have game ! ! !",
            "review_score": "1"
        },
        {
            "review_text": "Minions are cute and deadly at the same time. And you are basically Sauron look alike chopping down whiny villagers, throwing fireballs at fat hobbits and pillaging elven kingdoms. What's there not to like?",
            "review_score": "1"
        },
        {
            "review_text": "This game is one that you will play once or twice and then a few years down the road think, 'Huh, I remember that. I should play that again.' Overall amazing gameplay, fun story line with a few choices if you want to make everyone beg for mercy or thank you for your gratitude... Definite Buy",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the original since the expansion is kind of repetative. Still the humor in the game is worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Most underrated game I've ever played. This is fun for children and adults alike. Very very fun game and literally 80+ hours of puzzle, smashing and fun availiable.",
            "review_score": "1"
        },
        {
            "review_text": "its pretty silly",
            "review_score": "1"
        },
        {
            "review_text": "this is a dlc, but it kinda comes with the actual game, hence the large files despite being dlc. all your save files is there but you gotta fight the final boss again if you finished the game, after that the portals will start showing up  it extends gameplay for a good 3-4 hours and giving you extra crafting equipment although not much. id say its worth it and helps support the developers, so by all means grab it. the ending sets up the sequel for this game.",
            "review_score": "1"
        },
        {
            "review_text": "I myself enjoy this game for it likes to focus more on the minions you control and run around with then just your big guy and its fun to watch them run around breaking things and such",
            "review_score": "1"
        },
        {
            "review_text": "This is a great Title. It has a original and unique playtrough that no other game ive seen can offer. Very Fun :)",
            "review_score": "1"
        },
        {
            "review_text": "A unique experience for PC users. Cause some havoc controlling your own horde of minions and watch them equip pumpkins for helmets and zombie arms for weapons in the process. All set in a satire of Tolkenesque settings.  One of my favorite games ever.",
            "review_score": "1"
        },
        {
            "review_text": "For da masteeer !!!  Leader of the Fire Starters Exploder of Melvin Underbelly Appreciator of Voluptuous Assets Lord of Lust and Lechery Most Knowledgeable Master of Minions Aggravator of the Angry Beards  Just play this freakin game    ",
            "review_score": "1"
        },
        {
            "review_text": "i almost want to say that this 1 is better then 2 but 2 got some nice things aswell 1 has an arena which i donot remember in overlord 2   but 2 got nicer graphics and incrediable story and was more off a comedy then number 1  but the game is fun music is yet agian amazing but u know the overlord theme is good in the 1st place :D but 1 has more fighting then 2 in is overall harder untill this point   altought 2 had more choices  and i have no idea yet if i can enslave towns in 1 but it was a cool aspect in 2 and i still only got the fireball skill so i geuss yes  anyhaw gameplay is good music is good its an bit of an older game but graphics are amazing multiplayer is sadly as dead as overlord 2 :(  but overall a fun expirience if u havent tried out this funny and domenating world game then check it out  ITS WORTH YOUR WHILE  AND REMEMBER: EVIL WILL ALWAYS FIND A WAY &gt;:D",
            "review_score": "1"
        },
        {
            "review_text": "Liked and recommend Overlord in general: nice rpg-action-adventure-rts mix. Disliked the small expansion (Raising Hell): annoying weird quests (contain lots of bad puzzles imho). If Raising Hell comes free/very cheap, then it might be worth purchasing, otherwise just avoid and play the normal Overlord. PS. Game contains lots of good humour (imo).",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game and Overlord and it won't open Overlord and opens this so I spent money on 2 of the same games? Pretty bitter about that but the game is still fun.",
            "review_score": "-1"
        },
        {
            "review_text": "It started greatly, then became repetitive and dull.",
            "review_score": "-1"
        },
        {
            "review_text": "im told by my housemate that its a good game, i also dont believe a word she says",
            "review_score": "1"
        },
        {
            "review_text": "I remeber playing Overlord on my xbox and having a great time being the most evil I oculd be. Now that I bought the game and it's dlc I'm hooked again. The old game is still as fun as I remeber and the dlc adds 4 new realms for you to explore and coonquer. allowing youy a look into some true evil the new abbysses will let you continue the adventure and you plunge into your enemies deepestr and darkest fears. There is 1 new helmet, 1 new armor, and 3 wepaons along with new funny gear for your minions. I currently lead an army of golf club wielding, pimp hat wearing browns. Along with more gold to plunder I'd defiently say Raising Hell is worth $10. Just a sidenote, you need to have purchased Overlord and have it downloaded before you can download and play Raising Hell.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played this game in years and it's still amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Bah, just pick up the original version if anything. All this does is add some additional content that is more tedious than anything else. Plus the rewards are mostly useless.",
            "review_score": "1"
        },
        {
            "review_text": "Remember, evil always finds a way...  Verdict: 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Go buy this right now while its 2 bucks. Along with the base game (required) and Overlord II. Skip the package since by all reviews the last (and more expensive) game sucks, unless you just want to give Codeforce some money.  I don't know how I missed this franchise for so long but it is great good clean evil fun! ",
            "review_score": "1"
        },
        {
            "review_text": "I installed the Raising Hell expansion after I completed Overlord. It allowed me to continue on by revisiting the four main areas of Overlord and devling deeper into the Infernal Abyss. New enemies, new challenges, and plenty of evil to go around. I was hoping there would be more expansions for Overlord, but if you want more than this you'll have to play Overlord 2.",
            "review_score": "1"
        },
        {
            "review_text": "Though I do not have time to write a long review about this game, what I can tell you is this is a great game. I had it sitting in my steam library as I had purchased it during a sale and one day decided to start playing. It doesnt have an etricate story and is easy to jump into. I played this game 2 hours in my first time playing. This game is action packed, easy to play and I recommend this to anyone looking for a casual game to play.",
            "review_score": "1"
        },
        {
            "review_text": "If you play a lot of minion master classes in MMO's you'll probably enjoy this game. You take control of a bunch of little imps and have them do whatever you want. You are also a warrior based class so you can fight things with your weapons but your little minions can also aid in the fight. They will also pickup small items in game and use them as weapons/armor if they are equippable. You start off with only the basic type of imp but later on you can get ones that can start using magic and some that can even swim around in water.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a much more hands-on Dungeon Keeper, with fewer minions and more Rhianna Pratchett. Which is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Wacky and hilarious! Total fun indeed! It is a RPG that lets you not be the goody-two-shoes like all the others!",
            "review_score": "1"
        },
        {
            "review_text": "In an interesting fusion of games like Pikmin and Fable, Overlord proves to be an enjoyable, albeit sinister experience from your initial awakening, all the way to your fated seat upon the throne of evil. Each step of the game brings you through lush, detailed landscapes, offers rich musical scores and introduces clever, original writing not present in a lot of games of its kind. With a well integrated moral choice system, you're not forced to be a 'bad good guy' as with most games. In fact, most choices are between evil and incredibly sadistic. Different abilities, storyline changes and even appearance alteration will supply some replayability. With its unique fusion of tactical, RPG and adventure elements, Overlord is sure to offer something for everyone. The expansion 'Raising Hell' adds even more to that experience with new bosses, areas to explore and items to obtain that ultimately help you unleash mayhem across the land as you truly live up to your title of 'Overlord'.",
            "review_score": "1"
        },
        {
            "review_text": "Note: this is a review for both the original game as well as the expansion, as steam seems to think they are one and the same.  Be Evil! That's the supposed attraction of Overlord, an interesting hybrid of tactical strategy, action RPG and adventure game, all wrapped in a purely satirical shell. However, how evil you actually get to be is rather low, being either murderous evil or the evil version of “nice by accident”. In either case being evil isn't really the attraction of the game, as much as it is about the parodic fun the game pokes at all things fantasy.   Which is good, because the battle system is unwieldy, the stages are sometimes a bit too long, and in the middle of the game the expectation of lifeforce to imbue into your weapons and armor vs the amount you actually have results in a near grinding halt of the gameplay as you grind away in your dungeon on beetles and their ilk. Clearly the game has some problems, not the least being the somewhat obtuse Hell stages of the Raising Hell DLC.  But it's all ok! Though those problems can be felt, they are helped along by a silly, interesting, goofy tale that really ends up being about revenge, sin, and what it really means to be evil . . . as well as by some fairly pretty graphics, even seven years past the game's release.  For anyone that enjoys a silly tale of fantasy parody and ordering goblin/gremlin-like minions to kill things, this is a game best picked up. Though if you can find this game, it's DLC and the second game on sale in the Overlord Complete Pack, I'd suggest that even more. ;)",
            "review_score": "1"
        },
        {
            "review_text": "another famazing game, but its a bit old, if you have some change and free time, i defiantely recomend this game, will have you laughing with its humor, and the minion controlling is cool, solid game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This addon to Overlord is a great ride into a new series of realms....a new gate of holy appearance comes to being outside your villiage and your villagers and escaping into it. We can't have that can we? Gather your minions and enter this new portal, wreak havok within and send a message to those who would edge in on your dominance. A great expansion that adds new areas, fun puzzles, and some hilarious throwbacks to the main story. This is a definite buy if you think you've allready taken over the kingdom.",
            "review_score": "1"
        },
        {
            "review_text": "Gives you something to do after you beat the main campaign, especially new opponents to try your newly-forged weapons on. Introduces some new ideas like forging unique items after recipes that you can find. But the real reason to play is again the humour. 'Nothing cleans like a paladin'... 'nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "great game full of fun.,",
            "review_score": "1"
        },
        {
            "review_text": "Funny and evil in all of the right ways, humorous voice acting and enjoyable music. There aren't many reasons to play through Overlord twice and the multiplayer isn't too great, but there is good reason to invest your time doing everything in the single player game.",
            "review_score": "1"
        },
        {
            "review_text": "Hey you ! You dark bad and vile peoples ! Have you always dream to bring Chaos ?  Well here you go, you are the OVERLORD ! The dark lord who can bring chaos and destruction if you want to with your minion army in this fantasy world !  Always wanted to massacre all the cute creatures like pixies ? Your wish will be exhaust in this 'Lord of the ring' like parody world which you can find some pikmin and dungeon keeper aspect as well and it's very fun ! Buwahaha !   A fun game =V",
            "review_score": "1"
        },
        {
            "review_text": "I like this game very much - definitely recommend .",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun and very silly plus it is always cool to be the villain ;)",
            "review_score": "1"
        },
        {
            "review_text": "This DLC shows how the DLC should be made. There are a new content, new locations, new enemies but also you meet old guys from the base game.",
            "review_score": "1"
        },
        {
            "review_text": "Evil always finds a way. Though the way may be affected by somewhat clunky controls, it manages to provide great amount of jokes that land and kinda unique gameplay. And Gnarl is always the best, even when he betrays you (Spoiler? How evil of me!).  Recommended: Does one sheep have the same number of brain cells as ten minions have, provided that one minion has exactly one?",
            "review_score": "1"
        },
        {
            "review_text": "Years ago when I was younger I played the original Overlord game and it's expansion Raising Hell. It was fun, but at the time I found Raising Hell lacking after coming off the colorful and vibrant Overlord main game. Nostalgia brought me back and time has aged this game finely.  Triumph has created a unique blend of army commanding with a standard action feel. By now it should be easy to see what the game is like, so as a PC port how does it hold up? Okay. There are a few awkward keybindings, but not atrocious. It runs smoothly, no chopping, scales up to High res monitors. Completely recommend this game. ",
            "review_score": "1"
        }
    ]
}