{
    "app_id": 12770,
    "name": "Rise of the Argonauts",
    "release_date": "2009-01-07",
    "developer": [
        "Liquid Entertainment"
    ],
    "publisher": [
        "Codemasters"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Adventure"
    ],
    "achievements": 0,
    "positive_ratings": 365,
    "negative_ratings": 178,
    "price": 4.99,
    "description": "As the King of Iolcus, Jason had everythinga prosperous kingdom, the respect of his peers, and a beautiful fiancé. When she was killed on their wedding day, he vowed to do anything to restore her life. Now, in order to accomplish this heroic feat Jason must seek out the Golden Fleece -- and with the help of Greek mythology's greatest...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/12770/header.jpg?t=1447351514",
    "minimum_requirements": "OS: Windows XP/Vista                     Processor: 3.0 Ghz Pentium or AMD™ equivalent                     Memory: XP 1GB RAM / Vista 1.5GB RAM                     Graphics: Geforce 6800 / Radeon X1300 or above                     Hard Drive: 8 GB Hard Drive Space                     Sound: DirectX Compatible Sound Card                     Supported Graphics Cards: Rise of the Argonauts requires an ATI or nVidia graphics card / ATi Radeon X1300 or above / HD2XXX/HD3XXX/HD4XXX series / nVidia GeForce 6800 or above 7/8/9/GTX2XX Series.                     Not compatible with all integrated sound/graphics solutions (inc. Laptops).",
    "recommended_requirements": "OS: Windows XP/Vista                     Processor: Intel Core 2 Duo @ 2.66Ghz or Athlon X2 3800+                     Memory: 2GB RAM                     Graphics: GeForce 8800GTX or above, or Radeon 3800 series or above                     Display:                      Hard Drive: 9.2 GB Hard Drive Space                     Sound: Creative Sound Blaster X-Fi Sound Card",
    "reviews": [
        {
            "review_text": "GOOD: Interesting setting based on Greek mythology, and an original levelling system whereby you dedicate your accomplishments (completing quests, defeating enemies etc...) to the gods, which gets you points to spend on combat abilities. You also gain the gods favour through dialogue choices, and this helps tie the roleplaying aspect to the combat - if you want to unlock the abilities of war god Ares, it helps to roleplay Jason as aggressive for example.  BAD: The game is short and fairly linear; although the dialogue options affect your character development, there is not much choice in how the quests play out, apart from which order you attempt them in. The combat is also pretty simple and gets a bit repetitive by the end. Finally, if you know anything about the actual Greek myths, you may be disappointed with the games interpretation/butchering of them!  UGLY: This game has a lot of bugs, i had CTD's (though there are fixes on the discussion page that helped) and problems with the audio; weird distortions and sometimes it would cut out temporarily (make sure subtitles are ON!)  Overall i enjoyed it, i didn't mind the linearity or simple combat too much, and it has moments of real creativity. Its nothing groundbreaking, but if you can deal with the occasional CTD, for £5 I'd say its worth a shot",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic Greek mythology game! As someone who really enjoys Greek mythology, this game was for me! No its not the best game in the world but its still amazing. It may not have the graphics of say Ryse son of Rome but it has twice the length of that game and more then half the price. It is a game that could have easily been better in many ways but it doesn't take away the fact that this is a great people. All the naysers are wrong, this game is great. Its not very hard and is plot heavy but the plot really follows the Greek mythology archtype. Where else will you get to fight along Greek Legends like Hercules or Achilles. For me, this game was perfect, cheep with great gameplay. Don't let the negative nancy's fool you. The game did crash a few times but I've had way worse. I reccomend this game to anyone who, like me, enjoys Greek mythology or likes a game that has great length for a great price!",
            "review_score": "1"
        },
        {
            "review_text": "All-in-all, this is a decent game. It's not really breaking any new ground, but the story is nice, the setting is refreshing, the gameplay is solid and I did have fun while playing it. I'd say it is well worth the $10 price tag. If it's on sale, it's a no-brainer, just buy it. ",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun. That's it. Rise of the Argonauts won't have you deeply invested in it's chatacters or storyline. In fact, it may be one of the things that puts you off, as this game changes Greek Mythology quiet a bit (a very small example is that Medusa has a brother in this game, not two sisters) and if you are familiar with the Greek tale of Jason and the Argonauts, you might be left disapointed with the changes in narrative.  And yet, I found compeled to see this through to the end. The meaty combat is really what's going to keep you going through all the mediocre dialouge. It's pretty satisfying impaling an enemy with a spear, right before swinging you shield at their face and watching the decapitated head soar away, leavign a bloody spray behind. How did a shield decapitate a foe in full armor, you ask? Well, I say how in the world is there a relic that can restore people from death! It's Ancient Greece, stop taking things so seriously and just go kill more Ionians with that fancy sword of yours!  All in all, this is one of the few games I've played recently that I actually find 'fun'. Well worth it if you can pick it up on sale, and trust me: After the first island, the game picks up, I promise! Oh, and grab the mace from the guy who comes yelling at you in the village on the starting island. Don't be like me and expect a peacful way to get it later on. *looks at empty weapon rack and sheds a single tear* Seriously tho, grab the mace, and grab this game too!",
            "review_score": "1"
        },
        {
            "review_text": " PROS:  + epic adventure feel + boss fights + multiple fight styles based on your weapon + skills tree   CONS:  - (after a while) repetitive combat with minions - limited customization options in the main menu - more difficult to play with keyboard &amp; mouse   Comment:  I will start off with the note that this game is definitely not for everyone. It is not something you will think about with a nostalgic feeling after years. It is clearly a port to PC and as that has limited video settings which have to be configured in the .ini file. But despite it all the important question to ask yourself when playing a game is - IS IT FUN? And here is why I recommend it as it brought me lots of fun. I played the non-steam version and even though it depicts the Argonaut storyline very loosely you cannot help but get that 'epic quest' feel here. Henchmen combat is okay but it is the boss fights that really take it. Overall a mediocre game that can be a lot of fun ... if you let it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for everyone who like a good story and are somewhat interested in Greek mythology. Battle is kinda boring tho because most of the battles are much alike.",
            "review_score": "1"
        },
        {
            "review_text": "Competent story, medicore gameplay. A solid 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun game overall with a great story. Choices don't really matter unless you want to earn in game achievements and the camera gets kind of annoying but the fights are fun and the rpg-ing is enjoyable. There seems to be a problem with the port to PC which causes the game to crash, I played in a fullscreen windowed mode and it crashed less, but still often. To sum it up, a great story with enjoyable gameplay but flawed by camera and crashes.",
            "review_score": "1"
        },
        {
            "review_text": "it's like mass effect and god of war had a baby and it's boring.   edit:  after 2 hours the game does pick up.",
            "review_score": "1"
        },
        {
            "review_text": "good game! if you like to fight in greek time this is for you ;)",
            "review_score": "1"
        },
        {
            "review_text": "  6/10 TJBs",
            "review_score": "1"
        },
        {
            "review_text": "Nice game great story so far plan to play much more.",
            "review_score": "1"
        },
        {
            "review_text": "Not a great game but the leveling system is unique. Worth to play but for Me, once is enough already",
            "review_score": "1"
        },
        {
            "review_text": "So far I´d recommend this game. Only I´m facing a problem. the camera view keeps spinning incessantly. Does anybody know how to fix that?",
            "review_score": "1"
        },
        {
            "review_text": "Is this the best game in the world? Nah. But it really is a GREAT game. I'm bothered a lot about gameplay getting in the way of the story; that does NOT happen here. The gameplay is quick to pick up and fairly intuitive. There's very little HUD (practically none), and each encounter is carefully planned/placed and makes perfect sense. It never feels like grinding.  Storywise, it's a very rich game. If you love Greek mythology you'll have a fun time with how Rise of the Argonauts plays with it. My one complaint is that the story is very 'plain.' There are a few chances to complicate the narrative that are just passed by (the oracle, for instance, clearly switches between the maid, matron, and crone in her speech. Or as the Moirai, Clotho, Lachesis, and Atropos. In either case it was a fun opportunity to make the character a bit more three-dimensional) but by and large this same plainness is done SO WELL that it really works for the game.   The graphics are dated, but they work well for the game as a whole.   I finished the game at just over 10 hours on normal difficulty. I wasn't a super-completionist (can't be bothered) but I can't imagine it being much longer even if I were. I really only had trouble with a FEW battles but otherwise it was intuitive enough I didn't have to look up help.",
            "review_score": "1"
        },
        {
            "review_text": "Oh Wow! I realised I haven't reviewed this.  Amazing game, seriously just something about it was so mesmerising. I started one evening at a LAN, everyone went to bed and I ended up doing an all nighter and finished around mid morning. Just looking around at everything I could do. Nice story. And the action was just epic enough with a few slowmo's which didn't get annoying at all as you could control the camera and when to speed up.",
            "review_score": "1"
        },
        {
            "review_text": "I played the game soon after the release,but did not finish it then,so I decided to do it now and I have got to say that it wasn't the experience I remembered from year 2008 - the graphics as well as mechanics feel a bit outdated for me now.You can't also change the controls nor the graphics settings.Nonetheless the game is still playable and worthy playing.It's cheap and there's only a few games like this one for PCs.The setting is nice,the story's a bit predictable,but still interesting and the gameplay's good.",
            "review_score": "1"
        },
        {
            "review_text": "Do not be lured by the cool looking preview videos and screen shots. This game is too broken to play even if you have a controller and a great computer - and it suffers from crashes all the time. And yes, I tried all different kinds of suggestions to try to stop it from crashing. If you read the reviews, you'll see I'm hardly the only one to be disappointed by the game for these reasons.",
            "review_score": "-1"
        },
        {
            "review_text": "Rise of the Argonauts is an action rpg set in ancient Greece. You play the mythical hero Jason in search of the golden fleece, in an adventure filled with Greek mythology. The story was entertaining and I enjoyed the recreation of ancient grease, it made the game seem more weighty than the typical fantasy fair, being grounded in earth history. Gameplay wise it consists of lots of interesting conversations and side quests, as well as typical rock paper scissors combat. There are several distinct play styles in combat which made for a nice change of pace. There is plenty of choice in the conversations, but instead of the typically good vs bad vs neutral conversations trees this game basis the conversation topics on different gods. Each of the 4 gods has a level up tree where you open up new abilities and bluffs, the deeds you complete and conversation choices you makes fills the appropriates God’s tree. It’s a fresh and different take on conversation and quests and I really enjoyed this aspect of the game.  Overall I really enjoyed my time with Jason and his Argonauts. Unfortunately I can’t recommend this game as during conversations it kept randomly crashing to desktop. It started periodically at first, and then grew in rate to the point of crashing every few conversations, making the game basically unplayable. I tried a few of the fixes I found in steam forums and online but none of it solved the crashing. Overall Rise of the Argonauts is a really great hidden Gem RPG, but it’s very buggy to the point of being unplayable. A search of the forums in steam will show I am far from the only one with this experience. ",
            "review_score": "-1"
        },
        {
            "review_text": "One of the most canned games ever made if you want to listen to a half-♥♥♥ story and beat up the baddies that are shoved in your way in an eclosed arena every room, this is your game. If not stay away",
            "review_score": "-1"
        },
        {
            "review_text": "Bad camera angles plague you through the entire game. Decent artwork thought.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is laughably bad, and not just because it's an obvious port from consoles to PC. Controls are clunky, animations are worse, and there are poorly acted cutscenes, breaking the rare fluidity of Jason cutting people in half, every two minutes. If you're a fan of Greek mythology, this won't do anymore for you than someone who isn't, because the story is post-Odyssey and makes no sense. Then again, I didn't even stick it out far enough to experience the critically lauded skill progression, but I feel like my time is better spent playing any number of other, infinitely better, fantasy RPGs or hack and slashes. If you like hack and slash combat in a historic or fantasy historic setting, try Spartan: Total Warrior instead or God of War.",
            "review_score": "-1"
        },
        {
            "review_text": "The game's controls were designed by a monkey with only a basic understanding of how a computer works, and no experience actually using one. On top of that, the monkey has ADHD and constantly changes its mind about what the controls should be.  Redeeming features include a pretty main menu, but it has no graphical options other than resolution.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad PC port, bad voice acting, bad storyline, extremely linear. DON'T BUY THIS GAME!!!! ",
            "review_score": "-1"
        },
        {
            "review_text": "While I absolutely loved playing this game on console, (Without knowing how to block through 90% of the game though), putting it on PC was a horrible idea. Without any settings to chance the graphics quality, nor any ability to change the cripplingly high mouse sensitivity, I literally could not get through the first part of the tutorial before I decided it was unplayable. Good game on Console. HORRIBLE game on PC. If you get it, don't get it for PC.",
            "review_score": "-1"
        }
    ]
}