{
    "app_id": 13000,
    "name": "Ninja Reflex: Steamworks Edition",
    "release_date": "2008-03-21",
    "developer": [
        "Sanzaru Games"
    ],
    "publisher": [
        "Nunchuck Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Ninja"
    ],
    "achievements": 52,
    "positive_ratings": 48,
    "negative_ratings": 4,
    "price": 3.99,
    "description": "Master the Art of Speed and become a Ninja Gamer! Ninja Reflex uses martial arts challenges to test your reflexes, sharpen your hand-eye coordination, and measure your reaction times to the millisecond. Wield throwing stars, katanas, nunchucks...even chopsticks!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/13000/header.jpg?t=1447351277",
    "minimum_requirements": "Supported OS: Microsoft Windows® XP/Vista Processor: Intel Pentium® 1.0 GHz or higher processor System Memory: Windows XP: 256 MB of RAM, Windows Vista: 512 MB of RAM Video Card: DirectX 9.0-compatible video card/ DirectX Version: DirectX® version 9.0 or higher Hard Disk: 250 MB available hard disk space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Ninja Reflex just doesn't seem to pack a ton of value, and the repetitive nature of the minigames may grate on you after a while. There's also a sense that this is probably a much better game on the Wii, since that system actually requires you to use your arms like a ninja. Overall, I would say it's 'Okay' about a 6/10.",
            "review_score": "1"
        },
        {
            "review_text": "for those that want their nerves to be broken ! ^.^ ",
            "review_score": "1"
        },
        {
            "review_text": "To me this game is more of a 'Mouse burn-in' program. i often install and play it when ive gotten a new mouse or drawing tablet and wan't to get used to it asap. tough beyond that i hardly play.  Its best to treat this game like a utility for mouse calibration, rather then a game to improve 'skills'",
            "review_score": "1"
        }
    ]
}