{
    "app_id": 13230,
    "name": "Unreal Tournament 2004: Editor's Choice Edition",
    "release_date": "2004-03-17",
    "developer": [
        "Epic Games, Inc."
    ],
    "publisher": [
        "Epic Games, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Arena Shooter",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 2211,
    "negative_ratings": 66,
    "price": 8.99,
    "description": "Unreal Tournament 2004 is a multiplayer first person shooter that combines the kill-or-be-killed experience of gladiatorial combat with cutting-edge technology. Ten game modes - both team-based and &quot;every man for himself&quot; -- provide even the most hardcore gamer with palm-sweating challenges through unbelievably detailed indoor...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/13230/header.jpg?t=1447351271",
    "minimum_requirements": "Supported OS: Windows 2000/XP Processor: Pentium III 1.0 GHz or AMD Athlon 1.0 GHz or faster (Pentium® or AMD 1.2GHz or greater recommended)  Memory: 128MB RAM (256MB RAM or greater recommended)  Graphics: 32 MB video card required (64 MB NVIDIA or ATI hardware T&amp;L card recommended)  Sound: Windows-compatible sound card DirectX: DirectX 9.0b Hard Disk Space: 5.5 GB Free  Multiplayer: Internet (TCP/IP) and LAN (TCP/IP) play supported. Internet play requires a 33.6 kbps or faster modem (broadband recommended)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Ten years later, and still on top.  Happy Birthday Unreal Tournament 2004.",
            "review_score": "1"
        },
        {
            "review_text": "No level up mechanics. No prestiges. no kill streak rewards. Your success depends entirely on your skill and that of your teammates. Unreal Tournament 2004 is THE classic arena shooter.",
            "review_score": "1"
        },
        {
            "review_text": "this fps requires a real skill",
            "review_score": "1"
        },
        {
            "review_text": "Best arena FPS game I know. Regular deathmatch is nice, but Instagib is something that never gets old. With all the 2003 and 2004 maps and the Community Bonus Packs this thing has more maps than the Bureau of Land Management. Probably.  I nominated this game for THE “TEST OF TIME” AWARD in The Steam Awards 2016.",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "The way to success lies through failures, and only those who doesn't fear critics, will master this road. Unreal Tournament 2004 — not simply doubled number of the cards, new textures, game modes and tons of pleasant trifles. It is attempt to grope the style lost in motley UT 2003 tinsel and to get back to the ideas which in due time have made the best-seller the first UT; fruit of two years' evolution, thoughtful studying of responses and careful introduction of new concepts. Certainly, about any aspiration to start everything with a clean slate the speech doesn't go — UT 2004 at least on two thirds consists of old materials. Well familiar modes are attached to thoroughly propatchenny frame of the previous version — дефматч usual, дефматч command, CTF, Double Domination, Last Man Standing and Bombing Run, and 50 of 106 available cards already 'stayed' in UT 2003 and free a bonus-pakakh from Epic/Digital Extremes. Copied them not blindly — the levels which design caused special complaints, are changed or processed, and the balance of forces got rid of lameness. So, the spring ability of players decreased and 'adrenalinic tablets' fell in price, adding now on only two units 'is flown into a rage'. But after all game should be tried, I advise all! (This my opinion and it can not coincide with yours).",
            "review_score": "1"
        },
        {
            "review_text": "Fix: if you switch to windows 10 you have to go to  'C:\\Program Files (x86)\\Steam\\steamapps\\common\\Unreal Tournament 2004\\System\\UT2004.ini' then locate [D3DDrv.D3DRenderDevice] then below this divider you will find ReduceMouseLag=True, change it to False. After that, simply save then play.  TL;DR 10/10 - This game is one of the best out there, because of it's fast paced FPS style and large amounts of gore (can be changed in settings). Also, it has amazing graphics for it's time and is simply a fun game to spend hours playing.",
            "review_score": "1"
        },
        {
            "review_text": "still the best Unreal Tournament game to ever come out",
            "review_score": "1"
        },
        {
            "review_text": "This game never gets old. Go and buy it.",
            "review_score": "1"
        },
        {
            "review_text": "UT2k4 is a legendary multiplayer FPS that made Epic more then a studio that made the engine Deus Ex ran on. It featured fast paced deathmatch and amazing balance with it's weapons. What made UT2k4 also legendary was it's bot AI, which remains unprecidented in intelligence. It mimics the movements of actual players and unless your a software programmer feels totally unpredictable.  UT2k4 also had a very large modding community and games like Red Orchestra and Killing Floor were mods for this game. Truly a delight to play and reminds me of a nice Saturday afternoon.",
            "review_score": "1"
        },
        {
            "review_text": "It’s classic.  Get it",
            "review_score": "1"
        },
        {
            "review_text": "An absolute must-have for anyone who loves to mod their game into an unrecognizable mess.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i know.. Old but freaking FUN!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Fast-paced, fun, requires skill, accuracy, a bit of thought, quick reflexes, and the ability to actually move around properly.  Dodge, wall-jump, and double-jump mechanics allow you to combine these in any order. They allow you to move quickly and be all over the place, making yourself hard to hit, and allow you to get across the map faster.  There are a multitude of weapons to be picked up off of the map, all of which are unique and have their own special functions, and alternate firing modes.  Hundreds of maps, most with great art-style, environments, geographical design, and music.  Being a game from 2004, the game still looks fantastic (better than many games today, unsurprisingly), and has a multitude of great bonus features.  -Press F11 and the game opens a built-in in-game music player that allows you to play any of your own, or in-game songs, instead of what the current map is playing. -In the audio options, there is a feature that enables built-in text-to-speech for the chat and IRC areas of the game, that way you don't miss a word as your head spins on a swivel, while you are caught up in the fast-paced shooting and battles, with no time to read.  There's a ton of game modes, Deathmatch, Bombing Run, Double Domination, Assault, Team Deathmatch, Capture the Flag, Vehicle Capture the Flag, Onslaught, and many others.  Get the game, play against bots (start off on just below masterful, trust me. Just BELOW Masfterful), and have some fun. Instant action and campaign, once you find a decent community, play some online. Do NOT play sniper camping, zark (especially), or ballistic weapons mods exclusively (24/7, or primarily). Also do NOT play DM-Rankin all the time. SUPPORT the servers that don't suck balls and have ACTUAL map rotation!",
            "review_score": "1"
        },
        {
            "review_text": "Spoiler warning: Face 3 is the best.  10/10 still holds up",
            "review_score": "1"
        },
        {
            "review_text": "the good video-game for the fambly",
            "review_score": "1"
        },
        {
            "review_text": "Not worth it for Australian players - bought the game on sale for multiplayer after hearing about its popularity, most servers are dead and the ones that aren't have insanely high ping. Would be a good game if it wasn't dead in this part of the world.",
            "review_score": "1"
        },
        {
            "review_text": "Holy Throwback!!!! i love this game so much and im super glad i could get my hands on it again. once again another brilliant classic that steam has aloowed for purchase",
            "review_score": "1"
        },
        {
            "review_text": "Heck yes, not just for the gameplay, but ALL THE MODS, CHARACTERS, MAPS, AND VOICE PACKS you can get for it!!! I've been playing and modding this since 2006 and IT'S STILL going strong! 999999/10!",
            "review_score": "1"
        },
        {
            "review_text": "This game has 2004 times the Unreal™ fun™ as the original.",
            "review_score": "1"
        },
        {
            "review_text": " The  definitive arena shooter still reigns to this day. One can only hope that a new iteration or a new title will pick up where UT2004 left off, but more than a decade on, it still stands tall.  Hail to the king, baby.",
            "review_score": "1"
        },
        {
            "review_text": "Take everything that was great about the original Unreal Tournament, upgrade the graphics, throw in physics, and toss in lots of maps, game modes, weapons, and even vehicles, and you have Unreal Tournament 2004. It's one of the best multiplayer shooters around, even today, and the singleplayer is surprisingly challenging (the bots are competent and even as good as real players!). Not only that, but there's a plethora of great mods available for it. Well worth grabbing for any UT or online shooter fan.",
            "review_score": "1"
        },
        {
            "review_text": "I fully recomend everyone get this game, if you enjoy arcade shooters that is. The graphics are a bit dated sure, but the gameplay is amazing. It has a good variety of the weapons, and every gun seems to have a alt fire that compliments the gun nicely. Same with vehicles. It has a giant viaration of levels and gametypes, and you are free to download maps that other uses have made.",
            "review_score": "1"
        },
        {
            "review_text": "I DELETED ME ORIGINAL REVIEW BECAUSE IT MADE ME CRINGE SO ♥♥♥♥ YOU ♥♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER. Reminds me of my childhood and the amazing years experiences i had back then with this game. Its 2014 now, and you get more satisfied playing this game than playing a newer game. Just buy it. Its totally worth it!",
            "review_score": "1"
        },
        {
            "review_text": "The best unreal tournament game.  Get ballistic weapons.",
            "review_score": "1"
        },
        {
            "review_text": "Sadly very few players online, a shame, but that's not surprising due to its age. Still a good game for old times sake.   So Yes: But recommended only because you should have this in your steam library just to remind yourself now and again how far games have changed, both for better and worse, in the last decade. You won't get much multiplayer action from it these days.",
            "review_score": "1"
        },
        {
            "review_text": "Another Unreal game that, for its time, was understated yet an innovation in technology, graphics and perhaps gaming AI. In retrospect, after hours of gaming on my old laptop, is the sort of game that you'd end up playing in phases, rather than throwing to dust after so long. This introduced me to gaming, and is worthy of so much more than it has been given. The new options added on from UT2003 have been spectacular, but perhaps have damaged the first-person shooter theme of it with the introduction of vehicles. Its successor, UT3, has considered this point well, but nonetheless fails to uphold the options on this game, with team selection and game controls. Despite some minor loopholes that emerge, it would still not be deservingly praised with a 'Game of the Decade' title.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorite shooters, definitely worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "Another Unreal game that, for its time, was understated yet an innovation in technology, graphics and perhaps gaming AI. In retrospect, after hours of gaming on my old laptop, is the sort of game that you'd end up playing in phases, rather than throwing to dust after so long. This introduced me to gaming, and is worthy of so much more than it has been given. The new options added on from UT2003 have been spectacular, but perhaps have damaged the first-person shooter theme of it with the introduction of vehicles. Its successor, UT3, has considered this point well, but nonetheless fails to uphold the options on this game, with team selection and game controls. Despite some minor loopholes that emerge, it would still not be deservingly praised with a 'Game of the Decade' title.",
            "review_score": "1"
        },
        {
            "review_text": "After a decade, still the best shooter game ever!!!",
            "review_score": "1"
        },
        {
            "review_text": "I still remember in the days it takeing like 4+ hours to download and haveing like 6 disc's and how now it takes 5min to download on steam lol anywaay GREAT ♥♥♥♥ING GAME 1000/10.",
            "review_score": "1"
        },
        {
            "review_text": "You probably don't need me to tell you to play UT2004, but if you haven't played it you should really change that.",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played this game, what the f*ck are you doing with your life?",
            "review_score": "1"
        },
        {
            "review_text": "GET IT",
            "review_score": "1"
        },
        {
            "review_text": "Bought it on release date back in 2004 and still remember how great that time was, the game was made with passion by the veterans of EPIC games, you can feel this clearly after you join a random match.  By the night, for about 4-5 years i joined a mature server with the best people i ever met, we start with vCTF (Vehicle Capture the flag), then switching to TAM (Team Arena Master). I can tell you i was one of the worst players but the awesomeness of the entertainment made me feel the opposite!  The community was very creative with huge selection of custom maps and mods, also they invented new game mods like Trials (adventure like maps with various trials, long jumps, etc) one of the most relaxing fun social aspect of online gaming.   My rating:  Unreal Tournament 2004 &lt;&gt; My Favorite Game of all Time.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a shooter fan and don't want to play a game like this, you are lying to yourself.",
            "review_score": "1"
        },
        {
            "review_text": "This brings back so many memories... The first actual pc games i played were Unreal Tournament 2003 and Unreal Tournament 2004. These two games got me into pc gaming, not just because of the gratuidous violence or the simple way the game is laid out to you, it was the fact that they have almost endless replay value. Yea, the graphics dont look as good as they did back then but they were never developed for the extreme high definition displays we use today, But they still look amazing, especially since even if you have a lower end gaming rig, you can still play it with graphics maxed out.  The fact that Steam only has UT2004 and not UT2003 is a big letdown especially since they are missing a few other Unreal games, but with the supply of mods (if you know where to look and find them) adds even more fun, i didnt know about modding when i first played, so with the user created content floating out around the web...it basicly creates a whole new experiance . The Pro's Low end rigs should have little trouble if most of the hardware is from the last few years (i even tested it on my old compaq laptop that hated running games and got 30-50 fps on medium to high settings) Nearly unlimited replay value Multiplayer is still up//LAN//Dedicated server/hosted(pay-to-host)/listen servers(you host as you play) Tons of mod content ranging from skins, voice packs, maps, mutators, gamemodes and more. Includes unreal editor in game files so you can create content Custom Mappable Controls Setting to toggle gore for people with weak stomachs or children Plenty of weapons and vehicles for all the violent fun Singleplayer Voice Chat for those who know how to set it up Power-ups granting damage bonuses, invisibility, and more Play alone in instant action with bots and manipulate the ai difficulty ranging from a basic dummy ai that can get kills on you occasionally up to the God-Like ai that paints whatever is behind you with your blood (useful for practice) So much more that cant even be described  The Con's Often first time startup can be problematic with some higher resolution displays(simple fix by changing certain values in the games config, search google for fix) Mod content can sometimes be hard to find due to some file servers permanently archiving files or hard to understand install instructions Steam wont allow multiple instances of the game running (For example you open the game and set up a dedicated server, you cant open another instance of the game to play on your dedicated server unless you are smart enough to outsmart steam...hehe im not sharing my secrets..) Some resolutions dont always scale just right when using an HDTV as a monitor (lots of trial and error finding a resolution you are comfortable with)  Overall Unreal Tournament 2004 gets a 9 out of 10 *hops in scorpion, drives across map running down every enemy player/bot hops out to get in goliath, gets sniped . Respawns, grabs rocket launcher , Gets revenge*",
            "review_score": "1"
        },
        {
            "review_text": "More map, more guns, more game modes, more characters, and better mod support. UT 2004 is still the best of the Unreal Games.",
            "review_score": "1"
        },
        {
            "review_text": "I missed Xan from GOTY edition and this game helped me to meet with Xan.  10/10 would meet again with Xan.",
            "review_score": "1"
        },
        {
            "review_text": "In 2015, Unreal Tournament 2004 is one of the most depressing game of our time.  There's so much imagination and love and it makes you realize what's missing from a lot of games these days.  Overall, ♥♥♥♥ game. Not realistic enough and not enough movie scenes. needs more DLC. 3/10",
            "review_score": "1"
        },
        {
            "review_text": "Played hundreds of hours with this classic game back in time in RPG Invasion servers. Still enjoy them.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent throwback to the FPS genre of the early 2000s. An unforgotten classic that is till as lively as ever, including the good ol' gibs.",
            "review_score": "1"
        },
        {
            "review_text": "One of my avorite of all fps games! Awesome weapons and so many maps, modes, and vehicles.",
            "review_score": "1"
        },
        {
            "review_text": "This has always been one of my favorite games and even with all the new games coming out this still remains, in my opinion, the best shooter out there.",
            "review_score": "1"
        },
        {
            "review_text": "Classic FPS Goodness!!!!!!  Best game from 2004. Still loads of fun to play with friends over LAN or online.",
            "review_score": "1"
        },
        {
            "review_text": "This game is bonkers. One of the best, if not the best online shooter of all time. Praised by critics and players alike, in 2004 this was probably the best game made at that time. No wonder.  I personally recommend this as a good starting point in the franchise (unless you hate older stuff with passion, then you can grab UT3). It's VERY fast, VERY brutal and unforgiving, and it requires so practice to get good, but the end result is very much worth it. Pretty easy to learn but hard as hell to master.  Best multiplayer shooter ever. 10/10. (Also note that I have probably put over 600 hours into this over the years)",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, on a different account i have over 700 hours and i feel that they were well invested in a game with well designed graphics!",
            "review_score": "1"
        },
        {
            "review_text": "One of world's best FPS in the world, the single player mod is just hours of intense gameplay, understanding AI tecs, visiting numbers of great maps, and playing different unique game modes. And when you grow tired of the campain, go Multiplayer, more game modes, more weapons, more enemies to shoot.   In my opinion one of the best games in the world.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Good",
            "review_score": "1"
        },
        {
            "review_text": "Very intense fast paced fps. Honestly, I only bought it so I could play the old Killing Floor mod, but I enjoyed the game anyway. I felt a bit overwhelmed by the contents of the game, multiplayer is pretty active. Maps seemed well designed. Graphics are dated but fit. People seem to enjoy jumping over you and shooting you in the back of the head before you can react- pretty much what I meant by fast paced and intense.  Overall maybe an 8/10, havn't really given it enough of a run to be really accurate.",
            "review_score": "1"
        },
        {
            "review_text": "The yardstick by which all other arena shooters are to be measured. Say something bad about it (remembering that its an 11 year old game), I challange you. Its just simple twitch FPS gaming at its best. Every game mode is fun, every map is fun, and if you get bored, there are mutators. And mods. Dont forget the mods.   As a 35 year old, I find myself having trouble with bots 2 levels easier then I remember being able to beat with no difficulty. The muscle memory is still there, but man... the reflexes arnt what they used to be. Nothing brings me back like quad jump, low grav, zoom insta gib matches.   Controls are tight and fast, and every weapon on the roster feels like its got a use and a reason for being awesome. Well, except the flack cannon, because thats great for everything.   ",
            "review_score": "1"
        },
        {
            "review_text": "The pre-eminent multiplayer shooter. Not sure if anyone still plays it though. But they should. They should stop playing Hat Fortress Poo and play an actual game.",
            "review_score": "1"
        },
        {
            "review_text": "Unreal Tournament is the Ultimate in Arena competition. The music OST is amazing! FUN game play - So FAST, no dead pauses, no real cheats - except learning the maps well and being faster on the trigger than other players. I view UT:2004 as the absolute BEST team, capture the flag, and deathmatch game on STEAM. Absolutely the BEST game. Do remember to change your UT2004.ini file for 1080p (or whatever you like) in your STEAM, SteamApps,common,Unreal Tournament 2004, System folder.  FullscreenViewportX=1920 FullscreenViewportY=1080 Save the UT2004.ini file and restart the game again in Fullscreen and enjoy ! :-) So many beautiful nature and SciFi maps too ! ! !",
            "review_score": "1"
        },
        {
            "review_text": "I always thought UT2K4 was the best Unreal Tournament game, but now after getting good at UT99 I'm completely torn and can't decide. I do however think UT2K4 has the most bang for your buck, and feels more modern to new players than obviously the original, so if you want to start on an Unreal Tournament, start on this one and then work on getting Unreal Gold, Unreal Tournament, Unreal Tournament 3 and if you are still interested, Unreal II The Awakening in that order. UT2K4 is exactly the same (well, almost) as UT2K3 (not on Steam) but with tons more content so don't worry about getting UT2K3 although I do think Steam should put it up for $6.  The Unreal Tournament games and Unreal Gold have bots for multiplayer, and for all my hours playing each one on Steam, and then times those by three to make the hours I've played them on my CD copies, I haven't played ONE single match online against real people. The bots on this game are really, really good and playing with real people is unnecessary to have a good time. No one plays it anymore anyways so don't let that stop you. I still can't play on the hardest difficulty against bots because they kick my ♥♥♥, and not in an unfair way in which they have 100% aim or anything, these bots are still fair on the hardest difficulty, it's just that I suck.  Pros: +Gore and dismemberment is best in the series and is really rewarding +A lot of graphical, input and whatever options you want to make the game yours +Weapon arsenal uses classic Unreal weapons and is wonderful +Tons of gamemodes +Really nice server browser +Tons upon tons of maps +Addition of vehicles works really well +Physics are nice +New double jump and movement options are perfect +Assault is back! +Bunch of mutators to further mix things up such as Instagib +Endless replayability +A hilarious Australian set Assault mission including run overable kangaroos that feels like it was made by a bunch of 16 year olds +Great community +Bunch of unique characters to play as including aliens (Selig forever!) and ♥♥♥♥ed up Nightmare people +You can tell bots what to do but can completely ignore that feature +Awesome Battlefront style space battles  Cons: -Server browser filter options are annoying to use -Invasion is a ♥♥♥♥ gamemode, and so is mutant, although people disagree with me on Invasion -Graphics aren't as good as other Unreal Engine 2 games -Singleplayer campaign isn't as good as the previous ones (still fighting against bots) but I seem to be in the minority with this opinion -Ragdoll is ♥♥♥♥ for any enemy that's not an alien for some reason -Though bots are still fantastic, they can be annoying on team games -New Assault isn't anywhere near as good as UT99 Assault -Music isn't as good as UT99 but still decent enough +Like Unreal Tournament and Unreal Gold, this is as close to FPS perfection there is, there's almost nothing to complain about  Sound: 7/10 Graphics: 6/10 (it's obviously dated, but still doesn't look as good as other Unreal engine 2 games) Gameplay: 9.5/10 Content/Replayability: 10/10 Overall: 9.5/10  It's well worth the $15 and is truly an incredible game. Also support the 100% always to be free (NOT free to pay, I repeat, NOT free to play) Unreal Tournament on the sleek new Unreal Engine 4 on the Unreal Tournament wesbite. 4gb download.",
            "review_score": "1"
        },
        {
            "review_text": "This game is part nostalgia trip for me, part shooter training. Make no mistake, this is a no holds barred merciless arena shooter that will force you to play at a shooter level you didn't now you could achieve. The action is fast paced, the body count is high, and the respawn times are low. Back when this game came out I dumped hours into it. I can still do the same today. It really makes me want to get my friends together for a LAN party and trash talk each other in the same room.",
            "review_score": "1"
        },
        {
            "review_text": "S'cool but kinda dead.",
            "review_score": "1"
        },
        {
            "review_text": "Kickin it oldschool. Fast paced FPS. Still feels kinda up-to-date, even if it's more than 10 years ago.",
            "review_score": "1"
        },
        {
            "review_text": "Back in the days before I got into playing console games with controllers this was one of my favorite games. Now I have issues trying to game with a keyboard &amp; mouse lol &amp; I gave my friends grief about not being able to use them themselves for gaming. Guess that came back to me. Any way this is still an awesome FPS if anyone finds it interesting be sure &amp; get your copy! Its well worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Well, what makes UT2k4 unique from its obvious rival... -It was deathmatch, right? Not really, UT1 and Quake 3 were both perfect in their own ways, and the mechanics in UT2k4 are radically different from both. -...Okay... What about weapons? Close (Lightning Gun, Bio Rifle, Shock Rifle, Flak Cannon, Shield Gun) ...but no cigar (assault rifle, rocket launcher, grenade launcher, chaingun). -Map aesthetics/use of music/emphasis on environmental immersion over the thrill of blowing people up? ...That hit the nail on the head, but there is one more important thing. -Epic knew what made UT so great and learned from the blunder that was UT2k3 at the point where iD/Raven Soft was about to make the most fatal mistakes with Quake and DOOM? ...that took it way off topic... But I'll take it.  In all earnest, I'm a newcomer to the UT series, I started with UT3 on PS3 and then played UT4 on PC, but I really wanted to play UT2k4. It and UTGotY were like mythical beasts, you would hear about the fond memories gamers had when they experienced it... Only to realize that you were so late to the party and that age and circumstance have taken your ability to really, truly, fondly empathize with those tales. But you try to... And it sparks your desire to try to get into the artistic side of the game industry, if not the critical or narrative end...  Please, play this game, buy it on Steam, buy it from Amazon, dust it off from your collection. New or old. Maybe a lil' bot match to soothe the initial jitters, or dive into an Onslaught or CTF match online. I hope I muster the courage to eventually...",
            "review_score": "1"
        },
        {
            "review_text": " ISSSS THAT YOUR BESSSSST? ",
            "review_score": "1"
        },
        {
            "review_text": "This is what perfection looks like.",
            "review_score": "1"
        },
        {
            "review_text": "Great Classic.  Before long, you'll be zip-zoppin' through space and shootin' down jimmies.   Based on the Quake engine, UT2004 is a great survival horror game developed by the conjunction of iD Software and Valve. This inspired many great games such as Spore and Dayz. I'm proud to be an Unreal Tournament boy and look forward to playing the next Quake game in 2016. Thank you Gabe Newell, for this classic gem.",
            "review_score": "1"
        },
        {
            "review_text": "It's mainly a multiplayer first person shooter, but because it came out in 2004 the multiplayer community is unfortunately mostly dead.  There is a single player mode that consists of organized botmatches. You can form your own team of AI controlled bots and lead them to victory. Some of the maps have really inspired design and layout. For example there's one map where you're in a starfighter and you have to fight your way into a massive enemy mothership. Once inside you continue to progress on foot past numerous defenses. You finally make it to the enemy reactor core and blow it up, destroying the mothership. Awesome!  My main complaint about the bots is that there's very little variety in their behavior. Once you've figured out one bot you've figured out all of them. This hurts the replayability of the single player mode.  There's a huge variety of variant game types to keep things fresh. Everything from 'instagib' (one shot kills) deathmatches to classic Capture the Flag.   There's also an adrenaline 'booster' system; you earn or collect adrenaline points as you fight on a map. Once you reach 100 points you can use a special booster ability. Unfortunately how to use the booster system isn't well documented in the game, and many of the boosts aren't terribly useful. Also I found the boosts to be difficult to trigger at times, especially in the middle of an intense firefight, as you need to press a combination of keys in rapid succession.  The music is unobstrusive and nothing special. Graphics were probably cutting edge in 2004 but today they're just passable.  It's hard to recommend paying full price for a mainly multiplayer game with no multiplayer community. It might be worth getting on sale to play through the single player mode once, because as stated earlier some of the maps are really innovative.",
            "review_score": "-1"
        },
        {
            "review_text": "UT2004 Build UT2004_Build_[2005-11-23_16.22]  OS: Windows NT 6.2 (Build: 9200) CPU: GenuineIntel PentiumPro-class processor @ 3295 MHz with 2047MB RAM Video: NVIDIA GeForce GT 630 (7290)  LockRect failed: D3DERR_DEVICELOST  History: UD3DRenderDevice::ReadPixels &lt;- UD3DRenderDevice::Present &lt;- UGameEngine::Draw &lt;- UWindowsViewport::Repaint &lt;- UWindowsClient::Tick &lt;- ClientTick &lt;- UGameEngine::Tick &lt;- Level Untitled &lt;- UpdateWorld &lt;- MainLoop &lt;- FMallocWindows::Free &lt;- FMallocWindows::Realloc &lt;- 10910191 0 FArray &lt;- FArray::Realloc &lt;- 0*2 &lt;- FMallocWindows::Free this is what i get when i play 2004",
            "review_score": "-1"
        },
        {
            "review_text": "hitscan game. like shock rifle primary? you'll love ut2004! like weapon variety and balance? this game is not for you!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is sexy as ♥♥♥♥. With mods it gets better. Although most are dead, some still linger.  Best ♥♥♥♥ing game.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game all the time back in the day. I loved it. I will play again.",
            "review_score": "1"
        },
        {
            "review_text": "May or May not be the best update to UT99 in terms of gamplay, but UT2004 is a nice platform to work from on modern machines for modding.",
            "review_score": "1"
        },
        {
            "review_text": "11 years and yet I still remember playing all the assaults and having the most fun ever. I remember spending hours playing this game as a kid and even the time I got my first godlike just shutting out bots in this fight to destroy a generator.... man good times. 11/10 would recommend for the epic memories and the greatness this game brought to me in my childhood, and for the continued fun this game still brings.",
            "review_score": "1"
        },
        {
            "review_text": "Unreal Tournament 2004 is exactly like every other ♥♥♥♥ing UT to ever come from Epics ♥♥♥♥♥♥ ♥♥♥♥. They're all half arsed tech demos. It's no suprise since they all sit around masturbating furiously to gay porn",
            "review_score": "1"
        },
        {
            "review_text": "We used to play the ♥♥♥♥ out of this game when we were 11-12. We were all in the computer lab playing on LAN, ♥♥♥♥ was cray. That and Warcraft 3 but we all sucked at it since we were dumb kids. Amazing shooter, I wish more people would get it so I could feel some of dat sweet sweet nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "Not even close to it's ancestor, but hey, who cares? You can still fill your enemy with lots of plumbum, serve with caviar and make fun of his disability. Hell yeah.",
            "review_score": "1"
        },
        {
            "review_text": "UT2k4 is a masterpiece ever created by Epic Games. A good rival to Quake III Arena.  Kutar's [Hardcore Gamer] Choice.  ",
            "review_score": "1"
        },
        {
            "review_text": "I've owned this game in two forms, physical disc via the Unreal Collection (Unreal, Unreal 2, UT99 and UT2k4) and via Steam now as the Editor's Choice edition. I would get UT3 but I don't like its aesthetic and I don't like how it STILL doesn't have the same amount of mods and custom models as UT2k4.  As a result, I still have UT2k4 and I'm not giving it up. UT2K4 has all the mods I liked of UT99 and has even more custom skins and models that people have made that look great. I mean hell I can play as an adorable fox girl in UT2K4. I can't do that in UT99 or UT3, and until UT4 comes out I can't play that as anything but Stock Male #3 which is DULLLLLL.  So yeah. I'm still playing this because I can play Junkwar or Ballistic Weapons or have a ninja rope or play as a cute fox girl with huge guns (I do mean guns, not boobs; don't be ridiculous, you are not 12 years old. unless you are. in which case do your parents know what you are doing??), or I can do all of those at the same time.  And you know what? The game still looks remarkably pretty too even 10+ years in the future. That's the strength of the Unreal engine for you.",
            "review_score": "1"
        },
        {
            "review_text": "literally the best game of the early 2000s excluding battlefield",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "very fun game i love it but holy crap it breaks on windows 10 ",
            "review_score": "1"
        },
        {
            "review_text": "My favorite multiplayer game of all time i return to play some matches many years later a must have",
            "review_score": "1"
        },
        {
            "review_text": "when i start the page every time a small window pops up showing this 'UT2004 Build UT2004_Build_[2005-11-23_16.22]  OS: Windows NT 6.2 (Build: 9200) CPU: AuthenticAMD Unknown processor @ 3294 MHz with 2047MB RAM Video: AMD Radeon(TM) R7 Graphics (32832)  LockRect failed: D3DERR_DEVICELOST  History: UD3DRenderDevice::ReadPixels &lt;- UD3DRenderDevice::Present &lt;- UGameEngine::Draw &lt;- UWindowsViewport::Repaint &lt;- UWindowsClient::Tick &lt;- ClientTick &lt;- UGameEngine::Tick &lt;- Level Untitled &lt;- UpdateWorld &lt;- MainLoop &lt;- FMallocWindows::Free &lt;- FMallocWindows::Realloc &lt;- 10910191 0 FArray &lt;- FArray::Realloc &lt;- 0*2 &lt;- FMallocWindows::Free (I REAALLY WANNA PLAY CAN YOU HELP AND TELL ME WHATS WRONG??????",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Better than any UT3 and UT16  ",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing this game since 2003, so it must be pretty decent! I think I have purchased it at least 3 times, lost the discs twice and now on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "The best Unreal Tournament in my opinion. It's way better than the latest unreal tournament and the gameplay still holds up after all these years.",
            "review_score": "1"
        },
        {
            "review_text": "The Unreal Tournament games are some of the best arena FPS games I've ever played. Unreal Tournament 2004 takes the cake, having more playable characters than Classic Unreal Tournament. The game has multiple new game modes than Classic, and sitll maintains that nostalgic Unreal feel (See what I did there????). I definitely recommend getting the Unreal Tournament bundle pack if it's still on steam.",
            "review_score": "1"
        },
        {
            "review_text": "any lan isnt complete without this classic",
            "review_score": "1"
        },
        {
            "review_text": "Game your not going to play for singleplayer! Every competitive fps gamer must have! 9/10 just because takes alot practise to jump in :)",
            "review_score": "1"
        },
        {
            "review_text": "If this game still had people playing in Australia I wouldn't have a reason to buy any new FPS games.",
            "review_score": "1"
        },
        {
            "review_text": "Why yes, I would like to recommend this amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "This game has aged well, plays great, and contains plenty of content to keep you going. The vehicle combat as well as the soldier to soldier fighting feels visceral and intense, plus tele-fragging people is awesome :D.",
            "review_score": "1"
        },
        {
            "review_text": "The last good unrealtournement. no story, just mindles blood and guts gore till your eyes bleed.",
            "review_score": "1"
        },
        {
            "review_text": "it's a classic ut with well-looking graphics (this days) and tons of available maps to play. I spend a lot of time playing UT-2004 when i was a bit yonger))) I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down, the best version of Unreal Tournament to date. And yes, I am aware that UT3 came out.",
            "review_score": "1"
        },
        {
            "review_text": "The first game I ever bought and played it with the first graphics I ever installed myself. It's still one of my favorites.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like none other. It is a FPS shooter. Not going to run the plot. Many types of weapons and if you love powerful weapons and cars this be the game. May be old, but i will never stop playing this game. This game is the one that will never get old. Hours upon hours of entertainment.   As a bonus it works great on slow computers.  15/10",
            "review_score": "1"
        },
        {
            "review_text": "Yes. Yes. Yes and Yes.",
            "review_score": "1"
        },
        {
            "review_text": "I've had to install this from its bloated CD-ROM release so many times that being able to just download it kind of feels like cheating. One of the finest shooters ever made, in my opinion. Even the vehicles are spot-on, managing to feel both fun to drive and easy to score kills.",
            "review_score": "1"
        },
        {
            "review_text": "Best Unreal Tournament game I have ever played. And I mean  EVER ",
            "review_score": "1"
        },
        {
            "review_text": "This game was released in the golden age of cybersport FPS shooters, and is its rightfully masterpiece. The game mechanics, the level design, overall graghics and sound are trully a piece of art. It still looks rather nice in 2015. I definitly recomend to give it a shot!",
            "review_score": "1"
        },
        {
            "review_text": "Like cars. Only its the only one.",
            "review_score": "1"
        },
        {
            "review_text": "The old classic. Fast paced, bloody, action packed. What's not to like? Most servers now run the 'Ballistic Weapons' mod, which add tons of weapons, and some slightly different gameplay. A great experience. If you want to hop in, kill people for no reason other than pure satisfaction. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Onslaught Mode Can't be beat! And it offers all the deathmatch goodness from back in the day!",
            "review_score": "1"
        },
        {
            "review_text": "gold standard for mid 2000s multiplayer twitchyness. Extremely flexible, runs well on most any computer now, graphics aren't top but have aged pretty well.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not exactly a fan of this iteration of the UT series, but there's one thing that I wish the upcoming new one could also have: team management in the Tournament campaign.  It's like a career mode in FIFA or something, but instead of playing football and managing a football team, you play UT. Buying/selling arena fighters, each with their own attributes and weapon preferences and then playing with the is the most fun this game offers. They can get injuries as well, which you need to treat, or else they remain on the bench. You can assign them positions on the field as well (cover you, defend/attack base, sweep etc.)  It's an amazing idea and very well suited for a game like UT. I hope this idea will be taken to the next level.",
            "review_score": "1"
        },
        {
            "review_text": "Though I was pretty much into shooters from the moment they started (Wolfenstein and Doom) Unreal Tournament 2004 solidified my love for shooters. This is one of the last stands of the classic arena based shooter. And thanks to the community you can enjoy thousands of custom characters, maps, game modes, vehicles, and weapons. No prestige grind, no rank ups, just pure unrealistic action in one of the greatest shooters of all time. If you enjoy Team Fortress 2, you owe it to yourself to at least give this classic a try.",
            "review_score": "1"
        },
        {
            "review_text": "Its such an epic game and to prove it the following games were turned into games but were originaly and still are mods for this:  Alien Swarm Red Orchestra:ostfront Killing Floor  I highly recommend this game!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Not compatible with windows 10 :(  but i still recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Wicked Sick! M-m-m-monster Kill-kill-kill, Holy ♥♥♥♥!  This could be us, but you be playin'.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, probably the ego shooter where I spent the most hours with!",
            "review_score": "1"
        },
        {
            "review_text": "The one that is considered the black sheep, most people preffer the classic torunament instead of this one!",
            "review_score": "1"
        },
        {
            "review_text": "Best UT game ever. I love the bright graphics. The weapons are well balanced. This is one of my favorite games on LAN.",
            "review_score": "1"
        },
        {
            "review_text": "This - Game That I Once Bought - Without Steam and NOW WITH STEAM  IS A SERENE VERSION OF QUAKE  Yet Also - A Wide Variety of First Person Shooter Modes  Such as Capture the Flag / Team Death Match / Bombing Run / Onslaught  AN UNREAL ENVIRONMENT OF MAPS GET GET IT NOW  The Guns are Sublime in Realistic Futurism",
            "review_score": "1"
        },
        {
            "review_text": "Just as good as you remember it 12 years ago.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a time-tested classic. It has all the feels of the original UT, but with some major improvements, lore elements, and new teams/themes.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest games ever made, if you count out half life. The capture the flag map in the space is to great to be true! A must have nostaligia game for everyone who had a shildhood around the 90's. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "BEST Fast FPS of my childhood :D I still play it today",
            "review_score": "1"
        },
        {
            "review_text": "a blast from the past",
            "review_score": "1"
        },
        {
            "review_text": "Put hundreds of hours in this game when it first came out 10 years ago, just booted it back up today and its just as amazing as I remember.  If you want a great looking, smooth arena shooter with a decent enough campaign and just pure fun, look no further.  Everything holds up brilliantly even now, the graphics, the gameplay, the music.  A true classic.",
            "review_score": "1"
        }
    ]
}