{
    "app_id": 13580,
    "name": "Tom Clancy's Splinter Cell Double Agent®",
    "release_date": "2009-02-13",
    "developer": [
        "Ubisoft Montreal"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Stealth",
        "Action",
        "Third Person"
    ],
    "achievements": 0,
    "positive_ratings": 356,
    "negative_ratings": 454,
    "price": 8.59,
    "description": "The best-selling Tom Clancy's Splinter Cell® saga takes on an entirely new direction. In the highly anticipated sequel to the 2005 game of the year, Tom Clancy's Splinter Cell Double Agent™, play as a double agent spy for the first time ever.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/13580/header.jpg?t=1541779978",
    "minimum_requirements": "Supported OS: Microsoft Windows® XP Processor: 3 Ghz Pentium 4 or AMD Athlon 3000 (3.5 Ghz Pentium 4 or Athlon 3500 recommended) - Game optimized for dual-processor-enabled computers.  System Memory: 1 GB or above (1.5 GB recommended)  Video Card: DirectX 9.0c-compliant, Shader 3.0-enabled 128 MB video card (256 MB recommended) (see supported list*)  Sound Card: DirectX 9.0c-compatible (EAX recommended) - PC audio solution containing Dolby Digital Live required for Dolby Digital audio.  DirectX Version: DirectX® version 9.0c or higher Hard Disk: 8 GB available hard disk space Multiplay: Broadband connection with 128 kbps upstream or faster  *Supported video cards at time of retail release: Single Player:  ATI X1300 / X1600 / X1800 / X1900, NVIDIA 6200 / 6600 / 6800 / 7300 / 7600 / 7800 / 7900  | Multiplayer: ATI X1600 / X1800 / X1900, NVIDIA 6600 / 6800 /7300 / 7600 / 7800 / 7900 Note:Laptop versions of these cards may work but are NOT supported. These chipsets are the only ones that will run this game. For the most up-to-date minimum requirement listings, please visit the FAQ for this game on our support website at: <a href=\"https://steamcommunity.com/linkfilter/?url=http://support.ubi.com\" target=\"_blank\" rel=\"noopener\"  >http://support.ubi.com.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "[4/10]  As much as I'd love to finish this game, I don't think it will even let me. The game crashes almost every mission for no reason, quick saves will randomly decide to not load, the entire game just freezes during certain loading screens. Also, the game looks awful compared to previous games in the Splinter Cell franchise, which is odd, considering Chaos Theory was absolutely gorgeous for its time, and still holds up to this day. Sometimes shadows won't even render when the level loads, making the whole stealth mechanic extremely awkward. Being a huge fan of Splinter Cell, it's really unfortunate that this game is unstable, to the point of freezing my computer. I could only recommend this game to hardcore fans of the Splinter Cell franchise. I will attempt to finish this game, and if it gets better, I will edit this review. Until then, this still stands.  [EDIT] So I've finished the game. The bugs and glitches are still present, no suprise there, but there was one specific bug that stood out amongst others: a game breaking bug. After completing the final mission, a cutscene is supposed to play, the credits should roll, and you are rewarded with a bonus mission. For me, and many others, this didn't happen. The mission would end, and then cut immediately to an overhead scene of the level where you are unable to move and unable to quit properly. (you have to enter the Task Manager and end it manually.) Aside from the awful technical issues, the gameplay and story are some of the best in the Splinter Cell series so far. It takes place shortly after the events of Chaos Theory, in which Sam must pose as a criminal and join a terrorist force in order to destroy them from the inside. The game has a 'trust meter,' in which you have to complete objectives for the JBA: the terrorist force, and the NSA: the good guys. Due to trust being a factor, the game forces you to enter in these moral gray areas just to keep the trust of the enemy. While in the base, you have the option to research and spy on your allies/enemies to learn more info about them. This information will assist you in traversing the base as well as unlock special items for your missions. As with all previous games in the franchise, it is all based on stealth and using gadgets as well as the enviornment to your advantage to accomplish your objectives. If you've played a SC game in the past, you know what you're getting yourself into from a gameplay perspective.   Summary: Splinter Cell: Double Agent is a fantastic game form a gameplay and story perspecrive, but it is hindered by so many techinical issues that it is not worth the purchase, at least not on the PC. I have heard that the concole version is much better, so if you would like to play this game, play it on the Xbox, PS2, or PS3.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice otherwise (after ini-file edit to enable better graphics), but loading the save games didn't work for me at all. And this game crashes alot, so frustation level can be high especially when the save games won't work and you have to start beginning of the mission sometimes.  I also heard that the best version was only for PS2/Gamecube/Xbox. So if you happen to own one of those systems, might be better option to pick that up instead of this.  Oh, and if you run into a bug before the credits roll, change the game resolution to lower like 1024x768 and the ending will trigger.",
            "review_score": "1"
        },
        {
            "review_text": "Besides being a terrible PC port with crashes, glitches, long loading times, bad performance and requiring you to actually manually download a patch, this game feels very incomplete (it's the 360 version after all) leaving many plot and character development holes, a morality system that barely does anything, and a terrible ending which is just audio over the credits. It's a very unsatisfying game. If you really want to play Double Agent, get the PS2/Xbox/Gamecube version, which was made by the Chaos Theory devs and it actually feels complete. Also you never get dubs in this game. Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "I like the Splinter Cell series, but I didn't even finish this one because it was so clunky and I didn't find it anywhere near as good as Chaos Theory.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't work.  Installed it, tried to turn it on, went black, glitched for a second, went back to the Desktop. That's the only thing it will do. Good thing I got it on sale.  Get it together, Ubisoft.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the wrong version. The screenshots and trailer advertise that it is the same as the Xbox Original version. However once you buy this game you are quickly hit with disappointment as you realize this is the Xbox 360 version. These screenshots and the trailer are false advertising as the PC version of this game is not what they suggest. Very disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "6 out of 10  This is the 4th episode in the Splinter Cell series. You play as Sam Fisher, an operative in 3rd Echelon a top secret NSA black-op outfit. Its all about stealth, not so much on killing.  If you haven't played any Splinter Cell game yet, what? Where have you been. These are great games. However, you should not start with SC Double Agent.  This game is for SC veterans who want to do it all. I started on this game three times. Only the last time did I bite the bullet and stuck through. Unfortunately compared to the previous SC games this one is slightly disappointing.   The good:  1. Decent stealth based action. Shooting is not what its about and the shooting system has never been a strong point in any SC game - it is very static.   The bad:  2. Where is the luminosity meter? Knowing when shadows are enough to cover you is a guessing game.  3. The choices you make have no discernable impact on the game. Only the cut-scenes.  4. What is the story all about? Some people want to blow up the USA, but why?  5. The characters are as thin as wet paper. Sam's daughter is killed off at the start, why?  6. You unlock lots of equipment. When do you actually get to use it?   The ugly:  7. Horrible stability issues. My game crashed about five times per mission.  8. Character model getting stuck in the scenery.   Dam, in retrospect there where not many good points. Thank goodness the game is relatively short.",
            "review_score": "1"
        },
        {
            "review_text": "Not going to bother with trying to make it work anymore. But the video walkthrough I watched instead looked like fun!",
            "review_score": "1"
        },
        {
            "review_text": "Not quite as good as the version for Playstation 2 and the original xbox but still one of my 2 favourite games of the series. however the sreen shots above are mostly from the PS2 and Xbox versions which is considerably different to this version",
            "review_score": "1"
        },
        {
            "review_text": "Just stay away from it, at least this version. It crashes constantly. The gameplay just isn't what it used to be on Chaos Theory: half of it is clearly console-made poorly adapted for PC, and the other half just make no sense no matter the device. I stopped after 2 missions and many crashes.",
            "review_score": "-1"
        },
        {
            "review_text": "Good Splinter Cell game but... as usual made by Ubisoft, so very poor tech support: buggy, crashes, patches are not on steam, settings don't work properly.",
            "review_score": "-1"
        },
        {
            "review_text": " General Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Strangely compelling.",
            "review_score": "1"
        },
        {
            "review_text": "Otherwise I like Splinter Cell series, I played all the way to Double Agent, but the PC version is quite bad on the technical side. There are a lot of bugs that have bothered me (problems with shadows and lighting, problems with saving, problems with the gadgets, the occasional crashes...). On the other hand, the story is quite good, and there's everything else that makes Splinter Cell series good. When working properly the game is good and fun, and if you can overlook mentioned shortcomings, it is worth to play. My rating 6.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Another solid Splinter Cell game like Chaos Theory. Highly recommended. Great game overall nothing bad to say about it.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the worst PC port I have ever encountered. Stay away!",
            "review_score": "-1"
        },
        {
            "review_text": "Choices, choices, choices...  Sound and visibility meter are replaced with a red-green-yellow light meter. Other than that it ain't too bad, just feels a little different.",
            "review_score": "1"
        },
        {
            "review_text": "Chaos Theory was the pinnacle of the series, this one had the best level designs and best mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Get Chaos Theory instead. The PC port here is just the worst in the entire Splinter Cell franchise, I encountered tons of crashes during 4 hours of play time, and now, my save file has gotten wiped randomly, just don't even bother with this version, save yourself the trouble and just play Chaos Theory again.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is plagued with problems, it crashes on start up, and even if you manage to get it to run, the sound will not play for most. Online is no longer supported, there are no bug fixes in the future.  Please do not waste your money on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "its a great game if you have a 4:3 monitor",
            "review_score": "-1"
        },
        {
            "review_text": "This game is piece of s%#t, avoid it at all cost.",
            "review_score": "-1"
        },
        {
            "review_text": "I would say this game has a great story, but the bugs mixed with the amount of time's the game crash's is unbearable. ex. got through a mission part that was extreamly hard then it crash's. Try again, it crashs (repeat x5), it crashed every time with emphasis on (every time). I can endor alot from games stress level i mean, but when a game crash's that much on a very hard mission im tempted to wright tons of hate mail describing my upmost discust.....  F*** it if you want a game that will crash evey time you save, walk 2 feet, or shoot with a great story buy this.",
            "review_score": "-1"
        },
        {
            "review_text": "This is xbox 360 version. ( steam's introducing screenshot is xbox original/ps2 version)  and can't play with joypad ( ex. xbox 360 controller)",
            "review_score": "1"
        },
        {
            "review_text": "The worst optimuzed SC game which I happen to playthrough on every platform. Still good SC game - just laggy.",
            "review_score": "1"
        },
        {
            "review_text": "Heyyo, a decent entry in the Splinter Cell series.. but Chaos Theory is still my favorite.",
            "review_score": "1"
        },
        {
            "review_text": "I have the Steam and retail versions. This game is not playable on modern systems. The Shanghai mission is a stopper. The only way to proceed is downloading game saves. It's sad since this is one of my favorite SC games. This game should be removed from the store unless Steam likes giving refunds.",
            "review_score": "-1"
        },
        {
            "review_text": "I tough this was game i played in x-box around 2010 But i was wrong,maybe this is a great game on in age But for now i didnt recommended this game",
            "review_score": "-1"
        },
        {
            "review_text": "What an atrocious game. The developers who ported this game to PC should've ported the PS2 version which followed the game formula of Chaos Theory.",
            "review_score": "-1"
        }
    ]
}