{
    "app_id": 15100,
    "name": "Assassin's Creed™: Director's Cut Edition",
    "release_date": "2008-04-09",
    "developer": [
        "Ubisoft Montreal"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 5743,
    "negative_ratings": 1162,
    "price": 8.59,
    "description": "Assassin's Creed™ is the next-gen game developed by Ubisoft Montreal that redefines the action genre. While other games claim to be next-gen with impressive graphics and physics, Assassin's Creed merges technology, game design, theme and emotions into a world where you instigate chaos and become a vulnerable, yet powerful, agent of...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/15100/header.jpg?t=1532007211",
    "minimum_requirements": "Supported OS: Windows® XP/Windows Vista® (only) Processor: Dual core processor 2.6 GHz Intel® Pentium® D or AMD Athlon™ 64 X2 3800+ (Intel Core® 2 Duo 2.2 GHz or AMD Athlon 64 X2 4400+ or better recommended) System Memory: Windows XP: 1 GB RAM / Windows Vista: 2 GB RAM Video Card: 256 MB DirectX® 10.0-compliant video card or DirectX 9.0-compliant card with Shader Model 3.0 or higher (*see supported list) Sound Card: DirectX 9.0 or 10.0-compliant sound card (5.1 sound card recommended) DirectX Version: Direct X 9.0 (Windows XP) or 10.0 (Windows Vista) libraries  Hard Disk: 8 GB available hard disk space Supported Peripherals: Keyboard, mouse, optional controller (Xbox 360® Controller for Windows recommended) *Supported video cards at time of release: ATI® RADEON® X1600** /1650**- 1950/  HD 2000/3000 series, NVIDIA GeForce® 6800**/7/8/9 series.  **PCI Express only supported. Laptop versions of these cards may work but are NOT supported. These chipsets are the only ones that will run this game. For the most up-to-date requirements, please visit the FAQ for this game at: <a href=\"https://steamcommunity.com/linkfilter/?url=http://support.ubi.com\" target=\"_blank\" rel=\"noopener\"  >http://support.ubi.com.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Assassin's Creed came out in 2007 and here I am 7 years later playing this game for the first time.  I must say that I have purchased it during the sale but I can tell you right now that its worth the full price. Not to mention it's only like $10 anyway!   So what's so fun about it you might ask. Let me tell you. After you finally start running around and killing the enemies the game becomes fun! I have once spent 80% the mission just hunting the guards and doing all the other random things. For me, the selling part of this game is running around and jumping on the rooftops.   Controls. I understand that this game was ported from a console so controls for PC only users will be funny. I didn't not try to reset them because they are still well put. But, its not your normal WASD + ctrl and space. You will just have to get used to that.   While playing this game you don't often notice the sound effects and the music, but I can tell that it plays its part in delivering the whole picture very well. Its nothing impressive, but what is important that it does not spoil the experience and only enchants it. Although I have not tried, but I can see myself actually playing some other music while running around the city.   The very first time I ran this game was actually in 2007. The computer I was running it on couldn't even handle it. That is partially the reason why I only came back to the game now. At the time of release the graphics very amazing. The foggy city environment impressed me in particular. The models of characters are very well made as well, buildings are quite detailed. Nothing really to complain about as 7 years later it still looks good.   You might say, what an unfair review, where are the negative things? Well they are here as per any game. For example I don't quite like how character moves sometimes and how he cant do certain jumps and things. But its all negligible I think. Oh, and once I flew from my horse really high. The worst thing is that it only saves your game when you have completed something which can be quite an annoyance.   The story is not all there is to do. You can actually explore the cities to find some random flags. I am not too sure what they going to give you at the end, but there's quite a number of them to be found and they also might be in places where you wont be able to reach from the first time. So a few more challenges. Oh and I almost forgot to mention the Templars. They are very hard to deal with, but there are always ways to abuse the system( find out for yourself).   Re-playability is low in my opinion, because once you finish this game you can get the next one and then the next one and so on. You will be playing the same game but with the different filling inside.   So in overall, I think the developers made a externally good game( which evolved into a big sequence of games). I would recommend this game to pretty much anybody.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game in 2008 as Christmas present... As a small boy I played this game hours and hours.. Best memories &lt;3 :)",
            "review_score": "1"
        },
        {
            "review_text": "First game in the Assassin's Creed series and well worth playing even if you've already played the later ones.   You need to assassinate certain targets. First, you need to gather information about your surroundings. Then, you need to gather information about your assassination target. Once you have gathered enough information, you can go and assassinate your target (how you do that is up to you and the information you gathered).  You can also explore the wonderful big cities and interact with many guards and civilians.",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't require Uplay 10/10",
            "review_score": "1"
        },
        {
            "review_text": " Assassin's Creed: Director's Cut Edition",
            "review_score": "1"
        },
        {
            "review_text": "Very good game but it is sometimes very boring beacause you almost always repeat the way to get information in the game!",
            "review_score": "1"
        },
        {
            "review_text": "The first game in the Assassin's Creed series is the game you should either start the series with, or go into with lower expectations. That's not to say this game is bad, it's just one that has sequals which far exceed the original.  Advertising itself as a 'next-gen' (beginning of Xbox 360/PS3 era) game, in retrospect this game definitely looks (emphasis on the 'looks') that way. Set in the 12th century during the Third Crusade, AC1 tells the tale of an underground battle between two opposing factions that has gone on since the begginnings of our species, and you play as Altair, a member of the Assassin Order. The plot is not the most exciting part of the game, but the ideas about human nature were enough to keep me interested into it to a certain extent. The characters are forgetable, besides our protagonist. Altair is a rather brash Assassin who fails a mission in the opening act of the game, and this game details his journey to get back to his previous rank within the Assassin Order. Besides the out of place American accent (ugh), Altair is a rather badass and interesting protagonist who keeps the plot afloat.  On the other hand, the world which the game is sent in is rich and engrossing. The graphical quality greatly reflects the world of the Crusade, and cities are full of NPC's which go about on their day. The sheer size of the maps will surely impress if this is your first AC game. Immersion is also something this game nails on the head, despite its numerous flaws. The soundtrack may not be entirely memorable, but it nonetheless fits the game extremly well. Voice work (minus Altair) is definitely of a high quality and fits in as well. However, do not look to this game as a history lesson that is 1:1 with reality. This game does take history and makes it fit into a video game, and isn't entirely accurate (which the game acknowledges).   This goes into a part of the game that is really up to opinion when it comes to the story: You're actually reliving the memories Altair, who is the ancestor of our true protagonist Desmond. Here you meet Lucy and Videc, one of which is a rather bland assistant character, while the other is an evil scientist. While these characters came across as rather boring to me, Desmond's character really makes them seem like works out of Shakespear. Desmond is an EXTREMLY bland character, and one that I honestly didn't care about. The game pulls your out of the Animus (the device used to relive memories) after every chapter, and these segmants are real pacebrakers, despite some interesting conversations between Desmond and Videc here and there.   Another issue I have withe the games story is how abrupt the ending is, and a plotpoint that comes up near the end of the game without explanation and just feels like it's there to break immersion and be picked up later on. While I wont go into details, the game definitely makes it feel as if it NEEDS to have a sequal, whether you as the player likes it or not.  While it may seem as if I hate this game, I must say I actually did have an enjoyable experience with the gameplay. Sure, the game is repititive with the same objective structure being true for 85% or so of the game: Complete 3 missions, and assassinite your target. While this may definitely be a problem for some, the gameplay does work quite well to break this problem apart.  A staple of Assassins Creed is its parkour and stealth mechanics, and both are present and enjoyable to do here. Soaring across the games three cities is enjoyable, and stealth can be very rewarding in the game as it is quite difficult to pull off compared to the sequals. Combat is also very rich, and has many sides to it (even though it becomes pathetically easy with counters). You can dodge, block, grab, and slash at your opponents with various tools at your disposal: a sword, a shortsword, throwing knives, and the iconic hidden blade (and also your fists, of course).   The objectives your are required to complete before assassinations are quite repepitive however, and may be something you may not enjoy. I personally found informer challaneges to be very tricky, while pickpockets and interrogations were far too easy. And eavesdropping is... well... sitting on a bench, and that's that. Assassinations are, however, very enjoyable and can be done in a variety of manners, and are followed by extremly intense escpae sequences that will keep you on your toes.  While there are some optional activities (saving civilians, collect-a-thons, and scaling every viewpoint), the game doesn't offer too much else. and is purely an action adventure game rather than an RPG (like its sequals). This is why Assassin's Creed is honestly a game that doesn't have too much replay value, even though the adventure is about 15 hours and is overall enjoyable, if not repitive for 85% of the journey and telling of a story that isn't too memorbale, despite the immersive world presented. $20 may be a bit too much for how shallow AC1 is (and considering you can buy the more polished sequals for the same price), and if you're curious I would advice that you wait for this to go on sale and to have an open mind. However, the game should keep you entertained enough to be interested in AC2, which is definitely a GOOD thing.  Overall, AC1 is a decent first game into the AC franchise, and one you should approach with some caution, and avoid if you've played the other AC games (unless you're extremly curious). I would give this game an overall 7/10, however if I had to take replayability into account it's definitely a 6/10.",
            "review_score": "1"
        },
        {
            "review_text": " Introduction:",
            "review_score": "1"
        },
        {
            "review_text": "It's  incredible . Storyline - incredible. Cutscenes - incredible. Interactivity - incredible. Gameplay - incredible. One of the best creations of humanity.  Once and for all .",
            "review_score": "1"
        },
        {
            "review_text": "Kind of like the first Mass Effect, it's not the best in the series, and it has aged, but still a solid game. Story is rough in certain parts. Even so, the gameplay is so fun it's a testament to its power as a series.",
            "review_score": "1"
        },
        {
            "review_text": "This game runs pretty well, it's noticeably dated to me with things popping in and such but I'm sure we can all make allowances for that with the age of the game.  If you, like me really want to be playing with keyboard and mouse, and not resorting to a controller, I urge to you take caution over the titles after this one as the camera will drive you mad. They all seem to share some sort of mouse acceleration issue that will make moving the camera with the mouse unplesant and annoying at best.   This one does not share those issues, has a fantastic story and the only flaw is the gameplay can be a bit repetitive - certainly a classic regardless of this though!",
            "review_score": "1"
        },
        {
            "review_text": "Bought it on summer sale. The only time I played it before was when it came out, so I really forgot how fun and enjoyable this game is. The only problem I had was with crashes. The game crashed like 10 times in total of playing it. But aside from that, highly enjoyable game with well developed characters, interesting plot, and beautiful landscapes. Best part, though, no uplay.",
            "review_score": "1"
        },
        {
            "review_text": "*hops across beams with perfect balance*  Bystander: He must be drunk! --------------------------------------------------  Pros----------  -3 Cities and a huge open world to explore -Lots of collectibles for completionists -Investigations before each assassination that enrich the story -Very, very good graphics for it's age (2007) -Parkour -Badass animations for kill moves -Time period of the 3rd crusade is great -All targets are real historical figures who actually existed -Rich storyline and lore behind all AC games  Cons----------  -Eagle Vision can give me a headache sometimes, unlike the other AC's -Sound is outdated and voice acting can be dry, however it is understandable for it's age and also, being the first in the series they propably didn't have the most flexible budget for the game.  ---------------------------  Overall the game deserves a re-mastery in my opinion, Altair needs more love (Even if he is an arrogant prick in the beginning). If all you care about is the story, I would reccommend you read the book instead. But if you truly want to live the life of a murderous-parkourist in the 3rd crusade this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't reward exploration &amp; collectible gathering or give you alot of side missions, but still has decent content and good gameplay. Not as good as 2 but still alright.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best series I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "AC is the game that started it all, mixing some excellent open world action / parkour with an overarching story (and meta-story) that could easily be the screenplay for the next big sci-fi film. It also nailed the basic open world action gameplay mechanic of combining primary objectives with optional side quests (batman), climbing towers to make nearby objectives appear on the map (farcry 3), and fluid hand to hand skirmishes that become more complex as the game progresses (batman). AC nails these mechanics right out of the gate.  The meat of the game is exploration of the game world, set in the middle east some time during the crusades. There are 3 cities to explore, each with similar architecture but a distinctive feel. The player can only access a few sections of the city initially, and more become available as the story progresses. Being an assassin, the primary missions involve dealing death to some high profile victim in a specific city and section. Secondary objectives are a mix of 'protect the citizen', 'assasinate these minor dudes', pickpocketing, evesdropping, and parkouring challenges. There are also flags scattered around that you can pick up but there was little incentive to do so.  Story sections and major missions feature a brief cinematic that is rendered in the game world. Often you can switch to another camera position by clicking a button on the joystick. The cinematic then seamlessly returns control to the player.  There is also an overarching 'meta story' that is told from the perspective of a young man who is apparently a descendant of the assassin you are playing. There is a device called the 'Animus' that you lie opon... it then allows you to access and play out the memories from the past, and also influence (apparently) the original outcome. I won't reveal anything else about that... you will need to discover that for yourself.  All is not perfect though there are some annoyances: &gt; The gameplay is repetitive, with only minor variance as your level increases. The 'boss battles' tend to become more complex but the meat and potatoes are samey. &gt; The cities have some differences but honestly if you plopped me in one city and asked me to correctly identify it, it would be difficult. They don't feel different enough, adding to the samey-ness. &gt; The textures and character models are a bit crude. I would definitely recommend the hi res texture mod, which you can find on the steam forums. &gt; This game was designed with an XBOX controller in mind... you will NOT want to use a mouse. Not necessarily a huge annoyance but I for one prefer mouse and keyboard over joystick.  All in all I enjoyed the game immensely and would definitely recommend it. 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Games like this make me whis there was a neutral recommendation.  The game is good, make no mistake. But it is sooo repetative, you do the same thing over and over and over again.  However, I don't recommend skipping it. Bear with it and finish for the story.  Then jump to the masterpiece that is Assassin's Creed 2.",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed is a great example of a development studio taking a risk and having it pay off. With it's pioneering of the puppet control system for third person 'platformers' and the use of free-running (which later in 2009 spurred Mirror's Edge).   Assassin's Creed has a basic flow. You get a mission in one of five regions, you arrive, you do all the pre-requisite 'open world' missions to prepare (such as surveying the area from a perch and stealing valuable information that you can use to better approach the target), then you start the actual assassination.  While others seemed to get annoyed with the preperation phase, I didn't mind it so much as it helped push the sense of how preparation was key for things like this, though some variety wouldn't have hurt.  While Assassin's Creed requires a dual-core procesessor, it does perform quite well on anything that meets the minimum requirements. Unlike most console ports, the frames are smooth and the details are much better.",
            "review_score": "1"
        },
        {
            "review_text": "First assassins creed game , which you are the templar hunter Altair , from Syria Damascus . the game has some bugs and glitches not that i can say that much , cuz its the first version , although the graphics are really good, combat is awsome as always . the storyline is ok though , but you have to fight your way into templar territory &lt; from the crusades era&gt;  Recommend ? Ofcourse",
            "review_score": "1"
        },
        {
            "review_text": "It all began here.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game. No sequel is better! Loved the story and easy to use controls. It has a lot of play time if you do all the side quests as well as the main campaign.",
            "review_score": "1"
        },
        {
            "review_text": "~",
            "review_score": "1"
        },
        {
            "review_text": "The game is one of the must-have classics obviously. With so far over 10 hours playing, no big flaws were detected but Only one thing. I sometimes land on a Rock-like piece of hay and die when hay-diving from the tower-sight-seeings. Then I have to climb all the way down... And special thanks to the auto-saves that I don't have to climb up again.",
            "review_score": "1"
        },
        {
            "review_text": "Give it a chance and you will be glad you did. The first couple hours are a little slow because the controls are poor, but eventually you get more abilities and then the controls flow.   It has a really amazing story and it is only the beginning. Buy it on sale. Don't skip this one in the series, because it's definitely worth a playthrough. It will lead you into a series you will come to enjoy and love, because in the next game will take you into Ezio's life and the masterpiece unravels from there.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a bit odd. On the one hand it's a good game with a cool concept. But on the other hand it's taken back a bit by the fact that it's just drowning in repetitive tasks. Get used to do the same three things over and over again. After a while it kills the immersion. I found myself doing the minimum of tasks just to get back to the plot. But all in all it was a good game that definitely got a much better sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Well, I've been warned that this is the most dull entry in the saga. There's repetition in the 'quests' you'll have to undertake - but most of them are optional and may be avoided. (You may not want to avoid them in the beginning, because you'll benefit from them.) But the world! It's a fantastic place and the cities are a sight to behold. Also, even I, clumsy as I am, had a blast jumping, climbing and stalking through these scenes - this games makes you feel much more competent than you are, which adds a lot to the fun. The story has an interesting spin (you'll see right at the beginning). All in all very recommended. I'm looking forward to the other entries in this series. Here are some play tips (very mild spoilers): Don't try to collect all flags. This is seriously madness and not needed, unless you are unhealthily obsessed :-) You can skip 'save the citizens' sidequests BUT every 15 finished sidequests (informer quests, view points scaled, citizens saved) your hit point increase by one and you may even gain extra abilities, which helps a lot. You max out at 20 (two bars), so plan accordingly. I'd always scale all view points. These discover side quests and reveal the map, which is helpful when fleeing or planing to strike. You don't need to do all informer quests (3 out of 6). The info gained is not that helpful either. But - see above.",
            "review_score": "1"
        },
        {
            "review_text": "This is a recommendation with a caveat.  Assassin's creed gave the feeling of King's Quest, Prince of Persia, and Thief mixed in with an interesting storyline and compelling gameplay.  The caveat is that the game has three parts that are essentially straight up repeats of the previous, just with more story progression. Each city is the same round of tasks after the first.  That said, the story is decently written and gameplay fun enough that playing through the game is worthwhile.  It's also a great start for the even better sequel.",
            "review_score": "1"
        },
        {
            "review_text": "This game marks the start of e Assassin's Creed franchise. By now it's overshadowed by the other games in the series, but if you haven't played any games from the series yet, then this is the best place to start.",
            "review_score": "1"
        },
        {
            "review_text": "  Originally posted on May 24, 2009    Assassin's Creed is a fun game. In fact it's really fun. The rush of killing a target and fading into the crowd, or racing across the rooftops to safety is immensely satisfying... for the first 3 hours or so. Well I've played this game for about 20 hours and the last 10 have been some of the most frustrating times I've spent gaming in my entire life. Let me Explain.  The game is absolutely stunning in the visual and aural sense. The cities feel incredibly alive and full of movement, bustle and conflict. The game's handling of light and shadow is incredible, especially for a game from last year. The animations on the player character and the NPC's are astounding. As far as making you feel like you're in the holy land during the crusades, this game is incredibly successful. It redefines 'atmospheric'. Yet after your first real assassination mission, when you start to realize that every single one after it is more or less exactly the same in the bulk of the gameplay, you quickly become less and less enthralled with the game.  Every single district of every single city is the same for gameplay purposes. You gather information that has no real bearing on your mission, you save citizens, and you climb towers for incredible views. OVER AND OVER AGAIN. Even the PC's extra missions cannot help vary the gameplay enough to stop this. It is some of the laziest gameplay design I've ever seen.  Another major flaw of this game is that while it looks much better on the PC, the controls for both fighting and freerunning are incredibly consolized and clunky. They make the game feel like a lazy port. In that same vein if you fail missions there's no way to have saved your progress midway or fight your way out. If you screw up an archer assassination with one archer, you must start over from the beginning, which deprives you of a choice to keep fighting, and is incredibly annoying.  And while the level design is mostly great, the 'Arsuf' level is blatantly stacked and terribly designed, and reeks of lazy gameplay design.  My final major bone to pick with the absolutely laughable story. To be fair, I have always mocked conspiracy theories, and their use in games has always irked me, but assassin's creed takes the prize. The fact that I assassinated a few key individuals means that the crusades will suddenly end, Richard and Saladin will come together at the 'evil' Templar's bidding and destroy a small cult of Assassin's? Ridiculous. And of course the whole animus technology is funny as hell. Genetic memory??? HA!  Anyways, that's not to say the story isn't well written, it's just that at times the suspension of disbelief isn't there.  Overall, the game is gorgeous, immersive, and atmospheric, but it is also badly designed, relies on silly story crutches, and is heavily consolized.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game in a series i love. I am replaying it and it's like going back to the roots. Excelent francise.",
            "review_score": "1"
        },
        {
            "review_text": "The original Assassin's Creed is a great game for it's time. It has a lot of excellent elements (jumping off tall buildings, climbing buildings, etc.) that made it  feel  fun. However, the game definitely shows its age. The graphics and game play (particularly some of the climbing controls) can be dated and/or frustrating at times. In addition, I noticed quite a few clipping and other strange bugs during taller climbs and some of the fights I had.  But, as the original epsiode of an excellent series, it definitely is wroth one playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "A good start of the series. Tells the story of Altair and sets the setting for the entire franchise.   A word of warning: Block the game on windows firewall to prevent crashing, because the game is looking for DRM servers that are offline and think it is illegitimate version.",
            "review_score": "1"
        },
        {
            "review_text": "Arcade and repetitive, but this game also has nice open world cities, smooth choreography and the best horses in a game yet. Graphics were good for their time. Like most ports, this is nearly ruined by consolitis: narrow FOV, too easy, non-persistent world, annoying AI respawns, and one of the worst menu systems ever. The save system is bad and there are no subtitles. I had occasional CTDs. A pity, because without all those flaws, this would be a great game. In the end its an 'OK' game. The sequels are also 'OK' in my opinion. Get it in a sale.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best stories I've ever seen in a game.",
            "review_score": "1"
        },
        {
            "review_text": "Comparing this game to the other Assassin's Creed games would not be fair but I am still gonna do it.  The game starts good but the first thing I notice is that the voice acting seems a bit off.After awhile I got used to it but it was a bit annoying at first.The dialogue in the game is clever and interesting.I was more entertained by the dialogue than the actual gameplay.I was getting bored hacking and slashing through dozens of enemies and I was motivated to do so only because I wanted to hear the next part of the storyline.  The gameplay itself is decent even compared to the other AC's(even if the game is kinda old) but it gets boring fast.Each time you get a new target you do the same thing over and over again(9 times to be exact).My point is that they could have put more effort into diversification instead of doing the same exact thing for every new assassination.The sidequests are not fun and you will probably end up ignoring them after 2-3 hours of in-game play.  Another thing that annoyed me was the lack of one-liners for the citiziens and guards.After some time you will start hearing the same exact thing from the citiziens and guards in all of the cities.I heard the following line : ''When he falls,I'm not gonna help him'' like 200 times and it really got on my nerves.  In the end I would like to say that the game has a good storyline and some dialogue that is definitely worth listening to.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let the low playtime (as of this writing at least) fool you, I've spent a lot of time with this game on other platforms.  The first Assassin's Creed game, while still a good game as the thumbs up can carry, is honestly inferior to the sequels in quite a few ways.  The game itself is repetitive and frustrating at times, the campaign essentially consisting of three or four mini-quests in new locations you can complete all of or some of for the same reward before an assassination ni one of threecities. This is repeated many times with roughly the same conersation taking place at each turn and only slightly more exposition offered. This brings in pacing problems (admittedly present in most AC games) in that the story moves quickly at the beginning, slowly for around 10 or so hours of gameplay, and then moves into the endgame of Altair's story like a runaway train while Desmond's story builds up to reveals (and ultimately letdowns) in the future games.  In summary: Fun mechanics in an open world that have been improved in future games Interesting story with some pacing problem Unfortunately repetitive campaign.  Final verdict: Probably buy it on sale. &lt;10$ or so, but it's a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Check out the Assassins creed series you wont regret it! I have all the coloectors edition sets and I absolutely love the game!!",
            "review_score": "1"
        },
        {
            "review_text": "It took me a few tries before I actually played through Assassin’s Creed. (I think my fourth attempt, I actually stuck with it).  It does not have the most intuitive control scheme, which makes it difficult to approach. However, if you stick with it, you can become familiar, and start moving around the world more fluidly. It may be frustrating at first, and require a conscious effort to put in the time to learn to play this game, but it is ultimately worth it.  For gameplay, it is most satisfying if you can remove targets without causing a commotion. Learning how to do this can be difficult, but is very rewarding once you’ve mastered this art. Sometimes the boss fights just turn into large brawls, which is unfortunate. The final stretch seemed to involve very little stealth, and was just a bunch of large sword fights.  The gameplay can become reparative, but the developers threw in side-quests to break things up.  The over-arching story exists, but mostly you’ll be here for the moment-to-moment gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Overall Rating: 7.5/10. Really excellent game storywise and a necessity if you plan to play through the Assassin's Creed franchise so you understand everything and a pretty damn amazing looking game for 2008, looks way better then most games from that era. Gameplay is fun for like 3-5 hours then this game is just too damn reptitive.  In my opinion this game is still definitely worth getting just know going in that it's very repetitive but also short so it's not too bad, enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Loved it, looking forward on playing the rest of the series  Only one thing I did not like :- While jumping from building Altair's momentum does not apply and you sometimes just suddenly drop... annoying  9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game still looks beautiful considering it's pretty dated now. Ignore the collectables and just enjoy the gameplay. The story was pretty good up until the end for me but I won't spoil anything.",
            "review_score": "1"
        },
        {
            "review_text": "Yes i know this game is old  Yes it is still fun Really enjoyed the story of this one it really gets you ready for the ridiculous amount of sequels this series has produiced and out of the ones i have played they are really  Positives :  Really fun story Prepares you for the second game which in my opinion is also really good assassinations are great Altair is a total badass  Negatives :  After the story is complete there is not much else to do most of the assassination set ups are pretty much the same   Really enjoyable campaign but not much after that 7/10",
            "review_score": "1"
        },
        {
            "review_text": "A little repetitive at times, but still the beginning of a great series!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty sweet game,even though its old.You will enjoy it!",
            "review_score": "1"
        },
        {
            "review_text": "Very great start to a great chain of games",
            "review_score": "1"
        },
        {
            "review_text": "Apart from the occastional at times hilarious glitches, this game is pretty neat :) It's a shame you can't air assassinate or trade yet, but we all know that comes in the latter games. Really amazing game with great graphics and story line :D",
            "review_score": "1"
        },
        {
            "review_text": "Recomend the Whole Series. Nothing Is True. Evertything is Permitted.",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed is a rather enjoyable game. It has a pretty cool concept, the story is quite alright and free-running from rooftop to rooftop is extremely fun. You really feel like a skilled assassin when you are playing the game, at least for the most part. It gets harder and harder towards the end to dodge enemies and to make sure you're not discovered, but that's to be expected. You need to plan accordingly at times. The story takes place in an interesting era and is quite intriguing but sadly a bit forgettable.   The combat (apart from the assassinations) is somewhat clunky and you can tell that it's a console port. You can play the game with keyboard and mouse but I recommend that you play with a controller if you have one since it's obvious it is meant to be played with one. I had a lot of fun with the game when it wasn't feeling repetitive. Climbing up to the view points was really fun and a few of them was a little bit challenging, too. I found myself enjoying climbing and exploring more than the combat itself.  The visuals are stunning. The game is rather bright and takes place during daytime which is a bit odd for a 'stealth' assassin game. The way Altaïr moves is also done extremely well, his movements are very smooth. As a nice treat; Nolan North is the voice of Desmond Miles - and you can't go wrong with that!  A few negative things: Apart from being a console port with somewhat clunky combat, the game can get rather repetitive, especially towards the end. It also lacks subtitles which is crucial for many. Sometimes I had trouble hearing what was said in the game due to the background sounds. This is something to consider if you're like me and prefer to have subtitles. But all in all it's a nice game despite its flaws. It's a good game to start off a franchise with.",
            "review_score": "1"
        },
        {
            "review_text": "too buggy and glitchy, constant bugs and game crashes....  just play it on a 360 or ps3...",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable. DX10 mode crashes every 3 minutes. DX9 doesn't but game's full of bugs sometimes you can not continue through the story and have to restart. It's a disgrace of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Altair can blend like a boss. LOL",
            "review_score": "1"
        },
        {
            "review_text": "Can't stop playing",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome game just the controls are kinda odd for the mouse and keyboard. On the Xbox 360 it was great. So.....yeah.....better controls..... 9/10",
            "review_score": "1"
        },
        {
            "review_text": "*Friend* How is the studying to exam going?? *Me* I'm about to kill the leader of the assassins who are actually a Templar!  Anyway, for those of you who are wondering if i failed the exam, no i did not. i saved my progress and hope to continue next year. (;_;)  This game is the first in the Assassin's creed series and that shows with weird controls and repetetive gameplay and no proper cutscenes. However, that doesn't mean it's bad. No, i actually enjoyed every second of it. the story is very slow at first and you have to play an hour or so to understand why you have gone back in time to play as your great great great x100 great grandfather Altaïr. who would much rather do a triple backflip on to a house that's 10 miles away and turn into a warewolf every third Thursday at full moon when Jupiter is right behind the sun's core and listen to Kanye SouthWest's new album than do leap of faith.  this was my first time playing a assassin's creed game and i absolutely fell in love with this series. the ai have funny dialogs and i can easily spend an hour listening to them. there are so many different people that do different things. it makes this world seem real like this is what people did in those times when your parents were young and did not have phones or PCs  BUT!!! if i meet one of those women who wants money one more time, i swear i will..... ohhhh!!! yeah i ♥♥♥♥ing hate them. The story, OMG. one of the main reasons i bought every single assassin's creed game there is. the story makes it 10 times more fun to play. i played blackflag for 20 min before i played this game and i didn't know why i went back in time or what they said about templars and assassins i would recommened this game to anyone who's new to assassin's creed games, for those of you who have played the newer ones it might be hard to get used to the controls but i would still recommened it for the story.  PS: i know this review is a mess. first time trying to do a proper review, give me some mosquito spray please!!",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed  Compared to Assassin's Creed II, this game is unexciting and bland. It's really disappointing as the first entry for the series.  Positives:  + Having completed Assassin's Creed II and subsequent games in the series, I can say the whole plot behind the Assassin's Creed franchise is great and well designed. + Various weapons and fighting styles, use hidden blades and swords to strike down foes.  + Free climbing and running, you can scale walls and buildings. A lot of the environment can be interacted with.   Negatives:  - Constant crashing on the latest GPU's, GTX 970 4 GB (2015), to the point of being unplayable. - The game world seemed really dull during my brief playthrough. It's quite bleak and lacks a lot of colour. The controls were also an abomination. - Graphically it's nothing fantastic. Even during release it was arguably poor graphics for its time. - For a game about assassination it's surprisingly lacklustre when it comes to the act itself. It's not really a stealth game, there aren't many creative ways to carry out assassinations...it's just odd. Assassin's Creed II struggled with this as well, but it was far more fun and interesting, so I can forgive it. - Constant repetition with menial tasks, like eavesdropping, interrogation and pickpocketing. Boring. - Pause interface is obstructive and annoying.  Overall Score 4/10  In my experience the games in the Assassin's Creed series are decent but have never had that 'wow' factor. Assassin's Creed is probably the worst, and well worth skipping. Starting with Assassin's Creed II is your best bet. You won't miss out on much of the vital story anyway, and you'll save yourself from this painful game.  It's definitely not good, or anywhere close, but it's not horrific at the same time. It's just ehh..very, very bad.",
            "review_score": "-1"
        },
        {
            "review_text": "12/10 like Skyrim with assassins",
            "review_score": "1"
        },
        {
            "review_text": "BEWARE PEOPLE! DO NOT BUY THIS GAME! I bought AC 1, 2 and Brotherhood during the Winter sales in 2016. I loved AC so much back in the day. This port is horrible, not the game. My xbox 360 controller did not end up working at first and I had to tweak around to get it to work, the tutorial kept freezing constantly and I could not get anywhere and it is so damn glitchy. It's honestly a glitch fest! I am refunding it!   Altair was spinning in circles like a glitchy ball during the tutorial and I do not want to risk anything. It's $6.79 on sale but this should be $2-3 since it's been out for almost 10 years! I rather save my money and get something optimized!",
            "review_score": "-1"
        },
        {
            "review_text": "Game is full of bugs, and bought on Steam it cannot be added to Uplay library",
            "review_score": "-1"
        },
        {
            "review_text": "You can explain Assassins Creed in one word and that word is 'Perfect' I have never seen a character move around so smoothly in a game as in this game. The most realistic animations possible. Running, climbing walls, horse riding, fighting, jumping, it all looks amazingly good. The game is primarily taking place in middle east during the 12 century and the environment looks vey beautiful and has very nice graphics with nice screen effects such as when you take damage, when you fast travel e.t.c. Its a detailed game with high quality in graphics and gameplay. The fighting in the game is unique and is the most successful part of this game. The specific time click with the mouse makes it very fun and rewarding. Click at the right moment and see the awesome animations when you slay your enemy to the ground. You feel so very cool and powerful in the game when everybody has respect of you, they are begging for their life and are screaming in fear and pain when you slay the enemies. They will flee from you and the people around you will be screaming in panic. Its as awesome as it can be. The enemies are cocky and will mock you and its so great to show them who the real boss is. Highly addictive and fun. It works so well with the automatic climbing and running system in the game so its fun just to run around. The story is very good and smart. You are already a master assassin but you have been downgraded to the lowest rank in your 'clan',so you have to start over from the basics. And its in the basics we want to start right? And by the time you do good things for the clan you'll get more and more of your gears back and you get to use your assassin skills again. (Its way better compared to assassins creed 2 when you are a complete noob that becomes a super assassin by touching his fathers clothes. So, utterly dumb.) The main 'quests', or goals in the game is basically assassinations of important people. But to do that you need to gather information about them, so you do some different things to get this information. You beat people up, spy on people, pick peoples pockets, and more. Its mostly all of the same but the open environment makes the game far from linear. Every time you play the game again you can always try different tactics in different ways. The sound is perfect. The sword battles and crushing bones and slashing makes the combat more powerful. All the people around you are talking about what you're doing, they notice if you are climbing, hitting in to people, if you are drawing your weapon, leaving dead bodies behind e.t.c. Its a realistic feeling and you feel that whatever you do in the game matters. The voice acting is good. I do'nt remember the music so i cant tell. (I turn of the music when i play a game for a more realistic feeling but that's just me).  To conclusion. This game is one of the best games i have played. I like games with high quality and this game fits my likings perfectly!",
            "review_score": "1"
        },
        {
            "review_text": "Play this game if you want to feel like a less Italian version of the Assassin's creed 2 batman.",
            "review_score": "1"
        },
        {
            "review_text": "All Assassin's Creed titles, good story but not great -- linear with only one way through. Really REALLY idiotic missions and terrible lack of control. Not worth the effort to load and register with Ubi, not worth the money to sit hour after after waiting for the next scene to load.",
            "review_score": "-1"
        },
        {
            "review_text": "A really fun game in a beautiful setting. The sword fights and animations are enjoyable, and the ongoing story line is fairly compelling.",
            "review_score": "1"
        },
        {
            "review_text": "a nice game, but a weird ending",
            "review_score": "1"
        },
        {
            "review_text": "The game that started it all.. Altair's story.",
            "review_score": "1"
        },
        {
            "review_text": "Repetitive, but tells the story that starts it all. Worth a buy for less than $10.",
            "review_score": "1"
        },
        {
            "review_text": "Finally gave Assassins Creed another try many years after it's release, and I actually enjoyed it for the most part. Graphics and gameplay are barely outdated for it's age, the story is fairly good and the controls are managable. Only real problem I had was no way to buy/sell seapons and I felt the game was linear and repeditive. I hope as I make my way through the series I'll be giving higher reviews.",
            "review_score": "1"
        },
        {
            "review_text": "Because I did a review of Assasin's Creed 2, I thought it only fair to review it's predecessor. Assassin's Creed (if I say '2', it implies the sequel. Other wise, I'm referring to the first game) initially feels like a breath of fresh air amidst all wildly rampant action games at its time. And it was unique ('was' being the key word). The graphics are stunning and it helped buff the slim pickings of the stealth genre. However, as the game dragged on, you'll come to realize that all your quests are the same and at its core, you're simply repeating what you've been doing since the first hour of the game for about a dozen more hours. Only play this game if you care about the series' plot. Otherwise, skip it.  Grade: C-",
            "review_score": "1"
        },
        {
            "review_text": "Great game played it a lot on Xbox and just as great if not better on PC. :)   Has many floors, can feel slow paced and to much talking but it doesn't ruin the fun.   Stab Stab Stab will always be fun I recomend for any fans.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent story driven game. However, it is console port, not as bad as assassin's creed 2 where screen does not even display keyboard keys, assuming i know all the hotkeys, but its something you can get use to. Side missions are repetitive, same objectives with different locations, it is optional but it gives more play time. AI is dumb and annoying. Other than that it is really good story, it outweighs all the cons. Game has no replay ability except collecting flags. Only bug i have encounter is game crashes sometimes, but i was recording so that might be the problem. Big plus is no Ubisoft drm :)",
            "review_score": "1"
        },
        {
            "review_text": "Forwarning: It gets betters once you figure out how the AC Engine works. Very beautiful game when it's not acting up, but with all the gripes I have with it, the story is very interesting and the assassination missions are so satisfiying to acomplish. Walking away like a boss after a high profile target kill makes it worth the annoyances.",
            "review_score": "1"
        },
        {
            "review_text": "A truly new and fresh game back in the days, where parkour meets pseudo - historic fights with evil templars. That game was a really nice distraction from most of the stuff released back then. But what it has to offer now? First of all this is really part of trilogy (pentalogy?) depicts a story of one guy, named Desmond Miles, snatched by some organization, locked in a room and forced to relive past lives of his ancestors in search for... Well that would be a spoiler, so I let You to find out. Game take place in two different places, one being today reality and second in middle ages Holy Land. While present offers some background story of Desmond and his story, the Animus part is where the fun really happens. You're an Assassin named Altaïr Ibn-La'Ahad, sent by Your order to kill cartoonishly evil templars in attempt to free Holy Land from their grasp. Altaïr also slowly reveals their true purpose there and his job became one of finding something hidden through generations... Overall story is pretty good and makes almost no effort in captivating player. Now little about gameplay - it is a third person perspective, where You're allowed to climb almost every building in game. Unfortunately the climbing itself is a little clunky, but if You can grind Your teeth a little, You will get satisfaction quickly. Apart from this there is some horse riding, running on rooftops and many fights. Altaïr slowly gets better weapons and means to fight more enemies at once, without dying. Fights themselves are pretty spectacular, with many different finishers and moves, depending on weapons used. They are also pretty intuitive, if one learn their moves. Main quests are done very good, but side quests are really boring and repetetive, and that is very unfortunate, as they do very little to expand the story, and they can be just ignored. While game aged a little, some vistas still are magnificent. Animations of fights are done very good too. You will notice that many building looks the same, but that can't be avoided in a game that big and somewhat complex. Overall graphics are pretty good. Do I have to tell You that the preferred way to do that is by playing with a controller? No, I think not. P. S. Remember - water is Your most deadly enemy, and You can't counter it;)",
            "review_score": "1"
        },
        {
            "review_text": "Not sure if is my computer, but sometimes when I eagle vision, my computer crashes. Not the game, my computer. Several other things cause this too, game is glitchy. terrible port",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely repetitive.",
            "review_score": "-1"
        },
        {
            "review_text": "What the actual ♥♥♥♥ is this?? Maybe my expectations were way too high after hearing only positives about this game series, but this was a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "The game that started it all, it has actually aged fairly well. Even though newer games are prettier and better and have better storytelling and less repetitive gameplay, I still recommend to go ahead and start from the beginning. The settings are still pretty, and the gameplay is still fun, if a bit repetitive by the time you get to the end of it (you might skip a few of the optional collections which is just fine). The storyline of these games are direct sequels of each other, so I definitely recommend starting with this one before moving on to others in this great series. If you skip most of the optional collecting, the game should only take a few hours to beat.  Controller support is enabled but for some reason the default keys seem to not match up correctly. Especially if you have played later games in the series, be sure to remap the controls before playing or you'll get a little turned around.",
            "review_score": "1"
        },
        {
            "review_text": "This game hasn't aged very well. Repetitive gameplay, clunky mechanics, strange bugs, and bad writing. Gonna just watch the story on Youtube instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Erm, tried to get this to work for about 2 hours. Game suffered from constant crashes on load and random freezes during gameplay. All the reading I did about it suggested that the primary cause is Ubisoft's DRM trying to phone home and somehow failing in the process. The #1 recommended fix to make the game stable is to disconnect your computer from the internet while playing. No thanks. `.` I also tried the various firewall tweaks and host file edits that were also suggested but none fixed the main DRM symptom. Since I'm interested in checking out the series, I'll just be watching the AC1 cutscenes on youtube instead. :P",
            "review_score": "-1"
        },
        {
            "review_text": "The Game is very well done and definitly worth playing I would say it is a 8/10 on all counts.   The story mode could be a little longer but there are many sequels to enjoy the setting in.   ",
            "review_score": "1"
        },
        {
            "review_text": "Unless you like doing the same thing over and over again, then this game is not for you.  The good:  Graphics - Considering it is not new game, it looks pretty good even now, large cities all with distinct features.  Story - This is the only reason, I wanted to keep playing as story is great, but I just can't force myself to do it anymore.  Movement - Parkour is great, one of the coolest features. Jump anywhere, climb, running on the roofs is pretty fun.  The bad:  Controls - It may have been made for consoles, but controls are not really intuitive (default) ones  Combat - Very simplistic, that doesn't require much thought, only pressing button at the right time.  Repetitive gameplay - Quests are the same, everything is the same, if you've done it once, you will do the same thing another 20 times.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring and repetitive in the beggining of the game, only fun way to play this is to transfer over a 100% completion save if you just want to go around killing/countering guards (which is how I wanted to play).",
            "review_score": "-1"
        },
        {
            "review_text": "I will start with pre-game. U cant even play it through steam it crushes all the time. Dynamics are really bad it made me sick sometimes. Afterall, this is the first game of a legend serie. So, it worth buying when its on sale. Otherwise, dont buy it. Good story, no subtitle hard to understand if u r not really fluent in English. ",
            "review_score": "-1"
        },
        {
            "review_text": "Nice gameplay, it's actually fun, but:  - after a while you realize you're always doing the same things over and over  - the game is not perfectly optimized for pc. You lose the full screen mode if you switch to another app and come back  - the controller is not completely integrated.  - there are no subtitles  - the camera works often very bad, going behind walls or plants.  - there are no achievements like on Xbox or PS3, which means taking all the flags or killing all the templars is completely useless",
            "review_score": "-1"
        },
        {
            "review_text": "One of the most interactive tortures that I've played in years.  11/10",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted a complete story, I didn't get one.",
            "review_score": "-1"
        },
        {
            "review_text": "A really good game, but don´t by it on Steam. Something is wrong with it, and there is no support of refund.",
            "review_score": "-1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "The worst exit game navigation in history.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "boring as queuing at the post office.",
            "review_score": "-1"
        },
        {
            "review_text": "Assassins's Creed The whole game is based on occult lore and symbolism.Story line is based on Illuminati agenda.The words like 'New World Order' or 'lizards dominating the world' are also mentioned in the game. A lots of messages hidden in this enjoyable game. ",
            "review_score": "1"
        },
        {
            "review_text": "How this series managed to take off with such a terrible first installment is beyond me. The plot is hopelessly convoluted, and the game makes you slowly plod through repetitive tasks, working toward an unsatisfying resolution. Combat is the grandaddy of basic whack-a-mole 'Press X to win' garbage, further dulled down with AI that hurtles back and forth between the two extremes of utter cluelessness and psychic ability. What little challenge this game offers comes from trying to cope with its godawful camera and unintuitive control scheme. Oh, and you can pile random hangs, freezes, and crashing on top of the whole heap. The only things Jade's Game does manage to get right are atmosphere and level design, and while it demonstrates a keen grasp of those two concepts, it's not enough to redeem the project as a whole.",
            "review_score": "-1"
        },
        {
            "review_text": "The mechanics of the game were no doubt revolutionary for its time. The scenery of the game was very beautiful too. Unfortunately that is where my compliments end. Nothing can hide the fact that you are a dog fetching a stick throughout the game, with its repetitiveness. The fun factor quickly faded and it became a chore to reach the end. I must be in the minority though, as it seems so many actually enjoyed it? To each their own i suppose... now where did i leave that bone?",
            "review_score": "-1"
        },
        {
            "review_text": "Most of the time, a game series starts out strong and over the years the quality decays as the franchise is milked to death by its publishing company.  However, Assassin's Creed did the opposite: the first installment in the series is actually one of the most boring open world games I've played. The writing is okay, the storyline is interesting, but it falls short on delivery. The gameplay gets stale and boring after only a few hours. You're required to complete a few mini-missions before the main mission 'unlocks,' which would be okay if the missions were actually fun. It becomes a chore--a repetitive experience that makes you want to quit playing the game and never finish it, even though the storyline is decent. That's what I did.  If you're caught up in the Assassin's Creed hype, do yourself a favor and skip the first one. Start with the later installments.",
            "review_score": "-1"
        },
        {
            "review_text": "Picked up Assassin's Creed: Director's Cut during a Steam sale as I never played any game of the franchise before. I had high expectations due to the popularity of the franchise. At the beginning you get blown away by the detailed graphics and the openness of the world. You started digging into the combat mechanics, enjoy your stealthy kills and exploring every hidden city corner. But after a few missions, the repetitiveness of it all becomes quite apparent: always the same mini missions, always the same chain of events, the open world where you can do... nothing. Yet another few missions later and you are wondering why you are wasting your time on this... Boredom changes into irritation once you find out that you really don't need to be stealthy nor do you need to explore everything or finish every mini mission. And then I didn't even mention the excruciating game menu, the crappy ending, the poorly scripted conversations (no, there is no escape button). Quickly I didn't feel any sympathy for the main character and the unfolding story. What a missed opportunity this game is... Even at sale, I would not recommend this game.  Score: 4/10  Pro: + visuals + open world + climbing towers and enjoying great views  Contra: - empty world - repetitive missions - clumsy controls on pc - painful game menu system - irritating camera system",
            "review_score": "-1"
        },
        {
            "review_text": "So recently I decided to marathon all the Assassin's Creed games available on PC and 100% complete them. This one I didn't 100% complete but I did do the story and some side stuff. Here are my honest thoughts on just the game itself, if you were to buy it now.  Pros: -Interesting story line in and out of the Animus. -Combat can be quite satisfactory and challenging. -Is not too easy. -The locations are quite cool and interesting. -Desmond.  Cons: -Graphics are very outdated which is unsurprising seeing as how old it is. -Gameplay is very repetitive (do some spying then kill your target). 9 times. -Freerunning is quite slow and clunky, but not too bad. -Cutscenes are very dull, boring and overwinded. -Voice acting isn't great especially from Altair. -Altair is quite a boring character with no spirit. -Being stealthy is very dull, pointless and sometimes very hard.  Overall, if you want to have some fun with a one off game then DO NOT BUY THIS, unless maybe it's on sale. There are much funner games for £10. If, however, you want to start the AC games from the beginning and understand it all like me then buy it, but do know IT IS NOT NEEDED! You can easily start from AC 2 and not really miss much as that is a much better game!",
            "review_score": "-1"
        },
        {
            "review_text": "This is the perfect game for you if you want to spend one hour on gameplay, and twenty on stupid, meaningless yet unskippable cutscenes.",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are terrible. You fight the camera just as much as enemy soldiers. You go to the towns and do the SAME quests and side quests throughought the whole game with no variation, and there were several times where the game forces you into combat when all you want to do is run away. The game is just 12 hours of ♥♥♥♥ing boring.",
            "review_score": "-1"
        },
        {
            "review_text": "i want ubisoft to make an remake so its better graphics.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible pc port. Stiff and rough game play. Its a great series but a very weak initial offering. Start with the second game.",
            "review_score": "-1"
        },
        {
            "review_text": "By far one of the worst movies I've ever watched.",
            "review_score": "-1"
        },
        {
            "review_text": "-blasphemous, anti christian propaganda -repetative gameply -no achievments -a little bit glitchy (no pun)  +good graphics +large areas to run about in and assasinate in etc",
            "review_score": "-1"
        },
        {
            "review_text": "It was plain boring. It didnt have much to do till the end really. Wouldn't recommend",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not good. Do not believe the lies.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall; a fun, engaging game. Good graphics (some nice, cinematic qualities during cutscenes and fight sequences), great sound and decent voice acting (nice to see in a game) and of course, good solid gameplay. You will need a gamepad to play (you seriously can't do it without one), and the fighting is probably one of the best and most satisfying systems in a game. I won't lie; this game made me rage hardcore at some points; especially at the end, so do expect it to ♥♥♥♥ you off. Otherwise, great! ***",
            "review_score": "1"
        },
        {
            "review_text": "This game does have some slightly framerate stability issues due to porting issues, but the game ultimately plays the best and looks the best on the PC.",
            "review_score": "1"
        },
        {
            "review_text": "Solid sword fighting mechanic, intriguing storyline, and long gameplay time (&gt; 14 hours). What more can you want?",
            "review_score": "1"
        },
        {
            "review_text": "A very good game however, It crashes most of the time on launch making it anoying to launch, and has crashed during game play 3 times in 14 hours of play time.",
            "review_score": "-1"
        },
        {
            "review_text": "25 minutes crash, 20 minutes crash, 30 minutes crash, crash, crash, crash, and incase you thought it wasn't going to, crash. Love the game, minus crashes.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would desynchronize again",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed is a game about repetition. You enter a city, do two or three information jobs, then you go kill your target. It's that for the entire game. What sets this game apart from others is its originality. A world like this has never been seen in video games and it's a truely unique experience if a little dated. Give this one a shot if you're wanting to begin the Assassin's Creed series.",
            "review_score": "1"
        },
        {
            "review_text": "For it's time the game was really good. Playing it now it feels a little dated. If you want to get into the franchise I would say to read up on the first game and skip playing it just to start with the second one since it fixes a lot of the problems me and other people had with this one. Also the lack of subtitles makes it kind of hard to make out some things people are saying (expecially when trying to hear though the vents.) All and all it is a good game I would just say if you don't like it to skip it and move on.",
            "review_score": "1"
        },
        {
            "review_text": "The story from this game is so amazing it can be even judged by the first minutes that were played.",
            "review_score": "1"
        },
        {
            "review_text": "A great game made greater in HD. Controller settings are poor to begin with, but after tweaking with the bindgins, you can find a playable layout. If I had any advice to new players to the AC series, it would be to stop buying games from Ubisoft. Except for this one. This one's okay.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to start the franchise.   Game play is innovate at first but becomes repetitive later. As an assassination game it needs to have mechanics like hiding/peeking from behind the walls.   Story is innovative in some sense but is a bit too mysterious.  Graphics 8/10 Gameplay 7/10 Story 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed is a wonderful game. If you like history with a dash of the future, play this game now. If not, then try it anyway. You will like it.",
            "review_score": "1"
        },
        {
            "review_text": "The original AC was more of a tech demo than a proper game, but still has some good aspects that some people might desire.   +The environments are lovely, if a bit whitewashed, and the game runs buttery smooth 60FPS max settings even on my 6-year old hardware. +Combat is MUCH harder than in the sequels; if you get cornered with 4+ guards surrounding you, you're screwed. Counterkills still exist, but the chain kills introduced in Brotherhood are not, which I like. +This game is much more stealth-oriented than the sequels. If you alert your target, not only are they difficult to kill in a straight fight, you will very quickly get surrounded by guards and have your ♥♥♥ handed to you. +You are encouraged to obtain useful information about your target and ways you can take them out, whether it's a map of patrol routes or a hiding place to jump out from. These are obtained by completing side missions (see below for why this is a bad thing).  There are quite a few problems with this game though:  -Doesn't play nice with controllers; every time you turn on the game it defaults to KB/M, so you have to go into the options menu to switch to controller every time. -Unnecessarily convoluted game exiting. To leave you have to exit the animus, then quit. Took me too long to figure that out. -Combat can sometimes be slow to respond which, considering how lethal fighting is and the fact that you don't have medicine to heal mid-combat, can be a death sentence. -NO FAST CLIMBING. The godsend of AC2 over the original was being able to climb nonstop hand over hand. With AC 1, you will stop at every move, then move to the next area. Makes traversing areas painfully slow if you've played any of the other games which feature this faster climbing. -Altair's voice is plainly American, while everyone else in the Animus has period appropriate accents. Very immersion-breaking. -Guards sometimes detect and attack you for no apparent reason, so it's best to avoid any areas with guards entirely, or try to blend through them. This doesn't always work for some reason though. -Very little story. Go kill these guys, then something happens at the end that sets up for AC2 (significantly better). -PLEASE SIR, CAN YOU SPARE ANY MONEYY!?!?  Overall, if you really want to experience the series from the beginning, it does have some nice aspects, but if you've already played the others it will be very hard to go back and deal with the archaic combat and freeclimbing systems.",
            "review_score": "1"
        },
        {
            "review_text": "If you like slipping off of a balcony and falling into ♥♥♥♥ then this is the game for you. I myself dont roll that way.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing action game, with a cool story, great world and fun gameplay and combat. You should definitely play this.",
            "review_score": "1"
        },
        {
            "review_text": "fantastic game but one major flaw thats really anoying, u will be playing being emersed and u do something cool or a plot twist happens and then it skips foward in time and miss the cool stuff",
            "review_score": "1"
        },
        {
            "review_text": "BLUF: Interesting story, however characters hold little weight. Relatively repetitive, little replay value. Good starting point into AC Universe, but with no multiplayer or branching story, and little in the way of customization, there is no need to replay the game unless one is looking for deeper meaning in the story. The more recent AC games have also perfected the formula.   8/10 *********************************************************************************************************************************  As the introduction to a now well known and defined franchise by Ubisoft {France and other studios}, Assassin's Creed™ is the cornerstone entry into now what has become Ubisoft's flagship brand.   Assassin's Creed™: Director's Cut is the quintessential version of that cornerstone. Ultimately, the game is fun to play to an extent. For those lost in the annals of the Assassin's Creed universe, this game is a great stepping stone to move into the now popular 'revenge, passion, and growth' storylines that permeate the modern AC entries. For fans of Ubisoft's work, it can serve as an interesting look back at the mechanics and storytelling that launched a new IP.   However, I would like to stress that this game is not like its future bretheren. The game has little in the way of customization of either character or playstyle. The unlocks are given at defined intervals and there is significant travel time between mission sets. The gameplay is repetitive, taking place through a variety of event types that ultimately lead you up to an extended mission with a difficult situation to overcome tactically. However there is no replay value, as the missions do not change. The graphics are dated 7 years later, and the Director's Cut content does not add anything that changes the way the mission sets play out.   I do want to note that the game places much of stress onto players to approach situations how they want while being given the tools to do so. Two of the 6-8 side missions are required for the player to approach the set-ending assasination attempt, which leaves it to the player to decide how much preparation they want to place behind their precision. The future entries in the AC Universe certainly distill this methodology of player agency and expand on it, incorporating the side missions into the main story, therefore lengthening the story and making the work up to an assassination attempt significant in a different way.   I would also like to stress that the story is different as well. The story for AC was developed following the loose adaptation of Vladimir Bartol's Alamut. The story is not the typified AC norm (emotionally scarring event that leads the protagonist into a catharsis, forging the character and leading to the emergence of an assassin moving to vanquish those who wronged him/her/the brotherhood) The Assassin v. Templar threat is not well fleshed out here in the meta-story either. However, these are tropes left to the rest of the franchise to carry out.   I argue that this story line is the last one that has significant interpretation that can be administered. Although containing franchise staples such as revenge and freedom, the epiphany here takes the length of the game, and the true value is in the growth of the main character, not in the vanquishing of the main antagonist. The assassination's in the mean time serve as the vehicles that propel the character to the objective, without becoming the objectives themselves. It is here that the story shines, even though it is an adaptation of a story written in 1938.  Despite it's flaws, Assassin's Creed™ is a title that enthusiasts and beginners can both pick up and enjoy with the only draws being the repetitive nature of the mechanics. I love the game and certainly suggest it to all interested. With it's interesting and well written story, and fun gameplay with appropriate twists, this title earns and keeps it's place as the birthplace of AC and one of Ubisoft's riskier and profitible entries.   8/10  **It should be noted that Ubisoft took a financial hit in developing AC, losing a significant amount to a lack of sales driven by the release of this as a new IP and the lack of heavy marketing that Ubisoft now relies on. Ironically, the game's mechanics and models have been copied into many of Ubisoft's other IPs and has created an extremely successful franchise that is soon seeing it's next installments in AC: Unity and AC: Rogue, bringing the total number of console/PC AC properties to 8. Vladimir Bartol would be proud.**",
            "review_score": "1"
        },
        {
            "review_text": "Extremely crap controls and console back port to pc. Cannot even quit to desktop from the game menu. Gameplay is repetitive and frustrating, but bearable if for the storyline. Crap ending, if you can even call it an ending. This game leaves no finality or satisfaction at the end. Suck.",
            "review_score": "1"
        },
        {
            "review_text": "Good gameplay with some interesting assassination elements, combat can get rather repetitive though. Story was also pretty good though it was confusing to follow at times.",
            "review_score": "1"
        },
        {
            "review_text": "It was an amazing game. Frustrating at times but once you assasinate that one person that made ypu smash your controller, it feels EPIC i would reccomend this game for any type of gamer.",
            "review_score": "1"
        },
        {
            "review_text": "Epic game. It takes you on a journey through history in an epic way. The scenery is great en the free roaming makes the game much fun. I give this game a 9/10 because at a certain point you have to do the same thing over and over again. BUT! Defenitely worth every euro I paid for it, would buy again!",
            "review_score": "1"
        },
        {
            "review_text": "I just recently started playing this game. I'm hooked. Even though, a great assassin apparently can't swim. Hmmm. XD",
            "review_score": "1"
        },
        {
            "review_text": "A good start for the franchise. Stealth mechanics and story really shines in this one.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "the only downside i find in this game is that its too repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "A sandbox with good ideas but at the end most of them are badly used. Repetitive gameplay almost ruins a great historic setting filled with wonderfull little details.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I've never picked a game in this series up until now. In a way, it's amazing this series took off. It's a great idea, a wonderful gameplay conceit that allows it to be 'gamey' via an in-game explanation (the Animus). The story is good, like a Dan Brown novel. The gameplay is tight and refined, considering it's the first entry in the long-running series, and the graphics are decent considering the age. All that said, it's amazing it all ever went anywhere as horribly repetive and rote the game becomes about halfway through! Unless you purposefully break the monotony by doing optional tasks, it's basically a rinse-n-repeat of go to this town, do 2 or 3 information gathering tasks, kill a guy. It wouldn't be so bad if it were an 8-hour game, but it's probably more like 15. I couldn't keep doing it. I skipped to AC2. Recommended only if you must see how the series started, but otherwise, skip it, the sequels are much better, and watch a Youtube video of the story segments in this game to fill in the gaps.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know why everyone was so down on this when it came out, I had fun with it, even though it took me like eleventy billion years to review it.  7/10.",
            "review_score": "1"
        },
        {
            "review_text": "How many times is Steam going to ask me my age? I mean for real valve...I don't have 500 birthdays a year.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome game, though it does tend to get a bit repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "The game that started a very popular and succesful series. What I liked the most was the never seen before freedom of vertical movement. Climbing was probably the most satisfying element of this game. Story was very intriguing, although missions are very repetitive throughout the game. Game is split into several memories. You do a few side quests gathering information about local person of interest and then you proceed to asssassinate him. You repeat this formula until the very end boss battle. What broke the monotomy is returning to reality, to present, and learning more about the templars and Assassins in our time. Ending was very mysterious and opened infinite posibilities for future Assassin's Creed games which Ubisoft, as we all know, used very agressively. Not a year passes and we see another AC game. But about those later. All in all, this game was something unique for its time and was a very solid game. It features increadibly lifelike cities and it is one of the best parkour games with very unique setting. Worst thing about it though, was trying to exit the game, which required something like 5 loading screens. But that was finally fixed. Main story gave me about 20-24 hours of gameplay, but there's tons of side things to do and explore which can prolong the game to over 30 hours.  Gameplay 7/10 Story 8/10 Sound 8/10 Graphics 7/10 Polish 8/10 ------------- Overall 7.5/10 (very good game)",
            "review_score": "1"
        },
        {
            "review_text": "I did play Assassin's Creed III which I loved, but the story of Desmond seemed really intresting and Assassin's Creed III was really fun.  So I bought It. Gameplay could be a bit better but it's not really a problem. Parkour could be better.  Altair was an easy character to get use to and enjoy, but saddly you can't swim. There is nice spaceing in the game. So you can run around, climb, and hide.  Story was great!",
            "review_score": "1"
        },
        {
            "review_text": "Apart from the current steam trailer voice, this game has no downsides! Definitely worth £9.99!",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game not the best but still good. The only reason why i am not recommending it is because it's not so good on PC. i have the game on the lowest setting and it still lags. all my other games are on high and they are perfect except for this game. and not just a little bit of lag, quite a lot, game breaking and i never had those problems on console. So if you want to buy it, buy it for console, which one? well that is your opinion, now have fun.",
            "review_score": "-1"
        },
        {
            "review_text": "My favourite AC ever!!",
            "review_score": "1"
        },
        {
            "review_text": "This game can get a bit repetitive and linear at times, but it still proved to be a lot of fun. I got to kill people, and then upgrade my ability to kill people. The story line was good as it brought about more killing, and the graphics were good, especially the ones where you got to be murder-y. This probably sounds like the rant of a psychopath... But it's still a fun game. I liked Altair more than Ezio, which is probably the minority opinion. For the start of the series this worked pretty gosh darn well, the health mechanics as it related to the storyline was one of the more inspired ideas. Buy it, kill some gaurds and templars, throw some knives and nap in some bureaus.",
            "review_score": "1"
        },
        {
            "review_text": "recomended for people who like stealth action and killing not recomended for people who like to sit down and do nothing",
            "review_score": "1"
        },
        {
            "review_text": "Just like reading a history book while jumping off a building! 9/10 (You jump off a bigger building in the sequels)",
            "review_score": "1"
        },
        {
            "review_text": "I got into the Assassin's Creed series pretty late. I picked up this game on sale, and the rest of the franchise. I set a goal that I will beat all of the games. I beat this one, and oh my god! I already want to replay the game!  This is the very first and orignal Assassin's Creed, it's great, it feels amazing, it looks amazing, the combat is very satisfying, and just overall it's art, stunning game.   This game pulls you into the whole franchise, pulls you in with its combat, visuals, characters, and the story itself!  A must buy! Sale or off sale, worth the money. Great game, totally recommended   Can't wait to play and beat the rest of the games!",
            "review_score": "1"
        },
        {
            "review_text": "Nice to finally have backstory to II",
            "review_score": "1"
        },
        {
            "review_text": "This is the 3rd time i've finished this game ........ still awesome",
            "review_score": "1"
        },
        {
            "review_text": "This is a game where a lot of people try to murder you for bumping into them and climbing up ladders to get onto roofs. So basically, not much unlike modern day city life.",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played the assassin's creed games I would not reccomend starting here! The newer games play much better (although the story isn't as good as in this one) Basically any assassins creed game is an addition to this one in forms of movement, combat, quests, characters and story. You play one... you really have played them all Great game would reccomend if you love the other games 9/10 - (when thew game was released) 6/10 - (Compared to the newer games)",
            "review_score": "1"
        },
        {
            "review_text": "The start of a great franchise and a story that you might never forget. the game play is not perfect but it's solid. and although that might be totally unrelated . as a palestinian born and raised away from home . seing and exploring the beautiful city of jerusalem brought great joy to my heart and tears to my eyes .",
            "review_score": "1"
        },
        {
            "review_text": "Found this game really enjoyable, although slightly repetitive at times. I enjoyed the story of Altaïr, and how he evolves as a person over the course of the game. I liked the adventure elements as well as the RPG-ish feel. My favourite thing was the free running on roof tops. A good place to start the Assassin's Creed series.",
            "review_score": "1"
        },
        {
            "review_text": "If you have the original, or an saftycopy from a torrent site, then use that instead of the steam version. It is soo full of bugs  Suddenly some haystacks in carts/on ground have turned into concrete. If you're lucky, and have a big amount of hp, you don't die, otherwise, you just start from where you took a flag, or synchronized.  The 40th King Richard flag, has all of a sudden gotten even more impossible to get. 20+ tries before I moved on. It cannot be taken. Tried different positions before running off. Even tried going from the flag above to see if it did anything different, but unfortunately not.  If you're one of those players that want's to collect everything in AC1, then PLEASE, for your good, don't play the steam version",
            "review_score": "-1"
        },
        {
            "review_text": "if you want to know about assassin's world you must play it from first chapter, where the beginning of story begins so you can proceed to the next chapter",
            "review_score": "1"
        },
        {
            "review_text": "It was fine for a moment. But ended up being boring and repeating itself. I was disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, with a good story, set in a historical time period and it seems like they put in legitimate effort to make it authentic. Definitely worth a playthrough. Warning though it is repititve along the lines of games like Shadow of Morder You basically do the same side quests again and again in 3 different cities and then go after your target which advances you to the next part of the story.   Was probably ahead of its time considering this game is like 8 years old. The graphics are still very good even by today's standards.   Would use overpowered haystacks again I mean really who would think to look in one?",
            "review_score": "1"
        },
        {
            "review_text": "Basically, it's a cool game.  However two things are very annoying. 1) You need to climb a tower every 2 minutes to unlock 'quests', so to speak. Super annoying. 2) When you want to exit the game, you exit the in-game game, and then you're back in the game that's inside the game. Then exit that and you have to loud your profile and then exit out of that to finally exit the game.  Other than that, good old-school game.",
            "review_score": "1"
        },
        {
            "review_text": "Classic. ",
            "review_score": "1"
        },
        {
            "review_text": "If you like story and movies, please start playing the franchise and finish this game first.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun to go running the rooftops and killin' nazzies. What? There aren't Nazis in this? Whatever. It's still fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome gameplay with a great story line, and lots of violence too :3",
            "review_score": "1"
        },
        {
            "review_text": "I played Assassin's Creed II, III, and Black Flag before playing this and to some extent, I shouldn't have. Assassin's Creed is, I think, a worthy predecessor to the series, but there are some flaws. Combat and movement feels very clumsy at first, after playing for a bit it still is, but you kinda get used to it. The story is also very repetitive. After completing the first three assassinations, you get the idea of what to do. It just gets too repetitive. The visuals, however, are amazing. It really is a feast for the eyes. For a game released in 2007 (I think), the graphics are stunning. A bit low compared to modern games, but still impressive. If you can put up with a repetitive storyline and clunky controls, you'll probably enjoy this game. Despite these cons, I can honestly say that I enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "NO SUBTITLES! I'm ♥♥♥♥♥♥ off.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth playing for knowledge of the story. Some of the features are frustrating, like dying when falling in water, and it makes some of the swimming concepts later confusing.",
            "review_score": "1"
        },
        {
            "review_text": "Can be such a repetiitve game after the 4th area",
            "review_score": "1"
        },
        {
            "review_text": "After trying this one out a couple years ago, I came to it slightly more mature and with an xbox 360 controller. What a treat it was. Although some really didn't like the modern but virtual-assassin setting, I didn't find it too annoying and actually thought it somewhat intriguing. To me, the highlights of this game are its' graphics, combat, and historical atmosphere and setting. The world is bright and the animations extremely fluid. Speaking of fluid, so is the combat as you assassinate one enemy after another executing counters and sweet but brutal combos. If you're a history fan, this game also has a rich historical atmosphere and storyline to follow, although it's basically completely fictional. I picked this game up for $3 and got 20 very enjoyable hours out of it. Not too bad at all. 8.6/10.",
            "review_score": "1"
        },
        {
            "review_text": "Classic work",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's creed is a wonderful adventure game. The enviroment in this game is very realistic and pretty. The game story is very intresting that you sometimes don't want to quit the game. I also like the gameplay itself that you can climp up buildings and jump from roof to roof. The combats are a bit difficult in the beginning but you will lern pretty quickly how to do. I hope when I buy AC 2 that it is even better than the first one.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of Assassin's Creed then see where it all started! :)",
            "review_score": "1"
        },
        {
            "review_text": "For me the best game ever &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game in general. You will need 15 to 20 hours to finish the stroy, but more than 25 if you wish to complete all the tasks. The story is well directed, which is no doubt, and combined history with fantasy. AC also presents the remarkable remake of three legendary cities in human history, Damascus, Acre, and Jerusalem. Combat system is not that impressive, maybe among the middle of all action games. Also the missions you receive are just like repeating themselves, which make the game a little bit linear. Don't get too serious with the way you fight in the game. After all fighting is not the heart of AC. Story, legend, and medieval world, these are the elements make AC a classic. These are sensational.",
            "review_score": "1"
        },
        {
            "review_text": "I must say very impressive. This game was a lot of fun. I judged it too quickly , I had it for a while, and decided after watching a playthrough of a few levels on youtube I decided maybe I was too hasty. I redownloaded the game and really had a great time. The game can be used with a keyboard... but you will either A. Kill your keyboard or B. Kill your hand. Whichever comes first.   I was never good with gamepads but after my hand began to hurt with frustation, I pulled out my pad and really REALLY benefited from it. The Game makes it easy too, since the circles in the upper right mirror the layout of your controller, and change accordingly it allowed me to easily adapt and in doing so become a much better assassin haha. Anyhow highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "The original. You can see the precursors to the second (and penultimate, IMO) game. There are a lot of frustrating choices made, but the game is fun and the period, story and set peices are well done. If you want to stip right to Assassin's Creed 2, feel free. You're not missing much, plus they back-track to cover any story you might be missing. Plus you could just read the plot synopsis on Wikipedia.",
            "review_score": "1"
        },
        {
            "review_text": "It has a pretty boring gameplay, truth be told, and because of this is gets really hard to keep playing after 6~8hrs. Luckily the charismatic characters and the ending kind of make up for all this.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay: The game offers numerous options, ranging from stealth, sword-fighting, hand to hand combat, parkour, horse riding and exploring. All of these options are well done, however horse riding is the weakest aspect.  Story: The story is quite strong, however the moden-day sections feel unecessary.  Graphics: The graphics are very detailed, in particular the cities. Also, there are many unique NPC's, which helps to draw you into the intricately detailed areas.  Sound: Consistent to the time period the game is set in, with appropriate music, dialogue and ambient noise.  Re-playability: There are many collectables and lots of optional content, though some of it can be tedious.",
            "review_score": "1"
        },
        {
            "review_text": "Game is not for everyone, and if you want to get in AC franchise, I advice you to start with AC 2.  This game isn't the best in series, but definitely must play for AC fans and those who liked old AC's better.   Game locations are worth to explore, i really liked music and main story is interesting.   Mechanics feel clunky at times and NPC's aren't the smartest, and there are moments when game just makes you angry. However overall game experience is OK, and if you are willing to do with some repetitive missions and and sometimes jerky mechanics, than you should give it a try!   I would give this game 7.2 /10 ",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Was not ready for the mind-blowing, conspiracy loaded ending. A bit on the abrupt side, but the final moments of the game left me shaken and completely creeped out, but totally looking forward to more from the franchise. While the game's biggest issue is repetitive gameplay, the story, combat and movement mechanics, sound, and graphical style kept me coming back again and again, anxious to see the battle between Assassins and Templars to the very end. Assassin's Creed is a sci-fi conspiracy theorist's fantasy with an interesting injection of historical fiction and definitely worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "What I loved about this game is the incredible climbing and the world designed after historic cities. Looking out upon Jerusalem is pretty neat.  What I didn't like about this game is the actual missions, I always felt like the stealth was obtuse and it always turned into one-at-a-time 10 vs 1 fighting.  I played this game in 2009 and completed the main storyline.",
            "review_score": "1"
        },
        {
            "review_text": "This game is way too repetitive. You will hear the same dialogue, visit the same cities, listen to long-winded dialogue, climb similar buildings and dive into similar hay piles, over and over again. Also, Altair is probably the worst assassin ever. There is nothing stealthy about him. The game says an assassin must be discrete, but the game encourages you to kill scores of guards in the busiest parts of the cities. It also doesn't make any sense that Altair can't swim.   There are two good parts to this game -The swordfighting looks cool and feels good to control. But once you get the counter moves, it becomes pretty hard to die. -The parkour/freerunning is fun.  I also hate the beggars, theives, the guys with the turbans, and the drunks. All they do is get in the way. If you kill one of them, you lose health. Yet, they can hit you and block your way without punishment. That is a very poor game mechanic.",
            "review_score": "-1"
        },
        {
            "review_text": "Lemme explain in one word: REDUNDANT.  Good: Unique Game mechanics, awesome graphics, good atmosphere. Nice stealthy gameplay.   Bad: Game flow follows a very straight patern: Go in a town, go in bureau, get information/do challenge ,go back to bureau, watch a scene, assassinate your target, watch a scene, go back to bureau, watch a scene, move for about 15 seconds, watch another scene, get a new move/weapon. Repeat 7 more time and congrats you beat the game. I'm not even exagerating. You REALLY do that, EXACTLY like mentionned. There is some pointless side-stuff like rescuing citizens or picking up flags. Who cares. OH, the cities. theres 3 cities(4 with yours) and all 3 look exactly the same beside a slight color change. Fighting is kinda button mashing, controls are a little bit akward when running. Npcs keeps saying the same stuff. Ending is bad.  The gameplay is a mix between Arkham asylum and Ninja Gaiden. In my opinion, avoid this game even if it's actually good.  Overall: 7/10",
            "review_score": "1"
        },
        {
            "review_text": "One of my favs. The first game in the Assassin's Creed franchise is set in 1191 AD, when the Third Crusade was tearing the Holy Land apart. Shrouded in secrecy and feared for their ruthlessness, the Assassins intend to stop the hostilities by suppressing both sides of the conflict. Players, assuming the role of the main character Altair, have the power to throw their immediate environment into chaos and to shape events during this pivotal moment in history",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed is a great sandbox game and is currently on of my favorite ongoing game series. Great story, combat system, graphics and level design.",
            "review_score": "1"
        },
        {
            "review_text": "'Nothing is true. Everything is permitted.' The first installment of a (supposedly) trilogy. Immersive story, awesome atmosphere. Free-running, swords and hidden blades will take up quite a bit of your time.",
            "review_score": "1"
        },
        {
            "review_text": "Disappointing story-wise, but who cares. You have never felt so much more like a badass than when you have a group of twenty people surrounding you ready to tear you to peices, only for you to claw your way out using every assasination device on your body. Stealth kills are crazy awesome too, and I cannot forget to mention all the parkour and crazy awesome stunts you'll be doing.  Worth it, so I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "The worst assasin's creed  That being said, assasin's creed is awesome, so 'worst' is not saying much.   If its cheap, pick it up, get started on the series, etc. You'll love it",
            "review_score": "1"
        },
        {
            "review_text": "Pretty safe to say that this series didn’t really begin until ACII. The last 2 hours of the game is nothing but fights against groups of enemies with a terribly bare-bones combat system that doesn’t suit group combat. And it shoots the pacing to ♥♥♥♥. Worth experiencing how the series started, though.",
            "review_score": "1"
        },
        {
            "review_text": "cool game awsome fights",
            "review_score": "1"
        },
        {
            "review_text": "Though the following Assassin's Creeds get better and better, this one is worth it's salt. I am thoroughly enjoying this one and the story.",
            "review_score": "1"
        },
        {
            "review_text": "wow such awesome sick gameplay wow",
            "review_score": "1"
        },
        {
            "review_text": "Worth playing, but mostly for the story... the gameplay is okay enough and the ending is weird as ♥♥♥♥. ah well all in all: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game starts off with a tutorial full of people that lack faces. I had nightmares for a few weeks, but then continued playing it. You play as some ♥♥♥♥♥♥♥♥♥ with a dead-end job who's ancestors were successful assassins and actually did things with their lives. While playing as an assassin, you can run up to innocent people, jump on their faces, and stab them in plain sight.  Don't worry about being publicly shunned or being prosecuted, because the guards won't be able to find you as long as you sit in a garden or jump into a pile of hay. And everyone has 30-second memory, so nobody will remember you.  Your first mission is to betray your brotherhood and get a member killed. Very exciting game. Buy it on  the♥♥♥♥♥♥♥♥♥.org  and use coupon code 'teddybear' for a 5% discount.",
            "review_score": "1"
        },
        {
            "review_text": "This game is worth playing through just for the story. The gameplay is good, but it is also repetitive!  Forget getting all the collectibles, and forget doing all the side missions. Just play through it for the story. Why? Because Assassin's Creed 2 and Brotherhood is so good (and improves so much over this game) that it's worth playing through to get the full experience.",
            "review_score": "1"
        },
        {
            "review_text": "A unique game of its' time, with open world parkour, an intruiging story with interesting characters, as well as bonuses that aren't available on the console editions, any fan of Prince of Persia games, stealth/action games, as well as fans of any new type of concept should experience this game, despite it's few shortcomings.",
            "review_score": "1"
        },
        {
            "review_text": "one of my introductory game to the genre, needless to say that i loved it to the core!",
            "review_score": "1"
        },
        {
            "review_text": "Good game overall but a bit repetitive in the scenario, the game mechanics and progression.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun. :)",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite game series and this one started it all. Loads of fun. Going back and playing it after playing the later games can make this one feel dated because you miss some of the added features, but the story and gameplay are great. A must play for all fans of the series and of video games.",
            "review_score": "1"
        },
        {
            "review_text": "A tad repetitive, but good fun none the less.",
            "review_score": "1"
        },
        {
            "review_text": "While AC I is not the best of the series, it was revolutionary when released and heralded in a wave of open world climbers.",
            "review_score": "1"
        },
        {
            "review_text": "Ubisoft CEO Yves Guillemot states that they expect the upcoming Assassin's Creed: Revelations to suffer a 'double digit decline' in sales compared with Assassin's Creed: Brotherhood, going on to confirm they will be offering another new Assassin's Creed title next year.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game mainly because it shows how far AC has gone from this basic game and it is fun to play and if you want to master each game play this one first because that way you will have an understaning on the combat and can adapt to it.",
            "review_score": "1"
        },
        {
            "review_text": "Worst game in the series  The controlls are godawful, the guards have insane difficulty spikes; one minute they're laughably easy and the next they're unkillable. Altair's voice acting sounds like some unpaid intern just woke up from a deep sleep, and Altair has the personality of a rocking chair with a frownie face drawn on it. The present day story is Much, much more boring compared to the other games. The only reason I bring these up is that people said this was better than the games that came after this. Who could make that conclusion? The guards attack on sight if they see you climbing buildings, gameplay is VERY MONOTONOUS AND BORING. No currency. Beggars are all up in your personal bubble asking for money, and the only way to shut them up is to punch them in the face which upsets guards. Toward the end of the game, it takes a MASSIVE difficulty dive. The investigations are almost uncompletable, since they rely mostly on not being detected. I suppose the best part of the game was that the beginning was kind of good. The story in this one's present day may have sucked, but it started up a great franchise. Off to a bad start, but the rest of the games are really good. Once you swallow the bitter pill that is this game, the payoff, which is the rest of the series, is da bomb diggity, yo. Even with that last part, I just can't recommend this, because you could probably read a synopsis and get what you need to start with AC2.",
            "review_score": "-1"
        },
        {
            "review_text": "Brilliant series - Assassins, Pirates, Conspiracy theories, Twisted Plots, roof jumping and more! Works fine on pc and controls are easy to master however some players may prefer to use a joystick controller  Gathering all the flags in the first episode unlocks extra levels for back stories",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty amazing. Even though its about 6 years old now, you would never think so from the graphics. You really feel like you're an assassin in every sense of the word. The missions can get difficult at times but they are few and far between. The story itself is interesting to a point as well. The cities are beautifully done and you can tell untold hours of historical research went into this game. The voice acting is very good. The random uses of real Arabic and German (among others?) was a welcomed surprise and made the game feel very authentic to the time and place.  The only gripes I would have with the game are 2 things; one more important than the other.   1. The way to exit the game without using Alt+F4 takes forever and is really unneccesarily annoying (More important one). 2. Sometimes the camera can get really stuck at weird angles but with a little mouse and keyboard work, its very negligable.   This game is definently worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "You kill innocent people.  8.5/10 *not* GOTY",
            "review_score": "1"
        },
        {
            "review_text": "You should begin your AC series journey from this game. Reccomended.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly recommended although it can become a little monotonous.",
            "review_score": "1"
        },
        {
            "review_text": "I love Assassin's Creed. The main reason i adore the first one, is that you can go around stabbing everyone without being desynchronised LOL. This game brings me back :')",
            "review_score": "1"
        },
        {
            "review_text": "If you like climbing towers and stabbing people this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "So it's a great game but just inplay able. There isn't a windowed mode which might not sound too bad, however you constantly exit the game, and even on acations halfway though a mision close it. The game says it surports xbox 360 game pads, but when you are costomizing the settings you can't use all the buttons so I have to use RB instead of RT to go into high profile.",
            "review_score": "-1"
        },
        {
            "review_text": "Was amasing for it's time, even though the newer ones have taken a big step forward, you should play through this one to get plot.",
            "review_score": "1"
        },
        {
            "review_text": "It is fun really enjoyed it but the mission got a bit repeatative for me 2/3",
            "review_score": "1"
        },
        {
            "review_text": "it has a fun idea but it gets repeative quickly",
            "review_score": "1"
        },
        {
            "review_text": "Nice game. Looking forward to play newer versions.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable game - Too much repetition - Irritating and stupid combat system + Being an assassin is awesome! + Intriguing story + Good gfx and audio",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game. Graphiks are still okay, the climbing part can be a bit frustrating from time to time (espacially the part were water is involved, because water=imidiate death) and the fights are long and anoying after a time; but the core gameplay is nice and solid. You can feel were all the good stuff, which made Assassins Creed 2 and so on to best-sellers, came from. Also in this game, there are less bugs than in AC Unity.   Recommendet!",
            "review_score": "1"
        },
        {
            "review_text": "'Nothing is true, Everything is permtted.'",
            "review_score": "1"
        },
        {
            "review_text": "I have played other Assasin's Creed Games and decided to give the first one a try before Revelations (to enjoy the plot a bit more). It is definitely a must have for all the fans of the AC saga, but don't expect too much - after playing huge Black Flag you will be surprised by the simplicity of AC1.  PLUS: the atmosphere, music, plot and the amazing antagonist make it absolutely worth it! Google the locations you visit and characters you meet - you will be surprised how this game is based on true stories  MINUS: relatively short, not a lot of side quests, poor voice acting and voice quality  8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the first game in the long Assassin's Creed franchise and honestly this is one of the only ones which is true to it's name. While the game is repetitive and boring at times, it is purely about assassinations. It is therefore unique in that sense as the mechanics that are there work great. If you are new to the Assassin's Creed franchise then this is a good place to start, however you may not finish it and even if you do, you may not return to the game. Worth purchasing when on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Assassins Creed 1 was the first Assassins Creed game I played, and I left this game on between the end of 2014 and the start of 2015.. Random fact for the review.  The game after 8 or so years, still feels so fresh, simple and clean (except for that blood stain from that templar...) Alot of games these days don't feel the same.. And that's a shame.   11/10 Altair is underrated",
            "review_score": "1"
        },
        {
            "review_text": "Better than the fourth. And third. Isaiah's computer would explode if he tried runnung it, though. (the joke is he has a crappy computer)",
            "review_score": "1"
        },
        {
            "review_text": "No Uplay is love no Uplay is life",
            "review_score": "1"
        },
        {
            "review_text": "I had fun. I try to be stealthy but always end up killing everyone in sight as a result of my inability to remain sneaky. Guess I don't have the patience for learning all they guards movements to get missions done unseen.   Can get a bit boring doing all the grinding/finding all the flags and templars to kill. I'd give it an 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game has more bugs than the vietnamese jungle... Like most of UBI half baked rushed games",
            "review_score": "-1"
        },
        {
            "review_text": "A very good game.",
            "review_score": "1"
        },
        {
            "review_text": "classic game... Should play this first before venturing to any other Assassin's Game",
            "review_score": "1"
        },
        {
            "review_text": "An interesting but very flawed start to this series. The Desmond modern day story is the star here with the only two highlights of Altiar's story being the moment he meets the female Templar whose name slips my mind and the final battle. The core gameplay is solid but the things your tasked with doing are the definition of repetitive which foreshadows what this franchise would become.",
            "review_score": "-1"
        },
        {
            "review_text": "For being the foundation of a wildly-successful series of games, the original  Assassin's Creed  isn't really all  that  good. While the gameplay was novel, the series was still finding its feet here, and made a few missteps. Controls can be a bit aggravating, and the menu structure is frustrating. Also, the game shows pretty-much all its cards in the first third, leaving the remainder of the game to feel repetitive. The various forms of progress, like collecting hidden flags, are rewarded only by the sense of completion, and Altair's progress through the game is rewarded only with a few new weapons; nothing game-changing. The original  Creed  is still enjoyable, just a bit underwhelming, given how successful the subsequent series was.  If you want to play the entire series, then you should start here, where it all began, and just keep in mind, if the game becomes a little tiresome, that this is one of the weaker entries and the later sequels are better. If you don't plan to play through the entire saga, however, you're better off giving this one a miss and jumping straight to AC2 or AC4; those two represent the series at its best.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun for the first few hours, but...   -later it gets boring and more boring and more repetitive. -if you play from Steam then sooner or later the game will crash -playing through the game for 100% is a tough and difficult thing since the game is glitchy as hell -no subtitles -impossible to skip the cutscenes -very annoying NPCs beg for money, and they attack you for no reason, and you can't give money.   A disappointing 5/10 I guess. ",
            "review_score": "-1"
        },
        {
            "review_text": "I believe that this game is one of the timeless classics. It's the beginning of one of the most popular game series of all time, and it shows why this game spawned such a cash cow. It's still very playable to this day, and although it doesn't have near as much content compared to modern games, it still really is just a good game despite that. I probably wouldn't pay full price for it, but I would definitely grab it at a reduced price.",
            "review_score": "1"
        },
        {
            "review_text": "A great start to the franchise. It gets repetitive, but it has a great story.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "The first Assassin’s Creed was a good game for its time but it definitely has not aged well. The good things about it is that it's a great addition for a die hard AC fan. You get to play as Altier and know his backstory before the other ancestors in the franchise.When this game was released, the environment was quite rich in innovative and the NPCs acted and reacted to your character realistically. For it’s time, it was quite an achievement. However, the later games definitely are better than this one.   I will list the cons.  - Repetitive - Always have to select the Xbox controller setting every time you start the game. - Crashing - You have to use a mod to have your Xbox controller configured correctly. - There is no in game reward for collecting flags and killing templars except for bragging rights.  I would definitely recommend playing this game after playing the later AC games just to see the back story and how the whole franchise started. The storyline is actually very good with twists and turns. However, if you aren't a big AC fan then you can go ahead and skip this one.",
            "review_score": "1"
        },
        {
            "review_text": "This is where it all started. It's quite rough on the edges and after a while it starts being repetitive. You can almost feel like this was just a proof of concept. When AC first released, it sure was innovative, but it hasn't aged very well. If you don't really care about the story that much, you can safely just skip right to AC II.",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed, The successor to Ubisoft's The Prince of Persia reboot series. Days have been better. Let me first start off with a few thoughts.  Decent gameplay with a few issues here and there in regards to story pace and developement.  The story for the first game in the series was interesting but now its very......its a ♥♥♥♥ing a mess. And the ♥♥♥♥♥♥ PC port, When I first played and beat this game, I was playing a on a rather ♥♥♥♥♥♥ laptop but it got the job done. when I finally got me a nice desktop (that I would later upgraded with a some decent cost-effeint parts) The specs towered over the receommended specs and yet I cannot replay this game can max seetings without crashing almost everything ♥♥♥♥♥♥♥ time.  I tried several things (inlcuding the Direct X file trick but that didn't get me anywhere)  The sad thing is that this is the only mainline game in the series that does not force Uplay on you and yet I still cannot receommend this game because the crappy port. If it wasn't for that I would recommend this game easily. With that I say sadly No. (Note if anyone has very other receommnedations to help me with my crashes issues I would very much like to hear them please and thank you.)",
            "review_score": "-1"
        },
        {
            "review_text": "No side activities even though it's freeroam, story is mediocre at best, can't swim, pc port is sh*t for climbing, voice acting is nothing special, there is a jerk named desmond who won't let you stay in the world of crusades for more than a few hours.  But you know what you CAN do? Get into a fight with 15+ trained warriors who have better armor and weapons than you and win with no health loss.   Realism.",
            "review_score": "1"
        },
        {
            "review_text": "Good game as a basic intro to the massive series. Quite repetitive, all of the missions are the same. Besides the obvious laziness of not creating different missions to beat, my only other critique is WHO HAD THE GENIUS IDEA OF NOT HAVING THE ABILITY TO SWIM IN THIS GAME?!?!?",
            "review_score": "1"
        },
        {
            "review_text": "playing this game will show how much AC games have gone far. though i'll admit this game shows that assassin creed wasn't very much a stealth game and was very combat based i enjoyed it. if you want an assassin creed game that can get challenging sometimes (should learn from this AC3) its highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended for the story if you are into AC games. Open world gameplay is quite repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "I guess everyone knows this game by now, but still I want to express how much I loved this game. Even collecting all those flags was fun. Altair is a very interesting character... No wonder he is one of the most cosplyed videogame characters ever!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Truly a pioneer and one of my favorites. Apart from the occasional misdirected jumping or falling it's superb!",
            "review_score": "1"
        },
        {
            "review_text": "A very old game with fun gameplay and very difficult controls. The missions and the environment are interesting, i found myself staring at cities and landscapes quite often. The two interchanging stories Desmund and Altiar add to the game and gives a bit of the complex lore too.  The combat is challenging, taking some practise and control tinkering to get used to, the two 'stances' make things difficul wich later games don't configure wich means you have to get used to it.  One bad thing, once you complete a memory block, you cannot continue playing then choose to go to the next, it forces you to so you can't complete secondary objectives if you missed any wich i found quite annoying when i realised it.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  - takes longer to climb buildings which is in a way more realistic. - makes you feel like a real Assassin due to the need to gather information about your targets.  Cons:  - Clunky movement. - Bad AI. - Horrible combat. - Horrible story (a very repetitive one which lacks character development mostly, although Altair did eventually realise his mistakes in the end and apologised for them).  - Bad cutscenes  - Altair is arrogant for the majority of the game therefore making him an incredibly unlikeable Assassin.  Not high on my lists of good and well made Assassin's Creed games.",
            "review_score": "-1"
        },
        {
            "review_text": "Solid simple game and it's fantanstic",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game best out of all games that are out today",
            "review_score": "1"
        },
        {
            "review_text": "For a release in 2008 the game on PC holds up incredible well.   The game still looks great, and runs with no issue.  The gameplay and combat is fun, some say it’s repetitive but I didn’t every get bored with it.  Personally my favourite AC game due to its simplicity   Took me just under 12 hours to complete. ",
            "review_score": "1"
        },
        {
            "review_text": "Assassin's Creed. A decent first entry to a great franchise. This game is a solid 6/10 for me  Pros: -Great story.  -Good characters.  -Good graphics (for its time)  -Great combat and parkour  Cons: -The gameplay gets VERY repetetive after a few missions. Basically doing the same stuff over and over again with minor changes.  -There is little to no replay value due to its repetetivity and the fact that there are FAR superior entries to this franchise  -No subtitles  OVERALL: This game isn't a must-have, not even for fans of the franchise, but it's cheap, so it's worth it",
            "review_score": "1"
        },
        {
            "review_text": "The Best!",
            "review_score": "1"
        }
    ]
}