{
    "app_id": 15130,
    "name": "Beyond Good and Evil™",
    "release_date": "2008-05-13",
    "developer": [
        "Ubisoft"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Female Protagonist",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 1823,
    "negative_ratings": 186,
    "price": 4.29,
    "description": "For centuries, the planet Hyllis has been bombarded by a relentless alien race. Skeptical of her government's inability to repel the invaders, a rebellious action reporter named Jade sets out to capture the truth.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/15130/header.jpg?t=1447351297",
    "minimum_requirements": "OS: Windows&reg; 2000/XP (only)Processor: 700 MHz Pentium&reg; III, Celeron&reg;, or AMD Athlon&trade; (1 GHz recommended)Memory: 64 MB minimum, 128 MB recommended (256 MB recommended for XP)Graphics:DirectX&reg; 9-compatible 32 MB video card (specific cards supported: ATI&reg; Radeon&trade; 9700 and Pro, ATI Radeon 9000 and Pro, GeForce&trade; 4 Ti 4600/Ti 4400/MX 460/MX 440, GeForce3 and Ti500, GeForce2 GTS/MX400/MX)DirectX Version: DirectX 9.0Sound: DirectX 9-compatible sound cardHard Drive: 2.2 GB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I finished Beyond good and Evil twice,now i bought it on Steam,going to finish it for the 3rd time.such a masterpiece ...  this is a great game,even in 2015.  WE WANT BEYOND GOOD AND EVIL 2.Dumb UBI",
            "review_score": "1"
        },
        {
            "review_text": "So here's this game I played several times on the PS2, and it is SO FUN. PC is no exception.  People may have seen the camera on the box art back in the day and said to themselves 'Ew! Camera in the gameplay, no way!' Sure the camera is sometimes a necessary part of the game, but combat and stealth are major gameplay elements that shouldn't be overlooked.  The story centres on Jade and Pey'j, in a strange world where half-animal people walk around on two legs and talk. For example Pey'j has a definite boar-like appearance. The world is under siege from the Domz armada, and the Alpha Sections are there to stop them. During an attack Jade discovers she's out of credits and her lighthouse shield power is cut off. In an effort to make some credits she takes on a photography job for the local science centre, and through a turn of events ends up working for a secret underground movement called the Iris Network.  The plot is fairly straightforward - you go on missions looking for evidence, once you find the evidence you take photos of it, and then you get the hell outta there. The missions are few and large, and the best way to approach it is to go sneaky stealth mode on everything. It is possible to attack your enemies too, but you will have a hard time.  Gameplay combat is all 3rd-person, but not all of it is melee. There are battles on the water inside your 'tugboat', and towards the end of the game there is even a spaceship battle, which I thoroughly enjoyed. Enemies hit hard in melee combat though, so it pays to grab all the health upgrades you can find. These can be manually distributed to your companion too if you think they need it. As already mentioned, subterfuge is your friend - you will have more fun with sneak attacks and trickery than trying to face-tank your way though the game.  Other gameplay elements include speed-races to get your stolen credits back, minigames (that game in the Akuda Bar is badass hard), finding all the species to photograph for more credits, finding all the pearls for more vehicle upgrades. There are a couple of foot-chases too, to add whipped cream to an already delicious cake of a game.  So how delicious is it? Well the music is a blast for starters. It has a wonderful style to it, melodious and alien. Well-suited to the game. The graphics are a little bland but good - with a main character like Jade it makes sense there's a bit of a green theme to it. Voice-actors have been cast well, there is a lot of great voice-acting in the game and it helps to suspend disbelief, helping immersion and reinforcing our empathy towards the characters.  Highly recommended to anyone that loves stealth, a great story, or just wants to try something new. The hours I've played it on PC are not representative of my total hours (PC and PS2). Worth it just for the soundtrack!",
            "review_score": "1"
        },
        {
            "review_text": "Beyond Good and Evil is one of my favorite games of all time. I jumped in not expecting much, but you gain an attachment to each of the characters and the action just blows you away. It has both combat and stealth sections, plenty of interesting puzzles, and hundreds of collectables to keep you playing. Cant wait for the second game to continue this epic saga.",
            "review_score": "1"
        },
        {
            "review_text": "So why don't you own this game already? I mean seriously!? This is a wonderful action platformer with some fun stealth elements spliced together ina world full of wonder and conspiracy! It may not be the LONGEST game in the world and could def have been a few more hours but you feel satisfied when you complete it. Side missions are actually really fun and diverse and a cool plot with twists and turns. Buy it now... DO IT!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played! The story is amazing, the characters are heartwarming, funny and it's just so much fun to get through the game. Just let me say, it actually never gets boring to play that game. And it's impossible to NOT like the characters! If you are interested in good stories, neat graphics (yeah, this game is pretty old, but the graphics are also a + for the game okay!) and funny quotes as well as some good old fighting moments, then you'll have a lot of fun with that game. I also like the environment and the slighty futuristic touch in the game! :-)",
            "review_score": "1"
        },
        {
            "review_text": "It's like Jak and Dexter or Super Mario 64. It's a very good game, story is very strange though.",
            "review_score": "1"
        },
        {
            "review_text": "This game has occupied many hours of my childhood as a player, and I had the opportunity to finish it on both PlayStation 2 and on GamingPC, in total I will have played this way for at least 250 hours. The game has a story that as not too complicated has very passionate and intrigued me to finish the game for even more than once.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the great games from my later childhood, one I would play for hours and hours, even though I didn't understand the plot, the game and its mechanics where just so enjoyable, and there are some rather interesting side activities in this old open worlds game. I hope to replay it at some point so I can fully understand its deep narrative and story, but for now I can fully recommend you this game merely on the basis of its great mechanics and the gameplay enjoyable, without even remembering how the plot that I didn't really get were! So please, buy this game, for your own good.",
            "review_score": "1"
        },
        {
            "review_text": "Steam says 0 hours but I promise I've played it on Steam and obviously on PS2 back when it was out.  What an amazing game. A completely underrated classic. Originally released in 2003 and it's still as fun today as it was then. I cannot recommend this game enough and at £6.99 you are absolutely missing out if you don't buy this. A beautifully written story with loveable characters and plenty of puzzle/stealth. Difficult to get working on windows so be prepared to go googling for work-arounds and fixes, literally my only complaint.  Eagerly awaiting the sequel, stop making Assassins Creed games and give us what we want.",
            "review_score": "1"
        },
        {
            "review_text": "BGE deserves enormous praise for its characters and story, especially. Jade is such a delightfully non-cliche female lead character; other studios should study her to understand how to make female characters that aren't eye candy or whose rescue is the main goal of the manly protagonist.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely in my top 5 games of all time.   Ubisoft, please cease all production of the 'Assassin's Creed' franchise and milk this series instead!",
            "review_score": "1"
        },
        {
            "review_text": "Great story, great characters, great music, great graphics (for that time) still good and the level design is great! ",
            "review_score": "1"
        },
        {
            "review_text": "A re-release of a console based game designed for controller that doesn't actually have controller support. WHY? IT MAKES NO SENSE. Also, it appears to be buggy at certain parts. It's a shame, it looks like it was a great game. I'd recommend trying to get a console version because those are probably not as buggy.",
            "review_score": "1"
        },
        {
            "review_text": "I've been interested in Beyond Good&amp;Evil for a very long time but I never got around to picking the game up. Well, thanks to Steam I finally got a chance to try the game out for cheap, and MAN IS IT AWESOME! The game has a very intriguing storyline where, as Jade, you must use your skills as a photo-journalist...or a f***king ninja... to expose a sinister government ploy. 'Uncover the Conspiracy. Capture the Truth.' ALL the music in the game is just beautiful...seriously...DAT F**KING PIANO. Beyond Good&amp;Evil also has a great visual style, which totally makes up for the graphical limitations of it's time. While playing through it, I just fell in love with the game. I loved all the interesting characters and it's whimsical tone, and I was very engaged in the story. I enjoyed Beyond Good&amp;Evil IMMENSELY and it is easily one of my favourite games of all time. Please Ubisoft...we don't need another AC... WE NEED BEYOND GOOD &amp; EVIL 2!",
            "review_score": "1"
        },
        {
            "review_text": "It's like the guys from Rayman made a Zelda game with Metal Gear Solid stealth stuff and it came with a Pokemon Snap minigame.  Though the real selling point are the Jamacian Rhinos.",
            "review_score": "1"
        },
        {
            "review_text": "Old but still very good! I loved this game when i was young! I always tried to catch up to my brothers and sister in it and now that i'm playing it alone its just amazing!",
            "review_score": "1"
        },
        {
            "review_text": "amazing! the best singleplayer game ever",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Nice lore, and simple but interesting gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Strong female protagonist, fun gameplay, and an interesting story. If you are into casual RPGs (Zelda-esque) you will likely enjoy this game. Not a fan of the stealth section but hey, nobody's perfect.",
            "review_score": "1"
        },
        {
            "review_text": "Beyond Good and Evil is hard to describe, but it is one of th best games I have ever played. The only thing I dislike about it is that it is tragically short. It is due for a sequel sometime in the next decade. This game is at a great price now, and it is a decent PC port, so GO BUY THIS GAME NOW!",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR? Worth it if you're willing to fix this lazy version Ubisoft ♥♥♥♥ out.  Beyond Good &amp; Evil is a fantastic game, no doubt. However, it is hard to recommend in this state. Ubisoft have lazily thrown this on the Steam store and it barely works in the condition it is in. This is resolveable to a degree by following the many guides you can find online, but still, before purchase it would be wise for you to see what is involved with actually making your purchase playable, and if you don't feel comfortable with that or are unsure if you can do it, avoid.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, a bit shorter and simpler than I hoped. I expected a bit more because people love it so much. I can't stop comparing it with Jak 2 which came out around the same time. I would say Jak 2 was better on all accounts except story. I did enjoy the game a lot though so knowing that a long overdue sequel might be coming soon I suggest you pick it up and enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "While Aliens have their wishy washy war of invade, Relax for a bit Invade again, Jade a orphan and Pey’j an Pig long due for the slaughterhouse (You actually go there are at one some point) team up together to and use the power journalism to form some kind of rebellion against be invaders. Because no one really cares unless it’s on TV. It’s my favourite Ubisoft game of all time and there’s a HD copy on the console market so get that instead. ",
            "review_score": "1"
        },
        {
            "review_text": "Its a like a mash up of third person stealth/action with racing elements and free roaming world map with collectables and hidden secrets. With great writing and characters. Whilst you have played games that this takes elements from, the whole is much greater than the sum of its parts. Buy if on sale bros",
            "review_score": "1"
        },
        {
            "review_text": "One of the coolest and most engrossing games I've ever played. The more you play it, the darker it gets. Don't let the cartoony graphics and characters fool you - there is depth, heart, and great storytelling to be found in this under-the-radar gem. One of the best and most enjoyable games I've ever played. I re-visit it almost every year.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR? Worth it if you're willing to fix this lazy version Ubisoft ♥♥♥♥ out.  Beyond Good &amp; Evil is a fantastic game, no doubt. However, it is hard to recommend in this state. Ubisoft have lazily thrown this on the Steam store and it barely works in the condition it is in. This is resolveable to a degree by following the many guides you can find online, but still, before purchase it would be wise for you to see what is involved with actually making your purchase playable, and if you don't feel comfortable with that or are unsure if you can do it, avoid.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite games ever. It still looks great for a game over a decade old, the soundtrack is fantastic, the characters have a ton of personality, good voice acting, and the story is pretty engaging. The gameplay is really solid and has quite a bit of variation between combat, stealth, exploration, racing, minigames, etc. You'll probably only get 8-10 hours out of a playthrough but personally I prefer a short, focused game to one that it padded with 20 hours of tedious repetition. Had a bit of trouble with graphics flickering but the forum had a fix that took me about 5 minutes to find.",
            "review_score": "1"
        },
        {
            "review_text": "True masterpiece. I`m in love with this game since 2004. Must have!",
            "review_score": "1"
        },
        {
            "review_text": "Nicely done and fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those underrated games of old. It has a great story and while the gameplay itself is very simplistic by today's standards, it's still very enjoyable. This updated version does have a few issues with the graphics, but nothing major.",
            "review_score": "1"
        },
        {
            "review_text": "This game is unexpectedly good- fun combat, good story and great characters. If you want an even better experience and you speak Dutch, play the game in Dutch for some of the best lamest jokes you've ever heard. Man I can't believe I'm recommending people to play a game in Dutch...",
            "review_score": "1"
        },
        {
            "review_text": "I recently went back to see how this game holds up 12 years on and I must say I really enjoyed it. The stealth parts were fantastic, however the combat was easily the weakest part of the game and should not have been in there at all. You can see my full review here -         YouTube™ Video:  Beyond Good And Evil - How's It Hold Up 12 years on Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever made in the history of mankind. 10/10 infants would suckle.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a hidden gem. the story [with it's twists] and game play are actually good despite the cartoony look.  I hear they are making a sequal. SWEET!",
            "review_score": "1"
        },
        {
            "review_text": "I played this on the original Xbox many years ago, and wanted to try the game again when I found it on steam. It's even better than I can remember.",
            "review_score": "1"
        },
        {
            "review_text": "The game of my childhood :O Those feelings...",
            "review_score": "1"
        },
        {
            "review_text": "This game is very average. It has aliens kidnapping people for energy, while the government backing up the aliens in secret. The world populated with random anthroprgonic animals that for some reason speak in a jamaican ascent. The main character, Jade, has a talking pig as an uncle. So far this is a pretty average descripting of the game. The most average part of this game is that it was made by Ubisoft before they sucked.   I give this game an almost above average score of 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A platform mixed with infiltration, some spaceship/hovercraft driving scenes and you also take pictures. Pictures are cool. The combat system is easy to grasp. It reminded me of times when playing a game was a different thing, not just action buttons or an fps mixed with other stuff. No! This one makes a good job out of being simple yet challenging, with a good story on it and a great soundtrack.  Only thing I did not like was how tiring and big the first level was. However this still is a great game from an era when pressing a button meant more than seeing a pretty cutscene.",
            "review_score": "1"
        },
        {
            "review_text": "You Want A Game That Is Classical And Amazing In Every Way? This Game. Buy It.  Forget That It Is A Lazy Version. (PC Port.) Focus On The Pure Awesomeness That Is Beyond Good And Evil. A Hovercraft With Jet Propelers? A Fat Pig Called Pey'J Who Uses His Own Farts To Power Jet Boots AND Stands On Two Legs? A Boss Battle That Starts RIGHT As You Get Into The Game? YES PLEASE!  BE WEARY OF THE GAME-BREAKING FOLLOWER GLITCH. (If You Also Experience Twitchy Graphics, Look Up A Guide On How To Stop That From Happening.)",
            "review_score": "1"
        },
        {
            "review_text": "Conducting some badass journalist investigation before it becomes mainstream.  10 green-eyed beauties out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Picked up this game after seeing it mentioned by Feminist Frequency. Loved it.  Good characters. Good and quite relevant story.  It's also a pretty forgiving game, pared down to the basics that they really want you to care about. If you're looking for hardcore combat, difficult platform-jumping, etc., this is notthe game for you. Those elements are streamlined quite a bit. But the result is a very approachable game and a well-told story.",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold.",
            "review_score": "1"
        },
        {
            "review_text": "So this game is an absolute gem. One of those rare games that is amazing but somehow slips under the radar. Buy this now :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the few good heroines in a game ever. The game has great cartoonish design, nice music, it feels very French (in a good way!). Exploring the world and snapping photographs are the highpoints, the sneaking sections are the worst. Beware that the the ending sections feel unpolished and the plot ends on a cliffhanger, and until I have the game in my hand I can't be sure the sequel will ever arrive.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, interesting mechanics, ♥♥♥♥ camera control and movement, not a deal breaker unless you're easily annoyed by that sort of thing, it's a console port so only allows saving at specific location which are fairly common, more common than the houses in GTA San Andreas but still annoying when you're in a hurry to quit the game. bit out of date with the graphics card recognition but nothing game breaking, a few graphical glitches here and there but nothing that has stopped progress or my enjoyment. Very gated story progression though, gotta have enough pearls to buy the upgrades, take the right pictures first before you can get. Some times a bit vague about how things work, like the inventory and swapping upgrade items between characters. One of those games where you should really have the manual handy for some tips and tricks. I reccomend the use of a controller/gamepad. Use your 'it's an old game' standards and you'll have a fun time without getting hung up on its technical limitations.",
            "review_score": "1"
        },
        {
            "review_text": "A classic that finds itself presented to those who missed it. My advice, don't miss it again. Get it. It's a port so it going to look 'bad' but graphics don't make a game. GAMEplay makes a GAME. And this one nails it.",
            "review_score": "1"
        },
        {
            "review_text": "I really have a soft spot for this game. Despite it being more than a decade old, I enjoy it no less today than I did in my childhood. It allows for character freedom while experiencing a beautiful plot. Highly recommend,",
            "review_score": "1"
        },
        {
            "review_text": "Cheap&amp;Awesome.  Sadly a bad PC port, experiment with video settings to improve frame rate and make sure to use a gamepad (using XPadder or something akin).",
            "review_score": "1"
        },
        {
            "review_text": "A great ps2 classic and a very underrated gem. The pc port isn't good but it's still very playable but the ps2 version is far superior. If you can't play the original ps2 version its still worth playing even on pc. Waiting for the sequel since 2008 when the first trailer came out.... 8/10 (Great)",
            "review_score": "1"
        },
        {
            "review_text": "I read review on Beyond Good and Evil back in 2004 something, I've never got a chance to play it back then, since my PC was too weak. Purchased it lately to check whether that 9/10 score was right. What can I say - Gameplay is decent, its not super, yet it doesn't sucks. However story line is just astonishing! You want to figure out what happens next. I've finished the game in less than 2 days because of this. Also - it has most cure Jamaican Rhinos in videogame history. Recommended - Yes, besy 5 bucks spent on steam in 4 years. - score - 10/10. You gotta have it ",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good Ubisoft game, from a time before multiplayer replaced single player for game focus.",
            "review_score": "1"
        },
        {
            "review_text": "Another dark humor game, with mild innuendos and violents, Beyond Good &amp; Evil has to be one of Ubisoft's breathtaking,SCARY and funny games. Also think of this as Legend of Zelda, But more darker.",
            "review_score": "1"
        },
        {
            "review_text": "A classic. Loveable game world and characters.  Steam version has several problems on newer systems!",
            "review_score": "1"
        },
        {
            "review_text": "I played this game because I had heard good things about it, and I had to see for myself.  Truthfully, this PC port of the game has some minor glitchy problems, I only had random little screen glitches, but the game was still play-able. The game didn't crash for me at all, yet it kept saying my Graphic Card Drivers were out of date (They aren't) whenever I started the game up.  Now for the experience I had while playing this game was very nastolgic like. I never played this game before, yet it felt like I was right back in the Ps1-Ps2 era of console gaming. This game does have a lot to it, and one of the really great things about this game that stands out almost right away is the soundtrack.  The combat system in this game is really fun, but it doesn't expand as much as it should of. I only found one Attack powerup, but maybe I missed a hidden one somewhere.   The game is still challenging at parts.  The only downside I had with the game was learning the hard way that there is no Autosave. Save at the M-disk spots!  All in all, this game was a very fun experience and I already plan to play it through again one day.  ",
            "review_score": "1"
        },
        {
            "review_text": "Outright the best game ever made!",
            "review_score": "1"
        },
        {
            "review_text": "On of those games with a ridiculous story. Its great and you should play it. Haven't played someting this unique since psychonauts.",
            "review_score": "1"
        },
        {
            "review_text": "I've wanted to play this game for a long time and this was the first time I've actually played through it. I really enjoyed it. The story, music, and world were a joy to experience and it's nice to play a game with the early aughts levity that you so seldom get in current games.   Now, would I recommend this for the PC? ....Not necessarily, it is horribly ported. Every time I launched the game it said my graphics card drivers were out of date (they weren't) Apparently, if you run this on a newer machine, the game can't recognize your graphics card and will just pop that error up every time you launch. You can click through it to boot the game up, though. Before you do that, I would suggest going into the advanced settings (not ingame), going into the manual compatibility settings and disabling HW Vertex Processing: it's job is to bug your game out with random polygons and artifacts that make the game unplayable. From what I've read, this happens to a lot of people.  Another problem with the port, this game was designed for a controller, yet there's no controller support. If you're like me, you're going to need to faff about extensively with the control settings to get the game marginally comfortable to play. One thing that I couldn't fix was how both the mouse and WSAD keys sent the same commands when you're in a vehicle and it screws with the camera. All in all, while I got through the game fine enough, it felt like I was limping the whole way because of the poor controls.  The game itself, though, was wonderful. As I took in the music, characters, and setting of the game I was sad that this never got the trilogy it promised to be. It's got a little of everything in it, stealth, action, vehicles, mini-games, puzzles, NPC interaction; its really remarkable that all of this was in it way back in the early 2000's and I felt the experience actually aged quite well. The lightly cartoony look did the game well and avoided the 'super realistic' games pitfal of looking and playing like ♥♥♥ now. It probably won't happen, but here's to hoping for that sequel to wrap things up!",
            "review_score": "1"
        },
        {
            "review_text": "Very underrated game which came out at a bad time and thus didn't get the attention it deserved. It's full of charme, great humor, very diverse gameplay (and all the aspects well done which is seldom the case) and a very round packet: great story, nice graphics which still look good and a very interesting soundtrack. If you like games, and you haven't played this, you better pick it up now.  The only flaw (if you wanna call it that) are some of the stealth parts which can be really tricky).  9/10",
            "review_score": "1"
        },
        {
            "review_text": "hi can anyone help me.. im havin a problems with the grafics, they are mess up.. i cant show what im saying cause i cant take print screen in the game. anyone alredy had the same problem, anyone can help how i fix it? thx",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played it, play it.",
            "review_score": "1"
        },
        {
            "review_text": "What a beautiful game, you definitely need this! Finished it in about 8 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Infused with atmosphere of fairy tale, BG&amp;E is a fantastic adventure replete with beautiful soundtrack and graphic style.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game since it first came out. Give it to me on my GameCube, and make sure I don't get distracted for a good six hours, and I can 100% it no sweat.  This game means a lot to me because it features a female protagonist who knows what she values the most, and doesn't let things stand in her way. There are no shoehorned plot points to try and add extra volume to the story. Jade wants to protect her family, and that's what she does.   The running sidequest of taking pictures of every animal species on the planet is also really fun. It's really calming to know that you're helping with science, and it's a great revenue source.  I could go on and on about how much I love and adore this game, but that's not what the review feature is for. If it looks interesting, I reccomend with all my heart that you pick up this game and play it. Hopefully, you'll see how much you love it too.",
            "review_score": "1"
        },
        {
            "review_text": "Fun if a little immature.  Good gameplay like an old nintendo game.",
            "review_score": "1"
        },
        {
            "review_text": "Beyong Good and Evil is just an incredible game, the game still awesome in 2015. I've already finish the game 100% 4 times on my ps2 when I was young and I'm gonna finish it again on pc cause the game is just fabulous.  Awesome story, beautifull graphics, capricious camera sometimes but this is not disturbing, cool ending, not really a casual game, good stealth game.  Go buy it now !! Just for Mammago xP !! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game. It has all together what newdays games missing very often - good story, good script, nice puzzels, great music. Very very good game.",
            "review_score": "1"
        },
        {
            "review_text": "Hey you. Yeah you. Do you always complain about how the video game industry doesn't have enough innovation or enough unique games out there? Well stop complaining, get off your butt, and buy this ♥♥♥♥♥♥♥ game already.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game ! One of my favourite game of my childhood. The Sounds, the voice of the characters are totally perfectly. The lovely eastereggs ahh the eastereggs cupi cupp.Now in our days A lot of game's might be jealous for this game wrought parts.  Fully 10/10 everything.  (TIP : If the game textures are flicking , just turn off the hw vertex processing in advanced options tab.)",
            "review_score": "1"
        },
        {
            "review_text": "Not bad, but I forgot how obnoxious the forced stealth sections could be.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics glitches, camera and controls caqn be iffy at times but still manages to be a great game with a really good story.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games",
            "review_score": "1"
        },
        {
            "review_text": "  Its good game but i don't like black bars in this game ;P",
            "review_score": "1"
        },
        {
            "review_text": "HARDEST GAME EVER YOU CAN'T COMPLETE IT WITHOUT DYING 1000000 TIMES",
            "review_score": "1"
        },
        {
            "review_text": "+ fun camera mechanics to take pictuers of animals and monsters to earn credits and other currency + for the most part, the stealth sections are pretty enjoyable and lenient + great cast of characters + music is varied and fun to listen to + lots of stuff to find by exploring caves or locked doors around the town + the game is VERY lenient on pearl acquisition. you'll need a butt load for some sections of the game and there are places to scrounge up quite a bit of them. + story is fine. it's shallow but it gets the job done. it DOES do a good job as acting as a vehicle to give you more of a reporter/investigator role rather than pure combat. + checkpoints are more than fair. Honestly you'll be saving to avoid the game crashing and losing progress as apposed to losing a fight. Dying in any room or fight usually just places you right before the encounter.  - the most fighting you'll be doing in this game is against the camera. It's wonky, doesn't reset most of the time, and snaps you into awkward angles. - bugs. Jesus. This game is riddled with bugs. Sometimes its the AI partner freaking out but other times its more devious bugs like 'ran out of memory' and you having to restart the game. - texture issues a plenty. I couldn't get the launcher to readjust and show me settings, so I had to live with my initial settings which had textures going bonkers throughout the whole game. - the cliffhanger...  All in all it's something I think everyone should check out. The game itself is lots of fun but the running issues I noted above can slow your enthusiasm down.",
            "review_score": "1"
        },
        {
            "review_text": "Spoiler Free   It's showing its age a bit but it's still a good game. It has an interesting story with likable characters including a great, non-stereotypical protaganist. It's quite fun and the music is fantastic.   It isn't a great port though. The controls are dated and don't translate well to the PC, though they're not bad, but the camera is problematic at times, sometimes quite obnoxiously so, though it doesn't hamper the gameplay too much.   I've had various glitches while playing, such as the game telling me my drivers are out of date (Read: Nooooooppppe), and it occasionally minimizes. Your experience may vary of course.  The gameplay consists of flying, racing, combat, puzzle solving, and stealth sections. No particular facet of the gameplay is top tier nor terribly complex, but it all comes together nicely and is serviceable and enjoyable.   All-in-all, if you like fun, charming, adventure / platform games and can tolerate a few hiccups, you should definitely pick this up!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a gem, overlooked since it came out during the high-point of platforming-action-adventures. Do you like 2000's action-adventures? Photography? Stealth? Melee comat? Interesting and deep sci-fi world? Talking pigs? This game does it all, and it does it well.  My major complaint about this game is that there are checkpoints during the final boss, which has rendered my game almost uncompletable by being low on health with no items, so I've not technically finished it, but I still love the game. Do NOT look over this one just because it's old. Let Ubisoft know we deserve that sequel!",
            "review_score": "1"
        },
        {
            "review_text": "Everything that's already been said about this title is true, one of the best games I've played and even though it's getting a bit old it stands the test of time quite well. Fortunately this title wraps up its own story, it's the least they could do while were still waiting for a sequel to be announced/come out. Please Ubisoft make this happen! Also nominated this for the best use of a farm animal award. Pey'j should be awarded as well as all of the others.",
            "review_score": "1"
        },
        {
            "review_text": "Everything that's already been said about this title is true, one of the best games I've played and even though it's getting a bit old it stands the test of time quite well. Fortunately this title wraps up its own story, it's the least they could do while were still waiting for a sequel to be announced/come out. Please Ubisoft make this happen! Also nominated this for the best use of a farm animal award. Pey'j should be awarded as well as all of the others.",
            "review_score": "1"
        },
        {
            "review_text": "Please play this game",
            "review_score": "1"
        },
        {
            "review_text": "Old but gold",
            "review_score": "1"
        },
        {
            "review_text": "one of the best adventure game i ever played...",
            "review_score": "1"
        },
        {
            "review_text": "An excellent, timeless classic of a game. An excellent, emotional jurney. It may be a bit older, but the story and artistic vision shines through the ages.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, I love this game. Beyond Good &amp; Evil is great. But DO NOT buy this game for the pc. It is an insult that Ubisoft/Steam would release and sell this. As it stands it does not appear to support widescreen, controllers, and it is a bit on the finiky side with new technology. There may be some fixes out there for it, but it is still unacceptable to release a game in this state.  Hopefully Steam will release an update or a fixed version in the future, but as of now in its current condition I would avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the best game I have ever played, but it does not work so good to run this on Steam, for example:   1. All cutsins played up x2 as fast as it should.  2. the sound is too slow.  3. texture on the ground, walls and persons can blink and glitch.   I recommand to buy this game for a console. thanks for reading my review :D",
            "review_score": "-1"
        },
        {
            "review_text": "6/10. The game is good in terms of plot, but once again, like Deep Space, I cannot give a thumbs up due to the controls on PC keyboard. It became obvious that this is a controller game based on the way the character loses behind the shoulder pov and goes to side scroller type, making it extremely difficult to get the main character to perform as you want. It doesn't mean it's impossible, it's merely frustrating as heck and required repeated plays in areas due to deaths that had nothing to do with fights. I had to play the game in short bursts rather than enjoy it in consecutive sittings. So you are warned about the controls before you choose to purchase the game to play with a PC Keyboard.   Pros: -Story -Length -Music -Jamaican Rhinos  Cons: -Keyboard controls -Changing camera pov -Last boss fight with reverse controls and never-ending repeated hitting in a pattern (I clocked 31 times in a row with no effect before throwing in the towel. If I happened to have had 99 K-lives as suggested before going into the final battle, maybe I would eventually have seen the end).",
            "review_score": "-1"
        },
        {
            "review_text": "It's hard to recommend a good game that won't work on your computer. This game appears to be an old PC port of the game and has many graphic errors and is a pain to work with a controller. If you don't mind playing a good game with a lot of problems then buy away. If not then save your money and hope that Ubi actually provides the HD version of the game in the future.",
            "review_score": "-1"
        },
        {
            "review_text": "I used to be able to play Beyond Good and Evil, but since I got a better graphics card and Windows 8, I am unable to play. I wish I could play more, but this game just hasn't been maintained correctly, so I cannot get into the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Heyyo, a decent enough stealth adventure game. I can't play it though, I always have serious graphical glitches.",
            "review_score": "-1"
        },
        {
            "review_text": "A fantastic, if overrated game. It's certainly not the 'best game ever' or anything, despite what the cult following would say; but still, it's a solid adventure game in the veins of Okami, the Legend of Zelda or Sphinx and the Cursed Mummy. Definately worth a try if you either enjoy Zelda-style adventures, or haven't gotten sick of them yet.  However, this PC port is very old, very outdated, and has extreme difficulties running on modern hardware; errors such as forced 4:3, abysmal framerates, and constantly flickering textures and massive letterboxing making the game feel unplayably poor.  Available for free on Uplay, so not really worth purchasing here. Try either that, or the HD collection on 360/PS3.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, aweful port. Wonky controls, bugs, graphic glitches and no controller support. Get it on PSN instead.",
            "review_score": "-1"
        },
        {
            "review_text": "First of all, don't purchase this game on Steam unless you still have a Windows XP gaming system. There are a multitude of technical issues that will likely make it unplayable for you. So if you have an old console lying around it was on just about all of them, or play it on an emulator, Dolphin worked perfectly.  If you do put the effort into actually playing, there's not a lot to get excited about. Maybe it was a breath of fresh air in 2003 when it was released, but more than likely people only recommend it out of nostalgia.  It does play smoothly, and the pacing is nice, with some varied gameplay mechanics. The characters and world are on the verge of being interesting and lovable, but never quite gel. The plot is pretty saturday morning cartoony, and not in a good way.  If you, like me, wanted to check out a game touted as 'an underrated classic', I couldn't blame you for feeling the need to see for yourself. But if you never end up playing it, you didn't miss anything.  5.6/10",
            "review_score": "-1"
        }
    ]
}