{
    "app_id": 15160,
    "name": "Petz® Horsez® 2",
    "release_date": "2009-08-27",
    "developer": [
        "Ubisoft"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Horses",
        "Family Friendly"
    ],
    "achievements": 0,
    "positive_ratings": 76,
    "negative_ratings": 38,
    "price": 4.29,
    "description": "Saddle up for fun in a game that combines your passion for horses with thrills and adventure! You'll be rewarded for raising horses, training champions, and saving the ranch in Petz horsez 2. Raise horses from birth and learn to feed, clean, and take care of them Earn money to buy new horses and accessories by entering challenging...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/15160/header.jpg?t=1447351315",
    "minimum_requirements": "Supported OS: Windows&reg; Vista / XP (only)Processor: 1.0 GHz Intel Pentium 4 or AMD Athlon (2.0 GHz Pentium 4 or AMD Athlon recommended)Memory: 512 MB (1 GB recommended for XP and required for Vista)Graphics: 64 MB DirectX 9.0c-compliant video card (128 MB video card recommended) (see supported list*)DirectX Version: DirectX 9.0Sound: Direct X 9.0c compliant sound cardHard Drive: 6 GBPeripherals: Windows keyboard and mouse only*Video cards supported at time of release: Nvidia&#174; GeForce&#153; 4/FX/6/7/8 series (GeForce 4 MX NOT supported) ATI&#174; Radeon&#174; 8000/9000/X600-X1900/HD 2400-2900 series",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I do not recommend this. This game has one of the worst user interfaces I have ever seen in my entire life. You are required to use the arrow keys AND the mouse, for example. Even if the game allowed complete key re-mapping, it would still be clunky, hard to navigate, confusing, and unintuitive. They do not remind you how to perform actions (coming back to the game after a while? I hope you have a good memory!), the clock/time of day system is insanely confusing, navigating the world is beyond ridiculous, and the horses look like weird mutants. Get the console version instead. It's a completely different game and way, way better.",
            "review_score": "-1"
        },
        {
            "review_text": "Manliest game ever! Only a real, brutal man can play this and beat it to an end. This game combines all our favorite genres; Shooter, RPG, Adventure, you also will need some strategy if you want to became master of horses and take over da world! So, are you man enough to go out there and alike Chuck Norris make those horses your minions?  Самая мужественная игра на свете! Только понастоящему брутальный мужик способен играть в неё и пройти до конца. В конце концов игра объеденяет все наши любимые жанры; Шутер, РПГ, Адвенчура, ко всему прочему нужен стратегический клад мышления и грамотная тактика, если вы ожидаете дойти до конца, стать специалистом по лошадям и захватить мир! Итак, кто из вас достаточно брутален для этой игры, кто аки Чак Норрис способен превратить этих милых коняшек в своих злобных миньонов?",
            "review_score": "1"
        },
        {
            "review_text": "░█▀░░░░░░░░░░░▀▀███████░░░░  ░░█▌░░░░░░░░░░░░░░░▀██████░░░  ░█▌░░░░░░░░░░░░░░░░███████▌░░  ░█░░░░░░░░░░░░░░░░░████████░░  ▐▌░░░░░░░░░░░░░░░░░▀██████▌░░  ░▌▄███▌░░░░▀████▄░░░░▀████▌░░  ▐▀▀▄█▄░▌░░░▄██▄▄▄▀░░░░████▄▄░  ▐░▀░░═▐░░░░░░══░░▀░░░░▐▀░▄▀▌▌  ▐░░░░░▌░░░░░░░░░░░░░░░▀░▀░░▌▌  ▐░░░▄▀░░░▀░▌░░░░░░░░░░░░▌█░▌▌  ░▌░░▀▀▄▄▀▀▄▌▌░░░░░░░░░░▐░▀▐▐░  ░▌░░▌░▄▄▄▄░░░▌░░░░░░░░▐░░▀▐░░  ░█░▐▄██████▄░▐░░░░░░░░█▀▄▄▀░░  ░▐░▌▌░░░░░░▀▀▄▐░░░░░░█▌░░░░░░  ░░█░░▄▀▀▀▀▄░▄═╝▄░░░▄▀░▌░░░░░░  ░░░▌▐░░░░░░▌░▀▀░░▄▀░░▐░░░░░░░  ░░░▀▄░░░░░░░░░▄▀▀░░░░█░░░░░░░  ░░░▄█▄▄▄▄▄▄▄▀▀░░░░░░░▌▌░░░░░░  ░░▄▀▌▀▌░░░░░░░░░░░░░▄▀▀▄░░░░░  ▄▀░░▌░▀▄░░░░░░░░░░▄▀░░▌░▀▄░░░  ░░░░▌█▄▄▀▄░░░░░░▄▀░░░░▌░░░▌▄▄  ░░░▄▐██████▄▄░▄▀░░▄▄▄▄▌░░░░▄░  ░░▄▌████████▄▄▄███████▌░░░░░▄  ░▄▀░██████████████████▌▀▄░░░░  ▀░░░█████▀▀░░░▀███████░░░▀▄░░  ░░░░▐█▀░░░▐░░░░░▀████▌░░░░▀▄░  ░░░░░░▌░░░▐░░░░▐░░▀▀█░░░░░░░▀  ░░░░░░▐░░░░▌░░░▐░░░░░▌░░░░░░░  ░░░░░░░░░░░░░░░░░╔╗░░╔═╗░╦═╗░  ░░░░░░░░░░░░░░░░░╠╩╗░╠═╣░║░║░  ░░░░░░░░░░░░░░░░░╚═╝░║░║░╩═╝░   This game. this god damn game. It's literally the DS game that someone shoved into a computer. The textures (on high) is comparable to AOE (which passes this game by far)  It crashes before you even get to see the horses I COULD VOICE ACT THIS BETTER the story is ♥♥♥♥ dO NOT BUY THIS GAME I PROMISE YOU YOU WILL ENJOY YOUR LIFE AT LEAST 75% MORE WITHOUT IT.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is horse ♥♥♥♥. bought it for my 4 year old that loves horses. nearly impossible to move around. clunky as hell.  DO NOT BUY THIS GAME!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "i absolutly adore this game. i love the gameplay and the level up system. the whole game is just grade for 5 bucks. play it now. what are you waiting for?!!?!? mother ♥♥♥♥ing horses you cant ride!?!?!?!?! its not freaking skyrim.   lets see why this game is great and why i have this many hours put into it story line 10/10 twin towers was an inside job 9/11 the models is pretty dope 69/0  thanks for making such great bloat... i mean software. my pc thanks you  now ill go masturbate to mlp",
            "review_score": "1"
        },
        {
            "review_text": "It never ran properly on my computer. I don't recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "this is really gay coz its vista/xp only but pet cats 2 is supported on all systems i really wanted to play this one but dev are gay and probably jew mexicans",
            "review_score": "-1"
        }
    ]
}