{
    "app_id": 15190,
    "name": "Brothers in Arms: Road to Hill 30™",
    "release_date": "2008-05-13",
    "developer": [
        "Gearbox Software"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "World War II"
    ],
    "achievements": 0,
    "positive_ratings": 624,
    "negative_ratings": 100,
    "price": 4.29,
    "description": "Based on a true story. Set during the famous airdrop before the invasion at Normandy, where Sgt. Matt Baker and his squad of 101st Airborne Paratroopers were scattered over the French countryside.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/15190/header.jpg?t=1544534380",
    "minimum_requirements": "Supported OS: Windows® 2000/XP (only) Processor: 1 GHz Pentium® III or AMD Athlon™ (2.5 GHz Pentium IV or AMD recommended) Memory: 512 MB (1 GB recommended) Graphics: 32 MB DirectX® 9.0c compliant (see supported list*) DirectX Version: DirectX 9.0c (included) Sound: 16-bit DirectX 9.0c compliant sound card Hard Drive: 5 GB Peripherals: Windows keyboard and mouse only *Video cards supported at time of release: ATI® Radeon® 8500/9000/X series, NVIDIA® GeForce™ 4/FX/6 series (GeForce 4 MX not supported)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The first game in the Brothers in Arms series, (Brothers in Arms: Road to Hill 30, Brothers in Arms: Earned in Blood, Brothers in Arms: Hell's Highway, and eventually Brothers in Arms 4: The-game-gearbox-studios-will-make-when-they-get-off-their-lazy-asses-and-realise-that-their-fanbase-has-wanted-this-game-for-a-very-long-time), Brothers in Arms: Road to Hill 30 is effectively HBO's Band of Brothers the video game. If you have ever wanted a serious WWII game that tells a touching and thought-provoking story, this is it. Don't be fooled by the game's age, it's gameplay is engaging and challenging, and the story is, in my opinion, the best story ever told through the medium of video games - REALLY. If you have never played it, or the other titles, you won't understand the perfection of the story-telling that goes on in this series. To top it all off, the game is based upon real events, people, and actions, and so feels very realistic. Overall, this and the others in the series, are incredibly immersive video games, with an important, exciting, touching, gritty, at times humerous, and bleak story around the horrors experienced by the 101st Airborne 502PIR during WWII. 10/10 would rank 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is probably the best WW2 FPS ever! ",
            "review_score": "1"
        },
        {
            "review_text": "The game that started one of the best series/ game stories in the WWII era!!! A great tactical FPS with a variety in content and quite challenging too. So suprise the gaprics are good for its age along with mulitplayer still working!!  Pros: Great game. Good story line. Tactical shooter (Control your men and flank if possible) Great details/Atmosphere for its time! Multiplayer/ ONLINE/LAN!! Gameplay great skirmish  Cons: Graphical bugs.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, and a great reminder, that every MOS suports the infantry. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Wait what? What the hell? Where are all the tough American buffed up badasses that take can take all the bullets and keep trucking? Why do all the voices actors sound like teenagers? Oh... right...  great game",
            "review_score": "1"
        },
        {
            "review_text": "I highly recomend this game to people with an interest in World War 2 shooters. With it's historical accuracy depicting the events from the 101st's jump into Normandy, to their taking of Carentan and the Battle of Bloody Gulch this game is a must have. The game's main focus is leadership. With your character ranking Sergeant you must use tactics to your advantage to win firefights with the enemy. One screw up will likely result in the death of one or more of your squad members and keeping them alive will make your job a lot easier in later on skirmishes.",
            "review_score": "1"
        },
        {
            "review_text": "The best FPS I have ever played. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I remember me used to play this on the PS2 and i remember how hard it was and i rage like so crazy and when i saw this on steam i was like :O OH i soo going to get this the game has good story you should go try it out yourself  Is so good really good and plus is based on a true story",
            "review_score": "1"
        },
        {
            "review_text": "Great game...",
            "review_score": "1"
        },
        {
            "review_text": "Brother’s in arms Road to hill 30 is the first game created under the BIA franchise. Oddly I played Earned in Blood before I played this game. There is virtually nothing different between this and the sequel. Combat feels extremely shallow, it’s like rainbow six and call of duty 2 had a baby and decided to call it Brothers in Arms. The squad play is there and the WWII feel is there, but the gun battles are atrociously boring. The story is top notch and the voice acting is very convincing. If you like story-time FPS games, you’ll really enjoy this game. If you’re the COD4+ generation that loves senseless shooting nonstop don’t even bother wasting your time.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, surreak expierence! A great show of what war truly is! A good buy.",
            "review_score": "1"
        },
        {
            "review_text": "I had great memorys of this game but I don't rememeber guns missing at point blank range",
            "review_score": "-1"
        },
        {
            "review_text": "I am not a fan of this format for an FPS. I found the squad manipulation painfully tedious; suppress, flank, wash, rinse, repeat. Trying to smartly move your teams while under mortar fire was even more tedious. Then there was getting your tank to maneuver on enemy armor - flat out aggravating.  This game is so mechanically driven that I found myself not enjoying it - not even the satisfaction of completion was enough to make want to ever touch this title again.  The extra attention on cinematics and the storyline was also excessive; it seemed to simply interfere with the gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "I really loved this game back when i played it on the classic Xbox, But man, Really disappointed with the PC version... If it was the same as the xbox version, I would have written a positive review, But the PC version has destroyed my good memories with this game.....",
            "review_score": "-1"
        },
        {
            "review_text": "I have not nor will I ever play this and I am not sure why.",
            "review_score": "1"
        },
        {
            "review_text": "Play Brothers in Arms Road To Hill 30! Experience Matt Bakers tour through Normandy in first person!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. i shot a german in the eye he died yeah!",
            "review_score": "1"
        },
        {
            "review_text": "chess on the battlefield with a gripping story of collaboration, pain, and spirit.",
            "review_score": "1"
        },
        {
            "review_text": "One of the Few FPS games I have ever enjoyed. The realism is what made me love this game. The story as well in campagin is great. Even now for how old the game is its still enjoyable for myself. Graphics may not be best ever but for me just enjoy a good game from the past is just enough. Worth the buy and enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "For people looking for a slower-paced more tactical FPS, this game fits the bill nicely. A good level of challenge, some nice squad mechanics, and a great soundtrack, all come together to make this a worthwhile experience.",
            "review_score": "1"
        },
        {
            "review_text": "COMMAND YER SQUAD OF SOLDYERS N KILL DE NAZIS....but you must try this game",
            "review_score": "1"
        },
        {
            "review_text": "A phenomenal tactical shooter that still holds today. This game actually captures the feel of WWII combat, unlike Call of Duty or Medal of Honor, which simply are shooters set in WWII. The squad mechanics are deep yet extremely simple to learn and use, and the enemy AI is some of the best I've ever seen. The combat model is very realistic, with weapon recoil keeping the player from running and gunning most of the time. The health system is one of the most original things about the game; instead of you losing health gradually before dying, the game accumulates danger based on how close you are to an enemy firing, and when the danger reaches a certain level, you get shot and die. This mitigates much of the frustration involved with waiting for your health to regenerate, and establishes a realistic disparity between how much danger you're in engaging enemies close up and far away. The sound design is also ridiculously good, with patriotic melodies that really bring out that 'Murica' feel to the game, and convincing weapon noises that make you feel like you're shooting a gun. I only have two problems with the game. One is that the visuals have not aged well at all, and even for 2005 this game looks meh. The other is that sometimes I found my shots being blocked by invisible cover boundaries even though I had my sights on the enemy's helmet; this is likely a contrivance designed to make the player use flanking tactics, but it was still annoying.",
            "review_score": "1"
        },
        {
            "review_text": "The game is awsome the graphics are amazing for a 2005 tactical FPS with is rare to see games like Brothers in Arms and Ghost Recon Advaced Warfighter becouse we are able to control a squad or in some missions two squads with is nice but the servers were shutdown but theres an option to play Lan if someone whats to try out Lan mode just add me and we will try.Il give this game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "one of the best war games ever",
            "review_score": "1"
        },
        {
            "review_text": "Holds up surprising well for a game that came out ten years ago. The character interactions are great.  A good mix between RTS and FPS. If you loved the show Band of Brothers, then you will most certainly love this game. Expect a more slower paced FPS than your average shooter. And above all else, play the series in order. Don't do as some people say and just jump to the last game in the trilogy. Otherwise you will not understand anything about this game's story line.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Some personal gripes here and there, but overall fun, gripping, and epic. PLUS, my friend Katie's boyfriend looks like Hartsock.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why, but I've always like WW2 / historical shooters more than sci-fi type FPS games, BIA:RtH30 is no exception either. It's dated a little which is to be reasonably expected for a game thats over 10 years old, but it's still really enjoyable. There's a decent storyline (considering how limited WW2 is in terms of plot) and has a good range of level formats. The script and voice acting are decent and the music is well composed and fittingly marshal. The AI is a little awkward at times, and the squads don't quite seem to understand what you want them to do. 'I can't shoot over there Sarge' was a common occurrence, and I had an interesting experience with my screen rotating 90 degrees on one occasion. But its not a bad game at all. Worth picking up when its on sale. Time to try the sequels now. My score is a comfortable 7/10",
            "review_score": "1"
        },
        {
            "review_text": "  I very very much reccomend this game. It was absulutley amazing it messed with my emotions the whole time. I felt so sad an happy at times and the end is going to force to make 5 more bucks and spend it on the next. It was just i dont even know",
            "review_score": "1"
        }
    ]
}