{
    "app_id": 1520,
    "name": "DEFCON",
    "release_date": "2006-09-29",
    "developer": [
        "Introversion Software"
    ],
    "publisher": [
        "Introversion Software"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Multiplayer"
    ],
    "achievements": 22,
    "positive_ratings": 2057,
    "negative_ratings": 344,
    "price": 7.19,
    "description": "Inspired by the 1983 cult classic film, Wargames, DEFCON superbly evokes the tension, paranoia and suspicion of the Cold War era, playing on the fascinating aspects of psychological gameplay that occur during strategic nuclear warfare. You play a General hidden deep within an underground bunker.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/1520/header.jpg?t=1478098162",
    "minimum_requirements": "Recommended: Windows XP, P3-600-Geforce 2, 128 Mb RAM, 60 Mb Hard Disk, Internet connection for multiplayer games",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Do you like mass murder and nuclear holocausts? Of course you do!  The only winning move is to nuke the crap out of everything that isnt your colour.   10/10 like skyrim with thermonuclear war",
            "review_score": "1"
        },
        {
            "review_text": "Defcon is a Global Thermonuclear War simulation game. It is very fun and challenging at the same time but there is a tutorial in the begining. I would recommend this to people who like to cause chaos.  8.2/10",
            "review_score": "1"
        },
        {
            "review_text": "The only way to win is not to play it...",
            "review_score": "1"
        },
        {
            "review_text": "One of those games that is both well programmed and well made to make nuclear war just another giddy joyride. The game focuses on a world during the late 70's and early 80's, where nuclear war is taking place, and up to 6 nations can declare into it, the nations include The European union (and several other nations not currently in the EU) The USSR, (A and some parts of Kazakhstan) Asia (Not Ocenia, Australia, or Mongolia) Lain America (Not including Cuba) Africa, and North America including Canada and the United States. In order to win, you must get more points than your foes, you get points by killing each millions of people with your ICBMs, there are multiple modes, but I'm covering the stock mode. The game starts at Defcon 5, you can place Radar on your territory, Nuclear Silos (Which will shoot down enemy bombers and fighters as well as launch ICBM) and finally, military air bases that can launch Bombers with nuclear capacity, and fighters. Also during Defcon 5, you can place ships, either battleships, which focus on fighting directly at sea, Subs, which can scan the area and launch nuclear missiles (However said launch will let the rest of the players see them) and Carries, that can't fight, but can use depth charges to take out said Subs, and can also launch bombers and fighter jets. (Each jet also has some small amount of radar to let you see enemy silos and Radar) You can only place units until Defcon 3, when battle becomes more intense, and you are allowed to send jets into enemy territory to scan for military bases and whatnot. After getting to Defcon 1, Nuclear weapons are permitted, and can be launched by Bomber, Silo (Which will prevent the Silo from protecting against incoming jet, bomber, or ICBM.) After you or them launch, the entire game flashes with the warning that one of the players dared to go launch nuclear missiles, and silos (Or Subs) That are launching them will be revealed to the world, and nuclear missiles will launch, but will only be seen if it's under a general radar of a team.. A nuclear missile will destroy Radar in one hit, and air bases in two, and silos in three, also destroying half of that building's current housed warfare. (Be it be bombers/fighters or ICBMs) A missile, hitting a city, will kill half it's living population, which is usually a a couple million each hit, depending on where you strike.  Despite a majority of the community is gone, the game is still here, unlike TF2, which is aimed at multiplayer play, this can be played with well programmed AI, of which aren't generic, and actually are quite hard at times. The achieves, however, can't actually be attained form fighting bots, so you have to play online to actually get them, but due to a dwindling community, it's quite hard to find those players, so try to get friends to play if you want to competition against an actual person.",
            "review_score": "1"
        },
        {
            "review_text": "This game should be in everyone's library. It has a dark view of the global wars and what will actually happen. Game play is really slick and better with all humans, as alliance's are a big part of stratagem, when to side with someone stronger/weaker and when to finally stab them in the back. At first glance and after a couple of games, it looks easy to play, but the more you do the more thought and skill is involved.  The guys behind this game are really approachable as well.",
            "review_score": "1"
        },
        {
            "review_text": "dark, somber, and serious. Brilliant classic strategy game to play with friends.  Nuke and get nuked 9/11",
            "review_score": "1"
        },
        {
            "review_text": "DEFCON is the perfect game because nobody actually wins.",
            "review_score": "1"
        },
        {
            "review_text": "not the RTS you want, but the RTS you deserve",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommend this game for Windows.  HOWEVER, on Mac you are likely not going to be able to play as it crashes when launching on Mac.",
            "review_score": "1"
        },
        {
            "review_text": "This game is scarier than any of the horror games I've played- and it's not even a horror game!   It's a simulation/strategy game about nuclear war, if you couldn't figure that out. You nuke the enemies' cities to earn a better score, and if the enemy nukes your cities (or destroys your units), then you lose points and stuff. The team with the highest score wins. It is a very dark game, for example: you can hear people crying sometimes and when a city is hit with a nuclear missile it shows the amount of people who were killed, it's especially frightening if it's a place you live in or if loved ones live there. The soundtrack is FANTASTIC, and sets the mood of the game PERFECTLY. I'm not very good at playing the game, but you don't even have to play! You can set up AI battles, and I sometimes hop on and watch one. They're actually pretty entertaining, and the AI is good in my book. Speaking of setting things up, it's very customizable. A single game can be very time consuming if played in real-time, and the nukes take a while to reach its target. Also, when I played in real-time (and quit after ten minutes i dont have time for that) I felt like I was the one giving the OK to launch the nukes and responsible for the millions of deaths I caused, not to mention feeling guilty about my cities getting exploded by the enemies. Overall, it's a pretty good game, but it can be difficult and is very dark. Unfortunately, the last update was sometime in 2014, so it seems that the developers have stopped updating it, however it feels finished and the price is reasonable for $9.99 USD.    8/10  - Solid game.   But why is it scarier than the horror games I've played? That's because it can actually happen...",
            "review_score": "1"
        },
        {
            "review_text": "You start a game placing down your 'defenses.' You then begin to slowly deteriorate that word till it is practically a synonym for 'tools for world wide genocide.' You even get a nice little tally too of how many people are dead thanks to your negligence, even some stats come up when blowing the c**p out of a nation as to how many people were caught in the blast of your death dealing. Then you end the game knowing you have basically wiped out most of the world in unexplained, random and (if you are with friends) grudge-filled gamer rage of tossing near infinite nuclear warheads at each other.  You get a nice little 'you win' for it too.  Congratulations, 'winner.' 10/10, would nuke you again",
            "review_score": "1"
        },
        {
            "review_text": "A simple interface that feels almost too real. A truly terrifying experience.",
            "review_score": "1"
        },
        {
            "review_text": "Good game - who doesn't like nuking the crap out of someone?  However, the online multiplayer is dead. It is really hard to find a match, and when you do nobody ever speeds it up. The best part of this game is mulltiplayer (Just like Civ) because, at least in my mind, it is way more fun playing with a person you can actually talk to and strategize against - and maybe even ally with. The computers (or should I call them mindless drones?) will never befriend you, always act the same, and it always feels the same.  I personally think that it would be way better if more people played. However, the game is still fun, even in sungleplayer. Due to the deep strategy you (may) be able to incorporate in singleplayer or multiplayer, it is still a good game. More of a timekiller for me, but if I find a match its on.  I still have to recommend - maybe more people will start playing multiplayer sometome.  7/10  EDIT: Eh, more like   7.8/10 - Earth probably has too much water anyway.",
            "review_score": "1"
        },
        {
            "review_text": "buy it it's good",
            "review_score": "1"
        },
        {
            "review_text": "my fav rts of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, however CD key validation is totally broken, meaning I have essentially given the developers money to play the demo, but do they care? No, they already got my money.",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing world war 3 simulator - fun to play and can even do role play with your fellow team mates, makes it realistic",
            "review_score": "1"
        },
        {
            "review_text": "Global Nuclear War. Whats not to love?",
            "review_score": "1"
        },
        {
            "review_text": "The biggest thing this game has going for it is it's feel. When you're playing it, you really feel like a commmander in NORAD, watching the world fall apart on a screen. The music, look, and feel of this game are all really on-point. As for the gameplay, it's fun, but if you're looking at getting it, I really recommend getting your friends to play it too. This game has an alright single-player, but against other people, the tension is really palpable.",
            "review_score": "1"
        },
        {
            "review_text": "the harrowing reality of a nuclear war for a low price.  AWESOME GAME  great simplish gameplay once you get the hang of it, afterwards look at the humann cost of a victory or loss the amount of dead really hits home 8/10",
            "review_score": "1"
        },
        {
            "review_text": "The 2$ the game costs are absolutely worth it. It's a funny round based strategy game that you can play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Well I hope you are ready to be responsible for millions of deaths and you destroy many cities and prepare your own defence and navy for battle and defence but remember everybody dies but maby you can be the last to die.",
            "review_score": "1"
        },
        {
            "review_text": "Hey, have you seen the movie  Wargames ?  Do you like the board game Risk? Does winning World War 3 sound like fun to you?  This is the game for you if you answered yes.",
            "review_score": "1"
        },
        {
            "review_text": "If you've seen the move, 'Wargames' this game is perfect. It's so much fun, however at first it sort of made me fell like a mass murder.",
            "review_score": "1"
        },
        {
            "review_text": "In this game you blow up the world and try to kill as many people as possible. I'm serious.  Have a happy apocalypse!",
            "review_score": "1"
        },
        {
            "review_text": "Great game had a fuw Chrashes but the game is allot of fun. If ur a fan of the movie get this game for sure!",
            "review_score": "1"
        },
        {
            "review_text": "Nuked Mexico with a fleet of submarines. Mexico did not survive.  11/10 would nuke again",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun, if for no other reason than that you get to BLOW EVERYTHING UP.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 Played as North Korean-Africa",
            "review_score": "1"
        },
        {
            "review_text": "It Is A Amazing Game. The Music Really Fits In With The Drama Of Nuking Cities. :)",
            "review_score": "1"
        },
        {
            "review_text": "I want to recommend this game on the sheer philosophical level that games are an art form to be experienced.  This game made me feel things. As gamers we've slain zombies, killed Nazi's and even exploded innocent towns in fallout. And yet, through all the years of gore and hyperviolence this simple vectorized representation of the world has made me feel more guilt than any video game I've played. This game is unsettling to it's core and has made a huge impact on me.  The soundtrack is, in my opinion, perfection and lends a staggering amount of gravitas and torment to the game. Even when you're winning, it is disturbing to think you so easily caused 5.8 million deaths in Tokyo. In the background you hear the final gasping cough of a women as she succumbs to radiation poisoning or the cry of a mother over the death of her newborn.  Even if unintended, this game makes a moving and bold statement, all represented by a very detached and matter-of-fact way.  At least try the demo!",
            "review_score": "1"
        },
        {
            "review_text": "10/10, got to relive preteen nostalgia, along with killing millions of people. Would do this again.",
            "review_score": "1"
        },
        {
            "review_text": "Good little game to play, wont require a great deal of concentration. The music has a strange effect on you though, not even the traditional negative something bad is going to happen.  More utter despair infinite pit of nothingness that you will fall into and never escape, and if you escape there will be another one waiting on you.  I believe the score won an award. It is a good score.",
            "review_score": "1"
        },
        {
            "review_text": "Nuclear explosions. More nuclear explosions. The suspensful music of world anihilation. Easy win bois!",
            "review_score": "1"
        },
        {
            "review_text": "Worth 99 cents.. Nothing more",
            "review_score": "1"
        },
        {
            "review_text": "I really liked playing it with Putin, Kim Dzong Un and Obama every night launching nukes at each other. Very good 9/11 Dank Rating. Bless Allah",
            "review_score": "1"
        },
        {
            "review_text": "The satisfaction after nuking is great. I kept losing and losing to my freinds but when I won it was fantastic. You have to be really smart with where you place your silos, radars, air bases and ships. Also if you you are bad at the game, don`t worry its not exactly bad that you`re terrible at nuclear warfare!",
            "review_score": "1"
        },
        {
            "review_text": "Geothermonuclear war? And I get to direct it? Sign me up!",
            "review_score": "1"
        },
        {
            "review_text": "The game is good for people who kinda like slow paced games. If it was still a continued game, it would be pretty awesome to see updates!",
            "review_score": "1"
        },
        {
            "review_text": "A strange game. The only winning move is not to play.  'coughing noises'",
            "review_score": "1"
        },
        {
            "review_text": "when did i play this for seven hours what the hell",
            "review_score": "1"
        },
        {
            "review_text": "I killed two people and got nuked by China 10/10 Would vote for Trump next time",
            "review_score": "1"
        },
        {
            "review_text": "Really great game to play with friends or even strangers if you can actually find someone to play with you.",
            "review_score": "1"
        },
        {
            "review_text": "defend israel simulator 2015 is a great game  9/11",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you like to crash like greeces economy",
            "review_score": "-1"
        },
        {
            "review_text": "This is a great game, if you like to blow stuff up. Have a grudge agaisnt a country? Nuke them.",
            "review_score": "1"
        },
        {
            "review_text": "All i can say is just buy the game!!! it is worth the money for the online and is even bertter to play with some friends :)   So Just do it!! because yesterday is tommorow!! AND YOU CANT WAIT TO GET THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "the game has nukes",
            "review_score": "1"
        },
        {
            "review_text": "I launched nukes at everyone, It's America: The Game.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely funny strategic game, although it does require some training. Also, it's highly recommended to play it with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Levels of epicness are over 9000",
            "review_score": "1"
        },
        {
            "review_text": "i'm horrible at this.",
            "review_score": "1"
        },
        {
            "review_text": "A simple game, yet so enjoyable when you don't feel like being very serious.",
            "review_score": "1"
        },
        {
            "review_text": "Game crashes when you click 'tutorial'. If this is how much they care, then ♥♥♥♥ this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The tutorial crashed on me 3/3 times I tried to open it. I decided to play a game to see if I could figure out the mechanics. I did figure out the mechanics, but the game crashed right at the end. Terrible experience.",
            "review_score": "-1"
        },
        {
            "review_text": "i wanted less 'wargames' and more 'fail-safe'",
            "review_score": "-1"
        },
        {
            "review_text": "Eerie strategy game. Maybe my imagination is too vivid, but I felt guilty playing this game (which, I beleive, is what it was going for.) The game interface is so simplistic that your mind begins to wander about what you're doing, and imagaining the impact of your descisions and actions. Scary stuff.",
            "review_score": "1"
        },
        {
            "review_text": "War never change.maybe last one people dead.the world will come peace.",
            "review_score": "1"
        },
        {
            "review_text": "the main menu was pretty good",
            "review_score": "1"
        },
        {
            "review_text": "I doesnt like this genre of games, I got it as a gift.  0/10",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't really worth the buy, came as part of the Introversion Bundle or else i wouldn't have purchased it. I tried playing it but was lost the entire time.",
            "review_score": "-1"
        },
        {
            "review_text": "This game appeals to a very specific group, the most hardcore strategy-turnbased players. It's like nuclear chess. DEFCON can be hard to get into and is quite expensive for someone with a low game-budget. The immersion is nicly handled by the graphics and the amazing score. DEFCON is not easy to become good at and it can be quite difficult to find a multiplayer match. Purches when on sale and with caution.",
            "review_score": "-1"
        },
        {
            "review_text": "Literally my favourite game, my biggest fantasy is to see the bombs light up the world one day",
            "review_score": "1"
        },
        {
            "review_text": "Just doing this for the steam badge ngl",
            "review_score": "1"
        },
        {
            "review_text": "The game crashes after the first play on windows 7.",
            "review_score": "-1"
        },
        {
            "review_text": "Having issues with tutorial , I click next and taskmaster appears, using win 10 64 bit ",
            "review_score": "-1"
        },
        {
            "review_text": "Accurate representation of a Clinton 2016 presidency. Fully recommended!",
            "review_score": "1"
        },
        {
            "review_text": "this game is ridiculously hard and there doesn't seem to be much to it .",
            "review_score": "-1"
        },
        {
            "review_text": "DEFCON is an incredibly depressing, boring, bland, poorly designed, cheeky, insulting parody of real-time strategy games whose primary gameplay focuses on not having any care whatsoever for what happens during a round (read: the polar opposite of what you usually do when playing any game ever.)  Due to its extreme callousness and its abhorrent, hamfisted gameplay, DEFCON is among a small collection of software calling itself a game that actually makes me angry every second that I am playing it (the only other I can name right now is The Stanley Parable.) That is because I cannot accept that someone was actually callous and asinine enough to put untold effort into this piece of ♥♥♥♥ and put it out with their tongues firmly in their cheeks, or that there are people in the world who actually enjoy watching this game.  Note I didn't say playing this game, because that isn't really a thing you do.  Each player is assigned a general region of the world in which they may place a bunch of ♥♥♥♥ they should not condone any attachment or value to. It seems to be that the only attacks you have are battleships, submarines, silos, and aircraft, the last of which are launched from carriers and airports.  The game will begin in DEFCON 5 and eventually progress to DEFCON 1.  DEFCON 5: (Placement phase) No hostile actions are permitted; enemy units are completely invisible DEFCON 4: (Placement phase) Enemy units become visible to Radars / ships / planes DEFCON 3: Ships and planes may now attack DEFCON 2: APPARENTLY ♥♥♥♥ING POINTLESS AS NOTHING CHANGES DEFCON 1: Nukes may be launched (silos, subs) DEFCON 0: Basically if DEFCON 1 goes on for too long the war ends automatically and whoever's the least dead wins.  You will quickly find that the game WILL NOT ♥♥♥♥ING LET YOU PLACE UNITS except under incredibly specific criteria. That is, you have to click-hunt until you find a spot you can actually put something. This is most obvious when placing seacraft, because they have to be within your territory but also in fairly deep water, which is probably like 5% of your ♥♥♥♥ing territory.  The biggest problem with this game is that it is little more than a long-exposure camera simulator. You are playing on a ♥♥♥♥♥♥, nigh-unintelligible projection map based on some classic movie because creators who aren't able to make their own iconic content just poorly mooch off of someone else's already popular work (see Chris-chan, Borderlands 2's writing, etc.) You will give a few orders and then sit there and wait while their trails sloooowly fill the screen as they go do whatever the ♥♥♥♥ they're doing why do I even care in a game that tells me flat-out that nobody's going to win.  The projection map has a small problem called 'you can't see jack ♥♥♥♥'. This can be abated by toggling on or off the KIND OF IMPORTANT WHETHER THEY ARE ON OR OFF OVERLAYS that do such things as show you your radar range and where everyone's territory is, as this can affect how much the unit icons blend in with the background by shoving highlights and ♥♥♥♥ everywhere.  I wish I could write more but I cannot stand playing this hunk of YOLO crap long enough to obtain further information on it.  I honestly can't tell who this game is supposed to be marketed to. It's completely uninteresting and underwhelming in every possible way, and its message is an explicit mockery of human suffering.  Don't play this if you have any respect for games or humanity at all. It's filthy.",
            "review_score": "-1"
        },
        {
            "review_text": "Very Confusing.",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;Be me &gt;Be America &gt;Send Planes to Recon Middle East &gt; Scout Iraq &gt;see Missle silos &gt;turn into ♥♥♥♥ Cheney &gt;IRAQ HAS WMDS LAUNCH EVERYTHING AT THEM &gt;kill millions  9/11 would invade Iraq again to destroy WMDS and make the world safer.",
            "review_score": "1"
        },
        {
            "review_text": "me and my friend wanted to get the game bacause it was only 1$. but the problem is that my friend uses a mac and it doesnt work for him. we searched it up and there is nothing you can do and it happens to everyone who has a mac. I am making this review to just say that if you have a mac, don't buy this game. IT DOESNT WORK!",
            "review_score": "-1"
        },
        {
            "review_text": "It was pretty bad and confusing. A better tutorial and an updated look would have gone a long way for this game. But instead it looks like a game for the Atari 2600.",
            "review_score": "-1"
        },
        {
            "review_text": "Was psyched to finally play this game again after so long. Saw it in the sale and jumped on it. But sadly it doesn't work on Mac Sierra, not cool guys. Please sort this out or give me my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't go past the first screen for me, just constantly tells me who the BETA testers are for a game I can't play.  Good job.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks, I can't really even get detailed. I thought at worst it would be like risk or something, it's not.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game on God's green earth",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't say 'Greeting Professor Falken' when I boot up.  0/10",
            "review_score": "1"
        },
        {
            "review_text": "Classic just like in that one movie, what was it Wargames? Yeah I think so. With what Matthew Broderick, yeah I think so. Destroy the world I guess. Novelty lasts through a few games, if you can get it on sale it's worth it I suppose.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever seen the movie war games, No? Well basically its blow the crap out of everything using geo-therman nuclear warheads from one computer. This game will draw you in with up to 6 player action (one for each nation) and with battles waging anywhere from 15 minutes to 6 hours.",
            "review_score": "1"
        },
        {
            "review_text": "It is a good fun game. My one complaint is that it chrashes when you hit esc twice.   7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game i highly recommend this to anybody",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Simply, amazing. This is one of the only games, where even though I suck at it, and rarely ever win, I always come back to it for more..",
            "review_score": "1"
        },
        {
            "review_text": "If you Watched War Games and wanted to see what happened if they didnt stop the launches, then play this game and let your points rack up as you burn the world in nuclear fire! I cannot reccomend this, or even any game by introversion enough.",
            "review_score": "1"
        },
        {
            "review_text": "PYCHOOOOOOOBWAAAAAAAAARGGGGGHHHHHHHHHHDDDDd. Yeah, that's right. That's the sound of a big ol' nuclear war. This game shows ya whats what in that department.   Dogga's Top Tips: Don't play as the USA or else you'll be USAing your own grave.  I give it 470 nukes launched at New York out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Not realistic enough, Africa nuked me.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥ is this game something. It's actually not fun. Not at all. It's really great though. The game really makes you feel awful about what you're doing. It's essentially the RTS equivalent of a shooter that shows you the finest moments in the life of the guy that you just murdered.",
            "review_score": "1"
        },
        {
            "review_text": "Nuking countries and laughing whilst listening to Billy Joel 11/10 would do again!",
            "review_score": "1"
        },
        {
            "review_text": "This game is tense, really tense. It really effective protrays a cold war scenario, and the concept of mutually assured destruction.  It's both terrifying and terrifically funny (especially in multiplayer) and accomplishes its portayal of worldwide genocide and destruction through a simple map-like interface.  I think it drew inspiration from that movie with ferris bueller, but I'm always reminded of Dr. Strangelove's war room.  Quality gaem with quality atmosphere, quality gameplay and quality post-nuclear scenarious (spoiler: everyone dies)",
            "review_score": "1"
        },
        {
            "review_text": "Shall we play a game?  Love to. How about Global Thermonuclear War?  Wouldn't you prefer a nice game of chess?  Later. Let's play Global Thermonuclear War.  Fine.",
            "review_score": "1"
        },
        {
            "review_text": "DEFCON is a deceptively simple game, with minimalist grapshics, but tons of strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to kill millions of people? Yes? Well this game if for you!  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Only game that manages to scare me. The end of the world seems so easy.",
            "review_score": "1"
        },
        {
            "review_text": "its good",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games going, only though if you can invest time into learning the way to play. Its a very unique game with a unique set of players that will take you out if you dont know what your doing",
            "review_score": "1"
        },
        {
            "review_text": "It's good",
            "review_score": "1"
        },
        {
            "review_text": "It's Global Thermal Nuclear War. Never trust your allies.",
            "review_score": "1"
        },
        {
            "review_text": "nukes. how can u lose?",
            "review_score": "1"
        },
        {
            "review_text": "Launch Detected 10/10 would nuke the world again",
            "review_score": "1"
        },
        {
            "review_text": "Brilliantly simple and playable.",
            "review_score": "1"
        },
        {
            "review_text": "its slow intel you start to see the nukes. then you start to think 'hmmm i'm so screwed'",
            "review_score": "1"
        },
        {
            "review_text": "Rather unique strategy game for playing with nukes, it has really simple design and its easy to understand. Although it might get a little old after a while.  I'd rate it 6 nukes out of 10",
            "review_score": "1"
        },
        {
            "review_text": "made me feel like ♥♥♥♥ after nuking my friends country hearing the screams and people crying 10/10 wish they made a DEFCON 2",
            "review_score": "1"
        },
        {
            "review_text": "Inspired by the on-screen displays and graphics at NORAD in the 1983 film WarGames this is a pretty well made strategy simulation if you have the time and patience to set it up. It ultimately becomes depressing though as you realize what the movie already told us about nuclear war: the only winning move is not to play.",
            "review_score": "1"
        },
        {
            "review_text": "'A strange game. The only winning move is not to play.' - WarGames",
            "review_score": "1"
        },
        {
            "review_text": "A great game with great music and a great message behind it all. There's a lot of weight behind each click, could drive you MAD.",
            "review_score": "1"
        },
        {
            "review_text": "Relive you Wargames fantasies",
            "review_score": "1"
        },
        {
            "review_text": "I loved this but it died out. Too bad. It was a great game with a great soundtrack. RIP in pepperonis.",
            "review_score": "1"
        },
        {
            "review_text": "Would you like to play a nice game of Chess?",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the movie WARGAMES, you'll like and appreciate this game! Fun to play! &lt;XD",
            "review_score": "1"
        },
        {
            "review_text": "Would you like to play a game?",
            "review_score": "1"
        },
        {
            "review_text": "You play your part in conducting an unhurried nuclear holocaust depicted in simple wireframe graphics. Try to lose least.",
            "review_score": "1"
        },
        {
            "review_text": "IF YOUR INTO ACID AND WATCHING THE WORLD BEING NUKED AND EVERYONE DYING FROM RADIATION, THEN THERE IS SOMETHING SERIOUSLY WRONG WITH YOU. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Great tactical game",
            "review_score": "1"
        },
        {
            "review_text": "Relatively simple, but fun; there's a lot of strategy involved! It's a great game to play with your friends!",
            "review_score": "1"
        },
        {
            "review_text": "Some men just want to watch the world burn...",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing yet tense game, pitty that no one really plays it much now....against humans in diplomacy mode its great!",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with friends. If you enjoy strategy and/or having fun with friends, get this game. Definitely worth the cost.",
            "review_score": "1"
        },
        {
            "review_text": "Worth picking up if it's on sale as creepy 'Wargames' inspired nuclear fun",
            "review_score": "1"
        },
        {
            "review_text": "Simple game, which can last over afew mins or even a whole day. Destroying the whole planet in the process",
            "review_score": "1"
        },
        {
            "review_text": "Ever wondered if there would be a nuclear war which destroys the earth? And if there would be, how would it play out?  Well. Now you can find out.  In Defcon, the players wage a nuclear war against powerful nations and the theatre is our globe. In this atmospheric minimalistic style game you control bombers, missile silos, navy ships and submarines as you slip into your enemys terroritory and bomb their cities to oblivion.  The game can be played either casually or tournament style to spice up the excitement.",
            "review_score": "1"
        },
        {
            "review_text": "5/5 'Groundbreaking' ***** Defcon, everybody dies... Have you ever wondered what the world might look like from the monitor of an officer at NORAD? Well Defcon simulates exactly that. This game is fun, but at the same time heartbreaking and terrifying. Very few games will challenge your moral fiber like Defcon does. This is a must buy, and a must play for all gamers. After Defcon, you'll want to abolish WMDs for good.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game. It has a lot more depth than you would expect when you first look at it. And so many ways to kill millions of people. Some times you just have one of those days when the nuclear option seems the only reasonable option.",
            "review_score": "1"
        },
        {
            "review_text": "You can't really win WW3, just be less dead then your enemies. Good quick fun.",
            "review_score": "1"
        },
        {
            "review_text": "Your pants hit. 50mil lice dead.  Bomb the earth into radioactive bedrock, now featuring a nuclear armed Africa and non-playable Australia!  ♥♥♥♥ you mean I dont get to ♥♥♥♥ up australia? ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Become the next Khrushchev in this action-packed game as you kill innocent people and infuse the world with chemicals!",
            "review_score": "1"
        },
        {
            "review_text": "Annihilate the world in this eerily realistic global thermonuclear war game.",
            "review_score": "1"
        },
        {
            "review_text": "War. War never changes. And why should it? I love nuking cities!",
            "review_score": "1"
        },
        {
            "review_text": "An enjoyable RTS that builds great atmosphere and tension similar to WARGAMES.",
            "review_score": "1"
        },
        {
            "review_text": "My nukes approach Europe. I speak to my ally over voicechat, where our enemies can hear: 'Begin phase 2.' World panic ensues.",
            "review_score": "1"
        },
        {
            "review_text": "This! Go watch War Games with your dad or brother and then play this when they go to sleep. Muisc is creepy and the game is replayable. This is a good way to zonk out or play in the background; new genre?",
            "review_score": "1"
        },
        {
            "review_text": "Starkly beautiful and a surprisingly eerie soundtrack. I haven't touched multi-player, but enjoy it enough for the theming and ability to watch it play itself. Appealing in a dark way if you're of the Wargames generation.",
            "review_score": "1"
        },
        {
            "review_text": "'We forge futures out of pain and grief, Commander. The computers and the communications officers and the EV As and the displays only serve to isolate us so we can be inhuman. We're monsters, son. Cold, mechanical, rational monsters, and the only way we win is by being colder, more mechanical, and more rational than the next monster moving his little pieces on the screen.... You point, you click, and they die. It's how it works.' — Colonel Nick Parker, Tiberium Wars 'Chapter XVIII'   Defcon is a simple looking yet complex game of strategy. From the beginning you must place resources and units around the map to determine your defense game. Cluster resources or spread them out? Defend heavily populated cities first or risk losing protection for more coverage? Deploy fleets in the Atlantic or the Pacific? Each defending each area has its own unique challenges to overcome which can make for a huge amount of strategies and layouts that anybody can test.   Beyond the gameplay is the atmosphere. The very basic graphics evoke the feeling of being in a war room straight out of the movie WarGames and the slow sad music, ambient sounds of orders slowly and carefully given through the room, a weeping woman in the corner, the sound of The Lords Prayer softly played over the loudspeaker, and the low hum whenever a nuke explodes makes you feel the sheer magnitude of everything you are witnessing. You are watching the world die and YOU are making it happen. Seeing a town you grew up in disappear in a flash of light and reading the tally of the dead is downright soul-crushing.   Over all this is a very experiential and fun game for LAN parties. The only problem is that online matchmaking takes forever because of a small community. Otherwise this game is very strategic, very fun, and hauntingly beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Play this for too long and you get a call from the NSA 6/10",
            "review_score": "1"
        },
        {
            "review_text": "9.7 / 10 would nuke again. Only fun with friends.",
            "review_score": "1"
        },
        {
            "review_text": "*Game starts*  'Everyone blow up Africa!'  *Africa eliminated*  *Eveyrone proceeds to nuke each other* ",
            "review_score": "1"
        },
        {
            "review_text": "Get 3 buddies, One is general one is chatter one is leader, perfect way to win ;)",
            "review_score": "1"
        },
        {
            "review_text": "Want to kill people? YES! Want to be powerful? YES! Want cow? YES!  BUY DEFCON! RATED 4th BEST GAME IN THE MULTIVERSE IN 4024 666/1 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "Halfway through carpet bombing Europe I realized I may be missing the 'point' of the game.",
            "review_score": "1"
        },
        {
            "review_text": "DEFCON lets us all feel like we're living in the movie WarGames. The anticipation builds as the timer ticks closer to DEFCON 1. When the timer finally reaches zero, all hell breaks lose. The map becomes a spiderweb of arcing trajectories.  NEW YORK HIT - 7.5 M DEAD SEATTLE HIT - 3.2 M DEAD LOS ANGELES HIT - 5.6 M DEAD  The cold disconnection from the killing only ends when you hear it. Coughing, or is it crying? Faint and in the distance. This is the only game I've played where I've felt bad for killing someone, and I didn't even see them die.",
            "review_score": "1"
        },
        {
            "review_text": "Really great strategy game! When in resources mode you have more options available for flexibility. Rule of thumb for all gaming; the more players, the more fun. BUY IT!  8/10 (+1 for each friend playing)",
            "review_score": "1"
        },
        {
            "review_text": "Badass game, slow paced but good with friends. It reminds me of risk in a way.",
            "review_score": "1"
        },
        {
            "review_text": "If you like not understanding how this game works because the AI fleet always sinks your fleet(s) no matter HOW MANY you send against them, this game may be for you.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but only with very specific game settings. Everything else just turns into a mess. On the rare occasion you manage to get a game going with the right settings, people tend to drop out of games the second you start nuking them, which kind of ruins the fun. If you manage to get a game with the right settings, and no one quits, then some ♥♥♥♥♥♥♥ will just keep all their subs at the north pole until well after you're all dead and snatch some last second points to win.   Did I say great game? I meant best game.",
            "review_score": "1"
        },
        {
            "review_text": "I can finally live out my dream of killing most of the Earth's population through nuclear warfare.   It's fun to watch the AI destroy each other. ",
            "review_score": "1"
        },
        {
            "review_text": "Overall, I liked this game because it was fun to go back to the Cold War era and relive the atmosphere of 1980s graphics and possible nuclear annihilation. But this game barely makes onto the recommended side, because after a few times playing it, you realize it's not that fun. It's really designed to be a multi-player game, and while you can have AI's to play against, I felt like there were issues with the balance between making it challenging and making it fun to play. It seems you can tweak and adjust every parameter in the game, so you can make it easier or harder, but I feel like it's a lazy way out of designing a game to just tell the user to set it up for themselves.",
            "review_score": "1"
        },
        {
            "review_text": "its good",
            "review_score": "1"
        },
        {
            "review_text": "DEFCON: It's not about winning, It's about losing less than the enemy.",
            "review_score": "1"
        },
        {
            "review_text": "Fallout 4 without the Bethesda",
            "review_score": "1"
        },
        {
            "review_text": "Nuked all of the countries and their people Lost the game because I lost all of my people Tried again and lost even though I won Realized that's the point of the game Heard the woman crying in the result screen Felt depressed about the current world situation Wrote a 1,700 word paper on psychology  10/10 Would get intensely inspired to think about deep topics again",
            "review_score": "1"
        },
        {
            "review_text": "Stunning game, it's kind of creepy when you think that it might look a bit like that in RL.",
            "review_score": "1"
        },
        {
            "review_text": "great game if you can find a match",
            "review_score": "1"
        },
        {
            "review_text": "Inspired by the movie 'Wargames', got this game for a few bucks and well worth that much.  Simple vector graphics. Simple game mechanics. Nice ambient music. Community modding on the Introversion developer's website.  It could very well be the game of 'Global Thermonuclear War' that Matthew Broderick was playing in the movie. Or the NORAD command center. Who knows, maybe it IS the command center that your multiplayer game got linked to by mistake ;-)",
            "review_score": "1"
        },
        {
            "review_text": "An odd game that manages to provide quick, easy matches or long and drawn out conflicts in one system. Either play with bots or humans, play diplomatically or ruthlessly, bide your time and strike within seconds of Defcon 1. Any way you play, just remember that in the end; no one wins, everybody just dies.",
            "review_score": "1"
        },
        {
            "review_text": "If you love strategy games, than you should buy this game! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "  4 ",
            "review_score": "1"
        },
        {
            "review_text": "ITS REALLY AWESOME TO BLOW UP THE ENTIRE WORLD !!!",
            "review_score": "1"
        },
        {
            "review_text": "It's like they say..... learn to love the bomb.",
            "review_score": "1"
        },
        {
            "review_text": "Say you had a bad day, and your species made you feel like ♥♥♥♥. All you have to do is pick up DEFCON and nuke the ♥♥♥♥ out of everything. Stress gone.    9.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, you can even exit it and there will be a little thing in your system tray notifying you of events! It gives you a real sense of 'I'm in the control of something that could wipe out the world' feel",
            "review_score": "1"
        }
    ]
}