{
    "app_id": 15210,
    "name": "Silent Hunter® III",
    "release_date": "2008-06-13",
    "developer": [
        "Ubisoft"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Naval",
        "World War II"
    ],
    "achievements": 0,
    "positive_ratings": 685,
    "negative_ratings": 113,
    "price": 4.29,
    "description": "The king of submarine simulations returns with an all-new 3D engine, new crew command features, and more realistic WWII naval action than ever before. The movie-like graphics and simple, tension-filled gameplay make this the perfect game for the realism fanatic and the casual gamer.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/15210/header.jpg?t=1447351365",
    "minimum_requirements": "OS: Windows 2000 / XP(only)Processor: Pentium&reg; III 1.4 GHz or AMD Athlon&trade; 1.4 GHz (Pentium 4 2.0 GHz or AMD Athlon 2.0 GHz recommended)Memory: 512 MBGraphics: 64 MB (128 MB video card recommended)(see supported list*)DirectX Version: DirectX 9.0Sound: Direct X 9.0 compliant PCI cardHard Drive: 1.5 GB*Supported Video Cards at Time of Release Nvidia&reg; GeForce&trade; 3/4/FX series (GeForce 4 MX NOT supported)ATI&reg; Radeon&reg; 8500/9000 families or newer Laptop versions of these chipsets may work but are not supported. These chipsets are currently the only ones that will run this game.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game reminds me of the movie 'Das Boot'. It is a remarkable experience to play.  You would never dream putting on a pair of headphones and listening for hours on end to white noise while staring at a static screen could be fun. And the first time doing this I remember thinking 'I really made a big mistake buying this game'.  Until... there! There's a ship out there at such and such a bearing! Let's go find out what it is!  Silent Hunter III goes through the full emotional experience of extreme boredom and painstaking listenning - it's an almost Zen-like meditative state. All the way to the intensity of hitting that torpedo fire button and knowing all hell is about to break loose. Watching a ship sink and patrols on their way to take you out. And then getting a destroyer to unload depth charges and praying your sorry ♥♥♥ you'll live through it all.  If that isn't enough - there are enemy airplanes out patroling.  Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Legit review time.  Pros - Open world - Loads of upgrades/new u-boats - Nice balance between relaxing sail trips and planning/executing your attack - Large and helpfull community  - loads of mods(some large enough to be concidered complete overhauls) - free to do as you please  - Can add own music to the gamophone (add the .mp3 to the gramophome folder in the installfolder) - Easy to get in to, but plenty of room to increase difficulty (i.e. disableling auto targeting, dud torpedoes and unlimited fuel/O2  Cons - one loading screen 3mins+ (very annoying if you need to re-load in a short amount of time) - most upgrades are late in the war (last 2 years) - Has an abrubt ending ( may 1945, will not be able to dock or set sail, and cant revieuw history) - In the late game its nearly impossible to get away from enemy warships (due to better sonar tech)",
            "review_score": "1"
        },
        {
            "review_text": "October 4, 1940 My U-boat, U-105, is chasing down a radio contact of a large convoy in the area. The seas buck like an untamed bronco and the fog thick as pea soup. We run on the surface to catch up with the convoy, when suddenly... 'Contact! Merchant, close.' close? how close?... oh. *waves to the sailors on the ship's deck* ok too close DIVEDIVEDIVE!!! The small cargo ship must have radioed our position (kinda hard to miss when we're literally spitting distance off their prow), for a destroyer was bearing down on us no more than ten minutes later. We were only at periscope depth when the destroyer passed overhead, scraping our boat in the process. It circled around, beginning its sweep. ping.... ping..... Ping. Ping. Ping. 'Depth charges in the water, sir!' you know the drill ahead flank bearing 27- BAM! BAM! BAM! ♥♥♥♥. aft torpedo and diesel engine rooms are flooding. double ♥♥♥♥. I've had issues with scrapes in the past, so I had the forsight of bringing a repair officer before leaving port. As he led the repair efforts, our bow raised 45 degrees as we began to descend uncontrollably. 30 meters. 50 meters. it'll take ~3 minutes to stop the flooding 75 meters. we're sinking faster 100 meters. 150 meters. 'We're reaching critical depth, sir!' 200 meters. c'mon guys, don't let me down... 250 meters. 'We can't go any deeper, sir!' 315 meters. flooding stopped! 310 meters. oh thank god, we're ascending... 300 meters. crack. crunch. psssssshhhhhh.... FFFFFFWWWWWWWWWOOOOOOOOOOOOSSSSSSSSHHHHHHHHHHHH!!!! . . . . The Atlantic claimed 51 lives that evening, and the convoy continued untouched. (This real moment of intensity, terror, hope, and despair are brought to you by Ubisoft's Silent Hunter III and the Grey Wolves Gold mod pack, aka GWX Gold) Hopefully I'll learn from this experience (probably not) and have better luck on my next campaign. Good hunting!",
            "review_score": "1"
        },
        {
            "review_text": "REVIEW HAIKU  Forced to the surface  Vulnerable to cannon fire  Sink to the bottom",
            "review_score": "1"
        },
        {
            "review_text": "the graphics my be a little dated now but the gameplay is amazing",
            "review_score": "1"
        },
        {
            "review_text": "Timeless classic, have spent many hours playing this title.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game! It is indeed the best of the series.",
            "review_score": "1"
        },
        {
            "review_text": "Silent hunter has been a game that I have enjoyed very much.As a lad that just watched the movie Das Boot, i do have to admit I really wanted to see what it was like.",
            "review_score": "1"
        },
        {
            "review_text": "It takes some hassle, but if you buy this game, install the GWX mod, and find a way to make it full widescreen (this game was from the pre-widescreen era and has no widescreen options by default) - you'll really enjoy this game.  I don't even remember how I finally modded my way into a widescreen - I just remember it was a P.I.T.A. but worth it in the end.  To summarize: Without GWX or widescreen = not recommended. With GWX and the time spent figuring out how to widescreen = highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's kind of like dust II but underwater.",
            "review_score": "1"
        },
        {
            "review_text": "Don't bathe for a month for the complete das boot experience.",
            "review_score": "1"
        },
        {
            "review_text": "The sensation and atmospere of hunting and stalking a convoy in the atlantic, laying an ambush to sink as many mechant tankers as possible, then attempting to escape while the convoys guards now hunt you is indescribable. Silent Hunter 3 scratches an itch no other game can.",
            "review_score": "1"
        },
        {
            "review_text": "Why are you reading this? What.... you haven't bought one of the best games of all time? Please.... you're kidding me? Right?   Probably one of the greatest, if not amazing and outstounding games to ever surface (pardon the sub-themed pun there).  Don't be deceived by the cheap, Disk version like i was, absolute piece of rubbish, and will only work on the recommended OS's on the back of the case- Some hooky software programs within the instalation process prevent it from working.  That aside, the Steam version tops the charts, easy install and easy to use. Only 2 main problems (which you MIGHT) come across, with easy resolutions: - If a message, on startup, pops up saying something about failed run, or cannot run e.t.c 3D graphics (something related like that), just simply alter your screen resolution to the notch down (right click on desktop, screen resolution) simple! - If you're installing GWX, then make sure it goes to the Silent Hunter 3 Steam folder, and not the make-believe, Disk-domain 'Ubisoft folder'.     On the note of GWX, GWX Gold is highly recommended, fixes most, if not all, the bugs. Adds in more realsim and greater weather and weather-fixes, as well as more sounds, subs, ships and skin-packs for new campaignes and designs.    Easily deserves a 100 on the Metascore, and definitely a 15 out of 10 for me.   In 2 words: Simply outstanding!",
            "review_score": "1"
        },
        {
            "review_text": "(a little tricky to be played on win7)   as a sim it's maybe the best WWII option around: the kingdom of sub warfare tactics (a lot to be learned, here); visuals are not a factor, more than the experience  with Grey Wolves mod, it reaches its best",
            "review_score": "1"
        },
        {
            "review_text": "SH3+GWX mod is some of the best sim gaming I've ever had. Nothing beats lurking the atlantic, manually calculating torpedo firing solutions, dodging ASDIC destroyers, and listening to period music on your gramophone.",
            "review_score": "1"
        },
        {
            "review_text": "this is a fun game for adults",
            "review_score": "1"
        },
        {
            "review_text": "The king of submarine simulations returns with an all-new 3D engine, new crew command features, and more realistic WWII naval action than ever before. The movie-like graphics and simple, tension-filled gameplay make this the perfect game for the realism fanatic and the casual gamer.",
            "review_score": "1"
        },
        {
            "review_text": "When it comes to World War II submarine games, you'll not find one better than this. Whereas the rest of the Silent Hunter games generally fall flat on their faces, this one is well-made and very authentic. If you like tense simulation games that will require a whole lot of thinking and careful maneuvering, then this game will be a great fit for you.  Note, however, that the very authenticity of the game makes for a high learning curve. It'll take you some time to become accustomed to the game. Though becoming skilled at the gameplay is quite rewarding, be prepared for some time spent learning the game before you'll become effective at it. If you're looking for a game that won't require much time expenditure, this might not be the game for you.  All in all, this is a niche title. I don't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage compered to SH5.  Another sad fact : SH5 is way to over priced to be a 6-7 years old game.",
            "review_score": "-1"
        },
        {
            "review_text": "sink an aircraft carrier",
            "review_score": "1"
        },
        {
            "review_text": "Best Submarine Simulation ever.  If Ubisoft just transferred this game into modern graphics, it would've been awesome. Instead, they killed the franchise.  Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Best Subsim ever! Get GWX3 for it tho. Improves everything a huge lot. SH3 Commander is also a must have utility, giving you the ability to adjust pretty much everything from changing fatiuge simulation, removing it completely, to adjusting time compression limits, giving you as much as 8192 times ingame time! Historical sub availabilty dates, etc. Great utility!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would los again",
            "review_score": "1"
        },
        {
            "review_text": "Still the ultimate WW2 subsim. Patch, install the latest MODs and play in real time! Taste the salt of the sea and the terror of depth charges.",
            "review_score": "1"
        },
        {
            "review_text": "Long Games with real statagy and you must know about sub warfare to play.",
            "review_score": "1"
        },
        {
            "review_text": "A good warm up game for SH 5",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game for those who want a great simulation for german submarines of World War II.Also you dont need a good pc to run this game",
            "review_score": "1"
        },
        {
            "review_text": "Exciting. Love it to ambush an convoy. Approaching, waiting, hitting and diving away...",
            "review_score": "1"
        },
        {
            "review_text": "Worth getting but you gotta go to  www.subsim.com  to get the mods.....they are a must!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you want to feel like a real submarine commander then you'll love this game.",
            "review_score": "1"
        }
    ]
}