{
    "app_id": 15500,
    "name": "The Wonderful End of the World",
    "release_date": "2008-07-17",
    "developer": [
        "Dejobaan Games, LLC"
    ],
    "publisher": [
        "Dejobaan Games, LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie",
        "Casual"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Action"
    ],
    "achievements": 11,
    "positive_ratings": 402,
    "negative_ratings": 135,
    "price": 6.99,
    "description": "You can't save the whole world. It's going to be eaten by a mythological demon with the head of a fish. But as a puppet that absorbs all it touches, you can try to rescue as much of Earth's greatness as you can before the end arrives. In the beginning, you roam the Earth, capable of absorbing only the tiniest of objects.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/15500/header.jpg?t=1447351339",
    "minimum_requirements": "OS: Windows 2000 / XP / VistaProcessor: 1.5GHzMemory: 1GBGraphics: DX9 compatible 3D cardDirectX Version: 9.0cSound: DX9 compatible sound cardHard Drive: 220MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fun Katamari Damacy clone that's missing a lot of the charm and humor of that series. Also, it's rather short. I beat it in about an hour and a half and I failed a lot of missions (didn't get an A, but instead an A-, having to repeat some to do the last level), having to do them again.  It's by no means worth the 10 dollars in this case because of that. With a coupon, I was able to get the game for 2.50. If you can get the game for that amount, it's worth it for what it is, but the small playtime and how some of the levels work (getting stuck in between chairs, can't roll up and over things like in katamari damaci such as walls) really get in the way of me recommending it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is unfortunately the closest thing we have to Katamari Damacy on PC. It's short and low budget, but still quite a bit of fun. It even keeps the same weird music feel of the Katamari series, though in Dejobaan style. The game also allows for mouselook for much better control over your direction of movement, rather than the complex dual-stick style of Katamari. If you yearn to pick up every object in sight until you're large enough to destroy cities, yet don't own any consoles with Katamari games, this is the game to buy.",
            "review_score": "1"
        },
        {
            "review_text": "A game where you get to walk around maps and consume everything. It is simple and fun for all ages. However it takes less than 1 hour to complete all 12 levels. More than that if you want to get all achievements which will require playing the game twice.",
            "review_score": "1"
        },
        {
            "review_text": "Katamari-esque gameplay but without the great design, style and humour. Waaaaay too short. Finished in less than 2 hours. Very limited replayability. The levels are far too small and poorly designed. Would not reccomend. :(",
            "review_score": "-1"
        },
        {
            "review_text": "The little girl in me loves this game!           Yes I do eat little girls!",
            "review_score": "1"
        },
        {
            "review_text": "Оne of the best games in the world",
            "review_score": "1"
        },
        {
            "review_text": "You'll get about an hour and a half of game time in before you start replaying levels. The replay value is good on most, some I felt had patterns you needed to follow to finish it correctly (with a high score), Which really takes the feeling of free will out of it. I have only played Katamari once for about 5-10 minutes. I was super disappointed that this game doesn't incorporate any type of physics for the ball, or in this case balls; it almost makes or breaks it for me. One of the very few layers of complexity is stripped away when you no longer need to worry about having a lopsided ball. Anyone who doesn't have a ps2 and a copy of Katamari laying around, or a legal emulation of the same thing set up, this is good enough.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun, short and simple game. If you like Katamari, odds are you're going to like this too.",
            "review_score": "1"
        },
        {
            "review_text": "While some levels did feel kinda empty, the game was good fun for the 2-3 hours it took me to complete it.",
            "review_score": "1"
        },
        {
            "review_text": "Katamari Darcy in all but name, this title is certainly enjoyable - it has all the same appealing mechanics. However this is also it's criticism - it's almost identical, and short to boot. A fun way to spend a few hours, but would not spend more than a pound on it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a lot like Katamari Damacy, but without the minute-long tongue-lashing if you fail. Worth a look-see.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Katamari Damacy made for a cell phone and then ported to the PC with haste. Its buggy and the game didn't size properly on my screen. But if you look past that, you have a decent game here.  Pros: I had fun with this game. It really is an enjoyable game. It truly is the Katamari experience. While it is not the same humor and as fluent as it's predecessor. It really does capture the garbage ball concept.  Cons: It feels cheaply made. Not many levels to offer. Once you finished it, you are done. I wouldn't buy it if I was you but would play it if you got the chance. Humble Bundles are nice.",
            "review_score": "1"
        },
        {
            "review_text": "like katamari..... loves it but the music sucks.",
            "review_score": "1"
        },
        {
            "review_text": "this game has more bugs than a ♥♥♥♥ing field of bee hives that has a migration of dragon-flies swooping over-head with ants hitching on their backs.",
            "review_score": "-1"
        },
        {
            "review_text": "It's cute. I like the theme song, and it's an easy game as rolling around goes. Also there's a potato in the loading screen. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "The Wonderful End of the World is a grab-it-and-grow game similar to Katamari Damacy.  The story isn't really delved into in too much detail besides the song on the title screen. You're attempting to gather stuff up to save the world.  The gameplay provides for a fun challenge, but the game itself can be completed in a very short period of time. Getting all the possible A+ grades may take a little longer.   The controls are extremely basic. Mouse&amp;keyboard or a single analog stick on a gamepad. Note that the menu can't be controlled by the gamepad.  The video is restricted to a 4:3 screen size. I couldn't find any way to remove this restriction.  The music is a really redeeming factor in this game. A wide range of music for each level and gamemode.  There is a bug in that occasionally the 'puppet' will get trapped in the environment's objects forcing you to have to restart.  It's not the best game out there, but it is fun for a while. By all means get this game if it's on a sale. ",
            "review_score": "1"
        },
        {
            "review_text": "Well, since almost all consoles have their Katamari game, why we, PC players should be left out? And with awesome Dejobaan humour, it is as good as it can get",
            "review_score": "1"
        },
        {
            "review_text": "The Wonderful End of the World is a pretty simple casual game. The concept seemed very alien to me at first despite it's simplicity but I am told this a fairly populated genre although most of the good incarnations are apparently exclusively Asian in origin. Despite glowing recommendations from my friends of these games I am having trouble imagining any game in this genre ever being anything more than a shallow time sink. The kind of game that would probably be at home on a mobile.  The game is very simple. You run around a map consuming objects by running into them. You can only consume stuff smaller than yourself and as you consume more and more objects you become bigger and eventually starts consuming the very map itself. The game is timed and as such it is simply a question of choosing the most optimal route through the map to reach those required high scores.  There is not very much else to say about it. The graphics are not very impressive and the sounds are pretty mediocre. The music is decent however although that is mostly because it is unlikely that you will ever play this game for long enough sessions for it to become stale.  Not really a game that can be recommended as anything more than a simple time waster for when you're bored and only have 5-10 minutes to play.",
            "review_score": "-1"
        },
        {
            "review_text": "A lightweight, bright and colorful game which doesn't take itself really serious. Basically, you walk around, start small, grow bigger by collecting stuff and collect even bigger stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Hey, so that was pretty fun. A few hours spent goofing off in a silly, alternately-stylized Katamari Damacy. How much is this game going for anyway? ...TEN BUCKS? Yeah, save your money people.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just weird. You are some weird thing that obsorb things smaller than you such that you can grow bigger and obsorb even bigger objects. It's a shame the game is so extreme short (2-3 to ace all levels) since it's actually a decent fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Run around and capture anything smaller than you so you grow bigger letting you capture even bigger stuff which is now smaller than you because you are now bigger. Confused? Good. It's dumb, yet mildly fun--if that is even possible.",
            "review_score": "-1"
        },
        {
            "review_text": "its alright if you enjor the Katamari games",
            "review_score": "1"
        },
        {
            "review_text": "sadly not as good as you would think when you're basically playing a katamari knock off",
            "review_score": "-1"
        },
        {
            "review_text": "While short, the game is quite fun. You control a magic humanoid creature that absorbs any objects smaller than it. The goal is to get as big as possible within the time limit. The game is very casual, but getting the A+ rating on some maps can be difficult.  There are a few bugs, mostly with collision detection and getting too big for where you're standing. The biggest flaw, however, is that there are too few main levels.  There are two special Portal levels that add a jumping feature and are quite easily the most fun in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Dec 21st 2012 in a nutshell",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic little time waster if you don't want to invest to much into a game., has a great soundtrack too.",
            "review_score": "1"
        },
        {
            "review_text": "great game, it is simple and refreshing",
            "review_score": "1"
        },
        {
            "review_text": "Pls buy game",
            "review_score": "1"
        },
        {
            "review_text": "If you've always wanted to try Katamari Damacy but never had the opportunity, I consider this a suitable clone",
            "review_score": "1"
        },
        {
            "review_text": "I really don't know why, but I find this game fun. Well it is pretty easy but still worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Katamari except with crappy music, lousy controls, and none of the charm. So I guess it's not much like Katamari at all.",
            "review_score": "-1"
        },
        {
            "review_text": "A considerably less charming version of Katamari Damacy. The game is fairly short and there's almost zero replay value.",
            "review_score": "-1"
        },
        {
            "review_text": "If you loved Katamari Damacy, then you'll enjoy this little game.",
            "review_score": "1"
        },
        {
            "review_text": "A fun Katamari clone with a catchy soundtrack. Not as polished as the source game and quite short, but great if you need your Katamari fix.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much a cheap knock-off of Katamari Damacy... but more glitchy. Played it through in one sitting to get an achievement, which I was never even rewarded thanks to a bug. Frankly, you'd be better off buying one of the actual Katamari titles as opposed to wasting your money on this.",
            "review_score": "-1"
        },
        {
            "review_text": "Uninspired Katamari knockoff.  For some reason this game makes me moition sick as well. Don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "if you like rampaging around and absorbing stuff, then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "There is nothing wonderful about this game. Nothing. The attempt at copying Katamari Damacy was so ♥♥♥♥ poor that no negative statement could even come close to describing it. What thought that went through Valve's mind to associate this black stain of an indie game with Portal 2 must have been addled by booze or magical drugs.  But seriously - This game blows.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun and adorable. What is not to love?",
            "review_score": "1"
        },
        {
            "review_text": "Really fun indie game. It's essentially a knock off katamari, but that doesn't mean it isn't a lot of fun and a great buy.",
            "review_score": "1"
        },
        {
            "review_text": "Dejobaan's take on Katamari Damacy. Controls and music are solid; not an overly complicated game but a fun one albeit a little short.",
            "review_score": "1"
        },
        {
            "review_text": "Do you love Katimari? Do you wish there was a shorter low end graphic version of it? This is the game for you plus Achievements.",
            "review_score": "1"
        },
        {
            "review_text": "A great casual game when you run around absorbing progressively bigger items. People say it's a rip-off of another game; but that game's not here and this one is. Probably only worth it when it's on offer for a couple of £s.",
            "review_score": "1"
        }
    ]
}