{
    "app_id": 15620,
    "name": "Warhammer 40,000: Dawn of War II",
    "release_date": "2009-02-18",
    "developer": [
        "Relic Entertainment",
        "Feral Interactive (Mac/Linux)"
    ],
    "publisher": [
        "SEGA",
        "Feral Interactive (Mac/Linux)"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Warhammer 40K",
        "RTS"
    ],
    "achievements": 73,
    "positive_ratings": 5626,
    "negative_ratings": 755,
    "price": 14.99,
    "description": "With a focus on fast-action RTS gameplay, Dawn of War II brings to life the science fiction universe of Warhammer 40,000 like never before. Experience the intimate brutality of battle as you play through your chosen race’s epic campaign.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/15620/header.jpg?t=1528131592",
    "minimum_requirements": "OS: Windows XP SP2 or Windows Vista SP1                     Processor: P4 3.2 GHz (single core) or any Dual Core processor                     Memory: 1 GB RAM (XP), 1.5 GB RAM (Vista)                     Graphics: A 128MB Video Card (Shader Model 3) - Nvidia GeForce 6600 GT / ATI X1600, or equivalent                     Hard Drive: 6.5 GB of uncompressed Hard Drive space                     REQUIRED FOR MULTIPLAYER:      INTERNET: Cable modem, DSL modem, or 56.6kbps modem for online multiplayer play: Network: TCP/IP compliant network",
    "recommended_requirements": "OS: Windows XP SP2 or Windows Vista SP1                     Processor: AMD Athlon 64x2 4400+ or any Intel Core 2 Duo                     Memory: 2 GB RAM (XP and Vista)                     Graphics: A 256MB Video Card (Shader Model 3) - Nvidia GeForce 7800 GT / ATI X1900, or equivalent                     Hard Drive: 6.5 GB of uncompressed Hard Drive space",
    "reviews": [
        {
            "review_text": "3 Awesome and largley different game modes  Campaign &gt; control 4 squads, level up, find better Loot. You arent stuck with the same 4 squads either as they can be swapped for others ( dont like Scout marines, no problem, Dreadnaught?), some interesting boss battles aswell.   Last Stand &gt; 3 player controlled heros must survive against hordes of enemies, 20 waves with special boss waves, fight the Eldar , Space Marines, Imperials, Tyranids , Orks and Chaos. Level each Hero to 20, unlocking more gear as you level, Play as An ork Mek Boy, Space Marine, or Eldar Farseer.   Multiplayer PVP or Ai &gt; Small scale warfare heavily focused on tactics and stratergy, an example of what it can be like is 'Avatar of Khaine is very strong but a good opponent could kill him with a handful of troops if he isnt supported', each race can choose between 3 commanders, eldar for example can have a Seer Council Warlock, Farseer or Warp spider commander, Each commander has its own wargear to purchase in game.   All modes are enjoyable, and the game is very well made with a great ammount of detail for an RTS, that being said , last stand and campaign double up as RPG games, I often feel like playing them if I want a change from Torchlight 2 or something similar. 9/10 would highly recommend.   - Con - more could have been done for people who play the game offline, a lot of newer games seem to be very restricting to people who don't want to be online, this is no exception, although The campaign and PvsAI alone is solid enough to merit its very reasonable price tag.   ",
            "review_score": "1"
        },
        {
            "review_text": "While fun this game doesn't manage to hold my interest like Dawn of War Dark Crusade or Soulstorm. I am also loathe to call it an RTS because it departs from all of the core bits of that game type. There is no base construction at all, or unit construction. What it DOES do well is act more like a real time adaptation of the tabletop game. You command 4 squads on a map to take on various objective. Which squads you take are up to you, within the ones the game makes available, and you can go after 1 optional objective per run. Missions are scored by how you do on several factors, the better you do overall the more XP your squads get. As you level up your squads you can customize their skills and gear. The story is fairly engaging and the voice acting doesn't suck, but also feels like they tried to appeal to a more generic audience than a hardcore Warhammer 40k fan.   Really it feels more like strategy roleplaying game and less real time strategy. 3 out 5 stars imo. Definitely worth it on sale.  edit: and immediately after I post this the game decides it is going to refuse to launch for any reason, files verified as ok just stuck forever at 'preparing to launch' then it did even more weird things. Uninstall time",
            "review_score": "1"
        },
        {
            "review_text": "Very good, but not as good as the original :( The switch to squad-based dynamics rather than pure RTS is cool, but simply not as satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "Forget base building, or huge armies like DoW1.  This is Company of Heroes meets Warhammer 40k.  Which is good.",
            "review_score": "1"
        },
        {
            "review_text": "The first Dawn of War was great but this is a completely different game and no where near as good as the first one...They've basically made the maps really small and cut out base building.  If you were a fan of the first Dawn of War game don't buy this! It's tedious crap that revolves around which side can spam units the fastest. This is literally the Call of Duty of 'strategy' games.  This review will probably get a ton of down votes because the small fan base for this game worship it and attempt to silence anyone who gives it a negative review.",
            "review_score": "-1"
        },
        {
            "review_text": "Fans of the Warhammer universe rejoice! Warhammer 40k: Dawn of War II is the sequel to Dawn of War where the epic tale of the Blood Ravens continues.  Control &amp; Gameplay: Warhammer 40k: Dawn of War ll renews the Dawn of War genre by adding some new core elements. The well known base building and creation of armies have been replaced by tight squad control, where the micromanagement of these squads will lead to a successful mission. You control each squad's loadout, specialization, abilities and generally everything about them. You will also need to take heed of the terrain, where to take cover, where to move and so on. This might seem as a giant leap away from the first Dawn of War series, and it certainly is. It takes some time to become accustomed with the new game mechanics, but once you get settled, the game is quite enjoyable. In campaign mode, each mission will allow you to choose 4 specialized squads who gain XP and items by completing each mission. There is a fixed number of squads to choose from. In multiplayer, the goal is to capture points and hold them, while building additional squads to supplement your commander in battle. The only building available on the field of battle is the headquarters, from which you can spawn more troops.   The controls are accurate and function without any trouble. In multiplayer, however, if a player is experiencing lag issues, it will affect the entire match, thus rendering control of your units more difficult or even impossible, if someone has a high latency. However, this issue is not prevalent, at least not from my experience.   Fun Factor: Apart from the new style of gameplay, which can be a huge turn off for some players, Dawn of War ll is as original in its story as the previous games. The story remains rich and plays a significant part in the game, as you uncover dark secrets regarding the unknown past of the Blood Ravens.  Currently, the game is being converted to Steamworks from Games for Windows Live. Therefore, if anyone chooses to buy the game now, beware that large segments of multiplayer is currently unavailable for use.  Graphics &amp; Audio The visual aspect of the game is a continuation from the previous style: still dark and gritty, but with added details.  The soundtrack is heavy and it enhances the coarse and gritty quality of the game. For the most part, it supplements the game subliminally. After a while, I did not even notice it due to the constant shooting and blowing up of mines, detonation charges and xeno matter flying around.   Replayability: I have spent 100+ hours on this game already, so I would argue that the replayability is indeed high. Even more so with the two expansions: Chaos Rising and Retribution.  In the original Dawn of War 2, there is a campaign and multiplayer mode. Additionally, the campaign can be played both singleplayer and multiplayer through COOP, which I would highly recommend.  Furthermore, another mode was introduced, namely 'The Last Stand'. Here, a group of 3 commandos are pitted against 20 waves of unrelenting xenos. Definitely worth hours of fun and frustration.   Conclusion: Despite the fact that Dawn of War ll has moved away from the original Dawn of War games in terms of mechanics, the game still offers exciting gameplay, a well-structed narrative and solid campaign. Where the older games focused on base building and overwhelming your opponent, the new games focus on managing a handful of specialist squads. Terrain, cover and movement patterns play a larger role in succeeding missions. The game does not run optimally online yet, as the whole net client is being transferred from Games for Windows Live to Steamworks. Therefore, this is the only huge minus about the game, for the time being. This will soon change, and therefore, my rating for this game is positive - 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "The game is alright for those who enjoy commanding a squad but compare to DoW I its a bit of a shame.",
            "review_score": "-1"
        },
        {
            "review_text": "I would buy again just only for their port to Linux! And be sure, Im going to buy all DLC and content because this. Thank you a lot for giving this great game on Linux.",
            "review_score": "1"
        },
        {
            "review_text": "Genre - Games Workshop Action RTS  This series is one of the best Warhammer 40K tie-ins I have played and this is the game that started it all. WIth an immersive co-op campaign and skirmish modes. There is also the Last Stand mode, which acts as a multiplayer solo character survival mode.   This is a must have for any Games Workshop 40K fan. Ideally I would suggest getting all the Dawn of War 2 games in a set. However, don't overlook the campaign mode in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Dawn of War II is perhaps the best example of a sequel outside of StarCraft II in the RTS genre. While it tossed out Base Building for a more streamlined approach, it did so with flying colors combining Diablo style loot drops with an RPG leveling system and an extensive skill tree.  Pros: +Decent story with likeable characters +Excellent loot, weapon, armor, and class variety +Great graphics and animations that still hold up to todays standards for RTS games, especially for 2009 +TONS OF CONTENT! On top of a 20+ hour campaign that is highly replayable, you have Co-Op on top of that. (The online modes should be played exclusively on DoW II Retribution though as that has ALL the factions and the majority of the community.) +Fantastic combat with great enemy variety, boss battles, special enemy types, and lots of guns, powers, and toys to play around with +Huge open maps meant for exploration to find loot and other goodies as well as mop up any enemies to rack the experience points. +Decent mission variety with story missions being the most focused with optional Assassination and Defense missions to spice it up +The voice acting is SUPERB with some of the best game actors in the biz working it, including Steve Blum, aka Spike from Cowboy Beebop in this game as a grizzled Sniper expert +ITS WARHAMMER 40K! If you love the franchise like I do you will be splooging at all the detail, lore, and awesome stuff that helps build upon the license and makes you giddy just to feel like youre in the universe of W40K  Con: -Graphics are great overall, but there is some serious texture quality that is left to be desired, like the ground for instance -While the maps are expansive and fun to explore they repeat them CONSTANTLY in the game. It gets repeitive doing the same maps over and over, but it's the quality of the gameplay and the map design that save this unfortunate problem -Cant respec skill tree :( -Still suffers from bugs. Nothing major, but there are occasional animation bugs where units may get stuck or cant move, and enemies who get killed may fly in circles around the map. It's actually kind of funny when you see that one though -Along with repeating maps the missions themselves feel very repetitive after a while. It's the differing enemy types and awesome loot drops that encourage you to play these and save this unforunate repetition -While the writing is passable by W40K fans, most people will see it as stock and cliche. It really is the setting and license that hold it up. The characters are memorable and likeable enough, but fairly one dimensional in personality and you really need to listen to a LOT of their dialog to feel invested  OVERALL: Fantastic I mean no exageration when I award this a 9.5/10 as a W40K fan. As an RTS/RPG fan, I award it an 8.5 for those not familiar with W40K. An excellent game none the less and one of my favorite games of all time and my favorite RTS alongside StarCraft II. An easy buy. ",
            "review_score": "1"
        },
        {
            "review_text": "Having been completely obsessed with the first DoW game for years and putting in countless hours into online ranked and frantic base building and huge battles, DoW 2 came as a massive suprise to me. Although I prefer the first game, I can appreciate the change in direction and am enjoying the campaign so far.   I do feel this game is a little tedious at times (I find myself dipping into it for an hour and coming back another time) but maybe this is because, I feel, this is a game that is much more catered to a more casual approach rather than 50 minute, off the scale RTS stratergy battles.   Overall, seeing as I'd give DoW a 10/10, I feel DoW 2 deserves a 6.5. It's quite fun and the customising of your commanders is cool, but I feel like once I've completed the campaign they'll be little in the way to keep me coming back for more.  Here's to DoW3 and the return of base building. Hurrah!",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite different from the previous DoW titles. Before, they were far more like RTSs with resource collection, whereas now, think Company of Heroes but in the 40K universe.  But you also get to level up and gear the squads you want to take with you on your missions - so the perfect mix of RPG and RTS for my taste",
            "review_score": "1"
        },
        {
            "review_text": "Great game! anyone who enjoys RTS / Warhammer will love this game.  I think one of the best things is that in my current situation (that I'm sure others will find themselfs in aswell) I have moved towns and no longer able to play the table-top version with friends.  This is a nice easy way to keep playing Warhammer with friends over distance, best of all no time is spent setting up all your pieces and looking for all those lost dice!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game! Played it again after a few years and it still makes fun. :)",
            "review_score": "1"
        },
        {
            "review_text": "If Stracraft 2 is too complicated or expensive, DoW is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "This game is great and i recomend it to anyone who likes to grind and destroy!",
            "review_score": "1"
        },
        {
            "review_text": "+Good Story +Great graphics +Good replay value  +Great voice acting +Great sound effects +You can customise your army  +You serve the Emperor    You might be turned off buying this game because of how many DLCs it has, but the first installment feels complete and satisfying. Treat it something like CoH (not 2, ♥♥♥♥ 2) of which each DLC has a lot to offer.   Even if you're new to WH40K, still buy it.     ",
            "review_score": "1"
        },
        {
            "review_text": "Written: 6/6/2014  Games for Windows Live Must Die  This is a brilliant, fun game. Too bad I can't access it anymore because Games for Windows Live. That horrible, festering mess is required to even play this game and if you haven't played a game infected with GFWL's poison in a while you will find:   1) You have to go through some procedure to recover your stupid GFWL account, once you do that you will be asked to UPDATE GFWL but  2) the in-game GFWL updater won't work, in fact, it might even hang during the update because ♥♥♥♥ you 3) a manual update requires you to download Windows Live Marketplace (not Games for Windows Live because Microsoft tried to rebrand their ♥♥♥♥♥♥♥♥♥ as pigshit at some point) 4) in order to install Windows Live Market place, you have to first install Windows live id sign in assistant, which won't install.   ...in other words TRYING TO INSTALL THIS GAME IN IT'S CURRENT STATE IS NOT WORTH YOUR TIME  Games for Windows Live Must Die  The good news is that apparently Relic is working on patching this game so it can actually be played, which is a good thing for a game to be.",
            "review_score": "-1"
        },
        {
            "review_text": "Got nearly 300hrs logged with this and the add-ons. All I can say is that time after time I will come back to playing this game. Wether be it for solo, co-op or the last stand, it always brings me back. Pick it up on offer or a humble bundle and I promise you wont be dissapointed. Should be in every rpg/rts fans library.",
            "review_score": "1"
        },
        {
            "review_text": "DAWN OF WAR 11 I use to watch this game on youtube, so there was alot of hype for me... That excitement was warranted, I am terrible at the multiplayer in the same way I can't play the original dawn of war. just not my jam.  the mighty space marines campaign in DAWN OF WAR 11 fufils my want for destruction. The space marines kick so much ♥♥♥ they made theyre whole civilisation based on going to other countries and introducing democracy, I mean other planets and obliterating whatever cultures there. The role playing is strong for me, I get right into the lore of this vast galaxy and all the menacing malicious forces of evil.",
            "review_score": "1"
        },
        {
            "review_text": "A great game to play when you're bored",
            "review_score": "1"
        },
        {
            "review_text": "A masterful RTS in a much loved universe",
            "review_score": "1"
        },
        {
            "review_text": "nice game played the first game also and had many hours of fun playing alone or lan against friends in free for all battles its one game thats very good from my opinion",
            "review_score": "1"
        },
        {
            "review_text": "Really good game i would recommend it to any one who like strategy games. also get the expansion's Chaos rising and Retribution if you want some more action.",
            "review_score": "1"
        },
        {
            "review_text": "Dis is da shizzle",
            "review_score": "1"
        },
        {
            "review_text": "I've killed a lot of hours in this DOW II franchise, and enjoyed them. Todays deal is pretty awesome, you'd be a fool to miss out on it.",
            "review_score": "1"
        },
        {
            "review_text": "Warhammer 40k with RPG elements and small teams? SIGN ME UP!",
            "review_score": "1"
        },
        {
            "review_text": " 'None can stop the crusade of the righteous.'",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Strat game :)",
            "review_score": "1"
        },
        {
            "review_text": "My favorite RTS of ALL TIME.   'Why?' you may ask:  + Great RPG elements seamlessly integrated with a top-notch RTS.  + Story- and Character-Development is sublime. + Multiplayer component and DLC's are exquisitely executed.",
            "review_score": "1"
        },
        {
            "review_text": "great campangin and story line plus you can make your squads badass",
            "review_score": "1"
        },
        {
            "review_text": "Great addition to the series. A lot of fun, easy to pick up but has a lot of options and variants with the different races that you can playthrough it a few times without getting bored.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun to play and keeps you on your toes. It comes with explosively intense multiplayer real-time strategy experience with a splash of RPG added in to spice up the mix. Works great on Ubuntu 16.04 on my desktop system and my laptop.  A must have for any Warhammer 40k lover!",
            "review_score": "1"
        },
        {
            "review_text": "I'm not usually a fan of RTS games but this was a great experience",
            "review_score": "1"
        },
        {
            "review_text": "best game to get a foot in the door to the warhammer 40k universe",
            "review_score": "1"
        },
        {
            "review_text": "Dawn Of War II. The sequel of to DOW which in turn had about 3 expansions.   If you've played the original and are coming into this blind, then be ready for a shock. This doesn't play like a traditional RST game. In fact, it plays more like a Dota style squad based managment game. If you enjoy that kind of game, you'll probably have a right old time with this. The sound design is fantastic. All the guns sounds powerful and weighty, and when someone dies, it doesn't sound good. The graphis also, are a huge step up from the rather dated visuals of the original.   The story this time around isn't as memorable as the first, but a decent romp none the less. The Multiplayer still has a solid community also. However with all that said, I would reccomend skipping this one and buying 'Retribution'. It doesn't require DOWII or it's expansion to play, and includes a lot more content, and a better story.   Final thoughts: Great game, but made redudent by it's superior sequal. If you're fan of squad based, DOTA style gameplay, you might want to pic it up anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Epic. Love it so much!",
            "review_score": "1"
        },
        {
            "review_text": "If you like games like Starcraft, Starcraft II, Warcraft II, Age of Empire or the First Dawn of War. Don't get this game it's nothing like those, you will be dissapointed. If you like tactical squad based RPG's with hero's that level up and obtain items, then this game might be more your speed. The production value is high, can't be ran in borderless-windowed mode, Just know that this is not an RTS, it is a RPG with some(very few) RTS elements. Not my cup of ork slaying mayhem / 10",
            "review_score": "1"
        },
        {
            "review_text": "War. War never changes.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Lets see here: -Epic and long campaing -Aliens,Orcs and big guns -Upgradable team -A lot of side quest's -Last Stand (Also Epic) -More,Aliens and Orcs and even more big guns! But: -Less attractive classical multiplayer (In my Opinon at least) If someone like's Warhammer 40k universum (Orcs,Eldars,Aliens,big guns and Space Marines), or just EPIC strategy games, this is game for You.",
            "review_score": "1"
        },
        {
            "review_text": "The little guys say funny things.",
            "review_score": "1"
        },
        {
            "review_text": "A great game that mainly focuses on squads, none of that base building. 9/10, wish we have more squads.",
            "review_score": "1"
        },
        {
            "review_text": "Really good and easy to learn RTS.",
            "review_score": "1"
        },
        {
            "review_text": "Not a member of top-tier RTS games, but a sincere attempt to bring Warhammer 40K to the genre.   The Dawn of War series struggles from one thing more than anything else. It's not Command and Conquer and it's not Starcraft.   If you can accept that, and the extensive expansions you might need to acquire in order to play the preferred race, this game will likely keep you entertained for a number of hours.   I found the campaign to be fine from a story standpoint, but often repetitive and a bit boring when it came to actual game play.   The multiplayer mode was, oddly, lacking some level of immersion. The scale of the battles was quite underwhelming and while the resource acquisition was fine, the objectives were not enough to make up for an experience that was just not very... 40Kish.   I can recommend this game for what it is, a 40K RTS. If you are seeking some RTS experience that immerses you for hours and really give you a new take on the genre, this really isn't the game you are looking for.",
            "review_score": "1"
        },
        {
            "review_text": "Though I love RTS games, I always find myself a little lost commanding an emormous host. I wasn't quite sure what to expect when I picked up DOW II, but I must say I was pleasantly surprised. Commanding smaller groups and sheparding them through missions allows me to focus on best utilizing special abilities and keeping my men alive. My only complaint pertains to the difficulty scale, once you get past the entry level difficulty the boss fights ramp up significantly. This may just be a personal problem though and more experienced RTS players may find the additional challange enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "You can smoke weed to this",
            "review_score": "1"
        },
        {
            "review_text": "Hmm, it feels more like COH than its prequel. Good game though.",
            "review_score": "1"
        },
        {
            "review_text": "I put many highly fun hours into this game a while back. I even edited the wiki, as NEET power nerds are known to do. I never really got into the DLC that much (and holy schmidt, there's a lot of DLC now), but I remember the co-op-able campaign being a very big highlight, as well as the accessibility of the multiplayer 'melee' modes. The lack of dedicated harvesting/building units makes the fights very tactical and actiony. Hero units are a lot of fun to work with, as well. Overall it's a wonderful game with a lot of polish and plenty of content (and also loads and loads of DLC).",
            "review_score": "1"
        },
        {
            "review_text": "Dawn of War II reminds me of something of a hybrid between the addictive, yet brainless Facebook Zynga games (Farmvile, etc) and Company of Heroes. The missions are /mostly/ banal, 'kill or destroy objective X and survive' types that almost feel like MMO quests, yet the character upgrade system and decent story line compel long game sessions. Multiplayer is solid, if not a one-for-one copy of the Company of Heroes, excepting the fun yet underpopulated 'Last Stand' co-op survival mode. Be weary of the 'expansions', except for multiplayer. If you want multiplayer only, skip this and straight for Retribution, which features (almost) ALL units while forging the asinine Games for Windows Live side-program that is built in to DoWII and Chaos Rising.  I should also add that the gameplay style is a MASSIVE departure from the earlyer DoW games, which were traditional RTS games. DoWII is much more of an RPG game than RTS, and has more in common with KOTR and Baldur's Gate than DoW1 or Company of Heroes. If you want an RTS experience, look elsewhere (except multiplayer, which as I said earlier, DoW is just a Warhammer 40k version of Company of Heroes - great but not groundbreaking). If you want a decent, perhaps solid RPG experience with acceptable RTS elements, this is a great choice.",
            "review_score": "1"
        },
        {
            "review_text": "Squad-based immigration reform.  9/10   ",
            "review_score": "1"
        },
        {
            "review_text": "This the new drug",
            "review_score": "1"
        },
        {
            "review_text": "Love RTS games? Buy Dawn of War 1. This game is totally sad compared to first one. They just removed the best parts of the game, upgraded the visuals and destroyed the series. Good job man.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, too bad it has issues playing. After time i get this video error. I have exausted finding a cure. Tried forums, google it, etc. My system is running Windows 8.1 pro. Also everthing is new and a year old. If this problem did not occur, i would of for sure bought the whole series. I wish Steam would not release games that have issues. Also i ha ve not seen anyone really resolve the issues. If you are not having any problems, good for you. Enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "so just bought the pack deal and im so upset that it doesnt work installed all 3 games and it just crashes at the end of start of game video! I have a ton of steam games and this only happens with the worst of worst in terms of support and this is a 3rd party supported game low and behold doesnt load and or work. So to all be aware you may be asking for a refund for a non functional game",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun, but unstable, to the point of constant crashing on startup. Had to refund so I can't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Better than LoL!",
            "review_score": "1"
        },
        {
            "review_text": "Something I forgot about this game. It doesn't respect your time management. Not being able to save mid-mission is a crippling deficiency for casual gamers. Be prepared to commit 50 minutes to playing a mission, for better or worse, even if you make a crucial error. Because it's never worth rage-quitting, and it's counter-productive to play without being prepared to sink at least 50 minutes into a single mission. Not even any bug-free mods to fix this, either. Can only manually back up save games. Easy mode is therefore the only enjoyable mode for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I am really enjoying this game. Picked it up for 4.99. Great bargain and value so far.",
            "review_score": "1"
        },
        {
            "review_text": "I am running the Linux version and I think there is some things to work on. I think this game got great potential and I played it a lot during its initial release on Windows. However I got to give this a thumbs down because it seems like it never got patched and there are a couple of things that I find broken.  Issues: - Does not run out of the box on some Linux distros because of bad practise when defining LD_PRELOAD_ADDITIONS - The matchmaking in the game mode The Last Stand does not work. It will detect possible games but will not match you with them. This is one of the things I remember as broken since the initial release, the time to find a game in The Last Stand. However in Linux I could leave this on for 20 minutes without finding a game, even though the game presents for me that there are games available and people to match with (this is presented by the UI).  Improvements: - Options to change default keybindings. I think this is a problem with the game in general. You cannot change fundamental keybindings like the map navigation, you are stuck with the arrow keys. - No key to reset the camera angle. This is another fundamental feature that you would expect out of a game like this. If you by mistake change the camera angle you are force to either play with that angle or try to manually find that original angle.",
            "review_score": "-1"
        },
        {
            "review_text": "The Master Pack, with Chaos and Retribution, is the most disappointing purchese I have ever made. I could have could 5 games for less with the Dawn of War 1 pack. This is nothing like the first one. A wasted of money on my part.  This is not a bad game, I'm was just disappointed with it. If you want something like the orignial, look elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "I had a dream last night that Relic made a tactical game based on BATTLE BOTS and it was just like this except with more chainsaws. When I get a million dollars I'm going to hire a poor person to write this perfect game for me. Kind of like what Derek Smart did but with less NALI HEALING FRUIT.",
            "review_score": "1"
        },
        {
            "review_text": "FOR THE EMPEROR!!!!",
            "review_score": "1"
        },
        {
            "review_text": "IM FEARLESS",
            "review_score": "1"
        },
        {
            "review_text": "Solid, classic, and a standard by which other RTS games are compared.",
            "review_score": "1"
        },
        {
            "review_text": "Great gane but not really worth buying becasue of dawn of war II retribution and the fact that it still uses games for windows live.",
            "review_score": "1"
        },
        {
            "review_text": "One of the few strategy games WHERE THE CAMPAIGN IS COOP MY GODS THIS GAME IS AWESOME. Grab a friend and play one of the more complex games. Part of the franchise that has been here for awhile and would take over Starcraft anyday. For anyone looking for troop/squad based combat such as company of heroes or men of war. Warhammer dawn of war II takes away the city building aspect of the first game (though some might dislike it specifically for this change) and places down a more tactical based game. Play it!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best, top down, strategic simulation games! Great game and would recommend it to anyone thinking of buying it!! 10/10   P.S - Add me, so we can play Co-op...",
            "review_score": "1"
        },
        {
            "review_text": "8/10",
            "review_score": "1"
        },
        {
            "review_text": "7 minutes is enough for a review, right?",
            "review_score": "1"
        },
        {
            "review_text": "I keep -trying- to love this game. I loved the first DoW, but this... nah. The only redeeming quality is The Last Stand, but I don't think that's even worth the 5gb storage this game is taking up. It's not godawful, but if I want a good time playing an RTS, I'm just going back to the original Dawn of War.",
            "review_score": "-1"
        },
        {
            "review_text": "Perhaps the 'no' recommendation is a bit harsh, but as a fan of the original Dawn of War, this plays a bit more like an RPG than the insane mega-battle game that was the original. If you want to really have a party - get all the DLC's to the original. It's a more fun and flexible experience.",
            "review_score": "-1"
        },
        {
            "review_text": "I picked this up for a mere £6 in a Steam sale and BOY am I glad I did! A very refreshing slant on the slightly dated previous Dawn of War mechanic. In Dawn of War II the emphasis is on objectives, as ever, but your only tactical choices are made once at the beginning of the mission. Well worth re-installing if you already have it and WELL worth the few pounds it is currently on Steam!",
            "review_score": "1"
        },
        {
            "review_text": "I've played a couple of hours and finished the game. The plot was good and i highly recommend it if you like a dynamic and strategic and tactical games. I think that this is definitley one of my most favourite game series out there so far and hopefully they release more of warhammer becuase i'm just waiting here till the new one comes out. I would rate it 8/10, the reason why it didn't get 10/10 becuase although the plot is good the story is a bit short and is quite easy to complete. Because it only took me a couple of hours to complete which really isn't that long becuase most games with storylines take quite sometime e.g. borderlands and others. This game truely is a wonder but still requires a bit more like most games, you can't just leave it there because there's always more too add. ",
            "review_score": "1"
        },
        {
            "review_text": "bags of fun. so much fun that...well it's fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Dawn of War 1 but smaller",
            "review_score": "1"
        },
        {
            "review_text": "Warhammer and made by Relic its gunna be gud mane.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely pales to its predecessor, warps the gameplay from deep strategy to perverted adventure/ strategy with only the basest and most repetitive of factions represented. Apart from Tyranids, which was a noble effort but came across as nothing but pandering to the loudest (and fewest) of fans.  If you want a game to reinforce the stereotype of the Warhammer 40K universe being shallow drivel that revolves around Space Morons, this is the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "BROTHER I AM PINNED HERE!",
            "review_score": "1"
        },
        {
            "review_text": "&gt; Choose the robot priest guy for the Space Marines &gt; Spam scouts like theres no tomorrow &gt; Push enemy back into their base with overwelming numbers &gt; Turn the front of the enemy base into fort knox with your turret ability &gt; Kill off all your scouts and build like 8 preadtor tanks &gt; Rush that sh*t like it's Desert storm  74/10 would burn heratics again.",
            "review_score": "1"
        },
        {
            "review_text": "Can't really say much, but what I can say it's a bit ♥♥♥♥ really...",
            "review_score": "-1"
        },
        {
            "review_text": "First log on to steam. Then let it update. The Try to start Warhammer40k, then let it update. Then try to log in to Windblows Live... forget password. Log out. Uninstall game.   I am not trying to get L% security clearance for a government project. I was trying to play a freaking game. Enough!",
            "review_score": "-1"
        },
        {
            "review_text": "- More of a squad based ARPG than an RTS. Micro managing sqaud cover gets old in a hurry. Feels like an RTS someone tried to make for a console and gave up on. Multiplayer feels like having a circular argument using tiny angry people going from one capture point to another.  + It looks like a great Warhammer 40k game... I'd still love to play the RTS version sometime.",
            "review_score": "-1"
        },
        {
            "review_text": "Only thing I wanna know is why can't I play this anymore and why it was only for a week? I have it downloaded and in my library, was given the product key and everything and now I can't play it. WTF Steam?",
            "review_score": "1"
        },
        {
            "review_text": "Well this was a waste of time this is in fact not a rts more like a Squad based shooter 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "I'd rather hoped after buying it that I would enjoy it, having played DOW1, Winter Assault, Dark Crusade and a bit of Soulstorm. I didn't. Small scale and too damn complicated. Where are my builder units?! Oh, and after a massive parlava getting the damn thing installed (I had to install Microsoft Game Marketplace or whatever to get it to run on STEAM?!  10/10 would shout at it again.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ the sissy emperor.",
            "review_score": "1"
        },
        {
            "review_text": "Can't play as Chaos. Out of Sync Error. Can't build. Go ♥♥♥♥ yourself Relic.  Nice graphics btw.",
            "review_score": "-1"
        },
        {
            "review_text": "SUCKS CANT JOIN MULTI OR ONLY CAMPAIGN CUZ ACCOUNT CONNECTION LOST WTF IT EVER IS CANT EVEN ASK FOR REFUND DONT BUY!!!!!! NEVER",
            "review_score": "-1"
        },
        {
            "review_text": "Tehre is noh time to beh lohst!   Batul Brothas!   Spehss Mahrens, todeh the enemeh is at oua doar! We know oua duteh and we will do eet. We fight for our honor as Blod Rehvens,  as SPESS MAHRENS, and we fight in the nehme of the Empra!   And if we die this deh we die in gloareh, we die heroes' deffs, but we shall not die, no! It is the enemeh who will tehste  deff and defeat!   As you know! Moast of oua battle brothars are shtehtioned in SPEHSS, Pruhpeared to deep strike! Oua perimeter has been  pruhpeared in the even dat oua enehmies should be so bald and so foolish. We have plehced numerous beacons, allowing for  muhltiple, simuln-tehneous and devashtehting defensive deep strikes   The Codecks astartees nehmes this maneuvah Steel Rehn. We will descend upon the foe, we will ovawhelm them - we will leave none  alive! Meanwhile oua ground fawses will ensue the full defense of oua headkwaters   We are the spehss mahrens! WE ARE THE EMPRA'S FUREH!",
            "review_score": "1"
        },
        {
            "review_text": "Good lord is this game bad. It's just the same level over and over again. And you play as 4 different people and the AI still can't handle it! It's like they tried to be Starcraft but weren't willing to spend any money to fix it so it just ended up as a gross mess.",
            "review_score": "-1"
        },
        {
            "review_text": "As someone who loves Warhammer 40k, I wanted this game to be good. I expected it to be like the first set of Dawn of War games, and over the head build your army, and I was very dissapointed and sad to see it wasn't. I wish I had not spent the $20 (which is a little over-priced if you ask me) on this game.   If you're looking for something like Dawn of War: Soulstorm, do not look here.",
            "review_score": "-1"
        },
        {
            "review_text": "It is like a normal RTS, but actually fun.",
            "review_score": "1"
        },
        {
            "review_text": "Without the base building of this game's predecesors, DOW2 gets really repetitive and focuses of MOBA style rushing.",
            "review_score": "-1"
        },
        {
            "review_text": "A Great game but it features a slew of terrible AI design and the worst mission design but god damn great gameplay",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "i really enjoyed it. its almost like warcraft",
            "review_score": "1"
        },
        {
            "review_text": "why is this in my library",
            "review_score": "1"
        },
        {
            "review_text": "an awsome startegy game in all asppects. it's single player is really fun and is faced pased. the multiplayer is intense and has a lot of tactics. you'll need to carefully manage every single squad you have. there will never be a simple 'amass lots of units of one type and crush the opponent' the grahpics and physics engine add a lot to the experience.  what's great about this game as well is that you can fully enjoy it even if you have it's expansion packs. each has their own uniqe campeign and gameplay mechanic.  it is very satisfying in singleplayer to lead and coordinate your 4 squads of cyborg heroes to destroy armies of alien scum, setting up your squads to cover each other right and fight the enemy from the right angle can be challanging but very rewarding. managing your special items that you have collected in each misson to power up your squads to their fullest potential is also great.  the multiplayer is just as good, instead of the old fashion base building game you mainly only control units. instead of crushin the opponent's base you need to secure victory points and hold them long enough. counter each opponents units that he sends against you and learn to quickly adapt to the situation, because it will constantly change. upgrading your units in the heat of battle and deploying all of their awesome abilities makes the multiplayer frantic, chaotic but stratigic and smart none the less  a must have for either WH40K, RTS or even RPG fans...",
            "review_score": "1"
        },
        {
            "review_text": "S.H.I.T.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing blows, buy dow 1 instead, i just saved u allot of money",
            "review_score": "-1"
        },
        {
            "review_text": "  If you like multiplayer games then this is not a great game for you. A game which i really enjoy is Counter Strike: Global Offensive, This game has over 100 million players.",
            "review_score": "-1"
        },
        {
            "review_text": "cant believe the future of this awesome IP is uncertain!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, cool storyline, and excellent graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Is rly spess mareen",
            "review_score": "1"
        },
        {
            "review_text": "its a nice go but wouldnt come back alot",
            "review_score": "1"
        },
        {
            "review_text": "ive played dawn of wars for years a big fan this game is different from the first dawn of wars. It capture the warhammer universe to perfection.",
            "review_score": "1"
        },
        {
            "review_text": "Squad based shoot-'em-up. Plenty of gratuitious violence and gore. Better than the first one.",
            "review_score": "1"
        },
        {
            "review_text": "Decent squad based rts. Nails the setting perfectly.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a great RTS/RPG hybrid with a quite good story in the warhammer universe. A must for WH40k fans and even for those who still don't know the warhammer universe",
            "review_score": "1"
        },
        {
            "review_text": "Space marines ready to strike! For lovers of Warhammer 40k -&gt;&gt; necessity!!!",
            "review_score": "1"
        },
        {
            "review_text": "cant even start the game up anymore it crashes right away ",
            "review_score": "1"
        },
        {
            "review_text": "Heck yeah, great game! Fun campaign (some of the missions take a really long time though, sadly), and best of all; Last Stand! Last stand is a great co-op mode pitting 3 allies against waves of assorted &amp; varied enemies. Awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Great sequel to the original DoW.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games i have ever played. Any Pc Player above 20 should try this.",
            "review_score": "1"
        },
        {
            "review_text": "If you like a mix of RPG and RTS, then this is for you. Cover-based strategy mixed with unit abilities and items found throughout the game. Single-player is pretty good considering the franchise's history, but the multiplayer is dynamic, complex, and loads of fun.  Only downside was this wasn't a game about Chaos. (Sorry Chaos Rising, but the Black Legion sucks!)",
            "review_score": "1"
        },
        {
            "review_text": "Great squad based combat with plenty of troop options.",
            "review_score": "1"
        },
        {
            "review_text": "The Dawn of War 40k series of RTS games have always included hundreds of units battling it out in a variety of settings and environments. Now, DOWII offers a more squad-focused style of gameplay, with the single player campaign never allowing more than a dozen or so units to be controlled. While singleplayer is interesting, cinematics are rare and explanation of events can be crude.  The Good Graphics. A huge leap from the 1st generation of DOW games. Smoke, gunfire, enviroment, explosions, look good for an RTS. Cover. More complex (and realistic) means a more strategic use of units is required. Campaign. Although not always straight forward, you have more control over the choices avaliable, i.e, where, when you deploy.  The Bad Scale. DOW games have always been of huuuuge scale. Going to squad sized armies is dissapointing. Storyline. Not always clear why you are fighting in a region.  Repetitive. Combat is almost the same everytime. Pace. Much slower  Score: 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "dowII what lends it, the varoius armies and different launch strategies, teamwork , especially",
            "review_score": "1"
        },
        {
            "review_text": "This is pure RTS candy for any Warhammer 40K fan.",
            "review_score": "1"
        },
        {
            "review_text": "'old but gold' comes to mind, when i need to tell someone my impression about this game. do you like the idea of elfs, orcs, monsters, witches and other fantasy creatures? do you like heavy armor, big guns, and chainsaw-swords? or are you the rpg loveing type, who likes growing and equiping a character in different ways, and with different armor, weapons, etc., while having a wonderfull interesting story about survival, fighting back, and being overrun with a mix of action and strategic gameplay? well if anything of this is true, give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisinigly multi-layerd gameplay for an RTS. A persistent squad of specialized units, which gain levels, equipment, talents, etc. It's like mixing Diablo with Warcraft - definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's back, and now its time for me to review it. It dosn't really continue the first ones story so if you want story of gabriell(i know i spelt it wrong)then go to retribution instead.   THEY REMOVED BASE BUILDING. Yes that's right, although now you end with instead of a small army you now have a group of space marine bad asses, you can now relate to them like i remember that one time he carried the Armour Of The Destroyer(actual armour name)or he almost died once which is brilliant for campaign but horrible for skirmish.Because there's no base building meaning you have ONE HQ that spawns units meaning it's bassicly tug of war only now its actual war.They added last stand mode which is actually neat and I am so glad they REMOVED GAMES FOR WINDOWS LIVE!I wrote the worst review about this game when it had but anyway this review,It's bassicly warhammer in tug of war only with resource nodes like requistion pts and power pts.  The story. Sub Sector Aurelia(the blood raven training worlds)has had a WAAAGH! and now you have to stop it, you make your own commander so you can be a space marine(you know what i mean)but its not that simple, we got Eldar and a completely new race.....The Tyranids(the bug like creatures for WH 40k a bit like zerg from sc2)but they removed tau, NECRONS,dark eldar,cant play as chaos without dlc, my favourite IG.   Summary If you want a more traditional rts then get DOW DC if you want more rpg elements this is the one for you, i give an 8/10  its a good game dont get me wrong but skirmish just ends being really slow and you might see people like angelos or davian thule but thats about it, we get little reminders like boreale or how davian thule lost his eye but honestly, i wanted more.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and i wish more played",
            "review_score": "1"
        },
        {
            "review_text": "If you are friend of RTS games and macho BS, this is perfect for you! Send your women and kids away and let your guns do the talking! ;-)",
            "review_score": "1"
        },
        {
            "review_text": "If you loved the gameplay for Dawn of War, then you will likely hate this game. Its gameplay is minimilstic and extremely boring.  DoW had actual missions with varying objectives. DoW2's missions are pretty much all the same. Go here, capture this point, then kill the boss. Rinse and repeat until you're dead enough inside that you need to be entombed in a dreadnought. The only break from this monotomy is the occasional defend missions, which are much more enjoyable than the actual campaign missions.  Visually and thematically, the game delivers. Space Marines still look awesome, Orks still look like a bunch of Incredible Hulks that got way into crust punk, and the Eldar still look like teched up Space Elves. Most notably, DoW2 brings the Tyranids to the franchise, which are great looking and have wonderful animations.  However, even the niceties of the game can't save it from the ihghly reptitive missions and the lackluster game mechanics. Even the RPG dressings don't really help.  You only get 4 squad members to deploy on each mission, one of which is always the force commander. So, really, you only get to choose three members of the squad. Choices are: Force Commander, Tactical Squad, Assualt Squad, Heavy Weapons Squad, Dreadnought, and Scout Squad. Once you deploy into the mission, you don't build bases or anything like that. You simply slowly saunter your squads around the map and kill things until you reach the boss. There are points to capture which can replensihg your squad and give you bonuses later on.  After you finish your missions, you get rated on how many enemies you killes, how quickly you completed the map, and how much stuff you captured. XP points allow you to level up squads and give them points to unlock various abilities. You will also find new armor and weapons, with varying stats, for your squads to equip.  I'm sure some love this game simply because it's WH40k. I found this to be an extremely dissapointing sequel. The combat is boring. It's the same crap over and over. Another player in Co-Op means that you control less squads instead of there being more squads. (ie: instead of each player controlling 4 squads, each player controls 2 squads)  If you like building forward bases, tricking the enemy with emplacements, and building up large armies, then you will be completely devistated by this game. None of that is available. Even the Orks feel like their armies are increibly minimalistic and underwhelming when compared to the original DoW. The Multiplayer Annihilation mode is terrible because of the lack of base building capabilities (you always know the enemy base is if you know the map) and the only mode that anyone really plays is Capture Point.  If you like Dawn of War for its gameplay, you will hate DoW2. It's a stripped down version with some useless RPG mechanics that feel like they hinder the gameplay rather than expand it. Which is a shame because the game definitly lives up to what you would expect from a sequel in terms of presentation. But that does mean that if you're simply looking for a WH40k RTS game that looks really good, then this will satisfy that very basic itch.",
            "review_score": "-1"
        },
        {
            "review_text": "This game requires that you also install Windows Live, which strikes me as ♥♥♥♥♥♥♥t.",
            "review_score": "1"
        },
        {
            "review_text": "'Lets take as many bug's down with us!' Imperial Guard Seargent Merrick  this game is truely amazingfrom its story to it's game play.  As a fan of the warhammer games this game is one of the best for story and game play. why are you still reading this buy it NOW!",
            "review_score": "1"
        },
        {
            "review_text": "A solid DoW title.  If you're a fan of tactical strategy, this is definitely for you. Single-player contains a lot of different elements that effect how the actual fight goes on the battlefield.   Even with the different units, you can try out different synergies. Like holding an advancing unit at bay with avitus and ordering Thaddeus to tear them apart with a tactical air strike.",
            "review_score": "1"
        },
        {
            "review_text": "This is a lot like SC2. At least to me. I bought the whole pack just before the summer sale and am hoping that it doesn't show up this week cheaper. ;)",
            "review_score": "1"
        },
        {
            "review_text": "boring consept to me. i like having an army not a squad. got very bored after an hour. i did like the leveling up of characters though. it wasnt a bad game but its alot different than the origional.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best RTS ever made. The only problem with this game is that it ends eventually. Damn. Waiting for DoW 3.",
            "review_score": "1"
        },
        {
            "review_text": "The whole saga is awesome! Shame there's so few people on multi...",
            "review_score": "1"
        },
        {
            "review_text": "Excellent succesor for the original series though i feel the scale of the battles is smaller",
            "review_score": "1"
        },
        {
            "review_text": "All Dawn of War games are good!!!",
            "review_score": "1"
        },
        {
            "review_text": "Overhead combat, a bit like Starcraft but without a ton of troops so the guys you have a really valuable. Like, everyone is a hero. The developers take advantage of this mechanic well with lot of unique weapons you can find for your guys, thinks like 'The holy laser blaster of General Yang.' Which sounds silly but actually you get really excited about it.  The mechanic flows pretty smooth in this game, really enjoyed the combination of strategy and action on missions. The plot is forgettable (litterally, I can not remember it) but if you don't care much about that then dig into this one.",
            "review_score": "1"
        },
        {
            "review_text": "A really great game that takes all the best bits of strategy of the first game with a new form of combat.  revolves around single people being well placed before fights and using there abilities to win you fights.",
            "review_score": "1"
        },
        {
            "review_text": "it never worked on my computer but now it works so turn that thumb around",
            "review_score": "1"
        },
        {
            "review_text": "So hard as a new player to move the cammera.. makes it really annoying to even try to play.",
            "review_score": "-1"
        },
        {
            "review_text": "If DOW 1 is a 5-star, this is a 2 or 3. Bad points: -long loads -scripted missions -static enemies -no option to sort inventory -poor in game documentation -memory leaks  Good points: +A lesser DOW, sort of +some good dialogues",
            "review_score": "-1"
        },
        {
            "review_text": "The game is really good, but has crashes here and there, all you need to do is to spend some time with the orks and paint your computer red.",
            "review_score": "1"
        },
        {
            "review_text": "Get this game and its expansion pack for a RTS with RPG elements. You won't be super dissapointed and you'll spend roughly 30 hours in the campaign alone!",
            "review_score": "1"
        },
        {
            "review_text": "for old dawn of war players dont buy this game. this is really ♥♥♥♥♥♥. wasted money. wasted sh!t just buy dawn of war 2 dark crusade. its really the best, not this. really sad :( sad download, sad time, sad money, sad eyes   what happened? really? dark crusade has more content than this. what the Hell! the bodies dont stay at the battlefield at all. lack of content really! what happened in building bases? WHAT THE FOCK! WASTED MONEY WASTED TIME! I SOLD MY PUDGE CHAINS OF BLACK DEATH FOR THIS SH!T   I TRIED SO HARD TO BUY THIS BECAUSE ITS DAWN OF WAR BUT IN THE END, IT DOESNT EVEN MATTER. GIVE ME BACK MY MONEY, GIVE ME BACK MY PUDGE! SH!T YOU KILLED THIS GAME!",
            "review_score": "-1"
        },
        {
            "review_text": "This is a typical 40000 game I love it",
            "review_score": "1"
        },
        {
            "review_text": "For The Glory of the Emporer..!!! Lets burn the heretics..!!!!! this game is an all time favourite of mine.!!",
            "review_score": "1"
        },
        {
            "review_text": "good graphics.   NO BASE BUILDING in multiplayer. just feels limited to me. wars feel like minor disagreements. prefered dawn of war 1.",
            "review_score": "-1"
        },
        {
            "review_text": "As good as expected, casual fun to quite a challenge, decent rts roleplaying gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "lost my progress when i go online,aside from that this is one of my fav game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game!  Great story, great mechanics, great graphics.   Right now it is the gold standard of RTS games.  Also, made me realise just how much of Starcraft was stolen directly from Warhammer. Sad really that SC was allowed to get away with ♥♥♥♥♥♥♥ising this awsome fictional universe. Seriuolsy, even the factions are copied to a 'T'.  Anyhow, play this, play it a lot, and play it often.",
            "review_score": "1"
        },
        {
            "review_text": "totally awesome game it and its expansions.. even if your a fan of 40k or not.",
            "review_score": "1"
        },
        {
            "review_text": "If you're into RTS games, hate base building, and like unit perk development; this is the game for you. Taking bits from a combat-oriented RPG , minus the dialouge, DoW2 puts a good spin on the RTS. The solo-campaign is engaging, and building a force that plays like you want it to, no matter the unit-type; all this provides hours of enjoyable gameplay. Online Play is a different story, we've been trained to build a base and pump out units. This has you survive, collect resources, survive, hire more units, survive, assault, survive, repeat. You don't have to build structures or buy too many upgrades, but this is closer to traditional RTS multiplay. Finally, the option to Co-Play the solo campaign is unique, intriguing and (unfortunately) something I've yet to try.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game. I loved and adored it, It's just sutch a pity that my has stoped working and no matter what I do it wont start. I've tried every single option and followed every guide but none seems to work.",
            "review_score": "-1"
        },
        {
            "review_text": "7 / 10  Not alot like the first game. So don't expect a normal sequel. Instead of being a normal RTS, this is more RPG inspirred. You got a small amount of squads, you move around tactically. Sort of like a mix of Down of War 1 and Baldurs Gate.",
            "review_score": "1"
        },
        {
            "review_text": "really good concept of battle (cover, flanking, suppresion); graphics and detail are really good; you don't have to worry about base building (you just need to worry about what troops you buy). Although, the army you can pic is limited compared to the war hammer game (only four armies to pick from), and not many people play the multiplayer (most likely because it isn't well-known or people think that only warhammer nerds play it).",
            "review_score": "1"
        },
        {
            "review_text": "Chaos &gt; Space Marine",
            "review_score": "1"
        },
        {
            "review_text": "nice game to try.",
            "review_score": "1"
        },
        {
            "review_text": "I spent 82.3 Hours on this game playing as the space marines. ENOUGH SAID  10/10 Would play again.",
            "review_score": "1"
        },
        {
            "review_text": "that moment when you buy the master collection 2 days before gaben makes it 75% off",
            "review_score": "1"
        },
        {
            "review_text": "honestly better than retribution",
            "review_score": "1"
        },
        {
            "review_text": "I returned to DWII after a long time. It is still a superb game with a great story, good characters and excellent voice action. I am not a great fan of RTS, but DWII will appeal to many turn based gamers like me. If you like W40K you cannot miss this game, has all the epic battles that you love so much.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Can't wait for the third one",
            "review_score": "1"
        },
        {
            "review_text": "One of the best and decently challenging RTS games I have played. Have only spent 15 hours in it so far, but can't wait to get back into it each chance I get. Bought it cheap, worth every cent.",
            "review_score": "1"
        },
        {
            "review_text": "LONG SHALL BE YOUR SUFFERING! JOYOUS BE YOUR PAIN! BLOOD FOR THE BLOOD GOD! This game is a blast and if you love warhammer and games that play like company of heroes then check this out. 11/10  EDIT: This game is still dope!!",
            "review_score": "1"
        },
        {
            "review_text": "yes, i need more. i want more. yes!",
            "review_score": "1"
        },
        {
            "review_text": "Truly great RTS. Despite 'Ditching' the Base building aspects of the original Dawn Of War it is still an amazing game. Great Customization and plenty of loot! (Who doesn't like loot?!) Great campaign with an excellent multiplayer and a fun, team based co-op mode is a must buy for fans of Dawn Of War and Warhammer 40K",
            "review_score": "1"
        },
        {
            "review_text": "Great Game love the single player campaign as it can go forever if you want it too with its randomly generated missions 9/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "very fun. good story, good gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "A must have. Great tactical gameplay and very visceral combat.",
            "review_score": "1"
        },
        {
            "review_text": "Very happy about THQ's license extension with WH 40K. One of the most visually pleasing and engulfing gameplays in a strategy game out right now. Hell the only competitor in my opinion is CoH 2, and they were made by the same people :)",
            "review_score": "1"
        },
        {
            "review_text": "Dawn Of War II is easily one of the best real time strategy games out there.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, bought the DoW Franchise Pack and I do not regret even a single moment of it. not the biggest warhammer fan in the world and hated the idea of this kind of gameplay, but after playing retribution offline for like 2-3 weeks straight I can easily say I am hooked on this game.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly well-done multiplayer. I feel it combines the squad based RTS with the RPG elements well-- and keeps both balanced throughout the campaign. The skirmishes are a lot of fun as well, as deploying the larger units onto the battlefield was simply a joy. Loved it when I first played it, and still love the campaign on another play through. If you can't get the game to run, get Games for Windows install from Microsoft-- the steam install didn't work for me, but this fix worked.",
            "review_score": "1"
        },
        {
            "review_text": "More fun than Diablo 3",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! I'm a life time strategy game player, and long time player of Starcraft 2; played it probably for 3 years with all the different mods. This one is real time strategy but much has shorter missions (they are more engaging) and you use small squads instead of huge armies. Took a bit to get used to the smaller squads, but after I did the single player campaign is a blast! What are you waiting for? Buy it now, seriously just buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable RTS. Loving the campaign mode, and I love the universe.",
            "review_score": "1"
        },
        {
            "review_text": "Good game but only via internet Single-player have no sense here",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing! the amount of story in this game is crazy I have played for 14 so far and im loving it all the way if you like squad based strategy games and have never tried the warhammer series I would highly recommend this game plus with the christmas sale right now you can get it dirt cheap! BUT even if it wasnt it would be worth every penny and more!",
            "review_score": "1"
        },
        {
            "review_text": "To any RTS fan this game is a unique, fun and exciting experience!  To a Warhammer 40k fan you'll get exactly what you want! Badass space marines and a hell of a lot of awesome!  A great load of fun, a good length of play and plenty of replay value!",
            "review_score": "1"
        },
        {
            "review_text": "Although it's not as great as the previous game, it's certainly not bad, either! The new approach to playing this series is slightly uncomfortable.",
            "review_score": "1"
        },
        {
            "review_text": "The best.",
            "review_score": "1"
        },
        {
            "review_text": "Dawn of War 2 Improves on the classic and it's really an awesome and deep strategy game with espetacular graphics and FX. You should play the retribution version but this one is great for campaign and backstory! Really recommended game",
            "review_score": "1"
        },
        {
            "review_text": "Really fun ... REALLY fun strategic action game that keeps you on your toes like Warhammer is known to do.",
            "review_score": "1"
        },
        {
            "review_text": "This is A reallt good warhammer game, the dawn of war series's are great and are very accurate, all i would wish of this game is that more factions were added like: Imperial Guard and the Tau ",
            "review_score": "1"
        },
        {
            "review_text": "Nice and fresh way to play in the world of Warhammer 40k, it has somewhat a feel of tabletop ply, except that this is realtime.  I Like this... More... Alas THQ gone",
            "review_score": "1"
        },
        {
            "review_text": "I am a big fan of the dawn of war games, I would recommend this game! It reminds me of company of heros in some ways but overall its awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Good strategy game!!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you want to be in epic battles, must you have this game.",
            "review_score": "1"
        },
        {
            "review_text": "Damn ♥♥♥♥ never play this 0/10 would not purge again",
            "review_score": "1"
        },
        {
            "review_text": "Game is very awesome a lot of equipment 5 races tons of Bloody wars I very like this game I pass the campaing and I have good memories about it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS game future based",
            "review_score": "1"
        },
        {
            "review_text": "For the Godlike Emperor! Purge the unclean! Burn heretics! Slain xenos!",
            "review_score": "1"
        },
        {
            "review_text": "100%",
            "review_score": "1"
        },
        {
            "review_text": "good graphics",
            "review_score": "1"
        },
        {
            "review_text": "An unusual and nice RTS, from the masters at Relic.",
            "review_score": "1"
        },
        {
            "review_text": "A must for every Warhammer 40K &amp; Strategy fan! A nice story, no base building (its all like the commando missions from C&amp;C), and hours of fun in singleplayer-campaign and multiplayer-matches!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game its awesome! ",
            "review_score": "1"
        },
        {
            "review_text": "a bit like company of heroes but in a scifi/fantasy setting.",
            "review_score": "1"
        },
        {
            "review_text": "When Windows ♥♥♥♥ing Live works this is a badass awesomeness maximus extremus.",
            "review_score": "1"
        },
        {
            "review_text": "realy good gameplay and amazing graphics last stand could have some better functions like solo play but all in all a good game",
            "review_score": "1"
        },
        {
            "review_text": "Simple review: Get this only for the singleplayer campaign, which is a tad repetitive but still reasonably fun and pretty darn long - however for the Last Stand mode or multiplayer, get Dawn of War 2: Retribution since it adds all the Steam stuff.  Since it is also so cheap now, especially in the Dawn of War 2 bundle, you'll likely get this by accident with Retribution anyway.",
            "review_score": "1"
        },
        {
            "review_text": "  The McFist, 'What Year is it?!' Review of Dawn of War 2    Dawn of War 2 [DOW2] is many things, but it is not your original Dawn of War [DOW], nor its expansions. The logistics, so heavily featured in the campaign, and multiplayer [MP], of DOW, and its expansions, have been all but erased from existence in this iteration into the DOW franchise, and have been replaced with an extreme emphasis on tactical placement of but a few squads, both in the campaign and in MP. In fact, one of the only comparrisons I can make between the campaign and MP portions of the game, thsu I will discuss the campaign portion of DOW2, then dive headlong into the MP aspect.  In DOW2, you are the a newly appointed Force Commander for the Blood Ravens, the faction of the Space Marines that were the primary protagonist in DOW. Assigned to Calderis to aid Captain Thule, you take command of the Force Commander and a squad of Tactical Marines, lead by Sargeant Tarkus, to crush an Ork uprising. During the Calderis missions you are introduced to other squads (Assault Marines, Scouts, and Devastator Marines) that you can bring with you, and use, during the campaign. Each squad has a designated 'hero' in its ranks, and for the Tactical Marines it is Sargeant Tarkus. The squad can lose members in battle, and have its number replenished at waypoint beacons. However, if the 'hero' takes too much damage, he will be incapacitated (all units in the squad will die), and will need to be revived by another squad. You can tell if the 'hero' is taking damage by looking to their icon at the side of the screen, which will display the 'hero's' health as well as how many marines are alive (blank person icons incidate that the squad is down men).  During the campaign, you can only deploy four squads at one time. You must make your selection, and choose carefully as you cannot switch out squads in-mission. The Force Commander must always be deployed with your team, however you can switch out the others, depending on the tactics you wish to employ during your mission, with ease. And, with the removal of logistics in this game, tactics are very important in order to keep your squads alive.  In DOW2, you will encounter something very familiar to you, if you have played Company of Heroes [COH]: color-graded cover. Muck akin to COH, when you position your squads, your cursor will show you how good the cover is, by displaying yellow, or green, colored circles. During the campaign, it is quintessential to place your units in cover, as on higher difficulties, your squads can be eliminated in seconds if they are in open terrain. This also applies to enemy units that find themselves without cover.   Each killed unit will garner your squads experience [EXP] during the mission, while undeployed squads will only receive a partial EXP boost. Your squads will gain levels and be granted two points, each level-up, to spend on 4 different trees: Stamina, Range, Melee, and Energy. For every 5 points in a tree, the squad will be gain a new ability, ranging from using a melee power, of having the passive power enabling the use of Terminator Armor. Depending on where the points are placed, this will dictate how you are wanting to use this squad in combat. You can make each squad different each time you play, depending on where you allocate their points.  However, it must be said that if you are inexperienced with micromanaging units, you could struggle, and be overwhelmed, with all the powers, abilities, and items that each squad can use, not to mention trying to tactically place 4 squads before an engagement begins, or has already begun.  And, during missions, you will also receive loot, such as weapons and armor, that can be equipped to your squads. Some items can only be used by certain squads, however, and some items will require you to wait until you are a high enough level to use them.  After you complete each mission, you are graded by three things: Fury [amount of enemies killed] Speed [completion time] Resilience [how many squads were incapactitated]. You are then awarded between 1-5 stars for each category, which is then talied into your rank. This rank is meaningless essentially, save for achievements on Games for Windows Live, a service that will thankfully be no more next year.  The story in DOW2. though, is your standard affair with the DOW series. The Blood Ravens must rise to the challange and overcome their enemies. The story requires little thought, as you are ordered to go several different planets to stop enemy uprisings and to ultimately stop the biggest threat to the sector:    The Tyranids   .  The real challenge in this game's campaign is to keep your squads alive, and that's what keeps me coming back to this series. I embrace the challenge of finding my sqauds overwhelmed, yet are able to hold off the hordes of xenos and not lose a single squad in the fight. If the challenge of keeping soldiers alive in XCOM: Enemy Unknown was what kept you going, then this game is definitely for you.  One final thought about the campaign, though: You can Co-op the story. And Co-op is where the story's gameplay shines.  No longer tasked with commanding four squads, you and your partner will comand two squads each, though the host must always keep the Force Commander with them, if I recall correctly. Only needing to command two units each, the squad management is much easier to grasp and learn, which can also act as a learning tool if you wish to play the story by yourself again. Both players can assign points to, and equip, each squad, even ones they are not actually in control of. But, keep in mind that Player 2 does not save any progress for the Co-op campaign, as it is saved only for the host. Player 2 will have to start the campaign fresh, if they have not played the game at all before playing Co-op.  While that is a small misstep for the Co-op portion of the campaign, the rest is truly fantastic and nothing beats the feeling of you and your partner working together, taking out squad after squad of enemies without taking a scratch.    Last Stand    DOW2 also features a new, MP, Co-op horde-mode style gametype known as Last Stand. Last Stand is a three-player game mode in which you each pick one hero to do battle with against waves of enemies. You hero will receive EXP and level up during your playthrough. However, instead of gaining points to level your hero up with, you are given items for each level up that can be used to make a supremely deadly build. Each hero has to be leveled individually. Expect to fail in this game mode often.    Multiplayer    In DOW2's MP, you can expect to see a game very reminiscent to COH. You are required to capture Requisition and Power points in order to train units, and to level up your Tech Level, at your HQ, as to create higher-teir units. You have no buildings you need to create in order to build units. Cover is essential, just like in the campaign, as is the unit's positioning. Devastator Marines can be easily overcome if they are flanked. The rest is your standard affair with COH. Expect few units early, and many often.  With that said, the MP portion of this game is quite boring, in my experience, and I have found little entertainment in it. But, other, who have spent far more time in this game, may disagree with me.   But if you want a single-player and Co-op experience in the DOW universe, that abandons logistics for a tactical, real-time, action RPG than look no further than this, as it sates those needs perfectly.",
            "review_score": "1"
        },
        {
            "review_text": "This game is why i love Warhammer&gt;",
            "review_score": "1"
        },
        {
            "review_text": "Dawn of War 2 builds upon the lore of the classic DOW: Dark Crusade era games but breaks the mold by removing base building. Don't worry, with all of the action and character customization, you won't even notice it's gone.",
            "review_score": "1"
        },
        {
            "review_text": "good game, people who are into the warhammer universe will no doubt find it more enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "Dawn of War II is the shining star in the crown of Games Workshop's video games. The small number of units and heavy reliance on cover make for excellent fast-paced play.   Multiplayer is pretty good, especially Last Stand. I've never had particular problems with lack of balance.   Singleplayer has a fantastic campaign. Purge the unclean.",
            "review_score": "1"
        },
        {
            "review_text": "Simply great RTS. Redefines the genre in every aspect. It really hones in on using your heroes and abilities over worrying about collecting resources and building some vast army. If you want a highly skillful and tactical experience, get DoW2.",
            "review_score": "1"
        },
        {
            "review_text": "Strategy games have long been about who can build the most massive number of units the fastest in order to simply overwhelm the other player. Dawn of War II's cover system and 5 distinct races make for a play experience that is challenging in every engagement, not just a coin toss win/lose situation.  Add to that a single player experience that combines the best of strategy games with Diablo-style loot, character progression, and skill trees, as well as a survival mode pitting 3 hero players against increasing waves of enemies, and you have a game that is incredibly easy to keep playing and find satisfaction in.",
            "review_score": "1"
        },
        {
            "review_text": "I can't stop playing it ;D",
            "review_score": "1"
        },
        {
            "review_text": "Dawn of War 2 is a fun game and all, but once you learn about the well developed universe behind it you get sucked in again. Relic did a great job satisfying fans.",
            "review_score": "1"
        },
        {
            "review_text": "The RPG element of this game works really well with the RTS aspects of it, and that makes the single player part of the game very engaging to me, as I love kitting up my squads specifically for the mission at hand and seeing how they do. The only things that I might change are the very low unit cap in multiplayer and the fact that it uses both GFWL and Steam as online services. Better leave one Steam!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a blast. I loved playing it. You pick out you want to run the battle feild. You pick your men. You can go big guns, Snipers, Melee, or mix it up! You find armor and weapons and lvl your chars and there skills. This game is a blast. Please try Dawn of War 2!",
            "review_score": "1"
        },
        {
            "review_text": "If you like strategy games that don't take long to setup and just want to get into the action, this is a must-have for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite non Bilzzartd RTS. Very good!",
            "review_score": "1"
        },
        {
            "review_text": "not bad tbh",
            "review_score": "1"
        },
        {
            "review_text": "Solid, tactical RTS action. This one does away with massive bas building and focuses on 'Squad Oriented' action. It's like chess on steroids in a nutshell. For every unit there is a counter. The terrain is used to great effect for cover and impeding you foes advance and tactics. I love this game, but I'm biased as I have played Warhammer: 40K and Warhammer Fantasy since 1989. I own over 70,000 points of Chaos models and Space Wolves, and over 100,000 points in Greenskins for fantasy. So, like I said I'm an expert on Warhammer and I know a good game based on it's universe.",
            "review_score": "1"
        },
        {
            "review_text": "Warhammer 40k the way its supposed to be!",
            "review_score": "1"
        },
        {
            "review_text": "An RTS for those scared of the RTS genre. There is zero resource management, which means full-time ♥♥♥-kicking. Think of it as a top-down action game with simplified RTS controls, but add in a Mass Effect style leveling system. I was wary going into this game because I almost never finish any RTS that I start, as I tend to lose interest; but after my first couple hours I was extremely impressed with what Relic has done here. Sure, it's not as deep as the first, more traditional RTS entry in the series, but they've traded the sometimes overwhelming task of building and gathering resources for more twitch-based gameplay that still requires a good deal of seat-of-your pants strategy. I plan on finishing this game, and then starting it all over again. It's just that fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you like RTSs, Warhammer 40k, giant-♥♥♥ spacemarines with chainsaws for swords, or Steve Blum raging about alien infestations, this is the game for you. GET IT!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun single player, exciting storyline, and multiplayer survival is a must play.",
            "review_score": "1"
        },
        {
            "review_text": "Awosome tactical game with excelent RPG elements",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for any RTS fan who prefers the combat aspect of strategy games over resource gathering. You are almost always in combat fighting to hold positions, which in turn give you resources to spend on more units. You don't have to focus on buildings, since there is only 1 main building for each player, the one producing your forces. I personally avoided these games just because I'm not a huge fan of warhammer, but when I got these in the THQ pack, I was very pleasantly surprised and it quickly became one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "A great RTS game, especially if you are a fan of the Warhammer 40K franchise.",
            "review_score": "1"
        },
        {
            "review_text": "Crush heretics and blast Xenos away in the name of the Emperor.   It's an RTS but small scale where you only control 4 squads most of the time, each with their own powerful and unique abilities.  Also has a multiplayer horde mode that seems pretty okay.  Someone ♥♥♥♥ing get this game so I can do the co-op campaign.",
            "review_score": "1"
        },
        {
            "review_text": "Really entertaining RTS. If you love the warhammer universe it is a must buy, a very enjoyable game!",
            "review_score": "1"
        },
        {
            "review_text": "8/10/2014   I bought this game beacause some of my friends recomended it to me, when I started it it got to the menu and I hit play. and this came up ' You MUST be signed in to LIVE to play' So ok well w/e I will just make an account and play WRONG GFWL doesnt even exist anymore  So you can't even play gg  Dont waste 20 USD on a game you cant even play lol",
            "review_score": "-1"
        },
        {
            "review_text": "I LOVE THIS GAME SO MUCH!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is very different than the first one.",
            "review_score": "1"
        },
        {
            "review_text": "Skulls for the throne of Skulls  (10/10)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, played 12 hours just after buying it. Sarted to have crashes 10 hours in, but i recommend this game. great fun and i love how it all depends on your playstyle",
            "review_score": "1"
        },
        {
            "review_text": "Don't trust the six hours of gameplay I've got right here, I've played this game for hundreds of hours on my old computer, and decided to buy this game again on Steam. Truly one of the best games brought to you by Relic. RPG + Tactical, squad-based strategical gameplay is really a breath of fresh air into the 'strategy' genre.  Focuses more on micro-managing your squad and their abilities rather than overwhelm your enemies with brute force and numbers. This is why Relic is one of my top choices for strategy games. Great graphics for a strategy game that was released years before the next-gen comes around. Amazing sound works and voice acting. The ambient and the booming bass were really helping to set up the future setting of the game.  Now, if you guys could just bring back the licensing, stop 40k: Regicide, and release Dawn of War III, or Space Marines II that'd be great.  9/10 - buy this game or you're a heretic.",
            "review_score": "1"
        },
        {
            "review_text": "commander hairgel and his merryband of HAIRETICS should not be passed up",
            "review_score": "1"
        },
        {
            "review_text": "I played dow 1 many many hours , but never installed dow 2 i dont know why,and that was a huge mistake. dow 2 is my dream rts, no resource no buildings just pure combat with hero units against hunderds of orks , eldars , tyranids, game also has pretty cool character development and items , don't miss this gem , one of the best games i ever played.",
            "review_score": "1"
        },
        {
            "review_text": "very good game i love rts games and this one def delivers co op is also fun you split up the troops between you and your friend sadly there is very few troops but anyone who knows warhammer knows that it only takes a few space marines to get the job done",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the Best fast paced Squad Based Strategy Games ever made. I like the Models, the Loot and the Gameplay is fast and fun plus Coop is there.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome effects. Great campaign story. Very addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, one of the classics :)",
            "review_score": "1"
        },
        {
            "review_text": "an awesome game! :D if you like RTS games though",
            "review_score": "1"
        },
        {
            "review_text": "Its Dawn of War! Just missing base building. If devs will continue to DoW3, i hope there will be mixed both functions. I mean RPG as it there, and building from previous game line.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Qite an immersive game with great tactics involved in the gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "The game is, as are most RTSs of this style, split into two parts: the campaign and the multiplayer.   The former is an engrossing and engaging storyline that has all the aspects loved and looked for by RTS fans (units and counterunits, squad control, dynamics of attack, different factions, etc) and a few new, neat additions (squad positioning around cover, for example).   EDIT: Multiplayer",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "this game ♥♥♥♥ing sucks ♥♥♥♥ the original ones were better this game is ebola",
            "review_score": "-1"
        },
        {
            "review_text": "This game. What can I say about this game? I read the Eisenhorn series. That got me interested in WH40K. Several years ago I 'borrowed' this game from the internet. Blown away. But this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. The mechanics in this game fix a lot of issues that I had with the original Dawn of War. It no longer conflicts with the fact that there are 100 battle brothers in a company and in Dawn of War 1 you could easily kill more than 100 battle brothers. This game's multiplayer is also okay, but I prefered Dawn of War 1 multiplayer since it takes forever to kill off your opponents main base in this one.   The last stand is also a great game mode, but be prepared for some confusion since you can use all factions in normal multiplayer, but you will have to pay for the Chaos Rising expansion in order to get the Hive Tyrant or the Chaos Lord for the game mode. The story fits in the 40k universe very well, but you revisit the same maps over and over in single player. Otherwise this game is great for both rts and 40k fans alike.  ",
            "review_score": "1"
        },
        {
            "review_text": "An RTS game scaled down to controlling three squads of units in the campaign. It's heavily cover based, micromanagement of the squads is essential. The squad leaders gain level specific abilities and gear that can be customized on the ship between missions. During missions the squads can be reinforced by returning to captured beacons. Everyone is so serious, it's great, especially with the nonsense going on.",
            "review_score": "1"
        },
        {
            "review_text": "This series totally kicks ♥♥♥. Both of the add-ons are really well done too so it's well worth it to buy it all.",
            "review_score": "1"
        },
        {
            "review_text": "Get this! Preferably the entire set.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game anyone who enjoy's 40k will like this title",
            "review_score": "1"
        },
        {
            "review_text": "It's 2015 and this game is still awesome and action packed. A must buy for mindless and endless killing that provides hours of enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "its awesome",
            "review_score": "1"
        },
        {
            "review_text": "THQ delivers another great RTS. I miss the true base building from the original Dawn of War, However the beautiful graphics and amazing coop campaign and last stand mode more than make up for this one flaw.",
            "review_score": "1"
        },
        {
            "review_text": "It is a nice game, but compared to Dawn of war, Dawn of war winter assault and Dawn of war dark crusade it's not that good. The gameplay has drammaticly changed, and it's difficulty has incredebly increased. Although the graphics are good, en the animations are far better than before. Their are new commands added to the game, and new units.   The new Tyranid force is cool to play with, but i miss the Imperial Guard. I would have liked to see them as well. If you are a Dawn of War fan, than you schould defenitly buy this. It may not be as good as the first parts, but il will enyoy it for hours!   If you dont like these games, than you schoudn't buy it.",
            "review_score": "1"
        },
        {
            "review_text": "In my own opinion, this was a far more refined and less of a 'generic rts clone' than its predacessor, which while dont get me wrong was a pretty awesome game, DOW II is much more about strategy and tactics than sheer brute force - it is the Supreme Commander of the Warhammer:40K universe, but the only resources you have to manage are your limited supplies and the four squads you bring to bear in a mission, everything else, your victory or defeat is purely down to your strategy and how well you manage your troops in combat though, i will say Dreadnaught OP. :)",
            "review_score": "1"
        },
        {
            "review_text": "It is the most AMAZING Stratery iv played",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, alot more fun as Co-Op. Worth a go",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game. Played the first part on Seargent level, then tried fighting the first boss and got my ♥♥♥ kicked. The skirmish mode is nerfed unlike the first one.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent Co-op game, not so great to play solo  Control a small group of Space Marines exterminating hordes of aliens in real time tactical combat. If starcraft, diablo and xcom had a three way, the result would be something like this.  The story is not deep, but it is pretty well written, and the voice acting is mostly well done.  In single player it can be hard to control all of your squads effectively given the fast pace of the game, but in co-op you divide the squads between the two players, which makes it much easier to get the most out of them. Playing this game with a friend is a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "if you like Hack &amp; slash and blood &amp; Guts games then this if for you",
            "review_score": "1"
        },
        {
            "review_text": "Dawn of War 2… ahh… Dawn of War 2… having been a 40k fan for decades, and a DoW 1 junkie, I bought this game the day it came out. I had high hopes for an even more advanced DoW experience.  I played it for about 7 hours… and put it down until the past week. Yep. I ignored this game for over 6 years. Upon playing it in 2009, I was very disappointed, but we’ll get to that below.  So why did I pick it back up? I just loaded up on Sega games due to the sale last week (Sega bought THQ), and decided to go ahead and trudge through this game. I had heard good things about Chaos Rising/Retribution and wanted to get through the base DoW2 experience before moving on so I’d have an idea of what the heck was going on in the expansions.  I’m on the last mission of the campaign. And wow… it’s been somewhat painful to get through (and not because it’s hard… there’s very little that is hard in this game). Here’s the skinny:  Pros: - Awesome Graphics. - Tyranids as an enemy/playable outside of the campaign - Great terrain engine (destructible, affects line of sight very well… similar/same tech as found in Call of Heroes) - Detailed and somewhat interesting character RPG-style progression with loot and XP (caveat in cons below). It’s very reminiscent of the old WH:40k – Chaos Gate game (with way less detail and minus perma death)  The real highlight of the game is leveling up your characters. It’s fun watching them go from being more or less a base line Space Marine with basic gear of their specific type from the TT game (HQ, Tac, Heavy, Assault), to a fleshed out bad ♥♥♥ toting WMDs.  Cons: - No base building, and no tech tree. This game is not REALLY an RTS in that sense. It’s more like a multi-unit Diablo-like Hack n' Slasher (with guns). - The game difficulty is low. The only really hard part of the game is baby-sitting your units because they don’t respond the way you initially tell them to sometimes (see pathing issues below). In fact, if you are losing a fight, you can click a “Flee” button and escape to a reinforcement point at double speed. Most the time the enemy won’t pursue. To fail a mission ALL your units have to get killed. As long as one is standing, you have a chance to go resurrect them and flee. I’ve only lost one mission out of 30-40 because I got distracted IRL. - Every mission is centered on the same 4-6 Space Marines. Literally… you play the same 6 characters and their token squad members… every… map… and usually only 4 at a time. And when I say token squad members, that’s nearly meant literally. They are not represented outside of the mission other than to be a backdrop on the character screen. They are always the first to die, and they are instantly replaced if you flee to a reinforcement point. - The RPG system is unforgiving (the caveat mentioned above). Not spending your ability points correctly from the get go WILL bite you in the rear later as you’ll be short points to unlock the next trait. And you can’t reset them. Also, you can’t max out on ability points. You get 40. Period. (2 per level, levels hard cap at 20). Either pick your ability layout before starting your campaign or you will be screwed. - There are pathing problems with certain maps and character pathing AI. I’ve had units get stuck in the side of a hill and wouldn’t move. Additionally, you’ll constantly have Assault Marines or the Force Commander set to “Melee” response, and during a scrum they’ll be standing there shooting because they can’t figure out how to get to the enemy, even though the path has been cleared up. Or, you’ll tell all your units to move up into firing range. The Heavy unit will engage, but the shorter range Tactical will stop with the Heavies and not engage the target. It’s maddeningly frustrating to baby sit your units. - The map design, while graphically gorgeous, is very poor. Almost every map is just lanes of choke point after choke point between objectives. - The campaign makes little sense from a “tactical” standpoint. You are forced to jump back and forth between three star systems on a mostly linear campaign, but you wind up fighting all three factions all over the place. There are side missions to do, but other than gearing up with new loot, they affect the campaign in very minimal ways. And lastly, the maps are all repeated ad nauseam even for the main campaign missions. - The scope of the story, while very much the a-typical Tyranid sector invasion, which is fine… is yet still borderline absurd. Looking at what we know about Space Marines,. You’re flying around in a Blood Ravens Strike Cruiser (which holds a whole company of Space Marines and war gear). And the only resources you can use are a Force Commander, a Tactical Squad that is short a member, a Devastator Squad and Assault Squad that are both short two members, a full scout squad, and later a Dreadnaught? Why don’t we have Land Speeders at the least? The orks have tanks and trukks. And you mean to tell me that 4 incomplete squads are going to affect a Tyranid invasion to the point of forcing them off-world? Uh. No. I’m pretty sure there were many more Space Marines at the Battle of Macragge when Hive Fleet Behemoth was repelled. - Boss battles are out of line with 40k cannon. Many exhibit toughness and some abilities that have no frame of reference in the 40k mythos. For example… a Warp Spider Exarch would be WAY outmatched while fighting off 4 squads of Space Marines WITH a Force Commander. That fight wouldn’t take nearly as long. There are other bosses too that don’t make sense.  So as you can see, in the overall scheme of things, DoW2 was a big letdown. I guess if you’re new to strategy games or haven’t played other 40k games, it could seem really fun. And the RPG thing is kind of neat. But even that is flawed, and it doesn’t make up for all the other problems with the game.  I can’t say I recommend this game. I’m just glad I got the expansions for like $4 each.",
            "review_score": "-1"
        },
        {
            "review_text": "When Starcraft, Warcraft and Company of Hereos had a gang bang and produces this masterpiece.  When you like Starcraft and Warcraft but the gameplay mechanics are somewhat outdated.  When you like Company of Heroes but wish that the theme was a futuristic fantasy.  It's got factions from both Starcraft and Warcraft with the gameplay mechanics of Company of Heroes. Space Marines are basically Terrans Orks are Orks Eldars are basically elves or Protoss Tyranid are basically the Zurg  One downside to this game is that the units in multiplayer skirmishes are really limited. But for an early game that was prdocued before Company of Heroes, it is really a next gen RTS at the time of its release. I also really like the theme of the game. There's not much RTS games using these kinds of 'futuristic fantasy' themes anymore. Probably Starcraft II but hey, it's a completely different game.",
            "review_score": "1"
        },
        {
            "review_text": "Ive always loved the Dawn Of War Franchise so its a 100% amazing :D",
            "review_score": "1"
        },
        {
            "review_text": "Wow, not what i expected at all, i'm a fan of the first games, so I bought this sequel without a second thought.  The lack of base building was completely unexpected, not my kind of game...",
            "review_score": "-1"
        },
        {
            "review_text": "its good ",
            "review_score": "1"
        },
        {
            "review_text": "There are good and there are bad Warhammer games. This one is awesome.  Provides fun, ageing well, RTS flavoured, loyal to Warhammer.",
            "review_score": "1"
        },
        {
            "review_text": "If you hated base building, they got rid of it, and now its all tactical and hotkey the special abilities as quickly as you can. I'm not very good with APM so its kind of hard for me, but not having to churn out a new base for each battle and tech up in refreshing. The MP is solid. The campaign is well put together. Great artwork, great voice acting. Story isn't anything special, but neither was the original and that's just how warhammer is. The plot is supposed to be meaningless in a universe defined by constant war. So I'd get it for the art/gameplay/units, but if you need a story to keep you interested, it won't.",
            "review_score": "1"
        },
        {
            "review_text": "really big fan of warhammer universe . I TOTALLY RECOMMEND THOSE SERIES",
            "review_score": "1"
        },
        {
            "review_text": "A Great sequel and a must have for RTS fans!",
            "review_score": "1"
        },
        {
            "review_text": "If you came to buy this game expecting Dawn of War 1, don't buy it. This game isn't like the first one with the removal of buidling, the removal of some squad aspects and aiming more towards a squad based strategy game.  There are only about, 6 maps in total for multiplayer...  If you like working with only troops and no buildings, give it a try. If you're a Warhammer fan, give it a try.  If you want ot buy it, wait for a sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing! Breath-takingly fun",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, still go back to it every so often. Not a fan of these types of games, this series is an exception.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty solid game, it had a great sense of humor and atmosphere and you could really feel the epicenes and camaraderie between the space marines.  The graphics at the time looked stunning and have probably aged well, the same goes with the game play.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the best strategy campaigns out there",
            "review_score": "1"
        },
        {
            "review_text": "  Amazing game my first dawn of war game and i cant stop playing it! Got it as a Free game from the PC Magazine and total worth every hour i have put into it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun and if you get it on sale even better, I played a few hours. I can not think of a reason to not get this for 5 bucks, I have gotten my moneys worth and have not finished it yet.",
            "review_score": "1"
        },
        {
            "review_text": "Story is quite good.",
            "review_score": "1"
        },
        {
            "review_text": "Repeat, repeat, repeat, one race, one map and one player on multiplayer being just you. didnt really like this Loved previous title but geuss it was the building element and being able to choose all the different races that i enjoyed from number one  Edit gave it a chance year later I now love this game. Its nothing like dawn of war game before which i wanted more of this is something very different but still great",
            "review_score": "1"
        },
        {
            "review_text": "Among my favorite Warhammer titles and favorite strategy games period, Dawn of War II is the beginning of a three-part epic tale of the battle for the Blood Ravens' recruitment worlds, continued with the Chaos Rising expansion and concluded in the stand-alone Retribution. This title reperesented a considerable departure gameplay wise from the first Dawn of War and its expansions, moving away from base building, resource gathering and large-scale battles towards a smaller squad tactics format seen in the earlier Company of Heroes series, from which Dawn of War II borrowed its graphics engine: a shift that was not universally welcomed. Dawn of War II is a blend of real-time squad tactics and an RPG loot-and-level system that I found deeply engrossing. The campaign is heavily story-driven and takes you to a variety of environments, including the interior of a space hulk made famous by the turn-based series of that name. Excellent music, visual effects and voice work accompany the proceedings. Series mainstays the Space Marines, Orks and Eldar returned, along with newcomers in the fearsome Tyranids, not featured in the first game due to, supposedly, engine limitations. Epic, pitched battles and a surprising end-game return of a popular character from the first game wrapped up the experience for me in the best way possible. The main flaw of DOW II was its use of the Games For Windows Live client, but it has since been updated to remove that particular pustule. An excellent title overall and worth playing today.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing campaign and story. It may be an older game without a thriving multiplayer but the campaign is still very enjoyable for anyone that likes or is interested in 40k and makes the purchase still worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Engaging story, darned fun.",
            "review_score": "1"
        },
        {
            "review_text": "As a long time fan of the Warhammer 40k universe I really loved the story in the campaign and enjoyed the distictive abilities of each troop type. Even though I'm not much of a strategy game lover I really enjoyed this one.  I recommend this game to anyone, who doesn't have much experience with strategy games, or who simply is a fan of the Warhammer 40k universe.",
            "review_score": "1"
        },
        {
            "review_text": "Destroy your foes for the Emperor, or for the great Chaos Undivided. BLOOD FOR THE BLOOD GOD!",
            "review_score": "1"
        },
        {
            "review_text": "Dawn of War 2 is a fast-paced, tactics-focused game that's a lot of fun to play. Sometimes it can be a little chaotic with all the action, but that makes it more awesome :D Single player is nice, but I would recommend playing it co-op as it's a lot more fun. :)",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game but if you are buying it only for the multiplayer, then your doing something wrong. Great campaign and great local custom battles but the mulitplayer community isnt that active these days. ",
            "review_score": "1"
        },
        {
            "review_text": "There aren't that many games like this, which might explain the sometimes mixed reception to this game. The original Dawn of War was very much a traditional RTS, while this game focusses on smaller skirmishes and upgrading your units and characters. Still a great experience in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Kill The Xeno Scum!",
            "review_score": "1"
        },
        {
            "review_text": "It's barely a recommend, cause Greater Good wasn't achieved.  but honestly even though Relic stepped away from 'build your base, build as many tanks as you can and CRUSH THE ENEMIES OF MANKIND' form of gameplay from DoW 1, I think it was for the good. You finally feel that Space Marines are not expendable and that there is much less of them than the enemies. Also, lack of micromanagment makes the game much more rapid and entertaining. It may not be everyone's cup of tea, but devs did a good job. Game is also VERY bloody, as was DoW 1 but making characters more realistic and less cartoony-like (I know that it is an original design, I played tabletop version too) gives the game much more grim and depressing take on its world.   The main con is recycling of maps - you will come back the same map several times in the game, the only change is going to be starting area and target areas and even though they are diverse - jungle, desert and metropolis - they get boring very fast.",
            "review_score": "1"
        },
        {
            "review_text": "This game is almost 8 years old and still one of the best strategy games out there.   'Even in death I still surf'",
            "review_score": "1"
        },
        {
            "review_text": "Awesome RPG RTS game, lots of action, good story, splendid sounds &amp; graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Well paced, gripping, thought provoking and respective of its tabletop and pc roots, the DOW 2 trilogy is a treat both 40k and RTS lovers owe themselves.",
            "review_score": "1"
        },
        {
            "review_text": "I really like the game, but I couldn’t find the stupid cake.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game and worthy purchase ",
            "review_score": "1"
        }
    ]
}