{
    "app_id": 15740,
    "name": "Oddworld: Munch's Oddysee",
    "release_date": "2010-12-20",
    "developer": [
        "Oddworld Inhabitants"
    ],
    "publisher": [
        "Oddworld Inhabitants"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Strategy"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Strategy"
    ],
    "achievements": 38,
    "positive_ratings": 437,
    "negative_ratings": 155,
    "price": 3.99,
    "description": "New port for 2016! 60 FPS, higher res textures, higher poly models, improved audio, numerous fixes and improvements, and trading cards, badges, emotes and backgrounds!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/15740/header.jpg?t=1548161050",
    "minimum_requirements": "OS: Windows 7 or higher Processor: Intel Core2 + Memory: 1GB Graphics: nVidia Geforce 6600 128MB DirectX®: DX9 Hard Drive: 3.8 GB Sound: DirectX®9",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This was a pretty fun game. I've played this on the original Xbox WAY back when I was like 10 or something. I just HAD to get this for Steam :)",
            "review_score": "1"
        },
        {
            "review_text": "Oddworld has been in my life ever since I could remember. Yet, I have never beaten it, until today. It's an amazing game, and I loved every second of it. It's a classic.",
            "review_score": "1"
        },
        {
            "review_text": "Now the game is in a beta state where you can play it, the dev are doing their jobs, keep on make the port exelent.",
            "review_score": "1"
        },
        {
            "review_text": "Although a pretty good game, I find this to be the weakest game in the series. Being able to command Mudoken warriors to fight back is a huge plus but overall it lacks the Grim depressing feel of the previous games that I feel made Oddworld so unique.   Munch's oddysee almost feels a little kid friendly in comparrisson.  Still its a fun game, definately worth buying the Oddworld Box Set.",
            "review_score": "1"
        },
        {
            "review_text": "A nostalgic game at it's finest. I guess the game is kinda ruined by the auto-direction the playable character makes when you move him around, but that's what walking and tip-toeing is for! And super-bizarre characters too.  Sadly, if you didn't play this game as a child, it would be harder to connect with the levels. But if you're smart enough, going through the levels should be a breeze without the need for a walkthrough. On top of that, come on, it's only six dollars.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, terrible pc port. I have been stopped from progressing due to a crash that always happens in the exact same place. Barely passable as being worth $5. 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "I dont know where to start (like with everything else I do), but I really liked this game. Just the way it played really appealed to me. Actually, thats really all I can say. Just go buy it, its a classic game for a great price and still holds up today.",
            "review_score": "1"
        },
        {
            "review_text": "Broken, crashes, speed-ups/slow-downs and glitches. Don't buy this game for PC until it's fixed.",
            "review_score": "-1"
        },
        {
            "review_text": "So many bugs, and poor porting the game is quite literally unplayable without extensive tweaking, and even after that there are reports of crashing because of the tweaking. I personally couldn't be bothered to fiddle with the options for the best part of an hour (not being the best with computers). Would not recommend",
            "review_score": "-1"
        },
        {
            "review_text": "Let me just say this : I LOVE ODDWORLD. Next to every game i love from Abes oddysse to exoddus to strangers wrath they are all absolutely brilliant games (With my favourite being Exoddus) that i have played the hell out of, but saying that even though i really tried with this one i just think Munchs oddysee is a bad game.Not the worst but was just bad.  It didn't look that great astetically all looking rather generic, the control i found to be way too sensitive with no natural progression behind it when doing tight platforming with abe jumping too high and running too fast on the platforms, the puzzles were honeslty kind off pathetic compared to the originals. the music was alright but didn't seem to fit with the game and its look feeling out of place and at times it didn't even feel like a oddworld game as for me a lot of the things that made oddworld what it was was gone.  I will say on a positive note on how the cutscenes and overall story are still enjoyable to witness with great writing and that sometimes the controls actually accomadates the level design, but overall i didn't think it was honestly any good. I Love oddworld and if anything after i played this i played Exoddus again just because it reminded me but even if you are a massive fan and you really want to try it out DEFITNELY approach it with caution. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Had to look online to find a way to make the controls not awful for a gamepad, but after that the game runs great. Awesome game (If you're nostalgia blind like me).",
            "review_score": "1"
        },
        {
            "review_text": "Crashes everytime i played it. was a fun game. when it was origionaly on the Origional Xbox. but on PC it's just a broken port ",
            "review_score": "-1"
        },
        {
            "review_text": "I love playing this game on xbox orginal, but for me it doesn't work. I've tried all the suggested options to fix the crash at the start of the cave. The developers have released updates years ago to resolve these issues, but it hasn't really worked. What a shame, would of been fun to play this game. If you buy it expect that the game may not be able to run unless you're lucky.",
            "review_score": "-1"
        },
        {
            "review_text": "Installed it on a 64bit Windows 7 machine with 8gb of ram, i5 3.5ghz processor, and a EVGA Nvidia GTX 960 2gb and it crashed consistantly to where it was unplayable. Then I installed it on a 32bit Windows 7 2 gb ram Laptop and it works perfectly. Seems backwards if you ask me.",
            "review_score": "-1"
        },
        {
            "review_text": "Got it free, and it is terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Best game in the history of games. Amen. *tips fedora*",
            "review_score": "1"
        },
        {
            "review_text": "Munch's Oddysee is the first in the Oddworld series to make the jump to 3D and is the unfortunate victim of a somewhat muddled development cycle. It was originally a PS2 game which was hastily ported over to the first Xbox when Microsoft realized they needed more exclusives. Due to the combination of those two things the game neither looks as good or plays as well as it should, but despite its flaws I found it to be an enjoyable experience in the end. If you're a fan of the series and can put up with some general jank it's definitely worth playing through.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing fantastic, my all time favourite game",
            "review_score": "1"
        },
        {
            "review_text": "Munch's Oddysee is probably my favourite out of the oddworld trilogy, either Munch's or Abe's exoddus.   If you're expecting the same platforming action as Abe's Oddysee and Abe's Exoddus you might be disapointed. The layout is different and consist of 3D camera viewing. Now you can view the enviroments like never before!   Munch's Oddysee is more of a co-operative based platforming strategy. My co-op I mean two different characters doing different things... not multiplayer.  This version did have some bugs. Every now and then the game would crash out of no where which can get pretty irritating if it happens too often.  And there are some very tedius tasks. One level you have to use a crane to carry egg crates, and it takes... forever...  Over all if you can handle the frequent crashing you will have so much fun with this game! Doing really cool and funny things through out the game, it's a new sort of way the world of Oddworld can be viewed. I highly recommend buying this if you like 3D platforming action games!  ",
            "review_score": "1"
        },
        {
            "review_text": "I played this when I was a kid, it's still amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I played this when I was a kid, it's still amazing.",
            "review_score": "1"
        },
        {
            "review_text": "11/10",
            "review_score": "1"
        },
        {
            "review_text": "The xbox version of this game is one of my all time favorites, but this is a terrible port. If I use my keyboard, I can't get out of the opening level before the game crashes. If I use a controller, it will crash as soon as I touch a button. It doesn't matter what compatibility mode I run it in, this is the best it will do.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh my goodness, this game is awesome. I remember playing this as a kid on my small little playstation, and only wanting to wake up to munch and abe kicking some bad booty. I could not remember this game as a child growing up now and it hadn't stuck into my brain, but i persisted because i loved it too much to let this old favorite go. I definitley recommend this game and all the other oddworld games to be bought and be proud of having it in their games folder.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, does a good job of bringing the series into 3d one of my favorite games in the series.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this port a few years ago and had no problems with it. Apparently my PC is super special or something. I played this on AMD Athlon X2 and nVidia GeForce 9200, so you can't really get lower than that, today.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, does a good job of bringing the series into 3d one of my favorite games in the series.",
            "review_score": "1"
        },
        {
            "review_text": "The game is very funny and makes a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 truly the best puzzle game ive ever played. This adventure is jampacked with chalange, interesting characters, fun, and has a really well story.",
            "review_score": "1"
        },
        {
            "review_text": "I Would play this game non stop if it wasn't for awful camera",
            "review_score": "1"
        },
        {
            "review_text": "GET THIS GAME!!!!!!!!!!!!!!!!!!!!  Its fun.  I have never experienced any problems with this game at all that other people are have had.",
            "review_score": "1"
        },
        {
            "review_text": " Unplayable. Crashes constantly. Haven't even made it past the first level.   Edit: Turns out you can opt into a beta that fixes the crashes. This game is perfect now, they fixed the controls and updated the textures too.",
            "review_score": "1"
        },
        {
            "review_text": "crashes to much cannot play at all even now",
            "review_score": "-1"
        },
        {
            "review_text": "GUYS &amp; GALS! Please download the BETA to fix the pc port problems :D",
            "review_score": "1"
        },
        {
            "review_text": "Memorable gaming quotes: 'Whatever'",
            "review_score": "1"
        },
        {
            "review_text": "This game brings back childhood memories. When i was little i would only play with the gamespeak. in around kindergarten or 1st grade i started playing the story mode. i love the cutscene with the vykers and munch after the first level (excluding the tutorial level) is coompleted. hummphrey?! Lol. This game is very good. Thank you Lorne Lanning for giving us the oddworld franchise! :) I recommend this game to horror novel readers and prety much everyone. Worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "This COULD be a decent game if the controls were not absolutely horrid. On keyboard, you dont just use WASD to move. No, that only changes the direction your character is facing and you have to hold shift to actually make them move. The partial controller support isnt much better because by 'partial' it means not only do you still have to navigate menus with the keyboard, but that only the cardinal directions register as inputs on the analog stick. If you press it to the diagonals it doesnt pick up at all. Furthermore the camera controls are on the D-pad rather then the right stick, so you have to use the same thumb to point the camera where you want to go before pressing forward on the stick to actually move. This renders any precision movement impossible rending some parts of the game nearly unplayable.  In conclusion, if you want this game, go find a console version of it instead.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the games of my childhood, nice and entertaining. It didn't give me any problems on all the time i have played (I have already finished the game). For me, it worths what it costs.",
            "review_score": "1"
        },
        {
            "review_text": "Cool and Good.",
            "review_score": "1"
        }
    ]
}