{
    "app_id": 15750,
    "name": "Oddworld: Stranger's Wrath HD",
    "release_date": "2010-12-20",
    "developer": [
        "Oddworld Inhabitants"
    ],
    "publisher": [
        "Oddworld Inhabitants"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Strategy"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Singleplayer"
    ],
    "achievements": 36,
    "positive_ratings": 759,
    "negative_ratings": 139,
    "price": 6.99,
    "description": "You're the Stranger, a mysterious bounty hunter on a mission to bag the ultimate prize. And you need that money like no one else because there is something very wrong with your health and the only way to fix it is a very costly operation.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/15750/header.jpg?t=1548161121",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: Intel Core 2+ Memory: 2 GB Graphics: nVidia 6600 or better or ATI x1600 or better (256 MB+) DirectX®: 9 Hard Drive: 4 GB Sound: Any DirectX 9 compatible Sound Card Other: OpenGL2.0",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The biggest hidden gem on my steam list and in gaming. Don't believe me? Pick it up for yourself and find out. Strangers Wrath is the most creative world I've ever seen, no game has beaten it to this day.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an adventure / FPS hybrid. You switch between the modes as you explore the strange Oddworld landscape. So you would do some jumping puzzles and then blast away the enemies with your crossbow. The crossbow is powered by live animals which you pick up as you travel along. You can pick up stingbees that rapidly fire at the enemies or spiders that web them and many more. The mechanic is a bit bulky because you constantly have to switch between 3rd and 1st person. The world itself is beautiful with various landscapes from forests to deserts to icy tundras and mechanical fortresses. It's a very fun game but a bit frustrating sometimes even on normal difficulty. The battle before the final boss was pretty ridiculous with enemies chain stunning you so you have no chance to survive (except luck). I would still recommend this. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Oddworld: Stranger's Whrath HD is a first/third person game. You are a bounty hunter who works his way up from capturing and turning in wanted criminals for Moolah. The reason why is becasue he needs an operation quickly but it costs 20,000 Moolah. You play a character simply called Stranger who uses like ammo to trap his enemies which is the only way you can turn them in.  + The game looks great and live, throughout the game every place looks great and diffrent which keeps you intrested. The option menu is good since there is alot of diffrent options for the grathics so most computers can run the game.   + Storyline works well and since you will get paid differently depending whether you capture them dead or alive, but of course its harder to capture them alive bt you will get paid more. You also get to choose what bounty you want to go get which give you more freedom.  + There is a good length in this game since its around 10 hours on easy, 12 hours on medium and 15 hours on hard. This a good amount of time, you will get more time if you try to bounty everyone and explore the surroundings thoughout the game.  + Stranger's Wrath can be a hard game at times, first few hours are fine but then it starts getting alot harder and you will die alot at some points in the game. Its at a good level of difficulty since its not too hard that you want to give up, the game will make you want to get though the hard parts which makes it very rewarding when you get though it.  + The controls are good and work well with the keyboard and mouse, you can also change the keys to what ever you would like which is great since they can be changed to your liking. Only problem is that Stranger's Wrath does not have controller support.  + The music is great, it fits perfectly and does not get boring or repetitive. The music mainly plays when your exploring or when your fighting bosses, this works well because it really fits in with the mood of the scene. You can get the soundtrack from the Oddworld website for free.  + Having Steam Achievements and a good story means that there are some Replayability in the game since you can go back to complete all the achievements or just play th egame again. There is not much but there is enough.  + Stranger's Wrath is ten years old now. The HD edition is now five years old. It still holds up and looks good to this day. I dont think it will look outdated in some time now.  - The PC port is bad! Really bad. Most computer will be able to run the game but the main problem is that the frame rate is always really low... I get around 25 to 30 on a R9 280X. It you want the game then be prepared.  - For some reason Stranger's Wrath HD is really buggy, the original game isnt but this is. There are lots of bugs and some of them are game breaking. Since they dont update the game anymore you will have to put up with it... Real shame is I love the Oddworld franchise.  Overall I would say Stranger's Wrath HD is a great and fun game that most people will like. Its original and diffrent which is whats great about Oddworld. I rate Oddworld: Stranger's Wrath HD an 8 out of 10. I would recommend the game if you can put up with the port and the bugs.",
            "review_score": "1"
        },
        {
            "review_text": "One of my most favorite games of my childhood that sadly never had a sequel. I would re-play this games several times before getting bored of it.. Now that I have a higher quality computer I am hoping to get back into it with hopes of a sequel. If only I could get the game to load on windows 10",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played the game much but it is alright.",
            "review_score": "1"
        },
        {
            "review_text": "I Don't remember much of this game from my childhood, but I remember enough to know that I loved it. This version definetly needs a patch like Munchs Oddysee is getting. Still recommended, Because it isn't that bad. Though, there are some graphical glitches with Strangers future models. and it crashes 90% of the time when you die at the final boss.",
            "review_score": "1"
        },
        {
            "review_text": "If you like this you should really get Munch's oddysey.  HOO-WA",
            "review_score": "1"
        },
        {
            "review_text": "Why the hell doesn't anybody have this game?",
            "review_score": "1"
        },
        {
            "review_text": "Amazing idea. The best of the oddworld series. Perfect story, original enimies, caracters, races and world I like it. And it's damn hard, so i have a challange. 8/10 My only problem: It can't be played in co-op.",
            "review_score": "1"
        },
        {
            "review_text": "Really good for nostalgia. The HD and 60fps makes keeps the nostalgia alive. Only got the achievement for beating the game on easy though, even though I played through the whole way on hard. Still a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Played this back in the days on xbox,it was and still is wanna my favorite games. glad it's on PC so i can play it again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "(Played game on Xbox years ago so dissregard the hours) Very fun game, fast paced but not like any other Oddworld game. The weapons are intresting, you use live ammo to kill/bate/capture enemies. It's very short and there is not much replay value maybe 6-8 first time, it's very linear but keeps you on your toes.  Pro: Fun, Fast paced, Intresting and unique story and gameplay.  Con: Short and not much replay value.",
            "review_score": "1"
        },
        {
            "review_text": "9001/10, would buy a third time",
            "review_score": "1"
        },
        {
            "review_text": "Does not work anymore",
            "review_score": "-1"
        },
        {
            "review_text": "shoot little critters at ugly ones",
            "review_score": "1"
        },
        {
            "review_text": "I can not play this game for one reason keep's crashing and error message say: cannot read from the source file or disk. so if Anybody knows how to fix these problem please tell me.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game that i just had to get again, i got it in the oddbox and was so happy to see that it was the HD version of the game",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play game... The amo is live critters? enjoy",
            "review_score": "1"
        },
        {
            "review_text": "I wish this game had a little more work to it and it could have been a new conkers bad fur day but just falls short of that. still a very good game just made me want more.  the gameplay is very repeative till the last area as its mostly pick a bounty and go through the mobs to get to the boss but the last mission is more like an actually story mode and was pretty fun. The story needed some work as it was a good one but the characters didn't have any personallity to them. The voice acting and everything was great but ith one or two more writers on staff this game would have been 5/5, spirit sucessor to conker but just falls short as the story doesn't come in till the end and the gameplay was semi repeative but was so a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty shoddy port, but it's sitll ♥♥♥♥♥♥♥ Stranger's Wrath. It is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "The game suffers from crashes and freezes, the devs promised a fix for this back in 2012 and 2 years later the game still suffers form the same problems. Don't waste your money on this game unless you want to play russian roullete, since there is no guarantee that the game will run for you like it's suppose to.",
            "review_score": "-1"
        },
        {
            "review_text": "Only works if you have Nvidia and set it to a specific setting, what a wasted 10 dollars, I am heard that the game was good, but I can't even play it, tell me if you have a solution",
            "review_score": "-1"
        },
        {
            "review_text": "[size=+2]OddWorld: Stranger's Wrath HD: Review[/size]  The Oddworld studios is a great studio that makes the game almost flawless this is the actual remake of the 'Stranger's Warth' (the original version of the game was released to the XBOX only) to have better graphics and to be in multiple platforms such has Playstaion 3, PC, Android, IOS, Ouya and Playstation Vita.   Well let's start with some aspects of the game   First stop OddWorld never released a game with the combat they literally just created 'OddWorld: Munch's Oddysee' wich was the first OddWorld game that had a 3D animation with a ♥♥♥♥♥♥ camera movement, carrying on Stranger's Wrath has a great camera movement, a good combat engine wich you can use the map and it's resources to do it stealth or go aggro all the enemies and hope you don't get killed, when I was playing the game I got really stealthy and decided to hunt the enemies one by one until I reached the boss and I was on hard mode so it literaly made my life easier I din't wasted a bunch of ammo and got captured the boss in ease, the only think I don't like in this game it's the short story it took me 16 hours to finsih the hole game in hard mode thats how short it is, and they are never making a new game about the legendary steed 'Stranger' since they are focused giving a epileptic seizure to future generations with 'OddWorld: Abe's New 'N' Tasty' and the up comming remake of 'OddWorld: Abe Exoddus' wich will literaly make me epileptic (hope not, well they abuse in the lightning again) and forgot to metion that Oddworld was going to relase a game with engine of Stranger's Wrath but with a few changes called 'Oddworld: Brutal Ballad of Fangus Klot' got canceled due to the collapse of Oddworld Inhabitants, but has they got a new team now I know it will be released and people will love the studio wich I still love since I was a child.   ----------------- BUY THIS GAME GIVE SUPPORT TO THE ODDWORLD STUDIO! ------------------",
            "review_score": "1"
        },
        {
            "review_text": "It's ok",
            "review_score": "1"
        },
        {
            "review_text": "Strong points :  - the title screen was amazing  Weak points :  - Game broken for almost everyone. This is basically fraud  It is very unfortunate to not be able to play this childhood classic on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "where's the HD remake  update: there it is  now where's the stable HD remake  (no seriously have you guys saying it's unhelpful actually played the game because it's basically impossible for tons of people)",
            "review_score": "-1"
        },
        {
            "review_text": "basically u are hillary clinton and the wanted guys are people who have information that might lead to your arrest so u must take a bunch of small critters (university students and women and etc) and use them as weapons and then kills everyone that stands in ur way of the presidency :) woops i guess u lost",
            "review_score": "1"
        },
        {
            "review_text": "Kicked some alien ♥♥♥ with the help of little green frog people. This game is extremely difficult at times, even bordering on unfair at times. But hey, if you haven't broken a couple keyboards trying to beat the god forsaken timed run mission, are you really playing a remake of a classic? I think not.",
            "review_score": "1"
        },
        {
            "review_text": "I used to play this game when I was a kid. I love the Oddworld games, but this is my favorite of all. The story is unique, the characters are charming and funny, and it does almost seem like a kids' game with adult aspects here and there. I love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Alright boys and girls, It's time to take a trip to the feels (Of nostalga) train Being that this is one of my most loved games as a kid, on the original xbox i had to see the diffrence of the strangers wrath HD And to be honest it dosen't look half bad! Now i may of forgotten alot of the stuff i learned when i played the game years ago but hey i don't care, strangers wrath is one of those games that after you'll beat it you put it down, and go out and do other things for a while like read a book or take a walk ( if you're a casual) that or just play a bunch of other games that kick-♥♥♥, and then after that, you can go right back into the odd world universe and love it. Well at least i can anyway  And for those who haven't heard or even played any of the odd world games, let me tell you about this one. Imagine a game like red dead redemption, mixed with loony toons adult humor version, with a slight touch of animal cruilty (Cry sum moar PETA) as well as a few touchy feely things that are going wrong with the main character (I won't spoil anything even though you learn about whats wrong with stranger in like 3 countracts into the game) and bam you got this, of course with a few other bits and bobs added to it to give it its own special feel  But in the end, i have to say this game i remember most in all my years of gaming simply due to how unique it is, and trust me, it is! have you played another game where you shoot bugs rodents and other forms of wild life at westernized foes and bag em or tag em while protecting a town of chicken people? No? Then shut up, sit down, and enjoy the ride becuase if there is any copy cat company that trys to make the same thing, their ♥♥♥ is getting blown out of the water by this game.  But seriously why are you still reading this? buy the damn game.  Also pro tip: Hard mode is really hard, would not suggest for casual gamers",
            "review_score": "1"
        },
        {
            "review_text": "I play Abes Oddesey to death (on both the PS and PC) wrote walkthroughs and guided people through the harder parts of the game. When they ported over to XBox I was shattered and stop playing the games. So when I got this game with a bundle it sat at the bottom of my library collecting digital dust, till today. Now I'm kicking myself for not getting this sooner.  There is a lot to say about the game now in HD. One the anmation and detail level is fantastic smooth. Sounds are great as well as the smak talk from some of your ammo. Add in the Oddworld sense of humor and boom you just can't turn your nose up at this game.   The michanic of using the different types of ammo to disable or trap you bounties is fantastic and so much fun. I played for the first hour and that's was it I had to make a review becase you have to play this. The ability to flow from FPS to third person was great too becase you could come at your enemys in different ways alowing you to snipe, stratigic or just power your way through.  For an old game with a new pretty skin this game tick a lot of boxes so I say buy it :)  4/5",
            "review_score": "1"
        },
        {
            "review_text": "If anyone is fan of the Oddworld games, and may have played this on the original Xbox, this is definitely something you should get. The HD remaster is brilliant. The game environment is even more lush than before; the live ammo and all of the characters look great. It also runs smoothly - permitting you have, at least, the minimum system requirements. And, with the added difficulty selection system, you can make this game more challenging than before.  Indeed, this game has been out for a while now, but I thought I'd review it just simply because it is a classic and, even now, it is still great.",
            "review_score": "1"
        },
        {
            "review_text": "Very underrated. You need to play this. M&amp;K actually work well.",
            "review_score": "1"
        },
        {
            "review_text": "I'm just a few minutes into the game and it is a lot of fun. Very funny stuff! Hahahaha. Get this for the lulz, plus, it has a great combat mechanic.",
            "review_score": "1"
        },
        {
            "review_text": "weird fun game. like the setting",
            "review_score": "1"
        },
        {
            "review_text": "Oddworld: Strangers Wrath is a third person shooter with elements of platforming and exploration.   The plot is relatively simple at first but gets progressively more complex and facinating the further you go on. You are the stranger, a lone bounty hunter who uses small animals as ammo in order to capture bounties. You are gathering all the money you can get your hands on in order to get an operation of some kind, one which will allow you to 'survive'. I wont spoil anything else about it, but the plot is well worth the price tag.  The gameplay is simple enough. You have a crossbow which can hold two types of ammo at any given time, each ammo type has a limited capacity of shots before you need to restock, and each one has a different function. Most are lethal, while some are none lethal, which is handy considering you get more money bringing in enemies alive. When you use the crossbow you enter a first person perspective and aim down the sights in order to bag'm and tag'm. However, when your outside of the third person perspective you go into a third person perspective where you can move much faster and do melee attacks, plus jump around and explore with impunity. To progress, you must go from town to town, completing all the bounty jobs in one town before you move onto the next, each one has an entirely unique level dedicated to them and different mechanics you must overcome in order to capture them. its much easier to kill them, but you get half the reward money. You can also buy upgrades in the town if you feel so inclined, or just punch the ♥♥♥♥ out of the chicken people for a while.  Around the final quarter of the game, it changes drastically, i wont spoil why, but suffice to say there is no longer any real reason to not kill enemies anymore, and it stops being about the individual bounty heads your collecting and the entire focus shifts. Now, while i understand why this occurs in the game, this sudden shift of tone rubbed me the wrong way, as i was enjoying the whole 'find and collect bounty' aspect of the game, but i would consider this a personal issue instead of an actual fault.  The game handles rather well, with only a few times i had to fight the camera (which happened maybe once or twice). The difficulty of the game does have a tendency to jump around however, one minute its very easy, the next its frustratingly hard. This can lead to some minor fits of rage, but rest assured these are only a minor aspect of the game and can be plowed through with skill, patience and a disregard for capturing the bounty alive.  Graphically speaking its an old game, but it still holds up quite nicely, it still has a certain charm to it and is very much of the PS2/XBOX era. The music in the game isn't particularly noticable, and when listened to on its own it has a few stand out tracks, but on the whole its not special, it does its job and doesn't distract or subtract anything, only adding to the overall tone.  Strangers Wrath is a classic and a very satisfying hybrid of first and third person action, i would recommend this to a fan of shooters or plateformers. fans of the wild west might enjoy the setting and plot of the game. really though, i would recommend this to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Played the hell out of it on PS3 and I'll play the hell out of it on PC.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: + Remastered HD version, better textures, better models, noticeably better graphics overall + Great level design + The game is aging very well, visuals are quite good even by todays standards + All the modern features added, achievements, antialiasing options, high resolution and widescreen support + Gamepad support + Unique and fun gameplay, let's you switch between TPS and FPS modes on the fly + Innovative weapons and ammunition + Engaging storyline  Cons: - After a major update the game still has some annoying bugs - Achievements are totally broken, you won't get most of them even if you should - Game supports Xbox 360 controller but fails to show you proper button images when you actually use it  Fortunately the game has no game breaking bugs. It actually is so fun and engaging that you probably won't mind occasionall inconsistencies. I can fully recommend this title.",
            "review_score": "1"
        },
        {
            "review_text": "The game is great. However, this is arguably one of the worst ports in the history of humankind. Do NOT GET: unless a.) theres a patch or b.) you have an xbox and you find this game in the bargin bin.  Again amazing game. Shamful unplayable port. If you want though grab it, you may get lucky and it may actually run without issues. But for a fair warning of your chances, check the steam forum out on this one first.",
            "review_score": "1"
        },
        {
            "review_text": "With good 'ol Abe, Oddworld was great and.. odd enough. But then! The Nameles Stranger bounty hunter appears in the Oddworld, things get greater and crazier.  A game EA games sabotaged, a game appeared whitout any adversiments. And yet!   ONE OF THE BEST GAMES I HAVE EVER PLAYED ON MY WHOLE LIFE.  Friends! Strangers! It's mini price definately gives you one of best experience you would gain while playing. I guarantee that.  Dont get Munch's Oddysee though, it was such a dream breaker. A cheap pile of crap.",
            "review_score": "1"
        },
        {
            "review_text": "just like how i remember it from my ps2. but now with grahics i can enjoy. highly reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "There's really no good reason to dislike this game (other than the port being kind of shady)",
            "review_score": "1"
        },
        {
            "review_text": "Kind of an old school shooter. Played it through on xbox originally, then bought it day 1 on Steam to enjoy it all over again! Its' story is far and above 95% of all other shooters I've played. Adds a neat stealth mechanic and even manages to stay fresh 10+ hours in. If you like westerns, shooters, steampunk, or anything oddworld, you'll like Stranger's Wrath!",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion one of the most underrated games of all time. It's not perfect, but I think it's very entertaining. It's one of those few games that perfectly blends first-person and third-person, and has eccentric, interesting characters suitable for a good movie. There's also a twist halfway through that completely changes the game. It's very bold, and it might make some gamers angry, but I've never seen it in a video game before and it really spices up the story. Even the dialogue is consistently humorous and provides an awesome western feel.",
            "review_score": "1"
        },
        {
            "review_text": "Great Adveture/Shooter/Platformer. Something that not many have played, and definitely an overlooked gem from an era where treasures like this were lost amongst the vast sea of 'Halo copycats.' Actually, I recommend every game in the Oddworld series, because I can find very little wrong with them.",
            "review_score": "1"
        },
        {
            "review_text": "An awfully bad port of a very interesting game. I'm waiting for them to patch it up and add the HD textures before I finish it. Oh, and I recommend getting a gamepad. This game doesn't even allow you to change controls via a game interface, you have to do it manually in a config file.",
            "review_score": "1"
        },
        {
            "review_text": "A very competent debut shooter from the wonderful Oddworld Inhabitants. Stranger's Wrath mixes the platforming, puzzlesolving and comprehensive world that made Oddworld a brand name with an interesting shooter element. Save a few of the everpresent problems that come with ports to PC, this is a well rounded and satisfying game, particularly for fans of Oddworld.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recomend this game. i used to have it for the original xbox when it first came out, and its even better now",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING game right here please buy it now you wont regret it. ive had an amazing time so far hunting bounties and shooting sassy chipmunks at people. the game has a nice mix of 3rd person platformer and 1st person shooter...though it doesnt do both perfect what it does perfect is how well blended it is.   9.5/10 also the money is called moolah so extra point 10.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Although my favorite Oddworld game is Abe's Exoddus, this is a close second. Unlike the previous games which are puzzle/cinematic platformers, this is a cocktail of an FPS, third-person brawler, platformer, and open world game (The open world is nothing large, but its competent). Above all that though, the main selling point of this game is the ammo. In this game you're not pumping lead into some random-♥♥♥ mercenarys, you're planning each move and thinking of fun ways to kill the many outlaws in the game. This is because you have bugs and small creatures for ammo, which can do a ton of things, like distracting enemies with the very annoying chippunk, or wrapping outlaws in webs to keep them on the ground for a easy capture with the bolamite.   The game also has a fantastic sense of humor, as per usual with the oddworld series, and a lot of boss fights (Although a few are questionably designed). As for story, Its not as complex as the stories in the main quintology, but its still good, and it provides a good amount of lore for people who are interested in it. (Like me)",
            "review_score": "1"
        },
        {
            "review_text": "This has to be one of my favorite games of all time. Very few games make me wish they were longer. Out of all the oddworld games this one is the best. You use a mix of third-person platforming, and first-person shooting. It mixes very well. You spend most of the game fighting outlaws as a badass bounty hunter, but there is a still an amazing story to go along with it. It is also full of surprises. I recommend this to anyone that loves playing video games.",
            "review_score": "1"
        },
        {
            "review_text": "a classic that is a must buy",
            "review_score": "1"
        },
        {
            "review_text": "I've always wanted to try this game and, having finally had the opportunity, the wait was well worth it. The graphics may be a bit dated, but the art style keeps it looking pretty decent looking all these years later. It's the puzzle-esque enemy encounters, interesting western vibe, and strange humor that make this game a must-play. Luckily they fixed the equally odd performance issues that plagued the game when it was first released.",
            "review_score": "1"
        },
        {
            "review_text": "i had given this game a bad revue due to it's 1fps game rate, this is my ammended revue since i got it working by tinkering with .exe properties, it is a very good 3d smash and bash shooting 3d platformer, remember to go to your main game .exe in (your drive, eg C:)ProgramFiles(x86)/Steam/Steamapps/common/oddworldSW and set .exe to run on on earliest windows versions",
            "review_score": "1"
        },
        {
            "review_text": "I may not have played this much yet, but I emediately realised that it was as amazing as I remembered it to be from the old days. The next thing I realised was that I had forgoten that when they ported it in HD they did not add any custom button layout options at all... That honestly disapointed me a bit, because you either have to take your hand off of your mouse or ASDW to switch ammo types with the arrow keys... Nah, no, that's not where that goes. It should all be on the left side of the keyboard. On a controller, reload should be the left-most button(X), melee is the right-most button(B)-- everyone knows this.",
            "review_score": "1"
        },
        {
            "review_text": "As someone born in 94 I wasn't really into the old sidescrolling Abe's games but never the less this and Munches Oddysee have always been favourites of mine, always been hopeful that some day we'll see more of Stranger or even more of Abe &amp; Munch in their 3D world (Abe was great fun in Munches Oddysee).  So yeah, I highly recommend this, and as far as less adult but still gritty goes this is the game for that, a hardened somewhat dark world with that oddworld sorta semi-brutal style but still relitively kid friendly.  So yeah, really reccomend this even if you haven't experienced oddworld yet as it's a great time all round.",
            "review_score": "1"
        },
        {
            "review_text": "TBH. I never played an oddworld game in my life before this. an even then you can see at time of review, I only have like almost 3 hours. When I saw this game debut way back when I was a teen on the verge of manhood. it filled me with such excitement, the very concept of this game. at the time I THINK 'Gun' was around and I absolutely loved that game. This looked like that with a fantasy twist.   So, to the game - It opens up with a cutscene, our Hero is collecting some critters you see him afterwards setting them up on the ground nice like. Orderly. he then procedes to cover them with brush. A few seconds later We see a big ol'fatty chasing something through some wooded brush, vines everywhere. Its quick. Hes consistently popping off rounds with his blunderbuss, an just as consistently missing. Eventually we see what hes chasing is actually our hero, a Feline like bounty hunter. Got the raspy cowboy voice an all. Leather vest, Cowboy hat. He quickly turns the chase around onto the other fella chasing him. He leads him to where he had laid those little critters he collected earlier. Turns out he was just leading the guy on all along. he had a trap waiting for him. Nasty little buggers jump and start gnawing on any part of that bubblin fool they can sink their teeth into. Our Hero, procedes to use another spider like critter to than ensnare his catch. Wanted, Dead or Alive. Luckily for him, The Hero, Known as the Stranger. Does not use firearms.   This game is basically Dog the Bounty Hunter with Furries.",
            "review_score": "1"
        },
        {
            "review_text": "The HD Update is finally here and Oddworld looks amazing. With new achievements and controller support alongside the new textures and insanely twisted humor, Stranger's Wrath HD is a must for a good time. Although this isn't quite the AAA title of the century, it's a game for having fun and enjoying hours of entertainment. I remember first playing this title upon release and spending hours on end. The HD Update is like a fresh coat of paint that only increases the experience. - 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Although the story was interesting, The in-game dialogue tends to be repetitive and annoying, especially when you meet the grubbs and their high-pitched voices. The bounty/boss fights tend to be nothing more than the boss enemy spamming just 2 attacks at you repetitively, which is incredibly annoying when the boss is capable if immobilizing you with one of his/its attacks. And sometimes your movement will glitch up and freeze you in place until you fiddle with the controls for several seconds trying to get Stranger to start moving again.",
            "review_score": "-1"
        },
        {
            "review_text": "I had this game on the original Xbox and fell instantly in love. It truly is one-of-a-kind, and if you're a fan of the Oddworld series you should definitely give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "This is an incredible game that more people should play",
            "review_score": "1"
        }
    ]
}