{
    "app_id": 1600,
    "name": "Dangerous Waters",
    "release_date": "2006-02-07",
    "developer": [
        "Sonalysts"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Naval"
    ],
    "achievements": 0,
    "positive_ratings": 140,
    "negative_ratings": 44,
    "price": 22.99,
    "description": "S.C.S. - Dangerous Waters allows you total control over multiple air, surface, and submarine platforms in a modern-day naval environment. Take direct control of individual crew stations and also plan and execute combined arms naval strategies from a top-down 'Commanders Eye' perspective.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/1600/header.jpg?t=1447350835",
    "minimum_requirements": "Windows XP, 550Mhz CPU, 128 MB RAM, D3D Video Card with 32MB RAM (DirectX 9.0b drivers), DX9 Sound Card, 590MB hard drive space, Internet or LAN connection for multiplayer Recommended: 1GHz+ CPU, 256 MB RAM, D3D Video Card with 64MB RAM (with DirectX 9.0b compatible drivers), 1GB hard-drive space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Dangerous Waters is, without doubt, the BEST naval/submarine sim I've ever played, and I've played more than a few in my day. The fine folks at Sonalysts really did their homework when they were creating this game, since nearly every aspect of it oozes a level of realism that you're hard-pressed to find in most other games these days. I truly believe that the gameplay you experience in Dangerous Waters is a very accurate portrayal of actual naval operations and procedures in practice today; every vessel and weapon you will encounter has been meticulously reproduced according to real-life records. Hell, I could probably operate my own Los Angeles or Seawolf-class sub singlehandedly thanks to what I've learned from this game regarding their operation. Let it never be said that videogames don't teach you anything.  This tremendous level of immersion comes at a cost, however. Dangerous Waters is not so much a 'game' as it is a genuine training siumlator, and as such has an extraordinarily steep learning curve that simply can't be overcome without first reading the manual and running a few practice missions as tutorials. However, even that won't fully prepare you for what you'll have to deal with once you finally take to the open seas, where even a single torpedo is usually fatal, and a compromise in stealth can ruin an entire mission. Dangerous Waters demands patience, dilligence, and a certain enthusiasm for submarines from its players if they hope to develop any real skill for it.  Dangerous Waters is not for the faint of heart, but it can be a very rewarding experience if you take the time to learn the finer points of its gameplay. You may have to lose a boat or two or a dozen before that finally happens, but that's merely half the fun!",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion this is the best naval warfare simulator. It features 4 kind of platforms: Submarines (SSK and SSN), Frigates, ASW Helicopters and ASW Aircrafts. Each aspect of this warfare in modeled in the smallest detail. From the acitve/passive sonars to the torpedoes guidance/homing. From the thermocline to the sonobuoys. Currently there are 3 mods to bring more realism to the sim. The 1st is the Reinforce Alert (Current version : 1.40) that is an overhaul of all the sim. Graphic, Sensors, more playable platforms, new weapons and systems etc. The 2nd is the Lwami mod (Current version : 3.11) that is a kind of sensors revamp. Is more stable compared to the RA but is less 'furnished'. The 3rd is the Alfa Tau mod (Current version : 3.1) that is a mix between the RA and Lwami. It adds a bunch of platforms and is stable like the Lwami.",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of, if not THE greatest Naval combat simulations, its truly amazing!",
            "review_score": "1"
        },
        {
            "review_text": "If you have windows 8 or higher, then you might as well say that the devs can throw a F*** party and only invite themselves. I am just lucky I got this on sale. I only waisted 4 bucks!",
            "review_score": "-1"
        },
        {
            "review_text": "can u fix dangerous waters for me it will not let me play the game can u fix it please",
            "review_score": "1"
        },
        {
            "review_text": "Awesome by yourself, has no equal with friends",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! I haven't figured out how to do any fighting yet, but it's just fun to dive the Submarine too deep and watch it crumple!",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to play this game but it won't load got it in the 4 pack for $29.99 played with some of the other games first, BIG MISTAKE this one wouldn't load so I can't get any money back which is crap the graphics on the other games are poop.",
            "review_score": "-1"
        },
        {
            "review_text": "Does staring at an underwatter sensor array screen interest you? Yeah probably not. I'd only recommend this to people who really love modern naval simulations. Like a lot of sims it's 99% boring and 1% pure bliss.",
            "review_score": "1"
        },
        {
            "review_text": "Have never seen a sub simulation game as good as this one before. You won't find any other like this one. Very realistic in the gameplay. Maybe the graphics are not as good but don't need them at all.",
            "review_score": "1"
        }
    ]
}