{
    "app_id": 16000,
    "name": "Discovery! A Seek and Find Adventure",
    "release_date": "2008-07-29",
    "developer": [
        "MumboJumbo"
    ],
    "publisher": [
        "MumboJumbo"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Hidden Object"
    ],
    "achievements": 0,
    "positive_ratings": 20,
    "negative_ratings": 29,
    "price": 6.99,
    "description": "Break out your magnifying glass and passport-It's time for Discovery!, the seek-and-find game show with your host, Jerry Landers and the beautiful Jill Summers. Step up to the wheel, and choose today's adventure! Will it be Spain, China, Australia, or one of three other fabulous international hot spots?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/16000/header.jpg?t=1447351379",
    "minimum_requirements": "Supported OS: Windows 2K/XP/Vista                        Processor Speed: 800 MHz                        Memory: 256 MB RAM                        Graphics: 64 MB DirectX 8.1 compatible graphics card                        DirectX Version: DirectX 8.1 or Higher                        Sound: Sound Card                        Hard Drive: 167MB Free Hard Drive Space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I've played this one a lot, to engage the top level of my brain while I'm trying to figure out something else with the other parts of my brain. It's fun, a little mindless, but not in a bad way.",
            "review_score": "1"
        },
        {
            "review_text": "I really liked the game show idea of this game, but it's, sadly, horribly boring. The first show is ok, and then it's just repetitive from there. I think the other contestants have all been lobotomized. I'd expected them to get harder to play against as you unlocked them, but they don't. I was going to play it till the end and then uninstall it, but I lost the will to live on the second last game. The graphical style is horrible, and makes every image look the same. Did you ever play sims 1, and download an object which sat at completely the wrong angle, was very 2 dimensional (even for the sims 1) and the texture didn't fit the game. That's what the graphics in this game reminded me of. It's like someone gathered up all those objects and pasted them onto postcards to make this game. I'm normally quite easily amused by trivial games, but I wouldn't play this again. There are much better HO games out there to waste my time on without regretting it. If you like HO games and are looking for one that's a bit different I'd recommend Pickers, which is made by Mumbo Jumbo as well.",
            "review_score": "-1"
        },
        {
            "review_text": "For a Seek and Find, this one was pretty stoopid. I get the whole be different kind of seek and find, but as a game show just doesn't work for me. Uninstalled and perma banned.",
            "review_score": "-1"
        }
    ]
}