{
    "app_id": 16450,
    "name": "F.E.A.R. 2: Project Origin",
    "release_date": "2009-02-12",
    "developer": [
        "Monolith"
    ],
    "publisher": [
        "Warner Bros. Interactive Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Horror",
        "FPS",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 3274,
    "negative_ratings": 509,
    "price": 9.99,
    "description": "Deployed just minutes before the blast triggered by the original F.E.A.R. team, you assume the role of Special Forces Sgt. Michael Becket as your routine mission quickly turns into a fight for survival against the wrath of Alma Wade.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/16450/header.jpg?t=1461103307",
    "minimum_requirements": "Minimum                     Operating System: Windows® XP SP2/Vista SP1                      Processor:  P4 2.8GHz (3.2GHz Vista)/Athlon® 64 3000+ (3200+ Vista)                     Memory: 1GB (1.5GB Vista)                     Hard Disk Space: 12GB Available Hard Disk Space                     Video Card: Fully DX9-compliant graphics card with 256MB (SM 2.0b).  NVIDIA 6800 or ATI X700                     DirectX® Version: 9.0c                      Sound: DX9.0c compliant                     Internet Connection: Broadband",
    "recommended_requirements": "Recommended                     Operating System: Windows® XP SP3/Vista SP1                      Processor:  Core 2 Duo 2.2GHz processor family/Athlon 64 X2 4400+ (required for MP host)                     Memory: 1.5GB                      Hard Disk Space: 12GB Available Hard Disk Space                     Video Card: Fully DX9-compliant graphics card with 512MB (SM 3.0).  NVidia® 8600 GTS or ATI® HD 2900 XT                     DirectX® Version: 9.0c                      Sound: DX9.0c compliant                     Internet Connection: Broadband (768kbit/sec upstream required to host 16 players)",
    "reviews": [
        {
            "review_text": "Rating: 7.5/10 Overview: FPS with the ability to go into slow-mo   The Good:  +Game looks good both artisically and technically. Game also makes good use of lighting  + Game has a variety of weapons and grenades. Certain weapons are very creative while others are what you would expect in a FPS  + The game has really solid level design. In addition, the game takes place over a series of different environments and locations. One of my biggest complaints in the first FEAR was that the environments were too similar and felt repetitive so it's nice to see this was fixed in the sequel.   +The shooting mechanics feel good, going into slow-mo and shooting enemies is always fun. The game also introduces sections where you ride a mech to change up the gameplay.  The Average:  The AI feels average compared to the first FEAR. The first game was renowned for its amazing AI and to this day I still think it sets the standard for AI in a FPS game. This game though doesn't seem to have that. The AI is not bad by any means, however compared to the first game it doesn't feel close.  The horror elements are not as a good as the first game. Between finding a balance between action and horror the developers chose action. There are certainly plenty of times the game tries to invoke scares but sometimes it just comes across as flat.   One of the most satisfying weapons in any FPS game was the shotgun from the first game. In this game, the shotgun doesn't even feel close to satisfying.   I found the game to be very easy even on the normal setting, play on hard if you want a challenge.   The Bad:  - The dialogue in this game is terrible. It makes the story feel like a straight to home video release. It becomes difficult to take the story seriously or be afraid of what's around the corner when the characters are saying things that just make you shake your head.    -The game has a certain flow to it but the entire ending gameplay segment feels frustrating and out of place.   -Multiplayer is dead  Conclusion  On the one hand this game does things a lot better than the first, on the other hand it also doesn't seem to improve any of the flaws and in some cases makes it worse. What could have been a really great horror FPS game turns into you standard run of the mill FPS game. For a FPS game it is very solid and should provide you with a 5-6 hours of fun.  ",
            "review_score": "1"
        },
        {
            "review_text": "Exposition Firefight Firefight Jumpscare Firefight Jumpscare Jumpscare Firefight Jumpscare Firefight Firefight Larger Firefight Interval End [Repeat x6]",
            "review_score": "1"
        },
        {
            "review_text": "It's fine. Like incredibly fine. No it's not the scariest thing, nor the best shooter I've ever played. But playing through FEAR 2 is enjoyable. You're going to have a good time toiling about killing things and experiencing one of the most genuinely 'video gamey' stories out there. It feels so authentically 2009 in it's presentation and design, that it's almost a nostalgia driven delight to play through.",
            "review_score": "1"
        },
        {
            "review_text": "Played F.E.A.R. several years ago with a buddy of mine, great game even though my memories are now almost gone..  F.E.A.R. 2 Project Origin is quite a beautiful sequel: it's an 'old school' First Person Shooter, you know about that: get the ammo, medpacks and fight replicas (enemy soldiers) while following Alma's trails (main story).  The most peculiar feature of this game series is time reflex enhancement which lets you slow down time, giving you a tactical advantage over a crowded enemy line. Game is plain simple, advance to next level taking down enemies and that's pretty much about it but you have nice weapons, different type of bad people along the way - not only soldiers but visions and monsters/creepy creatures. The setting is dark and there's plenty of blood, gore; visual effects are very well done too, vivid colors and spark lights contrast the black surroundings.  Gameplay gets entertaining from the beginning to the end because there are many cutscenes, the story is well told and developed: you could say this is a 'complete' FPS which doesn't go down in any aspect - it may not be a masterpiece but I think it's worth playing, especially 'if you already had F.E.A.R.' :)",
            "review_score": "1"
        },
        {
            "review_text": "'They get what they want and they never want it again' Courtney Love  I think this is a sad case of super human developers 'who listen' to us mere mortals.   We didn't appreciate the original's stripped down, function corridors designed as a showcase for ALL the sparks and particles (as well as the cutting edge A.I. and gun play). So they gave us these beautiful and 'bioshock detailed' locations (special mention to the school).  We complained it was too grey...now we have neon blue sparks, strawberry jam blood. and a wide variety of locations and pallette.  We said it was a bit repetitive, so now we have these mech levels...  At this point of community ♥♥♥♥, we got our own way and basicly this franchise , which at one point was like the second coming of the fps genre along with HL2 was basicly left VERY pretty and crying in the shower. Just another Z list shooter.  I realy like it, but i realy miss that pornographic emphasis on particles.  As it is , its a shining example of the genre and a realy cool development of the origninals story",
            "review_score": "1"
        },
        {
            "review_text": "This game was fun but went downhill the longer it went on. You could really predict when the combat was about to start because the pacing was pretty much the same throughout the whole game. The best part was that I finally understood that most of F.E.A.R. 2 could have been cut and...well the rest of that thought would be a spoiler.  Oh, and I had to change the difficulty from Hard to Normal at the very end because it was over-the-top difficult. I hate when I have to do that. I'm all for a challenge, that's why I set it to Hard in the first place. But when you go overboard and bump the difficulty of the last levels from Hard to Yeah-You-Aren't-Finishing-The-Game-At-This-Difficulty you ruin an otherwise engaging experience.  Like in the first F.E.A.R. I had fun again but I don't know why. The story wasn't too compelling, the gameplay was predictable (or I'm getting good at seeing arenas when they are shown to me) and the entire premise is just...forced. But it's a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best shooters ever. What is more it has aged much better than the first FEAR.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Just great as F.E.A.R. 1, but this is a sequel with updated visuals. I recommend playing this at night, it creates a horriffic atmosphere, there are thankfully no cheap jumpscares and the horror scenes are done very well, but most of the time the 'flickering' is being used too much and from point it stops being spooky.  As for combat it feels like a call of duty game (Unrealistic weapon Recoil), headshots do more damage but dont instantly kill the enemy, and yes as you expeted from the previous game, the AI is actually tactical and well made.",
            "review_score": "1"
        },
        {
            "review_text": "Granted, I finished this game in basically 2 sittings; yesterday and today; May 1-2, it was a fantastic experience. There were answers and tidbits of information throughout, there was atmosphere, some occasional scares, sci-fi mystery, the action is far better than the first FEAR thanks to things like iron sights and select fire as well as the different grenades/explosives you have at your disposal. The story was, for me, quite engaging. I was very interested in finding out how things progressed, and the end had me looking forward to FEAR 3. Well, you can check my review on that if you like, but here's the several paragraphs of hatred summed up in 2 words: It Sucked.  I find FEAR 2 to be by far the best in the series, FEAR 1 is 2nd best with monotonous but acceptable combat as well as great atmosphere, and FEAR 3 is... well, let's not ruin the moment by bringing that up again. I wholeheartedly suggest getting this game, and while I think it'd be good to play FEAR 1 first, I definitely think this game can be enjoyed without doing things chronologically. Just... make sure you STOP at FEAR 2, unless you don't give a ♥♥♥♥ about story or firearm realism, just wanting to blow stuff up with the occasional little needless spook from Alma or other unexplained monsters. Maybe FEAR 4 won't suck... but if it still focuses on that ridiculous 'brother' nonsense, screw that...",
            "review_score": "1"
        },
        {
            "review_text": "Far scarier than most FEAR lovers will admit. Some of the most heartpounding moments in my video game history have come from this game (I'm looking at you, Elementary School).",
            "review_score": "1"
        },
        {
            "review_text": "The only other game I played where I ♥♥♥♥ my pants thus much was Amnesia and thats a strong contender. I'm surprised I didnt play on the toilet due to the state of my underwear after every appearance of Alma. The story is gripping and the combat works well, which combine to give a game that's both challenging and enjoyable. Bring on F.E.A.R. 3! ",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R 2 is a divisive game amongst series fans, and the majority of the hate it gets doesn't make sense.   There's only one real complaint I have with F.E.A.R 2, which is the game just doesn't seem to have the same level of care as the original.   By level of care, I mean: -The FOV needs to be set through a .cfg  -You can't lean -There's a weird delay to sprinting -The hud is terrible -The game feels slimmed down.   They're all minor quips, but they're noticable. If you're willing to give it a chance, F.E.A.R 2 is a worthy successor that I feel surpasses the original in some respects. It's not as good as Extraction Point, but it's a game that's definitely worth a play. It does suffer from Wolfenstein: The New Order syndrome, so know that the game gets much better after the first three chapters.  Play on hard and make sure to get the fixed hud mod through me or google because the standard hud is straight fugly.",
            "review_score": "1"
        },
        {
            "review_text": "Not as atmospheric as the first, probably because we have seen it before but it does look prettier. Alma rules!",
            "review_score": "1"
        },
        {
            "review_text": "options/10 made me spill my extra hot, no whip, white chocolate macchiato.",
            "review_score": "1"
        },
        {
            "review_text": "One of the only games that makes me scream like a girl...alot.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth playing, the graphics are up to date, game can be played in 4k resolution too. They have added a few more jumpscares compared to the first fear series. Takes about 6 hours of straight playing to finish the game. I abolutely favor this game over FEAR 3!!   RECOMMENDED!",
            "review_score": "1"
        },
        {
            "review_text": "My favourite chapter :)",
            "review_score": "1"
        },
        {
            "review_text": "Less spooky scary than the 1st game but oh....oh that sweet sweet chocolate covered herion that is the F.E.A.R. combat is still here (mostly)  Verdict: Buy it on sale and strap the hell in!",
            "review_score": "1"
        },
        {
            "review_text": "What is F.E.A.R. 2: Project Origin? -- F.E.A.R. 2 is the successor of F.E.A.R., an immersive psycho-horror FPS with a fantastic bullet time mechanic. -- -- Who would most enjoy F.E.A.R. 2? -- If you loved the first F.E.A.R. game, you'll most likely love this title as well. That being said, if you felt the first game was too visually dated for your tastes, or too mechanically clunky, the game has improved leaps and bounds in that department. The game also favors action packed gun-battles a little bit more heavily than the first. The tension is very slightly lighter than the first game, but it holds enough strengths to more than compensate for this. -- -- Over-all: 80.0% As a whole, F.E.A.R. 2 is a more solid title than the first game, and will appeal to a wider audience. That being said, some of the elements that make F.E.A.R. 2 a better game as a whole, slightly subtract from the immersive experience that was the terrifying glory of the first F.E.A.R. game. -- Mechanics: 4/5 The mechanics are a definiteive improvement here, over the first game. Movement in much more fluid, bullet time is possibly even more smoothly integrated, there's more interaction with the world and terrain, the AI is very well done this time around, and as a whole, the game feels very appropriately smooth and fluid. -- Experience: 4/5 In the five years between the release of F.E.A.R. 1 and F.E.A.R. 2, the developers have come along way in improving the audio and visuals of the game. The game went from passibly average looking (just enough so's to not distract from the experience) to downright gorgeous. The textures are fairly average, but the artistic embellishments in conjunction with the fantastic visual effects definitely help this game shine. The audio has also taken a massive leap, helping tie the experience together. With all that being said, the psycho-horror elements of the game have been toned down just a touch, and that in combination with a few crowd pleaser moments, and the addition of collectible bits of intel, actually subtract from the experience slightly, in my opinion. The game is still fantastically immersive, and will draw you in, unlike many other titles to date, but in comparison with the first title, I feel F.E.A.R. 2 sacrifices a chunk of it's biggest strength -- the raw gripping psycho-horror elements, for a few fun, but unnecessary scripted gun battles. Balance: 4/5  -- Longevity: 4/5 The game is slightly shorter than the first game in the series, containing only 14 missions of roughly 30-45 minute length each. That being said, it doesn't rely solely on the immersive experience, unlike the first game, and provides a number little bits of intel for the player to run around and find, if that's your thing. There may be room for a second playthrough with F.E.A.R. 2, between looking to find the rest of the missed bits of intel, playing through on a higher difficulty, or simply just to enjoy the beauty and fluidity of the game for second time.",
            "review_score": "1"
        },
        {
            "review_text": "I thought this one had better gunplay over the original, though the horror atmosphere is not as effective this time around. Visually improved dramatically over the first F.E.A.R.  Still a fantastic FPS-horror worth trying out. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Fers the beats",
            "review_score": "1"
        },
        {
            "review_text": "awesome game(once again, F.E.A.R series is really impressing me so far) but it's ♥♥♥♥ing ruined by another ♥♥♥♥♥♥ ending with alot of questions marks and short gameplay  Overall 8/10. Would've been 9 if it was longer",
            "review_score": "1"
        },
        {
            "review_text": "Is it scary? Not really, but there's ♥♥♥♥, guns, a health bar, and when it's over you can always relax at the blood-filled pool or the psychic-experimentation school-facility.",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "+ great graphics + cool story + nice locations + nice slowmotion combat system + cool horror part + linear shooter like cod  - not as much horror and shock moments as in FEAR 1 - i never got scared -.- - 4 HOURS LONG WTF - horrible controls - terrible fov - worst interface - weird mouse acceleration (?) even when you use V-Sync to limit your fps to 60.   for the time its a nice shooter and only on the niveau of an call of duty. If you seek horror, play F.E.A.R. 1",
            "review_score": "1"
        },
        {
            "review_text": "A decent sequel to F.E.A.R. The best visual design in the whole series – something more than just gray walls of underground complexes. Not much of horror in it and AI behaviour is simplistic making the enemies easy targets. However, the story is pretty good and it answers many questions I was previously confused about.  What I didn't like was that it wasn't always clear where to go and that the quick save feature is removed.  Nevertheless, it's a good game and I recommend it to all fans of the franchise.  My overall rating: 7.5/10.  Many say that F.E.A.R.3 was the worst game in the series, but I think that Project Origin is the one that deserves the third place.  F.E.A.R.2: REBORN DLC: you play as one of the replica soldiers guided by Paxton Fettel, who is dead at the time (shot by Pointman in F.E.A.R.). In terms of gameplay, Reborn is like Extraction Point, but much more sloppy. It offers only short 5 episodes (an hour of gameplay). There's not much of a story and enemy spawning and positioning isn't thought through well. It would be acceptable for an euro or two, but for 8 €, it's a steal. NOT RECOMMENDED.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like fps? Buy this game. Do you like horror? Buy this game Do you like mechs? BUY THIS GAME. DO YOU LIKE TO GET ♥♥♥♥♥ BY A 16 YEARS OLD DEAD CHICK? BUYYYY THISSSS GAMEEEE!",
            "review_score": "1"
        },
        {
            "review_text": "If there was a neutral instead of negative, this would get it.  Where as it isn't bad game, it's mediocre compared to first game. If first game felt like an Half-Life gameplay wise, this feels like Call of Duty. It's also pretty short. Guns don't have much punch in them, and the combat feels boring.  Maybe if I didn't play it back to back with first game, it would've been more enjoyable, but only thing that this game does better is the looks. I was surprised when I launched the game that damn these graphics are quite good compared to first F.E.A.R.   But everything else it lacks.  If you liked first one, and want to complete the story, play this. If not, it's just a mediocre shooter.",
            "review_score": "-1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "A good mix of spook and challenging yet reward combat.",
            "review_score": "1"
        },
        {
            "review_text": "Played after Fear 3 and it's definately a scary game (out in 2009 played in 2013) almost more than the third... Screenplay not really original but perfectly executed : visual effects, animations, feelings and unexpectedly bursts. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A really good and scary shooter.",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R. 2 takes place concurrently (only for a short time) and during the aftermath of the first F.E.A.R. You play a SFOD soldier named Becket whose team is grabbed by Armacham, juiced full of experimental drugs, and then sent on a mission to stop Alma while chasing down leads on the how and the why of it all. You get the gist of the story in radio communications and in-game cutscenes but all the details are in logs scattered throughout the levels, similar to the first game but there's a lot of more of them this time.  F.E.A.R. had amazing graphics at the time and Project Origin doesn't disappoint. The effects are similar to the first game with lots of sparks and dust when the bullets fly. The best looking effects come when you're having hallucinations. Colors fade, return, your view goes blurry and sharp, lights flash on and off. It's impossible to describe effectively.  A big complaint about the first game was the lack of variety in environments. It was a lot of offices and industrial areas. Personally it didn't bother me much, but Monolith took it to heart. Of course there's more offices and industrial parks but there's also a school, a medical facility, research labs, and the destroyed streets of Auburn. You never feel like you're walking the same corridors over and over and no one environment really overstays its welcome.  F.E.A.R. 2 also has the same fantastic gunplay that the first game had. Enemies are quasi-intelligent in dropping for cover and flanking your positions. That said, on normal difficulty, the game never gets too hard. I don't think I died a single time. Between the abundance of armor and health packs, the whole game is just a little easy. The only nuance that threw me at the beginning is that when you hit the slo-mo button on and off, there's a little bit of a spin-up and spin-down. It was basically an on-off switch in the first game so having a second of delay really threw me off at the beginning.  My favorite part of this game were the areas where you get to stomp around in the elite power armor. It isn't just for the amazing amounts of firepower the elite power armor brings, or the carnage of the fights you get into with it, but the effects while you're in it. As it takes more damage, alarms scream, the screen gets distorted, and warnings flash manically. It's a hell of a lot of fun and really makes me clamor for Monolith to make good on the easter eggs it's put in recent games and make a sequel to SHOGO: Mobile Armor Division, a mech game they made a decade ago.  There's no easier way to put it: F.E.A.R. 2 is an awesome first-person shooter. I played through it all in a single day, which is a task I don't think I've ever done. It's basically amazing.",
            "review_score": "1"
        },
        {
            "review_text": "If you played F.E.A.R you will love to know what happend in the aftermath and continue the story or have you succumbed to the telepathic mental terrorism and nightmare that is Alma, trust no one, steel yourself and face your demons.",
            "review_score": "1"
        },
        {
            "review_text": "For me not as good as the original, too much emphasis on pure shooting and less on the horror that made the original so good for me, still a decent game that holds up now 7/10",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R should short for: Furiously Enjoying Alma's ♥♥♥♥. LOL",
            "review_score": "1"
        },
        {
            "review_text": "I actually seem to be in the minority of people who thinks F.E.A.R. 2 is even better and scarier than the first game. Dat HUD! It is also a much more visually impressive game. One of my favorite FPSs of all time, all time. Go play it. What are you, scared? Well you should be! Now go play it. What are you, scared? Well you should be! Now go play it. What are you, scared? Well you should be! Now go play it. What are you, scared? Well you should be! Now go play it. What are you, scared? Well you should be! Now go play it. What are you, scared? Well you should be! Now go play it. What are you, scared? Well you should be! Now go play it. What are you, scared? Well you should be! Now go play it. What are you, scared? Well you should be! Now go play it.  Also, the Reborn 'expansion' is very short and kinda pointless if you ask me. And to think I got all excited about it back in 2009... I thought it would be like Extraction Point or Perseus Mandate for F.E.A.R. 1. Nonetheless, I ♥♥♥♥ing love F.E.A.R. 2. Now go ♥♥♥♥ing play it already. What are you, scared? Well you should be! Now go play it.",
            "review_score": "1"
        },
        {
            "review_text": "It is simple with this game... it is better than FEAR 1 and even FEAR 3. That it is.  + ALMA + scary Alma + (spoiler) sexy Alma + (spoiler) pregnant Alma + very good story + atmosphere + intensive shootouts  - short (as all FEAR games) :(",
            "review_score": "1"
        },
        {
            "review_text": "aggressively mediocre",
            "review_score": "-1"
        },
        {
            "review_text": "This FPS was so lousy that I barely remember what I played. Not really scary, more action than anything. Storyline didn't really hold my attention. Weak sauce for the caliber of games that are coming out now.   I liked being in the Mech. That was about it. Meh.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "F.E.A.R. 2: Project Origin:  Intro:  Alma is back in the second game of F.E.A.R. named F.E.A.R. 2: Project Origin. If you enjoyed the first game this will be worth your money.  Do not expect this game to be a better version of the original game – there is no such a thing!  This game got some improvements compared to the first F.E.A.R. game, but a lot of downsides as well.  Graphic, controls, performance, &amp; sound:  Graphic: The overall graphics got enchanted to look shinier and more modern - I especially like the blood which looks a lot more like liquid compared to the first one, plus an added effect, bodies also drop organs sometimes when they explode - however I miss the random body part (like a arm or a leg) that could fly off into the distance from the first F.E.A.R. game. Generally effects like: explosions, bullet impacts on surface or ground and shotgun bursts, looks absolutely terrible in my option, its way to white/yellow and without any detail, looks like something done in a hurry and is very a shame!  Controls: All controls can be customized and is a great way to use your own key liking. Also a new thing in F.E.A.R.2 is the sprint mechanic, however one thing I didn’t like is that you cannot toggle it on and off; if you toggle on your sprint it’ll last as long as the sprint meter is up, that can lead to awkward situations where you just need to stop up in a hurry even a half second faster count, if trying to avoid incoming attacks or taking cover.  Performance: I haven’t had any performance issues at all running the game maxed out, always on a steady/capped 60 fps even on a low-end CPU and a small amount of ram.  Sound: The sound effects work very well to create the dark and creepy atmosphere this game is going for. A common thing in the F.E.A.R. series is a high pitch noise whenever a scare is coming up, if I like it or not is the question, one could say it is hard to be taken off guard with such a mechanic.   Horror:  Scares in the world of F.E.A.R. is a great thing, and I like that Alma appeared this much in the second game, however, the same kind of scares appeared way too often which only made it annoying and predictable. Asides from the point on scares (jump scares) this game has a surprisingly large focus on the small and creepy details of the horror genre, if one is to explore around like I did on my second walkthrough. I found a lot of things that I missed blindly first time, simply because I didn’t notice it, and that’s something I admire of a horror game. “You may not even realize they could be watching yah, aye?”  Artificial Intelligence:  The AI replica soldiers got a lot dumber compared to the first F.E.A.R. (or its expansions), their behavior is too monotonous, which makes killing them a little tedious and like a routine you go through.  Their awareness is also not working like it should: Moving from floor 1 and up in the right side by the stairs, the AI’s standing on the left side of floor 2 spotted me, because I had a flashlight on (they yelling: we got a flashlight over here) – even though a wall was blocking their sight on floor 2. Uh makes sense? I think not!  Overall:  Even though this review may sound rather critical and demeaning, I do not mean any of it in a negative manner, and the game does have its good moments. This review is simply based on my own perspective, from my experience and thoughts about the game and I’ll certainly recommend it if you enjoyed the original F.E.A.R. game or its expansions and couldn’t get enough. The playtime value is about 12 hours.   F.E.A.R. 2: Reborn:  A very small DLC to the original F.E.A.R. 2: Project Origin.  I am not very impressed by the DLC due to the leak of new content.  One thing the DLC did provide was some missing information for the 3rd F.E.A.R. game, but that alone isn’t worth getting the DLC for, in my option.  Very low playtime value, I completed the DLC in less than an hour.",
            "review_score": "1"
        },
        {
            "review_text": "FEAR 2 isn't a bad game, but the first was far superior. Pick it up on sale, you won't be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Really stupid. First one is better.",
            "review_score": "-1"
        },
        {
            "review_text": "soooo good! i think this is the last great F.E.A.R game as fear 3 was just silly and the mmo...well...anyway. still has the great jumps and eeps like the 1st and looks good plays well and great story.. in fact im going to reinstall it now (limited hard drive space) and re play it again!",
            "review_score": "1"
        },
        {
            "review_text": "This is a GREAT game. It's not as good as F.E.A.R. 1, but is still a very good installment of the F.E.A.R. series. The gun play is fun, the environments are varied, and I love how some enemies have tanks on their backs and when you shoot them, the person wearing it totally explodes. I very much recommend buying this game. :)",
            "review_score": "1"
        },
        {
            "review_text": "best fps/horror ever made i sugest you to buy it",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. Definitely worth $5 on sale. Creepy ending!",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R 2 succeeds in righting the wrongs of the original game and gives the series its own look for the first time. Though it's fun in the moment, F.E.A.R 2 ultimately doesn't elevate the series despite its best efforts to flesh out its hackneyed J-horror fiction into something more coherent. The multiplayer on the other hand, is just plain and lacks any of the flavour that F.E.A.R 2 brings to its single-player campaign.",
            "review_score": "1"
        },
        {
            "review_text": "Sexy naked dead chicks...got you're attention? Good. At about 5 hours its very short and there is a lack of variety in the levels, the school is the best but the others are pretty boring and colorless. For a game call fear 2 its not really scary. it relies heavily on jumpo scares, most of witch fail. It sounds like I am being hard on the game but I did enjoy it quite alot. Its a great little shooter with cool slow mo bits.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty damn good game. Short but sweet. While not entirely bug-free, it's a lot more polished than its prequel. The game also seems to be a bit more clever with its scares, making the scary bits a lot more enjoyable.  The level design is on par with the original FEAR, though a little more varied. Paths to objectives are unrealistically complex, but fun nonetheless.  Combat is different. The AI seems to be less intelligent but can handle more damage and is more accurate when shooting. Some enemies towards the end can take a bit too much damage to my liking, but not to the point where it gets frustrating. There is no more peeking from cover, meaning you can't fight the same as you did in the original FEAR. On the other hand, it's much easier to flank enemies than it is in the original. While I prefer the original combat and enemies, I don't dislike the ones in FEAR 2. With the exception of fighting monsters, that is.  The game's biggest fault, is that they wanted to include more enemy variety and ended up with some complete BS monsters. There's the fast-but-weak creepy-crawly monsters that are just an annoyance because they do so little damage but are hard to hit and the puppeteer monster that takes a ♥♥♥♥♥on of damage, keeps running away and has the most annoying attack in the world. The latter monster is challenging, sure, but also a real chore.  The story is pretty fun, until you start to think about it and you discover some things that don't quite make sense (or aren't adequately explained, at least). The original game was the same, though.  Both FEAR and FEAR 2 are must-plays.",
            "review_score": "1"
        },
        {
            "review_text": "Very different from the first F.E.A.R. and takes a bit to really get going, but the second half of the game is pure set-piece fun. A lot of great moments and a hilarious ending.",
            "review_score": "1"
        },
        {
            "review_text": "Not as scary as the original, but what it lacks in scares it more than makes up for in action. The shooting feels second to none and while the story goes a little crazy, Alma does get in a couple of good jump scares. The graphics and gameplay hold up well against modern day shooters, so if you are in the market for a great action game, and you are on a budget, or even if you have all the money in the world, F.E.A.R. 2 has some of the best gun play around.",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R. 2: Project Origin is a survival horror game in which you take the role of a soldier that wants to know about the origin of Alma  It has a nice campaign but it's a little bit too repetitive for me, but equally it's a nice game  I'll give a 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game, while generic, is pretty fun. Warning. Do not play this for horror, play it for some half decent shooter action. It is vastly superior to the first and is a pretty good 7-10 hour time waster.",
            "review_score": "1"
        },
        {
            "review_text": "IF you look for scary game this is the game you whant ! ",
            "review_score": "1"
        },
        {
            "review_text": "Had fun with the original? Whether your answer is yes or no, it doesn't matter. F.E.A.R. 2 introduces new players to the series with the flawless combat system and smooth controls perfectly, while still keeping fans of the original entertained. F.E.A.R. 1's combat system was already exceptional, and F.E.A.R 2 only improved on it. Overall the story has a lot od depth and is interesting, the graphics were outstanding for its time and are still comparable to some more modern games. Although it feels somewhat less scary than F.E.A.R. 1, playing this game still manages to be a spine chilling experience for me. Definitely worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "And oldie but goodie, worth playing through on a cold lonely night",
            "review_score": "1"
        },
        {
            "review_text": "good game! but too short! plus endin is naff lol!",
            "review_score": "1"
        },
        {
            "review_text": "Best F.E.A.R. game! Very scary, diferent enemies, much better then F.E.A.R.3, but without the game achivements.",
            "review_score": "1"
        },
        {
            "review_text": "Great game that builds on the same sort of story as F.E.A.R. but views it from a different perspective. Alma scares the crap out of you from time to time and the atmosphere is incredible!",
            "review_score": "1"
        },
        {
            "review_text": "I'm scurred....",
            "review_score": "1"
        },
        {
            "review_text": "I've gotta say trying the other two games I like this game the best.",
            "review_score": "1"
        },
        {
            "review_text": "really good if you like to ♥♥♥♥ yourself.",
            "review_score": "1"
        },
        {
            "review_text": "This is, IMHO, a highly underated game. Interesting story, throughly unnerving moments, great scares, and cool firefights in slo-mo. All that, and power armor action too!",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game by any standards. I don't think it quite has the same chill factor as the original, and the ending is just downright wierd (as well as being far too easy. It certainly a very visually appealing game with well conceptualised locations and beauifully rendered. In the end though it is really just a run of the mill FPS with nothing particularly new or exciting to make it stand out from the crowd. I'm going to award FEAR 2 a 7/10",
            "review_score": "1"
        },
        {
            "review_text": "The best single-player FPS of the generation. The AI is very smart. The level design is excellent. The bullet-time-infused combat is thrilling. The story is very well told. The horror atmosphere is immersive and genuinely creepy. FEAR 2 just gets everything right.",
            "review_score": "1"
        },
        {
            "review_text": "The game wasn't that bad, but there are no people playing it online, its just sad, the game is dead, bundle couldn't revive it..",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game 10/10 Nice story I recommend this Game !",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R. 2 has awesome gameplay and great graphics, plus a very intense and interesting storyline. The online multiplayer is just as great, too.",
            "review_score": "1"
        },
        {
            "review_text": "I smiled  8/10",
            "review_score": "1"
        },
        {
            "review_text": "  7.5/10 TJBs",
            "review_score": "1"
        },
        {
            "review_text": "The game is good, a bit short though. Took me 5 hrs on easy.  Graphics - 7/10 (today's standards. 9/10 in 2009) Sound effects/ambiance - 9/10 (gun sounds are too weak for my taste though) Gameplay - 8/10 (great FPS with elements of a horror game, gave me quite a few chills, but very linear and sometimes repetitive) Story - 8/10 (above average, comparable to good action/horror movie) Voice acting - 7/10 (OK, nothing annoying) Music - N/A (I never care for music in games, ambiance is my thing)  Overall solid game, that feels and looks good even by today's standards - 7.7/10",
            "review_score": "1"
        },
        {
            "review_text": "Yet more FEAR  Pro: Very good atmosphere Demo (TY devs) OK story Single &amp; multi player  Con: Expensive  Jump scare is not scary No steam cards - achieves Like several of these FPS game after 1/2 hour I start to get hot and sick - something about the bob or graphics. Only happens with some FPS games. This is one of them. Just a note. You should really play #1 to understand #2 Freaking Expensive Unbalanced    Overall: 5/10 (+1 atmosphere, +2 demo, -1 no steam stuff, -2 price - should be $5 with DLC) = 5/10  Yet another thumbs sideways.  If you like FPS with atmosphere and can get the collection 90%(+) off grab it. For me this is at best an average FPS with OK atmosphere. Is it worth $15 CDN? No. Is the DLC with another $10? No. If you get it in a bundle play it. If you can get the collection cheap ... even better. Take a weekend and just enjoy it.  For me it's thumbs down just for the price. $25 CDN for the game + DLC is just too steep. $55 CDN for the collection is excessive. If the game + dlc drops to $5 or the collection for $15 then I'll go thumbs up.   That said. TY for the Demo. Every dev should post a demo. ",
            "review_score": "-1"
        },
        {
            "review_text": "All the good things from FEAR 1 remain intact if slightly simplified. The fun to fight enemies are still in (they will shoot an explosive barrel if you are near one, they won't mindlessly run after you one by one, and they have great smooth movement animations), the 'scary' bits are still there (I personally never thought FEAR was really that scary) and the storyline doesn't take itself too seriously. Overall, a very entertaining and functional FPS.",
            "review_score": "1"
        },
        {
            "review_text": "Unless you REALLY like FEAR, It's not worth it",
            "review_score": "-1"
        },
        {
            "review_text": "You need to turn the in-game music all the way off and put the brightness almost all the way down. Only then is this game fun and scary.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not going to waste time trying to make this post presentable, so here's a stream of consciousness (all comparisons are held against F.E.A.R. 1):  Dirty dirty console port, cell shaded graphics do not fit the theme, aiming feels inaccurate, the AI is stupider, there are no graphics settings other than to change the resolution, spawn points are blatantly obvious and depressingly-purposefully annoying, the game speed is slow enough where you don't even need slo mo (fear1 is so fast you actually need it), overall it's too easy to really get into combat yet I get instakilled frequently by things I can't see (enemies spawn right behind you). FEAR1 had sprawling levels where squads could strategically engage you (or be engaged by you)- FEAR2 is all cheap spawn points in linear, uninspired level design. Ammo is dropped every two inches, it can't differentiate between left CTRL and right CTRL (fear1 could), it bugs out if you press too many keys at once (it often gets stuck strafing right, it often doesn't register keypresses, etc). Moreover the story is filled with cheap thrills and the plot is insanely stupid- they've never heard of 'less is more'. And the way alma is rendered is also less scary.  FEAR1's plot wasn't a masterpiece by any stretch; it had some really good and unique ideas in the meat of the story, but the frame-plot / getting to the meat of the story was pretty blatantly stupid. However it was at least *paced*; seems to me like they just wanted to play with some neat horror ideas and didn't really care too much about the rest of the plot- any excuse to get the player alone in some creepy environments would do. The game is about exploring ideas, and it is about exploring Alma's backstory; clearly not a lot of effort was put into leading up to that. Knowing that the plot was largely bad, they interspersed truly intriguing elements along the way and approached the more interesting ideas *slowly*.  FEAR2's approach to storytelling is to have some guy call you up and explain just about everything to you. There's no suspense or pacing. It's just... all bad.  ------------------------------------- F.E.A.R. 2 Reborn DLC ------------------------------------- This one really builds you up just to let you down- in the beginning, things look AWESOME. Several huge issues with FEAR2 are corrected! Points in Reborn's favor:  - You control a replica soldier - without slow motion abilities - with health given in numbers rather than a bar (both are good but if you have to pick one, go with numbers). - working in tandem with a squad of ally replica soldiers - with a clear, concise, simple objective that isn't stupid - You pursue enemies across sandbox like maps- no jack in the box spawn points! Enemies are actually walking around! - You are actually made vulnerable at one point; you have nothing but your firsts and you must figure out how to kill a patrol of 6-7 enemies often walking in pairs WITHOUT SLOWMO! A challenge! Well not really, there's an obviously scripted opening in which a pair split up and one of them faces his back to you long enough for you to easily kill him, grab his gun and shoot his partner. But hey, better than any given situation in all of FEAR2  Then fettel gives you hallucinations in which you shoot at ghosts in self defense. When you get back to reality, you see that you have killed your squad. That is a praiseworthy mechanic and story element- or it would be if it were in a different game exploring the effects of PTSD. Here it is simply a convenient way for the game to start being complete ♥♥♥♥.  Now, - you have slow mo - you have no squad, and everything that moves is your enemy - enemies spawn at stupid predefined places as usual - You are never again vulnerable / without plenty of guns to choose from - it is basically just what FEAR2 was like  Quite disappointing. And alma was in her child form again for some reason, trying to kill you. OK, what? To both points. Why is she a kid again suddenly? Why is she trying to kill you? Why does fettel have you kill your squad rather than just instruct everyone that you're going on a solo mission for a bit? He is a ♥♥♥♥ing commander of the entire replica army after all. Why is alma preventing you, both personally and by way of ordering replicas to kill you, from reviving her dead son? Her son who spent the entirety of the previous game trying to set her free?  This is really just a jumble of plot points shoved together with minimal effort, providing absolutely nothing new. It's just FEAR2 recycled in no particularly interesting way, and a deliberate 'we want more money!' DLC.",
            "review_score": "-1"
        },
        {
            "review_text": "Fear 2: Project Origin tells the story of psychic soldiers, crazy little girls, secrets and coverups. There are some cutscenes and readable backstory but seriously, that's not why we are here. We are here for some good old ultra violence. So let's look into that.  The game tries to be cinematic with it's slow-mo combat but now in the year 2015 it fails. The effects that maybe once were cutting edge are now average at best. To get as much sparks in the air as possible there needs to be a lot of bullets flying and what this means is that all weapons are horribly inaccurate and ineffective. Single headshot with assault rifle does nothing, you need 2-3. Spraying at a distance of say 15 meters you can be sure that you need atleast 20-30 smg rounds to kill an enemy. The sniper rifle is the players best friend even indoors.  Project Origin is new enough to have physics modeling but it basically only applies to corpses. Throw a grenade into an office full of desks, books etc. and very little moves. So no redeeming factors there either. Bullet spongy enemies without a proper fireworks display gets old fast. The game has few sections where the player gets to pilot a mech and in those you can destroy a decent amount of the scenery. Why it's restricted only to these levels is beyond me.  What suprised me most though was how powerless the sound design is. The weapon sounds and explosions are really weak. The design is also weird: For example if you stand next to and look at something that makes noise (machine, person talking, burning corpse etc.) you hear the sound it makes. Turn 180 and the sound almost disappears. Face the object again and it returns. When that is added to the lackluster visuals there really isn't much for the senses. Needless to say, on a modern machine Fear 2 runs without problems. On top of that it does have a wide range of graphical options to choose from.  Fear in this game translates into jump scares and they really are not scary. Some of the most gory parts are ghastly but there is no sense of threat. It's just blood and gore. Levels are made of grey facilities or ruins of a city so no wild set design here. At one part of the game the player has to navigate through a literal monster closet factory which was just silly.   Fortunately the AI is really aggressive and they will run after the player like bloodhounds and throw grenades like they have boxes full of them on hand. Only problem is that they tend to come at you one or two at a time so it's rarely overwhelming. On the hardest difficulty the player character dies really easily which is a good thing but it only emphasizes the fact that similarily equiped enemies can take bullets like rain.  In todays market, where there are loads of games available and a lot on sale at all times, you can do much better than Fear 2: Project origin. The first F.E.A.R might have some value as a classic or a game that pushed the genre forward and maybe should be played for that reason. This second installment doesn't even have that quality. It's not unplayable or anything, it just doesn't have much to offer anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "If you love fear, then play it. Otherwise no reason to ever pick this up.",
            "review_score": "-1"
        },
        {
            "review_text": "I have only played this up until the first appearance of the little girls ghost. I don't do well with horror games and she gave me quite a fright. I literally screamed, ask my family lol. The game is fun though, it's a great FPS and I like the graphics and story for a 2009 game, pretty fun. If you get pretty scared at things jumping out at you like me then either play the game with a friend or don't get it. Otherwise I think you'd love it.",
            "review_score": "1"
        },
        {
            "review_text": "Not quite as awesome as the first FEAR, still a good game with a great horror story and creepy atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "sucks",
            "review_score": "1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing ♥♥♥♥. At least Monolith joined in line with other companies that failes miserable for selling ♥♥♥♥. NO IN-GAME SAVE???!!! ♥♥♥♥ YOUR MOTHERS!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Hard to call this a 'horror' game. Still a good FPS and way better than FEAR 3.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad but suck ♥♥♥♥♥ as compared to the geniuses behind the FEAR 1 Multiplayer team.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow... This is more spooky than the first!! Alot of improvement and the graphics looked pretty good. Can't w8 to play F.E.A.R 3 XD",
            "review_score": "1"
        },
        {
            "review_text": "Scary as hell, and full of action. The ultimate FPS horror game!",
            "review_score": "1"
        },
        {
            "review_text": "worst game ever. if you love thr firsr f.e.a.r. like i do dont waste your life on this crap. f.e.a.r. 3 is terrible and this one's worse.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is garbage",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game well engineered runs smoothly great game",
            "review_score": "1"
        },
        {
            "review_text": "Amazing story and a worthy sequel to F.E.A.R  Prepare for a lot of buttclenching moments and jumpscares, but the story and world is worth every bit of it.  Nice graphics too, worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Was ok, as good as the first one, just didnt like the way the weapons were too much. A little to generic and unaccurate. But the slow motion 'bullet time' feature ala Max Payne is what makes these games. Story was decent too. Monolith did a decent job, although its no NOLF which was their best its still a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent FPS, solid gameplay and sound design. Just kinda lacking in actual fear.",
            "review_score": "1"
        },
        {
            "review_text": "  This game is a cool egoshooter =)   The story is interisting and long ^^   The graphic is OK ^^ !!!   The fun that you have in the game is 90% :D (the other 10% is in your pants xD)  ",
            "review_score": "1"
        },
        {
            "review_text": "This game flat out sucks. after having played through it in only 4 hours and not encountering a single horror or scary moment i very much regret my purchase (which was under $5)  very generic linear post apocalyptic shooter with 8 different types of guns and a boring story they hide the plot of until a line of dialogue thrown in the middle of gameplay, not even a cutscene then there is no ending, the game's just over, not even much of a cliff hanger to make you want to play 3.  do not buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Not as scary as I wanted it to be but still a nice game",
            "review_score": "1"
        },
        {
            "review_text": "Best of FEAR",
            "review_score": "1"
        },
        {
            "review_text": "Round two boys good this game made it action packed and very suspensful too!! Great game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A ghastly 8 year old follows me and I try to shoot her but I get points this time, not a divorce. Nice.",
            "review_score": "1"
        },
        {
            "review_text": "the game is really good, action is a little repetitive but never boring, AI isnt the greatest thing, if you want a good AI play hard difficulty because on medium you are just gonna get a bunch of toy soldiers waiting to die; gameplay is really good, you can use the slow mo effect from the first game which makes things a little more interesting when you have to fight against the invisible spider soldiers, the story takes place after the ending of the first FEAR, you now control a different guy and have new partners, the ending is good but with all its pros this game isnt better than the first FEAR, while gameplay is good and story is entertaining there is something missing....the suspense, one thing the first game had was the atmosphere and thats what made FEAR such an awesome game back in the day, the creepy tones and the sudden jumpscares are gone, instead you just get button smashing scenes that you can pretty much predict, its a good game and a great sequel to the first FEAR but its not better than its predecessor, basically an 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the first F.E.A.R. It wasn't as scary. There is no lean, and mouse 4 and 5 aren't mappable. The DLC is a joke, takes about a hour or so to beat it. I kind of tried the online, it wasn't bad, might try it again.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the better bullet time shooters, F.E.A.R 2 continues the story of the popular first game. In a nutshell, Shooter action against Hi tech clones gone bad by Ghosts. One of the better games in the series. If you're after scares though, You may be disappointed as It's mainly a FPS, and you never really are defenseless... The expansion is okay. Look out for Alma - Shes Evil!",
            "review_score": "1"
        },
        {
            "review_text": "All kinds of spooky going on in this try it out!",
            "review_score": "1"
        },
        {
            "review_text": "got jumpscared in the first 10 f*cking minutes of the game  666/666",
            "review_score": "1"
        },
        {
            "review_text": "Yes Alma, call the police. They cannot unrape you.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome sequel to the first one!  Must buy, and play it!  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I'd call this game a survival horror/action game, but, that's just my opinion, sorry but i have never played 1 or 3 but i'm guessing both are awesome, apart from the fact that multiplayer is dead, i really enjoyed the story so far, even though i haven't made it that far through the story, so far from my understandings, this game revolves around a story of a guy that is a soldier and throughout the story, he has flashbacks or hallucinations of a girl, i don't know which one, but the game is really cool, and the enemies are a bit too easy, but i'm just playing on normal mode, also the enemy soldiers get on my nerves sometimes, when there's a large group of them, so i just spam my grenades, probably not a good idea, but anyways, overall i would say that this game is really cool and has a cool story  9.1/10 - Amazing story",
            "review_score": "1"
        },
        {
            "review_text": "What went wrong with F.E.A.R. 2?   The original game was by all accounts a very good game. A great game even; almost certainly one of the best shooters of `05, if not all time. The sequel on the other hand is just wrong. It looks wrong. It feels wrong. It plays wrong.   The first thing you notice when you play the game is the lower FOV, and the intrusive HUD. Combined , these give the sense of claustrophobia within the limited screen space. Imagine walking around looking through the display of a camcorder at arms length from your face and you'll get the picture. The word `consolized`comes up a lot in the old FOV debacle. The theory being the television sits further from the player, and therefore the natural depth in the room counterbalances the lack of depth in the picture, whereas the PC player sits just a couple of feet from the monitor so field of view needs to be wider to compensate. This idea shouldn't be difficult to overlook, and yet it often is.  Secondly, the actual shooting. Yeah. It falls under the initially indefinably wrong category, but after some closer examination it becomes more obvious. Enemies don't really act like F.E.A.R enemies, however I don't think this is a result of the AI. The level design is largely to blame. This game presents the player with very narrow, linear paths that look larger than they actually are. Enemies pop up in an endless battery right in front of you, occupying an oppressively large margin of screen space. There is no room for these poor ♥♥♥♥♥♥♥s to navigate, let alone perform any complicated flanking maneuvers. It is basically a moving feast of whack-a-drone. The player movement is just as restricted; it is weirdly difficult to navigate even the larger areas without getting stuck on miscellaneous props and debris. The game clearly wants you experience every gunfight a certain way, and that alone seals its fate to the bargain bin pile of mediocrity.  This brings me to the guns, the violence, and all of the carnage in between. The guns look wrong. They have that weird plasticy pseudo-futeristic look that clashes with the more conventional settings in the game, not to mention the style of the weapons in the previous game. The same is true for the props, and the character models. The balancing of the weaponry is more akin to a call of duty game thanks to the full implementation of the iron sights mechanism that is so popular these days (not necessarily a bad thing).Unfortunately this came at the cost of all of the familiar idiosyncrasies of the classic shooter that made them so fun (over powered shotgun, deadly accurate pistol, etc.). The F.E.A.R. 2 shotgun is pathetic, the pistol looks weird doesn't feel like the headhunting cannon straight out of a John Woo film that the old .45 did, and finally the dinky sub-machine gun you first get is an unholy bullet saw. What the heck happened there? This of course brings me to the violence. The original game was violent, and it was on occasion gratuitous, but it tended to show its fangs at appropriate times. The predecessor on the other hand goes full on Chuck Manson from the get go. You can literally cut a man in half with a freaking SMG, and its not like some dramatic event, it just happens sometimes. Everything can be going normal in a relatively dull, mundane firefight, and then you look back and notice one baddies is torn up all over the place. It is just bizarre.   This is dragging on, and my list of my eccentric complaints could drag on longer than I actually played the silly game, so I will end it here.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're looking for a game in which you can get forcibly loved by a gross monster lady, but not before running around for 10 hours shooting various other monsters and semi-intelligent soldiers, then FEAR 2 is right up your alley, son!  Pretty damn fun.",
            "review_score": "1"
        },
        {
            "review_text": "My friends found out I played this game alone at night and now think I'm super badass. Little do they know, I was screaming and pausing constantly to chain smoke cigerettes. This game is great even though it is short.  9/10 Would have panic attacks again.",
            "review_score": "1"
        },
        {
            "review_text": "Not long to finish, but I had allot of fun and some scares there and there.  In a way, this is everything good from FEAR 1 with more colors, more detailed environments and a mech to add some variety.",
            "review_score": "1"
        },
        {
            "review_text": "Buy Amnesia and forget this game. Monolith has finally begun to slip up on the job. I can't be the only one who finds it ironic that the very title of this game is the main thing that it lacks. Apparently, games no longer know how to scare us. This game is proof that and proof that console ports suck ♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like horror games and guns this is what you looking for. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I want to like this game, but I can't play for more than 30 minutes without feeling sick due to the terrible fov and mouse acceleration, I've set the mouse sensitivity the the lowest possible and I've set my dpi to 800 and any small flinch will have me doing 360s by accident, the game itself is pretty solid though. I'll change my review if anyone can help me fix this.",
            "review_score": "-1"
        },
        {
            "review_text": "significantly worse then first game",
            "review_score": "-1"
        },
        {
            "review_text": "I like throwing around objects and kicking ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game and a worthy followup to the first F.E.A.R. Also, ignore Extraction Point &amp; Perseus Mandate :P",
            "review_score": "1"
        },
        {
            "review_text": "I HEAR SEQUELS TASTE JUST LIKE CHICKEN",
            "review_score": "1"
        },
        {
            "review_text": "Great game, with a great story. Unfortunatley it toned down the 'horror' aspect of the game alot and has become more of a run and gun. Don't buy F.E.A.R. 2 without playing F.E.A.R. first. ",
            "review_score": "1"
        },
        {
            "review_text": "The last game enjoyable of this whole franchise.  This is a really nice game yet sad at the same time because you have to accept F.E.A.R ended here, inconclusively.",
            "review_score": "1"
        },
        {
            "review_text": "things to do: 1. buy this game 2. turn off light 3.good luck that is an order soldier",
            "review_score": "1"
        },
        {
            "review_text": "I can safely say this game gave me nightmares twice.   ♥♥♥♥ the school level, seriously, ♥♥♥♥ it",
            "review_score": "1"
        },
        {
            "review_text": "Cool game - horrible F.E.A.R. game.  everything that made the original so good was thrown in to the garbage, presumably with majority of original team gone and turned in to grotescly, trying too hard to scare player behind every corner, dumbed down, FPshooter... sexualized Alma? Is that suppose to make me like it?  You don't even play as pointman anymore? So why do you have bullettime, because - FEAR... even tho the first game prettymuch explained that Pointman has that as special psychic ability as result of being genetically manipulated ♥♥♥♥♥ son of Alma made in to supersoldier.   No why bother, right players are dumb, they didn't even care about storyline in first FEAR so ♥♥♥♥'em",
            "review_score": "-1"
        },
        {
            "review_text": "FEAR 2 is definitely not as good as the first game, but it's still pretty great. Ironically the crowning moment of the game is a 'tacked on' mech sequence which is actually SO GOOD that in my opinion should have been it's own game entirely. The graphics and sound design are fantastic like in the previous game, and the gunplay is meaty and enjoyable.  What i will say is that the game is way too short. I've beaten it about 3 or 4 times and it has never taken me more than 4 hours. The Reborn DLC is about an hour worth of content, so unless you can get it for cheap don't even bother.",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R the disappearing floors ......  Fear 2 is good but not great. The game has a fair few glitches and tiny bugs that end up irratating more then they should across the campaign.   The storys pretty so,so with your character 'Becket' being part of squad sent into some unknown city to extract some scientists that are being hunted by a mercenary group. Recommend playing the first game to better understand whats going on later in the game. So the main plot kicks off after the rescue mission where a physcic zombie chick called Alma hunts you and your team in order to ......mate with you or another team member( this isnt a spoiler its in text log at the very start of the game . All awhile you kill waves of clones and mercs .....Now this plot is fine if a little ridiculous.   Questions like where are miltary? why is there no back up? how are the clones being controlled tactically by some naked lass whos spent her entire life making babies or just sleeping in a tank are never explained.  After a botched rescue mission you end up with a slo mo ability . This is the gameplays core draw as you can dodge bullits, slo mo kick foes and generally act like a bad ♥♥♥. But this is all the same kind of things as the previous game. New weapons are rather uninteresting and dont come quick enough. Quick tip, as soon as you find the assualt rifle keep it the entire game, As with the shotgun in F.E.A.R one its basically the go to weapon that is always useful and never runs out of ammo thanks to numerous drops by the enemy.   Now glitches , i fell through the floor of the game 4 times. Resulting in my death. I was one hit killed at least 20 times by multiple enemies with a submachine gun or similar weapon weak weapon. Numerous times the a.i started shooting me through a wall/my cover. I realise this game is a bit dated now but still its problems that are there ,wont be fixed this many years on.   I played on hard and found it a challenge at points. Mostly down to the problems above however and not due to my own errors in judgment.   Final points this game is fun but has long periods of boredom . The game trys to diversify the gameplay with Mech segments in a miserable grey city and turret segments. However these parts are just boring and dont allow slow mo they are not needed or wanted. The game wouldnt lose anything if it took out both the turret segments or mech scenes.   The story is so average and kind of stupid at points with bland characters......with the exception of one character. The Mercenary boss is awsome. His lines are so bad they are good ...sweet pea.   The series antagonist Alma was creepy in the first game but here, shes just annoying, activating quick time events where you fight her off. She just nocks about wasting time.   Grahipics are good and the game doesnt shy way from gore at all which is refreshing.   Ultimatly i prefered the first game, that would be 8/10 while this. is more of a 6/10 . Despite the diversity of levels the game doesnt feel that different. Which was the main problem with the first game drawing serious repetition by the end. The same enemy types ( despite one or two) and the gameplay is just the same as the previous game. Its just above average. Wait for sale.   ",
            "review_score": "1"
        },
        {
            "review_text": "Shorter than the original and lacking some of the features. Like why remove the lean function? And although the AI has been 'improved' it feels like a step backwards. The Reborn expansion is also incredibly short and doesn't really add much to the game. The game feels more linear as well. Could have just been the illusion of choice in the first game but to me it felt like you could go down more than one route to finish a level. This game feels like it relies too much on jump scares rather than the suspense of the first one but still made me call it a b*****d a couple of times.   Overall I do suggest getting the game, if only for the story. The story line runs towards the end of the first one and carries it on but through different characters. The controls are different to the original, so, if you're running between all three (as I am at present) then you may need to remap but that's simple enough in game. There's no controller support but that's not a biggy. The graphics are notably an improvement on the first as well. There's an expanded arsenal of standard weapons and grenades which I appreaciate.",
            "review_score": "1"
        },
        {
            "review_text": "FEAR was the horror fps game you needed. F.E.A.R. 2 expands the Alma world and put you in another nightmare, less scary than the first one but much deeper and much cooler.",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played F.E.A.R. yet, go play that first. If you didn't enjoy F.E.A.R. you won't like this game. If you liked F.E.A.R., buy this game. I guarantee you will get R.A.P.E.D. in this game even on the easiest difficulty, but it's not a difficult game.",
            "review_score": "1"
        },
        {
            "review_text": "very fast paced, addictive and will make you jump in the dark if you sitthere and play like i do... IN A PITCH BLACK DARK ROOM.",
            "review_score": "1"
        },
        {
            "review_text": "Finally a sprint button!  The game handles as it should.  It is such and average game, nothing at all stands out. Probably the only FEAR game that I would recommend, but only if you really really want to know what the franchise is like.  5/10",
            "review_score": "1"
        },
        {
            "review_text": "FEAR2 being 2nd in its franchise, i find this to be the 3rd best in storyline, they all go together perfectly its just the base of that storyline is just not as good as the 1st or the 3rd in my opinion. But its number 1 in scarying you ♥♥♥♥♥♥♥♥. For someone that wants the adrenaline of being scared ♥♥♥♥♥♥♥♥ while still fullfilling your needs of shooting ♥♥♥♥, this is for you. HIGHLY RECOMMENDED!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fear 2. well. First impressions are that it is a console port. no lean, hit SPACE to continue, no quick save, no binding to above mouse 3. but Hey This isnt a bad port if it is.As with the first one the action comes in t waves but they increased the frequency this time around. there is alot less slow investigation scare tactics than the first one, more impusle in your face Stuff; More, better, Phantoms.The game takes you along a seperate FEAR squad investigating alternate projects of Armacom only to lead you to a final confrontation with Alma. More about Alma is revealed as well as more questions about alma and your player. A good rounded story with a combo of solid gameplay.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Your typical FPS with a wicked story line and dark and scary as ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Scary as ♥♥♥♥. No joke.",
            "review_score": "1"
        },
        {
            "review_text": "It's a pretty generic shooter, with the spooky elements thrown in. I quite enjoyed it, but the only 'jumpy' bits in the game were the spectre sections, the rest of it was just run and gun.  I got it cheaply in the sale and on that basis I'll recommend it - not something I'd buy at full price.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty fun shooter. Is is very similar to the first FEAR game - a tactical shooter with over-the-top action. However, it isn't scary at all. What it has are awesome graphics and design that really hooked me, great voice-acting and stunning visual effects. The ghosts and phantoms are particulary pretty. My main complaint is lack of enjoyable multiplayer and WAY too much Bullettime in singleplayers. You can use it all the time. The game's battles really shine in normal speed, but this is missed due to playing the whole game in SlowMo, becuase you can and have no reason not too. Try the demo first. If that's your style then buy.",
            "review_score": "1"
        },
        {
            "review_text": "Well, Slo-mo is fun as ever. The story was average. The ending left a lot to be desired. It suffers from Ridley Scott Syndrome: it needs an extra two minutes of exposition to explain what the ♥♥♥♥ is going on.",
            "review_score": "1"
        },
        {
            "review_text": "This sequel is simply ok. It didn't provide the same horror experience that the original F.E.A.R. did. Original F.E.A.R. players will know more or less what to expect next.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, this is not F.E.A.R. or it's Extraction Point expansion. The graphics do not have the dark atmosphere the first one had, the enemies are rather boring and annoying, and the levels are pretty bland. The high point of this game is Alma and the story, which is not bad, but could have still used some work. This is the main reason to play it. Overall, it is an OK shooter, but one which should be picked up during a holiday sale, or something. I just do not recommend spending more than 15 bucks on it.",
            "review_score": "1"
        },
        {
            "review_text": "u r chased for hours by nude woman  she is really spooky but sometimes decides she wanna look sexy  I can't tell what's scarier, the fact that she's in charge of her sexual nature, or that she also kills a bunch of people, oftentimes when I'm looking.  gurl, the first rule to getting on the monk7817 train is not to be killing my comrades. second rule is that my parents gotta meet ur parents #traditional  basically, its like freud took my dreams and made a scary game with them",
            "review_score": "1"
        },
        {
            "review_text": "The best horror game ever made. The action and story are great too. The graphics are overall an improvement from the first one, though they have undergone a bizzare downgrade in the dynamic shadows department.",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay, great atmosphere, really cool guns, and NPC squadmates with some actual personality. Not nearly as scary as the original F.E.A.R., but a hell of a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's not the first one but it's aight. Still as violent though.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game and how generic it is.",
            "review_score": "-1"
        },
        {
            "review_text": "F.E.A.R. Worth playing at its time a lot of reused environments get old, but the gore and kill satisfaction is still one of the best to date which is sad for how old it is.  F.E.A.R. Extraction Point Same old same old environments, guns, NPC, if You are a fan of Fear than its not all bad still fun combat.  F.E.A.R. Perseus Mandate is a fun DLC and the funnest one, I thought beating extraction point was better than the main game sure its short around 4 hours and you can do everything and the bonus missions but there more in it than the F.E.A.R 1 there more weapons way more character models and change of environments most things all still stay grey but it feels better and a lot funner.  Worth Playing for F.E.A.R Fans.  F.E.A.R. 2: Reborn is a fun and big improvement on the genre with superb visuals and awesome events it is a sequel that does better than the original. Great Game  I don't believe anyone plays this online couldn't find any servers as of 9/11/14  F.E.A.R. 2: Project Origin  A glimpse at another perspective just seems cheap and made to grab a extra buck with nothing new.",
            "review_score": "1"
        },
        {
            "review_text": "Second enstallment of the F.E.A.R series, in my opinion is a lot thrilling than the first and third.  If you like jumpscares and gore mixed into a militaristic setting then this is a brilliant game for you.  The only drawback i can find to this game would be that i did expect it to be more suspensful or to have more horror in it, other than that still an extremely enjoyable game.  ",
            "review_score": "1"
        },
        {
            "review_text": "amazing atmospheric FPS... short but worth the playing time",
            "review_score": "1"
        },
        {
            "review_text": "Only brought it because Alma Wade is super scary.",
            "review_score": "1"
        },
        {
            "review_text": "Somehow even LESS thematic than the original, despite improved graphics. Only one or two scenes had good setting and feel. Enemies seem a little less smart than the previous, although they dont get murdered by their inability to use doors this time. They're just more aggressive about pushing forward and not making footsteps when they do. Fairly easy on Normal, nothing felt very hard to kill. Horror segments are quite nonthreatening, but the use of light phantasms compared to the previous game's dark phantasms was a great choice that I loved.  Instead of answering people's voicemail, this time you read their dropped memos. People are pretty darn clumsy when it comes to dropping important memos.  Game ran well on a Phenom II x6 / HD 6850, no hiccups. 8hrs of gameplay total for campaign + DLC. Did not try multiplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "Good series of games. Enjoyed the action and story.",
            "review_score": "1"
        },
        {
            "review_text": "Overall F.E.A.R 2 is a solid, fun shooter with a horror undertone; nice to look at, but perhaps doesn't quite have the same magic as the original F.E.A.R.  It has a relatively quick but enjoyable campaign, containing lots of intense fire fights, vehicle and turret sections without holding your hand too much or dragging you through too many cut scenes.  I gave this a quick run through on 'Normal' and found it mostly quite easy due to the frequent placement of armour and medkits. However the enemy AI provide a decent challenge regardless as you can never stay in one place for too long before you are flanked, outnumbered or grenaded.  As far as the horror aspect goes, it doesn't build tension as well its predecessor, which undermines the 'jump scares' somewhat, but F.E.A.R 2 is a little less predictable in this respect and does provide a lot of disturbing moments none the less.  I'd also recommend playing the first F.E.A.R and its DLC if you want to follow the plotline as having some context makes it a little better I think.  Pros - Shooty bang bang - Good variety of weapon types - Excellent enemy AI on the whole, who seek to use their numbers against you - Slow mo and melee options give you a fun mechanic to use to your advantage - Short and sweet - good for a quick weekend play through - No annoying third party DRM   Cons -Ability to bind to additional mouse buttons would be useful - there are quite a few commands you need at your disposal quickly - Feels Less Horror; more shooty than F.E.A.R  ",
            "review_score": "1"
        },
        {
            "review_text": "only played 6 minutes of it, although i have watched the entire game play on youtube, its pretty cool",
            "review_score": "1"
        },
        {
            "review_text": "Following up from the first F.E.A.R. game. You have generally a better gameplay experience and even mechs. The story is interesting. It's not bad by any means. Give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "This game series is what describes many modern scary games. Jumpscares, loud creepy music and a more or less ♥♥♥♥♥♥ protagonist.  In fairness though the story is kinda creepy, but it all gets ruined when you have a gun and random ♥♥♥♥ pops our and tries to kill you. My biggest fear was actually running out of ammunition, just like in real life I suppose (so deep).   5/10 - Go play Amnesia or something, SPOILERS - your mother is a little girl. They probably did not think that would turn me on :)",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would see Alma again!",
            "review_score": "1"
        },
        {
            "review_text": "A game worthy of the name and heritage that it bares.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Difficult to play alone.",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually write reviews,but i had for this one. HUGE disappointment imo. Not worthy of first FEAR game.Im mostly not satisfied with story telling,and with the atmosphere that game provides. It's much more action fps than horror,which i think original FEAR was more horrorish than it was just right click action.  I wouldn't give this game more than 6.5/10. And that's only cuz i liked first FEAR so much.",
            "review_score": "-1"
        },
        {
            "review_text": "Fear 2, alot of people have mixed emotions about this game. Some say its more of a shooter than a horror game. Others say meh. I think the terror is little bit more scarier in terms of graphics and landscapes. The music is one of the most excellent. Using some of the original and remixed versions of the Fear soundtrack. But also adding some new terrifying music such as the music box. The largest part that glues the game is the story telling more about what happened after the explosion at the end of fear. And also testing the psyche of each of the main characters and scaring the player in the process. Monster are a plus for creativity, such as making mans common friend 'light' even scary! With a variety of monsters to scare you and plenty of enemies to fight its an action packed, psychological-horror sequel worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "Its feels and plays like the first game but everything is much better, even on todays standards the graphics are nice to look. The spacing of the action and walking is just right, you never feel bored or that there are too much action coming without resting. There are some unneeded railshooting scenes but they don't last too long. The level design is much better than before, no more boring or overlong tunnels like in the first game. I think where the first one lasted too long (around 20h) this has just the right length for a FPS game, around 8h to finish.   FEAR series seems to have one of the best positional audios I've ever heard, in the first game there was EAX support but second one has even better audio. I could close my eyes and just from the sounds coming from the enemies I would know where they were and could kill them.  I could say this is the last good FEAR game as third one is more COD clone than it is horror shooter, so if you enjoyed the first game it's very likely you will enjoy this one too if not even more than the first one.",
            "review_score": "1"
        },
        {
            "review_text": "This game is 95% awesome gameplay, and 5% 'THAT'S ALL THE ENDING I GET?!', in that order.  Never before have I felt so ♥♥♥♥♥♥ off by a game's ending, and that's not a good thing.  But for the rest? it's fun as ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "A good Sequel to an Awesome Shocker.",
            "review_score": "1"
        },
        {
            "review_text": "Scary, makes you jump shooter!  Brilliant gun play, effects, graphics are amazing and will replay one day in the future :)",
            "review_score": "1"
        },
        {
            "review_text": "It is a very good game 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "It's okay. I have a friend who's a voice actor in it. He was good. More of the same.",
            "review_score": "1"
        },
        {
            "review_text": "Normally, sequels are trash... Not this one.  F.E.A.R. 2: Project Origin, once again, helps develop my fear of small kids... And demon girls... And supernatural beings... Basically everything you could see in a horror genre, except it is all done right.  The second installment in the F.E.A.R. series is nothing to be taken lightly, it's a game I often revisit on any platform and I enjoy every damn second of it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is freaky...",
            "review_score": "1"
        },
        {
            "review_text": "Totally love this game! Though it got some glitches or whatever but other than that it's amazing",
            "review_score": "1"
        },
        {
            "review_text": "A Game designed for PC. Completely unique feeling which we are unfortunately forgetting today, flooded by console-ported junk and lack of dedication from mercantile designers.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun, firt person shooter along the lines of Half Life 2 but more modern. The horror element isn't cheesy or over done. A couple of jump-scares but mostly just a creepy, goose-bumpy feel. The combat is just difficult enough late game. You'll find youself challenged and salty but not rage-quitting. Graphically it's perfectly adequate. There are film-grain and head-bob switches if you don't like those options. the FOV is not settable in-game and I found to be a bit narrow and zoomed in, but you can use a command-line option to set it to whatever you like (85 for me). Look in the steam community for the info to do that.",
            "review_score": "1"
        },
        {
            "review_text": "Ever #$%# your pants and cried while doing it? You will now.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best fps' i have ever played! play it on hard and you are bound to use slow mo all the which is great to use and makes the gameplay real fun. very cool storytelling with pdas scattered everywhere and creepy atmosphere all along. don't miss it.",
            "review_score": "1"
        },
        {
            "review_text": "While many would consider the sequel to one of the best horror fps out there a weak one, I will have to disagree.   Though the influence of less innovative shooters are seen in the wrinkles of Project Origin, I would say it still holds up as a fun, action-heavy and quite atmospheric game.   So plug in your headphones,  turn off the music in-game  , then turn out the lights and get ready to be mildly unsettled in a very atmospheric shooter environment.",
            "review_score": "1"
        },
        {
            "review_text": "While not as good as the original, FEAR 2 is still a solid continuation of the FEAR universe’s storyline. The action and bullet time challenges are still very enjoyable, as are the new weapons -- but most notably, the creepy moments still send shivers down your spine even though you already know they're going to happen.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't beaten the game yet but from what I've played the gunplay, graphics and sounds are great and the story is good enough to keep me going from one slowmo gunfight to the next.   I definitely recommend it.   666/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game, a must for every horror shooter fan. Recommended. Unfortunately, I did not play the first one so I can't compare, but I thoroughly enjoyed this one. Shooting demons and bad guys is very well paced. The graphics, the sound and the overall ambiance are top-notch. Only complaint that I have is of the main character - he doesn't say a word and it's pretty annoying since the other characters are often talking to him and asking things... ",
            "review_score": "1"
        },
        {
            "review_text": "‌",
            "review_score": "1"
        },
        {
            "review_text": "My opinion best in the series, due to atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "A good game for playing single player, but severely lacking in the multiplayer department.",
            "review_score": "1"
        },
        {
            "review_text": "5+ jumpscares in the first 10 minutes 10/10 no forced jumpscares.",
            "review_score": "1"
        }
    ]
}