{
    "app_id": 16600,
    "name": "Trials 2: Second Edition",
    "release_date": "2008-05-28",
    "developer": [
        "Redlynx"
    ],
    "publisher": [
        "RedLynx Ltd."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements"
    ],
    "genres": [
        "Indie",
        "Racing",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Indie",
        "Sports"
    ],
    "achievements": 25,
    "positive_ratings": 169,
    "negative_ratings": 33,
    "price": 5.99,
    "description": "RedLynx Trials 2 Second Edition is a spectacular motorcycle game featuring stunning graphics and addictive gameplay! 4 game types (race, flip, wheelie, dynamic)Race: Race against other players to compete levels as fast as possibleFlip: Try to make as many backflips or frontflips with your bikeWheelie: Drive on your backwheel for longest...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/16600/header.jpg?t=1447351307",
    "minimum_requirements": "OS: Windows XP (32-bit) or Windows Vista (32-bit or 64-bit)                    Processor: Intel Pentium 3 600 MHz or better, AMD Athlon XP or higher                    Memory: 256 MB                    Graphics: One of the following graphics cards (or higher) with at least 64 MB of memory: Nvidia GeForce FX 5200, ATI Radeon 9500, Intel GMA 900, VIA/S3 Chrome 9 or higher                    DirectX Version: 9.0c                    Sound: An OpenAL compatible sound card                    Hard Drive: 220 MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a fun game, but only worth it if its on sale... :P",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game full of challenges and a high level of replay value great for both adults and kids of all ages.",
            "review_score": "1"
        },
        {
            "review_text": "this game is probls the best courtroom drama simulater on the personal computing platform. u get 2 play as redlynx a hotshot lawyer and u do trials about ppl who have done crimes and u have 2 get them off w/ it ",
            "review_score": "1"
        },
        {
            "review_text": "this is by far one of my favorite little games, way more challenging then the newer titles",
            "review_score": "1"
        },
        {
            "review_text": "this game will make u hate your computer!",
            "review_score": "1"
        },
        {
            "review_text": "if you liked the flash game this one is 10x better",
            "review_score": "1"
        },
        {
            "review_text": "Great !",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game but it is much better on the Xbox. If you use a controller the response is very slow and even using the trigger for accelerating you either get off or on full. This makes the hard levels much harder than they should be.  I will recommend this game but would say if you want to play it properly, get the Xbox versions as this just seems to me as though the programers got it looking good then just said 'meh!' to the controls.",
            "review_score": "1"
        },
        {
            "review_text": "Be prepared to break every bone in your body, including your controller!",
            "review_score": "1"
        },
        {
            "review_text": "This game is just AWESOME!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most exciting and addictive game that I've already played. When you start playing, you won't stop until break your records, you'll want to be better in each track you play. And in the March 22th will be realeased the Trials Evolution: Gold Edition for PC. And will have a lot of inovations for the game be more atractive and competitive, for spend a lot of your time in the game. This game is like drugs, when you start, you'll never stop, but I think that is a good drug, or no. So, if you want a reaally good game, that will help you when you'are bored, this is the perfect choice!",
            "review_score": "1"
        },
        {
            "review_text": "This game easily the most brutal and unforgiving game I have ever played. If you can mange to get it to stop crashing and freezing your graphics card, you will be treated to ridiculous elasticy physics and frustrating glitches (like your bike folding in half on a regular basis).  The learning curve is extremely steep, which is reflected by the nearly impossible achievements. In order to become half decent at Trials 2, you will need to study replays and practice infuriating sections of track for hours on end, and even then you have no hope of touching the leaderboards.  So unless you have a lot of time on your hands, and like extremely difficult challenges, think again before you choose this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The painful absence of true controller support, no analogue and controller doesn't work in menus, leaves this game feeling like a shoddy half baked port that plays much much better on the consoles than it does on PC. If you want to play this game, buy it on Xbox.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Why have you lied to me, Chris Livingston? This game isn't really fun at all. Maybe for like 2 hours. What the hell!",
            "review_score": "-1"
        }
    ]
}