{
    "app_id": 16620,
    "name": "Monster Trucks Nitro ",
    "release_date": "2009-01-29",
    "developer": [
        "Redlynx Ltd"
    ],
    "publisher": [
        "Miniclip.com"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Indie",
        "Racing",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Indie",
        "Sports"
    ],
    "achievements": 0,
    "positive_ratings": 21,
    "negative_ratings": 13,
    "price": 16.99,
    "description": "Race, jump and nitroboost your way pass thrilling dynamic levels with your monster trucks. Earn medals and unlock new levels and vehicles. Lots of brilliant tracks Be fast but use also your wits to pass the tracks Improve your times and earn medals Collect the Nitro tanks to unleash special powers! Unlock extra trucks!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/16620/header.jpg?t=1447351670",
    "minimum_requirements": "OS: Windows XP or Windows Vista                    Processor: 1,5 GHz Pentium 4, AMD Athlon 1500+ or higher                    Memory: 256 MB                    DirectX Version: 9.0c                    Graphics: Nvidia GeForce FX 5600, ATI 9500, Intel GMA 950 or higher                    Display:                     Hard Drive: 300 MB                    Sound: An OpenAL compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A very creative fun game that keeps you thinking. I loved this game and how fun it was to play. The monster trucks were awesome to play once you put in the cheat code to unlock them. I loved each level because they were all different and creative. There were times that you would fail and not understand why you failed so badly but just plain persistence and patients pays off when you beat the course record and get gold. If you want codes to help you out here are the best one's: Go to the Settings menu and enter the codes into the Unlock extra features box.  DEVHOSENAUTO: Unlock Formula Monster Truck PIGGYRIDE: Unlock Pig Monster Truck YELLOWMONSTER: Unlock School Bus DEVIWANTALLGOLDNOW: All Levels GOLD DEVIWANTITALLNOW: Unlock all levels   I loved this game and all it had to offer, just make sure to find this one on sale because then you will get your money out of it. I have totally loved playing this game and if you liked the game Trials 2: Second Edition then you will love this one!",
            "review_score": "1"
        },
        {
            "review_text": "It's rare to find games that are so horrible, it just isn't even worth writing about them. Monster Trucks Nitro is one of those rare games.",
            "review_score": "-1"
        }
    ]
}