{
    "app_id": 16810,
    "name": "Sid Meier's Civilization IV: Colonization",
    "release_date": "2008-09-23",
    "developer": [
        "Firaxis Games"
    ],
    "publisher": [
        "2K"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based",
        "Turn-Based Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 330,
    "negative_ratings": 95,
    "price": 9.99,
    "description": "Sid Meier's Civilization IV: Colonization is the third offering in the award winning Civilization IV series. A re-imagining of the classic Colonization game Sid Meier created in 1994, Sid Meier's Civilization IV: Colonization is a total conversion of the Civilization IV engine into a game experience in which players will lead a European...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/16810/header.jpg?t=1534546779",
    "minimum_requirements": "Supported OS: Windows® 2000/XP/Vista Processor: 1.2 GHz Intel Pentium 4 or AMD Athlon processor or equivalent Memory: 512 MB RAM Video: DirectX 9.0c-compatible 64 MB video card with Shader 1.1 Support or better DirectX® Version: Sid Meier's Civilization IV: Colonization DirectX(r) version (included on install) Sound: DirectX 9.0 compliant sound card                      Hard Drive: 900 MB",
    "recommended_requirements": "Processor: 1.8 GHz Intel Pentium 4 or AMD Athlon processor or equivalent Memory: 1 GB RAM Video: 128 MB Video Card w/ DirectX 9 support (pixel &amp; vertex shaders) Sound: DirectX 9.0 compliant sound card",
    "reviews": [
        {
            "review_text": "Played it to death pre-Steam, am going to play it to death on Steam. Very fun and moddable. Should you ever get bored of it, you can always mod it to play the indians.",
            "review_score": "1"
        },
        {
            "review_text": "Not quite as good as the original 1994 version (for sale on gog at $3) but an okay modernish remake. It lacks the option to pay the king to withdraw trade embargos that were present in the original and some of the user interface got more complicated to use. But it's still a worthy game.",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting take on civilization. It's simplified yet harder at the same time. You must settle in a new land and trade with europe and the local natives which will randomly give you a bonus for delivering a certain type of good. Towns generate goods based on what tiles you have assigned a worker to. You have a limited amount of turns to build a sturdy trade network before you must declare independance and defend yourself from europes revenge. Oh, and don't ♥♥♥♥ off the natives.",
            "review_score": "1"
        },
        {
            "review_text": "Great idea to get civilization to discover new land and set up colonies. Initially too easy to develop and very difficult to gain independence I think... more balance needed.",
            "review_score": "1"
        },
        {
            "review_text": "George Washington bayonetted men in their sleep.",
            "review_score": "1"
        },
        {
            "review_text": "Sid Meier's Civilization rarely disappoints.",
            "review_score": "1"
        },
        {
            "review_text": "Colonization is my favorite game that covers the revolutionary war in a very unique way. I love the build up towards liberty and independance and having to fight for freedom!          YouTube™ Video:  Sid Meier's Civilization IV Colonization Gameplay&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "its a fine game, but I think its less interesting than the original and vanilla CIV IV. Still, tons of fun to be had.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a Civ 4 mod, but requires a bit more mastery economically than the average civ game. Quite worth the money, in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Good, but played for a few hours then reinstalled the original. Better graphics but lacks the character of the original. Worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome recreation of the original that stays very true to not only the story and feel of the original but very closely mimics the original gameplay. Works well with Windows 8.1 so long as you set for compatibility mode.",
            "review_score": "1"
        },
        {
            "review_text": "so so addictive, the simplicity and repetitive nature should work against it and it should just become annoying, but it doesnt. Have lost quite a few evenings to this game, ferrying those resources back and forth, ah well.",
            "review_score": "1"
        },
        {
            "review_text": "An often overlooked side-game in the Civ series. Good fun for a playthrough here and there. A different take to the other Civ games on goods, population, city founding and unit production sets it apart from the other games. While a bit lacking in content by default, I thoroughly reccomend Civ IV: Colonization given you have one of the overhaul mods installed.",
            "review_score": "1"
        },
        {
            "review_text": "for anyone with fond memories of Sid Meier's Colonization, this is a must have, it's basically the same game with updated graphics.",
            "review_score": "1"
        },
        {
            "review_text": "so so addictive, the simplicity and repetitive nature should work against it and it should just become annoying, but it doesnt. Have lost quite a few evenings to this game, ferrying those resources back and forth, ah well.",
            "review_score": "1"
        },
        {
            "review_text": "great game gets hard as you progress but it a good game to play. becase of this i want the whole series",
            "review_score": "1"
        },
        {
            "review_text": "I lost my sack and spilled my marbs",
            "review_score": "1"
        },
        {
            "review_text": "This is a strategy gaming classic that really stands the test of time. For best results, download TAC (The Authentic Colonization Mod) which is basically like the last patch that the developers should have made (it plays very true to the original), restoring some features from the 90s original.   TIP: Unlike Civilization, where it's often better to expand and expand, in Colonization, you want to setup a tight colony economy that you can defend, and declare independence as soon as possible. A spread out colony is easy pickings for the King's Army.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. It's a simple version of the exploration and early development of the New World by European nations. A player interacts with natives and other Europeans and decides how they wish to interact, whether with hostility and agression or as peacably as possible. After a colony is set up, it will need to expand it's infrastructure so more land can be acquired nearby. The game is very much simplified, but it is one that I come back to after years of playing when I want to experience colonizing the New World.",
            "review_score": "1"
        },
        {
            "review_text": "DONT BUY THIS if you liked the original colonization game, stay away from this game.  they have ♥♥♥♥ed it up so bad, they ruined trading, relation with the king, founding fathers (although that was a bit broken in the old game, they haven't fixed, they just made it bad) this game is a straight downgrade over the old one, even if it might not appear so on trailer and pictures on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Horriably Made. An Interesting attempt that is stifled by it's own broken system. Essentailly it's fun building the economy, but acutally achieving independance doesn't make sense. Despite having all of the cities at 100% with a vast miltary empire behind you, it will never allow you to seperate. Addtionally you can glitch this game in so many ways which breaks the system. Don't play this game unless they fix it. Which considering the fact Civ 5 is out, NEVER.",
            "review_score": "-1"
        },
        {
            "review_text": "it's not good",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome Game. But keeps crashing. Updated video card, but still don't work.",
            "review_score": "-1"
        },
        {
            "review_text": "a piece of game design ♥♥♥♥. Firaxis managed to ♥♥♥♥ up a 100% Colonization clone. wow!  Exponential education cost? seriously? the more bells the player produces, the bigger the King's expeditionary force will be. sounds like fun!  afaik, the Natives do not give more gold for goods they want as was in the original Colonization. pioneer actions cost gold not tools - good!",
            "review_score": "-1"
        }
    ]
}