{
    "app_id": 17180,
    "name": "Mosby's Confederacy",
    "release_date": "2008-11-19",
    "developer": [
        "Tilted Mill Entertainment, Inc."
    ],
    "publisher": [
        "Tilted Mill Entertainment, Inc."
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Historical"
    ],
    "achievements": 13,
    "positive_ratings": 15,
    "negative_ratings": 6,
    "price": 6.99,
    "description": "As John Singleton Mosby, one of the Civil War's most interesting and dynamic leaders, you are charged, not with leading vast armies into battle, but with commanding small bands of skirmishers, scouts, and guerilla fighters on opportunistic missions to scout, ambush, steal supplies, and harass a larger and better-armed force of Union soldi",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/17180/header.jpg?t=1447351573",
    "minimum_requirements": "Operating system: Windows® XP or Vista                      Processor: 1.8 GHz processor or higher                      Memory: 512 MB RAM Windows XP® (1 GB for Windows® Vista)                      Hard disk space: 350 MB uncompressed free hard drive space                      Video: 64 MB DirectX 8.1 compatible card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Did the Achievements and was done with it... The game is not bad but don't run good on Modern PCs and it's too troublesome on the gameplay part...",
            "review_score": "1"
        },
        {
            "review_text": "I picked this game up looong ago. About the time it actually came out in 2008. I played it a little but due to lack of interest and most importantly: patience, i left it aside for my WoW-addiction i was feeding back in those days.  It isnt the best game around, thats for sure. But i very recently started playing it again and i approached it differently. Playing it the way the game actually wants to be played, stealthy, slowly, scouting ahead, pulling a few soldiers away and taking the time to save each man in your small unit. It feels great, sure every battle you do is pretty similar and repetition is one of the major drawbacks but the progression is nice and working towards upgrading each town and getting as much hardenend and seasoned veterans is fun.  dunno if the current €10,- is really worth it, id more likely price it at 7 or 5 considering its 8 years old. But i must say, im really having a blast.",
            "review_score": "1"
        }
    ]
}