{
    "app_id": 17300,
    "name": "Crysis",
    "release_date": "2008-09-17",
    "developer": [
        "Crytek"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Action",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 6075,
    "negative_ratings": 1277,
    "price": 9.99,
    "description": "Adapt to Survive  An epic story thrusts players into an ever-changing environment, forcing them to adapt their tactics and approach to conquer battlefields ranging from newly frozen jungle to zero-gravity alien environments. Suit up!  A high-tech Nanosuit allows gamers to augment their abilities in real time on the battlefield.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/17300/header.jpg?t=1447351450",
    "minimum_requirements": "Supported OS: Windows XP or Windows Vista*** Processor: 2.8 GHz or faster (XP) or 3.2 GHz or faster* (Vista) Memory: 1.0 GB RAM (XP) or 1.5 GB RAM (Vista) Graphics: 256 MB** DirectX Version: DirectX 9.0c (included) Sound: DirectX 9.0c compatible Hard Drive: 12GB * Supported Processors: Intel Pentium 4 2.8 GHz (3.2 GHz for Vista) or faster, Intel Core 2.0 GHz (2.2 GHz for Vista) or faster, AMD Athlon 2800+ (3200+ for Vista) or faster. ** Supported chipsets: NVIDIA GeForce 6800 GT or greater; ATI Radeon 9800 Pro (Radeon X800 Pro for Vista) or greater. Laptop versions of these chipsets may work but are not supported. Integrated chipsets are not supported. Updates to your video and sound card drivers may be required. *** Currently only the 32-bit version is available.",
    "recommended_requirements": "Supported OS: Windows XP or Windows Vista Processor: Intel Core 2 DUO @ 2.2GHz or AMD Athlon 64 X2 4400+ Memory: 2.0 GB RAM Graphics: NVIDIA GeForce 8800 GTS/640 or similar",
    "reviews": [
        {
            "review_text": "Reasons to buy this game:  -good graphics, even today -you are able to develop your own playing style -very detailed and smart AI -had gun attachments when CoD 4: MW was released, CoD only added attachments in later games, way later -really exiting and intriguing storyline  -long singleplayer gameplay hours to be expected (20+) -great multiplayer -extremely large open world -large amount of content in the campaign  I recommend buying the whole Crysis series for all these (and much more) reasons.",
            "review_score": "1"
        },
        {
            "review_text": "Picked up a turtle and returned it safley to water 8/10 would rescue animals again",
            "review_score": "1"
        },
        {
            "review_text": "Anyone who has heard of Crysis knows it is still heralded to this day as a benchmark for graphics. Based on the Cry Engine 2, even now it is absolutely stunning.   But more importantly its actually a brilliant game all round. The story is pretty standard, you are a special force operative kitted out with a 'Nano Suit' which allows you to perform as a super soldier, whilst on mission you discover an Alien species which are plotting to invade the world (or so it seems). Voice acting is pretty good, the facial mapping is OUTSTANDING!   But the key point that won this game for me was the true freedom it provides you in how you play. The map is very open, leaving it up to the player how you approach each objective. You can switch your suit to max armour and plow straight through the next check point murdering people left right and centre... you could turn on your optic camoflage and sneak through without a soul knowing, you could buff your strength, pick up an explosive barrel, hurl it at the building and watch the Crytek physics bring the roof down upon your foes. It really gives you the freedom to play it in a way that suits you and that is why I would recommend Crysis.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite 'before Steam' classics...! Now it is 2016, and this game is still multiple times better, than most modern shooters!",
            "review_score": "1"
        },
        {
            "review_text": "The game may be 9 years old, but the graphics can still compete with many new releases today. Sure there may be some assets that are not wuiet up to todays standards of games that are considered looking great today. For instance the palm trees may be a bit edgier than more modern trees that use tesselation. or some rock textures that aren't quiet as crisp as they could be. Everything else when it comes to graphics still holds up very well to new releases.  When it comes to performance the game should runs just fine on maximum graphics, as long as your system has decent hardware. im thinking soething like a gtx660 and some i5 should handle it just fine  Now that we got the 'graphics part' out of the way.  Let's get to the actual review: I played this game 9 years ago when it came out and I loved it. The Physics are some of the best I've seen in any game to date. You can destroy entire huts. Without having them collapse in a predetermined way. but instead theyll actually react physicly correct to how you interacted with them.  There are 10 Levels in the game. That are all pretty big. So there is no pre-determined way to go like in call of duty. Each of the levels are several square kilometers big that you can actually walk on. And there aren't really any areas that feel empty.  The AI is pretty smart for the most part. On the highest difficulty they are pretty hard to beat at times. However they aren't perfect ofcourse either. For instance in the 1st level there is a guy in a toilet. and 8/10 times when he gets alert to you he runs into the wall of the toilet instead of out through the door.  The Story is probably the games weakest feature, which doesn't say it's bad. It's just nothing particularly special either. That beeing said, as a little side note: The story in Crysis 2 is actually quiet an improvement over the one in Crysis 1.  And now the most important gameplay element: The nanosuit. For me this made it for one super cool, cause you are some super hero kind badass (with a slightly more grounded background lore to how the powers work than most comic book super heroes). And also I think it makes for some very fun options gameplay wise. You have great mobility with speed and strength mode. you can choose to fight as a tank with armor mode (although you still die very quick on delta difficulty so its not crazy overpowered) and you can play very stealthy with the cloak mode (which makes you almost but not completly invisible). All those abilities use the suit's energy, so they can not be used indefinitly. And the best thing is you can switch in between the diffrent suitmodes at any time, so you can adapt your playstyle to the situation at any given time.  Last: The Multiplayer: So appereantly the multiplayer doesn't work anymore due to the service it used (gamespy) shutting down. However there may be workarounds to still play online. And the LAN mode still works ofcourse. I personally didn't bother much with the multiplayer in crysis 1. Back when I tried it it seemed alright, but I don't think it lived auiet up to the potential of multiplayer fun there could have been with the nanosuit. crysis 2 was an improvement in that regard in my opinion.  So all in all Crysis 1(and I'm mainly referring to the singleplayer here) in my opinion is one of the best shooters ever made. And I'd recommend it to anyone who hasn't played it yet. (9/10) (10/10 if you choose to ignore the slightly weaker story)",
            "review_score": "1"
        },
        {
            "review_text": "This game can't be run on 64bit systems without manually patching it. The patches are available off of the crytek website, but have not been added to the Steam version.  This is not Steam's fault, but an intentional decision made by EA for the express purpose of harming customers who purchase the game through Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "For a long time, I had Crysis down as a graphics demonstration; all the looks &amp; headlines but with no substance. Hardly surprising when all that was talked about was 'Can it Crysis?'.  However, I picked it up cheap in 2010 after building a fresh system &amp; wanted to see what it could do.  It was only when I found I was riveted to the game did I realise that underneither the headline grabbing garphics, was a game that utterly appealled to me; it's a seriously immersive story that holds on to you for hour after hour.  The game play is excellent, switching suit modes is fast &amp; intuitive, the gun upgrades are all worth considering &amp; best of all you can be gung-ho if you want or you can stealth you way around &amp; not really kill anyone &amp; still acheive the mission objectives, the game simply sets you're objective, then lets you crack on with it, rather than forcing you one way or another, a trait that defines utterly iconic games like Deus-Ex.  The vehicles handle like boats though, much like Farcry, Crytek's first game &amp; the climax is a little overblown. It's dramatic &amp; exciting, right up until you fight the final 'boss'. However, like Bioshock, the build up is so enjoyable, any final battle is going to feel like an anticlimax.  Ultimately, the game ended with me chewing my hands for more, which means that it's succeeded in engrossing me in the world it's creating, which is the one thing I demand. An excellent multiplayer is all well &amp; good, but if a game has a story line, in my mind, it has to stand on that alone or not at all. Crysis doesn't need the graphics or EA's massive marketing department to be a truly noteable game, but it does help make us aware of it.",
            "review_score": "1"
        },
        {
            "review_text": "If you have Windows 7 just pass this over. Neither me nor my friends could get this to run after hours of tweaking settings and modifying exe files, and non of us are PC illiterate. Steam won't refund, either.",
            "review_score": "-1"
        },
        {
            "review_text": "Ah, an absolute classic. This is a game that pushed forward serious PC gaming. Nine years old, and the visuals still outclass anything playable on a console. The campaign is a bit short, but for the most part it is a great ride. It can take some time to get used to the suit controls, but once you do the game feels much more flexible and dynamic.  Oh, and the multiplayer is still pretty sweet.  9/10",
            "review_score": "1"
        },
        {
            "review_text": " At least the graphics remain impressive for its age.   Honestly? Crysis looks, even years after the release, impressive, but in terms of the gameplay, I find it extremely boring and repetitive with no interesting things whatsoever to actually make it feel like fun.  What is nice is you can set your own pace, and either go for stealth or full action using the abilities of the Nanosuit armor, but that is about it for me. You travel somewhere and shoot. Yes, that is the point of first-person shooters, but Crysis managed to make the experience, albeit subjectively, boring.  I understand that my opinion is not popular and probably not even correct, but I just could not find a way to like this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I have a GTX 1080 Strix overclocked at 1440p high, and I hit about 70 fps min, and you have no idea how happy I am that I can finally run it....I got the crysis collection, They all are AMAZING.  This game beats others in its genre in many ways...I've played many games (Not on this account though) and I have to say, I was very impressed with this game, and it will always have a place in my heart....If you want to know a good way to describe Crysis, its like Halo and Gmod combined...Well, what its like to me...anyways, BUY THIS GAME  11/10 Kill with chicken again.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game.From the start. But the more and more you go on in the game,the more bugs/glitches you get. To a very unplayable ,blue screen giving, last mission. If you even manage to get this game to work in the first place.  5/10.Too much hassle.All show,no blow.",
            "review_score": "-1"
        },
        {
            "review_text": "R.I.P Gamespy. - 2014 'They had the power, to power a game so awesome they couldn't handle it all'.",
            "review_score": "1"
        },
        {
            "review_text": "+ Unique and challenging gameplay + Realistic graphics + Great soundtrack + Really great story + Proper difficulties",
            "review_score": "1"
        },
        {
            "review_text": "Solid FPS, control of the suit take sometimes to get used to but overall a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever! 10/10 The black screen had awesome graphics and a lot of gameplay option Love it  EA Is the best publisher of unworking game!!",
            "review_score": "1"
        },
        {
            "review_text": "Since Gamespy closed, you wont be able to activate your key, so you wont be able to play",
            "review_score": "-1"
        },
        {
            "review_text": "Crysis has had a strange life since it's release in 2007. At the time of it's release it was by far the most technologically challenging game to play, utilizing graphics that would make even the high end PC's of the time scream in terror. Because of this simple fact it was for the longest time mentioned in conversation much as one would mention a benchmark tool and throughout gaming, that is how it was viewed. A measure of the strength of your PC. A strange fate for a game.  Although there has never been much concern for the game beneath the graphics Crysis isn't a bad game. Although it does nothing new or revolutionary it is a good solid FPS that is spared the horrors of knee high walls that often afflicts other games in this genre.  You play as a super soldier wearing the Crytek version of power armor, a skintight bodysuit that lets you active various temporary abilities such as invisibility and bullet absorption. Although the attempt at stealth is fairly half-hearted the ability to leap 20 feet into the air and jump 60 miles per hour allows you to engage enemies in a variety of ways and that certainly helps keep the gunplay fresh.  The storyline is fairly standard, supersoldier stuff and the voice-acting doesn't go completely bad despite some poorly casted movie stars as your supporting cast.  All in all it's a fun play although not a game I think would have ever been made much noise about if it wasn't for the incredible graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Next gen graphics! Good detail, interesting story plot. Looks better then CoD.... Wait a minute. It's almost 8 years old, wow.",
            "review_score": "1"
        },
        {
            "review_text": "Game from 2007, now in 2015 it still looks good and with graphic mods it looks even better than most current games. But the game is more than graphics. Good story, easy-to-learn gameplay and a exoskelleton (called Nanosuit) years before Call of Duty.",
            "review_score": "1"
        },
        {
            "review_text": "I love the Crysis series. Regardless of what many may think about it i find it very entertaining with diverse ways to play. It sucks that from what i hear is that they're shutting down their online servers, in which case i hope steam will step in and fix the online.   So basically you're a super soldier, you have many different abilities that you can use to your advantage. Whether that is super speed, stealth, super strength, or armor. This game has a bit more of an open world compared to Crysis 2. Unfortunately i haven't played 3 yet, but i will at some point to get more of the story. This game is worth what the price is for the single player. I would however wait for a sale with a bundle together for it. Get them all at once for cheap :P  Anyways i would love to get more into this game and tell you about the story, but i think i'll just let the game speak for itself. Enjoy one of the most graphically astounding games of it's time and have fun in one of the most fun games i ever played. :)   (fyi i played this on ps3 a bit more than the steam version)",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played too much so far, but what I have has been great fun. Requires actual stealth unlike some modern 'stealth' games. You can still get in a firefight, but you're not invincible like the trailer makes you out to be.  This game has issues on Windows 8 x64. I was able to make it work great through the use of the -dx9 command line switch. Some people claim that this doesn't work, others claim they don't need it. YMMV. Also note that the default resolution is 4:3, and you need to scroll down in the menu to see the 1920x1080 option which is not immediately obvious.",
            "review_score": "1"
        },
        {
            "review_text": "The pure game benchmark, an immersive story, but a little complex. The game isn't only graphics, you got to understand the concept to see how the game reinvents itself. REALLY RECOMMENDED!!",
            "review_score": "1"
        },
        {
            "review_text": "It's Crysis. Totally awesome game with beautiful graphics. Grab the Maximum Edition and get Warhead too.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis is notorious for having both the highest of high end graphics and for dishing out the most punishment to your computer hardware. But in the two+ years since release it's become a lot easier to get the hardware necessary to play, and if you've got it you owe yourself the chance to see the visual glory Crysis offers.  Crysis is more than a pretty picture though; the game offers some deft gun combat that's mixed in with many opportunities to be sneaky thanks to your special powers. The vehicles however are unsatisfying to drive and the energy meter for your powers feels anemic. Fortunately the weapons you have at your disposal offer a pleasing punch allowing you to make good progress in the single player without feeling much frustration.   Storywise the game strives for believability, but it's all balderdash play acting that undermines the serious aura. Thankfully the free-flow pacing of the game gives you ample time to breath, explore, and appreciate the visuals.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis 1 is a more open-world game than the other series, belive me! You have a whole huge jungle that you can scrumble around it, awesome story, still beautifull graphics for such an old game and the multiplayer it isn't that bad...",
            "review_score": "1"
        },
        {
            "review_text": "I have to go out on a limb here and say that this is actually one of the best FPS games I ever played, period.  Others may point out the deficiencies, but through the curious way I experienced this game it has ultimately assumed the status of an absolute classic in my eyes.  That experience I mention is this: On my first ever playthrough, my rig was such that the game crashed as soon as I entered the final act - all that water and all those explosions, you dig? - and so I never actually knew that it was the final act. In my mind the game stretched on into inifinity - and what an infinity it was.   The game goes through three distinct phases, each more jaw-droppingly perfect than the last. At first, one is navigating a jungly-coated tropical island world, evading - or annihilating, though this was never as fun for me - conventional, dastardly Korean forces in a manner strongly remeniscent of the original Far Cry (for me at least, Far Cry didn't really have any stealth component, though i did everything i could to force it to play like a stealth shooter nonetheless) In the second phase, all-out conflict has broken out and, while you can continue to play as a phantom if you wish, the stakes and scale soar upwards into 'epic' territory. In the third phase, you discover a vast and fantastic secret lurking within the island, exploring this secret in a state of permawonder, before re-emerging into a drastically altered form of the second phase, to see out the game.  My initial experience was cut short most of the way through the third phase, so in my mind it was, as I've said, neverending, and by jebus that neverending game was FPS fantasy made reality. It really is just an awesome game.  Quite apart form the graphics, which are to this day superior to almost any other offering of comprable setting (visually if not technolgically, though the tech is still close), the gameplay is tight and perfectly polished. This is the kind of game that, while vaguely linear, allows a player to turn 100m of linear progression into around 1km of side-track meandering and sneaking more or less throughout the entire experience. One can craft one's own adventure here, as surely as any of those gimmicky kids books from the '90s, and just as everyone had envisioned in their wildest dreams back then this adventure is lush, endless and full of wonders more wonderous than the last.  The gameplay is consistent and with the possible exception of the final moments of the second phase, in which combat is more or less forced on you and the game literally ejects any background action in an effort - only marginally succesful - to turn your final stage into some kind of arena, it is consistently entertaining.  Why should you buy this game? Because your computer may very well finally be able to run it in something approaching max settings, because it is one of the best FPS experiences you will ever play, and because it is streets, miles ahead of any other  similar  game released in the years before or the years after.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis is a graphical marvel, it boasts the best application of physics I've ever come across and, in the nanosuit, a gimmick that genuinely brings something original and exciting to the table.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love Action and Team Games! This game includes Vehicles! Weapons, Vehicles and Team play what more could you ask for ? Well maybe Zombies, but they wouldnt stand a chance due to the fact of updated armor and weapons.",
            "review_score": "1"
        },
        {
            "review_text": "A tedious bore. Don't know what anybody sees in it. All the Crysis stuff bored me.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall, Crysis is definitely another win for Crytek and another one of those games that's more than the sum of its parts. They’ve created some amazing technology that’s scalable enough that many gamers will be able to play it on some setting, even if it isn’t the best, and have a good amount of fun. Those that have computers to run the game at DX9 on high will find that the amazing visuals definitely enhance the amount of immersion and enjoyment Crysis can provide. This is some fast, well designed gameplay with enough options to allow players to use their own style of attack with satisfying suit abilities and weapons. Crytek has upped their attention to detail in presentation and dropped the worst parts of Far Cry’s story. The multiplayer, while probably not enough to draw players away from their favorites, is also worth the time. While the Halo 2 type of ending for the single player left a bad taste in my mouth, it wasn’t enough to deter me from heartily recommending action fans pick this one up.",
            "review_score": "1"
        },
        {
            "review_text": "I seriously need to put more hours into this game, because I can give you three reasons why to pick up this game.  1.First thing you'll notice is the graphics, for a game that came out in 2007, it looks absolutely gorgeous, one of the best looking games on the pc, whether it's the facial animation or the lush forests, it's beautiful.  2. It's not extremely linear or a corrodor shooter, the levels are open and allow you to stealth certain outposts or areas or to go guns a blazing. That's what separates it from games like cod(and yes I know Cod 4 came out barely before this game did, infact by only 8 days).  3.The story is excellent here, now while I haven't gotten too far in the story, I've gotten to the point where it's actually starting to grip me, making me want to fight in the battles that occur later on, it gets extremely emotional.  There you have it, Crysis is an extremely well developed first person shooter and I could recommend it to anyone, not to mention that along with the campaign we also get a multiplayer. I give it a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Old news this days...but it remains one of the best games ever made: gameplay amd graphics (on his life time, of course...)",
            "review_score": "1"
        },
        {
            "review_text": "The game's story is pretty good ... With brands nano suit the pace of the game, you can make a sack or infiltrating, you decide to taste. How to modify weapons has its point. The party least liked me is the interior of the ship, but overall the game is very good. You can play on hard without problem. For years you already have the game entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "As I played this game from 2007 in 2014, all graphics settings could be maxed out. I was amazed that a 7 year old game, could deliver such an enjoyable experience! Especially as FPS tend to depend alot on their graphics performance. Crysis provided a good mix of stealth, full-on action, vehicular combat and differing environments. Although not as open as some of the more recent FPS games (e.g. Far Cry 3), it provides ample opportunities to choose different paths in reaching your objectives. The nanosuit deserves a special mention as it adds gameplay due to the capabilities of the suit. Overall, a highly recommended golden classic!  Score: 8.5/10  Pro:  + very nice graphics (even if the game is almost 7 years old!) + nanosuit capabilities + excellent gameplay + semi-open world + decent amount of mods available on the internet (didn't try any)  Contra: - too short; 10 to 15 hours to complete - some enemy A.I. &amp; graphics glitches",
            "review_score": "1"
        },
        {
            "review_text": "What you hear about this game is right. The graphics are beautiful, the abilities are awesome, the scenery is amazing, the sound is excelent, the visuals are mind blowing. The story is ♥♥♥♥! But free for all multiplayer is fun.",
            "review_score": "1"
        },
        {
            "review_text": "The game that coined the term 'But can it run Crysis?'. Even to this day I think the game looks fantastic, and still a lot of fun, and contains some really memorable parts. If you want a great single player shooter, look no further.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly Amazing shooter. The Graphics, The story, everything is so cool, but customization systems rock! of course it has just 1 or maybe 2 part that wasnt the best, but this game is full of with Action. 9.5/10 :)",
            "review_score": "1"
        },
        {
            "review_text": "great game and looks great ON ULTRA SETTINGS it is still very power demanding today but still a classic and will always be one",
            "review_score": "1"
        },
        {
            "review_text": "I remember when this was considered a trial by fire for anyone's computer, even today some low end rigs struggle to run it.  It's a nice game, perhaps set back by it's stiffy for post-processing, but there's a functional experience here at least, it annoyed me that the multiplayer didn't have vehicles, that was introduced in Crysis Warhead.  Aaaaanyway, Crysis begins when your squad is sent to the Lingshan islands to rescue a research team who have uncovered something big, and dangerous. Ancient technology of an alien civilization buried in the earth.  And now I'm sitting in the same pose as that History Channel bloke, ALIENS.  Outside of combatting an awakening alien scourge, you fight against a division of the Korean Military who have occupied the island due to the discovery, using stealth, wits, various vehicles, and your Nanosuit to overcome the challenges facing you.  The game also features a realtime weapon modification mechanic, allowing you to swap out attachments and ammo types on the fly, you unlock these attachments as you find them ingame, my personal recommendation is to use an assault scope and a silencer on your FY-71, and then keep a Precision Rifle with a Sniper scope handy for those crucial shots.  I will not spoil any of the game's major plot points, play it for yourself if you are interested.",
            "review_score": "1"
        },
        {
            "review_text": "from time to time i install this game just to re-live this beautiful paradise. yes its 2015 and yes this game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "Even close to 10 years after it's launch, it is still considered to be a benchmark as far as graphics go.  However, sadly the graphics seems to have overshadowed the actual game itself. Even if it had average graphics, it is still a fantastic shooter with great mechanics.  PS: I had the game before steam, and completed it in it's entirety, which is why I only have 2 hours of play time.",
            "review_score": "1"
        },
        {
            "review_text": "***Written in a nostalgic saturday night***   I started playing it when I was 13 years old, back in March 2008, I had to buy a new graphics card for my computer, an nVidia 9600GT, to be able to run the game with almost everything at minimum. And well, that breathtaking HALO jump intro hooked me into an incredible game with features that I hadn't experienced before. My mind was completely blown with this game. I played hours and hours and I enjoyed it so much, too bad my parents wouldn't let me play as much I wanted :(  **tears running down my face**  I even enjoyed with the most simple things I could do in this game, like picking up a cute turtle or a chicken, and throw it hundreds of meters away. Or hiting those tropical buildings smashing them into pieces, or driving like a crazy driver, or having a swim on a paradise beach while the sun was setting and some northkoreans were yelling strange things...   **maximum nostalgia**   Now, time for my subjective and totally parcial review. I can only give this game a 10/10 because what it meant at that time:   -no one ever had done a similar gameplay concept before -the graphics were very advanced, and even today looks really nice -The crytek engine, it was mind-blowing. At that time, who could ever think that it would possible to have so much freedom in a game? that it would be possible to pick up random animals and throw them away or even use them as weapons? -The multiplayer, it put very well all that freedom into an online gameplay with a fair amount of players and very big maps -To sum up, it became a reference in no time after release. Everyone would use it as a reference when comparing graphics , when building a new PC, when comparing gameplay features.... And the famous words 'NASA computer' became one of the most used for years thanks to this game.   Can the NASA computers run it today with all settings at max? :P",
            "review_score": "1"
        },
        {
            "review_text": "best game of its time",
            "review_score": "1"
        },
        {
            "review_text": "Graphics that still dont look ♥♥♥♥ after more than 7 years / 10.",
            "review_score": "1"
        },
        {
            "review_text": "It's the best game ever, I hope they made Crysis 4",
            "review_score": "1"
        },
        {
            "review_text": "maximum graphics",
            "review_score": "1"
        },
        {
            "review_text": "Good gameplay and amazing graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Looks epic even today. And there are lots of funs to mess around in the open world with various weapons, vehiecles and your nanosuit.  This game is so underapprecited for its amazing graphcs, just like some good actresses are under appreciated for their pretty appearances.",
            "review_score": "1"
        },
        {
            "review_text": "this game stoped working? ",
            "review_score": "-1"
        },
        {
            "review_text": "3DMark2007: Maximum Edition Would run another benchmark using Crysis 11/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 love this game",
            "review_score": "1"
        },
        {
            "review_text": "why pc is better than console; the game  pretty/10",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game that broke records(and peoples pc's) way back in 2007 when it was first released,no other game was even close to being as technically advanced,even the mighty 'Unreal Engine' had to kick it up a notch.BUT everybody who likes gaming knows that a game is nothing without good gameplay and thats where Crysis really shinned,missions had a open (approach from anywhere)sandbox-style to them and couple that with a compelling story made Crysis a joy to look at AND play.",
            "review_score": "1"
        },
        {
            "review_text": "You can't run Crysis.",
            "review_score": "1"
        },
        {
            "review_text": "pros:  -Fun and challenging gameplay (i dunno see for yourself) -Looks godlike even to this day. -requires less ram than ps vita ports (Senran Kagura Shinovi Versus: Shōjo-tachi no Shōmei requires 6GB of RAM for a game that doesn't look or feel very resource intensive. Infact, that game looks like it belongs on PS3 even for the PC version, and the PS3 has 256MB(!) of RAM. Even DOOM (the new one) had a reason to use 6GB+ of memory.)  cons:  -Limited activations. -Doesn't load on my computer (SteamOS, Windows 7, GTX 950, AMD A4-7300, 8GB RAM) for some odd reason. -No GNU/Linux version.",
            "review_score": "1"
        },
        {
            "review_text": "Basically, the game starts out as a poor-man's Far Cry, and winds up being a poor-man's Halo.   The production value here for 2007 is quite impressive, and holds up extremely well.   Don't let the Gamespy installation tempt you. Since it's dead, of course there is no multiplayer, and therefore no reason to install that bit. Just skip it when it prompts you.   The game unfortunately is riddled with bugs, and a couple in particular are game-stopping. If you can get past this, the core game itself is pretty good. The multitudinous foliage of the jungle does factor into stealth (unlike many games with similar concepts/settings), but since you're wearing a badass nanosuit you do have the option of run-and-gun.   I will say however that being able to turn invisible, even for short lengths of time, is an unfair playground for anyone even remotely good at stealth gameplay. In fact, if you ARE good at stealth gameplay, being invisible for short periods threaten to crush the game's difficulty, if you are so inclined. Inexplicably, in spite of so many excellent stealth elements there are absoutely no stealth kills in the game. You don't even have a knife. What kind of spec-ops soldier doesn't have a knife? Plenty of suppressors you can attach for weapons, but you'll have to wait until Crysis 2 to actually shank someone from behind.  The game does a good job of APPEARING to be open-world, but it actually isn't. It's still on rails, those are just some very wide rails.   The AI was good, surprisingly. No real complaints, and that's pretty rare for me.   One minor complaint is that in spite of being a badass (thanks to you), the main character is fairly dim-witted. It doesn't help that many things are left unexplained not only in this game, but the sequel as well. All-in-all, the game is an epic ride if you can ignore the many flaws.   ",
            "review_score": "1"
        },
        {
            "review_text": "Well this is Crysis..what else can I say?",
            "review_score": "1"
        },
        {
            "review_text": "Aside from the people who ignored fixing game-crashing bugs because of lolpiracy, it's a pretty solid game. Intense if I might add. You got a huge open world to run around and approach objectives any way you wish. Gameplay is pretty good, and the graphics -- the game's pride-and-joy -- is impressive. Story-wise? Kinda okay. Recommended? If you like shooters, yeah.",
            "review_score": "1"
        },
        {
            "review_text": "Frankly I'd love to write an actual review of the game but can't, it actually refuses to play. I can't tell if it's the game or a Steam side problem but I'm not the only one, if you have a 64 bit system, avoid wasting the money.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this on Steam it doesn't work for everyone becuase it's incompatible with 64-bit systems, even with the patch this still didn't work for me don't waste your money on it, mabye the disk version works I don't know.",
            "review_score": "-1"
        },
        {
            "review_text": "wow much graphics such fps  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and has alot to it. But the thing is, it just keep crashing after 1 day of gameplay. DO NOT buy this version, as it have the outdated version. Buy the updated version of Origin. Sadly I just can't recommend this, too much crash. ",
            "review_score": "-1"
        },
        {
            "review_text": " 'Oh you can be invinsible', starts T-bagging enemies afther stabbing them down.",
            "review_score": "1"
        },
        {
            "review_text": "it is the worst I bought it on sale and it just crashes every time I open it do NOT get it",
            "review_score": "-1"
        },
        {
            "review_text": "WTF the game is unplayable on the last boss too glitchy",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know, this game just did not hold my attention.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this games last year and found out about the 64 bit problem, fixed it through tutorials online, and enjoyed the game. A week later the game started to fail to launch, didn't understand what changed, maybe new drivers, did steps that worked before but that didn't help. So I unistalled. A year later I upgraded to a gtx 980 ti from a amd card, thought i check this game out again. Still didn't work the first time as expected, then tried some different things I saw online and still refuses to launch. Uninstalled.  10/10 would get bested by a game again and again.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get this game if your system is a 64bit, why? Because it don't work at all! I have tried everything to get it to work and it still won't run, very disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "robocop thinks he's an ordinary blacksmith but must mobilize all of his metal when a gang of sexy hattifnats kidnaps his beloved 7 million returnable bottles",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "To preface: I am not an avid fan of the FPS genre. I can enjoy games when they are well made, but the mechanics of FPS games do not inherently have much appeal to me.  Its really hard to say much about this game. I'm sure it was an amazing title when it came out but it doesn't age well because the story is thin and not fleshed out. As such it ends up as just another shooter, maybe a little less boring than the others.   Performance in this game suffers hard. On my 6850 HD / 2.8ghz *6 / 12GB system on a mix of High/Med visuals the game NEVER got above 35FPS if any action or foliage was on screen. In the end part of the game impossible slowdown would occur, causing frame dips into the single digits. Even reducing resolution and graphics options did not remedy this, although some persistence and restarting the game several times helped make it through. The game did not throw event triggers properly at least four or five times in my playthrough, requiring reloading of earlier saves. Physics interactions were also problematic, making slowdown from colliding objects and leading to vehicles becoming inescapably stuck. The graphics quality does seem alright, but since none of the environments have any artistic influence or design aside from the alien area its mostly wasted.  Gameplay does not stray far from the formula, but that is to be expected of AAA games. Its more or less the same formula as Far Cry down to the letter, with the addition of a stamina meter that also serves as regenerating shield and cloak. Everything is the same. Stealth isn't meaningful, the open environments are still actually linear, enemies spot you from a bit farther away than is reasonable (better than far cry at least) and have horrible pathing and AI. Gun variety is par for the course and more or less feels fine. Vehicles are still overpowered for their mounted guns, and enemies with mounted guns are still problematic. Environments are all generic jungle up until the end of the game. The characters are all stereotypes and completely lack depth.   The game's story is intentionally incomplete, doesn't cohere well, and cuts short at the end in a sequel hook so painful it almost feels insulting. You have a few moments that don't really mesh. Enemy nano-suit wearers ambush you once but never appear again. You have to perform a pseudo escort mission for an ally presumed dead after escaping some aliens and then he just bails for the sequel hook. The koreans just exist as convenient foreigners for you to shoot at until the aliens appear. I don't think its strange to want story in an FPS or any other game, but its a different kind of appeal I guess between Deus Ex or Bioshock Infinite or Fallout NV and something more arcadey like this. Far Cry 1 dragged on forever with its pacing over 15 hours and this game just suddenly ends with no resolution after 10 hours.   There's... nothing special about this game. Its just solid enough to not be terrible and looks alright. You're better off spending your money elsewhere, certainly not worth the $20 being asked for today. No reason to not wait for a sale if you're going to bother at all.",
            "review_score": "-1"
        },
        {
            "review_text": "A nanosuit makes the real soldier. Crysis was and still is a beatiful game with a lot in than just the graphics. A perfect example of what the rest of the Crytek shoul have followed,",
            "review_score": "1"
        },
        {
            "review_text": "Crysis, you hurt me when you decided to constantly CTD with my R270X. DX10, HDMI and my PC were too high tech. A shame, I loved you once and we cannot be together due to evolution. A shame you are still sold, even though hardware in 2015 is going to make you die on players around the globe constantly. Farewell Crysis, you will be missed/uninstalled.",
            "review_score": "-1"
        },
        {
            "review_text": "game crashs at the end of asension mission.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game! Loved the graphics and gameplay. Story was alright, but who really gets Crysis for the story.",
            "review_score": "1"
        },
        {
            "review_text": "Hit a korean soldier in the head with a banana AND a watermelon.  This game is serious, you know?   10/10",
            "review_score": "1"
        },
        {
            "review_text": "After playing Crysis 2 &amp; 3 I just couldn't play this. I got bored of it way too quickly oh yeah and the game has black bars for some reason which just make the experience even worse....",
            "review_score": "-1"
        },
        {
            "review_text": "Upgraded to Win 10 - Game is completely unable to start because of SecuROM. Thanks, guys.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty but shallow.",
            "review_score": "1"
        },
        {
            "review_text": "It's probably just me, but I never got what was supposed to be so special about Crysis. The suit was the only real draw, otherwise it's an average shooter and the story is fairly boring. And it sucks that even on a 2016 machine the game will still stutter. I can think of tons of other games I would rather play and recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "2016 still can't run this game on 60 fps",
            "review_score": "1"
        },
        {
            "review_text": "the game no star boot in black screen an close",
            "review_score": "-1"
        },
        {
            "review_text": "I dont know what all of the fuss is about. FarCry was awesome but this is rubbish. ",
            "review_score": "-1"
        },
        {
            "review_text": "Would love to play this game, but it crashes after 2 mins of play.",
            "review_score": "-1"
        },
        {
            "review_text": "I first played this game back in 2008 and I thought it was a great game. When I saw that I could get it along with two others in the franchise for just 7 bucks during the sale, I said heck yeah and installed it right away. Unfortunately, when I installed the game it wouldn't even load, it was a constant CTD situation. After looking online it turns out that a lot of people have this problem, particularly those that are using 64-bit OS's like me. I found a fix that allows me to launch the game and play it but it is still very unstable and randomly crashes, just like many others, which can cause a loss of a lot of play time. In the end I gave up. This was a great game but the developers and steam haven't kept it up to date, so if you are running a 64-bit OS like Windows 8.1 be aware that you may have problems running this game. I wish I could recommend it, but recommending an unstable game is like recommending Japanese fugu prepared by an amateur chef.",
            "review_score": "-1"
        },
        {
            "review_text": "Nobody could play it on full settings when it was released, nobody can play it today because it doesnt work on modern os... ",
            "review_score": "-1"
        },
        {
            "review_text": "So this game came out in 2007, and when it came out it was so hyped. Reviews was like - 'The graphics, the gameplay, the voice acting. WOW, WOW, WOW!'  I never played it when it came out, today nearly 10 years since the game released I actually played this game from start to finish.  Personally, I don't like it at all... This might have to do with the game being old, this might have to be that the game runs like crap (was not intended to be played in 1080p and above).  This game is just repetitive, clear this camp, do this, blow this ♥♥♥♥ up, wait for reinforcments to arive. When the game is starting to get OK, the ♥♥♥♥ing game ends...  As I said before, this might have been awesome in 2007. Today, not so much.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "It was nickress until it all turned snowy, not that I hate snow, I love it. But in this game it was all downhill from there, downhill, downmountain DOWN!",
            "review_score": "1"
        },
        {
            "review_text": "crappy gameplay with primitive AI that has a sixth sense. Game becomes boring and repetitive after first 2 hrs of gameplay. Very pathetic experience overall.",
            "review_score": "-1"
        },
        {
            "review_text": "I ♥♥♥♥ED A WILD DEER",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best Shooter ever made... Open world and Sci-Fi Classic!",
            "review_score": "1"
        },
        {
            "review_text": "it deserves a 1.3 patch to fix many things. anyway, it's superior",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong, this is a great Game, IF you can get it to run. As it is distributed now, it won't. Steam doesn't even provide X64 folders, which are obviously needed on a X64 System.",
            "review_score": "-1"
        },
        {
            "review_text": "ive installed and uninstalled this game more than i can count but it still refuses to work. It ENRAGES me!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "terrible FPS, boring gameplay, boring locale, game runs like crap.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice graphics demo, game is acceptable.",
            "review_score": "1"
        },
        {
            "review_text": "Not the best gameplay, but still a very powerful engine graphic-wise",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't launch game. Simple as that.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't work on modern day Steam, crashes every couple of minutes. Super pretty for when it's running though",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this because a lot of youtube videos I watched tested graphics out on it... and the third one. Played some and found them boring. Didn't give it much of a chance though.",
            "review_score": "-1"
        },
        {
            "review_text": "Although I briefly connected to the character as he crushed an asian mans windpipe, this game quickly became as unsatisfying as real life",
            "review_score": "-1"
        },
        {
            "review_text": "Solid, action-packed, fun game in superb graphics - if you manage to run it. Unfortunately EA tries everything to stop you from it and make the surrounding experience as unpleasant as possible and throws in a few extra crashes and corrupting savegames. The story ends in a cliffhanger.",
            "review_score": "-1"
        },
        {
            "review_text": "The graphical and performance feats this game accomplishes do not make up for the lackluster gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Whilst it received critical acclaim, Crysis is but perhaps the most generic first-person shooter to land on the PC platform. The story is all but engaging and at times predictable and cheesy as it is. It's a typical 'Hoorah' game that puts you in command of a nano-engineered super suit that greatly enhances the human body to the extremes of superman-like abilities. While the game surely has some memorable moment they don't justify the poor A.I with nearly pinpoint accuracy, graphical glitches and a forgettable story.   If anything, Crysis is - or was - only meant to stress hardware and see just what your system is capable of, nothing more.",
            "review_score": "-1"
        },
        {
            "review_text": "Crysis is the best and worst of gaming.  The best is it's got all this emergent gameplay based around simulation, where there is a giant map you can seemingly go anywhere in, can accomplish objectives however you want. Blow up all the buildings, drive all of the vehicles.  Your suit has a great mechanic to it where you can select between 'modes' like strength, speed, or armor, and run around  The game is surprisingly low budget as well, but uses every dollar spent to maximum effectiveness, because it's not about the 'guided cinematic experience' but rather the actual gameplay.  The bad is the gameplay isn't all that great.   All of the randomness in the gameplay systems makes for a frustrating experience. Mostly this takes the place of weapon accuracy where you are forver at the mercy of RNGesus. Sometimes you can waltz into the middle of a crowd of enemies and one shot them all to the face. Sometimes you can shoot into a wall and the enemies still die. Other times RNGeus will dictate your shotgun blasts all miss and the AI gets headshots at the same time and you die instantly. Sometimes enemies take 3 seconds to react to you standing directy in front of them. Other times you get insantly killed by a mounted machine gun on a boat 1 km away while you are hiding in the bushes.   Other games with recoil, even in 2007, usually make it feel good by making the camera shake so the weapon always shoots where it points, in a semi-random pattern you can learn to control. In this game the bullets spray out in a random pattern around the reticle, in addition to randomly rotating your camera to simulate unsteady aim, in addition to randomly rotating your reticle because of screen space 'cinematic' effects.  The audio sounds good sometimes, and bad other times. There is an issue with prioritizing effects here. Stuff like distant explosions has no audio at all, because the game doesn't know that is more important than a nearby ambient sound.  Something with the rendering pipeline seems to be adding significant display lag to things. This is often done when people want to really push graphics, as you can parallelize things better if you can delay processing of graphics stages by several frames so the CPU isn't spent waiting. Unfortunately in this case it seems to mean where you shoot isn't where the graphics is rendering you will shoot, but rather where you are in the simulated world. This is just too much lag for a FPS game that asks for precision. RNGesus may be here to try and mask this issue.  The end result is the gameplay loop is reduced to this: save often.   This may have been the norm in 2007, but playing it in 2016... yeah it's not worth finishing IMO.",
            "review_score": "-1"
        },
        {
            "review_text": "Unless you have windows XP or Vista, don't buy this. It's nothing but a waste of money that doesn't work. I wasted my money on this, and I hope nobody else buys this ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "i expected a game full of TECH and Nano-noise but instead i was forced to play as a mexican boy with a troubled childhood who occasionally comments on 90s dance music videos on youtube in broken english and lies about 'good nostalgia' because the only childhood memories he had was his abusive mother beating him senseless for a rolling pin because he didn't believe that the burnt residue in his grilled cheese was indeed the portrait of the Virgin Mary.  i give this game three thumbs down, and when I have to use my D*CK as an extra thumb you know you made a mistake. i mean seriously what the HECK?",
            "review_score": "-1"
        },
        {
            "review_text": "the game wont work on multiplayer... trying to get my money back now...",
            "review_score": "-1"
        },
        {
            "review_text": "  how was i able to review this i dont own it lol         maximum hax",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - Excellent graphics. Seriously, almost a decade old, and it holds up very well.  - The macho military dialog is groan-worthy, but it's fun. 'You want guarantees? Get a toaster!' - Some really cool level designs. It's generally very clear which direction you need to move in; there are a lot of visual cues that help guide you through some of the busier environments. There were quite a few instances where I found that I knew where to go without really *knowing* that I knew it, and that's always a good sign. - A variety of ways to move through the level, especially in the early going. A recent review called it more of a 'wide corridor' than a true open-world, but it feels open enough.  Cons: - Gunplay isn't bad, but I never felt like weapons were varied enough - or had enough ammo - to really make me like one over any other. I tended to just grab whatever was lying around. - Some overly long missions without much variety. I can only be entertained by moving into a new room and killing the three identical enemies contained therein for so long. - And the big one - it feels needlessly frustrating in some places. Dark Souls is frustrating but feels fair, for the most part. Crysis is frustrating and feels capricious. There's a tank level partway through, and I figured, hey, this'll be sweet. But it's not. You get one tank for the first half, a second tank for the second half. Every enemy has RPGs. Something kept falling from the sky and killing me. Enemy tanks hit hard. You can't repair your tank. If you lose your tank, that's it - you have a huge field to slog through, and you better hope you don't run up against an enemy vehicle, because you're screwed if you do. It should feel cool; it should make you feel powerful. But it doesn't.   The other big moment like this is at the end of the game. I won't spoil anything, but let me advise you to look around your environment and find the box of infinite rockets that the game, helpfully, does not tell you about, or the minigun which is wisely hidden amidst flaming wreckage. Can't just hand out that kind of power.   If it weren't for the atrocious design of the final level, I would still recommend Crysis. But in my opinion, it's too frustrating, and diminishes the entire experience.",
            "review_score": "-1"
        },
        {
            "review_text": "got bored waiting an entire 1 minute and 50 seconds waiting for the intro video to finish as there is no way of skipping it. half life 2 has seen more game play than this ever will. story is too slow, very little interaction with anything, and the suit controls etc seem too cumbersome.",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay: 9/10 - the different Nanosuit features are cool and add depth/variety to the gameplay as well as making encounters interesting. Aiming can be quite difficult at times.  Graphics: 10/10 - still one the best looking games, and mods improve graphics even more.  Level Design: 10/10 - huge map, tackle objectives in which ever order you please, variety of areas  Enemy Encounters: 8/10 - The first half of the game pits you against the North Koreans, which admittably get stale after a while. The A.I. is either stupid, or really smart. The macho-dudes with miniguns are a pain in the ♥♥♥.  Extras: 10/10 - the game has multiplayer (although I believe that might have been shut down?), and also has a CryEngine 2 Sandbox Editor which provides endless possibilities, not including mod options.  Final Verdict: 9.5/10 - While not a perfect game, it damn well near is and provides a very non-linear, well paced, exciting shooting game with near-photorealistic graphics and fantastic map design.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic fps, still looks amazing years later and it's got great great stealth/combat gameplay",
            "review_score": "1"
        },
        {
            "review_text": "I just played Crysis in 2008 and leave absolute positive feelings inside me. Dunno why? This game is terrible! I just try out again and bored from the first minute. Enemy AI is stupid like hell and the game cheating strongly. Shooting enemies also very boring ( weapons are bad too ), The island where we play is beautyfull, everything modelled well. Cryengine is better than U3 technically ( no question about it ). but the whole thing not fit. I give positive feedback just because respecting the work of Crytek, but i not recommend this game so far...",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. Its hard to focus on doing missions/objectives when everything is so pretty.",
            "review_score": "1"
        },
        {
            "review_text": "i wish it worked",
            "review_score": "1"
        },
        {
            "review_text": "Started the game 3 separate times, never got more than halfway...Can't put my finger on what stops me from going back again. The sneaking around in the bushes does get tiresome and repetitive but that's likely not all. There is very little reason not to recommend this game. It is well built and provides lots of toys and bag guys in a lush playground. 8.0",
            "review_score": "1"
        },
        {
            "review_text": "Great FPS game with realistic physics to the point where you can crawl through bushes and the like to hide from and sneak up on unsuspecting NPCs. Your nanosuit's array of cool abilities (you can turn invisible like the Predator and stalk your unsuspecting and foolish oponents. Didn't bring your futuristic nanosuit to the fight? Well tough ♥♥♥♥ fool! :P) make the gameplay fun and never boring as you can approach objectives in different ways depending on your preferred playstyle and coupled with tight shooting mechanics and a solid story this a great game if you're a fan of the genre.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Excelent Si-Fi FPS, It gets slightly buggy sometimes...",
            "review_score": "1"
        },
        {
            "review_text": "This game is so long it took me 3 years to finish it. It was okay - not sure why people say it was better than Crysis 3, though. I thought the third was a MUCH more enjoyable experience.",
            "review_score": "1"
        },
        {
            "review_text": "It was really good FPS game, BUT!!!!   Everything was fine. Good story, nice graphics. Only think which was not so good is controls. Switch weapons is absolutely idiotic and in critical situations, its just useless. Of course its a possible to used at it, but still....  Therefore this wasnt the biggest failure in this game. The real '♥♥♥♥ happens' start when i reach the last mission, when you fight with some kind of alien monster-machines. It was so much annoying just because of bugs. I cant get rid of empty missile launcher, then after i drop it (with some other weapons i dont want to drop) and try to take full (because it is not possible to take just ammo to your current empty launcher - WTF?!!!), the game partially stuck. I was able to move, but wasnt able to switch or shot weapons.... Many loads and saves... It was awful.  I dont know if this was only my problem, but i am so happy, that i finished this and dont wanna play that again.  About 5 hours of great fun and 2 terrible hour, when i almost smash my mouse and keyboard...",
            "review_score": "1"
        },
        {
            "review_text": "I like it all the way up to the point where I couldn't beat it because the end boss is bugged.  I came into this thinking that the suit was going to make me essentially invulnerable and I'd just plow my way through it. And I was, thankfully, wrong. The suit has power, but it's limited. And you have to decide which of the modes is most applicable for the situation. If you just run in with guns blazing, you're dead.  Solid game all around. Challenging, fun, and a pretty good storyline.",
            "review_score": "1"
        },
        {
            "review_text": "At nearly 7 years old it still sets the bar for the FPS genre in gameplay alone, thats not to mention it still wrecks most modern shooters in terms of graphics as well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a legend. When it came out, this was the benchmark of a great computer. I would, without hesitating, recommend it to any and everyone. The cloaking mechanic makes the stealth in the game great.",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics and pretty good FPS gameplay. Worth the $5 I paid for it.",
            "review_score": "1"
        },
        {
            "review_text": "The ending will make you want to punch your computer, but besides that its a great game. Can't wait for the second.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty darn fun and great looking game.",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't run on my PC, it goes to a black screen then crashes everytime I open the game. My PC is able to play games such as Dying Light on high graphics. This is a very good game but they need to fix the crashes",
            "review_score": "-1"
        },
        {
            "review_text": "Wonderful game, a clasic! A must play to everyone who like a shooter game and a history driven gameplay. Just don't be disapointed with the end...",
            "review_score": "1"
        },
        {
            "review_text": "If only the coders had a time machine. Todays machines have a hard time running this game at max settings.",
            "review_score": "1"
        },
        {
            "review_text": "Look its the first ever puplic review 8/8 Mate",
            "review_score": "1"
        },
        {
            "review_text": "A 7 year old game makes my GTX 760 do real work. Holy ♥♥♥♥ this game was ahead of it's time.",
            "review_score": "1"
        },
        {
            "review_text": "Still a good tool to see if your pc is a boss",
            "review_score": "1"
        },
        {
            "review_text": "I spent the better part of two days trying to get this to work. It doesnt run on 64 bit systems. Some people get an error saying it stopped working. I get a black screen for all of two secondss before it crashes. I've tried the patches that are suggested in the forums, I've tried other site's patches, I've system restored to befoe I installed and tried installing again with and without the suggested punkbuster and comrade programs. NOTHING WORKS. Some people mentioned refunding it, but I don't see that option. I'm going to hold on to it and try later, but right now I wouldn't suggest anyone buy it. Which sucks because it looks friggin awesome.",
            "review_score": "-1"
        },
        {
            "review_text": "Derided by many as more of a techdemo than an actual game on release, Crysis actually revolutionised tactical first person shooters by virtue of two very smart (and intertwined) design choices: One, by setting the game on a large, semi open-world island, thus allowing the player to tackle seemingly simple 'go to position X' missions in a variety of ways; and two -- and it is here that the game sets itself apart from Crytek's previous outing Far Cry --, by giving the player access to a variety of superpowers (speed, strength, invisibility, armor), as well as the ability to quickly change between these powers on the fly. In other words, the player is free to advance from checkpoint to checkpoint in his own way, both literally (as in choosing his path) and metaphorically (as in choosing his playstyle). And crucially, while a one-to-one combat situation is bound to be boring in a game that outfits the player with numerous superpowers, the enemies still hit hard and find strength in superior numbers, so as to not make the game a cakewalk.  Yet the plot of Crysis, unimaginative from the start but seemingly an afterthought anyway, eventually comes to influence the mechanics of the game and does so for the worse: Aliens briefly appear early in the game, then vanish again for several hours before becoming the principal antagonists of the second half of the game. Thus, the intricate setpieces of the first half -- the infiltration of a shipyard a definite high point --, usually culminating in intense firefights against Korean soldiers, give way to monotonous battles against lazily designed aliens. Instead of infiltrating a base, the player suddenly finds himself following a very straight and narrow path for 20 minutes, steadily interrupted by groups of three identical enemies and packs of conveniently placed ammo, since the aliens do not drop any.  4/5",
            "review_score": "1"
        },
        {
            "review_text": "This game was the pinnacle of graphical performance back when it came out, with even modern hardware stuggling to run it. But as many other have said, it doesn't seem to work for quite a few people on 64 bit operating systems. I have a pretty decent rig and even on max settings the render distance was quite low, but even that would've been fine if it weren't for the constant crashes. I couldn't even make it past the intro tutorial section without it crashing twice.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome play!",
            "review_score": "1"
        },
        {
            "review_text": "This game just makes me sad. Game realesed 2008 and still better visual effects than 2013-2015 games",
            "review_score": "1"
        },
        {
            "review_text": "the story is poor, gameplay and nanosuit are awsome, and the imponderability part is intreresting and well managed as concept, but annoyng as hell cause of stupid aliens, low light and overall lenght in campaing",
            "review_score": "1"
        },
        {
            "review_text": "Start of an excellent trilogy.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Crysis really set the standard for what a PC game should look like. After being out for almost 2 years it still sets the benchmark for graphics of a game and how decent a rig is. It will probably go down as one of the best games ever. With the ability to tackle a mission differently each playthrough no two games are a like. With amazing graphics, an engaging story and solid FPS gameplay Crysis will always be one of my top 5 games.",
            "review_score": "1"
        },
        {
            "review_text": "Suit Up! 9/10  Aliens are much easy to kill rather than humans.",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry is released, made by the same developers i thought i'd give crysis a run, hearing reviews from people saying its fantastic, 97% rated among others, So i thought i'd run Crysis. Even though the game is a 2008 creation it is visually stunning on my 2012 rig.   The year is 2020, You invade a small island in the South China Sea, after US archeologists uncover a mysterious artifact and The North Korean government quickly seizes the area, imprisoning the archeolgists. You start off as a member of Delta Force sent in on a rescue mission and one by one your team is eliminated by some sort of alien force.   Crysis is a next-generation PC first-person shooter from Crytek, the award-winning developers of 'Far Cry.'   During the siege the true nature of the artifact quickly emerges, pointing to the existence of an alien presence on Earth, and ultimately the trigger for a massive-scale alien invasion.   The battle to save Earth begins...   Despite the realistic near-future setting and familiar arms, Crysis isn't a military simulation. At its heart this is a superhero game, where the main character is armed with the latest in high-tech equipment. Your nanosuit -- the star of the show -- allows you to be invisible, to be super-fast, to be super-strong, or to be virtually bulletproof. Here's the catch: you can only use one power at a time, and they all have limited energy. Choosing which powers to use in every situation is the heart of the gameplay.  For the most part the powers are excellently balanced. Each has its drawbacks and situations where it's appropriate to use (any power, improperly used, will drain your suit's energy and shut off). The only exception is super strength, which isn't terribly useful in most scenarios.   Stealth, on the other hand, is absolutely essential. You are always outnumbered. Fortunately, stealth is brilliantly implemented: While standing still, your suit can stay invisible almost indefinitely. But the moment you start moving, your energy drops... fast. The gameplay that results is absolutely pulse-pounding. You'll dart from cover to cover, stealing moments wherever possible to recharge your suit. While standing still, enemies will walk right past you, unaware you're pointing a shotgun at their head.  Apart from the occasional crashes and then almost at the end of the game it failing to run at all even in compatibility mode then i would still recommend the game.",
            "review_score": "1"
        },
        {
            "review_text": "I'm playing this game on a surface pro with a Logitech controller. Needless to same, my gaming rig is substantially sub par for this type of game. However, this game is spectacularly beautiful and awesomely fun. The learning curve is a bit high on the controller but my goodness this game can be both challenging and make you feel like an extremely powerful soldier at the same time. The power ups make the whole game noticeably unique as an fps and its a blast. I really enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;quantum computer is invented &gt;million times more powerful than any binary computer &gt;plays crysis on medium",
            "review_score": "1"
        },
        {
            "review_text": "This game somehow still looks better than some 2015 games",
            "review_score": "1"
        },
        {
            "review_text": "best game i'v playing in my hole ♥♥♥♥♥♥ life 10/10",
            "review_score": "1"
        },
        {
            "review_text": "At the beginning the game feels like every other shooter. But as the time goes on, it gets better.  Original and interesting story with fantastic visuals even for 2016.   Just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, hours and hours of fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "If COD and Halo got a baby than this would be the result.The augmented suit fits perfectly the game style,you can either rush in or go fot the sneaky plays with the cloak or go full burst with the power mode.Overall i rate this game 8/10 not enough illuminati for my taste.",
            "review_score": "1"
        },
        {
            "review_text": "Actually i start play crysis 2 first because i got it during the discount. I saw crysis first when i got core 2 i remember my PC cannot even handle this game. But now with i5 + gtx960 it fine.  The game itself is fun and the story is look interesting for me. I'm really enjoy the setting but sometime you will found that AI teammate is a bit useless but the game most of the time require you to do many thing SOLO so i'm not worry about the AI. I guess it the OPEN world FPS just like far cry you can do what ever you want to make mission success. You can also explore the Island which I'm really enjoy the beaty of it.  I'm recommend this game it really good but it sad that EA cut it in 2 piece for easy money grab. I remember the HDD require for this game at first it total big lik crysis + crysis warhead. Then they cut it. But it still fun don't worry i wish there was crysis 4 i really love the Single player.  Sorry i have no idea about multiplay since gamespy shutdown and I'm prefer singleplayer more anyway :)",
            "review_score": "1"
        },
        {
            "review_text": "its a legend game from 2007",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun until half way through. It's all fun and games until the martians show up, trust me that's all you need to know. It's like Far Cry but you have useful power armor instead of an awful Hawian shirt and it doesn't have the dreadful Trijen or whatever they were called. Oh and I still can't run it maxed out at a stable framerate. -Windows 7 (64-Bit)  -GTX 980 SC ACX 2.0  -i7 4790k Devils Canyon  -16 Gigs Dual Channel  -232 Gig SSD dedicated to games",
            "review_score": "1"
        },
        {
            "review_text": "Still looks better than most modern games",
            "review_score": "1"
        },
        {
            "review_text": "easily one of the best single player fps experiences i ever played , along whit the best visuals to this day  an absolute masterpiece´",
            "review_score": "1"
        },
        {
            "review_text": "I gave this game 'TEST OF TIME' Award during Steam Autumn sale 2016. I can't be more right!",
            "review_score": "1"
        },
        {
            "review_text": "The plot is boring and the gameplay is generic, but somthing about this game keeps me comming back to it. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the best first-person shooters I have ever played. The gameplay caters to your style, whether you want to take a stealthy approach or go all out. Most of the guns are satisfying, the suit powers add some good depth to the gameplay, the story is believable (although a bit generic, but that's beside the point), and last but not least, the graphics are ♥♥♥♥ing incredible. This game is worth every penny, and if you haven't played it yet I suggest you give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Pushing PCs to their limits since 2007. Oh, it's a great game, too.",
            "review_score": "1"
        },
        {
            "review_text": "I dont like this game it gets boring very quickly, I only use it for benchmarks, if you do intend to buy this game to play, you will need to be a MLG master of stealth or you will remain under fire. Because of this this game gets 1.5 out of 5.",
            "review_score": "1"
        },
        {
            "review_text": "In this game we will play as a Military Ninja or Predator. The game's environment was very well designed, from lush island to alien landscape and then aboard an aircraft carrier. Some level could be a bit tough but not impossible, despite the AI cheats. At some point, the game keep on crashing and I had to run the DirectX 9 mode until the end. It's not perfect considering it's the first of the series. The length of the single player mode surely worth the price, so get it when there's a sale.",
            "review_score": "1"
        },
        {
            "review_text": "I expected a fun game, but I didn't realize it was the best shooter this side of Half-Life.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are still better than most crap today, plus you get to terrorize North Koreans. What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "This is the game you have always wanted.",
            "review_score": "1"
        },
        {
            "review_text": "Very solid game play, good story, variety of environments, and of course the graphics.",
            "review_score": "1"
        },
        {
            "review_text": "NOW! As far as my complete gaming library at this point which is about 120 games on steam, this is still the best game I have ever played in single player campains!!!  If you want a great game to have which you will enjoy many many many times of repeat game play grab this game 100%!!!! I don't know one person that has played it that would disagree, plus it still is one of thee best graphical games made GO CRYSIS!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is better than Crysis 2 and Crysis 3, the story is very engaging, the graphics are good and contribute to the atmosphere, the scenario is completely interactive. The AI is a bit ♥♥♥♥♥♥♥♥, but will still force you to use your suit's special powers in order to beat it.",
            "review_score": "1"
        },
        {
            "review_text": "Still looks great even compared to todays new releases.",
            "review_score": "1"
        },
        {
            "review_text": "This one right here goes out to all the Baby Mamas Mamas, Mamas? Mamas? Babys Mama Mamas?",
            "review_score": "1"
        },
        {
            "review_text": "A neat true PC game!",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to fight the Koreans AND aliens whilst in control of a nanosuit? Well now you can. Buy Crysis. It's frickin' awesome. Go invisible, raise your strength, armour and speed, then go and kill anything that moves in whatever style you like to. Whilst you dish-out chaos and death there's also a great plotline unravelling before you; whats NOT to love?",
            "review_score": "1"
        },
        {
            "review_text": "I've only played in history mode, but the game is superb. The whole thing about the suit, the environment, the soundtrack, the physics... amazing is the only word I can come with to describe it. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Crysis. Oh my God where to begin? I suppose a quick summary of the story.  STORY: You are a U.S Super soldier in the year 2025 (just suspend your disbelief, please). Some of your sceintists have found something very important on a remote island in North Korean territory. They were captured and you have been airdropped in to locate and extract them. Que a breif Korean section, leading on to an all too long daft Halo 4 style semi-robtic cyberpunk alien section.  The Korean bits are good, but can get a bit repetetive, and the openess of the battlefield makes you fell less of a supersoldier and more of a big american target. Alien bits are also good, but not as good as the Koreans. I give it 7.5/10  SETTING: Its only when you have seen the island from above, and then step foot on it, that you realise just how bloody big the thing is, and you can explore all of it, by car, by boat or by helicopter. You can Immediately sense the far Cry 3 in this game, and I think that it is owing to the sucess of the Crysis island that Far Cry 3 was put on an island alsmost identical to tis one. There are Korean outposts, and although you will acheive virtually nothing by 'conqering' them, the combat makes it worthwhile. for a beautiful island with no restrictions and plenty of enemies to kill, but frustrating vertical sections, I give it 9/10  COMBAT: You have 4 armour modes. Maximum Strength, Speed, Armour and a Cloaking feature.  Maximum strength allows for greater vertical mobility, i.e power jumps upward and forward. You can also throw objects like enemies and grenades further, meaning lethal throws on enemies, and exploding barrells exploding on impact. Maximum Speed can seem useless at times but works well in multiplayer, although it should have been combined with strength in my opinion. Maximum Armour is what you are going to be using 60% of the time. It is by far the most useful and allows you to have an invisible sheild on your armour (Hello, Halo!) that recharges. Cloak is there for stealth, but annoyingly once depleted means you return to armour and dont recharge cloak, so you have to wait for maximum energy to engage cloak again.  FUN FACTOR: Extreme destructability and badass mission sections with optional and rearding free roaming means that the game scores a very high fun factor. 8/10  over score, 32.5/40 BUY NOW!!!",
            "review_score": "1"
        },
        {
            "review_text": "i bought the game but it still not work",
            "review_score": "-1"
        },
        {
            "review_text": "The best game I have ever played, would recommend this to anyone. Just beware its quite a demanding game. But seriously buy it and play it no questions asked! XD",
            "review_score": "1"
        },
        {
            "review_text": "Love it!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Once you get the game running at a steady framerate it is actually pretty great.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome graphics and great gameplay. I really recommend this game to everyone who likes, even a little, FPS- and story driven games.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic sandbox shooter that allows you to tackle your objectives in any way you choose to play the game (slow and calculating, stealthy, guns blazing, etc.). The cloak will fulfill any latent Predator fantasies you might have.",
            "review_score": "1"
        },
        {
            "review_text": "The graphics and engine capabilities of the CryEngine 1 definetly hold up through today. The lip syncing with voice is flawless, the game feels fast paced even during stealthy missions, but i beat it in 7 hours...",
            "review_score": "1"
        },
        {
            "review_text": "I am sure you have heard of this game by now. lol. This game was a lot of fun, Slow to start, but man does it pick up.. It is a gorgeous game! It neesd a very beefy rig to run it high settings with high framerates.. The Story is wonderful the atmosphere is fantastic.. (yes I played through Vanilla with no Mods, I am sure there are some mods for this game that make it even better) The weapons although not a whole lot of different ones, are fun to use. This game lets you approach the situations in the game, in multiple ways.. Its a great game. I would recommend it to anyone looking to play a beautiful FPS, looking to have a lot of fun with singleplayer.. If I had to give this game a 1-10 score, I would give it an 8.5-8.8..  However I do recommend you try to find it on sale, (I got the maximum Crysis and Warhead for $9 total) and BEWARE STEAM does not have the x64 Crysis Bin folder, so no 64 Crysis with Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Crytek must practice witchcraft in their spare time, because creating visuals of this calibre, and in as early as 2007, is a simply ludicrous feat. And to top it all off, the game itself isn't half bad either.  The story for Crysis begins on a small Pacific Island. Set in the year 2020, players take the role of Nomad, who is sent in to rescue a group of archeologists and investigate some strange signals being transmitted from the island. Upon arriving you soon discover that an alien invasion is upon the planet, and you quickly become embroiled in fighting for not only your survival but fighting to stop the invasion.   Crysis backs up it's great story line with excellent and intuitive game play. You are equiped with a powerful suit, an exoskeleton called the Nanosuit. This nanosuit grants you enhanced strength, super speed and the ability to cloak. The suit is the defining aspect of the game play, with the suit's feature's enabling a far deeper level of choice and greater number of options in every situation you encounter. Crysis seams to transcend genres, with stealth, rush and precision tactics all viable if needed. The weapons in Crysis are all brilliant, modernised but not so much so that they feel tacky, and expertly equipped with brilliant sound effects. They can be loaded up with all sorts of attachments, laser sights, an assualt scope, sniper scope, grenade launcher and many more, all available to switch out freely on the fly. The visuals and environments in Crysis are simply fabulous, but the open nature and freedom of these large environments is what makes Crysis such a joy to play. If you have a powerful enough CPU and Graphics Card then you're in store for some truly mind blowing graphics. Foliage casts shafts of light to the ground, water ripples in real time around you and other objects. Crytek didn't leave a stone unturned in detailing both the environments and character models. The texturing and lighting effects are amazing, especially when cranked up to highest settings, some aspects yet to be topped by even it's sequels.  About the only flaw I could detect from Crysis is that the game eventually ends, an issue that in reality is unavoidable. For this reason, I cannot legitimately mark down Crysis, but what I can deduct is the game's length instead. Crysis lasted for around 10 hours on my first play through, and while this could be considered adequate by some, a 16 or more hour campaign would have been much preferred, as some story elements do feel unexplained or untouched upon with the time they were given.  The multiplayer portion adds some decent game play options, but it's really the single player portion of the game that absorbs you in, and the excellent graphics and game play are supported by the extremely competent plot enough so as to mask some of it's more minor flaws. This game is a pure tribute to graphical fidelity and innovative game play, and if there's one game you should play in the Crysis series, it's this one.  + Phenomenal graphical fidelity  + Innovative and polished game play mechanics + Gripping, want-more plot  - Highly demanding hardware requirements  9.5/10 ~ Phenomenal   EpicSouls (Sam)  Cᴬᵁᵀᴵᴼᴺ﹕ ˢᵗᵉᵃᵐ'ˢ ᵛᵉʳˢᶦᵒᶰ ᵒᶠ ᶜʳʸˢᶦˢ ᶦˢ ᶜᵘʳʳᵉᶰᵗᶫʸ ᵒᶰᶫʸ ᵃᵛᵃᶦᶫᵃᵇᶫᵉ ᵃˢ ᵃ ³²⁻ᵇᶦᵗ ˢʸˢᵗᵉᵐ ᵖᵃᶜᵏᵃᵍᵉ⋅ ᶠᵒʳ ᵗʰᶦˢ ʳᵉᵃˢᵒᶰ, ᵖᵘʳᶜʰᵃˢᵉ ᶠʳᵒᵐ ˢᵗᵉᵃᵐ ᵃᵗ ʸᵒᵘʳ ᵒʷᶰ ʳᶦˢᵏ⋅ ᴵᶰˢᵗᵉᵃᵈ, ᴵ ʷᵒᵘᶫᵈ ʳᵉᶜᵒᵐᵐᵉᶰᵈ ᵖᵘʳᶜʰᵃˢᶦᶰᵍ ᵛᶦᵃ ʳᵉᵗᵃᶦᶫ, ᵒʳ ᶠʳᵒᵐ ᴼʳᶦᵍᶦᶰ, ᵃˢ ᵃ ⁶⁴⁻ᵇᶦᵗ ᵛᵉʳˢᶦᵒᶰ ᶦˢ ᵃᵛᵃᶦᶫᵃᵇᶫᵉ ᶠʳᵒᵐ ᵗʰᵒˢᵉ ᵃˢ ᵒᶠ ᶰᵒʷ⋅",
            "review_score": "1"
        },
        {
            "review_text": "All of the hype over this game is correct and well worth it. It looks DAMN FINE, plays like a cross between Ghost Recon and Call Of Duty and has all the extra little cool things to keep you entertained (like clearing out a whole camp with nothing but A watermelon, a Chicken and your fists.) If you have played this game you'll know what I mean, and if you haven't GET THIS GAME NOW. Oh, also, you might want to make sure it wont implode your PC before you buy it. Imploding PC= Bad.",
            "review_score": "1"
        },
        {
            "review_text": "Now that the power needed to run this game is more common... Crysis is a must play for anyone who missed it previously. Be sure to keep the physics setting on high, thats the way its meant to be played.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome 1st person shooter!!! Graphics are amazing and i still cant believe this game is over 5 years old!!!",
            "review_score": "1"
        },
        {
            "review_text": "Quite a good game, Obviously wont be updated this long after release so expect some glitches. Occasionally crashes to desktop on either 32 bit or 64 bit mode (64 bit support is not included, but a search on the forums will show you how to enable it) Forcing DX9 seems to lessen the issue (again search the forum). Completed in about 5 hours overall. If its in a sale then get it",
            "review_score": "1"
        },
        {
            "review_text": "Awesome graphics, great story, Action-Adventure, FPS game. Should try it!",
            "review_score": "1"
        },
        {
            "review_text": "5 years after it's release, i finally got around to playing Crysis. The graphics are still stunning and i doubt anything beats it still. I ran it @ very high in DX10 and achieved 35-50fps. I had to tone it down for the final boss as those frames were chugging along. Story is meh, but gunplay/graphics were great.",
            "review_score": "1"
        },
        {
            "review_text": "Buy when it's: $4.99.  Ah, the original Crysis, everybody probably played it by now.   VISUALS  Looks superbly great, and the engine holds up even in 2014. Throw in some texture pack mods, add SweetFX, and this is still one of the best-looking games out there.  CUSTOMIZABILITY  Ran out of sniper ammo? No problem, put a sniper scope onto your SCAR and set it to semi-auto fire mode. Even better: put on a suppressor, and use Power mode to hold your gun steady. That's one of many examples of how you can make any weapon fit your play style.   VARIETY  The campaign gives you a taste of everything (thankfully, no mandatory stealth level). The levels range from the beach to jungles to outposts. You do most of the work on foot, but there's also a tank level (you can opt to travel on foot anyway). Crysis pretty much gives you a semi-sandbox to have your way with. Kill everyone or run like a chicken, it's all up to you.  Rating: 9/10  ",
            "review_score": "1"
        },
        {
            "review_text": "This game rocked and rocked my PC even after being released 5 years ago! I enjoyed the action, the story, and the eye candy all the way through to the very last then things had to be changed. In the last part of the game, Reckoning, I ran into performance issue with the game. Don't know if it was a bug in the game code but I had to finish it up running DX9 mode instead of DX10. So I was able to complete the single player story and it sure ended with a big Badda BOOM!! So now it it on to the next game in this series, Crysis Warhead, and see what Psycho was doing while Nomad was dealing with those ice shard shooting aliens.",
            "review_score": "1"
        },
        {
            "review_text": "One of the very best FPS games ever made! Not just for its Amazing graphics, but also for the gameplay and story that are top notch. After certain parts of the game you really feel like, wow this game has changed alot since i first started it a couple hours ago, and it continues to do that. Awesome experience from start to finish",
            "review_score": "1"
        },
        {
            "review_text": "Crysis and Crysis Warhead. What a shame what these games have become. First of all stupid DRM when you have steam anty pirate protection. Then if you have 64bit OS the game won't start unless you replace bin32 folders. And seems like Steam overlay doesn't work with it no more, means no more screenshots or talking to your friends during the game. The multiplayer is gone thanks to stupid game spy arcade.  The game is ruined. I kinda regret buying even on -75% sale. These games gave me so much pain already. It's much easier just to pirate them than to buy them.",
            "review_score": "1"
        },
        {
            "review_text": "Not enough praise, combat is great!",
            "review_score": "1"
        },
        {
            "review_text": "Played this through for the first time last January, when I'd finally built a PC that was able ... to run Crysis! Story/Plot is bonkers, but the ability to roam (relatively) freely about the islands and explore different tactics for taking down the bad guys cannot be beaten.",
            "review_score": "1"
        },
        {
            "review_text": "CRYSIS 1 &amp; 2   +Graphics (Lighting, Detail, Effects) +Destructible Environments +Can pick up everything +Tight Shooting (ADS) +Stealth or Assault, Choose Gameplay  -Multiplayer  These games are both great and while most people would argue that the jungles and beaches of Crysis are better looking than the semi-future New York, Crysis 2 (after DX11/HD texture patch) is technically a better looking game. Various mods can change this, but from an official release standpoint, its true. For both games, I recommend turning the HUD off (hud_hide 1 for Crysis 2) as it makes for a prettier and more immersive experience. I was personally overwhelmed by the over done HUD in Crysis 2.   Multiplayer is all over the place with these games and only Crysis Wars gets this right, which is a different game. Its unfortunate that Crysis 2 decided to emulate Call of Duty rather than Battlefield or even make its own unique multiplayer identity like Halo Reach's Invasion or Killzone 3's Operation modes.",
            "review_score": "1"
        },
        {
            "review_text": "You a power suit and a level. Complete the level howere you please. Stealthy? Strong? Speedy? Defensive? You choose in one of my favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "This is Crusis, best shootah evah. Mah father says ♥♥♥♥ yeah, they've done a good game. 10/10 And i am serious.",
            "review_score": "1"
        },
        {
            "review_text": "Story meh. Graphics cool. Power Suit cooler. And it's got (spoiler)    aliens    so its good.",
            "review_score": "1"
        },
        {
            "review_text": "just bought Crysis, hasn't dated abit, earliers levels are so replayable, remind me of Deus Ex.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game feels being a child in a candy but without any money. This game has to be run in directX 9 to even get fullscreen fuctionality. It crashes every ten minutes and requires hacking and messing around to work. The version on the ♥♥♥♥♥♥♥♥♥ works much better.",
            "review_score": "-1"
        },
        {
            "review_text": "game is a pain in the a** to even dl i have win7 home premium 64bit and i bought the bundle and cant even play the first game... maybe to the game no to steam dl, heard origin dont have this prob",
            "review_score": "1"
        },
        {
            "review_text": "i can't even begin the game start up it's a waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "Many people look at this game and remembers it for one thing only: graphics.  Yes, the game has pretty damn nice graphics for it's age.  Yes, it still looks good today in the year 2014.  But the game has so much more to offer. It offers excellent level design, fantastic weapons and great physics! There is nothing more fun than carefully planning and executing a base takeover. You can play this game as John Rambo himself, or in the shadows, like Solid Snake himself. You can choose, since there is no right or wrong way to do things. Every single playthrough is different, and that is what I love about this game.  It is such a shame they had to ruin the franchise after this game. Warhead was linearized heavily, and the subsequent Crysis 2 &amp; 3 suffered from a severe case of consolitis. Avoid those games and pick this one up instead.  Rygels textures and BlackFire's Mod Ultimate is recommended for the best possible vanilla Crysis experience in 2014.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing FPS, bettre than the sequal, still holds up amazingly well with today's games",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic graphics and fun abilities. AI is way too good. Enemies always know where you are. The setting is in a jungle and the foilage provides no camo what so ever. Human NPCs take way too much damage to be regular soldiers.",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, Crysis is one of the best games of all time. The graphics, gameplay, story and music all contribute to make it amazing. A must play.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah I like it, its fun!",
            "review_score": "1"
        },
        {
            "review_text": "Buggy as all hell, legendarily hard to run.  If you can get past the two problems above, you'll have a blast!",
            "review_score": "1"
        },
        {
            "review_text": "Slick game play and graphics with a huge world to play in. Great fun.",
            "review_score": "1"
        },
        {
            "review_text": "GUYS READ THE WARNINGS I DIDINT AND I PAYED  THE PRICE SO DONT JUST LOOK GRAPHICS ANY SAY I WANT THIS GAME",
            "review_score": "-1"
        },
        {
            "review_text": "First you punch turtles....then you punch Koreans(Not actual Koreans, racially stereotyped ones with Engrish problems)....then you punch aliens....then the game abruptly ends with you in purgatory to be punished for your sins like punching turtles.",
            "review_score": "1"
        },
        {
            "review_text": "The SP campaign is just awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Unique gameplay in a beautiful jungle environment, this game has everything going for it. Not the most powerful story, but it is certainly not weak.",
            "review_score": "1"
        },
        {
            "review_text": "This game suffers from more crap than any game I have purchased on steam.   Won't launch on x64 systems without manually downloading the x64 executable. Insta-crashes without manually disabling the steam overlay in the launch options Will not run 1080p without lots of cfg hacking. Multiplayer is kaput - dead and gone.   Waste of cash, even for the single player mission.",
            "review_score": "-1"
        },
        {
            "review_text": "Picked this game up recently during the summer sale, as I'd played the other two Crysises (is that the plural?) and I have to recommend. The story's well thought out and is rather easy to follow, provided you watch at least a few of the cutscenes, and the gameplay is intuitive and rather different for an FPS, with a refreshing distance from the linearity most shooters express. It is, however, (and this is as eloquent as I can word it) ♥♥♥♥♥♥♥♥ly ♥♥♥♥ing difficult at times. My more-than-adequate PC would lag out when I died during one boss fight, because there could very feasibly be 10 or so things shooting at me. Remember, F5 is the quick save button. The games also rather buggy, and the controller support is both ♥♥♥♥♥♥♥♥ and has a tendency to ♥♥♥♥ up the menu. Fortunately, fixes for issues are easy to find on the net. Probably give this game something like a 7/10  TL;DR Threw a frog off a mountain, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Cons: -Broken on 64 bit machines -Very high and low both run at the same fps -Vehicles control like a greased cow on a unicycle -I cannot hit anything smaller than the side of a barn because the ironsights won't stay still -Autosave is controlled by a narcoleptic sloth with a grudge -Didn't start at all when I bought it -Decided that even though I have greater than the reccomended that it just wouln't use more than 30% CPU even if I set the process to realtime -The AI are wizards on normal and easy difficulties -Mouse sensitivity is ♥♥♥♥♥♥♥♥ly high even on the lowest possible setting, making it really hard to aim  Pros: -Pretty -Didn't literally give me cancer -If you're not sure if your computer is stolen from nasa, this is a good way to check -Lots of customization options -It was on sale  There are dedicated benchmarking programs out there if you want to test your rig, unless you own a PC that costs more than the average new car and want to mod it to take photorealistic screenshots don't buy this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "one of the best shooters ever",
            "review_score": "1"
        },
        {
            "review_text": "The best of the series even if the first. It didn't hold your hand and let you have a fairly wide path to an objective.",
            "review_score": "1"
        },
        {
            "review_text": "I can pick up a chicken and use Maximum Strength to launch it into orbit  11/10 would make Chicken Aeronautics and Space Administration",
            "review_score": "1"
        },
        {
            "review_text": "I run this in a Win 7 64 bit system - so far, no crashes - perhaps what all the other negative reviews say abut the crash issue has been fixed. Or maybe I'm just lucky. I don't know.  But it is pretty lackluster. It's a shooter, but 14 hours in, and I'm not that impressed, nor do I have any desire to continue the game. The graphics are very good, but the game isn't all that thrilling.  If shooters are your thing, it's alright.",
            "review_score": "-1"
        },
        {
            "review_text": "This game does quite a few things right. Mainly, I enjoy the endless fun of feeling superpowered and being able to switch between multiple abilities on the fly to deliver the most tactical and/or efficient beatdown. I think what I enjoy most, however, is the way it handles secondary objectives. In most other games, secondary objectives are either too hidden, or made too explicit. The former gives me an endless gut feeling that I've missed out on something the game has to offer. The latter makes them feel less 'secondary'. Crysis just throws a green and a yellow blip on the map, letting you know 'Hey this exists' without ever making you feel like missing it is really going to screw you over. Lump that philosophy in with the games quasi-sandbox nature, and we have a winner. Granted, the side objectives could afford to have a bit more incentive, but the framework is there, and it's nice. Overall, the game is slightly above average. It remains relevant as a milestone in graphics, but its shooting mechanics are middling. Despite that, it's still fairly easy to have fun, and that's kind of the point.",
            "review_score": "1"
        },
        {
            "review_text": "I remember the times of old when Crysis was used to benchmark everything. It's a game I fondly remember for it's brillant and fun gameplay with gorgeous visuals that put modern games to shame but it's far from perfect.  Graphically, it was easily the most taxing game when it came out. 'Can it run Crysis on max?' was a common way to judge a computer's performance, and rightly so, it's a intense game to run. Although released in 2007, it still looks gorgeous. The Lingshan Islands feel like very realistic in it's scope and detail. Texture quality rivals, if not outright better than, modern textures, and lighting effects are done to perfect. All in all, it's visually stunning. Worthy to note is the interactivity of objects in the game. The ability to shoot at enemies in cover and destroy their cover completely is realistic and not to mention being able to break most objects in game. Houses, fences, trees and cars are all destructable and this should be abused to the best of your abilities.  Gameplay wise, it's a sandbox, first person shooter, and arguably the best of it's genre. Guns feel like they have a real kick to them and the shotgun especially feels immensely satifisying to use compared to modern first person shooters. The nanosuit has 4 but all very distinct and useful 'modes'. All 4 modes use energy, an automatically recharging resource, to power their actions. Power mode allows for steadier aim, stronger melee attacks and higher jumps[/spoiler]. Armor modes allows damage to be absorbed via energy. Speed mode allows for faster movement in every situation including walking, crouched walking, running and even moving up ladders (not to mention a ridiculously fast sprint). Finally Cloak mode allows for limited invisibility. However, being tied to a limit and ever draining resource, there is an art to using the functions of the nanosuit. It's immensely satisfying to cloak into cover behind an enemy, switch to power mode, headshot, and then use speed mode to quickly sprint away into new cover. There's also a bit of depth into the mechanincs of the nanosuit, and the game doesn't hold your hand into it. It never tells you to use power mode when you're trying to snipe at long distances, or to use speed mode sprinting while swimming or   in zero-g environments   to move rapidly. Guns feature on-the-fly customisation, and you can tailor each gun to each specific circumstance, such as adding a silencer with a sniper scope on your assault rifle to act as a long range sniper, or switch it up with a reflex scope and grenade launcher for drawn out firefights. There are a few vehicles to use including tanks, military jeeps and even VTOLs but they're nothing really special apart from using jeeps in creative ways to kill KPA soldiers in the first half of the game.  Storywise, it's very barebones. You're sent to investigate an island who have american researchers taken hostage by the North Korean military (KPA or Korean People's Army). It then is revealed   that an alien race is lying dormant with the KPA trying to use them as an limitless energy source. This backfires and instead wakes the aliens and the US military arrives to try and stop them before they contact their homeworld for reinforcements.     The few main characters are lively and full of character, especially your squadmates of Raptor Team. Their voice actors do a terrific job putting so much personality into them, including the voice actors for quite a lot of the characters you'll meet. Although there is an exception. Helena Rosenthal was done by Claudia Black, responsible for Chloe in the Uncharted Series and Morrigan in the DA series. She does an okay job in those, but she is absolutely awful in Crysis. Whenever Helena's voice comes on it's like a nails on a chalk board. Absolutely jarring and breaks your immersion. You really have to think how the production team okayed this, when the other characters like Psycho or Prophet are done so well.  However the game is ultimately flawed in many aspects that take away from the experience. The first half of the game is a brillant open world FPS that allows for creative ways to approach every objective. Abusing Cloak feels cheap, but mastery is difficult to achieve resulting in a rather balanced experience. You can still end up in a terrible position with no energy to absorb hits if you don't position properly which means instant death at the higher difficulties. Enemies can also spot you while cloaked if you move in close proximity to them and even while remaining still if they're in touching range. Personally, I play this like a Predator simulator, and it's immensely satifisying to cloak in and out, while headshotting soldiers undetected and causing an alert to go off while you continute to flank and pick soliders off one by one. Unfortunately once you reach the second half of the game, it becomes a completely different game. After you reach   the mines and the alien temple within  , it becomes a linear FPS with bullet sponge enemies (The aliens you'll fight, the KPA nanosuit soliders aren't so bad). While this isn't bad on it's own, you have to play a completely different style. You can't stealth kill (as in cloaking and headshotting) and so you are forced to shoot behind cover, ducking to recover your armor. I wouldn't mind this in it's own game, but to lose that sense of freedom and ability to play as you see fit from the first half, is a real shame. The game also suffers from numerous bugs, including odd physics interactions like a fallen tree shaking and walking into it causing instant death, falling into the floor of the   USS Constitution and getting stuck   and the infamous bug where you crash upon trying to load a game (which you can fix by deleting the most recent save in your savegame folder).  All in all, it's an immensely fun game to play with multiple ways to play it as you see fit. The visuals are gorgeous and constant screenshot worthy moments. Although there are a few bugs (some almost game breaking), the overall experience is worth to chug through them. I would advise to replay the first half after finishing the game though, you'll see just how much more fun it was if you didn't notice it already.",
            "review_score": "1"
        },
        {
            "review_text": "This is a _fun_ game. Highly recommended. I played Crysis 2 first, unfortunately, and would have been much better off playing Crysis 1 twice. Lots of variety, relatively open map, neat graphics. A fair number of glitches, freezes, and crashes, but I didn't mind because the save system is great. Maybe just below Borderlands 2 on my favorite FPS games thus far.",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay, beautiful environment, cool story and you wear a nanosuit. What could be more awesome?! This game is totaly worth the money. You get a great shooter action game, where you can go stealth mode, power mode, fast mode or even do your nanosuit more resisteble against damage. The weapons are cool, and it is and open world kinda game, where you can troll as much as you want. If you want to eleminate the enemy or sneak pass them or steal a car or run by foot to ride around the beautiful island is totaly up to you. But be carefull.. You are not invulnerable.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis is a game which looks absolutely stunning. Gameplay is preety epic due to the nano-suit and the worlds are open and large, making it at some times feel a bit like an open-world snadbox shooter like Far Cry. However, despite the many good things about the game there are a few things that are quite annoying: firstly, at any difficulty level higher than normal you need to empty a full mag in an enemy to actually kill him and secondly, the perks of the nano-suit are extremely limited by a short battery life of the nano-suit. All in all it's an epic game with such brilliant surroundings. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, epic game!!!! The weapons are sick, the levels are sick....I loved have the ability to play the game to my style choice. You can go through guns blazing or stealthy and it becomes the game you want it to be. The graphics are AMAZING (especially for a game from 2007). I play other games as new as 2012, and no others have given my computer even half as hard a time as this game. The physics and level of detail in texture and lighting....just awesome.  I look forward to getting a better computer so I can see how the game was meant to be played.  ",
            "review_score": "1"
        },
        {
            "review_text": "Overall Crysis offers the player a good experience. However, if the player is looking for a smooth transition from beginning to end, they will fall a bit short. Game difficulty moves far too quickly from cakewalk to hell on Earth and back again too quick and far too often. Progressive difficulty is expected with any game. It naturally makes the game imersive so the player doesn't get bored. Finding levels later in game which seem nearly impossible only to move on to levels that are about as difficult as a tutorial is a bit much. Some levels you don't even have a damn clue what you're doing. For instance *spoiler alert!*...you end up in a different world a long time ago in a far away land. For some reason suddenly the gravity turns off. Ok...so I have thrusters. Didn't know that. Why the hell don't they help me jump higher along with the strength ability? Anyways...you'll find yourself inside this thing...we have no clue what it is. Some sort of factory? No clue. Enemies will be flying around you and giant bolts of electricity will be doing the funky chicken along the walls. So you try to figure out what you need to do. More and more bolts of electricity are forming and you start to wonder if the last 5 min you've spent in the area is all for nothing because you can't figure out what you're supposed to do. No...thats not it at all. Its a countdown to a portal that is going to whisk you away. So it turns out its a waiting game. Anyways, *end of spoiler!*  PROS: -You get an awesome suit with different abilities which are not only fun to play with they are a must to complete missions. -The learning curve is surprisingly fast. -Good graphics. Honestly though even for its time...I don't see what all the fuss was about. -It is one of the better single player FPS experiences out there.  CONS: -3 main guns until right near the end. At which point you're so happy to pull the trigger of a new gun you nearly have an 0rg@smic moment which can only be bested by finding the 3rd warp whistle in Mario 3 when you're 12. -On the later guns...(oh yes I'm not done!)...what is described as basically a nuke in a shotgun's body needs a Ph D and 20 yrs experience from Nasa JPL just to figure out how to work the damn thing and figuring out what to aim it at to make it work. -*spolier alert* Aliens...not just regular aliens like E.T., Jarjar Binks, Predator, or Padme' Ama f'in dala (yes she was an alien...technically...a rather hot one at that,) these aliens are deadly flying around in Zero G. They are deadly (mostly 1 hit kills) on the ground. They blow up when dead. They pilot some serious hardware. Why the hell do they need all this? They can kill Billy King Badass in his super Badass suit with bare hands. -3 weapons. -Being invisible doesn't last as long as it should. In many ways it is nearly pointless. More invisible time=more fun. -Multiplayer is dead. -3 ♥♥♥1ng guns. RAWR! -Hot research lady scenes do not contain a lap dance. =)",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. The low gravity fight was awesome. One of the most challenging FPS old school shooters ever.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. At least, it would be if it didn't have the most moronic dev team in the world. I played the final boss fight about fifteen different times without winning, only to find out that to win, I had to reload my save from hours before, search the entire battleship, and get a stupid gun that I can only use on the final boss, and was briefly mentioned once. Then, after re-playing all of the final sequence, I tried to make a save file so I could die and not lose too much progress. Then as soon as I clicked the save button, the game crashed and all that I had done to deal with the ♥♥♥♥♥♥ game design had been lost. All in all, a good game that I hate now because the final boss battle is stupid and whoever designed the final boss battle should be fired from their job.",
            "review_score": "1"
        },
        {
            "review_text": "Keeps crashing and crashing and crashing and crashing..",
            "review_score": "-1"
        },
        {
            "review_text": "This has a decent story for an FPS game and some interesting tactics are available thanks to the Nanosuit. Able to execute stealth or brute force tactics. Only in a few situations does the game try and force you to do one or the other. The AI is a bit poor at times and sometimes can see you when you come out of stealth under cover. Overall, worth a play through.",
            "review_score": "1"
        },
        {
            "review_text": "for 2007 game this game have very good graphic tho . the game story is lettel boring but totally the game is good to try . now i an going to play Crysis Warhead .  graphic 10/10 sound 9/10 AI 8/10 realistic 9/10 ------------------------- total 9/10",
            "review_score": "1"
        },
        {
            "review_text": "7 Years or so later and the game is still a joy to look at and play. The midgame can get a bit slow but when the enviroment changes things are brand new again. This is the best modern FPS I have played.",
            "review_score": "1"
        },
        {
            "review_text": "Im playing on normal..... AND ITS SO HARD THAT RUNNING IN TO AN ENEMY IS AS DANGEROUSE AS GOING TO THE BLACK FRIDAY SALE! DAMN! Cant wait to play on hard or delta! &gt;:D",
            "review_score": "1"
        },
        {
            "review_text": "It won't even run, and i upgraded my computer just to play a different game, and i just give up on this",
            "review_score": "-1"
        },
        {
            "review_text": "Solid game play.",
            "review_score": "1"
        },
        {
            "review_text": "It's the originial Crysis, everyone should play it.",
            "review_score": "1"
        },
        {
            "review_text": "I've been itching to be the badass in the suit for some time, and as our protagonist is an uber-macho ultra-masculine Iron Man, it can be quite entertaining to tromp around in his NanoBoots. However I was disappointed by some of the glaring technical issues which have been left unattended by CryTek since its arrival on Steam.  You wear the NanoSuit in the first iteration of the photorealistic experience, becoming the ultimate soldier. Prepare to Maximum your way through enemy forces, alien strongholds and countless gorgeously rendered trees and foliage.  Crysis was for nearly a decade the gold standard for performance: 'Sure the server's fast, but will it run Crysis?' Modern systems can still be tasked by the demanding CryEngine in its earliest release. Unfortunately it has not aged well, and graphical flaws can break the visual flow, such as spawning objects incorrectly and even breaking mission targets.  Electronic Arts and Crytek issued their final patches in 2007, and it has not received any attention since, which casts a shadow on its asking price. Do not pay full price for this game. Instead, buy it as part a bundle or in a sale. It is a satisfying experience for the hardcore, and even casual shooter.  Stone dumb AI amuses more often than frustrate, and once you learn their recognition patterns, you're nearly untouchable. All that said, this is a fun futuristic if somewhat thoughtfless romp.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the real deal since its on. Til this day its a good looking one with a good story and twist. I would say buy it, well worth the 10quid. Or wait for sale. You wont be disapointed. AI is a real killer on Hard. Amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "You ever wanted to grab someone by the throat and punch them through a shanty town wall? You can do that here!  Excellent game, just avoid Crysis 2 &amp; 3 like the plague.",
            "review_score": "1"
        },
        {
            "review_text": "From covert operation to full scale military offensive, from full scale millitary offensive to what the heck is going on? It's a pity that the game is too short. I played on normal difficulty, but difficulty of the game is dynamic, some places in the game are annoying and you can die like 100 times. Some minor bugs like shaking guns stuck into the floor, crashing helecopters and hard to control airplane. Graphics looks awesome, except some objects like every single refrigerator will have fish on the same shelf and look the same. Ability to pick up objects seems to be useless, only once it was useful when I ran out of RPG ammo, I had to put oil barrels around AA gun and use a grenade to demolish it, they mentioned there should be C4 hidden somewhere in warehouse, but didn't find it. Anyway, the game is a good time killer for a weekend. 8/10 (-2 for annoying control of aircraft, making lose latitude and crash for no reason and reload game million times).",
            "review_score": "1"
        },
        {
            "review_text": "Korean murder simulator. A+ would play again",
            "review_score": "1"
        },
        {
            "review_text": "It's like you're playing Far Cry as Batman.",
            "review_score": "1"
        },
        {
            "review_text": "Still looks amazing, still fun. Slighty dated mechanics. Possible technical issues. But, fun is what matters.  -- Technical: AMD FX-8350 nVidia GTX 970 Windows 10 Pro 64 Game would black screen on start, but it wasn't hard to find a patch that allows it to run on 64 bit. -- Review: This game came out in 2007, and it feels like it. The graphics are still amazing, and look better than some of the games now, but the overall mechanics feel dated.  The story so far is a bit generic. Aliens. The enemy AI is laughable. They have no problem finding loud noises or seeing you. They're even blind if you're standing in tall grass, which is something games now can learn from. Where the AI really fails is finding you when you're using a silencer. If you shoot a wall, they will predictably, look toward where you fired. But, if you get them with a body shot, they will still frantically look around trying to find you. I hit you in the body!! How do you not know where I’m shooting from!?! Likewise, if you kill an enemy next to another, that enemy will have trouble finding you as well. This makes the silencer rather overpowered, and takes the difficulty down to a minimum. The game tries to emphasize stealth, alerting the enemies to your presence will usually result in many more enemies herding to your location. Unfortunately, stealth kills weren’t a standard mechanic at the time. You can however pick up your enemy and use them like a shield, though they die fairly quickly. The cloaking ability itself is rather overpowered as well. You can easily switch back and forth between cloak and armor, using a small amount of cover to regenerate your energy.  Where the game shines most is in the minor features that games now really should have. Highly destructible environments. You can throw a grenade into a building, and the thing will collapse down, killing anyone inside. You can also chop down a tree with your gun, then proceed to chop that tree into several pieces. Weapon customization is done during the missions, and by picking up other weapons, you can add their mods to your repertoire. This allows you to change your style according to the situation that you’re about to enter. The overall style of this game is great, with amazing art. Very good immersion. And… It’s just fun. The level designs allow you to approach an area however you want and play in your own style. The weapon customizations allow you to tweak based on your current situation. The gameplay is just fun.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis 1 is one of the games that were really ahead of it's time in terms of graphics and gameplay. The graphics are still incredible even today, and this game came out in 2007! I would recommend this to anyone who loves great first person shooter experiences with great graphics paired with a great story.",
            "review_score": "1"
        },
        {
            "review_text": "I just heard about it and I decided to play it, I would recomend to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best FPS games on the market. Although it's primarily known for its system-devouring graphics, the gameplay is nearly flawless and the story, while not particularly 'gripping,' has very good presentation and is interesting enough to keep me going. Huge, open environments let you dictate exactly how you want to play - run and gun, sniping, stealth, you name it. The nanosuit powers combined with a large array of guns and attachments mean that no two playthroughs will really be the same. The nanosuit is very creative and allows for lots of possibilities (cloaking, armor, strength, speed). Overall, a flexible, versatile, robust, and still fun game. Pick up Crysis Warhead and 2 if you can as well - both fantastic games.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, although when i got my new pc it didn't and still doesn't work. I am running a 64bit pc and i know it doesn't support htat, but isn't there some way? Friend me if you have a fix please!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best shooters ever made You can kill people by throwing chickens at them And the ayyliens are basically jelly piloting mechanical octopuses 10/10 Real talk",
            "review_score": "1"
        },
        {
            "review_text": "after almost 10 years game still looks awesome. this is truly a fun game. despite recent reviews i did not encouter any issues with the game it runs perfectly on my PC.",
            "review_score": "1"
        },
        {
            "review_text": "I would give it 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "amazing game and the graphics still hold up today. You will have fun in the game as long as you dont take it seriously. just mess arounnd and chuck bannanas and chicvkens at people because its a sandbox like game. If you take it too seriously then you will get really frustrated and probably have no fun.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with an interesting story and easy controls. I was pleasantly surprised.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the last, and great PC classics of the FPS genre. A truely timeless game.  'But can it run Crysis'- People of 2007",
            "review_score": "1"
        },
        {
            "review_text": "I don't do reviews very often, but this game deserved it. Very well done. The controls are easier (you're mouse hand will be sore by the end) than some other games I've played, but still had a few chinks in the armor. The story is wonderful and has many character-developing cutscenes. Only thing wrong is that he more or less ends on a cliffhanger. I've played every Cyrsis game up 2016 and I can say that besides the third (Crysis 3), this game would be my favorite.",
            "review_score": "1"
        },
        {
            "review_text": "True Next-Gen game that changed the image of the game industry!",
            "review_score": "1"
        },
        {
            "review_text": "Wow, what a game! This was a joy from start to finish, and it becomes more interesting the further you get into the story. Perfect fun, the only negative things I could mention is that there are a few glitches which might require you to load a previous save.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis is always Crysis..even after years..is still looking good and always fun to play! Truly raccomended !",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, the story is really good and graphics still hold up.",
            "review_score": "1"
        },
        {
            "review_text": "The best Crysis in the whole series because this one actually feature a more OPEN enviroment and approach to each mission. Used to be the way to go back in the day to do benchmarks for PC gaming.  Still a great and worth playing if you have never tried it. Get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed since 2010, it's the milestone of real-time digital render ever.  The state-of-the-art games are still not able to be that impressive.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis, okay, so it took me a decade to write this, but as you probably know, it was the standard to which all other games had to live up to. Enough Said - just buy it, play it, and then do it all over again. Be sure to get Warhead - it is not really a sequel but a parallel story, and it is even better.",
            "review_score": "1"
        },
        {
            "review_text": "8.5 / 10",
            "review_score": "1"
        }
    ]
}