{
    "app_id": 17330,
    "name": "Crysis Warhead®",
    "release_date": "2008-09-17",
    "developer": [
        "Crytek"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 1694,
    "negative_ratings": 312,
    "price": 7.99,
    "description": "Pulse-racing new installment from 2007's PC Game of the Year*: Play as Sergeant Sykes and experience a whole new side of the battle. A standard combat mission behind enemy lines becomes critical when you discover your enemies have captured something of vital importance to the ensuing war.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/17330/header.jpg?t=1447351452",
    "minimum_requirements": "Supported OS: Microsoft Windows XP with Service Pack 2 or Microsoft Vista Processor: Intel Pentium 4 2.8 GHz (3.2 GHz for Vista), Intel Core 2.0 GHz (2.2 GHz for Vista), AMD Athlon 2800+ (3200+ for Vista) or better Memory: 1.0 GB RAM (XP) or 1.5 GB RAM (Vista) Graphics: 256 MB Video Card: NVIDIA GeForce 6800 GT, ATI Radeon 9800 Pro (Radeon X800 Pro for Vista) or better DirectX Version: DirectX 9.0c or 10 Sound: DirectX 9.0c compatible Hard Drive: 15GB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "You get to punch aliens. Welcome to Earth.",
            "review_score": "1"
        },
        {
            "review_text": "Fairly short but a great addition to the original Crysis.",
            "review_score": "1"
        },
        {
            "review_text": "Warhead was the successor of Crysis in 2008; a stand-alone expansion pack that was specifically released for PCs and, interestingly, did not require the original Crysis game to run. I remember this being praised for its better optimisation while the game at the same time had the exact same requirements as its predecessor. Also it looks better, there's not much difference, though, as it uses the same environments / assets as the original Crysis game.  The story is a tad bit unusual here - instead of this being a continuation to Crysis it actually takes place at the same time. However, the game puts us in the shoes of Psycho instead of Nomad. We pick up the story just after the two buddies get separated - with Psycho alone there's more focus on fighting the Korean military (initially, that is) as the emphasis is on retrieving / destroying the nuclear warhead they have in their possession (hence the title). I liked the in-game cutscenes they made for the game and the fact that we have a Korean colonel as the game's antagonist.  The campaign is, being part of an expansion pack, shorter than that of Crysis but is a BLAST! I found it more action-packed and interesting (even though we know there are aliens rampant on the island which is not a surprise anymore). Since multiplayer services no longer exist (see the disclaimer re GameSpy on the store page) there's no point in elaborating on that one.   Perhaps there's a solution for that, but this would definitely be something unofficial. Thus, at this point, this game is only worth purchasing for its short but satisfying campaign content. If discounted, it may just be a decent purchase and then you can make up your mind whether or not you want to see what Crytek achieved with Crysis 2.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis Warhead is a successful stand alone, which offers a more rhythmical campaign, richer and more dynamic than the original episode. Reverse of the coin: its linearity affects the diversity of approaches, which was one of the highlights of Crysis. So, the experience is somewhat less successful, especially since the surprise is not the same and its short life leaves the player hungry. However, by offering many improvements and an enhanced multiplayer mode, Warhead remains an indispensable acquisition, especially at the price where it is sold.",
            "review_score": "1"
        },
        {
            "review_text": "excellent multiplayer, a shame there are so many cheaters",
            "review_score": "1"
        },
        {
            "review_text": "First let me say I own all the crysis games and by far this one is my favorite not graphic wise nor story wise but gameplay wise. i give i9t a 9.9/10 because the frames drop sometimes.",
            "review_score": "1"
        },
        {
            "review_text": "You can throw turtles at Koreans. YOU CAN THROW TURTLES AT KOREANS.  11/10 would anger PETA again",
            "review_score": "1"
        },
        {
            "review_text": "INCREDIBLE GRAPHIC PERFORMANCE",
            "review_score": "1"
        },
        {
            "review_text": "Less sneaking more spraying. A fun change of pace for the ridiculously good-looking Crysis series. Play them all. Be prepared though... the newer they are, the easier they are. 3 is easy - 1 much less so. Think of this one as 1.5, and the beginning of the 'easier' trend. Still very much worth playing. Easily one of my favorite FPS series ever.",
            "review_score": "1"
        },
        {
            "review_text": "It's like an expansion pack to first Crysis. You get to play as Psycho and see things from his view. They've added new weapons, vehicles and new enemy types. Story is better than first Crysis if you ask me. Short, but more action. Graphics haven't changed a bit, still the same Crysis you know. So, if you liked the first Crysis, you'll like Warhead even more.   'I'm British you muppet.' -Psycho",
            "review_score": "1"
        },
        {
            "review_text": "good game, great one in fact i love to take down in silence :D  good graphics and great game play awesome sound tracks and story. but one thing that i didnt like in this game its short i finished it in nearly 11 hours. so overly its a great game",
            "review_score": "1"
        },
        {
            "review_text": "This is more futuristic in all aspects than COD.",
            "review_score": "1"
        },
        {
            "review_text": "Psycho was a better protagonist than Prophet IMO. I enjoyed this alot but it was real short, better picking it up in a Crysis pack.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked crysis, then you're gonna like this one as well.  Note that it's way shorter than Crysis.  Overall: 8/10. Multiplayer is nearly dead.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game on the PC. A must have with out a doubt.",
            "review_score": "1"
        },
        {
            "review_text": "Short but good game, Weak compared to Crysis. The ending was very bad. Also, it seem to have huge problems with steam and steams ingame overlay. kept crashing, then I turned of steam overlay in settings and went offline - solved all problems.  But im going to recommend this game eventhough the first Crysis is way better.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good if you view it as an expansion to Crysis. On its own, its kinda short. The story isn't great and the main character doesn't seem like the badass he was intended to be. Still, the gameplay is identical to Crysis, which is a good thing. Its always fun to maximum strength punch a dude in the eye.",
            "review_score": "1"
        },
        {
            "review_text": "I waited to write a review on this one to get a feel for the game. I have to say by far this game has one of the best stories I have ever played through. The characters, even the ♥♥♥♥♥♥ ones, have some sort of motive or method behind what they do. The best part about this game is that its graphics are good enough to last a life time. When you first start playing and you are in a Tropical area, you feel so warm and immersed. I highly recommend you buy this on Steam before EA decides its time to pull the plug and ♥♥♥♥ all over this series worse than they already have.",
            "review_score": "1"
        },
        {
            "review_text": "In 2007,Crysis Warhead made a unique intro the FPS world as I never expected to be. Warhead has Good Gameplay, Level Design and wonderful graphics, just go through the first couple missions fast to see the upcoming levels.  Its very short, 4 hours to finish.",
            "review_score": "1"
        },
        {
            "review_text": "09-Aug-2016 : Finished main story Equipment : MSI GT80-2QE Notebook  REVIEW : Great graphics, mediocre gameplay, boring story and characters, short game. Crysis and Crysis Warhead maybe top action games back in 2007-2008, but for today, don't waste your time. Get newer action games instead.  CONCLUSION : Recommended on sale price.",
            "review_score": "1"
        },
        {
            "review_text": "The best standalone dlc",
            "review_score": "1"
        },
        {
            "review_text": "Arguably the best entry in the Crysis series. Crysis WARHEAD builds on the visuals, controls, and experience of the original - while not damaging it.  Absolutely a must-play - and available generally for &lt;$5 on sale.",
            "review_score": "1"
        },
        {
            "review_text": "warheads aren't very sour",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "It's just like Crysis with 100% more Jason Statham.",
            "review_score": "1"
        },
        {
            "review_text": "If there was a 'Best In-Game Swearing In Character Award', Psycho from Crysis: Warhead would win hands down.",
            "review_score": "1"
        },
        {
            "review_text": "More of that sweet, sweet Crysis 1, with a few tweaks and shifts. Psycho, the protagonist in this expansion, is rather likeable, and the parallel storyline is an interesting play if you've already engrossed yourself in the first game. Tweaks to gameplay and a more stable and optimized CryEngine are a big plus. Buy this if you couldn't get enough of Crysis or wanted to relive the Lingshan Incident through another set of eyes.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis Wars (The multiplayer addon that comes with the game) has a mod called Mechwarrior : Living Legends. Any old fan of the Mechwarrior franchise losing faith in Mechwarrior Online or anyone with a thing for giant robots should try it out. Well worth the price of this game, at any price level! Despite the mod having ceased development, there are still a few people playing, and they are ususally rather helpful to new players.  As for the base game, well, It's okay, but not fantastic, and definitely not remarkably better than standard single player Crysis. There's a few new toys to play with and looks as good as expected, but it boils down to the same 'Kill hundreds of Korean Soldiers for a few levels before wierd space aliens come' formula.  Stock multiplayer is either lacking in players entirely or is riddled with hackers. Avoid it like the plague. Fortunately, there are various multiplayer mods that are quite popular without the unpleasant cheaters, like the aforementioned Mechwarrior: Living legends, and the Crysis Wars EX mod, which provides an improved version of the stock multiplayer (Which is quite fun in the first place), with additional weapons, maps, vehicles, game modes to keep you entertained.  Overall, if you're an avid fan of Crysis or its sequels then you should look into this for a quick and dirty booster for your Crysis addiction. To anyone else, the fantastic mods should keep you hooked for a while, but you're not particularly missing anything special if you've tried any other Crysis title.",
            "review_score": "1"
        },
        {
            "review_text": "A great stand-alone expansion to the first Crysis. You play as Psycho, whom you meet in Crysis, and the primary goal of the game is to retrieve a container from a Korean General on the island. You fight the same enemies but the game is just as breathtaking as the original with the amount of detail in the environment. Also, Psycho has a lot more character embedded in himself than Nomad.  8.7/10",
            "review_score": "1"
        },
        {
            "review_text": "Become Jason Statham and beat up Koreans",
            "review_score": "1"
        },
        {
            "review_text": "More of that sweet, sweet Crysis 1, with a few tweaks and shifts. Psycho, the protagonist in this expansion, is rather likeable, and the parallel storyline is an interesting play if you've already engrossed yourself in the first game. Tweaks to gameplay and a more stable and optimized CryEngine are a big plus. Buy this if you couldn't get enough of Crysis or wanted to relive the Lingshan Incident through another set of eyes.",
            "review_score": "1"
        },
        {
            "review_text": "Play Crysis first, and then this.",
            "review_score": "1"
        },
        {
            "review_text": "Dont care about graphs in THIS game this because story is tooooooo good",
            "review_score": "1"
        },
        {
            "review_text": "not *too* terribly fun, but by no means boring... and gorgeous to boot. its a fairly good expansion to crysis",
            "review_score": "1"
        },
        {
            "review_text": "Even better than regular Crysis, but that side character is obnoxious as Hell.",
            "review_score": "1"
        },
        {
            "review_text": "Many review  Such recommend  Very score  9/11",
            "review_score": "1"
        },
        {
            "review_text": "I rate the game Crysis: Warhead 4/5. Good.  This game is better than the original crysis in every respect except it seems to have no idea how to tell a coherent story. Indeed, if I had not played the original game first I would not have any clear idea as to what is going on in this game and as a result it is very necessary to play the original to understand what this game's plot is about. But....the graphics are better, the game runs better, there are even fewer bugs and the same great enemy AI has been retained.  Like its predecessor, this game encourages you to 'think outside of the box' and come up with more innovative solutions to tactical situations than some other games would have you do...but also like its predecessor if you think too far out of the box or get too innovative you can fully expect the game to come up with some crazy, contrived way of instantly killing you. Good example: I decided to bypass a large battle area and outflank all the opponents in an entire battlefield by swimming underwater. A giant shark came by and instantly killed my character, despite the fact that he's wearing a power armor that can deflect .50 caliber bullets with relative ease. Oh well.  But despite its intrinsic and inescapably linear design, this game is still a lot of fun to play. It's loud, action packed and full of between level cutscenes that somehow bridge the gap (or straddle the fence between irritating and campy. This game also gets an honorable mention from me also because it has one of the best train battles (where you jump from one railroad car to another wild-west style) that I have ever seen (the very best was still in Soldier of Fortune however). The music was better in this iteration of crysis also but still not spectacular enough to warrant getting a soundtrack for it. This is a game that was fun enough that I'd consider playing it through on an even higher difficulty sometime or other...if there wasn't such a huge selection of other games out there vying for my attention. In short, this game has all the strengths of the original (except anything approaching a coherent story) and none of the weaknesses. Be warned though, it is unfortunately rather short. Intense but short.",
            "review_score": "1"
        },
        {
            "review_text": "Let me start by explaining what this game actually is. It is, I guess officially, a standalone expansion to the original Crysis game. However, it doesn't build on the story of the original so to say. It's really a retelling of the story from the perspective of Psycho from the original Crysis. You can expect Warhead to last you about 6 hours of gameplay so it's about half as long as the original game, but since you are probably playing Warhead after the original you really don't need the entire backstory. I feel Warhead was just long enough to, 'get the point across,' so to say. Warhead contains the same graphical capabilities and intuitive controls of the original, while adding a very well done alternative point of view. For these reasons, I recommend that anyone who plays the original Crysis also play Warhead.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis Wars (The multiplayer addon that comes with the game) has a mod called Mechwarrior : Living Legends. Any old fan of the Mechwarrior franchise losing faith in Mechwarrior Online or anyone with a thing for giant robots should try it out. Well worth the price of this game, at any price level! Despite the mod having ceased development, there are still a few people playing, and they are ususally rather helpful to new players.  As for the base game, well, It's okay, but not fantastic, and definitely not remarkably better than standard single player Crysis. There's a few new toys to play with and looks as good as expected, but it boils down to the same 'Kill hundreds of Korean Soldiers for a few levels before wierd space aliens come' formula.  Stock multiplayer is either lacking in players entirely or is riddled with hackers. Avoid it like the plague. Fortunately, there are various multiplayer mods that are quite popular without the unpleasant cheaters, like the aforementioned Mechwarrior: Living legends, and the Crysis Wars EX mod, which provides an improved version of the stock multiplayer (Which is quite fun in the first place), with additional weapons, maps, vehicles, game modes to keep you entertained.  Overall, if you're an avid fan of Crysis or its sequels then you should look into this for a quick and dirty booster for your Crysis addiction. To anyone else, the fantastic mods should keep you hooked for a while, but you're not particularly missing anything special if you've tried any other Crysis title.",
            "review_score": "1"
        },
        {
            "review_text": "Before DLC plage our games, this is how an expansion was meant to be.",
            "review_score": "1"
        },
        {
            "review_text": "Has not stood the test of time. Time in this case meaning, er, three years? Anyway. Feh.",
            "review_score": "1"
        },
        {
            "review_text": "Far more interesting than the original Crysis. 5 hours well spent.",
            "review_score": "1"
        },
        {
            "review_text": "Dont Buy It If You Wanna Play Multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much like Crysis 1 except for the storyline, weapons, and vehicles. Other than that, its still good 'ol cryengine.",
            "review_score": "1"
        },
        {
            "review_text": "Another part of original story of Crysis 1 following sgt.Sykes (aka Psycho) who goes to the isle steal alien artifact which Koreans possess.   Classic and good 'old' FPS with good story and atmosphere.  Beautiful semi-opened levels acting as large sandboxes where solution of level goal is only on you - scout area carefuly, observe guards/enemies, look for possibilities to i.e. draw attention on one side of map while you sneak through it on other side etc., or go rogue in Rambo style (but you maybe will die a lot then ;)).  Not bad AI, definitely one of smarter, they can hear you very well and they can see you even if you are cloaked if they come too close (they see 'something', not exactly you, but they will go investigate etc.).  Badass super hi-tech nano-suit with four modes:  - cloak - sneak through almost anywhere unseen - power - jump higher, deliver super strong punches with your hands or throw grenades/stuff/enemies over larger distance, lower recoil, even with large guns like mounted 20mm cannons etc. - speed - no explanation needed :) - armor - withstand much more damage to your suit like from enemy bullets or simply drop down from large heights  Every ability can be very useful, use is only on you how do you combine them during gameplay.  Beside cloaking there is possibility to hide behind stuff and even in bushes uncloaked.  Pros:  - nice story about saving humanity from alien race's raid - smart AI - even with linear story game gives you feel of open world due its large and open levels/maps - amazing graphics (with some lighting and HD textures mods even better) - bugless (i didn't encounter any bug)  Cons:  - game needs a lot of tweaking (not in menu but in config files itself) to deliver reasonable framerate even on nowaday's beast rigs, but funny fact is you can tune it to actually look much more better and yet increasing your framerate ;) - gameplay do not differ much from original Crysis 1, this is more like an DLC which is expanding orignal story  Conclusion  Overall very good game (yet typical scenario 'go save our world'). I had wait some years to play it in desired quality, but waiting was worthy :). If you like sci-fi and stealth possibilities with sandbox play i'd definitely reccomend it to you. Anyway Warhead involves much more aliens and less humans than Crysis 1 - i am fine with it, but someone could find it boring as he likes 'pre-sci-fi' part of orignal Crysis 1.",
            "review_score": "1"
        },
        {
            "review_text": "6/10 - Average. Worth playing if you enjoyed Crysis 1, but it isn't as good.  Aesthetically, every bit as good as Crysis 1. It's visually appealing and has decent sound. However, the rest of the game isn't quite as good. It has poor level design that leads to really tedious and annoying gameplay. They bring all the most annoying enemies and mechanics back form the original and shove them down your throat. The difficulty is also much lower than the original (comparing Delta vs. Delta), but that may be subjective. Overall, not a great game, but not a bad game. Don't bother unless you enjoyed Crysis 1.",
            "review_score": "1"
        },
        {
            "review_text": "Crysis Warhead is something of a mixed bag for me. I played it almost immediately after Crysis, and all sorts of strangeness abounds. For example, I played Crysis on maximum settings and didn't notice anything (aside from the occasional frame rate drop in larger levels) that would impact gameplay from a tech side of the house.  But Warhead? I had to turn everything down. I wanted that 60 fps sweet spot... but it wasn't happening without minimum settings. I didn't play it on minimum, I compromised for about 40 fps, so I could actually see things like grass (which is necessary for my play style, as I like to be the Predator and kill from stealth). I'm curious as to why this stripped down expansion was literally more taxing on my system than the 2013 Tomb Raider (also played on max - but without the PhysX hair).  It may be the combination of age, poor optimization, and video drivers (which age has a pretty big factor on whether or not your drivers will play nice with the game) that prevented me from getting the sort of performance I was getting with the original game (plus, the original game underwent a series of performance patches after it was released).  The gameplay is essentially unchanged, which is good if you like it (I do). All the old weapons are present, though they did add a couple of new ones. However... again, the overpowered alien enemies rear their ugly heads (as expected) and the game becomes less fun as a result. You basically have to carry the gauss rifle at that point forward, and cloaking is a waste of time from there on in. Worse, like before, as soon as the aliens arrive, you're given linear paths and objectives (though Warhead is in general, more linear than the original).  Story wise, I like Warhead better, mostly because you play as Psycho and get some great character development out of the experience. From the first game, the only thing I knew about him was that he was British and slightly sarcastic. And that his callsign probably meant he was a daredevil or just deranged. Psycho is much more interesting than Nomad, and actively defies orders at certain points for fairly justified reasons.  I actively despised the Korean general who is the antagonist of Warhead, and hated it whenever he got the upper hand on Psycho, but the ending was made all the sweeter for it.  On the whole, I recommend Warhead for fans of the first game, with the caveat that it has the same issues of said first game, as well as a few new ones. It's also short, about half the play time of the original Crysis (which I think is fine - it doesn't overstay its welcome).",
            "review_score": "1"
        },
        {
            "review_text": "+ Story that follows original Crysis",
            "review_score": "1"
        },
        {
            "review_text": "Decent add on story line, just more of the same really",
            "review_score": "1"
        },
        {
            "review_text": "It is an OK game even for nowadays.   The only thing frustrating is the story that is pure 'mexican novel' and the 'dramatic moments' have the worst acting ever.",
            "review_score": "1"
        },
        {
            "review_text": "Impressions &amp; Score:  Story: 9.5 out of 10 This is an expansion for Crysis, not a new game and is intended to tell the story of Psycho, one of your teammates in Crysis I. During the story in Crysis I, Psycho get separated from Nomad, in order to fulfill another important mission. This new story is quite good and it's connected to the story in Crysis I, which is awesome. Even though it doesn't provide too much info about aliens and characters, I liked the way it was linked to the main story, so this is why I gave a better score.   Graphics: 10 out of 10 The graphics are almost the same as for Crysis I but with some improvements in details in almost everything. This is quite a good thing, I didn't quite noticed at first, but after checking some videos on youtube, the differences are pretty big. If I could have given a better score, I would, this expansion is improved on almost every aspect.   Gameplay: 9.5 out of 10 First of all, I like to mention that this game is a bit harder than Crysis I, but this isn't because of AI improvement, but mostly because of more difficult enemies throught the game. While in the first Crysis, you fought KPA soldiers over 50 % of the game (which were quite weak even on Delta difficulty), in this DLC you'll only fight KPA soldiers during the first 10 % of the game. Instead of KPA soldiers, in Crysis Warhead you'll fight a lot of KPA Special Ops (which are bassically nano suit soldiers just like yourself), which are pretty damn good. The producers also included some alien packs that are immune to damage until you destroy the one that generates their shield. All this makes the game a bit more challenging than the first Crysis, which is a good improvement from my point of view. They also added new vehicules and new weapons like grenade launcher, new pistols, new grenades, all this further improves the overall gameplay. Great job !   Audio: 10 out of 10 The audio is similar to the previous Crysis, so that means is excellent. Didn't noticed any differences here.   AI Behavior: 9.5 out of 10 The AI is better, because you don't have to fight too many KPA soldiers, instead you have to fight a lot of aliens, KPA Special Ops and some bosses. The KPA Special Ops are quite good because they use nano grenades to deactivate your suit before moving to attack, the aliens instead, have the same behavior like in Crysis I, so for more details see that review.  Multiplayer: not tested As with Crysis I, I couldn't test the multiplayer since the servers were deactivated. There are some instructions on the internet on how you can play multiplayer, but I didn't bother to try.  Overall: 9.7 out 10 A lot of improvements done in this expansion compared to the previous Crysis, that makes this game even better. On top of all this, Crysis Warhead is a stand alone game and doesn't require the original Crysis to be played, but in my opionion is very recommended that you play the first Crysis before checking Crysis Warhead, so that you may have a better understanding of what is happening during the storyline. 100 % recommend, a true clasic masterpiece to the fps genre.",
            "review_score": "1"
        },
        {
            "review_text": "Dont care about graphs in THIS game this because story is tooooooo good",
            "review_score": "1"
        },
        {
            "review_text": "Crysis and Crysis Warhead - the playable benchmark any owner of a high end system should own. One thing I really like about this series is how the higher difficulty setting adds realism to gameplay. Not just the same old 'enemies have more 'HP.' Some scenes are so beautiful you'll want to create a gallery of save points to re-visit them. Be sure to check out the Natural Mod 2.0 for Crysis for nicer gfx.",
            "review_score": "1"
        },
        {
            "review_text": " Crysis Warhead offers more of the same compared to the original, but not much more.   Pros: Graphics, Sound, Controls Cons: Story, Gameplay, Bugs, Multiplayer  Crysis Warhead boast lush, beautiful graphics that most machines can now handle. The sounds and music mesh just as well with the story and setting. Controls are mostly clean and crisp, but some features (such as hold-down aim) are either poor or nonexistent.  The story doesn't deviate from the original which leaves something to be desired given the original's inadequacy. Gameplay is boring if not consistent: Korean soldiers and alien spawn will fill most of the kill count. Bugs may sometimes necessitate a reload, but nothing too major. Multiplayer is nonexistent, but it would still be virtually nonexistent playerwise if its nonexistence were nonexistent.  Crysis Warhead offers a little more than the original, but too little more than everything else.  6/10",
            "review_score": "-1"
        },
        {
            "review_text": "It was stale bought it for cheap.",
            "review_score": "-1"
        },
        {
            "review_text": "run, error start game. window 8 or 8.1.",
            "review_score": "-1"
        },
        {
            "review_text": "Might be a decent game if it would stop crashing every few mins...",
            "review_score": "-1"
        },
        {
            "review_text": "I don't really feel like this is as good as the original. I has potential, but for me it was more disappointing, than enjoyable. First of all the bugs... I mean I got killed more times by getting stuck in barrels and other object, than actual enemies. Second the map design was disappointing, most of the levels were just tunnels and they felt like tunnels, rather than the feel of openness of the original. The new weapons? The mounted ones are good, other than that, the UZI is useless (IMO), and the PAX is just for the finale, it's good but there was no time to enjoy it enough. The story is kinda lame, the cutscenes are sometimes very slow, the incompetence of the soldiers and Psycho's too is kinda lame too (I mean come on he has weapons, and he starts fist fighting every ****** time, and the container is always getting taken away. nice work). The grahics is good and it still looks nice, the swamp map was very good and refreshing. The enemy was good, varied, and the game was sometimes 'hard' or just a bit challenging, the new enemy type (the shielding one) was a good idea. Overall if you liked Crysis, you'll probably want to play this too, but IMO don't expect any miracles. I played through it, but didn't really enjoyed it. 7/10 but no recommendation from me, only for HC Crysis fans.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy if you have more than two processors. It won't run. Check that out for yourself before you buy it if you don't believe me.",
            "review_score": "-1"
        },
        {
            "review_text": "What a derivative, horrible game. Its basically identical to Crysis, with pretty much nothing new. It's several hours more of the same lame story, and mindless shooting at the same enemies, with same weapons, and same vehicles. Again, and again, and again. Cutscenes are often lame or plain silly, with voice out of sync with characters actions. Ending is lame and plain dumb. Just like Crysis, Crysis Warhead is more of a graphical demo, and system benchmark than actual game. Can get it for $5? Go ahead. Just to see the pretty graphics. Otherwise, save your money.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a pretty well-made Battlefield clone, that has good graphics, native Xbox 360 controller support yet nobody ever plays it anymore. The servers are all empty. Therefore, I won't recommend buying Crysis: Warhead solely for its multiplayer component at this point.",
            "review_score": "-1"
        },
        {
            "review_text": "OK game, just covering old ground. Very short, finished it inside 1 day.",
            "review_score": "-1"
        }
    ]
}