{
    "app_id": 17430,
    "name": "Need for Speed Undercover",
    "release_date": "2008-12-19",
    "developer": [
        "EA Black Box"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Racing"
    ],
    "tags": [
        "Racing",
        "Open World",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 2351,
    "negative_ratings": 1081,
    "price": 9.99,
    "description": "Chase or Be Chased. You never thought it would turn out like thisan all-out chase where you're the hunted. And the hunter. Now you must get behind the wheel and risk everything to infiltrate a ruthless international crime syndicate and take them down.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/17430/header.jpg?t=1447351585",
    "minimum_requirements": "Supported OS: Microsoft Windows® Windows XP (SP2), Windows Vista Processor: Intel Pentium® 4 or equivalent, 3.0 GHz or faster Memory: 5XP: 512 MB RAM / Vista: 1 GB RAM Graphics: 128 MB or more, NVIDIA GeForce (6600 or better); ATI Radeon (9500 or better); Intel G45 Express Chipset Drivers: DirectX® 9.0c (included) and latest video drivers Hard Drive: 6.0 GB free space  Sound: DirectX 9.0c compatible sound card INTERNET CONNECTION, ONLINE AUTHENTICATION AND ACCEPTANCE OF END USER LICENSE AGREEMENT REQUIRED TO PLAY. TO ACCESS ONLINE FEATURES, YOU MUST REGISTER ONLINE. ONLY ONE REGISTRATION IS AVAILABLE PER GAME. EA ONLINE TERMS &amp; CONDITIONS AND FEATURE UPDATES CAN BE FOUND AT <a href=\"https://steamcommunity.com/linkfilter/?url=http://WWW.EA.COM\" target=\"_blank\" rel=\"noopener\"  >WWW.EA.COM. YOU MUST BE 13+ TO REGISTER WITH EA ONLINE.                     EA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON <a href=\"https://steamcommunity.com/linkfilter/?url=http://WWW.EA.COM\" target=\"_blank\" rel=\"noopener\"  >WWW.EA.COM.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "It is a really short game, but I loved the story. Plus there are very good tunning system, it is absolutely worth the price",
            "review_score": "1"
        },
        {
            "review_text": "One of the most underrated series of nfs. It has lot of cutscenes, and nice storyline to follow on. Only two problem makes this game underrated than it has to be.  First problem is the ridiculous difficulty on some races such as I need to beat SLR Mclaren with EVO. But it is not that big because you can get pinkslips as you clear other missions and easily collect money and buy a better car. The biggest problem is physics which breaks the game and makes player difficult or sometimes almost impossible to control the car. But overall great game with big open world, Which is the last nfs with STORY, COPS, TUNE UPS, and FREEDRIVE. See what happened to NFS these days. They are just burnout series with supercars. No more storyline, unique tune ups, and thrills which really suck.  간만에 해보는데 뽀샤시한 그래픽, 스토리라인이 좋음  최고의 혹평을 받았던 게임인데 거기서 알수 있듯 굉장한 개적화와 썩은 물리엔진을 보여준다 썩은 물리엔진이 혈압을 오르게하지만 기본적으로 뽀샤시한 느낌과 오픈월드가 좋아서 할만은 하다.",
            "review_score": "1"
        },
        {
            "review_text": "It does what any good arcade racing game does best. Amazing picture perfect graphics which take very little power to run, has free roam and a ton of awesome cars to choose from. The story mode is just what you need it to be,crazy chases, wrecks or just good old racing with long tracks spanning miles on end. The physics aren't as realistic but this is an arcade game, a great one at that. ",
            "review_score": "1"
        },
        {
            "review_text": "I wish there was a 'Maybe' option when it comes to recommending games, because it would be very useful right now.   Short Version:",
            "review_score": "1"
        },
        {
            "review_text": "This is the best 'Need for speed' game i have played, one of the best 'Arcade' racers out there.",
            "review_score": "1"
        },
        {
            "review_text": "This game is my favourite nfs game over all nfs serial.. the best over all of them?  .. emm hard to say that maybe... but this game rocks!",
            "review_score": "1"
        },
        {
            "review_text": "4:3 resolution Unbalanced cops and robbers mode Most ♥♥♥♥ed up drifts Can't even play with steam friends EA Nation EA Nation EA Nation Dem light shafts   I love it",
            "review_score": "1"
        },
        {
            "review_text": "One of the best game from NFS series, from my point of view. Iis in Top3 NFS games, after NFS Most Wanted 2005 (no.1) and NFS The Run (no.2).",
            "review_score": "1"
        },
        {
            "review_text": "Those other people dont know what they are talking about. I believe that the developers at EA and BlackBox have outdone themselves once again to bring enjoyment to the racing game scene. I understand there are other racing sims out there but none like the Need For Speed Franchise. I have owned every version since the beginning of the franchise. I own it for both PC and PS3. EA and everyone else that was involved in the making of the game... keep doing what you do best and that is making the Need For Speed franchise better and better every year",
            "review_score": "1"
        },
        {
            "review_text": "Great racing game! Does the need for speed series justice. Great vehicles and graphics are nice. Great selections of vehlicles and customizations. The storyline is pretty good but can be pretty boring at times kinda a storyline you would expect out of a need for speed game very similar to others. I would give it a 7/10 rating a good racing game for the racing game lovers out there a must buy for them.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Love it so much. The graphics are bad but it was made in 2008. Gotta give it credit for being great~ ",
            "review_score": "1"
        },
        {
            "review_text": "Love it, not like the bullsh*t that criterion games gave us in 2012, controls are good and comftoble as long as you adjust them, and the pyhsics are acceptable, good range of car and custumisation, it will work on windows 8.1 (mine) and windows 10, also on almot anything older than 7. I rate it a 7/10, but amazing price for value. would reccoment to any petrolhead or a person wanting to relive the nostalgia from need for speed most wanted 2005 or nfsu2.",
            "review_score": "1"
        },
        {
            "review_text": "You should buy it if it is on sale. not full price. I liked the story line. I played this game on PS3. It was my first NFS Game on my PS3. and grafics arent bad. When i played it on my PS3, i was kist 8-10 so i didnt understand a thing. Lol. Alot of good and old cars like Dodge Charger R/T(1970) and SRT-8 and Dodge Challenger. Nissan skyline, BMW, Porsche, Lamborghini and much more. You can aslo customize your cars wich is my favorite! You can also customize your cars, which is my favorite! Good Sountracks too. It also was my first PS3 Game and i got the PS3 Early when it came out, still have the PS3 and the Stearing Wheel i used. Good times. 8/10 for being an old game and i played it at PS3 arround when it came out. had alot of fun in free roam :P",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, just finish the game offline and refund it",
            "review_score": "1"
        },
        {
            "review_text": "A classic but very good game!",
            "review_score": "1"
        },
        {
            "review_text": "hd mode... more details and modes on wii but i like it good drift and annoying cops lots of replay wish could network play still oh well",
            "review_score": "1"
        },
        {
            "review_text": "just a basic NFS",
            "review_score": "1"
        },
        {
            "review_text": "EA's Need for Speed franchise has been in an odd position the last couple years. While the franchise often worked to mix up the formula from year to year a decent bit, the release of EA's own Burnout Paradise posed a bit of a conundrum for the publisher. With Burnout switching to an open world setting, it meant that it competed directly with Need for Speed in that space. Last year's Need for Speed ProStreet was a diversion for the series from recent years, going to track-based racing, plenty of tuning options and focusing entirely on the events than exploring the city or running from the cops. ProStreet didn't turn out too well, so Black Box went back to the drawing board and returned to an open world setting with this year's Need for Speed Undercover, but that wasn't the only design change. Undercover also seems to be directed right at the casual market, both in terms of presentation and its extremely relaxed learning curve.",
            "review_score": "1"
        },
        {
            "review_text": "Help, i cant run it at this pc with Windows 7, AMD Phenom II X4 955, GTS 250 and 8GB RAM",
            "review_score": "1"
        },
        {
            "review_text": "old game but if run on max settings has reasonably okay graphics. cutscenes are a bit lame though but all in all good game",
            "review_score": "1"
        },
        {
            "review_text": "still a good game, workes great on pc.",
            "review_score": "1"
        },
        {
            "review_text": "perfect game :D",
            "review_score": "1"
        },
        {
            "review_text": "NEED FOR SPEED BEST GAMES EVER! 9/10 The Online is dead",
            "review_score": "1"
        },
        {
            "review_text": "Best of the Need for Speed series. I love everything about this game. The music, the sounds, the gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the worst titles in the series. The storyline is okay, but gets boring quickly. The graphics are barely any better compared to Most Wanted and Carbon, but there is no guarantee the game will run smoothly.",
            "review_score": "1"
        },
        {
            "review_text": "I love cause I use to own this game I wasn't allow to customize and now I can. I feel lik its a Need for Speed. Cars to get Tier 4: Lotus Elise Tier 3: Nissan Skyline GTR-R34 Tier 2: Lamborghini Gallardo LP-540 Tier 1: Bugatti Veryon or Mclearn F1 Trust me these cars work out for me and I hope you guys have fun.  Ps: I'm great at Need for Speed so I help you out if you need it through videos I will make.",
            "review_score": "1"
        },
        {
            "review_text": "It's not too bad, people who are expecting something like Most Wanted or Carbon would have been disapointed when it came out i guess. Plus it had a fair share of performance issues. For what it is, it's not that bad of a Need for Speed game but just a few pointers:  -Challenge Series is not available for Steam edition. But minor loss. It doesn't impact the main career mode at all. -While the Origin verison comes with the Challenge Series, the Origin version is horribly unoptimised. No matter what the Origin version will run at a significantly lower frame rate than the Steam version, no matter the settings. Not sure why, but it just is. A few threads on the internet from long ago mentioned the EA Download Manager (now Origin version) had performance issues, so it's a semi known issue.  -Setting affinity to a single core or just two cores can help smooth frame rate a little, but difference is minimal. Game runs fairly well on todays hardware, not as well as it should but it's playable for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Need for Speed undercover the game that ign does not like but i love, and guess what its in HD. but it was made in 2008, the game in my opinion gave me three things I wanted, money, Cars to waste my money on, and infinite combinations. Its all about the winning the races and making a car that can get a 0 - 60 in 5 seconds while plowing through police cars. That being said, the story seems good till you play and in the end youl forget it, but thats not bad, its not good either. But today the racing games have you driving stock cars with nitros installed, so I can't complain.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this is probably one my favorite games of all time. The graphics are fairly decent for the time, there is a good amount of cars, and for once, it's a NFS game with a partially decent storyline. I don't know why I love this game, I just do. The only problem I have is that gamepad support is abysmal. The sheer force of my thumb lying on top of the Joystick is enough to make the car always lean left. Also the AI is awful.  TL:DR Pick it up on sale if you are afraid of a bad game, don't expect perfection. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Good fun, like all the NFS games - and a storyline to follow too!",
            "review_score": "1"
        },
        {
            "review_text": "There is a ramp to a rooftop that cops can't get to. Lose any wanted level by sitting a few feet above the police  10/10",
            "review_score": "1"
        },
        {
            "review_text": "amazing , one of the best Need for Speed games made",
            "review_score": "1"
        },
        {
            "review_text": "Great game, vary little lag for me. I can turn with no latency compared to nfs shift.",
            "review_score": "1"
        },
        {
            "review_text": "For an old-gen or current-gen game, I am very impressed with the port and the graphics. The graphics make the game seem a bit realistic, the game has beautiful scenery, and its fun racing or getting chased.  9.3/10 - Would High-speed to avoid arrest anytime (well, in the game)",
            "review_score": "1"
        },
        {
            "review_text": "It's more fun than I had on the ps3 years and years back... but it's not that good actually. I seem to have really bad lag for no reason. I'll run Driver San Fransisco on High res, high quality without ANY lag and this is just wow horrible for no reason. It looks like crap and it runs like crap. But... it's still fun. That's why I'm still recommending it, buy it on sale, couple of bucks, why not? But what I don't get is why the worst NFS's are on Steam? Where's Most Wanted, Underground 2, etc. I mean this one is alright but it doesn't look or feel anything like the better ones. It's still fun though.",
            "review_score": "1"
        },
        {
            "review_text": "its ok. after this the NFS series went downhill.",
            "review_score": "1"
        },
        {
            "review_text": "I had a great time with it.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are decent. Controls are awesome. ( your car at the start may seem it's too sensitive, but you get better ones around the 20-35min. mark after doing some the story line races )  You are an undercover cop, desgized as a street car racer. Your mission is to bust the thieves and crime lords ( ones selling the cars )  Enjoyable game if you want to kill off an hour or so.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "good game but its no nfs most wated old school edition",
            "review_score": "1"
        },
        {
            "review_text": "'I must say ive always liked the nfs games and this one really brought movie action themed racing to you hands for a newb to racing games on the pc the controls were very simple to get used to' I give it a rating of 7.9",
            "review_score": "1"
        },
        {
            "review_text": "same old need for speed.. excellent as always",
            "review_score": "1"
        },
        {
            "review_text": "The Need for Speed trillogy has been an all time favourite for me ever since most wanted to Undercover, This game has shown a great deal of what it would be like to move throught the streets with a great deal of speed.   I personally recommend this game but if you dont like racing games or have the patience for it this isnt the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun and mentally challenging game. Well worth what it's worth!",
            "review_score": "1"
        },
        {
            "review_text": "My favorite Racing game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Always been a fan of the Need for Speed series. I'ts a shame the last few games are not that good as there previous ones, i really like this game i would recommend it definitely!! graphics are not that out dated if you set that at the highest as you can get. story is good aswell, like the cars and that they are subcatogorized in the shop by the country the are from.",
            "review_score": "1"
        },
        {
            "review_text": "Need for Speed undercover the game that ign does not like but i love, and guess what its in HD. but it was made in 2008, the game in my opinion gave me three things I wanted, money, Cars to waste my money on, and infinite combinations. Its all about the winning the races and making a car that can get a 0 - 60 in 5 seconds while plowing through police cars. That being said, the story seems good till you play and in the end youl forget it, but thats not bad, its not good either. But today the racing games have you driving stock cars with nitros installed, so I can't complain.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Carbon, not as good as Most Wanted, still a very fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Good game overall. A decent departure from the typical racing game.",
            "review_score": "1"
        },
        {
            "review_text": "I have realy enjoyed this game then again ive liked all the need for speed games and if you want to go fast in a safe enviroment then id recomend this game it is fun to play and not to hard for even newcomers so give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "This game taught me that US police are hardcore.",
            "review_score": "1"
        },
        {
            "review_text": "For so far that i like this game (Ofcourse it is, its a blackbox production) but i dont like the music theme its a bit, how i say it.. let me just say the music sucks.. more hip hop! ",
            "review_score": "1"
        },
        {
            "review_text": "I've just experienced the Need for Speed",
            "review_score": "1"
        },
        {
            "review_text": "The graphic is amazing, the car selection is vast, &amp; the story fits. But it's too difficult for me.",
            "review_score": "1"
        },
        {
            "review_text": "This game would be great, as it was on the console, if they had ported it correctly. Quite a few notable glitches, one of which being the game has a chance to improperly close (it just goes into the background). I could list many others, but that's what a forum is for. For some reason (of which is beyond me), it was seen fit to lock the resolution to a 4:3 ratio, making the game look rather uncanny, to say the least, on any other monitor resolution. There isn't even an option in the game settings, that's just how it is. Needless to say, with all the changes they made to it, along with poorly optimizing the game for PC, this has to be one of the worst PC ports I've played in a while. The game is still fun to play, but it could have been far better than it had turned out.",
            "review_score": "1"
        },
        {
            "review_text": "This game is... more enjoyable than NFS:MW 2012, which I spent like $60 when it came out because of the MW name, and I hate it so much. Undercover is a game that gives you a feeling that they rushed too hard during development, so it lacks testing, refinement, and thoughts. It carries quite a few promises, but is very disappointing.  Pros: 1. Fast-paced action easily makes one EXCITED! 2. A good collection of cars. 3. A nice world to roam about. 4. Cut-scenes are quite well made. 5. Chances are that you buy this game when it's on sale, very cheap.  Cons: 1. Physics is ridiculous, when crash happens, all cars seem to have infinite mass. Mario Kart has better physics and makes more sense. NFS is not famous for physics accuracy, but this game is way too off-scale. 2. If you drive manual, you will easily feel that the cars' torque-rev relationship is pretty ridiculous. 3. Brake is so ridiculously powerful, and the car has ridiculous amount of grip. 4. They hired Maggie Q and others to make nice movies, so it seems that they focused on SP. However AI is ridiculous. Anything controlled by AI just makes no sense. 5. AI racers seem to be 'given' speed and accleration. Sometimes I can have 200 feet in the lead and I am faster round the last corner, but the second car just acclerates ridiculously and robs my first place. It feels that those cars do not have actual drivers in them. 6. Roaming traffic cars are quite amazing, not only AI racers ram you like crazy, those roaming traffic cars also ram into you for no reason at all. 7. There's almost no balance between cars and missions. You can win by miles using Lotus Elise against some really slow Volkswagen, and at some other locatons you will face Audi R8, Gallardo, and many other cars that are way faster. BTW Lotus Elise is extremely overpowered. 8. I can't believe how bad the cops are. They seem to give up chasing you as long as you are 100 inches ahead of them. Sometimes it can be extremely hard to complete missions like cost-to-state challenge, because the cops do not chase you at all, even you are at heat level 5. 9. You can easily use the TAB key to fast travel to just jump right to the next race, so although there's a huge amazing open world, chances are that you don't even roam about at all. 10. Graphics are okay for a game this old, and it uses similar color scheme as the original NFS:MW. However it looks a lot less attractive than NFS:MW for some reason. 11. Road surface is modeled quite badly. Different road surface (asphalt, grass, dirt, etc) feels quite similar, and the only difference seems to be the smoothness. 12. Its compatibility with controllers has lots of problems. If I have my keyboard, XBOX360 controller, and my Logitech G27 all connected at the same time, the car will keep steering to the right, and the menu cursor keeps going down. 13. The cars' performace has little to do with their real-life version.  Conclusion: If this game is on sale, and if you want some excitment road racing, and if you are not good at braking in racing games, pick this up. It can make you blood boil (Rush-time High Way Battle is the best mode in this game IMO), and it does not require too much skill.",
            "review_score": "-1"
        },
        {
            "review_text": "A pretty fun game, especially for the price. However, it's just too buggy to recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "I currently don't know what's going on with the game. I get the command prompt that the game starts then it crashes...steam needs to fix this problem. I can play Hot pursuit with no problems.",
            "review_score": "-1"
        },
        {
            "review_text": "The game play is stiff, seems to have no story line except seemingly randomly videos telling you about an abstract story that has nothing to do with the races you run.   the roaming feature seems to have no point as continously on the bottom of your screen is a shortcut to the the next race which immiedietly can go into the next with seemily no reasoing except that its the next on the developers playlist.   Overall severly disapointed",
            "review_score": "-1"
        },
        {
            "review_text": "GOD what a poor Game.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your money on a game that won't play. Steam should kick these old versions that won't play on windows 7/8. What a piece of junk.",
            "review_score": "-1"
        },
        {
            "review_text": "I want a refund",
            "review_score": "-1"
        },
        {
            "review_text": "i buy this not long ago at 75% off (a few days before i wrote this review).  and the game is crap, the reason i bought this, is because i wanted to play some racing games, that are not simulation, because lately racing games are all about simulation only, and i wanted a fun game, instead i got a crappy game.  Pros : this game got nothing good in it. except maybe because this game doesn't need EA Origin can be called as a plus.  Cons : 1. very poor optimization 2. the AI is too easy 3. because the AI is too easy, the game is absolutely boring / garbage. 4. lame acting. 5. Maggie Q acting sucks 6. story is kinda non existent, because they just throw us in it, after showing the cutscene. 7. car handling sucks. 8. no vibration for 360 gamepad. 9. i tried plugging in my logitech rumblepad 2, and the vibration option is finally show up, but it feels lacking. 10. for a 2008 game, the graphics sucks, too much blur. 11. the city feels like a dead city.  Conclusion : even at 75% off, this game is a waste of money, unless you got money to burn.  Overall : 0 out of 10  @EA : i wont use origin, that's why i wont buy your newer games, that is origin only.",
            "review_score": "-1"
        },
        {
            "review_text": "Game Crashes on the first turn over the bridge, with no help from steam (which they sell however they do not provide technical support for third party products) customer consumer protection laws do not apply to them it seems.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashed at the end of the first segment every time, no matter what I did.  I ran the troubleshooter, tried running it in compatibility mode for vista and XP, tried running as admin, followed recommended settings on  pcgamingwiki.com . Same thing. Crashed every single time.  Win8.1, Intel i7-2600K, NVidia GTX-970, 16 GB RAM, 2xSSD in RAID-0",
            "review_score": "-1"
        },
        {
            "review_text": "I wonder why the game fines you for driving too fast? At the same time the game takes away XP for crashing?",
            "review_score": "-1"
        },
        {
            "review_text": "Need for speed undercover:  Great example of the NFS franchise. Unfortunately is let down severely by basic port/platform issue.  No ability to access the steam interface – this includes not be able to take screenshots &amp; access the hub or message etc. (thanks Origin/EA/Steam). Also I am bugged by some issue where the car steers to the right constantly. I unplugged my controller &amp; keyboard, tried another and rebooted as much as any man could in half an hour to no success.   If anyone knows a remedy to the issues above, please share and I will update this review. If not this game gets a stinking 0/10 for me for being a good, yet unplayable game.",
            "review_score": "-1"
        },
        {
            "review_text": "It just keeps on crashing right at the start right when i go through the cop barricade",
            "review_score": "-1"
        },
        {
            "review_text": "This will be my first review, ever on steam.. annnnd this game is a doozy..  Where to start... i brought this while it was on offer (don't buy it otherwise) it's a pale comparison to the likes of Most Wanted (2005) and Carbon.. so.. the pro's and con's   Pros:  Many cars to purchase Lots of rims to choose Massive world to freeroam in  Cons: A.I has 'Catch-Up' i'm sure of this Traffic WILL spawn in the right places at the right time to screw you over Cops/Feds are literally driving in tanks, SUV's can keep up with you no matter how fast your going Car handling is shocking to say the least Poor port to PC as it'll lag even if you have a decent system Story is.. well. i didn't pay much attention, it ends abruptly   It wasn't a baaad game, but it'll make you rage at most things that happen in game.. won't be playing this again anytime soon!",
            "review_score": "-1"
        },
        {
            "review_text": "AI suck Gameplay suck Only the story is good but if it does why dont you go buy a movie to watch LOL The Roaming Traffic in outrun race make me sick.....Da AI car just crash to you ridiculously and you never beat the target car I think this game ruin my impression to Need for Speed series,my last NFS game is Most Wanted on psp",
            "review_score": "-1"
        },
        {
            "review_text": "Boring, races are all in the same key. The only good thing here is music. It's advisable to try Burnout Paradise. It's from 2008 as well but 10x better.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought it as a bundle for cheap so i'm not complaining much, however this game is poorly coded to the point where you may aswell buy a different game. Being an old game, it may not be badly coded but it isnt well compatable. Also being an old game, at £9.99 it's worth it if you have Windows XP / Vista I guess. But here's what happened: - First time I launched it, it went to 640x480 and crashed my pc with a black screen. - Second time, changed resolution to 1920x1080 and it crashed. - Third time, it launched it 1920x1080 and played for an hour or so finishing alot of missions and obtaining different cars along the way for it to suddenly crash as I merely evade the police.  Pros: - Nice cars. - Good gameplay. - Is not half bad if you get it on a console. - Enjoyable to play when it did play.  Cons: - Ugly enviroment. - Poor brakes. - Easy AI. - Cars too slow. - Use of KM/H. - Annoying real life based cut scenes. - Stupid police chatter. - Unrealistic police chases. - Unrealistic police cars. - Use of blocking corners with arrows. - Glitches with autosculpt. (Make a custom bumper for it to erase itself.) - Unrealistic traffic. - Weird gravity. - Any form of air requires a slow-mo replay apparently. - Buildings out of proportion. - No ingame brightness/gamma options, makes you change your tv. - Screenshots need an origin account? (wtf) - Steam overlay doesn't work %90 of the time.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game on the Xbox 360 alot but i do not recomend it on pc i only paid 3 dollars for it and i still wish i had my money back, it has a lot of errors like it cant remember your graphics settings ever and it always resets the controls suck and you are better off with a controller and if you really want this game i recomend getting it on the Xbox or Ps3 its not a bad game it just sucks on the pc",
            "review_score": "-1"
        },
        {
            "review_text": "Really ♥♥♥♥♥?",
            "review_score": "-1"
        },
        {
            "review_text": "Giving this a 5/10   The game feels short with no real challenge and Need for Speed most wanted was more challenging. I miss Need for speed underground where the real street racing is. The graphics is average and as well as game play with cars and upgrades/mods.  I do not recommend buying this game at normal price. Rather wait for the summer sale next time.   They need to bring out Need for Speed 2015 on PC for steam as well!",
            "review_score": "-1"
        },
        {
            "review_text": "Just like every other NFS game, the AI cheats you non-stop. Get Burnout Paradise instead.",
            "review_score": "-1"
        },
        {
            "review_text": "If you want to get this because you loved it on ps2.. DONT.. you will be dissatisfied.. this port is bad.. everything changed.. races are different, cars are different, customization is horrible.. story's the same, mostly, they added a bit more dialog, but geez.. i loved it on ps2.",
            "review_score": "-1"
        },
        {
            "review_text": "DOES NOT RUN ON WIDOWS 10!!! I bought the game because i played it on my old xbox 360 and it was my favorite game. So after it downloads it has me download some stuff (I've never heard of it before) then as i tried to play it, it crashes and i cant even get past the intro... dont waste your money if you have anything other than windows xp",
            "review_score": "-1"
        },
        {
            "review_text": "This game gave me cancer. TL;DR: gives cancer",
            "review_score": "-1"
        },
        {
            "review_text": "What a stupid game",
            "review_score": "-1"
        },
        {
            "review_text": "terrible storyline, end is also abrupt. Graphics decent for its release period, but overall i would pick something more engaging and rewarding.",
            "review_score": "-1"
        },
        {
            "review_text": "Just don't buy this. Go buy Hot Pursuit or any other NFS game.",
            "review_score": "-1"
        },
        {
            "review_text": "Shity story that is 0 % intresting and way 2 short, LOVE the gameplay and the cars ... but to little cars .. and no customsion on the cars. Hope 4 a story like the NFS carbon or the first NFS Most Wanted. the perfect nfs games",
            "review_score": "-1"
        },
        {
            "review_text": "Shity story that is 0 % intresting and way 2 short, LOVE the gameplay and the cars ... but to little cars .. and no customsion on the cars. Hope 4 a story like the NFS carbon or the first NFS Most Wanted. the perfect nfs games",
            "review_score": "-1"
        },
        {
            "review_text": "Normally i would reccomend this game, since it really is one of the greater NFS, however it is near impossible to get it running on modern machines, i dont know if this is because of steam or something else, but it jut wont work. Which is a real shame, if you like fast and furious type games",
            "review_score": "-1"
        }
    ]
}