{
    "app_id": 17450,
    "name": "Dragon Age: Origins",
    "release_date": "2009-11-05",
    "developer": [
        "BioWare"
    ],
    "publisher": [
        "Electronic Arts"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Fantasy",
        "Story Rich"
    ],
    "achievements": 0,
    "positive_ratings": 6207,
    "negative_ratings": 468,
    "price": 14.99,
    "description": "You are a Grey Warden, one of the last of a legendary order of guardians. With the return of an ancient foe and the kingdom engulfed in civil war, you have been chosen by fate to unite the shattered lands and slay the archdemon once and for all.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/17450/header.jpg?t=1447351620",
    "minimum_requirements": "OS: Windows XP (SP3) or Windows Vista (SP1) or Windows 7 Processor: Intel Core 2 Single 1.6 Ghz Processor (or equivalent) or AMD 64 2.0 GHz Processor (or equivalent) Memory: 1GB (1.5 GB Vista and Windows 7) Graphics: ATI Radeon X850 256MB or NVIDIA GeForce 6600 GT 128MB or greater (Windows Vista: Radeon X1550 256 MB or NVidia GeForce 7600GT 256MB) DirectX®: DirectX (November 2007) Hard Drive: 20 GB HD space Sound: Direct X Compatible Sound Card",
    "recommended_requirements": "OS: Windows XP (SP3) or Windows Vista (SP1) or Windows 7 Processor: Intel Core 2 Duo 2.4 Ghz or AMD Phenom II X2 Dual-Core 2.7 Ghz Processor or equivalent Memory: 2 GB (3GB Vista and Windows 7) Graphics: ATI 3850 512 MB or NVidia 8800GTS 512MB or greater DirectX®: DirectX (November 2007) Hard Drive: 20 GB HD space Sound: Direct X Compatible Sound Card",
    "reviews": [
        {
            "review_text": "Having finished the whole thing more than 12 times, have to say. It is OK. don't be deceived by the 465 hours on record, most of those playthroughs were outside Steam. Definitely do NOT buy the standard edition, but hang out for the 'Ultimate Edition' because there is LOTS of DLC and you want it all. Dragon Age Origins is something of an enigma. It is a great RPG that brought together most of the good things that Bioware had achieved with Baldur's Gate and the Neverwinter Nights games, but it falls just short of perfecting them. All the content is superb except for the absence of an explorable world, (something Bioware has never even tried to achieve). Sadly the series turned South after this. Edmonton seems obsessed with the idea that video games need to be interactive movies where players marvel at the studio's voice acting talent and cinematic cut scenes. They forgot along the way that role-playing is about the players creating their own stories. In time all of the once numerous class and race options that players had enjoyed with the AD&amp;D based system disappeared, along with any real moral or narrative choices. Dragon Age Origins was the last Hurrah for the old-style feel. I would say that every RPG fan NEEDS to own and play the Ultimate edition of Origins. Enjoy all that is good in it. Also observe the key ways in which it fails. Origins is a great case study in RPG design.",
            "review_score": "1"
        },
        {
            "review_text": "With all the hype of Dragon Age Inquisition about and remembering my disapointment with DA2 i revisited this game that i had completed a few run throughs. I love it! yes its word heavy but the characters, story are sublime and it still holds up 5 years on. If you have a bit of time, give it a go",
            "review_score": "1"
        },
        {
            "review_text": "Dragon Age is a kind of game that is becoming increasingly rare: a deeply immersive single-player RPG with an interface clearly designed for the PC. It's easy to sling around the word 'immersive' at any game that looks pretty, but DA isn't messing around - the world of Ferelden shows a unified sense of design and depth that blows even famously vast games like Oblivion out of the water. Coupled with consistently excellent writing and across-the-board quality character design even down to relatively unimportant NPCs, the game truly does feel like it's reacting to your choices dynamically from the very beginning, and how you play your character can have amazingly subtle effects on the way the story unfolds.  Graphically, the game's a little uneven. All the design elements are there, and it has plenty of high-quality textures and strong environmental visuals - particularly fire effects. The polygons themselves, particularly on character faces, are a little simpler than you'd expect from a 2009 game. Overall, the game looks about on level with Oblivion, although the visual distinctiveness and design ethic of areas and characters are significantly better. Animation stands out as a strong suit here, particularly during the game's frequent dialog sequences, with none of the dead-eyed staring or bizarre walk cycles that plagued other RPGs like Fallout 3.  Gameplay is pretty straightforward, and very much in keeping with previous Bioware titles like Knights of the Old Republic and Mass Effect. You control a party of up to four characters, each of whom develops a plethora of useful abilities to keep track of. The inclusion of a minor programming element (very much in keeping with the gambit system from Final Fantasy XII) will let you set up a few default actions on each character so you're not stuck frantically switching between them to make sure they drink their healing potions, but battles frequently require some degree of tactical planning. Setting up ambushes and planning your party strategy to play to strengths is necessary to get through some tougher areas. The interface is, shockingly, clearly tailor-made for the PC (the console versions have their own interfaces designed from the bottom up and are apparently easier games to allow for the sacrifice in easy access to skills). You have an insane number of quick-access slots, and nearly the entire keyboard is bound to one thing or another. It's the kind of interface that hasn't been in vogue since before the PS2 came out. The game is extremely linear, although the frequent and varied dialog options give it the feel of a more free-roaming game, and it's very tempting to go back and replay huge chunks of the game just to see how the complex and dynamic conversations will play out. The main downside is that there's no easy way to level-grind, which is to the game's benefit to a point (no tedious circling around killing wolves) but occasionally means you can get in over your head.  What the game sacrifices in terms of sandbox free-roaming it more than makes up with in the excellent writing and characterization. An absurd attention to detail and across-the-board excellent voice acting breathes a lot of life into the game's conversations, which make up a significant chunk of gameplay. Characters are extremely varied and the interplay between them is a major draw, a trademark of Bioware's games, but Dragon Age has some of the most likable characters I've ever seen in a video game and the excellent performances from talents like Tim Curry, Kate Mulgrew and Claudia Black really put the game a notch above. Even the game's fairly generic-on-the-surface fantasy world is livened up by a few critical details - for example, the elves in Dragon Age are a massive underclass of servants.  It's actually difficult to find things to level complaints against in this game. One petty gripe is Morrigan's visual design - her character is one of the game's strongest, and she has great personality and some very clever writing, but visually she's a pair of giant breasts with a cloth draped improbably over them. Other women in the game are treated with a bit more restraint, though, and female armor is gratifyingly sensible. Another issue is that it can be difficult to manage battles on the fly, and accurately targeting enemies with skills frequently requires tactical pausing just to line the cursor up over their relatively small active areas. It's a petty annoyance, but the game clearly wasn't meant to be played Diablo-style anyway.  A few other things to know about the game: -The game is mostly DRM-free, and ships only with a simple disc check. EA has a reputation for fouling up its customers' computers with DRM malware, but DA seems to be free of those problems. -If Dragon Age were a movie, it would be rated R. I don't remember ever seeing any swearing, oddly, but the game is rife with violent imagery, extremely dark themes and frank sexuality (including a handful of relatively tasteful sex scenes and occasional demonic nudity). The game handles all of it with maturity and depth, but it's clearly not meant for children, and even parents of younger teens should be cautious.  Overall, Dragon Age is one of the strongest games to come out in recent memory, and is another installment in Bioware's increasing resume of superbly-written RPGs. Players looking for a fast-paced hack-and-slash 'rpg' should look elsewhere, but anyone who likes deep and elegant plot development, memorable characters and excellent role-playing will love this game.",
            "review_score": "1"
        },
        {
            "review_text": "DA: O is superior to its sequels.",
            "review_score": "1"
        },
        {
            "review_text": "A game that defines true modern classic RPG, no wonder people claims that this is one of the best RPGs of all time. At first I didn't expect to experience this much, - Never expect how good the companion system is - Well written dialogue - Fluent story progression - In depth story telling - Choices made in the game really matter. A lot of choices blend naturally that you don't even realize what you do can affect the game, even some RPG nowadays aren't able to provide better choice-matters gameplay - And much more that you need to experience yourself! Although some people might not enjoy the combat system much, the RPG elements itself is enough to make you keep playing. I myself enjoy the tactical combat system. I can't really recommend this game for those who can't stand talking with many NPCs and explore options available in the conversation or like to skip conversations because there are lots of chit chat to be done in the game, for me it's an essential way to enjoy the game world.  I can say that this game is a must buy for RPG fan.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute fantastic story in grim world. The sequals do not do this world justice at all. If you have played DA:2 or DA:I before this, you are in for a bit of a shock.   The systems are a bit clunky and menu heavy by todays standards, but what it lacks in streamlining offered by the sequals it makes up for in depth. Infinitely deeper and more nuanced systems requiring to you actually form a party and design their commands to work together to stay alive. Slow and methodical wins out here.  If you are an older gamer or just a gamer looking for something a bit deeper than the surface level systems RPG's offer these days, this is a must play.",
            "review_score": "1"
        },
        {
            "review_text": "I have played a lot of RPG's. Some were bad, some were good and then there is this game. Dragon Age origins is by far my favorite game of all time! It has some of the best characters that I have experienced in any media and one of the best back stories. The way the game starts, no matter your background, is amazing! And I have not experienced any fantasy world that hates magic this much, which just makes it even more unique.  Sure there are holes in the game here and there and it is not the best combat system, but I am not playing a game like this for the combat. If I wanted combat I would play a different game or genre all together. What this game does, and the sequals fail at, is putting the story above all else and shows you, if you will let it, one of the all time best stories full of monsters, evil and major plot twists that you never saw comming.  This is obviously not a game for everyone. If you do not mind a game that does not focus to much on combat, has a few bugs here and there and performance issues in certain areas but just want a game with awesome characters, exiting background story for your own character and a rich and dark world for you to fix and best of all. Choices that MATTER! Then you should consider trying it out!",
            "review_score": "1"
        },
        {
            "review_text": "Great talking simulator  Interesting story  Great walking simulator Believable characters Good dating simulator  Overall ++++/+++++ ",
            "review_score": "1"
        },
        {
            "review_text": "I've finished all 3 Dragon Age games. This one is the greatest, Inqusition being the second and Dragon Age-2 being the third. Despite being old and lacking today's engine capabilities, this one managed to beat the newest installment on the series for me. I'd recommend anyone to purchase this one before any other. This had a lot more depth to the desicion mechanics, interactions between characters, immersion and overall story presentation. Side quests actually have a proper backroung story and diolog options whereas in Inqusition, they are similar to a typical mmo levelling quest. Their purpose is to offer a grinding source in order to reach the main story mission and they aren't enjoyable. Origins base game offered a decent amount of content for it's price. The only downside on the original Dragon Age game compared to the newer ones is it's combat.",
            "review_score": "1"
        },
        {
            "review_text": "easely one of the best games ever made. worth every penny. Without a doubt this game has no equal. I have two copies of this game, my play time is over 400 hours, and i still cant get enough.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! So much better than Dragon Age 2!",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest RPGs of all time. I highly recommend buying Dragon Age 1 and 2. The gameplay is fantastic and UI unparallelled.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best games of the last generation. Increadibly indepth, with characters you care about. A story and world your interested in. Theres no shortage of things to do and hidden gems to find in Dragon Age: Origins. Bioware have really outdone themselves this time. If your a fan of rpgs and Bioware especially, then you owe it to yourself to play Dragon Age: Origins. And dont rush through it. This game shines when you take your time and explore the world thats been crafted here.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! One for tactical genuses unlike me lol, surpasses its successor by a lot but lets not get into that. The storyline was great, the gameplay was great but im more of a hack and slash type of guy so i didnt really suit to my needs but i got through it just fine, you will however need to have a good no GREAT! cpu to run this monster, it will chew through your cpu but every bit is worth it, in local terms-GET THIS GAME! and get the 2nd one to if you like hack and slash so i liked the second one in the combat department but thats irrelevant, so like i said before-GET THIS GAME!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a game I absolutely loved, I finished it and immediately had to install the second part because I needed more, which doesn't happen to me extremely often with a game. I finished both the Origins and the 2 in maybe 100 hours (more or less, I didn't play them through Steam, so the number of hours isn't recorded) which usually seems plently, but with these games it didn't seem enough. I will deffinitely play this game again in the future, and I can't wait to buy the third one to play it as well (maybe this time on Steam, so I can actually record the progress :))) ). I totally recomend this game for fantasy fans.",
            "review_score": "1"
        },
        {
            "review_text": "DAWM this game is long!!! This game is huge and the deep pauze and command gameplay takes hours to perfect. Countless strategies are possible! try it out, but keep a month free!",
            "review_score": "1"
        },
        {
            "review_text": "This game scratches that same itch that Mass Effect does with the choices you make having consequences over multiple games. The friendships and romantic relationships are excellent, believable, and actually affect the game (whereas many RPGs keep relationships and gameplay relatively separate). Highly, highly recommend this entire series.",
            "review_score": "1"
        },
        {
            "review_text": "This game is excellent, there are tons of items to customize your character, the story is great, graphics are very good.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, the only complaint is dialogue gets repeated if you choose the options in an order that writers didn't expect you would choose.",
            "review_score": "1"
        },
        {
            "review_text": "&lt;3 Alistair...too bad I forgot to ask him to come to my tent with enough approvals before I lost opportunities to do so!  I spent 80 hours on this game to complete thoroughly. I liked the emotional interaction (approve/disapprove) system with other characters better than Oblivion. It is very solid RPG with better and more fun action system for PC players since it was developed for PC first not for consoles.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good RPG, if a bit silly at times. It carries interesting messages which a lot of gamers don't care to think about, due to the fact that most gamers don't tend to think at all, so I'm surprised this game is as popular as it is. It's pretty neat, though, for much different reason than the second game. The first game is a really cool story; the second game is a really averge story with really pretty location, object, and character designs, and cheesy, cartoonish animations that don't fit the mood of the game world in the least. The first game is much less flashy, but much more coherent.",
            "review_score": "1"
        },
        {
            "review_text": "The last great RPG out by bioware before EA turned them into a mindless zombie company. Seriously, this game is really good for old RPG fans who care about deep dialog, branching outcomes, rememborable NPC's, interesting lore and much more more. If there is a negative, it is that some of the DLC is not worth it and it is very annoying that there is NPC's trying to sell you DLC in the game (EA's doing). If you want to know what bioware was like before EA's corrosive touch, this is a good example of how amazing they used to be.",
            "review_score": "1"
        },
        {
            "review_text": "This was not one of my all time favorite games but a game in the Spirit of Baldur's Gate is always a fun time. I was never really into the whole 'darker theme' thing but this game made it work and made the dwarves the coolest racists I've seen in a game outside of a sandbox shooter. I think I lost track of what exactly I wanted to say but if you like a good classic western D&amp;D style RPG this is a good choice.",
            "review_score": "1"
        },
        {
            "review_text": "You can let demons posess little girls in this game, thats not really nice indeed.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game and sad that the continuation is not on steam",
            "review_score": "1"
        },
        {
            "review_text": "can play it 300 hours more and not being tired of this game",
            "review_score": "1"
        },
        {
            "review_text": "Love it. It's fun, the controls are easy and the story is excellent.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs Ever!   This game should appeal to anyone who love a good story combined with a involving combat system.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it while Steam Sale for 5€, played it almost 40 hours. Worth the money? YES!",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game. Albeit old, and the first of it's series, it sets the tone well for it's 2nd part as well as the upcoming DA 3: Inquisition. Game is fun, with depth in it's characters, as well as quirks to the races, atypical from normal fantasy setting races. Hey, the Elves are no more high and mighty, but pretty much slaves to humans. =D",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic and epic tactical RPG with strong inspiration in old campaigns of D &amp; D. Although Bioware has developed his own RPG system, leaving the D &amp; D franchise, the system works very well. For those who like history, character development and moral choices, the game is a full pack. Characters with different stories and personalities that develops during the campaign, stablishing a relationship with your principal character. Great graphics, music and beautiful scenery. One of the best CRPGs in recent years.",
            "review_score": "1"
        },
        {
            "review_text": "＋ old-schooled team-based combat ＋ a wide variety of different skill builds ＋ impressive character designs ＋ a huge immersive world ＋ epic boss fights  － a little bit cliché － unbalanced classes (e.g. Archers are too weak) － DLCs",
            "review_score": "1"
        },
        {
            "review_text": "RPG masterpiece. DA:O has all the classic RPG components, plus a great story, with SIX metric tons of lore to be inmersed on. Semi-open world (a full map with limited areas where you can go to), It's a time sinker too, with several start stories, and class choices, you only appreciate the difference in the game if you play several times with different classes.  Permanent story decisions, romance, massive dragons, plus the awakening dlc, this game is a must play for every RPG fan out there.",
            "review_score": "1"
        },
        {
            "review_text": "the beginning of an epic journey",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the greatest games I have played. Comabt is great, the story is amazing, and there is many things to do.",
            "review_score": "1"
        },
        {
            "review_text": "Took me three tries to get into it, I just couldn't enjoy combat as a Warrior. Now I'm playing as an Arcane Warrior (Battlemage, practically) and I love it. This game deserves it 91/100 every bit.",
            "review_score": "1"
        },
        {
            "review_text": "Dragon Age: Origins is one of those games that leaves you empty when you finish it. It has a great story and makes the player influence that somewhat by choosing different dialogue options which can lead to all sorts of interesting character developments.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG's I ever played, when you aren't afraid of crashes in a 5 minute interval then it is a must buy.  PS: Quick save on F5 (You will need it)",
            "review_score": "1"
        },
        {
            "review_text": "So far one of the best RPGs for computer, along with Planescape Torment, Baldur's Gate and some others. The mechanics are really nice and the lore makes the whole thing a chasm of pure imersion. They should have work in a few more NPC skin optionsm but it is not a big problem at all. Tons of replayability chances. Go for it!",
            "review_score": "1"
        },
        {
            "review_text": "At first I owned a copy of Dragon Age for Xbox 360 and something didn't feel quite right. It had(and still do) many elements that felt half finished, so eventually i traded it in for something else. A while later I bought it on STEAM, after thinking that the experience might be different on the computer...and what a good decision that was! The character control feels so much better using the keyboard. This will be apparent when you find yourself in a tight spot during battle, which you will. It's somewhat unbalanced (caster &gt; everything else) but the given the story driven nature of the game, i found myself quite okay with that aspect and totally in love with how the controls work on PC. The good voice acting, the visual scenery and the quality of the dialogues that shape your experience, are as usual from Bioware, top notch. I actually repeated this procedure with Mass Effect, going from console to PC(ME2) and again found myself appreciating the game much more on the computer, but that's a different story.",
            "review_score": "1"
        },
        {
            "review_text": "Dragon Age: Origins is one of the best RPG games you can ever play. The characters are solid, nightmare difficulty is awesome and interactions with your party members really make you feel like you are in the game.Best game ever played.",
            "review_score": "1"
        },
        {
            "review_text": "The world is so detailed and so huge,the story is so interesting and the characters are so alive that I couldn't tear away from the game for an entire week at first,wondering where have I been all along not having played this earlier as an RPG lover. There are so many different choices and little details in every single quest that I still cannot comprehend this game was made back in 2009. Definitely recommend it,",
            "review_score": "1"
        },
        {
            "review_text": "1. On normal difficulty, this game is hard af. 2. There are stupid exploits, sorry, 'fighting techniques', that are not fun at all, but are most reasonable if you want to win a hard fight. Some examples: (WARNING! Exploit ahead) For melee fighting bosses, you can run away with the one that is being chased by the boss and shoot the boss down with your other partymembers (END OF EXPLOIT). You will be constantly pausing the game and adjusting your party's actions, because they generally do stupid things or do nothing (if you have disabled their free choice, which I recommend &gt;:D). You want more intelligent partymembers so that you don't have to pause all the time? Then just spend a huge number of points into their fighting intelligence, which can also be spent to make the character objectively stronger. If you would really do that, the game would get even harder. What a dilemma. 3. This game is full of fights. Which means in conclusion: NO FUN (on normal difficulty). My Advice: Don't buy this game for it's combat, and if you play it, play it on easy difficulty. Everything other than combat is OK i guess...",
            "review_score": "1"
        },
        {
            "review_text": "This Game is so AWSOME!!! In my Opinion it's better than every fantasymovie I ever watched! Can't say any more .. I'm just done cuz it's 2 awsome 4 me! x.x",
            "review_score": "1"
        },
        {
            "review_text": "pretty cool storyline but needs more dragons",
            "review_score": "1"
        },
        {
            "review_text": "Really great RPG. Almost to the level of Epic.",
            "review_score": "1"
        },
        {
            "review_text": "pretty cool storyline but needs more dragons",
            "review_score": "1"
        },
        {
            "review_text": "Oh. My. God. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Dragon Age: Origins is the second best game BioWare ever made. Good mechanics, storyline whose strength is rivalled by few, solid graphics and DLC that is actually worth the price, the only downside these days is that you can only buy it on Origin.  10/10 ♥♥♥♥ off EA.",
            "review_score": "1"
        },
        {
            "review_text": "Dragon Age: Origins is the second best game BioWare ever made. Good mechanics, storyline whose strength is rivalled by few, solid graphics and DLC that is actually worth the price, the only downside these days is that you can only buy it on Origin.  10/10 ♥♥♥♥ off EA.",
            "review_score": "1"
        },
        {
            "review_text": "I've sunk over 300 hours into this game currently. And I haven't even played as anything over then a rogue human yet.  So... Yeah... Solid gameplay, challenging, fun, amazing story. 10/10 Would murder dragons again. /(get murdered by dragons)",
            "review_score": "1"
        },
        {
            "review_text": "  Infinite love. 10/10, those dialog's...",
            "review_score": "1"
        },
        {
            "review_text": "My favorite RPG of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game :D",
            "review_score": "1"
        },
        {
            "review_text": "if you like taking it in the butt from orcs, i highly recommend this game",
            "review_score": "1"
        },
        {
            "review_text": "Yes Yes yes I recommend this game. I will recommend this game now in 2014 against 99% of the RPGs available and it is 5 years old. Quality is quality hands ♥♥♥♥ing down.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG Games ever made. The other versions after it are pale in comparison.",
            "review_score": "1"
        },
        {
            "review_text": "Epic fantasy. Old-school RPG. About 60 hours of fun with one playthrough, but you would really like to experience all 'Origin' stories. Fantastic value for the money.",
            "review_score": "1"
        },
        {
            "review_text": "One of The BEST RPGs I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever. In my memory and heart forever sharing place with Ocarina of Time, Final Fantasy IX and The Witcher saga.",
            "review_score": "1"
        },
        {
            "review_text": "Most of the characters aren't very annoying",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING- by far my favorite game on steam!",
            "review_score": "1"
        },
        {
            "review_text": "Classic older generation bioware game. It gives the similar feeling of The Elder Scrolls III: Morrowind. It is the last true RPG i have played within the last decade that still gives you that sandbox feel, and the butterflies in your stomach when you first start playing. It's the last game bioware has crafted that really leaves you coming back for more.   Highly Recommended for the Sandboxy RPG fan that enjoyed games like Knights of the Old Republic, and The elder scrolls III: Morrowind.",
            "review_score": "1"
        },
        {
            "review_text": "Right off the bat, if you're just checking the reviews before buying the game, know this: You absolutely have to play as a mage or a two handed Dwarf warrior. Not because they are the most overpowered, but because they are the least underpowered. They messed up the combat from KOTOR. Unbelievable. The game has a pretty good plot though. I would recommend this game just for the plot.",
            "review_score": "1"
        },
        {
            "review_text": "One of the games of the Decade.",
            "review_score": "1"
        },
        {
            "review_text": "Really cool RPG. Ife you like playing an RPG, than you can not mis out on this one.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG Games ever made. The other versions after it are pale in comparison.",
            "review_score": "1"
        },
        {
            "review_text": "Loved it. Imo best Bioware game next to Dragon Age 2.",
            "review_score": "1"
        },
        {
            "review_text": "Cut through hordes of Darkspawn (orcs) while thinking about what gift to give to your favorite companion. Hint: it's the golem.",
            "review_score": "1"
        },
        {
            "review_text": "Play for 15 hours Next Day Computer Got Repaired Lost My Save Files 11/10 Would Lost My Save Files Again",
            "review_score": "1"
        },
        {
            "review_text": "Great game. No Doubt one of the best RPG ever made.",
            "review_score": "1"
        },
        {
            "review_text": "If you have recently played Inquisition and your looking for more Dragon Age then be aware, this is a bit different. This game is missing a lot of improvements that Inquisition made.  That said its a million times better than Dragon Age 2 so if you want more of this universe then buy it!  Just don't expect to see the outside world anytime soon. This takes roughly 60 hours+ to finish",
            "review_score": "1"
        },
        {
            "review_text": "Like Mass Effect, but with slightly fewer spaceships.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a little slow paced compared to Call of Duty and other FPS's, but this game is by far the best military simulator with extremely large maps and a huge variety of vehicles and weapons to choose from. Singleplayer is not so great but all of the fun and action comes from the co-op missions online. You won't get anywhere in this game without an organized team which is one of the many reasons why this game is so fun. Highly recommended. Blows any competition out of the water (Op Flashpoint: Dragon Rising, CoD, MoH, etc.).",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy Dragon Age Inquisition. Under no circumstances. It will ruin the franchise and this masterpiece of gaming.  Oirgins is one of the best games I've ever played.  Dragon Age 2 is acceptable, but a mere shadow of Origins.  Inquisition is cancer. Don't buy Inquisition even for 5 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "If you think you know What RPG is before playing this game... Pay and think again.",
            "review_score": "1"
        },
        {
            "review_text": "This is probably my favorite game of all time. Characters. story and gameplay are all top notch. 5 play throughs and I still enjoy every minute of this game. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "one of best rpg i ever play total worth to buy",
            "review_score": "1"
        },
        {
            "review_text": "I put over 190 hours into this game. It was that good!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with entertaining chars, RPG elements, combat and story. Much much much better than the second game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest classic RPG games of all time. A must buy, nothing else to add.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly first 2 hours is awful and so boring. 'cause it is like a MMORPG style and nothing interesting in there however after 2 hours later it will tell u why dis game is so awesome even boring combat!!!  -Story is the Best (so exciting &amp; romance :P) -Gameplay is average (yeah normal and difficult) -Characters are so good (u will be never bored with them) and choose ur faction and see different storyline. (yeah dis game will give u memorable characters, meaningful choices and epic story) 83hrs gameplay-40% progress, end campaign? o_O maybe i should start one more and more and see what did i miss.  TY Bioware 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This managed to surpass Baldur's Gate in my heart for favourite RPG of all time. Gods forgive me, but I love it. Having dumped 200 hours into the game, I can safely say that it is thoroughly entertaining, enticing and even sometimes thought provoking.",
            "review_score": "1"
        },
        {
            "review_text": "had s*x with morrigan had s*x with leliana had s*x with alistair had s*x with 20 different people in pubs  'great story'",
            "review_score": "1"
        },
        {
            "review_text": "Hard, long and entertaining. Lots of important decisions to take. Good enough game to play more than just once.",
            "review_score": "1"
        },
        {
            "review_text": "A high-quality spiritual successor to Baldur's Gate, before DA became dull and repetetive. Great characters and deep, rewarding combat. The world itself is quite generic. Would play again.",
            "review_score": "1"
        },
        {
            "review_text": "this is the most amazing game. EA actually pays you to buy it!",
            "review_score": "1"
        },
        {
            "review_text": "I gave this a try because I tend to like games with dragons. I'm a simple man. Anyway, after the lackluster opening it really turned into an awesome game with variation in the way to play, the environments, a good story... and it's really hard. Turned into one of my favorite games of all time!",
            "review_score": "1"
        },
        {
            "review_text": "One of the few newer 'classic RPG's' with added action elements, which does not disappoint the avid RPG fan. Dragon Age: Origin is a wonderful adventure with a good story behind it. Some sections might seem tedious (Dwarven City) but culminates in the end for a terrific story arch. In conclusion; If you are looking for an old style RPG to get lost in, Dragon Age: Origin might just be for you.",
            "review_score": "1"
        },
        {
            "review_text": "Full of stories and fleshed out characters, choice and consequence, Dragon Age hearkens back to the RPGS that were mainly vehicles for filling a role. However, the game's presentation (closed worlds and static NPC's) make it feel strangely frozen and untouhable. Even more, the focus on stats over reflex jarred me and felt a bit too clinical. However, Dragon Age truly shines when it attempts mystery, sarcasm, epic drama, and a reactive 'story.' Great game; definitely worth a play if you love RPG's or games that hang on a plot.",
            "review_score": "1"
        },
        {
            "review_text": "This is a must have game for anyone who enjoys RPG's. I have 144 hours into this game, and i do not regret any of that. There are so many different ways to handle situations with the dialog its awesome.",
            "review_score": "1"
        },
        {
            "review_text": "it's a very good RPG and I love it, I just want to play it alot but sometimes stop for a bit after 6 hours straight o gameplay, and I really love this game and I just want MORE!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Swords and Dragons and Romance, oh my!",
            "review_score": "1"
        },
        {
            "review_text": "I bought the digital deluxe version for 60 bucks and got totally ripped off. There is nothing extra besides awakening-no dlc´s no nothing. Just the plain game i could have bourght for around ♥♥♥♥ing six bucks. Stay away form the deluxe version folks and save your money. Shame on you steam for scamming people this way, my cd keys says deluxe version, but the game sure as hell aint.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic storyline and flawless execution. Bioware produces yet another classic, drops the mic.   More than five years passed since this game was released and let me tell you, if you didn't played it yet, you should get it and play it. Like any other true classic, Dragon Age: Origins delivers a unique gaming experience that everyone should be able to enjoy. Beautifully crafted world, detailed and perfectly tuned to the style and mood proposed by the writers. Excellent music to round up a truly immersive atmosphere.  Make your character, get your party together and go adventuring. This game doesn't runs over the DnD rules, but the system in place is very intuitive and you'll get the hang of it in no time at all. Races, Classes and Specializations available give you plenty of choices and encourage the player to try and beat the game with a totally different approach.   If you loved Planescape: Torment, Baldur's Gate and Icewind Dale you will feel at home with Dragon Age: Origins.",
            "review_score": "1"
        },
        {
            "review_text": "After more than 220 hours in this game, plus another 100 ++ downloading mods, reading lore and discussing the game with friends I'd say that this is my all time favorite immersive RPG. More so than Elder Scrolls in fact, but that comes down to taste in gameplay and visuals.",
            "review_score": "1"
        },
        {
            "review_text": "Simply one of the best games I have ever played. The story is amazing, combat requires tactics and planning (most of the time) which is a nice change from simply running in all guns blazing. As much as I love KOTOR, I'd have to say this is better than it.   10/10.",
            "review_score": "1"
        },
        {
            "review_text": "ive played and finished this game like 4 times its great game with great mod support 2  ",
            "review_score": "1"
        },
        {
            "review_text": "one of my favorite rpgs of all time. nothing else to say.",
            "review_score": "1"
        },
        {
            "review_text": "very addicting game, played it alot of time for different playthroughs :D",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. One of the best RPG in recent years. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Classic. My dwarf's life included: killing hundreds of orcs, yelling at whiney princes, forcing whiney princes to become man king, and impregnating a witch so she would make him immortal and kill ♥♥♥♥♥ ♥♥♥ dragon king",
            "review_score": "1"
        },
        {
            "review_text": "Most games you pick up might never be considered to be timeless, but if you have some change sitting around and you're looking for waste upwards of forty hours or more, then pick up this game. With an immersive story, and setting in a fantasy genre that always seems to create new lovable, wretched, and hilarious character, Dragon Age Origins delivers the maximum utmost.  Pros: Great Story/Writing Immersive Locales Memorable Companions and Characters Multiple Endings/Choices that matter  Cons: Somewhat wonky, slow combat Inventory Management is clunky. ",
            "review_score": "1"
        },
        {
            "review_text": "Good game. 10/10.          YouTube™ Video:  Help me. I'm addicted&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i've ever played. I'd recommend this to anyone, especially to RPG beginners just like i was at the time.",
            "review_score": "1"
        },
        {
            "review_text": "Fantanstic. One of the games you can play over and over again with different characters just to see the difference in the storyline.",
            "review_score": "1"
        },
        {
            "review_text": "I have sunk at least 21 hours into dragon Age and i have to say it's probaly going to become my favort RPG. Let me explane , firstly i injoy the multiple starts paths and chosses that you can play throgh makeing sure that you want to rerole as a diffrent race and class and try difrent chosses. Then thiers the folowers, i have a soft spot in my heart for good charitors and the interations with them so i was quite pleased with all the diferent people you gather into your party and the diologe that each of them have. The only 2 down size is that the combat is more tatical then hack and slash wich i dont realy like. But it works and if you can keep an eye on all of your folowers health you can get through each fight with little damage. The other bad thing is that when a lot of enemys are on screen the game chugs a litte and you cant see how much damage you are doing. But aside from this the game is quite well balanced and fun with a rich and interesting lore. Now before i finish i would like to say if you played Dragon Age 2 or Inquisition before this one like i did you better know that this one is very diferent from its predisesors. They definltly dumed down the later ones. So in conclusion, fun game, rich lore, hilarious betwen folower diolog, and well put to getter characters. Down sides, less hack and slash gameplay and cluddered combat. 8.9/10",
            "review_score": "1"
        },
        {
            "review_text": "I passed by this game not thinking much of it, I only purchased it as it was made by Bioware, and i had a passion for Mass Effect, it took me by surprise, I fell in love with the characters, (One more than the rest ;) ). I transferred to the xbox as I didnt like Origin, but I enjoyed it nonetheless. Amazing game, please play it.",
            "review_score": "1"
        },
        {
            "review_text": "This is A good game. I loved it, the story is good, the combat too. I like that you can choose sometimes. well this game is one of my fav. games. I wish there was more on this game except some little DLC. :D",
            "review_score": "1"
        },
        {
            "review_text": "Everyting in this game is perfect. The music, the difficulty, the characters, the plot. Everything. I cannot think of a single thing that's bad about this game.",
            "review_score": "1"
        },
        {
            "review_text": "Addicting RPG! BIOWARE work at its finest... hundreds of hours logged!",
            "review_score": "1"
        },
        {
            "review_text": "This game is damn awesome Definately worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "This game will occupy all of your time. Literally 100's of hours of your life.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Great RPG",
            "review_score": "1"
        },
        {
            "review_text": "Maybe the last great Bioware game before things started going downhill. The lore, the characters, the strategy. This is how you do an RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Hated it the first time around.. tried it again and fell in love. This game is huge and if you're a fan of roleplaying this is a hit.",
            "review_score": "1"
        },
        {
            "review_text": "Dragon Age Origins cannot be compared to any other rpg. Apart from Inquisition, which I have not played yet, this game can offer up to 80+ hours of entertainment.  Pros: - There are various different background stories in the character creation - Use of team strategy in fights (very important) - Decide which actions to take and choose whether to be good or evil, having consequences in your relationships - Characters are so interactive within different places and with their companions and yourself, it's practically impossible not to relate with them - Many others...  Cons: - None, unlike Dragon Age II, but that's another review ;)  This is just one of the best rpgs I've played so far &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time rpg games. I have spent over 70 hrs in it.wow.",
            "review_score": "1"
        },
        {
            "review_text": "There are so many wonderful things about this game that would take me hours to list them all. The story is fantastic and it's one of the few games that I don't get tired of and will happily replay as soon as I've completed another playthrough. I'm slightly annoyed that they created Alistair, however, because the minute I first met him I knew. I was done for. Because of him, I seem incapable of going through a playthrough without romancing him. For example, my last playthrough as a female dalish elf was supposed to be for Zevran, instead. But noooo I had to take one look at Alistair and I had fallen in love all over again. To be honest, though, 10/10 would romance again.  One of my favourite parts of the game, however, has to be the wide variety of decisions and how the affect the game later on. I felt extremely satisfied when characters from my PC's origin recognised them and it made the tougher choices all the more pressuring, knowing this could not only affect this game, but the games that come later, too. For anyone looking for a game with a good narrative and fulfilling experience, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "fun and better on computer the consule",
            "review_score": "1"
        },
        {
            "review_text": "Great Rpg",
            "review_score": "1"
        },
        {
            "review_text": "The game is awesome but don't buy this version. Buy the Ultimate Edition. And Never pre-order from EA, just hang back a little and wait for them to releases dlcs and GOTY editions ;)",
            "review_score": "1"
        },
        {
            "review_text": "very fun i love every second of it",
            "review_score": "1"
        },
        {
            "review_text": "Enchantment?  Enchantment!",
            "review_score": "1"
        },
        {
            "review_text": "On of the best RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "great game , nice plot good skills and gear . re-played it 3 times . 9.3\\10",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best games ever made. The second... not so much, but still not bad and well worth the money. If you have not played these, you are certainly missing out.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to spend time on. Hard too, takes you back to the old MMO style of combat. Takes a while though. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game experience.  Good storyline and character shaping. 85 hours of great fun for me.",
            "review_score": "1"
        },
        {
            "review_text": "An enriched story with awesome fantasy RPG style gameplay",
            "review_score": "1"
        },
        {
            "review_text": "The wonderful story and original score mesh together well, creating a fantasic atmosphere in a game that is so deep and well thought-out, it can only be called amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, but only if you are willing to put the time into it.",
            "review_score": "1"
        },
        {
            "review_text": "A great game with in-depth gameplay, combat and storyline where your choices affect the outcome of the game. Good replayability because of the story choices, character classes and the different races background storylines and starting areas.",
            "review_score": "1"
        },
        {
            "review_text": "A Role-playing game; Reminds me of a narrow, small, closed version of WoW.  Want to be a tank? be a soldier, want to be a mage? take the role of a healer, damager, or illusionist. To get the most out of this game, i had to play as a Rogue (Assasin or Archer) . It had a replay value of 2 times for me with the DLC.  I recommend it's worth at 5 dollars, in my opinion. Does not compare to The Elder Scrolls Games. ",
            "review_score": "1"
        },
        {
            "review_text": "If you think you know What RPG is before playing this game... Pay and think again.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time, solid bioware RPG, excellent mods, great storyline.",
            "review_score": "1"
        },
        {
            "review_text": "Fantiastic story, characters, graphics, and combat. The mythos is very derivative from Tolkein fantasy, but a very enjoyable game to play.",
            "review_score": "1"
        },
        {
            "review_text": "Now this is a great game, shame about the abomination the sequel was.",
            "review_score": "1"
        },
        {
            "review_text": "This game had such an awesome story that I played it 3 times. It was my favorite game that year, and one of my favorite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Really loving this one :-)",
            "review_score": "1"
        },
        {
            "review_text": "great game very pleased with the story and gameplay",
            "review_score": "1"
        },
        {
            "review_text": "One of the most intelligent RPG's to date. This game takes linear story-telling and throws it out the window....then backs up and runs over it with the most dynamic combat I've experienced. Tactics are essential and mid-battle switchups and re-thinks will always keep you fighting with conviction. Switch which player in your party you'd like to play and switch back anytime! What!? That's amazing!  This game gives you the freedom to make friends and enemies as you see fit and rewards/punishes you accordingly. Choices echo throughout the story and combat never slows. Dungeons and castles and forests abounding, this is an epic you should not miss. Fantasy gaming will try hard to rival this game but I doubt that will ever happen.",
            "review_score": "1"
        },
        {
            "review_text": "The Best RPG of the past lustrum (2005-2009). In about 50 hours of classical Bioware's old-school gameplay you will know the most fascinating story, most naturalistic characters and most ultimate bloody combat intensity in the entire genre!",
            "review_score": "1"
        },
        {
            "review_text": "I originally owned this game on Xbox 360. I played it and fell in love with the story, characters and mechanics. I loved the game so much that I decided to purchase it on Steam, when I moved from Xbox. Needless to say, I am enjoying it again on Steam, and loving the new pc mechnics. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty magical, and plays like a lot of older rpgs. :D",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. 10/10 - Would take out to dinner and make sweet love to again and again.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic Bioware RPG. Get this one under your belt so you can Play Dragon Age: Inquisition...",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much a Japanese dating sim, except with less blood.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Just don't buy the second one :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game ",
            "review_score": "1"
        },
        {
            "review_text": "Didn't know what to expect when I picked it up at launch. I was always a fan of Bioware RPG's ever since Baldur's Gate. This is like a mixture of KOTOR but with the tactical element (especially on nightmare difficulty) of Baldur's Gate. Definately a throwback to the good old days of Bioware.",
            "review_score": "1"
        },
        {
            "review_text": "The game overall was very enjoyable, and was very identifiable as a Bioware RPG. The gameplay will be thoroughly enjoyable for those that like micromanaging characters, and really having control over your team. At times this aspect could become tedious, but I happen to enjoy that about Bioware games. Many of the characters in the game are a little trope-ish and predictable. The dialogue options were also a little deliberate and at times left you feeling stuck between things you didn't want to say. The in game (out of combat) dialogue between your team members was simply briilliant and really added to the depth of the characters. The main plot of the game seemed predictable at times, but did manage to maintain a sense of purpose during gameplay. Again, the game overall was delighfult, and the minor pitfalls did not greatly detract from the game itself. I would give a 9/10, and recommend it highly for those that enjoy RPG's.",
            "review_score": "1"
        },
        {
            "review_text": "Everything about this game is excellent, from the characters to the story, with the exception of boring gameplay. You will find yourself wasting time with lazy level design and boring rehashings of the same enemies for more than half the game. Unless you enjoy the late-game grinding in MMOs, you should probably pass on this game.",
            "review_score": "1"
        },
        {
            "review_text": "The only 'Ultimate' Edition of anything I've every bought. Totally worth the asking price and a steal if it has any kind of sale. Probably close to 75 hours+ of playtime.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs I have ever played. Very long, very tactical and the ability to really customize your character and the origin story is brilliant. I took several different characters through the story because I wanted to experience it from the different view points of each.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG's I have played. Worth a dime or two.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games I've played. Has a really well done story and the companions are all so differect and realistic. EA did a great job with this.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, Has some glitches, Although if you like Oblivion you may not like this game, its not as 'free' , what i mean by that is, you can only go to certain areas, an traveling is more so a map laid out an it goes there for you.  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs of all time",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, Epic, Bioware masterpiece. I highly recommend it, lots to do and see in this fully realized and very different take on classic high fantasy! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game that I've played in the last 5 years. If you liked Knights of the Old Republic, then you'll love this.  This is part one.. Dragon Age 2 sucks balls, do not mix them up LOL",
            "review_score": "1"
        },
        {
            "review_text": "DUMB AS HELL DLC ADVERTISEMENTS IN GAME SUCK AT GAME IMMERSION!",
            "review_score": "1"
        },
        {
            "review_text": "Different stories for different character for different class for different choice we make either good or bad.. Love this game, until now still played it... :D",
            "review_score": "1"
        },
        {
            "review_text": "To date, this is one of my favorite games. I was absolutely enjoying every minute of it (even the fade!). I played through origins, awakening, and all the DLC. 203 hours. If it weren't for the bazillion other games I have in my queue I'd probably reply this one a bit more.",
            "review_score": "1"
        },
        {
            "review_text": "fun and better on computer the consule",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely superb RPG. It has a good storyline, and the gameplay is pretty great. Combat is strategic, and it's overall pretty sweet.",
            "review_score": "1"
        },
        {
            "review_text": "a very good game",
            "review_score": "1"
        },
        {
            "review_text": "At first i was like :   gonna buy this just to add more game to my library   so i opened the game and started playing , to be honest my first glance of the game is probably like this:   ugh what an ugly graphic's and whats with the strategy thingy, How do you even play this on consoles????   around 6 months later inqusition came out  seeing the review and stuff and looking back to origins,   i suddenly notice i've been playing this game wrong this whole time  . then i start my long running gameplay and to be honest, this game is now one of the best game i played so far  also highly recommended this game and a really fun rpg with a good story line as well   and still a better romance than twilight  ",
            "review_score": "1"
        },
        {
            "review_text": "An enthralling dark fantasy adaptation of Mass Effect's story and character-driven rpg formula. Avoid the sequel like the plague, though.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far my favorite game! From the Character Creation, down to the final part of the game, I love it! The atmosphere fits perfectly to every location, the structure and design of the areas are amazing, and the music is some of the best I've heard in any game! It can make you feel extremely sad during one part and be able to relate to the characters, or pumped up to run into battle to knock some heads in a blind rage to get revenge! The controls are perfect and the interface is laid out in a way that's very attractive to the eyes. Everything about this game is really interesting. I recently sat down on a new character, for the Human Nobel Origin, and explored everything and anything that I could. It was then, after playing the game multiple times with every Origin, I began to discover more and more connections about what happens later in the game, and it made my playing experience even more enjoyable! The characters are very interesting and well thought out, some characters I really wish I could have learned more about! The banter between character is hilarious! I've found myself laughing out loud for longer than I probably should have multiple times. This game also has TONS of replay value, there are a lot of choices you probably didn't choose in your first playthrough, that you can choose in another! (During one of your playthroughs, keep your full subtitles on, there are some conversations that you wouldn't other wise catch from NPCs around you. Some of them are pretty funny or really informative!) If you're on the fence about this game, get it! You won't regret it! I give this game a 9/10!",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time rpg games. I have spent over 70 hrs in it.wow.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of my all-time favorite RPGs. I used to play it my my xbox, and now I had to buy it for my computer.  Graphics are not that great, but the story is fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "Bioware does it again! One of the best games I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "This game will occupy all of your time. Literally 100's of hours of your life.",
            "review_score": "1"
        },
        {
            "review_text": "This is a magificent game. The story is rich and the characters are fleshed out.",
            "review_score": "1"
        },
        {
            "review_text": "Didn't thin it was going to be good... Glad i bought it any way! it is a fantastic game with very strong characters!",
            "review_score": "1"
        },
        {
            "review_text": "Hoe the ♥♥♥♥ to i get this other dlc ffs :L P.S. love the game",
            "review_score": "1"
        },
        {
            "review_text": "Mods on",
            "review_score": "1"
        },
        {
            "review_text": "Great game, really got me into RPG style games.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty good game if you like RPGs. The difficulty scales rather well and it can get quite tactical depending on your party composition. The characters are say some interesting things and have a decent background, though they're quite predictable as if they just assigned them each a theme and stuck to it.  If you're a fan of RPGs I would reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This was my first cancerous RPG. I have very bad memories of DA:O, so I might be biased (and the game is also a bit older), but I highly friggin hate it. Take the choice-based story system from Mass Effect, add worse depth and some lore behind it, plus a turn-based combat that functions like a potato, and you have Dragon Age: Origins. If you don't play it, your pretty lucky. Because that captures the atmosphere of the game great. This is a crap old-fashioned Bioware game, before the more modern influences like D̶L̶C̶ DA:O money grabs",
            "review_score": "1"
        },
        {
            "review_text": "Really good if you're looking for those old-school RPGs with modern elements. The story is OK, the characters are top-tier and the combat mechanic is OK. It offers quite a lot of challenge even on medium challenges, so if you're looking for these then the game is probably a really good pick for you.",
            "review_score": "1"
        },
        {
            "review_text": "One of the classic old bioware RPG's. Well, what does that mean? It means that you have a ♥♥♥♥♥♥♥♥ of conversation options, for one. Interesting twists and turns, and well written characters. An incredibly good game, and one of my faves. Overall, solid 9/10 Morrigan best waifu.",
            "review_score": "1"
        },
        {
            "review_text": "Old but good. The only DA I can afford.",
            "review_score": "1"
        },
        {
            "review_text": "A nice return to the Bioware of old. Feels like a Baldur's Gate game, which is always a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "I remember playing this game for months when it originally came out and truthfully I don't think I have come across another game that has pinned me in front of my computer screen for so long periods of time. And believe it or not, Dragon Age: Origins, for me, to this day holds up as one of the best RPG-s ever released. BioWare did a nice job. The overall feel, storyline and voiceacting are still something that never ceases to amaze me. Only thing I can complain about is the combat system that is too much MMO-like (cooldowns etc.) for my tasting and a lot of things can go wrong really fast, but there's a lot of combat in this game so you'll get used to it.  Highly recommended for people who haven't played it yet and also for people who have spent many hours playing it years back - it's worth picking up again.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting, fascinating and an addicting rpg!",
            "review_score": "1"
        },
        {
            "review_text": "Good RPG with great depth and variety in party composition/character composition.",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't call this the Holy Grail of fantasy RPGs, because that implies it's difficult to find, and it's not. But if it were, it'd be the Holy Grail of fantasy RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "  just started...ok maybe a bit late...but i go it too for free and now im glad i did...hooking story...fighting can be a bit clumsy but its forgiving in the begining....get it free or cheap and you cant go wrong :)",
            "review_score": "1"
        },
        {
            "review_text": "Classical RPG, best game of Dragon Age series Imao. Should try every one, who interesting this type of games. DG:Inquisition&lt;DG:II&lt;Origins. I belive Bio Ware will make game better then Origins. P.S. sorry for my english, if u find some mistakes. I'm russki syka bljad.",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games of all time and certainly for this genre.",
            "review_score": "1"
        },
        {
            "review_text": "The game is real good even though the graphics are outdated.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs I've ever played.  Wish I could be Alistair's friend *sighs*",
            "review_score": "1"
        },
        {
            "review_text": "The best RPG I've ever played. The combat is fun and works for both strategy fans and action fans, the story has an epic scale and, best of all, the cast of characters is really likable. There's so many things to try in the game that I always want to play it again.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, It's a very very very excellent game!!!!!!!  Never ever miss it! The reason why I do not recommend buying this is because that this version contains no DLC which also you cannot buy. However, the Ultimate Eidtion of DAO has all DLC, so if you want this game you should pick the Ultimate Edition version!!! Or, you should go straight to Origin paltform to purchase this game, besides you can use the Dragon Age Keep more handily. Though Origin platform is not very friendly to users somehow....",
            "review_score": "-1"
        },
        {
            "review_text": "Since I didn't have many other PC games at the time, this was the one I played the most. Bear that in mind when you see my 75 hours playtime. I bought this since I'd played Neverwinter Nights by BioWare and enjoyed it greatly, liked Knights of the Old Republic well enough despite its shallow and predictable story with flat characters, but was disappointed with Jade Empire -- it seemed rushed and incomplete.  For the longest time, playing this gave me vague hints of deja vu. I knew that the interface and gameplay reminded me an awful lot of World of Warcraft, so that wasn't the source of my unease. After 75 hours of suffering my irritating emo companions and doing fetch and deliver quests typical of MMOs, I finally realized: it was the same plot setting as Jade Empire, and to a lesser extent, KotOR. 'You are the last jedi/martial artist/gray warden of the council/dojo/demon-blood-drinking-cult, and it falls upon you to save the galaxy/empire/world!'  Okay, so it's not an uncommon setting, but BioWare just does such an astounding, jaw-dropping job of rehashing stereotypes and making them even more bland and hackneyed than previously believed to be scientifically possible. In a sense, it's an amazing achievement, but I can hold more appreciation for 'World's Largest Ball of Dryer Lint.'",
            "review_score": "-1"
        },
        {
            "review_text": "I know it says I spent 317 hours playing this, but I really just left the game running a lot because it's really boring so I'd have to take breaks and it loaded up slowly on my old machine so I just left it on.   This game is alright, I suppose. Nothing groundbreaking, some parts of it feel exceptionally generic, other parts are more interesting. Some of the party members stand out, particularly Morrigan, Sten, and Oghren. There's some royal skullduggery that you can take direct part in, but it happens only after a lot of rather tedious questing.   I think a big problem with Bioware rpgs these days is that they set you up for big decisions that don't really have that much of an effect, you can *kinda* decide what side you're on, but the end game isn't going to change. It's not as bad as Fallout 3 in that regard, but it's not great.   I believe your time is better spent with other CRPGs. This game doesn't do anything those don't do better. Consider some infinity engine games, I personally enjoy those a lot more. I will concede, however, that the Dragon Age Awakening expansion is fantastic. It's the best Dragon Age experience I've had (and I did play DA:II all the way through.) If awakening was standalone I would recommend that, as it doesn't try to shoehorn you into a ham-fisted 'epic plot' and instead just does strange things. If Bioware was ever listening to me, I'd tell them to dump their 'main' plot and focus on the Darkspawn-Archdemon-Fade-Dwarf lore exclusively.   Origin's story is hella predictable. It's only specific quests that showcase some nuanced writing, particularly the stuff involving the dwarvers and the mages. Meh all around, in my opinion. I remember that this won RPG of the year over Demon's Souls in 2009 and that really ♥♥♥♥♥♥ me off at the time. I'm not so salty any more, but I'm still not sure this is worth your time. There is much better out there.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this, This version of the game is broken and will not run on most PCs. Please find this game somewhere else as EA refuses to support it on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Arggh, the combat controls.",
            "review_score": "-1"
        },
        {
            "review_text": "I was on the fence about this game for a long-♥♥♥ time. I'm a sucker for this style of game; say what you will about them, nobody really makes 'Bioware RPGs' like Bioware does. So it scratches the itch that Mass Effect 1 started me feelin' (and ME 2 and 3 destroyed completely, ♥♥♥♥ those games). But in the end it just doesn't have the staying power it needs for me to recommend it in good conscience.  Here's why. It feels like all the effort that went into this game was put into the first 4 hours of playing it. I was initially very impressed with the setting, the characterization, the writing, the way party members interact, the combat mechanics, the level of difficulty etc. But don't be fooled! Once you get access to the world map and have the ability to choose where you're going, the pacing falls apart, followed swiftly by all the rest of it. Party members don't have interesting things to say in the field after a while. Dialogue trees get exhausted quickly, and then nothing else happens with them at camp, either. You've got some token 'romance' ♥♥♥♥♥♥♥t in there that's that borderline-offensive 'relationships end after you go to bed with them because sex = you win' crap. There's some choices to make, but they have no real impact. There's some things you can do in a place that affect another place, and you'll go 'oh hey i remember that', but then that's it. That's the whole payoff. Combat gets really simple and repetitive once you adjust. It all just starts feeling like gray paste, like going through the motions ticking boxes. Which is exactly what the ♥♥♥♥ing developers did, so screw em.  Granted, I have like 75 hours on the books with this game, too. So I guess you could say I got my money's worth? I never did beat it, though. I just played through every possible permutation of origin story. Farthest I ever got was having like 3 or 4 of the main town hub areas' story quests completed. I lost interest every time, until the next time I'd start it up after I forgot about how boring it was. Also it bears mentioning that the graphics options don't include like, ANY of the COMPLETELY STANDARD pc gaming options. Like, say, if you want to turn off or turn down shadows independently from particle effects? Nope, ♥♥♥♥ you! You get 'low', 'medium', or 'high'. One slider bar, for the whole game's graphical quality. Who even does that?",
            "review_score": "-1"
        },
        {
            "review_text": "One of the klutzy games ever",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to get into this game, after reading reviews here and there on the web, to discover the story and possibilities on offer... But I gave up because the fighting mechanics are just infuriating. It feels like Bioware kept only the downsides from Kotor fighting system and left out all the good parts. Fighting is just total chaos, with party member way too eager to rush to their death, isolated from teh rest of teh party. A shame really.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a very boring story and a deeply learning curve which makes you feel lame to learn it. There are six characters to choose(3 Male and 3 female). Every characters has their own pros and cons, The only best part is that you can customise the character easily. I played it only an hour and perplexed what to do and where to go. You have to search for a quest and complete it. Every quest will give you a new power which you can add to your limits.. I really don't know if i reviewed this game too early or not but it forced me to do so. I will try to play it bit more and see if i find anything interested in it or not and edit my review.",
            "review_score": "-1"
        },
        {
            "review_text": "Becomes an exercise in frustration. Monotenous combat and annoying party NPCs (how dare you rescue all the children!) make this a pretty boring experience. Brings out all the RPG OCD traits in me (potion hording). Better to play something like Fallout 3.",
            "review_score": "-1"
        },
        {
            "review_text": "i love this game... i love this game to death this is my favourite game of all time and i will fight anyone to death before even admitting a single fault in this game. having said that DO NOT BUY THIS GAME BIOWARE AND EA AND STEAM HAVE GONE TO FAR. YOU THIS GAME IS LYING TO YOU YOU WILL NOT GET A COPY OF THE DLC'S WITH THIS. THE REASON YOU CAN'T BUY THE DLC'S IS BECAUSE YOU NEED TO GO TO A SEPARATE BIOWARE WEBSITE TO DO SO. ♥♥♥♥ THOSE GUYS AND THEIR ♥♥♥♥♥♥ BUSINESS PRACTISES",
            "review_score": "-1"
        },
        {
            "review_text": "Meh. Possibly just not my cup of tea, but the combat style in this game bores me. I couldn't get into the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Steam really needs to add an 'in between' button for recommending games....  I couldn't help but feeling like I should be playing Neverwinter nights 1 or 2 instead of this the whole time I was playing. It just feels like a lesser version of them.  The combat is just dreadfull. You can either control one character at a time in real time, or zoom out and try a more tactical approach. The thing is, it wont matter which you choose as combat lacks any meat. Your decisions on the battle field bearly matter. I think the bigger problem lies with the leveling system and the skills. They are so basic and boring and offer little choice as to how to build a character. Chances are one rogue will be 99% similar to any other rogue. In a game like Neverwinter (Not the dumbass free to play one on steam) there was meaningfull choice to be had when creating builds and leveling characters. I would spend hours just thinking about different builds.  The battles often feel like a 'staring at healthbars until one gets to low so I pause and give them a health potion' over and over again. As far as I have seen so far there are no healing spells or really much support spells. There isn't really any interconnection between players at all.  So that leaves 2 things that would keep you playing. The story, and the character building/dialogue.  So lets start with the story. I still have a good 25 hours left to play according to  Howlongtobeat.com  so I havn't seen all of the story. That being said..... I dont really care if I do. Its not a bad story but its been done before and there isnt much new to it. Basically a bunch of bad people are coming to kill everyone and you are the only one who can stop them. So you go from place to place amassing an army to fight them. Honestly it feels like Lord of the Rings. Its not a terrible story and I didn't really mind watching/listening to it, but there isn't anything there to make it different enough for me to WANT to hear the rest of it.  Then there is the characters. At this point in the game I have unlocked 4 people. Again, they arent terribly written and do actually have some amusing and interesting dialogue. Honestly its the only thing that kept me going for as long as I did. However, your choices dont really have any noticable impact (at least not to the point I got to). There is a influence system in the game where characters like or hate you depending on your actions but aside from them possibly leaving if they hate you enough... there doesnt seem to be anything to it. There is a romance option but its just ends after taking someone to bed and doesnt actually change anything.  One of the issues of this system is that it is very easy to abuse. You can only have 3 people in your party at a time which I think is fine for combat but when you are in cities it creates a huge problem. Let me give you an example.  One of the first villages you get to has a merchant who has raised his prices to the point of extortion. You have a few options here. You can be on his side for some coin and drive off the crowd, persuade or intemidate him to behave, or do nothing at all. If you drive of the crowd Party member A approves of your actions and you gain plus 3 influence with them but Party member B hates it and gets -8 influence. If you persuade the salesman to lower his profits and sell at a reasonable price Party member A Hates it -8 and Party member B likes it +3. However! All you need to do is take either part member A or party member B out of the party and replace them with a character that doesnt care about this situation to get the outcome you want.  That is kind of ♥♥♥♥♥♥. I think that it would have made the game MUCH more enjoyable if dialouge acted as though all party members were present. This would cause not only more interesting options, but it would mean your choices actually matter.   I would have also liked to have seen some situations where your influence with a character did something. Say for instance at one point in the game you and person A walk off from camp to talk alone at X point in the game. Then a bandit or something attacks you. Now depeding on your influence with party member A they would either push you out of the way to take the attack themselves (high influence), Fight the bandit after he has stabed you and run him off/kill him (medium influence), run back to camp to get help (Low influence) or even they planed the attack themselves and the steal some money from you and run off (Critical influence). Just an example.  I just cant see a reason to play this over something like Neverwinter Nights 2 which is an amazing game with great combat and what I mentioned above. Granted its not on Steam anymore for whatever reason which kind of sucks but you can still get it on GOG. I am actually curious to see what Dragon Age 2 did to ♥♥♥♥ people off so much but seeing as its not on steam I may not ever get around to it.  Which brings me to my last point. In your base camp a person appears with a quest above their head. 'Neat' I said, 'I wonder what he wants?' Only to find out its bloody DLC and it wants to to sign in to a EA account to pay for and download some dlc quest. Nothing breaks the fun faster than a paywall. Keep DLC on the ♥♥♥♥ing store and out of the game please.  I am not sure if I am going to finish the game to be honest. I may play a few more hours and if nothing changes I will just call it a day. Maybe I will trying finding a lets play with some ammusing comentary to see the rest. Who knows.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is mediocre",
            "review_score": "-1"
        },
        {
            "review_text": "37 minute's in the game still thinking why there is no spell to play with which doesn't friendly fire at ducking character creation page that's just not have you make a good game.",
            "review_score": "-1"
        },
        {
            "review_text": "Any Witcher is better",
            "review_score": "-1"
        }
    ]
}