{
    "app_id": 18000,
    "name": "Precipice of Darkness, Episode One",
    "release_date": "2008-05-21",
    "developer": [
        "Hothead Games"
    ],
    "publisher": [
        "Hothead Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Comedy"
    ],
    "achievements": 12,
    "positive_ratings": 394,
    "negative_ratings": 42,
    "price": 5.99,
    "description": "On the Rain-Slick Precipice of Darkness, Episode One is the first installment in the RPG-Adventure game series based on the web comic Penny Arcade. Create your character in the classic comic style, and join Gabe and Tycho in the alternate 1920s universe of New Arcadia, where you'll combat savage enemies, solve mysteries, meet bizarre new...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/18000/header.jpg?t=1447351344",
    "minimum_requirements": "OS: Windows&reg; 2000/XP/Vista&trade; with latest updatesProcessor: Pentium&reg; III, AMD Athlon&trade; 1.0 GHz or betterMemory: 512 MB of available system memoryGraphics: ATI Radeon&trade; 9500 or better, NVIDIA GeForce&trade; FX 5200 or better, Intel&reg; GMA 950 or better with 64 MB of video memory (shared or dedicated)*Sound: OS-supported sound cardHard Drive: 350 MB of available hard drive space (185 MB installed)Input Devices:  OS-supported keyboard and mouse *All video cards require latest drivers supporting OpenGL&reg;.",
    "recommended_requirements": "Processor: Pentium&reg; IV, AMD Athlon&trade; 1.5 GHz or betterMemory: 768 MB of available system memoryGraphics: ATI Radeon&trade; or better, NVIDIA GeForce&trade; or better video card with 128 MB of video memory*Sound: 16-bit stereo- or surround-capable sound card with latest drivers",
    "reviews": [
        {
            "review_text": "'The Fruit [Fornicator] robots I battled in the first level offering a glimpse of this vulgarity in action, spraying me with a 'yellow juice' attack and furiously humping the orange I threw to distract them.'  A robot enemy that ♥♥♥♥s an orange and basically pisses on you for an attack. If that level of mature humor and ridiculous silliness doesn't draw you to this game, then nothing will.",
            "review_score": "1"
        },
        {
            "review_text": "Quick and ironic game that you can find really cheap on sale nowadays and doesn't require you to read the web comic to enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent turn-based RPG in the vein of Costume Quest, combining the humour of the Penny Arcade comic and the irreverancy of the creators of DeathSpank. Highly recommended. If just to have an ordinary cat as a supporting character...",
            "review_score": "1"
        },
        {
            "review_text": "Fun point and click game. Lots of inside jokes for fans of the online comic. Plays like a game that the 'Castle' guys might have put together had we gone into video games back in the day. Well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Penny Arcade RPG  That should be enough to sell most. If you're not familiar with the PA humor, you may not get a lot of the in jokes and references. But PA comic fans will be delighted to see all their favorite characters show up in this RPG and get to enjoy loads of references.  I originally owned it for Xbox 360 and re-purchased it on Steam just to support the game.",
            "review_score": "1"
        },
        {
            "review_text": "Are you a Penny Arcade fan? No? Then avoid.",
            "review_score": "1"
        },
        {
            "review_text": "Precipice of Darkness marks the first of a series of games staring the duo from the popular Penny Arcade web-comics. Verdict, a very satifying start. Story- you create the lead character and go on a quest for vengence on a giant robot that steps on your house. On the way, you join Gabe and Tycho, two paranormal investigators, in investigating strange phenomenon around town and ultimatly stop a strange cult of mimes from resurrecting an ancient god. The story combines a mix of Lovecraftian mythos with off-color humor and memorable characters (including your own) in a darkly funny story. Though the begining of a saga, the story is quite short and can be beaten in a few hours. A- Graphics- This is state of the art graphics... as of early release PS2 era. There is really nothing to boast about visually as the whole project was a low buget indie game. Its not ugly to look at but just nothing to write home about. The cinimatics though are in the style of the web-comics and were entertaining enough to look at but all in all, below standard. C- Sound- Music is nicely done but does not really stand out and the game sound effects work well but are fairly standard. Though I will give props to the only voice actor in the game as performs his role exceptionally well, even making me crack up several times in the game. B- Gameplay- This game works on a P.O.C. format that works well enough, but feels kinda clunky. The game would benefit well with controller but unfortunatly doesn't come with that option. Also I find that if I click on a spot with some objects in the way, the characters will run into the object and continue to do so for a couple of seconds before giving up, it was kinda annoing. The battle sequences, though, are very fun and provide a fair amount of challenge as you are forced to multi-task between several characters at once. It does take a little getting used to but it provides a less static battle format compared to other popular RPG's. C+ Overall- The game does suffer several flaws such as control issues and short play time among other issues. I found it to be a very enjoyable and entertaining experience worth recommendation. C+",
            "review_score": "1"
        },
        {
            "review_text": "Quite a unusual story that brings you the back alley of the weirdness. The game was really pleasant. A bit too short but worth the price!",
            "review_score": "1"
        },
        {
            "review_text": "A hobo proudly told me that he majored in Philosophy. 10/10  A point-and-click RPG that took advantage of my love for stupid humour, RPGs, comics, swearing and scouring every nook and cranny of a game world. Lots of laughs. Clever situations, battles, characters, and items. Lots of hidden stuff (especially stupid comments). Makes you feel like you're part of the developers friends group. I started the second episode less than an hour after finishing this one.  Still dwelling on the identity of the narrator.",
            "review_score": "1"
        },
        {
            "review_text": "Kill ten rats the video game",
            "review_score": "1"
        },
        {
            "review_text": "funny game, really like it!",
            "review_score": "1"
        },
        {
            "review_text": "Precipice of Darkness is an extraordinarily humorous adventure, riffing on Chthulu mythos, nerdcore humor and simple, yet adorable RPG mechanics. You are going to love this. ",
            "review_score": "1"
        },
        {
            "review_text": "On the Rain-Slick Precipice of Darkness is a mix between a point and click adventure and a party turn-based RPG. Or at least that’s everything I gathered in 17 minutes of gameplay.  I was in the mood to play something a little bit more hands off, and very light hearted; this game fit the bill perfectly. The character creation was stereotypical and exaggerated and the opening cinematic reminded me a lot of the Wallace and Gromit Telltale series. Sadly, I could not deal with the abominable performance issues for that 18th minute. The cutscenes were fine, but the moment the actual game engine took over my framerate tanked to 20 and never managed to make it past 30. This game is not a bad looker, but there is no excuse for this kind of laggy mess.",
            "review_score": "-1"
        },
        {
            "review_text": "Did anyone actually have the patience to go through this?",
            "review_score": "-1"
        },
        {
            "review_text": "wtf is this ♥♥♥♥ ?",
            "review_score": "-1"
        },
        {
            "review_text": "wouldnt buy that again",
            "review_score": "1"
        },
        {
            "review_text": "This entire series is gold! Shows that you don't need fancy graphics to make one hell of a good time.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, funny as all hell. you will also love the other 4 episodes also.",
            "review_score": "1"
        },
        {
            "review_text": "Good short RPG. Interesting gameplay, funny.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun, albeit brief, romp full of Penny-Arcade humor. The atmosphere is odd, but pleasing to look at, and the writing is well done. The combat is surprisingly engaging, with benefits for paying attention (and lots of button pushing). It's a nice game to play while relaxing.  My only gripe is that the game is not well optimized. I enabled the 'high' graphics settings, and I have a system that grossly overpowers what was available in 2008. Regrettably, the graphics were still stuttery and jerky at times.  I wouldn't pay full price for this game, since it's old (by videogame standards) and it only lasts few hours. If you can pick it up for a few bucks and if you're a fan of Penny Arcade, then go for it. ",
            "review_score": "1"
        },
        {
            "review_text": "Where do I begin? This game has fruit humping robots, clowns that give you the finger when they die, man-eating trashcans, and cannibalistic homeless people. At this point, you as the reader should know that this game shouldn't be taken seriously but definitely be used for a good laugh. Its Undertale and ToonTown mixed with dark, repetitive humor. I highly recommend to those with a funny bone and a need for a casual/RPG game. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "On The Rain Slick Ep 1 Is one of those games that you honestly try not like it but hours later you are still playing it. It has mature aspects to it so the cartoony style doesn't confuse those who are buying it for their kids. They use adult language frequently and one of the main enemies is called the Fruit F***er which is basically a juicer that its spout is symbolized as it's male genitals and it spends the whole battle humping the air or your character if it grabs hold. As an adult with an immature mind I loved the game. It is a good rpg whith a very fun story and great gameplay. Just so it's stated there are 4 episodes in this series.",
            "review_score": "1"
        },
        {
            "review_text": "4 stars. Put simply, this game is hilarious. Not surprising given who the creators are. The gameplay is a little lame but I would play it for the graphics and the humour alone.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT game!, once you start it its hard to stop",
            "review_score": "1"
        },
        {
            "review_text": "Classic turn based RPG style that's been done a hundred times over. Upvote only because the theme gives lots of laughs.",
            "review_score": "1"
        },
        {
            "review_text": "Adventure RPG with a nice combat system that mixes Final Fantasy with Super Mario RPG. The humor is very gross and childish though and it's a short game, but still well worth the 1€ on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Liking this episode so far,the story is okay to me,the comedy is okay but mostly is tiresome for me. In the game you gotta annoyingly restock on items a lot since enemies do not drop as much and you only get 1x item per object you smash to get a item from.  This goes on in higher lvls as well except enemies drop more items. With the bad stuff outta the way lemme get to the good stuff.  The combat for this turned based game is very well done,you rely on both strategy of using ur items and your characters to properly take down enemies.Enemies have different weakness's and strengths that you have to account for when you attack,This is where the bread and butter comes in the game.  Graphic wise the game looks charming,love the comic style they used for the npc interactions and the variety of enemies and they abilites are fun and funny yet challenging.  If you want a fresh look on turned based rpgs outside the fantasy genre, I say get the episodes in and the packs instead of seperate.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent gameplay, hilarious writing, crisp and colorful 2D/3D artwork. Everything a fan of Penny Arcade or Adventure RPGs could ask for.",
            "review_score": "1"
        },
        {
            "review_text": "This sure is a game",
            "review_score": "1"
        },
        {
            "review_text": "This sure is a game",
            "review_score": "1"
        },
        {
            "review_text": "The game crashes as soon as I start it. I would not recommend...",
            "review_score": "1"
        },
        {
            "review_text": "A great RPG with fun combat, good humour and great fun. The only downside is it being a little short.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely exceptional experience in what might first seem a more modest product. Penny Arcade has delivered one of the most entertaning, wholesome video games I've ever played. Especially considering what it's priced at, this game is not worth missing.",
            "review_score": "1"
        },
        {
            "review_text": "Shot robots enamored with oranges, punched hobos, and raked mimes over the boardwalk. 9/10  Best to pick this up during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "79/100",
            "review_score": "1"
        },
        {
            "review_text": "One-line humor with timing attack. Gets repetitive fast but the story is amusing.",
            "review_score": "1"
        },
        {
            "review_text": "I'm trying to hate on this game. I'm TRYING. Oh god, it pisses me off that they pulled the rug out from under this series. Part 1 and part 2. That's all there is. Ther is no more. Berift of life, it rests in peace. It as gone on to meet it's maker. This is an Ex-episodic game. Man that pisses me off. God, I'd love to tell you not to waste your money on this game.   But, I can't. Words do not describe how much I love the mood and tone of these games. If you read the comic, you know Tycho, and thus, at least one of the creators, loves H.P. Lovecraft's work. I hold this up as a textbook example of loving satire. No particular Lovecraftian tales are spoofed, but this is a world of dark magic (Evil Mimes, admittedly), forbidden science (Horny Robots), and sinister things lurking beyond the shadows of reality,  Give it a look",
            "review_score": "1"
        },
        {
            "review_text": "Both this game and it's sequil are well written and hillarious. The third is on it's way.",
            "review_score": "1"
        }
    ]
}