{
    "app_id": 18420,
    "name": "Crazy Machines",
    "release_date": "2008-12-12",
    "developer": [
        "Fakt Software"
    ],
    "publisher": [
        "Viva Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Strategy"
    ],
    "tags": [
        "Casual",
        "Strategy",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 98,
    "negative_ratings": 24,
    "price": 6.99,
    "description": "Turn the crank, rotate the gears, push the levers, Use the catapult, explode it, or fly it...From grilling sausages with a pulley, gears, rubberbands and a candle to firing a cannon with a basketball, these wacky brain-teasers will light up your imagination with creative and addictive fun.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/18420/header.jpg?t=1447351615",
    "minimum_requirements": "OS: Win 2000/XP/Vista                     Processor: 800 MHz CPU                     Memory: 128 MB RAM                     Graphics: DirectX 8 compatible graphics card with 32 MB RAM (TNT 2 or comparable)                     DirectX Version: 8.1 or higher                     Hard Drive: 60 MB free disk space                     Sound Card: DirectX 8 compatible soundcard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "  Crazy Machines   is a mind puzzle game. As the apprentice of a wacky inventor, complete the puzzles to achieve specific effects using a limited amount of knick-knacks.   Pros : This starts out as a fairly simple game with a low learning curve, new elements being introduced as you progress from puzzle to puzzle. You can test the effect of the solution as often as you'd like, which you'll be required to do, regularly needing to adjust your setup and check how different the effect is. The physics of the game, although not fully realistic, are close enough to help guess how most pieces work and wrap your head around it.   Cons : The difficulty isn't as gradual as it could be. You might have a hard puzzle that requires you to adjust one or more item by a pixel, over and over until it works, followed by an extremely straightforward puzzle right after. The hint system is very limited, are rarely actually help. Graphics are showing their age.   Verdict : ★★★☆☆ - It's up to you  All and all,  Crazy Machines  is exactly what it sets out to be, and there is no mistaking that it follows directly in the footsteps of  The Incredible Machines . If that's what you're looking for, you won't care about the graphics and this game has the cheapest puzzle/$ ratio of the franchise. This game is void of any action or excitement, but rather is meant to make you stop, think, observe and resolve the puzzle. If it's what you're looking for, you won't be disappointed.  —————————————————————————   This was just my opinion.   If you found this review helpful, please consider giving it a thumbs up, and feel free to check out more of my (purely opinionated)  reviews . ",
            "review_score": "1"
        },
        {
            "review_text": "My childhood is on steam BUY IT.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest childhood games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Hello,  This game is not so good. Instead of being just a puzzle game, several stages are just link to luck: you try a launch, just move an item from 1mm, and then see if the rebound is better, then get another mm to try, and so on. Just luck, no though in that !",
            "review_score": "-1"
        }
    ]
}