{
    "app_id": 18820,
    "name": "Zero Gear",
    "release_date": "2010-01-12",
    "developer": [
        "Brian Cronin"
    ],
    "publisher": [
        "Brian Cronin"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie",
        "Racing",
        "Sports"
    ],
    "tags": [
        "Racing",
        "Indie",
        "Action"
    ],
    "achievements": 45,
    "positive_ratings": 652,
    "negative_ratings": 173,
    "price": 3.99,
    "description": "Zero Gear is physically-fueled, online multiplayer kart combat madness. Deck out your kart and character before jumping into one of many different game modes. Outrageous kinematic gameplay and weapons make every round a blast. The potential for tiny vehicular mayhem has never been so humongous!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/18820/header.jpg?t=1447352797",
    "minimum_requirements": "OS: Windows XP, Windows Vista, or Windows 7 Processor: 2.0 GHz CPU Memory: 1 GB RAM  Graphics: Shader Model 2.0 capable DirectX®: DirectX 9.0c  Hard Drive: 500 Mb free space  Controller Support: Yes Other Requirements: Broadband connection and service required for multiplayer connectivity",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Think the alternate version of Mario Kart for PC. This is a fast paced, balanced game which has alot of different game modes (stunts, traditional racing, sports, arcade). You can fully customize your kart and player sometimes resulting in hilarious and ridiculous creations. It is definetly meant to be played with friends as it is way better (AI can be as smart as a banana) and there are no active servers. Hours of pure and legit fun.",
            "review_score": "1"
        },
        {
            "review_text": "The physics are terrible and the multiplayer is dead but this is a fun game to mess around in if you have friends to play with. For a low budget game it has a bit of variety. Its offers racer customization, a stunt mode, and goal mode which is similiar but is done better in rocket league.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good. Yet no servers are ever open. Why.",
            "review_score": "1"
        },
        {
            "review_text": "ONE of the best games to play with friends. Yes the charaters are custonmizable and thier cars as well. Sometimes cant have enough of this game. Just laughing",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game, but there are a few bad things to mention: 1.) There's rarely any servers. 2.) If you play with friends, and host your own server, there might be major server lag. 3.) I think it's been abandoned by the devs, so basically your going to get what you get, and you can't throw a fit.  Some upsides: 1.) There is currently a dedicated server set up by someone that runs continuously and has almost no server lag. 2.) It's extremely fun if you can get a bunch of friends together to play. Imagine Mario Karts, but on PC and focused around online multiplayer.  It's probably best to only get it if you have friends you can play with. I think this game is definitely worth the $5.",
            "review_score": "1"
        },
        {
            "review_text": "'♥♥♥♥ this Game' I give it 10/10",
            "review_score": "1"
        }
    ]
}