{
    "app_id": 1900,
    "name": "Earth 2160",
    "release_date": "2006-04-01",
    "developer": [
        "Reality Pump Studios"
    ],
    "publisher": [
        "Topware Interactive",
        "ACE"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Trading Cards"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 498,
    "negative_ratings": 238,
    "price": 3.99,
    "description": "After the destruction of the EARTH in 2150, the leaders of the Eurasian Dynasty escaped on board an evacuation fleet. Now they are fighting for the survival of the human species. Their base is one large building comprising of smaller variable parts.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/1900/header.jpg?t=1478034392",
    "minimum_requirements": "Windows XP / Vista / 7 / 8 Intel/AMD Single Core CPU with 2.0 GHz 1 GB RAM DirectX 9.0 compatible graphics card with 128 MB RAM DirectX compatible sound card 2.0 GB free disk space Broad band Internet connection Keyboard and Mouse",
    "recommended_requirements": "Windows XP / Vista / 7 / 8 Intel/AMD Core Duo CPU with 2.0 GHz 2 GB RAM Graphics Card with Shader 2.0 support and 256 MB DirectX compatible sound card 2.5 GB free disk space Broad band Internet connection Keyboard and Mouse",
    "reviews": [
        {
            "review_text": "Game welcomes you with a registration form you better fill out if you don't want to be limited to 'demo mode'. That form includes mandatory fields like: Real name, full address including postal code and country, gender, birthday.",
            "review_score": "-1"
        },
        {
            "review_text": "So, Earth 2160 it is. I first heard about the series many years ago. I only played Earth 2150 back then, but then I heard about Earth 2160 about 6 years ago and decided to try it. To my surprise, it came out to be a fantastic game. Much better, than its predecessor, the 3D setting of this game is quite revolutionary for a 2006 strategy game! I love it! And the gameplay? Amazing! You can customize your units as you wish, give them many different weapons, and level them up. Though, there are some unsatisfying things. When playing against the Alien race, the LC faction is quite weak against them. The second thing - you can't really tell what damage you are getting from the aliens... I tried all kinds of armor against them and none worked... Also, it seems like the shields aren't doing their job... they SHOULD absorb all kinds of damage... and not let any projectiles or beams through... so devs, PLEASE, patch these glitches to perfect this game! It's already a beautiful game as it is, and I STRONGLY RECOMMEND this to any RTS lover! Enjoy! :)",
            "review_score": "1"
        },
        {
            "review_text": "I remeber this game when his original realised, still i love it  Its a really nice RTS with plenty of mission's, really good challanging AI, epic plot (by the standars of his age), many diffrent units (that you can customize them to your needs) and a very good music to back up your plays  The only con i think for this game is the hard AI (personaly i love the AI ) but for new players it will be proven a bit challenging   If you buy it i hope you enjoy it :D",
            "review_score": "1"
        },
        {
            "review_text": "That's a tough one ,hard to review it ,haven't played it too much yet but as an RTS superfan ,I loved it! It has great mechanics ,the 4 factions are completely different which is just awesome ,3 different recources make the make even more fun. The only 2 things I don't like are: The graphics ,well it's an old game so the graphics are obviously outdated but for some people it may really feel annoying (Not for me though) , the second problem is that basically ,there's not tutorial whatsoever ,you should have to practice and discover the game yourself through skirmish mode. (As I did) Hell ,you have to make your own units as one of the factions which is great but might be really REALLY hard for beginners. Overall a decent RTS game!",
            "review_score": "1"
        },
        {
            "review_text": "nice timekiller RTS! only 5€...good for that price",
            "review_score": "1"
        },
        {
            "review_text": "a rather cheap and amazing game all 4 races fight and play entirely different, each race harvest 2 out of the 3 resource types, this allows for some diversity among the factions.  The UCS are a faction that is entirely populated by machines, there entire army is mechanical walkers that are usually in between the speed and Armor of their enemies. The UCS build a central hub and attach 4 other buildings to that structure their mines are built as a refinery which sends out termites that harvest metal and crystal.  The LC are a faction who ever soldier seems to be female, their vehicle style is entirely hover tanks, the fastest units in the game but not very armored. their buildings are built on top of one another as towers, while their mines are planted by the resource and mine directly from it, harvesting crystal &amp; water.  The ED build by connecting each base to a central hub, this provides their bases with a decent defense, their vehicle style is tanks they are usually the slowest but have the best armor. The Ed mine by using mobile miners that just sit on the resources harvesting metal &amp; water constantly.  The Aliens, are an entirely mobile and aggressive force moving from resource site to resource site absorbing a different resource depending upon what breed of alien is feeding, to allow them to grow in-strength and size. they don't build a base instead their morphidian units clone themselves after absorbing enough water, or metal or crystal. this also allows that unit to then evolve into a new breed of Alien soldier or vehicle equivalent.  overall a good game although still slightly flawed but the only flaw with 2160 is they took out my underground bases from 2150..",
            "review_score": "1"
        },
        {
            "review_text": "It is a simple strategy game, which pretty cool mechanics where you may have your soldiers defending posts and even taking cover in some bunkers. The mechanism to collect the provisions is also cool and interesting, even though there is not much to this.   The game plays well and looks well, so why the negative recommendation? Well, the drm is pretty bad and pretty much spoils the entire thing. If you can, somehow, endure it, then, well, you may as well buy the game, since it is pretty cheap and you can get for a pretty cheap price in a sale. But only do that if you really want to try this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Short version: Don't buy, bad game, waste of money.  Longer version: Earth 2140 was solid RTS game, Earth 2150 (TMP/LS) was very good one. Earth 2160 is awful. I'm big fan of the series, but honestly, I can't say many good things about Earth 2160. pros: + graphics + return of infantry units + experience is gained by pilots rather than vehicles cons: - balance (Morphid air fleet is virtually indestructible) - cliched story (in E2140/E2150 story didn't actually matter, in E2160 we get mix of all sci-fi movie themes you can imagine) - pitiful voice acting (actors don't even pretend to try) - missions ('good old' objectives like 'get from point A to point B' or 'gather resources and wipe enemy base(s)') - 'improvments' to good ideas from E2150 (research tree now fits into one screen, too bad it looks as if someone barfed on the screen, different armour types introduce mess and confusion rather than diversity) - soundtrack (it isn't bad actually, but there are very few tracks that are faction exclusive, it's huge step backwards compared to Earth 2150) - activation (it kind of made sense when game was released, but now it's just ridiculous, on the other hand - LC campaign is broken and, as far as I remember, multiplayer servers are down, so going through activation process is pointless) - AI (I was playing last mission in ED campaign on hardest difficulty and I was surprised how AI was 'sending small groups of units to certain death', in the same mission AI ground units were getting stuck over and over in narrow valley)",
            "review_score": "-1"
        },
        {
            "review_text": "Not as good as the Earth 2150 games. Felt more like a bad Command and Conquer clone.",
            "review_score": "-1"
        },
        {
            "review_text": "Hello, I'm really happy, you did it! Finally, on mac :) But what happen with wide resolution option? :( Its working slow on macbook white unibody mid 2010, 8gb ram, full details ~20-40 fps Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "I've played the old 2150 series (Escape from the Blue Planet, Moon Project &amp; Lost Souls) and I really wanted to like this new part of the earth series ... Sadly that's not really possible. Maybe I'm overly nostalgic from what earth 2150 has and 2160 hasn't but even as a fan of RTS games this game feels very halfhearted.   1) The Unit Editor  This is why the Earth series felt so unique: Build your own army, by picking a chassis, add weapons &amp; shields and voila. Earth 2160 even added a few extra features. Now you can add engines, armour as well as gimmicks such as auto repair drones.   In the old Earth games, shields kept you alive deflecting plasma or electro canon fire. Now armour is way more important than shields as most weapons simply bypass shields. What sounds like a great feature simply turns the game into a game of rock, paper, sicssors, lizard, spock. Either your army wipes the floor with your enemies or they get crushed within seconds. Reload, build units using other armour and try again.   Once you get to the enemy base, the game really starts showing you the middle finger. Almost all weapons have reduced damage against buildings and if you don't want to get shreaded by basic defense turrets you'll need artillery units to slowly tear the base down bit by bit. Remember how much more fun it was to have your army charge in and blow up buildings? I do -.-   2) No Mainbase / Veteran units  Remember when you could do research between missions at your mainbase? Now you'll have to do all your research during missions. It helps that each research center you build no longer gives a timebonus, but instead allows simultanious research yet in the end you're just waiting for new chassis to unlock. Very boring.  Veteran units you can take from mission to mission can no longer be picked by you, instead the game apparently randomly chooses units from previous missions as starting units. Granted, each unit now has a pilot who earns the XP and can be placed in another vehicle, but it's just not the same.    3) Hero Units  I loved 'Fang' from the previous games, so I was curious how this one would play out. Fang was pretty OP, but not as OP as the new hero units in earth, that can take out armies without breaking a sweat. Not to mention the horrible dialogues and voice acting. No idea why the games doesn't pause during dialogues *or* why I can't control units during this blah blah *or* why everyone wants to talk during attacks.    4) Bugs bugs bugs  I was stuck on a mission because I've taken a different path to my objective, not triggering a dialogue. Still not as fun as watching my units drive right next to the enemy before opening fire or simply not attacking at all despite 'follow enemy' settings and being under heavy fire. Also why does my hero move in slow motion sometimes? No idea.",
            "review_score": "-1"
        },
        {
            "review_text": "What a ♥♥♥♥♥♥ RTS! Decent story and concept, but the mechanics are god awful. Despite following all instructions, utilizing walkthroughs, and solid forum strategies, there are levels that are downright impossible on easy level without the abuse of cheat codes. THIS GAME IS A TOTAL TURD, FLUSH IT DOWN!",
            "review_score": "-1"
        },
        {
            "review_text": "This was released is 1 April, nice joke steam.",
            "review_score": "-1"
        },
        {
            "review_text": "it is so amazing I cant sum it up in words!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I expected better than a little driver saying 'On the road again!' every time I clicked to move him. And really? 'Oh no. I am hurt.' to symbolize pain?   Don't get this game. There's better out there in the genre.",
            "review_score": "-1"
        },
        {
            "review_text": "It is bugged unplayable and the difficult just makes you play a mission for 10minutes like 4 hours because emeny makes you dye fast and recharge is taking just very long.. i stopped until i finished ED and tried LC..alien are overpowered and you just spend 1-2hours mkaing effort in useless battling for an underpowered LC..i regret i did rebuy the game after losing my DVD i bought when this game was released..search google to find all the problems you will experience its not the players..its the game its unbalanced gameplay..its unbearable long play making style..  the darkness 2 took me similar lengh like i played here for 1 campain nd getting in the second one.. but i played it 2 times one easy go and one hardcore walkthrough was enjoying...  IT ISNT ENJOYING MAKING A GAME HARD AS HELL WITH A UNBEARABLE GAMEPLAY! EVEN BACK IN 2006 THERE WERE FAR BETTER GAMES LIKE 'ACT OF WAR DIRECT ACTION' WHICH WHERE PLAYABLE AND HARDCORE!!  If i would be you i wouldnt try this game you just get regretting it even if it is indeed with ncie story it doesnt make the terrible game good enough to play even 12 hours to be so frustated like i was when i was a kid not nothing what to do..",
            "review_score": "-1"
        },
        {
            "review_text": "'Hey guys, let's throw out half of previous games awesome stuff - that awesome multi-map simultaneous mission command, make gameplay so boring that there is special button which completely skips time until something happens, add godawful heroes, and try to ripoff warcraft 3 hero system with custom items, maybe add rpg-like inventory but do it as crappy as possbile. Oh and throw in awful music, and especially awful one for main menu theme' &lt; sounds about right.   Earth 2160 throws series back to the same pit of crap they crawled off while they were transitioning from 2140 to 2150. Don't get me wrong, tunneling system aside - 2150 weren't anything special either, really. It basically completely ripped off warzone 2100 just like 2140 ripped off c&amp;c. But it had playability and some interesting hooks. This game does not. Sad.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good example of a bad RTS game.",
            "review_score": "-1"
        },
        {
            "review_text": "Just like Earth 2160, but without the fun",
            "review_score": "-1"
        },
        {
            "review_text": "The stupid grid almost renders the aliens uncabable of moving. The scenario is a bad exuse to reveal to us the aliens nothing special awful ending. Creating your units is almost the same as the old but with less options. and the worst... THE UCS WHERE ARE THEY???????",
            "review_score": "-1"
        },
        {
            "review_text": "First Impressions: I'm sure I got this from an indie bundle, because I would almost never purchase a strategy on purpose. To get 'the full experience' the game has DRM that requires you to manually type in a 16 character Key, enter your name, address, and pc info, then write down and track some access code. Fun start. Presentation is kinda cruddy, though, it's an older game, so I don't expect the best graphics, but older games did a better job with what they had in my opinion (intro video to ED campaign looks fake, talking characters are just jabbering their mouths in animation). Pathfinding is non-existant - instead of the AI finding the best path in a mountainous valley, you have to manually click them through the path. My 'hero' died after the first group of enemies after I earned a squad, then my team was massacared by the next. I'm sure I'm just 'playing it wrong'. I may give this game another chance in the future, but considering I don't play strategies much, I'm more likely to look for a better game in the first place.",
            "review_score": "-1"
        },
        {
            "review_text": "Terraforming Mars, aliens threatening humanity's existance, and faction of WOMEN?!?!?! Damn, talk about a crazy ♥♥♥ future. Oh, and the Earth blew up...",
            "review_score": "1"
        },
        {
            "review_text": "got this game looking for something to do and it isnt really anything special, i am a huge fan of rts games however this doesnt realy stand against anything like starcraft of comand and conquer, if you are a fan of older rts games then you may like this game (if you can read the heavely pixelated text)",
            "review_score": "-1"
        },
        {
            "review_text": "Base building in this game is very interesting and unique for each faction. There are also customizable units. It's not very exciting, but I haven't played long enough to find anything to dislike.",
            "review_score": "1"
        },
        {
            "review_text": "i didn't enjoy this game",
            "review_score": "-1"
        }
    ]
}