{
    "app_id": 19800,
    "name": "Brothers in Arms: Earned in Blood™",
    "release_date": "2008-10-10",
    "developer": [
        "Gearbox Software"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "World War II"
    ],
    "achievements": 0,
    "positive_ratings": 303,
    "negative_ratings": 53,
    "price": 4.29,
    "description": "With its unprecedented combination of authenticity, compelling story and squad-based action, the Brothers in Arms franchise has established itself as a benchmark for military action games, receiving the highest average review scores of any console WWII game to date (www.gamerankings.com).",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/19800/header.jpg?t=1544534652",
    "minimum_requirements": "OS: Windows 2000/XP (ONLY)                         Processor: 1 GHz Pentium III or AMD Athlon (2.5 GHz Pentium IV or AMD recommended)                         Memory: 512 MB (1 GB recommended)                         Graphics: 32 MB Direct X 9.0c compliant (64 MB recommended)*                         DirectX Version: DirectX 9.0c (included)                         Hard Drive: 3.5 GB hard drive space                         Sound Card:16 bit DirectX 9.0c compliant sound card (EAX recommended; PC audio solutions containing Dolby Digital Live required for Dolby Digital audio)                         Multiplayer: Broadband with 64 kbps upstream (128 kbps recommended)                    *Supported video cards at time of release:                    ATI Radeon 8500/9000/X series                    NVIDIA GeForce 4/FX/6 series (GeForce 4 MX not supported)                     These chipsets are the only ones that will run this game. Laptop models of these cards not supported.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Earned in Blood, just like the other two Brothers in Arms games, has an amazing story.  The three games combined are simply the greatest WWII games out there. Call of Duty 2, of course, was amazing for the African campaign. But Gearbox hold the title for recreating very important battles in the Normandy region in France. I mean, if you've played the games, then maybe you've seen the extras where pictures show how much detail they put into recreating the villages in Northern France. It's very remarkable.  The story, you play as Joe Hartstock, Red, in this one. Maybe you remembered him in Road to Hill 30. Well, this game takes place alongside Road to Hill 30 as Joe is recounting his actions to SLAMarshall, a war documentarian, recording the actions of combat troops for the military. Throughout the story, Joe sees his friends get injured, change their attitude during the war, and some of them unfortunately die. But that's war.   The audio design is unreal. My dad walked by when I was playing and noted how realistic the sounds were for the rifles and panzers. The soundtrack, too, is amazing. Basically, I'm biased as hell as I already love WWII anything, but the strong character development, friendship, and tactical elements make the Brothers in Arms games some of my favorites.  9.0/10",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: If you haven't already, I highly recommend you play the first game (Brothers in Arms: Road to Hill 30) before playing this title.    Overview",
            "review_score": "1"
        },
        {
            "review_text": "best ww2 game i ever played. dont even want to waste too much time reviewing, just wanna play this game again and again. steam version is pitch perfect. bought it on sale for 5 big ones. maybe best purchase so far for me for my steam career. 9.6 out of 10. shut the --ck up and play it",
            "review_score": "1"
        },
        {
            "review_text": "this game is made to rage quit 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its almost the same as the prequel, but just now you play as 'red' which is a lame character for me lol 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Very good game Would gibe succ to devs",
            "review_score": "1"
        },
        {
            "review_text": "Earned in blood plays exactly like the first game. I didn’t like Road to hill 30, I thought it was a mediocre World War 2 shooter and my thoughts on that game carry over to this one too. Again the great voice acting and the decent story save this game from being a disaster but to me, it doesn’t save it from mediocrity. Knowing that the game plays exactly like the first one before playing it, I played it on easy this time to get the game over and done with and just see what the story offers, and the game ends up being less than 4 hours. I’m not sure if this was a standalone expansion to the first game, because it sure plays like one.  4/10 (Mediocre)",
            "review_score": "-1"
        },
        {
            "review_text": "Story and the concept of the game are good. This game has some major issues though. The Allied AI is atrocious and causes a great deal of frustration, furthermore the game is riddled with artificial difficulty. A good example of this is the fact that a lot of times when you clearly should have hit an enemy you actually miss. This is mainly an issue if you try to for example shoot an enemy in the head when he pops out of cover. I guess is a way to force you to use the flanking mechanics the game has, but it's still very frustrating.  If you want a good Brothers in Arms game get Hell's Highway.",
            "review_score": "-1"
        },
        {
            "review_text": "An indeed awesome game, the combat is intense and challingeing, however the AI of your own troops is somewhat retardet, but the AI of the germans are superb. a good war game if you like tactics and best of all: it isnt a ♥♥♥♥♥♥ port from the consoles so no gay cover system and grenade arc, its natural and making alot more sense than being able to see the grenades arc...",
            "review_score": "1"
        },
        {
            "review_text": "While much of Brothers in Arms: Earned in Blood is much of the same as Road to Hill 30 I'd wager it's a better game. You change from the shoes of Matt Baker in the first game to Joe Hartsock (who was also a character in the first game). The graphics engine is the same as the first so don't expect much change in that area. The thing that led me to prefer this game over the first were the missions and level design. Instead of endless fields with tall grass humps you get to fight in a few bombed out towns. The mission where you take and defend a chateau was probably my favorite through both games. Another wrinkle was added to where you can see above the battlefield and can place your men accordingly. I didn't use it that often but it's nice to have that tool in your toolbox. The sound design is still very good and there was a little bit more story in between levels. This is another game IMO that hasn't aged particularly well (though I discovered there are mods that handle this) but it's not a bad ride overall.",
            "review_score": "1"
        },
        {
            "review_text": "Great game as its predecessor! 'Red' is not as charismatic as 'Baker' but he is a good main character. 'Earned in Blood' is the perfect title for this standalone because it is way too hard to progress. Much more than 'Road to Hill 30'.The last two missions gave me some headache.It's tough as hell!  Every WW2 enthusiast should play BIA series.Period.  9.0/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game then, great game now... was always more realistic, dramatic, and gritty in a sense compared to MOH and COD at the time... Single player was good. But sadly the multiplayer was my favorite part. they removed the servers i guess... and changed the multiplayer completely after this one. It was truly one of a kind... Please bring back the multiplayer servers!",
            "review_score": "1"
        }
    ]
}