{
    "app_id": 19830,
    "name": "Tom Clancy's Rainbow Six® 3 Gold",
    "release_date": "2008-09-25",
    "developer": [
        "Red Storm Entertainment",
        "Ubisoft Montreal"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Tactical",
        "FPS",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 811,
    "negative_ratings": 71,
    "price": 4.29,
    "description": "Raven Shield:Command an elite multinational squad of special operatives against hidden terrorist forces. In Tom Clancy's Rainbow Six 3: Raven Shield, the third installment to the wildly popular Rainbow Six series, Team Rainbow faces the hidden global forces of a new and secretive foe.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/19830/header.jpg?t=1472142064",
    "minimum_requirements": "Supported OS: Windows® /2000/XP (only)                         Processor: 800 MHz Pentium® III, AMD Athlon™, or equivalent (1.3 GHz Pentium 4, AMD Athlon, or equivalent recommended)                         Memory: 128 MB RAM (XP users: 256 MB RAM required)                         Graphics: 32 MB DirectX® 8-compliant 3D video card with hardware T&amp;L                         DirectX Version: DirectX 8.1 or higher (DX9 included)                         Sound: DirectX 8.1-compliant sound card                         Hard Drive:  3 GB minimum hard drive space                         Multiplayer:  You must create an <a href=\"https://steamcommunity.com/linkfilter/?url=http://Ubi.com\" target=\"_blank\" rel=\"noopener\"  >Ubi.com account prior to attempting multiplayer, the in-game link to account creation no longer works, please use <a href=\"https://steamcommunity.com/linkfilter/?url=https://secure.ubi.com/login/UserInteraction.aspx\" target=\"_blank\" rel=\"noopener\"  >this URL.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "If you love this game, but have windows 10... Just follow these steps:  Fixed created by: ♥♥♥♥_A  Stutter Fix  1)Disable Raven Shield VSYNC 2)Run the game with one core  I know that those solutions have already been posted, but I realized that you have to do BOTH of them for the game to actually always work.  So here is detailed info on how to do those 2 things:  1)  Go to your RavenShield/System/ folder and open ravenshield.ini  Search for the vsync in the text file, and you will find an entry 'UseVSync=True'. Change it to 'UseVSync=False'. (Use ctrl+F to found UseVSync(...). Save and close the file.  Go to your ATI/NVIDIA Control Panel and make sure that the vertical synchronization or vertical refresh is to the option OFF or Application Specific.  That's the first part of fixing it.  2) You can do it with 2 ways:  Either disable one core by Alt-Tabbing out when the game is open, going to the Task Manager, going to the Processes, right-clicking to the ravenshield.exe from the list and selecting 'set affinty', and deselecting CPU 0.  or the recommended way so you don't have to do this each time you start the game:  Go to your raven shield folder (not the system), and create a text file there. Open with notepad and paste this:  cd system start /affinity 01 ravenshield.exe  and save the file as 'fixedstart.bat' or whatever .bat  Now by double clicking on this file will start the game single-core. You can create a shortcut for this to your desktop for easy launching.   OBS: Sometimes the game will bug your mouse, just restart the game or your computer.  OBS 2: If you are a little boring to found all enemies, press ' (the buttom bellow the ESC) and write 'route'  god - makes you invencible ghost - you can fly walk - disable flight mode godhostage 1 - invencibility for hostages godteam - you team never dies neutralizeterro - neutralize all terrorists rescuehostage - rescue all hostages (obviously) disarmbombs - disarme all bombs tsurrender - all terrorists surrender on sight fullammo - gaves you full ammo (obviously again)  Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "Best one in the whole series  PS: We need Rogue Spear on steam",
            "review_score": "1"
        },
        {
            "review_text": "The last good rainbow six. R.I.P Rainbow 6 :(",
            "review_score": "1"
        },
        {
            "review_text": "This game is the bee's knees m8. The last and best Rainbow Six Installment from back when it was still a tactical shooter and not some overrated watered down gears of duty knock off. This game will test your mettle son. It has all the things that made it's predecessors great, with some aspects improved and some neat added features like a fluid leaning system for peeking round corners and In-Game orders to relay to your team. Lots of different operatives, weapons and gear to choose from, non-linear maps and planning phase all mean a variety of different gaming experiences and gameplay styles on each map. Only problem I have with it is that the teammate AI can be really stupid sometimes as they prioritize waypoints over covering sightlines, which can suck if you are trying to go for a no-death run for campaign on elite difficulty because your m80s will buy it like a Steam summer sale. That said though it's a gr8 game, still holds up today despite being over a decade old. Tango down.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually quite good, what Rainbow Six should be. Console noobs destroyed this series, this is the last game in the series.",
            "review_score": "1"
        },
        {
            "review_text": "I have no complaints, not one. The maps are wide, open and not buggy at all. Using the weapons isn't that hard, it's fairly basic. With the incredibly fast AI and limited team members, this game requires you to be careful. Grenades should be used more frequently in single player than you'd expect, trust me. This is the only game that I literally have no complaints about. Do I recommend it? Hell yeah!",
            "review_score": "1"
        },
        {
            "review_text": "It's kind of like dust II but different",
            "review_score": "1"
        },
        {
            "review_text": "A game that measures how much of an operator you are. You best be packing all sorts of hardware before you dare ♥♥♥♥ing step into this ♥♥♥♥, you best have a plan A and plan D because ain't no one gonna ♥♥♥♥ing hold your hand when the terrorists decide to ♥♥♥♥ in your breakfast cereal and come over to your house and ♥♥♥♥ your dog.  So you best be ready to toss all the flashbangs and make sure you ELMINATE THOSE X-RAY TANGOS.  Or you could just be as swagger as me and get the USAS-12 and just bumrush it #yolo",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! I passed the whole game in 11.7h of playthrough.  I will do some pros and cons for the game  PROS(Raven Shield) -The game graphics are pretty decent comparing the game to other games from '03 -The game mechanics are almost the same as for older Ghost Recon games but it's somehow played faster then the Ghost Recons -The game is realistic, 1 shot you're wounded, 2 shots you're probably dead -You can commandeer up to 3 teams(including your own team). Red team, Green team and Gold team -No bugs or crashes -The game is forgotten but it doesn't need any updates or patches -The game is 15 Missions long. Not too long, not too short if you ask me -Community isn't dead  CONS(Raven Shield) -I don't know where to find Multiplayer games(but I have never tried to find them) -You can't jump in the game   PROS(Athena Sword) -The game graphics are pretty decent comparing the game to other games from '04 -The game mechanics are almost the same as for older Ghost Recon games but it's somehow played faster then the Ghost Recons -The game is realistic, 1 shot you're wounded, 2 shots you're probably dead -You can commandeer up to 3 teams(including your own team). Red team, Green team and Gold team -No bugs or crashes -The game is forgotten but it doesn't need any updates or patches -The game is 8 Missions long. Not too long, not too short for an expansion if you ask me -Community is almost dead  CONS(Athena Sword) -I don't know where to find Multiplayer games(but I have never tried to find them) -You can't jump in the game  I recommend it! For the Gold Edition - 7/10 would be a Rainbow Six operative again!",
            "review_score": "1"
        },
        {
            "review_text": "Yes I know I don't have that long of playtime but trust me on this, IT IS A MUST HAVE. Even on the easiest difficulty the ai is incredibly dangerous. You had better create a plan, as you can only have up to 4 guys in a team, and that makes it even more stressful when one of them goes down.  Also, download the Ravenshield 2.0 mod it makes the game even better than it already is.",
            "review_score": "1"
        },
        {
            "review_text": "Edit: Changing formatting of list.  This game is my 'Dark Souls'. It's infuriating, it has complex controls, enemies are super tough, and even with the tutorial you still don't know every aspect and you'll die a lot. But god do I love this game.  NOTE: I played like, the first level of Athena Sword and that's it. All I've played so far (mostly) is Raven Shield, which is the base game. I also played it with a mod called Raven Shield 2.0 (which you can find on moddb). I HIGHLY reccommend it, as it improved almost every aspect of the game by adding weapons, camo, ironsights, and adds nice little tweaks.  PROS:  + For a early 2000's game, the graphics are decent. Not fantastic, but you won't be looking at the game and throwing up.  + The environments are very well detailed. Even rooms that are out of the way with nobody in them are still lovingly put together. Except for a few reused missions near the end, there don't seem to be many glaringly reused assets, and as you go to different places around the world they defintely put care into making you feel like you were there.  + Good arsenal of weapons, although some are clearly not as good as others. You'll likely stick with the same few weapons for your team every time you play, but the choices are nice.  + Tight shooting. Each weapon handles fairly well and as with real life, burst fire and semi-auto will take enemies out way faster than spraying. Playing with the mod adds ironsights, but in vanilla there are none, making it more akin to Counter Strike in how you aim (although you can still zoom in slightly).  + Great tactics. Planning out your entry is always worth your time, and failing a mission can, yes, feel like utter BS, but then you can go back and study where you went wrong. You tweak your plan, change this and that, and when you're finished your plan goes smooth as butter. Even if you don't use the planning screen and go in blind (which I've done for a few), you still have a good repetoire of on-site tactics at your disposal. Order your team to burst in a door guns blazing, or maybe soften them with flashbangs, or you can tell them to go in on command so you can hurry over to a good vantage point to aid them from a flanking position. Basically, if you liked the quick tactics of R6 Vegas and Vegas 2, you'll catch on quick here.  + As always with the early R6 games, the music is fantastic. You'll get pumped up for sure.  MEH:  ~ The story is ok. Nothing special, just enough to keep you going in one direction.  ~ Limited movement. In the early R6 games you could mantle and climb, but here you can't even go up a 2 foot platform without finding stairs. You get used to it, though.  ~ Your team AI can be a mixed bag. Most of the time they're great, and they'll spot and kill enemies you didn't notice, and they have far better reactions than you (obviously, since they're not human!). A few times, though, they can get a bit irritating. (Minor Spoilers ahead, although I'll try to stay vague). There's a point where you go to stop some chemical weapons, and enemies in hazmat suits are the ones that activate them if you're spotted. Unfortunately, those hazmat dudes are 'non combatants' and thus your team members dont target them! I lost that mission so many times because my team wouldn't open fire on those enemies, simply because those enemies weren't a real 'threat' to us!  ~ While it has been updated to modern resolution settings, the main menu is still locked at like, 800x600 or something.  CONS:  - Enemy AI can be a pain. Missions with hostages can be suddenly lost because they open fire on hostages since they know you're here. Thing is, they /shouldn't/ know you're there. You'll have to be extra careful playing this game, because there WILL be times that you lost because of BS enemy AI.  - Dated controls. Be sure to edit the controls before you start playing. The defaults are hallmarks of the old R6 games, back when FPS games didn't really have a 'standard'. Things like reload set to Z, Run set to Mouse2... yeah. Not a bad terrible thing, but when I played the first mission I freaked out because I had no idea what to do.  - Little explanation of stats for players and weapons. What is 'self control'? What is 'stability'? I have no idea. Some make sense, like Stealth or Electronics, or Damage and Accuracy for weapons, but despite the game having many tooltips, they have none for those. I'm not a mind reader!   So in conclusion, its great. I love it, despite the difficulty and obtuse-ness of the game. I won't give it a number rating (because how I might percieve, say for example, a 7/10 might be different for another person). I will just say that for 10 bucks, you can't go wrong with this. Quite a few missions, plus you can replay those maps plus a few more with different modes, which might give you an extra hour or two of fun. Again, I do suggest the Raven Shield 2.0 mod for this game, because it 'modernizes' it in all the right ways.",
            "review_score": "1"
        },
        {
            "review_text": "tactical action tactical multiplayer tactical hilarity",
            "review_score": "1"
        },
        {
            "review_text": "&lt;3 &lt;3 love this game",
            "review_score": "1"
        },
        {
            "review_text": "The last great tactical shooter",
            "review_score": "1"
        },
        {
            "review_text": "Simply a classic, its hell of a good time playing custom missions. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A great tactical first-person shooter. Easily the best in the Rainbow Six series. Best played with others.",
            "review_score": "1"
        },
        {
            "review_text": "Rainbow Six 3 is considered the best installment in the Rainbow Six series by many, and for a very good reason. It is a one of the last true tactical fps's that makes a good attempt at being realistic instead of cinematic and flashy. Rainbow Six 3 is unforgiving and challenging, however, it does not solely depend on your twitch skills like many newer tactical fps's, instead you must use cautious strategy to clear each individual room. One of my favorite features in the game is terrorist hunt which gives each player in a multiplayer game a team of men that they may order to do things such as frag and clear a room. If you are looking for a tactical fps that manages to be extremely intense while requiring a slower but much more intelligent and cautious decisions than you will surely enjoy Rainbow Six 3.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest tactical game ever, the gameplay is awesome for a game of that time, the maps and the missions are real fun to do, there's a nice variety of weapons for a game of that time. I'd wish that Tom Clancy's Rainbow Six® and Tom Clancy's Rainbow Six: Rogue Spear and its expansions would be on Steam too, at least Tom Clancy's Rainbow Six® can be found on GoG.  I'm not a fan of remakes but It would be great if they could make a remake of every Splinter Cell and Rainbow Six games, on a better and more complex engine so it can be even more tactical especially Rainbow Six Vegas since it's not as tactical as the previous ones, you cannot use Ironsights in this game (except with mods) so all of those games with a new fresh air would be real great, better than Rainbow Six Siege that's for sure, still the same game not like Rainbow Six Siege who looks exactly like the recent Call of Duty games, way too casual and boring.  Anyway, great game that I would suggest to any Rainbow Six, tactical and FPS fans.  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Walked into a room and got shot. Tried to run between a buch of containers and got blown up. Enered a room and got shot. Tried breaching a room and killed a hostage. Opened a door and got shot entered a meat-packing plant and breathed poison tried to cross a street and a bomb went off. entered a room and got shot again. 10/10 game",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games signed with the name Tom Clancy 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Anyone that is a fan of Tom Clancy, tactical shooters or games where you need to think will love this. Nice mix of action and tactical thinking. Nice weapons and gadget variety and awesome concept of choosing who is in your squad and drawing out the plan in the planning phase. Has 2x as much content and takes 10x more skill than any mainsteam COD-like shooter. Multiplayer may be vary scare but it is still possible but the single player concept is great enough.",
            "review_score": "1"
        },
        {
            "review_text": "What can one say about R6:Raven shield?. Pure excellence - it's the last great Rainbow Six from the long running series, at least in terms of tactical gameplay. The rainbow six vegas games put an emphasis on action and nonstop brawl over the slow, tactically and 'smart' gameplay that dominates the 3 first games. It takes what made the first 2 excellent and further pushes it. Some still say Rainbow Six: Rogue spear is the pinnacle of the series but i still feel the 3rd installment is the best one. It gives you the tools and gameplay to push Rainbow Six as far as you want it to go. It's emphasis is more on the neutralization of targets and objectives and it's somewhat more 'intense' then say for example Swat 3/4 which has a focus on doing things with the bare minimum of violence. Rainbow Six: raven shield gives you all the tools to do what you feel works best, being less lethal takedowns with flashbangs, or the brute force tactic of breaching charges and frag grenades - all the tools are there to be played around with for one of the most interesting tactical shooters in the last 15 years.  Must buy for any tactical shooter junkie.",
            "review_score": "1"
        },
        {
            "review_text": "Ahh...the memories! When this game first came out in 2003, my friend and I played this co-op and was a nice alternative to Quake 2. This game is a thinking man's shooter, where you can plan out your 'teams' mission before you enter the playing arena. Or you can use the default plan and jump right into the action. This is NOT a game where you can take all kinds of damage or heal after a few seconds of hiding in cover.....one shot - one kill. Nice feature is when you do die, you respawn very near if not in the same spot where the 'oops' took place. If you are looking for a Run-n-Gun shooter, this is not for you. If you are looking for a tactical, near realistic shooter .......what are you waiting for ..... get it already!",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite fun. Better than some of the modern games that are released...    Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite tactical game of all time. I likely have thousands of hours amassed on my boxed copy.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best classic tactical shooters of all time, (2003) No matter how much these dev's nowdays try to clone such a great classic tactical shooter, They'll never beat the mind of (Tom Clancy) nor his Books nor his Video Games.",
            "review_score": "1"
        },
        {
            "review_text": "A realistic game, if you can call a shooter that. Exteremely quick (and in the campaing, permanent) death, slow movement and the ability to carry only one rifle, one sidearm and 6 grenades at most are somewhat realistick but don't believe it when people call this game hyper realistic. The game's immersion is broken easily by things like hip-fire reticlespread applying even when using a scope. The relatively braindead ai is a known problem, but it doesnt matter because the enemy isn't supposed to do anything else than react to hearing gunfire and fire at you when they see you. Your teammates on the other hand do just fine, because they do as they are told and don't improvise anything stupid. Except when they decide to fall off from a ladder and die, forcing you to restart the mission. The pseudo-randomized enemy placement and the sometimes unreliable teammate ai make sure that however well you plan your missions, you will need at least one retry before you get the desired no casualty -run. The fact that planning your mission can take up a good 20-30 minutes and executing the plan take a rough 5 min depending on mission. That is, if you get it working on the first try. Fixing your plan between retries can easily take up a cumulative 30min unless you have to redo the plan altogether. All that combined and you can waste an evenening just trying to complete that one hostage recue. The game can be very frustrating on the other hand very satisfying when you finally complete that one mission. Despite everything negative I said about the game, it is in my opinion an enjoyable experience. Just as a word of warning: This is not an fps Dark Souls, in this game you move a lot slower but die a lot faster. You can end up 6 feet below in a literal heartbeat. Have fun.",
            "review_score": "1"
        },
        {
            "review_text": "'Remember way back when games were simpler and yet still challenging?'  Well, this game is certainly much more challenging, but has the complexity of a game way ahead even most current games.  Take for example in Battlefield, you can open doors, well while in this you can slowly scroll the scroll mouse button (MB 3) to slowly open a door, or a shutter.   The character customization is spot on: Change your character (Individual appearances), their class, armour type, armour camo/colour, loadout (Guns, attachments, equipment, gadgets), squads (Up to 2full+1), squad commands, smart AI (allied and enemy), incredible level design, challenging missions, co-op (online with special set ups or local LAN set ups), firing range/tutorial.  Certainly there is something I missed, but there is just too much to name. Its an amazing game with amazing mechanics and tactical gameplay. Its challenging, its fun, its definetly not short, and it sure is worth your time!",
            "review_score": "1"
        },
        {
            "review_text": "All i will say is this. SCREW SEIGE YOU PIECE OF ♥♥♥♥ WANNABE! Rainbow six 3 Ravenshield will always be the true tactical shooter. no micro transactions, no halfass game, no bs.",
            "review_score": "1"
        },
        {
            "review_text": "Rainbow Six Rogue Spear and RS 3 are the only tactical shooters I know of. Even swat 4 lacks the detail in planning.",
            "review_score": "1"
        },
        {
            "review_text": "Bought Rainbow Six to play Co-op  Players can't join server.  Opened all ports, turned off firewall.   Players can't join server.  Don't bother buying this if you actually want to play with real people.",
            "review_score": "-1"
        },
        {
            "review_text": "couldn't really get into it  meh/10",
            "review_score": "-1"
        },
        {
            "review_text": "It would be a great game but ubisoft abandoned it (like every one of their games) and for 80% of the players the game is unplayable due to stupid bugs. Don't waste your money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "Mother♥♥♥♥ing old school classic. Nothing more to say.",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME GAME! You have to try! I never thought this old can be this good, but... huh. With good graphics and controls, and huge missions, this game RULES! :D",
            "review_score": "1"
        },
        {
            "review_text": "its a good game",
            "review_score": "1"
        },
        {
            "review_text": "Best Tactical Shooter of all times period.",
            "review_score": "1"
        },
        {
            "review_text": "Tactical and Tense. That's all that needs to be said about this classic.",
            "review_score": "1"
        },
        {
            "review_text": "greatest game of the century",
            "review_score": "1"
        },
        {
            "review_text": "Had it on original Xbox when it came out, now bought the Steam version to play with my friends. One of the greatest games ever made, and if you don't own it yet, my advice is to grab some friends and grab it immediately. This is one of those essential games you'll need to play on your lifetime.",
            "review_score": "1"
        },
        {
            "review_text": "You hear the slow, incessant chirp. The pause between each beep seems to get shorter and shorter, but it could be your imagination. There's a corner between you and the bomb. You slooowly ease around the wall, practically kissing your MP5 as you strain to make out the shape of an arm, a head, a sign that someone is around that corner, lying in wait for an operative like yourself.  There's no one. You run up to the bomb, and are immediately shot in the back of the head. You have no idea where it came from, no corners of your vision conveniently glowing red to give an indication of where your assassin is. You can't back out and wait for a few seconds to heal up. You got shot in the back of the head. It's over. Your man is dead. And it was your fault.  You didn't look up.  They don't make 'em like this anymore.  I've been playing this game since 2005. It has never gotten old. If I had to choose one game from my entire library to keep, it would be this. And if you're the sort of person who thinks this is 'too hard' or 'too boring,' and goes back to knife people in Call of Warfare 23 or Modern Duty 97 or something, then I'm sorry, you /are/ an inferior human being.  Tactical shooters are dead. Long live Rainbow Six 3.",
            "review_score": "1"
        },
        {
            "review_text": "Fun but simply outdated",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Epic :) Nothing to add",
            "review_score": "1"
        },
        {
            "review_text": "They just don't make 'em like they used to. All that other bull S*(# is here today and gone tomorrow, its this real ish thats gonna be fresh forever.",
            "review_score": "1"
        },
        {
            "review_text": "Please... buy this game. This is the last true SWAT tactics game in the Rainbow Six line, and I'm always looking for people good enough to join me on the SAS clan servers.",
            "review_score": "1"
        },
        {
            "review_text": "This game was one of my past time favorites. The single player was nice, but the real meat and potatoes of the game for me was the Terrorist Hunt mode. God was that AI ever so cheap. The threat of being gunned down by generic middle eastern baddies screaming 'ALARM!' as they blow your face off before the even turn around was torturously good fun. More fun with friends and custom maps. My favorite to date was clearing out a canadian hockey arena.",
            "review_score": "1"
        },
        {
            "review_text": "Old classic - one of my favorite games. Still playing it to this day.  Steams lying about my hours though - I have way more than that.",
            "review_score": "1"
        },
        {
            "review_text": "Those were the days. I played this like hell when it came out. And surprisingly, it is still as fun as it was back then. Even this is great game, somehow I liked Rogue Spear even more.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game.... I loved the VEGAS games, but this one has always remained a firm fave. Its hard as hell, but VERY rewarding. If your sick of generic shooters and want something a little more... then grab this ageless classic.... oh, and still loads people playing. yay",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME. It is very challengeing and took me 2 hours for one mission so you will definitely get your moneys worth",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game it is truely a classic",
            "review_score": "1"
        }
    ]
}