{
    "app_id": 19900,
    "name": "Far Cry® 2: Fortune's Edition",
    "release_date": "2008-10-22",
    "developer": [
        "Ubisoft Montreal"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Open World",
        "FPS",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 5292,
    "negative_ratings": 1739,
    "price": 8.59,
    "description": "You are a gun for hire, trapped in a war-torn African state, stricken with malaria and forced to make deals with corrupt warlords on both sides of the conflict in order to make this country your home. You must identify and exploit your enemies' weaknesses, neutralizing their superior numbers and firepower with surprise, subversion,...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/19900/header.jpg?t=1543258048",
    "minimum_requirements": "Supported OS: Microsoft Windows XP or Windows Vista (64 is supported) Processor: Pentium 4  3.2 Ghz, Pentium D 2.66 Ghz, AMD Athlon 64 3500+  or better Memory: 1 GB Graphics: 256 MB, Shader Model 3 required, NVidia 6800 or ATI X1650 or better* Hard Drive: 3.5 GB (Multiple saves and user created maps will increase the amount of needed hard disk space.) *Supported Video cards: NVidia 6800,  NVidia 7000 series, 8000 series, 9000 series, 200 series. 8800M and 8700M supported for laptops. ATI X1650 – 1950  series , HD2000  series , HD3000  series , HD4000 series",
    "recommended_requirements": "Processor: Intel Core 2 Duo Family, AMD 64 X2 5200+, AMD Phenom or better                        Memory: 2 GB RAM                           Graphics: 512 MB, NVidia 8600 GTS or better,  ATI X1900 or better*                         Sound: 5.1 sound card recommended",
    "reviews": [
        {
            "review_text": "I'm going to begin this review with a confession: Far Cry 2 is my favorite game in the Far Cry series.  Since that one was so well received, let me go for a second confession: Far Cry 2 is probably the least popular game in the Far Cry series.  It is my favorite game in the series because of the overall 'attitude' of the game. It is everything Far Cry 3: Blood Dragon is not. It is the very antithesis of Blood Dragon: Where Blood Dragon revels in being irreverent, ridiculous, and detached from reality, Far Cry 2 is gritty, realistic, and dark. It is a modern retelling of The Heart of Darkness, in which you play a mercenary hunting an arms dealer in a fictional African country, all the while battling malaria.  It is not the most open world. You are not a bullet sponge. Health does not regenerate, and in fact guns will jam on you based on how dirty they are. There isn't even a skill tree or a quick melee button (you have to manually switch to your machete). However, it is probably the single most immersive gave I've played in a long time if not ever, and a fantastic story takes you through a unique setting not often seen (or done well) in games.  Gameplay: Far Cry 2 is dated. It's not unplayable, but if you've recently played some of the other Far Cry games then the absence of some features is certainly conspicuous. However, the guns have punch, the player is fragile, fire is dangerous (it's a dry African setting), and the game reeks of realism. Yes, reeks. The main reasons people hated this game were because your character has malaria and because guns jam. Guns jamming is avoidable but you do have to address the malaria from time to time. It plays like a survival game, because you have to struggle to win (without it being too punishing). There's no skill tree and you have to really work for your equipment upgrades. While this isn't for everyone, if you go in expecting this kind of gameplay, you're going to enjoy the game more than someone going in blind.  8/10   Graphics/Visual Experience: While the game is old, the graphics aren't too bad. I go back and play this every once in a while and I'm blown away by some of the nature scenes. The game is truly impressive when compared to other games released at the time and that gives it some true staying power. The environment is immersive (the first game I ever actually got lost in: The first day I played it, I played it for 12 hours straight) and while it's not in the same way characters in Skyrim have complete lives, it's still capable of sucking you in if you let it. The score that follows accounts for both the game being dated but still capable of impressing me:  7.75/10   Sound: The song from the title screen is still on my phone somewhere. Guns don't always have a bassy sound but always feel like they have some punch. Ambient/background noise is done well, gives the environment some life without having wild animals like 3 and 4 do.  7.5/10   Replayability: Not as much as the later games in the series. The main draw of 2 is the immersion and story. While the environment can suck you in, it's not particularly fun to explore because you don't get the feeling of missing out on interesting things as you drive from place to place. If you're like me you'll want to play and play until you finish the story, but there is a hard ending and that also kills post-story replayability.  5.5/10   How it Runs: It's still a demanding game. I've played games released in late 2015 that made my computer run hot less often than this game. However, there are very rarely spikes in the resources the game needs to play smoothly. Physics aren't too intense, the worst the lag will probably get is when there's a bunch of fire on the screen. This is the first game with fire propagation, which they certainly wanted to show off. They actually had to set a limit because during testing, there were times when the entire in-game world was set on fire without the limit in place.",
            "review_score": "1"
        },
        {
            "review_text": "threw one molotov next thing I know Africa is on fire. 10/10 (old review)   {Please work with me as I go out of order in events because that's how it's going through my mind as I write this.}  Where to begin with such a great game? You could start anywhere really, the setting is in Africa, you enter the country (I forget if they say. [yes I know Africa is a continent]) hunting a man known as ''The Jackal'' an arms dealer and your mission is to eliminate him; to stop the gun trafficking in the war torn country, but things turn down south immediatly after your boots touch the ground you've gotten malaria (This... This was one of the annoying/funny things I found that happen in the game, I mean c'mon it's freaking Malaria no one really wants to black out in the middle of a gun fight, I mean when I did I kept screaming ''♥♥♥♥! ♥♥♥♥! ♥♥♥♥! Not now! Surely I have one more pill to keep me going!'' But alas I didn't and woke up a day later in a church now angry about the travel time I have to ensue yet again.) I digress through the events of the game you find new friends, new enemies, and many plot twist with these characters, and the currency in this game is Blood Diamonds which you find all across the map and from completing missions. If you read my little ♥♥♥♥♥♥ review from the beginning you'd understand what I mean, it's pretty ridiculous, what starts as a little fire now consumes your entire screen. Now then the combat in this game I thought was pretty well for this game because there was a lot of realism for the time for example your gun would jam and you'd have to unjam it in the middle of a firefight (now you could avoid this altogether by getting a new version of the gun from your gun stash) or you'd find enemies weapons that are so rusty that litterally sometimes after 5-6 shots after you picking it up it just keeps jamming up and you scream ''WTF'' (you will do this trust me). Let me think ah yes! The RPG's in the game quite fun instruments, but just as dangerous! You could shoot a dud and then be like me and run away screaming or sit there like an idiot... Your call... the other thing it would do is start you on fire and you can easily put it out by using the healing animation. Now then moving on to Multiplayer... Just wow the creativity of people's imagination just blew me away! People were creating maps such as D-day with such realism you could look into a history book and it look the same, I always loved those kind of people when it comes to games where you can create such things, I certainly wish I could have that kind ability or at least a little bit of it haha. Onwards we go though, the multiplayer back then was pretty fun people were nice and they also very team play coordinated (which I love in team based games instead of lone wolves {which can work depending on the game and game modes} and I don't know how it is now since I haven't played multiplayer again yet due to playing with friends with other games.  Finally my score of the game: 10/10 still. I enjoyed litterally every part of the game, the characters, the story, the twists, and also being able to find some crazy ♥♥♥♥ that goes on in here.",
            "review_score": "1"
        },
        {
            "review_text": "Brutal game. Just straight up cruel. Malaria. Guns that jam. Supplies are scarce. The hostile African landscape is crawling with soldiers who want you dead. A civil war fueled by powerhungry warmongers and funded by conflict diamonds that refuses to end, and an arms dealer at the center of this twisted web: The Jackal. Find him. Kill him.  This game gave me a Heart of Darkness. 10/10    God, I love the smell of napalm in the morning.",
            "review_score": "1"
        },
        {
            "review_text": "  My score: 8.5/10 (with  realism mod ) ",
            "review_score": "1"
        },
        {
            "review_text": "Back when Ubisoft wasn't complete sh*t and they made masterpieces. Played this back in 2009 on Xbox 360 and even to this day I still feel it was ahead of it's time. Pros: *Aged very well visually and even at maxs settings is a very pretty game. *Natively support Ultrawide Monitors and other custom resolutions. *Fire *Very uniquely written story albeit a tad loose. *Africa *Blood Diamonds *Golden AKs *Weapon Degradation that adds to the survival vibe *Foliage and environments are EXTREMELY believable and I actually FEEL like I'm in Central Africa. *Not tied to Uplay *very detailed healing mechanic that's SUPER brutal. (such as pulling twigs and bullets out of your arms and such) *Lots to see and explore.  Cons: Not much to do end game after getting all diamonds and equipment (But still have LOTS to do before then.)",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 is a open world first person shooter with some small RPG elements set in the African savannah.  You have a aim, killing the Jackal, the person who supply the African war groups with weapons and causes the whole country to suffer even more. When arriving in Africa you get driven by a taxi driver to the main city Pala. While driving through the magnificent looking landscape you see several things and also notice your Malaria. You get a Malaria attack and get unconscious. You wake up in a house in Pala and see your enemy, the jackal. He decides who lifes and dies and he lets you alive. After this you have to get out and get unconscious again after a while. You get saved by a group called UFLL. There are 2 groups who have war against each other. UFLL and APR. Who is the good and the bad have you to decide even though both are not perfect. I personally prefer the UFLL. Only my opinion though. On your way through the story you visit a lot of places and meet your buddies who help you. I wont say more to dont spoiler too much.  The gameplay is actually very nice. I love the first person weapon handling. It feels realistic and there is a big range of weapons to choose from. All being buyable in the Weapon Store for diamonds. Thats the currency of the game. You can also buy upgrades for you and your weapon. Your weapons degrade! Maybe too fast for some but for me its fine, especially with upgrades. You can change them for free in your Weapon room and 'repair' them like that. I wouldnt recommend using weapons of the enemies, they are weak and in bad quality. You often get quests to finish certain aims. The mission variety is fine even though not big. But its fine for my taste. You mostly get diamonds or medicine for completing quests. You can also find collectables in the game. Diamond suitcases with 1-3 diamonds in each and Jackal tapes. There is a incredible amount of this stuff. Also there are 8 gold AKs in the whole world. The difficulty is higher than normal. Dont try rushing over the enemy, this mostly wont work. You always have to watch out. And the health doesnt regenerate, at least not completely. You need some sort of medics to heal yourself and you cant carry unlimited of those. The open world is extremely big and you have your feet, cars, boats or the bus to reach several places. Busses are helpful for those who prefer fast traveling even though the busses just have 5 stations per map. Enough for me though. The fact that you have to travel actually I like about the game. Its nice visiting the landscape and I like this sort of oldschool traveling. Some may dont like this sort of system but I love it. While travelling you will often pass some sort of checkpoints of the enemy who will shoot you on sight. Each of those checkpoints have some special ammo or medicine. Mostly with around 5 enemies at each point. A little bit annoying about this game is the way how the Enemies respawn and hunt you with their cars after they saw you. You mostly have to kill the car until you can continue passing. Also the enemy is often faster than you. After you erased a point, the enemies will respawn fast after going away and come back and that is the most negative point about the game. I got used to it, even though I agree its not perfect. Beside of those checkpoints there are also other places which are often specially named. Places like bases of the enemy. Trainyards, camps, whatever. There are often 10+ enemies and you should watch out, most of those places you see automatically while doing missions. There are also animals in the nature, around 5 sorts of animals in the whole game. Realistic behaviour and they shun humans. I often think they could add more animals and also hunting animals but on the other hand its not as unrealistic as in Far Cry 3. The animals there are to much if you ask me.  The graphics and engine in general are amazing. I rarely saw so much realism. The whole engine simulates real world nature. Wind, rain, sun and day cycle. The graphics in general look amazing. Especially fire effects. Definitely 10/10 in terms of graphics especially for 2008. Some say Crysis or CryEngine 2 is better but I think they are equivalent. The Dunia Engine just has its aim on realistic day/night cylcle and weather cycle. A little part of the CryEngine is in the Dunia Engine btw! The Music is also amazing and fits perfectly into the whole setting. The African setting like that is pretty unique and thats great.  The Multiplayer is ok. Some sort of CoD sort of Multiplayer which is just more realistic in general. Not many people play it online anymore though.  Fortunes Edition DLC: This is a small DLC which adds 3 new weapons, some new cars and some new Multiplayer maps. Nothing special but not bad either.  And now our favorite part. Can it compete against Far Cry 3? I say yes. Its maybe not everyones taste but Far Cry 2 counts to my favorite games and can compete against Far Cry 3. It maybe doesnt have so many gameplay tweaks as Far Cry 3 but I like this rustical way how Far Cry 2 handles everything. Reminds me a little bit of oldschool games. Not a lot of gimmicks but everything thats neccessary to have a nice game. I love the atmosphere of the game. The whole nature is amazing and the music fits perfectly into the game. Maybe its even better than Far Cry 3 in this part.  Some of you are maybe spoilered of Far Cry 3. Try ignoring the things that Far Cry 3 does better. I already played the game 2009 and I loved it back then. Far Cry 2 maybe isnt perfect but it does a lot of things right and it has a great experience. You should definitely try it especially because of the price. I think the game will get 9/10 from me, maybe overrated but I think this score fits good for me. Make yourself an own picture of the game and dont listen to people who say its bad.",
            "review_score": "1"
        },
        {
            "review_text": "Give me FarCry 2 any day. Destroyable gas stations, respawning checkpoints (I have no idea why people hated these with so much passion. Park the truck, pull out a launcher and blow the ♥♥♥♥ up!!), diamond discoveries, different landscapes with unique terrain. FarCry 3 is like the hot supermodel that doesn't have all the intelligence that a normal girlfriend does: She's great to look at but the depth of conversation and the ability to draw you in are severely lacking. I have an extremely difficult time believing that the main character matured from no combat experience to wiping out an entire cartel.  This was my review for FC3 but I feel it also belongs here. I won't play FC4 and probably won't touch Primal either. FC and FC2 were by far and away the best of the series. What other games allow you to burn dry grasslands to draw out your enemies like the cocaine runners did in Crocodile Dundee 2? None. The AI is spot on in all their responses and for a game this old, they take cover really well. Landscape was incredibly well detailed to the point you would think it's a Bethesda title and this game made you WORK for victory. Shame on all you crybabies that ♥♥♥♥♥ed and moaned about Malaria or jamming guns or respawning guardposts. Y'all missed the damn point of the revolutionary gameplay that made you HUNT your enemy. I felt like a lethal predator sneaking around with my silenced handgun, silenced shotty (Anton Sigur, anyone?), and a flamethrower.  I also learned that the only tool you'll need in life to fix engine, radiator and body damage is a ratchet.",
            "review_score": "1"
        },
        {
            "review_text": "After my first review that didn't seem helpful to a lot of people and the fact that I had nothing positive to say about the game, I gave Far Cry 2 a second try.   The graphics are great and the weapons and upgrades are good as well. There is plenty of action, diamonds want to be found and the map is huge.  Unfortunately I still find many things that I don't like and that still annoy me a lot.   First there is the car driving, this gets annoying really quickly as you constantly have to drive from one end of the map to the other and back again. It doesn't help that you cannot truly clear out road blocks, enemies will respawn even though you have cleared the camp. You can just 'scout' these camps, thats all. This way, you will have plenty of shootouts as you often have to step out of your car and kill people before you can head on. Im also missing a fast travel system to locations you have scouted or at least to safehouses. Driving becomes a chore.  Secondly there is this awful map. It is a good idea, but ultimately it is obstructing your sight and is annoying. This minimap is missing several options, you as a player should have control over. Hold the GPS in one hand and a pistol in the other for instance. Or have the map in your left hand be set on the left side of the screen and not right in the middle. Or have a GTAish GPS in your HUD. Instead you can hardly see whats in front of you.   The buddy system is interesting, but ultimately lacks the immersion to bond with your partner(s), they seem expendable and are badly written.  The story is bland: Kill the Jackal. I'm totally missing storyline here, that leads you through the game, tells you an actuall story. Instead the game presents you unrelated quests of killing that repeat themselves. After all you don't even know what you are actually doing and why you are in Africa.  Are you there for a Malaria cure, that you got there to begin with? Are you there to befriend the Jackal? Kill Factions or not? What was the purpose of it all? Bring refugees across the border? I thought Im a mercenary, there to make a profit, well guess I lost my identity.  The AI is pretty annoying as well, granted they try to surround you, but it seems even if you are hiding they always come from behind, spot you through obstacles and shoot you through high grass and plants where you could only make prediction shots.   SPOILERS:  But the worst of all is the miraculous ressurection of your so called buddies. First they will be killed in the bar. Then at the end every buddy is there again in a shootout for some stupid diamonds. Even if you shoot a buddy yourself during the game, but whole clips in them, they will come back.  This makes no sense at all, 'story' or otherwise.",
            "review_score": "-1"
        },
        {
            "review_text": "Best far cry ever...all other Far Cry titles are easy childish games where as this one has grit",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best shooters I've ever played, better than the games afterwards. The open world activities are structured in a very simplistic way, but achieving your objectives is anything but simple. You constantly feel like you're under threat of being attacked when you're outside, and you have to spend about 15 minutes preparing for each mission. Picking and replacing your weapons and maybe even getting new Malaria pills. There's a lot to contend with, you have to take cover and buy yourself time to heal yourself, you need to make sure your weapons don't jam, and you need to defend the buddies you bring with you because they absolutely can die, leaving them gone for the rest of the game. All of this means that pulling off the missions feels INCREDIBLY rewarding.  Honestly I've never played a shooter as immersive as this, and yes the malria and guard post respawn issue is annoying, but not enough to break the game entirely. It's dynamic, it's dark and the world actually feels hostile to you rather than an open world playground. If you're willing to put up with its quirks, you'll find one of the most rewarding shooters of last gen here. They don't make 'em like this anymore.",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically Africa Simulator 2008.  You play as some faceless, generic mercenary sent to some generic African country to kill some generic arms dealer. Problem is two factions of ♥♥♥♥♥♥♥s are fighting over all the rusted scrap metal and rocks you see throughout the landscape. You are forced to work for both factions and no one seems to notice the fact that you're working for both of them until the end of the game. Like what the ♥♥♥♥, nobody in either of the factions noticed that the guy working for them just ♥♥♥♥ed up their generic bad dude grunts for the 50th time.  Also there's malaria, because some ♥♥♥♥wit in Ubisoft decided that running to the church each time you run out of your prescription pills to fight off your malaria induced seizures and doing some lame, repetitive mission was a good idea. Yeah, great job guys, real good.  Your guns rust and break and ♥♥♥♥ which is pretty neat because it makes using enemy weapons a gamble because they can jam and ♥♥♥♥ you in your ♥♥♥ in a fight. Instead you buy your own weapons using some sketchy black market and some blood diamonds you find sacttered across the countryside that 12 children died trying to mine in a Congolese slave mine.  The generic African country makes for a pretty dope map. There's deserts, savannas, jungles and more. Also thre's outposts. ♥♥♥♥ING OUTPOSTS. Every time you clear one the enemies just respawn. Like how many of these ♥♥♥♥ers are fighting here? How do they manage to return to each outpost 5 seconds after you just blew the ♥♥♥♥ out of it with an RPG? There's towns too but they're pretty lifeless, just more generic mercenary guys standing around.  There aren't a lot of menus in the game. You press a button to bring up the map in your generic mercenary dude's hands and you actually have to look down at it. It's neat but it makes driving a ♥♥♥♥♥. There's some fast travel but only to certain points on the map for all you ♥♥♥♥♥♥ who like driving 40 miles in a game just to get to the mission and die immediately to do all of that driving again. Immersion!  You also have some people you meet in the game which are called buddies that can come save you when you get downed by enemies. They can actually die and when they're dead they're dead for good, which is pretty neat. They also help you out in missions with different approaches and ways to earn more Congolese slave diamonds. Once again, the buddies are all generic mercenary dudes. They try to inject some character into them but it doesn't really work out. I only liked the old Yugoslavian guy out of all of them.  There are wild animals too like zebras and whatnot but they just stand around and watch all the dumb♥♥♥♥♥ fighting over nothing.  Anyway its a pretty sweet game, get the Fortune Edition because you get an OP ♥♥♥ crossbow with exploding bolts which is just sick. Basically the game has everything; war, exploration, jungles, gunfights, companions, generic mercenaries, a pretty cool story once you get into it, and infectious disease. Something for everyone and definately recommended for the best Africa experience in a game yet.",
            "review_score": "1"
        },
        {
            "review_text": "It gives you a better reason to shoot Africans than Resident Evil 5, that's for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: +Good variety of very different weapons, and they are all fun to use. +Beautiful graphics +Great deal of freedom when doing missions and freedom to do things when you want to do them. +Gun degradding, wound healing, and no pausing to look at a map add to the immersion. +Always plenty of guys to shoot and generally good AI  Cons:  - GENERALLY good AI. On harder difficulties, they can see through vegetation unusally well, but not consistently. They're also bullet sponges if you don't use explosives, shotguns, and sniper rifles. Sometimes they are smart and try to flank you, other times they bum rush you like it's their first time playing a shooter.  - Voice acting is very odd; it feels rushed. Considering what kind of game this is trying to be though, this isn't a big deal because...  - ... the plot is more of an excuse to be shooting people in Africa than an actual story.  - Driving to objectives is a 'female dog' (thanks for the PG censorship on an M rated game, Valve) and a half with all the patrols and guard posts that respawn if you walk more than 100m away. I opt to go on foot most of the time becuase, aside from discovering more that way anyway, it's safer.  Objective score: 8/10   It's a tremendous amount of fun to feel like a hunter and methodically approach every conflict, but you don't have to always be stealthy. Constatnly changing up your play style is what makes this game so much fun. It's my go-to game if I just want to relax after a hard day. I like to take my time, slowly pick guys off one by one with the dart rifle, then finish off any remaining bad dudes with a shotgun. But again, I switch it up often.   Silly ways to have fun: + The flare gun is a one hit kill and magically kills everyone in a car, even though it doesn't set the car on fire nor directly hit anyone inside.   +The AS50 can shoot through more than one person.  + Sneak up behind an enemy, place an ied, back up, *boom*.  + I never get tired of sniping guys in boats. They fly out sideways about 5-7 feet in a perfectly straight line.  Subjective score: 10/10 - Would bless the rains down in Africa again... but fire spreads more easily when it's dry.  Sorry I got that song is stuck in your head now :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best games I have played. This game gets some negative feedback because of its difficulty, but I will explain why you should play it. First off, Far Cry 2 still looks absolutely gorgeous. Africa has never looked better in a game. You will find zebras and gazelles roaming the grasses. You will enjoy mountains, waterfalls, and canyons, travel across the small lakes, visit Pala, Sefapane, and Mosate Selao, and speed across the dirt roads to hunt for enemies.  The gunplay in Far Cry 2 is undoubtedly realistic. This is no Call of Duty; your guns behave like real ones and there is not much 'running and gunning' unless you are playing on easy. There is gun jamming and degradation, so you will need to take care of them. There are weapons for everyone. There are multiple rocket launchers, grenade launchers, pistols, machine pistols, snipers, and explosives. There is even a dart rifle and a explosive crossbow! The missions are fun but may get boring. I would advise playing on Hardcore or Infamous difficulties because when you play on them, the game becomes much more challenging and even more realistic. There are respawning outposts with enemies, and these provide good fun since you never run out of people that are trying to kill you. Many people are not used to such a harsh game; expect everybody outside of the Ceasefire zones to try to kill you. Is that good? Your call. There are tons of weapon upgrades and some vehicle upgrades, plus upgrades that will allow you to carry more ammunition or molotovs. The second half of the world unlocks when you complete half the missions in the game, and this second world adds new Jeeps, boats, and guns, plus new locations to explore. Fire is my favorite part of the game because it is so well-done. The fire is better than Far Cry 3 because it was not designed to play a large role in Far Cry 3. Far Cry 2 has seasons and rain, so expect fire to work less effectively when the grass is green or there is a downpour. When the grass is dry and there is no rain, fire becomes the game changer. If I feel overwhelmed during gameplay, I may throw a molotov cocktail into some dry grass to start a (potentially massive) fire. This fire scatters enemies, forcing them to change their attack plan; if you are lucky, you may even get one to burn to death.  The audio in this game also never ceases to impress me. You can hear birds and monkeys in the trees, the wind rustling the leaves, the whine of the mounted gun as it swivels. When you are around enemies, you will hear their conversations (they sound believable). The music in this game is a nice change as it is what you would expect and African band to play.  You have malaria during the game, and it puts an interesting spin on your gameplay. You may have to wait out a malaria occurence, and this can kill you. The best tactic to do is throw a molotov and hurry to cover. Note that it took me 30 hours to complete my first playthrough. After that, you can do a new one on a harder difficulty (feel free to change difficulty anytime you want). The ending of the game is unexpectedly deep.  All in all, this is a game like no other. Everything I said above amount to an amazing experience. This is an experience like no other that can be had, during a sale, for just $2.50.  ",
            "review_score": "1"
        },
        {
            "review_text": "A game about Africa   SPOILER: IT DOESN'T END WELL ",
            "review_score": "1"
        },
        {
            "review_text": "In my opinion, the best game in the Far Cry series. Yes, your character has malaria, and yes, your guns will break if you go too long without replacing them. And yes, fast travel is incredibly limited, forcing you to drive around through the same checkpoints of infinitely respawning guards over and over again.  Still, I recommend you give it a try. It's one of the most immersive and wildly unpredictable FPSs I've played. And hey, I'll take those infinitely respawning guards over the guards in Far Cry 3 that completely disappear forever once you clear an outpost. At least in this game I can always find somebody to shoot.",
            "review_score": "1"
        },
        {
            "review_text": "ONE OF THE BEST OPEN WORLD GAMES AVAILABLE...would recommend this game for anyone who likes shooters and open world games",
            "review_score": "1"
        },
        {
            "review_text": "What's best about Far Cry 2?The true answer is that there is no one thing that can be considered best about Far Cry 2. Its brilliance lies in the fact that it is more than the sum of its already impressive parts. Essentially the game is a playground that caters for whatever mood players find themselves in. Want to storm into an enemy encampment in broad daylight John Rambo style, perhaps running a few unfortunate soldiers down with a MG-mounted Jeep before letting loose with your grenade launcher? Go ahead. Prefer to fast-forward the incredible day/night cycle to midnight by taking a nap in one of the Safe Houses and sneak in under the cover of darkness before slicing and dicing from behind with your machete? Be the game's guest.Ubisoft Montreal isn't, of course, the first developer to do open world shooting.But it is so well executed, so technically proficient that I can't help but feel it at least matches and in some areas even surpasses other games of the genre.After choosing from a selection of nine refreshingly un-clichéd mercenaries, ranging from a 45-year-old Mauritian to a 38-year-old Algerian you're thrust into an unnamed African country being torn apart by two warring factions.Your mission: To kill The Jackal, an arms dealer who's fuelling both sides of the conflict with weapons, and making a mint as a result. You immediately run into problems - malaria wraps its diseased mitts around your innards, forcing you to collapse as soon as you arrive in town. You wake, groggily, and find The Jackal standing ominously above you. He knows everything - who you are, why you're here and how defenceless you've become as a result of the malaria. In pity, he hands you a machete and a hand gun, and lets you live. This is where Far Cry 2 kicks off.Outside, all hell breaks loose. The United Front for Liberation and Labour (UFLL) and the Alliance for Popular Resistance (APR) are going at it in the streets. You make a break for it, dodging bullets as you head anywhere as long as it's away from certain death. But there is no escape - either you're shot or you collapse from the malaria. You wake in a slaughter house just outside town. A merc, one that you did not pick to play as at the beginning of the game but is determined by that choice, now reckons you owe him a few favours on account of him saving your ♥♥♥. From there, it's up to you what jobs you take on, whether it be paid work from the UFLL or APR, malaria pill jobs from various good Samaritans, weapon vendor jobs that unlock new purchasable gear, buddy jobs that improve your 'history' with the NPC mercs or assassination jobs dished out by a disguised voice heard from communication masts. What they all have in common, however, is combat, and it's here that Far Cry 2 initially frustrates.I'm used to developers holding my hands so tightly during game tutorials, and even beyond, that Far Cry 2 will at first jar with many due to the fact that it's actually pretty tough right from the start. Simply shooting stuff is difficult. Unlike the console versions, the PC version doesn't have a snap to target function when you zoom down the barrel of your gun. This is fine - the PC keyboard and mouse set up allows for a degree of FPS accuracy console controllers simply can't. But this doesn't stop your weapons, especially at the beginning of the game, from being, frankly, crap.You'll find the recoil offensive, the jamming so regular you'll tear your hair out and the enemies so hard to spot in your splendid surroundings that it won't be long before you grab a mouthful of dirt. The healing system doesn't help. Whenever your health dips you can inject yourself with magic hit point juice. That's fine, but when your health bar is almost depleted healing will instead trigger an animation where you gruesomely pick bullets out of the holes in your skin. The problem is that this animation, which takes about five seconds to complete, is interruptible by enemy fire. Some will applaud Ubisoft Montreal's approach. Some will criticise it. Whatever your opinion, persevere. Soldier through the difficult opening few hours, keep earning diamonds, keep reducing the recoil and reliability of your weapons with upgrades, and above all, keep experimenting, because it's only through experimentation that you'll realise Far Cry 2's undoubted potential.The save system differs from the console versions in that you can save absolutely anywhere and whenever you want. There are no checkpoints in Far Cry 2, at least not in the traditional sense of the term. Instead, you'll get a pop-up asking you if you want to save after you complete mission objectives, when you use the coach transportation system or when you go to sleep using one of the Safe Houses. The many guarded checkpoints will annoy some, but for others they will reinforce the feeling that you're never safe. Because the map is so big, you'll spend a lot of your time driving around. If you're going to stick to the road, you're going to run into at least three checkpoints along the way. Every soldier manning the checkpoints has a shoot first, ask questions later policy, too, making driving more a case of survival than sight seeing. The enemies respawn, too, so you can never once and for all clear enemies from that check point on that road you keep using to get to and from town.Obviously if you're a shooter fan you should buy this game. A simple glance at the score should confirm in your mind, if there was ever any doubt, that Far Cry 2 is nothing but brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR ... for all its faults, FC2 is a 'summer popcorn movie' video game that's enjoyable if you just switch your brain off and go with the flow.  ~~~~~~~~~~~  Background  FC2 came out when 'open world' and '50+ hours of gameplay' started becoming buzzwords on games. It comes from the generation of games that were more focused on creating massive playing areas, then didn't have enough time to pad them with actual game play.  So, they slapped in a bunch of repetetive, cookie-cutter missions, scavenger hunts and enemy AI that's stupid but makes up for it by being programmed to cheat.  I got this game when it first came out, b/c I had just built a new dual-core rig (when dual-cores had just come out), and wanted to see what it could do by playing Crysis, Far Cry 2, and other games of the time. Picked it up again during steam summer sale, and the good and bad come rushing back.  To pro/con it, I have to break it down by components, since each component has pro/con.  ~~~~~~~~~~~  PLOT  Pro: it tries to delve into some deeper aspects about morality  Con: It gets pretty pretentious and self-righteous for it's own good. It's hard to follow as you're thrown right into the middle of confusion without much explanation, and even your journal and cut-scene tip text doesn't help much. But, overall, you're not missing much. You're basically a lackey for everyone, so switch your brain off and ignore thinking.  ~~~~~~~~~~~  NPC's  Pro: there's large varieties of them  Con: They were trying to cut-down on file size, so it seems they sped up everyone's dialogue after recording it. Everyone talks super-fast, which makes it difficult to follow, especially ones that have accents.   ~~~~~~~~~~~  ALLIES  Pro: you get a 'buddy' that can help revive you out in the field  Con: it feels like what they wanted to do was let you have an AI NPC follow you on missions like a side-kick. Instead, they were rushed for time, couldn't implement that, so instead they just implement some half-a**ed cutscene with a buddy helping you out, then acting completely stupid in fire fights as they die from either standing out in the middle of now where, getting caught in a brush fire like an idiot, etc, etc. Basically, to enjoy the game, just think of your Allies as nothign more then quest givers, and ignore any aspect of them 'participating' with you...because you will feel it is very lackluster if you do think of them as a 'companion'.  ~~~~~~~~~~~  MISSIONS  Pro: there's lots of them  Con: they're all the same cookie-cutter design ... go here, kill everything, collect this. I don't mind that so much (again, we're switching our brains off to enjoy this). What bothers me is you can only have 1 quest at a time. And the quest giver and the actual quest are usually on opposite sides of the massive map. So, you get a quest, spend half an hour getting there, complete it in 5 minutes, then spend another half hour getting back to the quest giver. While out and about, you will see other quest opportunities. You can't take them, or they will cancel your current quest. This is beyond dumb. For a map of this size, they should let you gather quests, then take care of all of them at once when in the area of operation.  ~~~~~~~~~~~  ENEMIES  Pro: there's a variety of enemy dress and faces, plus they use guns you can use  Con: the enemy AI is a bipolar mess of smart and dumb. You sniper a guy, and some will take cover while others try to investigate. Some will flank you and surprise you, but you realize they can only do this because their footsteps have been purposefully made extra quiet so you don't hear them. So, it feels cheap when they ambush you. The ones taking cover behind buildings won't come out. You can sneak around and pick them off with a sniper from a distance and they stay in duck-n-cover formation. I literally looked over a cliff. Saw two guys hiding. I shot one. The other guy didn't do anything. He just saw his buddy die, but he keeps hiding there. I shoot him, too. *facepalm* The devs purposefully made the AI cheat to give them a competitive advantage to challenge you. They will use their amazing eagle eyes to spot you through foliage and cover then chase or snipe you even though they are nothing but a dot in your sniper scope. Their clothes blend into the color pallette of the game, so it's hard to detect them. They will make next to no noise while walking through brush looking for you even though you sound like a herd of elephants while crouch-sneaking. When the game first came out (before patches) they were even able to run 50mph to catch up to you if you were driving through a checkpoiint without engaging them (thankfully that seems to have been fixed). But, basically... don't expect super impressive AI.  ~~~~~~~~~~~  GUNPLAY  Pro: FC2 let's you load out with a primary, secondary and support weapon. This is pretty ingenious, because it lets you tailor your load out to your play style and/or mission.  Con: I usually consider myself good at FPS (grew up on Doom and Quake), but FC2 has been brutal in run-n-gun play style. The PC is slow, can't sprint very far or fast, and likes to stop moving to do lots of activities (eg: malaria kicks in... better stop in the middle of this street while getting shot to take a pill instead of letting the player make me keep walking while doing so). Machine guns are jump as all get out, but sniper rifles have completely perfect, stationary zoom making head shots from a mile easy. Standing 10' away from a guy, you will watch as you can't hit him point-blank... unless you bring up your iron sights to target. You get a silenced sniper rifle (dart rifle), but it's not considered a primary weapon and is severely hobbled on ammo. There's just all these baffling design decisions.  ~~~~~~~~~~~  WORLD  Pro: it's large  Con: everything is the same color pallete of 'browns and greens that easily blend into each other'. The world is so large that it takes half an hour to get to your mission site. There are so many mountains that all driving feels like 'corridor' driving in that you rarely have very open areas to zoom through. Plus, when there are, there are so many trees and rocks in the way you can't really go too fast. There doesn't seem to be any permanancy in the world, too. You take a car from a place. Come back later... the car is there again, reset, as if it was never taken. And nobody gets upset over you taking vehicles. There are 'checkpoints' throughout the place where enemies hang out and make it hard to pass through. You clear one out. Come back 5 minutes later...it's repopulated again like nothing happened! This makes you feel as if your actions are pointless / worthless, and dissuades you from clearing places out. (ie: you would have incentive to clear a place out if it stayed cleared out, but since it respawns 5 seconds later, you start to just avoid conflicts by going out of your way to go around those places since they just become time wasters). Diamonds are used as currency to buy new weapons, and they spread HUNDREDS of these suit cases to go scavenger hunt all over the place to pad the game with 'game play' that isn't really compelling game play.  ~~~~~~~~~~~  Did I mention you need to switch your brain off?  There's a lot 'wrong' with the game, but it is what it is due to the open-world fantacism + huge push for better graphics that was all the rage back then (and still sort of is).  Overall, I still recommend the game, because it's entertaining going on missions and clearing places out. Sitting on a rock sniping people, pulling out a grenade launcher and blowing up vehicles with occupants still in them, tossing a moltov and lighting up a bunch of grass to burn people to death... it's mind-numbing fun.  The game is best if you fire it up, spend an hour running a mission, then turning it off for a bit.",
            "review_score": "1"
        },
        {
            "review_text": "You are dropped in a war-torn african country, you have one mission. Kill the man that has been arming both sides.   The gameplay is simpley amazing. The gun-play is next level and the environment gives you a feeling that the country is in horrible conditions and help is a far cry away. The most complaints i hear about FC2 is the weapon jamming and outpost, but for me it makes it more real. The outposts makes you strategicaly move from point to point and the jamming can ruin a firefight for you. It all makes it more difficult to survive, and instead of holding your hand all the time the game lets you approch how you want to. There are a lot of unlockables, weapons and uppgrades to let you play how you want to. Either run-n-gun or ninja style, and it does this well. Lots of games offer this, But FC2 manages this in a terrific way. The only complain i have is that the missions are very similar, little variety. But the different playstyles is enough to keep things fresh.  All in all i would say this is one of the best games i have ever played. It is almost 8 years old, but is a though competitor for even the newest games.  Im giving this 8/10 bacon strips.",
            "review_score": "1"
        },
        {
            "review_text": "I went far in this game, it kinda made me cry... twice.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a hidden treasure that all players must have in their collection. There is so much realism, so much detail, and so many more features than Far Cry. It's unbelievable how amazing this game is, and also how underplayed it is. I've heard people say that it differs too much from it's predecessor to be an official sequel. Although it's made on a different engine and has a surplus of extras not featured in Far Cry, the basic elements are still the same: shoot mercs in a sandbox world set in an exotic locale.  If you never played Far Cry 1 and if you were to ask me I would say skip it entirely and get Far Cry 2. It has everything that most people would want in a game, with only minor annoyances. It's crazy how much detail is here: driveable vehicles, mounted guns, fixable cars, unlockable safe houses, weapon upgrades, uncontrollable wild fires, exciting action, riveting music, helpful allies, challenging AI, beautiful scenery, and to top it all off you have a bad case of malaria!",
            "review_score": "1"
        },
        {
            "review_text": "A love or hate relationship......  And I love it, my favorite open world FPS ever created.  Yes the respawn rate is horrid, but if you learn to except it, it creates a world where you can never relax.",
            "review_score": "1"
        },
        {
            "review_text": "I start the game in africa  we are driving around  I get malaria and almost die  I get captured by a 3rd world kony   10/10 would get malaria again",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 is a beautiful open-world FPS, full of dangers and adventures. With jungle, deserts, villages, enemies, there's plenty to shoot. Coupled with a so-so story but fun quests, Far Cry 2 is worth your buck.",
            "review_score": "1"
        },
        {
            "review_text": "Playing This Game Since The Final Patch 1.03 (2009) The Patch Made Big Changes Fix FOV &amp; Removed DRM. i Put in 8000+ Hours in The Retail Version. i Cant Stop Playing This Game. All Gamers Should Own a Copy of This Game. you are Stuck in Africa Fighting your way Around On Missions to Help Sides of the UFL &amp; APR. you will be Driven Off Roads Making you Run in The Deep Jungle for Cover. The Game Becomes More intense The More you Play it. A Big Bonus The Game is (DRM Free) Steam/Uplay &amp; Retail.exe",
            "review_score": "1"
        },
        {
            "review_text": "By far the best Far Cry. Raw realism from a largely console based game. Features like weapon deterioration and jamming add a level of consciousness to combat. Environments are outstanding and perfectly designed. Missions can be slightly boring (sometimes). 8.5 out of 10 from me.  ( Completed on Ps3 and Xbox 360, not on PC yet)",
            "review_score": "1"
        },
        {
            "review_text": "welcome to AFRIKA",
            "review_score": "1"
        },
        {
            "review_text": "Its like Oblivion with malaria.",
            "review_score": "1"
        },
        {
            "review_text": "Good game no matter what anyone might say, real pain in the ♥♥♥ at times, but hey, nothing like being able to operate with a FN FAL and pretend it's Rhodesia right?",
            "review_score": "1"
        },
        {
            "review_text": "Best game series since Half-Life Universe! ",
            "review_score": "1"
        },
        {
            "review_text": "The game started out fun for me, but then just got boring since it is repetitive. Drive a vehicle, stop at a camp and kill the guys, maybe find a diamond or new weapon. Go get another mission and do the same thing. Plus all the backtracking is annoying and a waste of time. The first Far Cry has much better gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best story in video game ever !!",
            "review_score": "1"
        },
        {
            "review_text": "There something.... Off about this one.  Where it takes place as a free form format of havoc wreaking.. The stealth apprach is weak.. Real weak.   As an exsample.. at night with a dart rfile.. the most silent rifle.. nail a dude in an open field and everyone in earshoot knows where you are and shoots in your direction.  Yet oddly if you fire and move position the ai looses you.. and stands around..  Other somewhat annoying tidbits dont detract from the game.. but sort of keep its pace.  Also.. if you need to work out some hostility slapping africans and british people with a machette.. well this is your joint.",
            "review_score": "1"
        },
        {
            "review_text": "This rivals STALKER as my favorite game of all time. As far as immersion goes, FC2 is unsurpassed. The game feels exactly like my real life experience in overthrowing an unstable African nation. It's hard, especially on the higher difficulty levels. YOu have to think about how to approach each mission, which works well because you have a variety of options. While most of the missions can feel repetitive after a while, it's fine because the actual combat is intense. You can never let yourself be distracted or opting for the mindless approach, as each (infuriatingly respawning) checkpoint can kill you, no matter how many similar checkpoints you've cleared. Even the respawning checkpoints work out to a greater point, nothing you do is improving the country, no matter how many nameless enemies you kill. It's not perfect, as I mentioned many of the missions are repetitive, but the gameplay feels as intense and dark as the narrative, and every aspect of the game seems to blend together into a cohesive whole.   Gunplay is absolutely amazing, with each shot deadly for both you and the enemy. Flare guns in particular deserve a special mention, as the fire physics are devastating in this game. Apparently during early stages of testing, the fires would rage out of control, spreading across the entire map and killing every single character. The developers restricted fire to spread to a perfect circle, but to be completely honest I never noticed that as I usually used fire as a temporary distraction to flush enemies out of cover or to cover my escape.   It can be frustrating to escape enemies in vehicles, as they'll chase you to hell and beyond, but now I'm just nitpicking. Nothing in the game breaks the immersion or flow, the map is an item you can pull out and look at while driving, and the entirety of the game reinforces the brutality of the setting and the fact that you're not a golden hero, magically fixing everything for the natives. Even the ending goes for the same, I won't spoil it but suffice to say, The Jackal (FC2's antagonist) is probably my favorite character in video game history.",
            "review_score": "1"
        },
        {
            "review_text": "Clint Hocking's a genius, but it certainly took me a few hours (across the span of about five years) before Far Cry 2 finally clicked.  This game is outright unfair toward the player, but that's kind of the point. The openness of game and its encounter design remain unmatched in the realm of shooters. Far Cry 3 seemed to learn all the wrong lessons, and the Assassin's Creedification of the series only served to clutter the screen with way too much ♥♥♥♥♥♥♥t.  Having your .50 cal sniper rifle fall to pieces in your hands, forcing you to pick up an unreliable AK from the body of one of the militiamen you've just dropped and wing the damned thing--it's just exhilerating.  Great game. Better than what came before and certainly better than what's come since.",
            "review_score": "1"
        },
        {
            "review_text": "Best far cry of them all IMO It's a brutal and unforgiving game set in the african wilderness which is is beautifully rendered, Unlike later far cry games this is more of a mercenary simulator without the special abilities like tagging enemies and seeing through walls etc. Stealth is possible but much more difficult than later far cry games. The only negative thing about the game is the below par voice acting.   ",
            "review_score": "1"
        },
        {
            "review_text": "Very excellent game!!... Well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Considered one of the most under-appreciated Action/ FPS... I just freakin' love this game. Looks and plays great... (check out the 'Store' 3rd video if you only check out one...)",
            "review_score": "1"
        },
        {
            "review_text": "Let me tell you about this call of duty afrikaan warfare, this is one hell of a game, from the moment you start the game 'YOU DIED' no wait no thats dark souls... anyways when you start the game you're in africa and you get infected by aids because its africa and its full of ♥♥♥♥♥♥♥. Although theres barely any quickscoping in this call of duty there are vehicles and theres a really cool feature that if you get shot and you press alt f4 your character will pull out some macgyver ♥♥♥♥ and take out the bullet shell out of his ♥♥♥ or wherver he got hurt and if you break a leg, the ♥♥♥♥er snaps it back into place like a ♥♥♥♥♥♥ off bald rambo feeling no pain whatsoever.",
            "review_score": "1"
        },
        {
            "review_text": "Quick Review; Graphics - 4/5 Decent for their time, but as we're developing, we're leaving it behind. However, still very playable for an average gamer. Controls - 4/5 Very General, there's nothing hard with the controls but nothing new really, your average shooter/rpg controls. Storyline - 2/5 I hated it. I think they did an original storyline, decided that a game this size needed a longer storyline and so did a lot of copy and pasting. AI - 2/5 Poor. Once you wipe out a outpost/road checkpoint, apparently, all the guys twin brothers arrive 5 seconds later and have set up defensive positions. Fed up of having to deal with 20 guys every 100m down a road.  Good Point - If you're looking for a game which is easy to get into, plenty of fun weapons where you can burn and shoot some general guys, then you're looking at the right game.  Bad Point - If you're looking for something where you call fall in love with the characters and the gameplay. I think there are better shooters and better RPGs.  Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game! I really enjoyed the open world, and it has some great rewards for exploring. Combat is excellent, giving the player a wide range of choices in how to approach a fight.   With that said, I do have a few critiques of the game that I'd like to share: 1. Reputation: This feature did not seem to help the player in any way. I thought, when I saw my reputation going up, it might have an effect like giving me some leverage with the various militant groups. Perhaps if my reputation is high enough, I would not need o fight my way through every checkpoint on the road, but no.   2. Checkpoints: Throughout the maps, different militant groups have set up checkpoints which the player must either avoid or take on in combat in order to get where they are going. I didn't mind it at first, but it became kind of tedious. It would have made sense in the game to allow the player to pass at least some of these checkpoints unscathed, considering that you are working with those same groups on your quests.  3. Limited ammo: Some of the more powerful guns understandable had limits on how much ammo could be carried. However, it seemed a bit too severe. Six darts? Really?  4. Strange weapons system: Having a warehouse with unlimited weapons and ammo was an interesting approach. However, it basically made the whole weapon condition feature pointless. If you are going to add weapon condition, and have weapons break down on the player, then it would make more sense to have the player repair those weapons, rather than giving him access to unlimited quantities of weapons in perfect condition. It's like they had an idea, then they just gave up on it.   To go a step further, let me explain. I like the weapons in the game. I like the weapons in a lot of games in fact, and I grow kind of attached to them. If I find a cool gun, I want to keep it and take care of it, and make it my gun, right? At first I liked the fact that a gun might stop working, and I might need to pick up another one, but once I found my warehouse full of unlimited guns ... it all seemed pointless.   5. No Mutant Monkeys: C'mon. Where the heck are the mutant monkeys? For nearly all of this game I was anticipating the encounter with mutant monkeys. When I discovered the second map area, I became convinced that I would discover the lair of the mutant monkeys. However, the mutant monkeys never came.   Seriously, the more I think about it, the more I resent the failure of the developer to add a simple underground lab filled with mutant monkeys. I mean, how hard can it be? And who wouldn't want mutant monkeys in their game, am I right? It's a win, win.   ",
            "review_score": "1"
        },
        {
            "review_text": "The best 'african mercenary' simulator out there. Dont expect anything easy like the newer Far Cry's and you'll have fun playing it. (Or trying to play it, because its ruthless)",
            "review_score": "1"
        },
        {
            "review_text": "Years and years ago I played this game almost everyday. I just started playing this game again recently, and it's still fun! It's a mix of sandbox and action, and it's a great game. In my opinion it's the best Far Cry game to date! I rate this game 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "So many memories of slowly clearing bases and bunkers with a sniper rifle from a quarter mile away.",
            "review_score": "1"
        },
        {
            "review_text": "Despite a staggering number of design missteps (respawning checkpoints, wonky weapon degradation system, non-immersive ecosystem as seen in the total removal of predatory animals, malaria, and a story that ends up being a cheap cop-out) and story-related bugs, FC2 remains a special chapter in this now burdening series. There's something...nomadic about how you play the game. It might not have the most stunning visuals or the most interesting locale, but it's the means in which you can dispose of your targets that make this a keeper. Had Ubisoft made the game more interesting, less frustrating, and even more immersive then I think it would have been a sheer blast to play. As for what we got, it's merely a means of blowing off steam on a world gone mad.",
            "review_score": "1"
        },
        {
            "review_text": "Far cry 2 is basically far cry 3 but set in africa, you are on the trail of the Jackal, an arms dealing who has been supplying guns to both of the fighting sides in africa though there is a catch on the way to your hotel you cought symtoms of malaria a dangerious disease that can cause nausia and black outs, luckly you can get pills to help keep the malaria at bay but it is kind of hard to get pills in war torn Africa....this game is great for people who want the experiance of far cry 3 but does not have a gaming computer...  so your journey begins... GO GRAB A TRUCK WITH A MOUNTED MACHINE GUN AND GO RUN OVER SOME ZEBRAS AND AFICAN WARLORDS 10/10 :D  ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing visuals and a huge expansive world almost get this game into the 'great: section. Not as good of a game as the original FC2, but still decent. The missions, voice acting, AI, horrid spawn system, plot, and kinda weak gunplay are all holding the game back. The fire system is amazing, the atmosphere is top notch, the feeling of being 'frst person' is only beaten by a small few, ways to approach each mission, and again, amazing graphics are all that this game has. If is is $10 or less, check it out for a while.",
            "review_score": "1"
        },
        {
            "review_text": "I've gone back-and-forth about whether to give this game a thumbs-up or thumbs-down. Ultimately, I decided to give it a thumbs-up because I *did* enjoy playing it. However, in my opinion this is a game with some serious flaws. I picked this up as part of the Far Cry franchise pack, so I don't regret buying it.  POSITIVES:  - It's a hardcore open-world sandbox FPS. If you're into that, you will almost certainly enjoy much of the game. 'Hardcore' here refers to variety of things. For example, there is very limited fast-travel. Expect to spend a lot of your time driving back and forth between the same places. This game doesn't hold your hand or give a ♥♥♥♥ about you and your time.  - Continuing the hardcore theme, you don't carry much ammo and your guns often jam, especially when you don't routinely replace them with brand new ones. I enjoyed this part, but some might see it as a nuisance.  - There is a very good variety of guns.  - The graphics hold up quite well.  NEGATIVES:  - RESPAWNING ENEMIES. This is by far the worst, IMHO. When you clear an area of enemies, they will respawn as soon as the area is unloaded. This creates some really awkward situations where your missions expect you to drive back-and-forth over the same area repeatedly, and you have to re-clear it (or painstakingly avoid it) each time. It's entertaining for the first few times, but it gets really repetitive. Early on, I died to these guys a lot. Later, I was just trying to avoid boredom by finding creative ways to kill them. I don't *mind* enemies respawning, but these ones are way too fast.  - The AI is inconsistent. Sometimes they spot you when you're hiding in the brush. Other times , they miss you when you are in the open right in front of them. I can partially forgive this, since it is an older game.  - Gun damage is very inconsistent. Five pistol shots to a bare chest at point-blank won't kill. But a sniper rifle is always a one-shot kill. I would be more forgiving of this from a normal FPS, but FC2 is obviously a game that takes itself seriously and I feel like this detracts from the 'hardcore' feeling for me.  - The two sides in the civil war are completely interchangeable. This is at least partially intentional, since the game is creating a bleak, mercenary-driven civil war where everyone is bad. However, the player hardly ever sees the two factions fighting, and both sides seem to always want to kill the main character on sight. While it's partly justifiable, it also seems a bit lazy to me. I feel like the game loses it's appeal a lot faster because of this.  - The main plot feels somewhat railroaded. For example, you *must* work for both sides of the ongoing civil war to advance the plot (i.e. one side just stops giving you missions and you need to start going to the other side). The ending was completely railroaded, as well. Some have argued that this is because the player doesn't have complete control over the main character. This is supported somewhat by the journal entries he writes during the game. However, it strikes me as a bit lazy.   Bottom Line: My enjoyment of this game was like a bell curve. Early on, I was very frustrated by some of the questionable mechanics. By the middle of the game, I had adapted, gotten a good loadout, and was having a pretty good time. But by the end of the game, the repetitiveness and plot-railroading got to me and I just wanted it to end. There's a really good game somewhere in there, though.  If it sounds appealing to you, get it while on sale or as part of the franchise pack.  ",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite games. Really good rats.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game, started out playing on the Xbox 360 and enjoyed it thoroughly. If you're not so interested in the main story theres plenty of side missions you can do to keep you busy, or even admire the stunning scenery with astonishing graphics, I will always love this game, I would definetly reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "If you ever thought Far Cry 3 was hard, you've never even tried Far Cry 2. A game with a story that makes sense and enemies whom performs like an eagle. You all should get it when it's on sale. A real deal, this is.",
            "review_score": "1"
        },
        {
            "review_text": "Flawed game (the respawning enemies) but great atmosphere. Cult classic!",
            "review_score": "1"
        },
        {
            "review_text": "Do you enjoy movies like Hotel Rwanda and Blood Diamond? Have you ever imagined what it would be like to do morally questionable things in the Congo? Are you a fan of malaria?  If you answered yes to any of these questions, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I bought Far Cry 2 for $3.39 about three days ago on steam and let me tell you thats a steal. I got about 20 hours of gameplay out of it and I bet you could get more if you weren't like me. (I used -GameProfile_GodMode 1 as soon as I finished the tutorial) So essentially I didn't die a single time in the game. I enjoy games when I'm unstoppable and here's why I think you should get this game. (For no more than $5 otherwise your wasting money). The game is fun as the story goes back and forth and you face moral dillemmas. The game gives you the illusion of choice however. It tells you to complete a mission you can do this or that. But it ultimately doesn't mean anything as you will be forced into the same outcome. Its just the means of reaching that outcome. The story lets you think you are writing it and participating, but you aren't, you're just following along. The game's missions do get repetitive as its only assassinate this guy or blow this thing up. I payed $3 and cheated through the whole game so I wasn't expecting too much. As for replayability, its a Far Cry game so there is none. Also there are no achievements which give me no incentive to find stuff or kill guard posts. In Far Cry 3, there were achievements, and I was playing on Xbox so achievements mean something, so there was a reason to go do something in the game. Since I finished the game 5 mins ago, I don't think I'll be revisiting it. BUT, it was worth all 339 of my pennies and I would gladly pay 339 pennies for another Far Cry game. It is what it is, a shoot em up with nice scenary so don't expect too much.",
            "review_score": "1"
        },
        {
            "review_text": "Before Uplay Im so happy",
            "review_score": "1"
        },
        {
            "review_text": "This is not as good as farcry 3, but it still is better, kind of, eh...  Want to travel to Africa and experience a gritty story with no heroes, tuly immersive gameplay, and beautiful vistas? This game nailed that, perhaps too well. Because the realistic approach in this game made you feel like a hard working ♥♥♥♥♥♥♥, not a happy super hero with no regrets as in Farcry 3. This game is probably one of the most dynamic and realistic game I have ever tried. There is no handholding and It is incredibly immersive, and difficult. Yet, I have not finished it, and I don't know if I have the time and effort to do so. Because this game is serious work. This is a game to come back to and play over time.  What is good? No UPLAY  It looks fantastic, it really does. And runs well without the most amazing graphics-card. In some ways I think it looks better than farcry 3, because is feels more real. There are really beautiful vistas in this game that makes you stop and just look around for a while, over and over.  It is very immersive. You are 'always' in the game. No menus to constantly interrupt you as in farcry 3. The map is held in your hand for example. I really enjoy this interface-idea, way better than farcry 3. You are no super hero that can take on everybody and thousands of bullets. You have to plan ahead and you have to be smart. You are vulnerable and everything can go wrong. You guns suddenly might jam, the fire you (accidentally) started might burn you alive if you are not careful. Perhaps your car suddenly needs repair?   AI is smart and will flank you, hide, and attack you even when wounded and lying down. Foliage is beautiful and will move and react to your running and shooting.   You do have some help (well, time will tell). You have friends who offer you help, and can even revive you if you get shot down. How you interact with these friends are totally up to you, and creates varied gameplay and events. You can work for arms dealers and upgrade your weapons and gears. You can find vehicles with mounted guns and a lot of firepower.  The game has few and short cutscenes that don't constantly interrupt and tell you what to do all the time. It is up to you, and if you have your wits about you, you can do it. It feels less like a game this way. Farcry 3 is a 'Disney roller coaster entertainmnet island'. Farcry 2 is serious work where you feel and smell the dirt, the burned oil and grass, the dust and the misery of the place.  There is wildlife, but no all over the place. They hide like real animals do. And you don't have to mass slaughter every animal to get a belt, in fact not at all.  Guns behave realistically; whatch that recoil, you can't snipe with a handgun from 200 metres away. And the weapons break. I know many hate all these problems with the guns. But for me it makes the game tense, and you always have to be on your toes, comming up with a quick alternative if something goes wrong. - You cannot always rely on your super weapon.  What is bad? Well, all these great things, are also the problem. As said before, the game is hard, sometimes too hard, and I found that I enjoyed shorter times with the game, rather than sitting for hours playing it. Every time I came back to the game, I marveled at the greatness of the game, and everytime I finished a session I was a little tired of it. It can be quite repetitive. Traveling around the map takes time and you constantly have to deal with angry people shooting at you, every time you pass a guardzone, even if you took the place out a moment ago - yes the guards respawn. Missions are not very varied either. If you compare to Farcry 3, there is not much to the game in terms of activities. The AI is tough, and sometimes it feels like they never give up. And they see you from far away with fantastic accuracy. It is not easy to sneak.  Conclusion: If you play this game like farcry 3, you will be disappointed. The game does not constantly feed you content, and happy colors. Far cry 3 is truly fantastic in its own way and improved many flaws that far cry 2 had, but far cry 2 feels so much more dynamic. The game creates content for you by interacting with the world, not by feeding constantly what to do, say and think. It the dynamic moments that are special, where anything can happen, and how you react to it. The world is more realistic and beautiful than farcry 3. In a way it feels more like roleplay, because the protagonist is silent, and the game really shines when you put effort into it, and you get immersed. But that is also the problem, do you have time to get that involved without being entertained all the time by the game?  I wish Farcry 3 (and 4) would be more a mix of far cry 2 and 3. Where you are more free to do what you want, and you are not constantly spoonfed every minute, and less collecting stuff and upgrading this and that. It felt like filler in farcry 3 that stopped you from getting on with the game. Far cry 3 is a better game. But Far cry 2 is unique, special and amazing, and it has created a deeper effect on me than far cry 3.",
            "review_score": "1"
        },
        {
            "review_text": "Visuals great, Gameplay great. It really feels like you are in Africa tearing through the jungle. Epic game 8.9/10",
            "review_score": "1"
        },
        {
            "review_text": "I'm only about 3 hours in and I'm already hooked. I'd say its one of the better Far Cry games already. It doesn't have a perk tree, but I would say that is to it's benefit here. You have to go survive on your own gut. After the Malaria of course. If there was an option to holester my gun, walk around and observe and take in the view, I would do that. But this is a dangerous world, there are barely any friendly NPCs outside in the world. It is taken by two factions I believe. Everyone on the open world is dangerous. All you have is a rusty rifle taken from someone you happen to find along the way with your Pistol and machete. I think this game would be fine if it doesn't have a story and is just exploring the medium/large scaled world. I think the world here feels just right. It has jamming and wear on weapons too. Sounds bad at first, but Africa. You also have to take pills sometimes because you have Malaria, but Africa. Also play on the Hardest difficulty, or the 2nd hardest one. They give challenge and rutheless enemies. I'd play on the hardest more if they won't stop shooting me through walls, but I choose it anyway because it limits how much I can carry at once. HUD is very minimal, compared to later Far Cry games, they are a mess. I feel as though this is what a Far Cry game should be. You don't rely on perks or upgrades as much here, just your own wits and skill.",
            "review_score": "1"
        },
        {
            "review_text": "Starts game with Malaria  10/10 would catch Malaria again",
            "review_score": "1"
        },
        {
            "review_text": "I've never been more anxious to hear a car in my life.",
            "review_score": "1"
        },
        {
            "review_text": "Great game that will keep you entertained for hours.  Big world to run around and ride over some enemies until you have malaria. Still the best Far Cry in the series in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "This game is... Okay. My biggest gripes are the sometimes long travel times... And it starts to really wear on you by Act 2. I dunno if I can finish this game cause of that. :\\ The gun jams and stuff aren't a big deal... just the running back and forth. NOTHING like the first game.",
            "review_score": "-1"
        },
        {
            "review_text": "Caught Malaria, gutted people, steal diamonds, burned forests, killed animals with grenades.  I regret nothing!!",
            "review_score": "1"
        },
        {
            "review_text": "Malaria-infestd ♥♥♥♥♥es all on me, grinding they booties on meh jeep laddy.",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot to like about Far Cry 2, but it also has more than its fair share of problems. It really gets a worse rap than it deserves, even though many complaints about it are valid.  First off, the good. The game is absolutely beautiful. The CryEngine graphics look amazing, from the lush jungles, to the vast deserts, to the dilapidated villages and towns - everything is great. The character models, the vehicles, the water and waterfalls, the shifting weather patterns, the various guns - I can't say enough good things about them. The combat is visceral and satisfying, with realistic effects like guns jamming and breaking from too much use. The AI is generally smart - they communicate, flank, and call in backup, but it's inconsistent, too. Sometimes they stand in the open or leave cover when they shouldn't. Sometimes they have superhuman vision and hearing, other times they can walk right by you and not notice you at all. Overall, though, it's fun to get into firefights, and the game gives you enough leeway to decide if you want to fight up close or from a distance, quietly or loudly. The vehicles handle generally well, with the exception of the horrible hang-gliders, and there are a variety of fun ones to choose from. I really had a lot of fun playing the game for the first 20 hours or so - then the game's faults started to become more and more annoying.  I think the biggest problem with the game is the repetition. The game is far too repetitive to be as long as it is, or maybe it's far too long to be as repetitive as it is, but either way it doesn't play out well. The issue is that you literally do the same 4 or 5 missions over, and over, and over again through the entire game, all while having to drive insane distances to complete the missions, and while constantly having to clear checkpoints you've already fought your way through. Like I said, this wasn't a dealbreaker for me for the first 18 or 20 hours, but at that point I finally reached a major turning point in the plot, looked at my progress and saw that I had only finished about 50% of the game. The game then just pretty much shifted locations, but all the mission types stayed the same, and I decided that I was just getting bored with it. At that point I took a 2-month break from the game. That helped a bit, as I was able to come back in and finish, though still without the joy I had gotten from the first few hours when everything was new and fresh. The fact that the story is incomprehensible and the voice acting was absolutely painful didn't help, though, and made the game more of a chore than it needed to be.  All in all, it was a fun and amazing-looking game, despite its flaws. I got it cheap, and at 30 hours I sure can't say I didn't get my money's worth. I'd recommend it, just know that you'll have to be patient with it.",
            "review_score": "1"
        },
        {
            "review_text": "It's not the best Far Cry but it's a pretty good game but with a really annoying default: Malaria.  I would give it a 7.5/10 but cause of some weak points i'm giving it a 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Atleast it's not Ebola.",
            "review_score": "1"
        },
        {
            "review_text": "As far as I'm concerned, this was the game that addicted me to the 'survival shooter' genre and I have never encountered another game with the same realistic-yet-stylised approach which both allowed the feeling of general superiority over enemies while still maintaining a sense of mortality and real danger. Not quite as gritty as S.T.A.L.K.E.R. but also not an overpowered player character experience like Crysis. Both are also great games, but this is the uniquely satisfying middle ground.  Being an older game, it is more limited by its engine in many regards, such as enemies' strange ability to see the player from incredible distances and snipe with improbable accuracy, but forgiving it the wrinkles of it's age, it's still a great experience and one I would recommend to anyone interested in a realistically-influenced shooter without the complications of 'hyper-realism'.",
            "review_score": "1"
        },
        {
            "review_text": "Magical Car Keys That Will Start Any Car Simulator",
            "review_score": "1"
        },
        {
            "review_text": "A bad game. Makes you drive around the map back and forth a hundred times, respawning every mob on the way, feels like endless grind without progress and any rewards.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring. The game can be pretty and interesting for short periods, but then you get a mission that requires you to cross the map, and there goes thirty minutes of battling through the same checkpoints that you cleared for the last mission, battle into the facility that you've cleared three or four times before, attempt to save a buddy who insists on fighting while surrounded and at close range. I love the open map, but what makes a game is fun, interest, and storyline. This game features none of those.",
            "review_score": "-1"
        },
        {
            "review_text": "best far cry after far cry 3",
            "review_score": "1"
        },
        {
            "review_text": "Vastly superior to Farcry and Farcry 3/4 ",
            "review_score": "1"
        },
        {
            "review_text": "In the first 20 minutes of the game I had to restart my game 5 times, found over 4 bugs and crashed my pc 2 times now. It's a buggy mess, but I guess it's good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is made infuriating by the enemies who have perfect aim and will hit you from hundreds of meters away, behind foliage, during the night. There are enemy camps littered all over the map and you can't just drive through them; not only will the enemies start shooting at you instantly, they will even give chase. You can clear out the camps but as far as I can tell they get repopulated as soon as you leave.  You have to constantly stop your travels to deal with the camps, and clearing them out isn't even a challenge, it's just boring; it does however make exploration feel like a slog, which is not a good thing in an open world game.  At one point I was exploring the wilderness during the night, far away from any camps, when all of a sudden a jeep came at me from nowhere and three guys started shooting at me. Not only is this frustrating but it's also immersion breaking, which is sad because the game really tries to provide an immersive experience. I liked that you have to use a physical map and that the camera stays first person during driving.  If the enemies would be less aggressive and they couldn't see you through foliage this game would be a lot more enjoyable. At this point the best thing about it is that it doesn't use Uplay.",
            "review_score": "-1"
        },
        {
            "review_text": "nice game. and nice multiplayer ",
            "review_score": "1"
        },
        {
            "review_text": "The game works as intended no crashes etc and the game engine is great. It simulates a degraded part of Africa well.  But game design elements are not well thought out and this makes the game a real drag to complete. For example It is not clear how to progress the main missions, there is no option for a persistent hud to show essential info like health.  One example: When you need to go to the faction HQ to get missions you need to: drive there, (this can take a long time, get harassed on way a further nuisance), get out of car, walk around concrete barricades, go to front door , get searched, open door, walk into building walk across room up stairs to room with boss and chat for 30 seconds before finally being handed a manila folder with mission, then walk to stairs go down, cross room, open door, walk around concrete obstacle course to your car start car and drive to new mission! Every time you want to do a mission! about 20 plus times. It's boring and a waste of time you should do it once, then new missions just appear after you complete current one. There are many other examples... Only buy this game it if its really cheap and you really love this type of game, the over simulate the real world type of game.",
            "review_score": "-1"
        },
        {
            "review_text": "Has a better story than the next 2 but that isn't saying much... but the game is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "+ Action packed + Mechanics are ok + Looks good  - Repetitive - Sense of accomplishment: zero",
            "review_score": "-1"
        },
        {
            "review_text": "I've played through Far Cry 3 at least four times and recently completed a second play-through of Far Cry 4, so I thought I'd go back to Far Cry 2 since I’ve only played it once before. I've only gotten through a few missions now and I'm already sorry I gave it another shot. While the visuals are fairly impressive, there are so many aspects of this game that make it bad.  FC 3 did a great job of addressing the major issues with FC2 which, in when you compare the two games, really makes you aware of how bad FC2 is. The biggest problem is how long it takes to get anywhere. Traveling by vehicle speeds up your travel time, but the terrain is setup so you almost always have to go around any hills, even short ones. The map system is meant to mimic having a real map in your hand, but since you can only get a close-up view of the section you’re currently in, you can’t look around other areas to see if there is anything interesting you may want to explore. You also can’t add a waypoint to where you want to go, so when you’re traveling you constantly need to have the map deployed in order to keep visual track of where you’re trying to get to.  The ability to easily kill enemies isn’t consistent with logic. Headshots don’t always instantly kill an enemy, which I can understand if you’re at a distance and you potentially don’t get the shot dead on. However, standing right next to an enemy and shooting them in the head at point-blank range doesn’t always kill them instantly either. It would make sense that a shotgun blast to any part of the body should at least cause them to fall down, but I would frequently unload three shots at point-blank range before they tumble.  There are a number of other problems with the game, but just the combination of these two factors make the game difficult to enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "Played for 9 hours straight. I have a very weak laptop, it runs like crap on just about all games i play. It runs very nicly on my laptop on mediam graphics. The AI are good but will have stuipied moments. Comabt is fun. more than enoff veicles avalible for travel Fun game. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "If you don't want to get frustrated trying to play a game don't buy this game through Steam. There are so many bugs in it that I didn't get past the first room due to them!",
            "review_score": "-1"
        },
        {
            "review_text": "The game is good, but the graphics aren't great as the game is fairly old.",
            "review_score": "1"
        },
        {
            "review_text": "✔",
            "review_score": "1"
        },
        {
            "review_text": "A big and empty open world. Most of the time you are running for a few points of interest. The shooting is solid and the game looks nice. The idea of a complete first person POV is nice and the ideas with healing your self is iteresting. But that is it. All you did is run to points of interest and shoot the same outpost of soilders that always respawn then do anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "By far one of the best games I have played (after Half Life 2).",
            "review_score": "1"
        },
        {
            "review_text": "heck yeah. GG",
            "review_score": "1"
        },
        {
            "review_text": "When telling one of my friends about my disappointment with this game he said 'Did you expect being stuck in africa with malaria to be fun?' which I felt summed it up pretty well...",
            "review_score": "-1"
        },
        {
            "review_text": "Open world Africa.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "First of all: I DARE YOU, I DOUBLE DARE YOU NOT TO USE QUICK SAVES ON THE ENTIRE PLAYTHROUGH IN MAX DIFFICULTY. That's how you'll enjoy this game at its best. Those QS kill the feeling of depsperation and nervousness the game wants to build when you are sorrounded by 3 dudes with shotguns and one in a mounted MG, forcing you to be precise and clean on each shot to fight for not losing ALL YOUR PROGRESS.  Easily one of the best FPS games I've ever played. The level of immersion its over 900! So immersive that there is practically no HUD (this immersion is only F-ed up by the fact that there are no predators, lions or hyenas, ITS A ♥♥♥♥♥♥♥ AFRICAN COUNTRY FOR CHRIST SAKES). The environment, landscapes and sounds are so AWESOME that I didn't mind the driving (But seriously, not every enjoys driving that F-ing much). This game is not as hard as FC 1 (that one was a PAIN in maximum difficulty in certain parts that I didn't enjoy much), but hard to beat still. This game is hard in a much more entertaining and fun way than its predecessor. Speaking of which... the voice acting is still bad here lol, but the AI is as smart (if not better). You feel a 'YES, YES, YEEES I DID IT' instead of the ' AT LAST GOD DAMMIT' of FC 1.  You'll feel harrased by the enemies and God... you'll become paranoid waiting for an assault truck to come out of nowhere when you have just one health bar and no syringes left. This is the Dark Souls of the FPS (in my opinion). Every mission completed gave me that rewarding feeling. Even more if I did it full-sneak. The only thing that pisses me off is that Ubisoft promised animal DLC (in its time) and never did it.   If you want challenging FPS that will make you just jawdrop, helpless and powerless, each time you get killed and watch how you just lost 1 hour of playtime for distracting a fraction of a second (pretty much like Dark Souls if you play it for the first time), then this is for you. You gun jams/breaks, the save points are sometimes so far away that you'll want to cry ( I repeat DO NOT USE QUICK SAVES, it kills the experience) and the ammo is VERY limited.",
            "review_score": "1"
        },
        {
            "review_text": "Forgot to save and had to repeat 5 missions.  10/10  thanks ubisoft",
            "review_score": "1"
        },
        {
            "review_text": "Screw Far Cry 4, this game is glorious! I absolutly love it! Besides the multiplayer having no life, and the bugs that happen sometimes, this game is a game I would definetly recomend buying.  9.5/10  Set Africa on fire.",
            "review_score": "1"
        },
        {
            "review_text": "Oblivion meets African Savana + Guns &amp; Drugs",
            "review_score": "1"
        },
        {
            "review_text": "beautifull game good job ubisoft",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS BETTER THAN FAR CRY 3!",
            "review_score": "1"
        },
        {
            "review_text": "Eh. Better than 3.",
            "review_score": "1"
        },
        {
            "review_text": "Its kinda okey but I would not recommend the game,I mean you can get it on sale but eeh",
            "review_score": "-1"
        },
        {
            "review_text": "My favourite Far Cry game. Excellent storyline, beautiful graphics, great characterizations and fun gameplay. It's more like Farcry 1 than Farcry 3 or 4 in that there are not many activities other than following the story and doing missions but this makes the game less complex and more story driven. Unlike Farcry 1 you can easily go back and forth to most areas. Downside is that you may be chased a lot which is fun or not depening on your perspective. Lots of combat.",
            "review_score": "1"
        },
        {
            "review_text": "Dont buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I really find this game enjoyable. I can't always seem to be as stealthy as I like. but the worlld is huge, there is a good amount of things to keep you occupied. pretty terrain and atmossphere. I do recommend it. I first was introduced into far cry by Far Cry Instincts on original xbox. I loved that game. it was defiietly much more stealthy but not open world. I look forward to playing Far Cry 3 next I own, and then checking out Far Cry 3 BloodDragon hte 80's parody one.. hope Far cry 3 is still massive open world with some more stealth features like Instincts had..",
            "review_score": "1"
        },
        {
            "review_text": "Most people run into an glitch that makes it impossible to proceed in the story. Ubisoft promised to patch this but havent still done so. These liars don't deserve your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Easily one of the best games of all times. Still holds up to this day in every aspect. No other game for $10 will get you as many hours played as Far Cry 2.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when it first came out. The gameplay is very good and the story is top notch. Voice acting lets it down a bit though but that's maybe to be expected from a game from 2008.   Personally I wouldn't recommend buying as there seems to be an issue with NPCs bobbing up and down on solid ground and glitching about when you try to talk to them which stopped me from progressing past maybe the fifth or sixth objective.   By all means get the game and see for yourself, if it works then play on but I've already played the game too much to bother fixing it.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine this.. You're driving on a quiet dirt road.. then all of a sudden, your windshield gets blown out with gunfire, from 4 different directions.. You're heart pulses fast, as YOU HAVE JUST GOT THE ♥♥♥♥ SCARED OUT OF YOU.  Buy it, or I'll find you, and beat you into a coma. -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Three words,  Malaria, hijacking simulator",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 is a stellar example of a game that appears to have a lot going for it, but isn’t actually worth your time. The open world design feels barren, needlessly large, and pointlessly shoehorned in. Everything in the game boils down to binary decisions. All of the guns feel wimpy and samey. The one-note mission design and unrewarding treasure-hunting collectathon prevents anything interesting from happening within the world, making the entire experience feel rote. None of the characters have any personality, and the plot isn’t memorable. Even the more impressive technological feats, such as fire and the day/night cycle, have little impact on gameplay. At best, Far Cry 2 is generic, boring and forgettable.",
            "review_score": "-1"
        },
        {
            "review_text": "I know it's not fair to compare a game made in 2008 to one made four years later. But I started by playing Far Cry 3 and enjoyed it so much I thought I might as well try it's predecessor. Not a good idea. Number two stinks.  It lacks almost everything that makes FC3 a great game. FC2 has a dull story line, and most missions are exact copies of earlier ones, especially the side missions. Example: to unlock weapons you have to blow up a convoy coming from the east. And then one from the west. And south. And yes, dealing with the convoy coming from the north is exactly the same; they drive around in circles, you blow the lorry to smithereens and you're done; you can proceed to the next mission. Public transport is the best choice to get there, as driving a car or boat takes about 10 times longer. That's because every 100 meters you have to deal with two homicidal maniacs in a car or ten of them at yet another road block.  You have a choice of nine to pick your main character from. It doesn't matter much which one you pick. Every character in the game has a personality as flat as roadkill at a monstertruck show.  The feeble attempt at a story line is hard to follow for someone who's not a native speaker, like me. Everyone speaks as if they've just done an ounce of speed, and even the subtitles have a hard time keeping up. From what I picked up, the story basically goes like this: first you work for this person, then you work for that person, then you work for another person, then you kill one of them and another person appears. You work for that person too, and then for another person and then you kill one of them and another person appears. Repeat until everyone dies. Game over.  So, no. I do not recommend buying this game, even though the graphics are pretty awesome for a game made in 2008. I  do  recommend Far Cry 3 though, which was fun, entertaining and trippy.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Bugs galore, some critical to point you can not continue the game. Whole malaria thing is pointless and annoying. Missions all the same, drive one side of map to other - get shot at - by people at points you cleared earlier - take malaria tablet - back in car - drive - yawn.",
            "review_score": "-1"
        },
        {
            "review_text": "so. effing. dull. it has its fun parts, but not too many of them.",
            "review_score": "-1"
        },
        {
            "review_text": "Played this game on Xbox 360 ALOT, this is a great game. Buy it. I love it. Its the best one in the series. It might show its age with a couple things but if you can get pass those things, its a awesome shooter. If you can't get pass some of the aged mechanics get Far Cry 3.",
            "review_score": "1"
        },
        {
            "review_text": "Hey all, remember Far Cry 1? That was great. You were in a big ol' open world, and you could find these shots that gave you animalistic super powers like leaping and attacking. You took shots and they made you like unto a God.   Far Cry 2 is similar, except now when you take shots they are anti-malarial shots, and the awesome benefit they provide is that as long as you can find them and take them you don't die! So awesome! I love driving around the map, fighting off the stupid AI and searching around for green vials that let me play the game awhile longer. It's like playing an old arcade game, except instead of running out of quarters, your character just runs out of the will to live.  It's really my own fault though, I mean Far Cry 1 had super powers, and I just assumed Far Cry 2 would as well, or at least maybe not a constant life threatening illness.  Let's forget the maleria for a second, even though the game never does, is the rest of the game good? No.  Here's, honestly, my biggest gripe... ok, second biggest after the lack of super powers as given in the first game... ok, third biggest after they took away those powers and gave you a debilitating illness... So, my third biggest gripe is just how boring this game is, namely, how long it takes to get anywhere. They gloat about this giant island that you get to sandbox around in, however it seems that half of it is covered by impassable mountains. You want to go someplace literally two inches away on the map? Have fun driving around the mountains for ten minutes to get there. Want to do some awesome off roading and just ramp yourself over the mountain like in, literally, EVERY OTHER ♥♥♥♥ING SANDBOX GAME? Too bad friend, because you can't drive there. Unfortunately your off-road mountain-jeep can really only handle the dirt roads.  Ok, I'm getting bored just remembering playing this game, so I'm out. I just couldn't in good conscience leave all those positive reviews below without doing my part.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible Game, has no immersion, very repetitive, and story has a lot missing. Game play and combat are unoriginal and lacking.",
            "review_score": "-1"
        },
        {
            "review_text": "Loved the first Far Cry and was hoping to love this as well. However I'm 20% through the game and I'm not going to be playing again. If you like driving around on dirt roads than this is the game for. You will probably spend more than 50% of your play time just driving from place to place. Tedious as hell and I'm not interested in wasting my time anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy this game a lot, but I can't in all honesty or in good conscience recommend this game to anyone. It's so repetitive and surprisingly dull in terms of story. 'go to this place, kill this guy'...'go to this place, blow this up'... WOW. The visuals alone are just not worth it. Also, even on hardest difficulty this game is too easy. Despite having to unlock various 'safehouses' to save your game along the way, the PC port offers you unlimited quicksaves at any point during the game, which is hilarious and takes away any kind of stress from the game.   It's beautiful, but it's repetetive and dull with stupid A.I - but stupid A.I that seem to have wall-hacks because as soon as they spot you that's it, they know exactly where you are and where you're going to pop your head out - even if it's night time and you've bought camo (pointless upgrade) and you run a mile around a camp and sneak back in they know exactly where you are.  Buy it if it's on sale (I got it in a sale bundle with Far Cry 3) then sure, go for it if it's a bargain but it's not worth the full price.",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game on PS3 and it is definately my favorite Far Cry but upon getting the steam version I noticed a lot of small AI bugs that were funny as I usually do not mind these but it started happening to the dialogue with npc's and I would have to reload a save in order to continue on.  This an amazing game but this PC port is not good",
            "review_score": "-1"
        },
        {
            "review_text": "8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is yet another game I found too annoying to finish. Seriously, what the ♥♥♥♥ was the point of giving you Malaria? To make me hate the game? Because thats what happened.",
            "review_score": "-1"
        },
        {
            "review_text": "A hardcore Far Cry 3 prototype set in wartorn Africa, for better or worse.  PROS: - The Jackal - Resourceful AI - Satisfying gunplay - Minimalistic but interesting story - Bleak but gorgeous African setting - Generally strong voice-acting - Memorable buddies - Beautiful at day  CONS: - Far Cry in name only - No leaning or proning - No playable female character - Many underused gameplay gimmicks - Backtracking, lots of backtracking - Lack of meaningful story choices - Uninteresting side-quests - Dubious story moral - Ugly at night",
            "review_score": "1"
        },
        {
            "review_text": "Not nearly as good as Farcry or Crysis but its decent.",
            "review_score": "1"
        },
        {
            "review_text": "Bug collection. I gave up and deleted.",
            "review_score": "-1"
        },
        {
            "review_text": "Where did you get that scar, eating pineapple?",
            "review_score": "1"
        },
        {
            "review_text": "Better gameplay. Uninteresting plot.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring! Its an open world game. That i dont think a good job was done of. Far Cry 1 was a much funner game. I played maybe 10 hours before I couldnt stand it anymore. Really, I want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "ITS AWSOME (shame you cant join an afican warlord faction that would be even better)",
            "review_score": "1"
        },
        {
            "review_text": "I see tons of reviews where people praise this game over Far Cry 3 and 4. I can understand that the realism adds a different layer of depth and immersion that the newer games lack to a high degree, but the gameplay feels far less compelling here. Between having to keep yourself healthy, unjamming your guns, the constant driving all over the map, and the relative lack of direction for what to be doing I found myself being frustrated with the game more than I was enjoying playing.  When this game is good, it's actually a lot of fun. Sadly, I found these moments to be too far apart to justify recommending it for anyone else. Maybe if you can catch it on a hefty sale, but keep in mind this game plays extremely differently from the following entries in the series.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't personally play this anymore. The amount of forced tutorials and long-winded cinematics (They even stop talking if you walk 4 feet from them, so then they start monologing THE WHOLE CONVERSATION ALL OVER AGAIN).  Mix this with the walking/driving around and ridiculous amount of diamonds to collect that makes it tedious to play.",
            "review_score": "-1"
        },
        {
            "review_text": "shout really loud",
            "review_score": "1"
        },
        {
            "review_text": "The stealth is horribly unrealistic, and I don't remember much of playing this and I am kinda glad. The story starts off really nice, but it is ruined by awful level design. You start off being able to use your binoculars to scope out the area that you have been told to kill off everyone at (it is a drug cartel thing). That starts off really well, and then you must infiltrate the base. That is where it gets awful for me. Crawling across the hill didn't work, I was spotted numerous times and shot to death because there was no cover. From there on, I recall going in there guns a-blazing and getting it right, then to get to a bed on the road and say 'no thank you' to playing more of that.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont know, just wasnt a big fan of this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun game but very bland and very few weapons. Not worth the money.",
            "review_score": "-1"
        },
        {
            "review_text": "'I have far cry and i have far cry but i am not cry' -PCgamer",
            "review_score": "-1"
        },
        {
            "review_text": "I was bored to death from this game and just look at my play time.Guns sound like ♥♥♥♥,theres like to colors in the entire world etc.Im just gonna request a refundf for this game and going to buy some keys and cases for csgo.Wish me luck m8's",
            "review_score": "-1"
        },
        {
            "review_text": "in a massive firefight, gun jammed, die, rage. 10/10 would rage again",
            "review_score": "1"
        },
        {
            "review_text": "Get Far Cry 3 instead, same idea done far better in every aspect.",
            "review_score": "-1"
        },
        {
            "review_text": "Ebola Simulator 2008   10/10 would become infected again.",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT BUY!  This game is terrible. It is a direct console port, the graphics are dreadful, the input lag is tear-worthy, and there's no way to set 'toggle aim,' so you must hold to aim, which is painful. After 20 minutes, I've decided to never touch this game again. Please don't be fooled by the quality of the first Far Cry and the third Far Cry, this is the weak link in the series.  Far Cry 1 and 3 are defo worth buying though, they're great.",
            "review_score": "-1"
        },
        {
            "review_text": "Its beyond glitchy and kind of unplayable...I'd reccommend Far Cry3 or FC3:Blood Dragon instead. Playable, not broken, and better games in general. To name a few problems I encountered quests getting stuck randomly, random enemies falling/glitching through the environment and vehicles. I payed $5 on an awesome steam sale for all of Far Cry2, but the first 10 mins of the game kinda told me why.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is a good single player experience with plenty of things to d...... oh wait no there isnt. you can raid towns or villages or complete missions, but that is about it aside from the multiplayer (there are only about two servers online but the multiplayer is fun none the less).",
            "review_score": "-1"
        },
        {
            "review_text": "Bullet sponge enemies (handfull of bullets at point blank range and they're still standing), bad AI, horrible map functionality, stupid malaria mechanic (among other things preventing you from running more than 5 meters or so).   Not a bad game per se, but there are a lot of similar games (like the sequals) that are way better. Far Cry 3 and 4 were fun, Primal is too ... but this game isn't for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible broken game with lots of very obvious glitches - NPC jump arround the map and on the spot, they stand in yoru way so you can to your objective etc. This game is boarderline unplayable. Shame as the concept seems good.",
            "review_score": "-1"
        },
        {
            "review_text": "Even though this is a negative review I understand why many people enjoy Farcry 2.  The open world feels rich, the combat is brutal and intense and the story builds up to an interesting point which helps to make it fun.  The negative: I find that this game is against you the entire time since there is no real point in liberating outposts like there was in Farcry 3, the world is threating and unforgiving but in a way that makes me feel like the game is constantly being cheap and punishing me for try to play the way that I want which is mostly stealth. Also even though the story is good it doesn't make much sense at times and it just feels like that you want to get a faceless character to survive in a fiery hellhole in the African sahara.   I would give this a 6/10 which is something that I really thought hard about but I felt everything in 2 was done better in farcry 1 and 3.",
            "review_score": "-1"
        },
        {
            "review_text": "open world linear game, press 5 to answer phone and receive orders from crappy voice actors",
            "review_score": "-1"
        },
        {
            "review_text": "Incredible game. You should pay up to $100 for this game.",
            "review_score": "1"
        },
        {
            "review_text": "Really Dislike this game.. From experience from playing Far Cry 3/4 This game looked semi decent for being aged, as time goes by I discover how much things I dislike about this game and this game as a whole. I think the advertisment is a bit over hyped and doesnt look like what it is really like in game. The graphics are terrible and the story line is so slow...  -WOULD NOT RECOMMEND-",
            "review_score": "-1"
        },
        {
            "review_text": "What kind of stupid ♥♥♥♥♥♥♥t game doesnt have a quicksave system but makes you travel HOURS to get to where you need to go I'm tired of this ♥♥♥♥, when you kill enemies at an outpost they respaw fresh like as if they had cloners, you cant clear the outposts. and aks have the bolt on the left in this game, the springfield takes stripper clips from the bottom and theres no point in having a suppressed weapon because no matter where you shoot with a suppressed weapon its an 8 hit kill giving the ♥♥♥♥head time to scream, seriously ♥♥♥♥ this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible, here's why:  The AI is so freaking difficult and you can't combat it well because either 1) Your gun jams every 10 seconds OR 2) Your car breaks down every 10 seconds  As a result, you just keep dying over and over again.  Because the world is so huge, it's a LOT of travelling which gets old quickly.  The design for driving is HORRIBLE, it seems impossible to steer. This is a problem when 90% of the game is driving.  Get Farcry 3 or 4 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty bad lmao",
            "review_score": "-1"
        },
        {
            "review_text": "Great game that is very gun realistic. ",
            "review_score": "1"
        },
        {
            "review_text": "This game hates you. No, actually this game just doesn't care about you. You don't matter, there are much bigger things going on. There is a war crushing a nation and you are a meaningless fragment. Yeah, as a game it has problems. But it treats you in a way few other games dare to, and that is worth something.",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 is a fun, gritty shooter with satisfying gameply, lots of explosions, and great graphics. Get it for a challenging sandbox FPS game.",
            "review_score": "1"
        },
        {
            "review_text": "My bottom line: Buy it if you're at all a fan of FPS Action/Adventure/Open World games. Yes it's got some annoying flaws that are typical of open world games circa 2008-09 - AI can be dumb, map finding is a bit tedious sometimes, could've had a better selection of weapons, could have used a climb/mantle feature - and some won't like the grittier world (it's less 'pretty' than the other games in the series; lots of brown shades), but you really feel like a mercenary in a country where everyone's aggressively out to get eachother. It's entertaining, quite long, ambitious, and still has some of the nice, balanced difficulty factor of Far Cry 1 which unfortunately 3 and 4 are lacking in. I feel this is an underrated title, and if you missed it when it came out, I recommend picking it up. Doesn't hurt that it plays beautifully on older systems. ",
            "review_score": "1"
        },
        {
            "review_text": "Its like far cry 3 except without the boob scene",
            "review_score": "1"
        },
        {
            "review_text": "DONT ♥♥♥♥ING PLAY IT. I WANTED TO LIKE IT I REALLY DID. BUT THIS IS GARBAGE, EVEN WITH DYLANS MOD GO PLAY SOME GTA IV MULTIPLAYER INSTEAD",
            "review_score": "-1"
        },
        {
            "review_text": "I played Far Cry 2 after I played Far Cry 3.  It was neat seeing an unpolished version of what would lead to Far Cry 3. As a study in video game evolution, it might be worth it.  Pros -You can see the map while driving vehicles (you don’t have to toggle between the map and playing)  -Weapon degradation. I actually liked this. You had to make sure your weapons were in good condition before jumping into a fight. If you didn’t, they could jam, or even break, and you would have to scrounge new weapons. Undone a little by having infinite free mint weapons at the weapon store.  -The bolt-action sniper rifle is very satisfying.  Cons -No fast travel (not quite accurate, but close). Anywhere you want to go on the map, you have to move yourself. It makes you appreciate vehicles very much. There is a bus system, but the bus stops are few, and in remote areas. More than half the game will be spent in transit through the beautiful but repetitive African landscape.  -You cannot save outposts, so even if you destroy a checkpoint, on your return trip, it can still be dangerous. Nowhere is really ever safe.  -The challenge does not scale. Enemies do not become craftier, or carry better weapons, or a variety of weapons, or equip armour. The enemies you fight at the beginning are the same ones you fight at the end. From a narrative perspective, this makes sense, but as soon as you have your preferred weapon set, the game becomes a matter of rinse and repeat (again, most of which is spent driving).  -Story. The story barely exists, and does not really grab you. The main and side missions rarely seem to make sense, but you do them to progress the plot or unlock things. There is no variety (even in the dialogue) to the side missions for the gun shop or assassinations. You end up working for both sides in the conflict, but secretly, so out in the field, everyone is hostile. When you see someone, you don’t care to identify what faction they are (it doesn’t matter), or even if they’re hostile (everyone is), you just go ahead and shoot.  -Characters. The characters seem as if they were written intelligently, and then poorly executed. You never really learn what any of their motivations are, or even why they’re around. Your buddies just kind of show up, and then you’re magically friends out of nowhere. The dialogue is delivered fast, and without a pause for breath, making it sound very bizarre. Especially since the player character is silent.  -personal pet peeve: every single weapon is left-handed, but used as a right-handed weapon.  Conclusion: This game is more like a driving simulator set in a war-torn nation than an action game.",
            "review_score": "-1"
        },
        {
            "review_text": "The first thing you notice about Far Cry 2 when you first set foot in (rather, sit down in) it is the absolutely gorgeous visuals and unique setting. For a game that came out all the way back in 2009, the visuals are outstanding, even when compared to new AAA titles that have come out just this year, especially if you are playing those new games on a console. This isn't only due to the setting of the game either. Most of the texture work is fantastic, with weapons and vehicles that show battle damage and rust (weapon rust is also part of a gameplay element in which your guns can jam), and excellent character models/textures. Every aesthetic element in this game screams polish. These visuals are made even more impressive when you realize the entire map is seamless. There are no loading times unless you fast travel or die, and the two parts of the map available (one unlocked later on in the game) are both absolutely massive. All of this is enhanced once you install one of the variety of different ENB mods available. Personally, I used the GES (Graphical Enhancement Suite) mod, although there are plenty more options to choose from. The only real complaint with the visuals I can think of is that the water looks good until you actually take a dive under it, at which point looks like the developers just went 'Screw it, throw a greenish-blue tint over the screen and then let's go get lunch.' This, however, is more of a nitpick than anything.  After choosing your character (none of which are female, which is a strange design decision), viewing the opening sequence and a few tutorial missions you are let loose to explore, ♥♥♥♥, pillage, and murder as you see fit. Believe me when I say you will want to explore this gorgeous setting. I am unaware of any other game that puts you in a war torn Africa, let alone one that lets you explore war torn Africa. I was compelled to explore the landscape based on the locale alone, despite the problems present should you choose to roam around. It is explained to you within your first few minutes in Africa that the only currency accepted in this land is diamonds. Doing both main and side missions rewards the player with diamonds, however they can also be found in small cases while traveling the land, with the help of a detector you get which points you in the general direction of them. This presents the first problem with just going off and exploring. There are a ton of diamond cases scattered around the map. (over 600 if memory serves) On one hand it is nice because you often run into them while doing missions anyway, however it becomes problematic if you just wish to explore to find them. The vast number of them means that each one has very few diamonds in them, anywhere from 1-5 diamonds per case. This means that trying to earn money by treasure hunting is extremely time consuming, especially when you consider that figuring out how to get to some of these cases can take upwards of 20 minutes. The second problem with exploration is that in the vanilla game (which I do not recommend playing, but we will get to that later) the checkpoints that are set up by the various mercenaries around the landscape respawn incredibly quickly. The way this works is that the map is divided into zones when viewed by the player. You can either view the entirety of the map, or view the zone you are currently in. (one zone normally constitutes an enemy checkpoint or facility) The problem occurs when you exit a zone, at which point everyone and everything that you just destroyed in the zone respawns. This can make back and forth commutes frustrating when you have to clear an area you were just in 5 seconds earlier again.  So with all that, how is the actual gameplay? The answer: pretty damn good. It is here that I will mention that I did not play the vanilla game. I played using the 'RealMode' mod on the 'Infamous' difficulty (which is the highest one), although there is another popular one called 'Dylan's Realism Mod.' The reason I did not and do not recommend playing the vanilla game is that a single enemy in the original game absorbs more bullets than ♥♥♥♥♥♥♥ed Luffy in the entirety of One Piece. Other than making you and your enemies die like human beings should, the RealMode mod applies some balance changes to the various equipment upgrades as well. The gameplay aspect is what turns alot of people away from this game I believe. (it is a game after all) While the gunplay is solid and fun, it is the way in which the player interacts with the world that bring people to love/hate relationships with this game. The gameplay is heavily reliant on the chaos factor. What this means is that it loves putting the play in stressful situations that they have little control over. (although if you are good enough you can most definitely manipulate the environment to your favor) It is these 'Oh ♥♥♥♥ oh ♥♥♥♥ oh ♥♥♥♥' moments that truly make the game shine in my opinion. You just charged a base in your vehicle, you get out in the middle of a grassy field. The enemy comes after you. You throw a molotov cocktail, hoping to catch fire to the grass, preventing your foes from easily accessing you. But oh ♥♥♥♥, a guy you didn't see before has a rocket launcher, he fires, blows up your vehicle, now there is fire spreading to you from behind and in front, you see enemies attempting to flank you, you fire, but now your gun is jammed and the enemy closes in as you scream in your head 'WHAT DO I DO NOW OMGWTFBBQ!!!!' These kinds of unscripted, player and AI driven epic moments were easily the best part of my experience with the game. The AI is also top notch, as they will flank, call out to each other, carry wounded, and spot you from far away if you aren't careful. There is also an upgrade system for both weapons and vehicles, which you purchase from a shopkeep whom also provides you with side missions that earn you new gear. It is unfortunate however that there are only two type of sidequests in the game. There are assassination missions (which are fun and allow you creative ways to down your target) or the shopkeep missions which only ever involve taking out a convoy of vehicles. These are still enjoyable mind you, the lack of variety is just a little bit disappointing. There are alot of different loadout combinations to play and have fun with, along with a true 'do things your own way' feel. I should also mention that stealth in this game is difficult. Not impossible, just difficult due to the intelligent AI and the lack of a melee stealth takedown. Seriously developers, stealth without stealth takedowns (or at least a silent one shot melee weapon)= don't do.  Now the story, in my opinion, was not that compelling. Save for a few great moments, I honestly don't remember much about the story. It isn't bad per se, it is just sort of generic. What is good about it is the fact that later on in the game you get choices that affect the story. These choices are really just the ability to let certain people live or die. The other great part about the story is the buddy system. Some of the characters you get the option to play as before you start the game as well as some ones that you can't play as may show up in your game and offer their help. They help you in one of two ways. The first is that they will call you up during main missions and offer you an alternate way to complete the mission along with their help. This can lead to some really great moments. The second is that if you fall in battle, they will bring you back up to your feet. This is a game I love and will recommend to anyone, especially at the average sale price of $2.49. (Review shortened due to Steam character constraints)     ",
            "review_score": "1"
        },
        {
            "review_text": "Intense gunfights in a somewhat bland open world. For a gritty experience, play on at least hardcore difficulty. 4/5 roadblocks.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting emergent open world combat. Gets a little bit repetitive after a while. Not much narrative, just bits and pieces here and there. Not bad, but falls a little bit short.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't a fan of this game at first, but it really grows on you. This is a truly open world environment, and the game has a message to it that is a lot deeper than most games you will find.  Plus, the missions are difficult and this game hands you nothing. Furthest thing from being cookie cutter. Bonus points for that.   Great game. One of my favorites.",
            "review_score": "1"
        },
        {
            "review_text": "Oh where to begin on this one... To me it feels cheap like some kind of mod or student project. Overall I really cant help but to feel like ubisoft either didn't have resources to make it properly, because it has some interesting concepts in it, or they just didn't want to invest in to it. I did not have fun, I was not engaged by anything. NPCs are weird, friends instatnly risk their lives for you after 2 lines of monologue and enemies, well they are enemies...  Pros:  Original setting Interesting music Here and there interesting yet shalowly portraied themes Dynamic fires  Cons:  Obejct blinking highlighting - do you really need whole people to blink? Bad driving model No lean No prone No fireing modes (when surviving you dont wanna spray on full auto - thats hollywood thinking) Static environments and repetetive Same kind of same sounding same enemies Terrible voice acting Ugly art direction Badly executed and rushed story telling Invissible walls in open world on easily accessible places Unsutisfying gunplay Malaria game mechanic to conviniently annoy you Billboarded MODELS of grass - what the ♥♥♥♥?  4.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "I started in a beautiful African Safari setting, everything lookng lush and crisp, sun rays penetrating through the trees, sun baked dirt and grounds, and nice lighting....I think I'm going to like it here. The place is pretty and the locals are nice, and I thought It was gonna be alright....Then I got Malaria. Then things took a turn for the worst after that. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "40/100 Far cry 2 is really boring, the first far cry was much more engrossing.  this game you are driving around most of the time, gets really tediuos as the roads are really long and there are many road blocks( all the same fights) along the way. The action (fights) are almost always the same.. the story line hardly gets moving, that is if theres a story in the first place..",
            "review_score": "-1"
        },
        {
            "review_text": "Just don't buy it :( It is very repetetive and much of the world is not very well impletemented, not to mention a pretty terrible story. Besides there are much better games in this series such as Far Cry, or Far Cry 3.",
            "review_score": "-1"
        },
        {
            "review_text": "On the one hand I've played this so far for 17 hours. On the other hand about half of that has felt like a grind, and it's really hard to go on.  The problem with the game comes from it's generic and very repetative setup. You go find a mission, it's to go to x and kill y, and so you drive there and kill them. Along the way there are check points you must fight through. That's the entire game, repeating, so far for 17 hours. Aspects of the game do not change, ever. It's always the same enemies, with the same weapons, that you take on in the same way, half the time in the same areas (since it's an open world and a lot of territory is reused).  There are some minor parts that help with the story, such as tapes you find that help fill in background info. That 5 minutes of novelty does not make up for the rest.  What has helped to keep me going for all that time is how well polished the game is. It looks good, weapons and vehicles feel nice, and there are some cool aspects like easily being able to set off forest fires (since there is long dry grass everywhere). It's also nice sneaking through the bush hunting people down. The result is that you can easily play the first few hours and think this game is amazing. The issue is that 'amazing' ness never changes, and just repeats, forever ...  If you have *nothing* to play, and this is cheap, sure pick it up. However I'd skip it to be honest. There are a lot of better alternatives out there, such as Far Cry 1.",
            "review_score": "-1"
        },
        {
            "review_text": "Far Cry 2 is not as engaging as the original Far Cry, but it adds some very interesting ideas (vast world space) and a beautifully rendered environment. There are some things you might find annoying (checkpoints re-spawn), but some of them add to the realism (your gun can jam). It's a fun game. Be warned, though, you're not a good guy in this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you played the first Farcry, you know what the series is all about. The action in Farcry 2 is pretty damn nice and honestly I love the physics of the game. If you're looking for a shooter with a good story, I would reccomend this to you. If you're new to the series I would reccomend taking a look at the in-game guides, just so you know how stealth and other aspects work in this game.",
            "review_score": "1"
        },
        {
            "review_text": "landrover + .50 cal = fun , its dated now both graphically and in gameplay mechanics but is enjoyable still but its very easy on the eye for a wrinkly game.Very repeatitive and you may find yourself turning into a psychopath when you get a snipers rifle wounding for bait then slaughtering all that poor mercs chums with him oh and best yet no snow white to whine like a girl constantly",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 is the best game I've ever played... second to Half-life (the original). The gameplay is well thought out and challenging, the environment is beautiful, the storyline is unique, and the weapons kick ♥♥♥. What else can you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "I love this! Playing on normal a few hours in now. This game will kick your ♥♥♥ if you're not careful =D and it pulls no punches. Make sure you save whenever possible because if you slip up, you could very well have lost an hour of progress. I'm very happy with this game. The fire and destruction is unmatched to anything I have ever played.   Also, after a couple of hours of playing this game I can honnestly say that I think it's better than Far Cry 3 since it doesn't have that assassins creed-♥♥♥♥♥♥♥t where your mission fails if you get detected. You'll just have to deal with the consequences to the best of your abillities. Also, there are no ♥♥♥♥♥♥♥♥ wanted posters that requires you to kill a bandit commander specificly with a knife. Atleast nothing I've seen thus far. Plus, the foliage bends when you walk or drive thrugh bushes. The fire spreads like crazy allover the grass and sets entire trees ablaze. So much destructibles! I only miss the takedowns, popping tires and the really dense wildlife from Far Cry 3. Would have been cool to see more, like some lions and hyenas or elephants and stuff, but I might get surpriced later on :P  This game rocks! It's amazing!  Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 is by far better than the rest. It does not require a high end computer to play smoothly, it runs smooth, plays smooth, is fun, addicting and feels natural.   But I cannot find matches on multiplayer for the life of me, is anyone still playing? Am I doing something wrong? Can someone help me here, I suppose no one is pplaying online anymore.... it is the best part about this game... :(",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best open-world FPS ever made. Badly broken in many way (thanks, respawning roadblocks and utterly shonky storyline!), but the game gives you the kind of tactical freedom most FPS games can only dream of and the Buddy system adds an extra level of emotional involvement that you just don't get in other games.   I still won't forgive Far Cry 2 for making me euthanise Nasreen. DAMN YOU, FAR CRY 2!",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, lots of fun. 9/10   This is top ten for best games i have ever played. It has guns, survival, fighting and good graphic considering it was made in 2008. There are only a few problems with it. I find it's difficult to move around the open world because there are enemies and outpost everywhere. Though this give a much more survival feel to the game and really makes you plan out your movements/attack. As well you are always need to keep a eye on your ammo and health, if you don't you can be put in a bad situation with nothing to use but your knife. When this happens, moving into a stealth sytle of gameplay is your best option. Getting out of one of these stustion feels very rewarding but is annoying because they happen often. Another thing is saving within the game, there is no auto save feature and when you die you go to your last saved point. This means that most of the time you have to go out of your way to find a safehouse to save in. This can be annoying when you kill everyone in an outpost and go to save, afterwards you come back to find enemies have respawned, and then you have to kill them again. Which might make you low on ammo then have to go out of you way again to find some.   These couple of problem are annoying but give the game a much more survival feel to it. Also, these problem make the game more interesting at some point and can feel very rewarding if you make it out alive. If you don't and you haven't saved recently well then guess what... Everything that you have done in the past 20 or 30 mintues is gone and you have to do it all over again.  Overall I would recommend this game, its only $10 but trust me when I say its worth +$20.",
            "review_score": "1"
        },
        {
            "review_text": "still a great game",
            "review_score": "1"
        },
        {
            "review_text": "A profoundly flawed game,  Far Cry 2 's attempt at semi-realism ends up exactly the opposite of what it wishes to achieve, breaking the immersion instead of enhancing it and making the gameplay almost unbearable. Large, beautiful open world becomes something the players loathe (perhaps intended, but nevertheless fatal to the overall experience), and satisfying gunplay does not amount to much when the mission design fails miserably. Story attempts to reach higher peak than it can climb, and overall falls apart as every character and the world fail to leave any significant lasting impression.  You know a game is flawed when a 'realism' mod makes the game easier.",
            "review_score": "-1"
        },
        {
            "review_text": "The African atmosphere is the high point of this game, as very few games are set there. In the end though, the gameplay becomes fairly boring. You spend a huge amount of time driving to where you need to go, and you might even enjoy a relaxing drive if not for the repetitive roadblock shootouts. The story is vanilla and hardly moves at all. The graphics are quite good, but not a saving grace. The game is very much like Africa itself: a nice place to visit, but you wouldn't want to live there.",
            "review_score": "-1"
        },
        {
            "review_text": "bugs every corner, ai with aimbot kills you even out of sight, unplayable .....",
            "review_score": "-1"
        },
        {
            "review_text": "Great classic!!",
            "review_score": "1"
        },
        {
            "review_text": "Best Far Cry game out there (FC 3 and FC4 feel flat in comparison) . Excellent gameplay but flat story. Can become repetitive",
            "review_score": "1"
        },
        {
            "review_text": "this is a good game it is better than the original far cry well worth geting",
            "review_score": "1"
        },
        {
            "review_text": "Did I ever tell you what the definition of insanity is? Insanity is clearing the exact same ♥♥♥♥ing outposts over and over again expecting they will be empty next time. That. Is. Crazy.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Far cry 2, a good game in my opinion. Quite repititive side missions after a while. The story was good and the end was the best part of it.",
            "review_score": "1"
        },
        {
            "review_text": "I've Had this game for a year. At first I was like 'I CANT STAND THIS GAME. IT SUXS WORST FAR CRY GAME EVAAAAAAR!!!' Then a year later, I came back to this game with the jackal mod, and it becomes a good far cry game. It puts you in Africa in an unknow part of it and you must hunt and kill The Jackal. You can play as a wider variety of characters and you have a buddie system that allows AI to help revive you if you go down. They can also die and never respawn. This game isn't made for everybody, If you loved Far cry 3 and 4 and you come to this game, you will hate it. It's nothing like its future games, but if you played Far Cry 3 with the Ziggy Mod on the hardest difficulty, you might love this game. I loved this game and Im in the process of beating it soon.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "Play this game with permadeath, become a million times better :D",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game. I had played the original Far Cry back in the day when it came out. But Far Cry 2 is just not the answer. After playing it for about 8 hours there is a common theme and or methodology to it. Start at point A, drive down a restricted path/road to point B, kill stuff along the way, repeat. There is hardly any exploration or doing things your way. I skipped this game and moved onto Far Cry 3 to which I was blown away.",
            "review_score": "-1"
        },
        {
            "review_text": "Does not use Uplay 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I kinda have to be in the right mood to deliberately elect to play this game over my other options, but every time I play it, I enjoy it. I've spent hours playing this game, and I doubt if I'm even halfway through the main story.  Best features: - A visually interesting (come on, it takes place in Africa, so it's gorgeous) - Dynamic questlines - Open-world map - Player-guided character development (can be a goodguy-type or a badguy-type) - Fun vehicles  Worst features: - Maddeningly unrealistic weaponry - Having to get to certain spots to have a 'good stopping point' and be able to save - Relatively limited carrying capacity  Overall a very enjoyable game to play, just not on my list of tops. /////////////////////// BLACK3Y3 rating: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I did not like the game, nothing like Farcry 3, but what am I gonna blame.. it is the 2nd.",
            "review_score": "-1"
        },
        {
            "review_text": "LOVE IT 5/5 BEST GAME OF FAR CRY SO FAR LOVE THE OPEN WORLD EVERY ONE HATE YOU YOU SCREAM F**** YOU TO THE BAD GUYS AND THEY SHOOT MORE LOL  LOVE THE FACT THAT YOU CAN GO ON YOUR OWN!",
            "review_score": "1"
        },
        {
            "review_text": "Its prettier then a plump middle age city boys mouth!",
            "review_score": "1"
        },
        {
            "review_text": "Very Fond of Malaria SImulator 2012",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun.. Hours upon hours of gameplay. Difficult at times, especially when trying to save all your buddies. I do recommend this game for any FPS lover.",
            "review_score": "1"
        },
        {
            "review_text": "It took ten-plus hours of Far Cry 3's surf nazi saves the natives simulator to show me (by stark contrast) the brilliance of Far Cry 2's oceanless gloom and uncompromising dunes. You're dying of malaria. The bad guy who could've just killed you is instead toying with you for kicks. Everything is terrible (that goes for the voice acting as well); everything hurts (especially the bloody voice acting). No crafting your way out of this nightmare. Run, gun, gun while running, cry, run crying...",
            "review_score": "1"
        },
        {
            "review_text": "if you like realistic FPS this is a perfect game for you. the enemies arent normal stupid AI that just run straight at you. they cordinate. your level of reputation affects how enemies see you. at level 1 they think of you as nothing, just another body. when youre level 3 they think of you as a terror, you come and kill everyone like a phantom. the game is quite long and the story is very good. the ending will probly surprise you.  But a WARNING, at the end of the game there is a final section you enter. SAVE BEFORE going into the area and do not overwrite or you can never get out of that final area.",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 has a much more immersive and harsh environment compared to its counterparts.  If you're looking for a bit of a challenge and skipped this for Far cry 3 and 4, pick up this title.",
            "review_score": "1"
        },
        {
            "review_text": "Not recommending this... Just thought everyone should know how stupid it is, don't buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "not as good as 3 but better than 4",
            "review_score": "1"
        },
        {
            "review_text": "very nice game... haters just hate..",
            "review_score": "1"
        },
        {
            "review_text": "good freacking game, realistic FPS, but not for children and no arcade superhuman perks",
            "review_score": "1"
        },
        {
            "review_text": "I think it was personal preference mostly but I really didn't enjoy this game. I found the quests tedious, the map quite annoying to follow and the characters pretty boring.   The mechanics were okay but it just didn't click for me.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun and it never gets old no matter how much you play it.",
            "review_score": "1"
        },
        {
            "review_text": "Woefully overlooked game, still great after 8 years.",
            "review_score": "1"
        },
        {
            "review_text": "First and main: this game has nothing to do with Far Cry. It has it's own aura, story and gameplay totaly unrelated to the predecessor. It is not so challenging and rather boring. But it has one redeeming feature. Plot. It can be appear as nonexistent but only if you look for it in missions. The thing is more deep than other shooters. It's not trivial and makes you think a lot after game's end. And this, imho, is the best quality of Far Cry 2.",
            "review_score": "1"
        },
        {
            "review_text": "dont ♥♥♥♥ing buy this game. period. you spend 7 bucks on sale thinking its a good deal but after you download it won't get past loading screen. piece of ♥♥♥♥ game. spend your money on some other game or don't give it to steam at all because they won't even take responsibility for listing windows 7 64 bit on requirements when it isn't even compatible. go buy a hamburger instead of this game. its definitely more satisfying",
            "review_score": "1"
        },
        {
            "review_text": "VERY SLOW START. You might as well watch the uncut extended lord of the rings trilogy while you wait for the introduction sequence to finish.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to experience malaria? Well, now you can!",
            "review_score": "1"
        },
        {
            "review_text": "Bizzar story and Kamikaze drivers! This is FarCry2 in my mind. The Game mechanic works rather well though, the world is quite large and very nicely done. The trader system is hilarious but effective. The secondary missions suck! On the whole it isn't a great game but it is fun to play and has some good aspects. Fortunes pack adds a combo of overpowered weapons which you will have right from the begining rendering the trader practiclly useless like the silenced shotgun that has the kick of an AS12 but the range of a rifle... Just a fun game that happens to be nice to look at. ",
            "review_score": "1"
        },
        {
            "review_text": "Really good game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Can't beat $2.49 for a game of this level",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is fire (as in a buring fire, you know what I mean) This game gets 4 out of 5.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. If you like  open world  games, you'll like this.",
            "review_score": "1"
        },
        {
            "review_text": "Played this after playing Far Cry 3 and Blood Dragon.  Things I like: - 'Buddy system' where people you meet come help you when you're in trouble - Cool healing mechanics (digging out bullets, syringes, etc.) - Enemies are non-descript and combat is difficult - Open world feel with one objective, 'do what you want' atmosphere - Pulling up map and GPS is very inventive and immersive  Things I dislike: - Voice acting is very fast paced and sounds unnatural - Takes a LOT of bullets to down an enemy - No melee, only if you pull out your knife and whack 'em, which is pretty useless in a fight - Map is bothersome if you're trying to walk around with it, pops up and down while you're walking - Blur effects on aim and sprint. OMG the sprint. It made me sick every time I tried to move faster. It focuses in and out while you sprint and it's nauseating.  - No direction as to what I'm supposed to do - 'Scouting' outposts is confusing as even after eliminating all enemies I have to walk around the whole place several times to get it to trigger - Currency is in Diamonds - you have to find diamonds using your GPS, which is annoying and distracting - no other way to get diamonds (?) besides missions maybe? I didn't really have any motivation to do anything  Mostly I just couldn't play long enough because the blurring effects were hurting my eyes. This was with bloom and 'post' (which I'm assuming is post processing) off/low. Also, I didn't really have any motivation to do anything, the rewards weren't tangible.  At this point in time you'd be better off playing Far Cry 3 and/or Blood Dragon, I honestly think they're more fun.",
            "review_score": "-1"
        },
        {
            "review_text": "On one hand, a beautifully written love story between a man and his truck.  On the other hand, the best video game about having malaria.",
            "review_score": "1"
        },
        {
            "review_text": "I was really looking forward playing this game and then disappointment. Everything is so gray without vivid colours, tutorials are strange, story of game is nothing more superior.   If the game is on big discount buy it,in any other case just save your money.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the crappiest games ive played, i havent waited this bad to beat a game since Resident Evil 4 and Bioshock 1. The graphics are amazing but this game is too repetitive for its own good, and the AI is horrible. And the story? Well it was not there. Far Cry 1 was better than this.....",
            "review_score": "-1"
        },
        {
            "review_text": "Best African truck simulator out there. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "PROTIP: Just drive through the damn checkpoints and shoot whomever gives chase. Don't try to sneak by. Don't try to go way around them. Barrel on through, get a ways away, stop, turn around, shoot whomever is chasing you in the head, and continue on your way.",
            "review_score": "1"
        },
        {
            "review_text": "more realistic than modern warfare and battlefield 3 combined. imagine digging a bullet out from between the bones in your knuckles with a knife while slowly dying of malaria and dysintery.",
            "review_score": "1"
        },
        {
            "review_text": "Become one of nine mercenaries and set out to find the Jackal, and arms dealer selling to African warlords.  Along the way, you will encounter guards with super-human senses, work for warlords in exchange for diamonds in a folder, and set people on fire with Molotovs and flare guns.  Far Cry 2 features an immersive healing and repair animation system so that you can pull re-bars from your stomach and recover in a few moments and repair burning jeeps with a mere tightening of a bolt.",
            "review_score": "1"
        },
        {
            "review_text": "Roll a grenade down a hill and blow up all your friends. Fry Cry 2 ends the countdown to tears.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed the heck out of the game and will be getting Far Cry 3.",
            "review_score": "1"
        },
        {
            "review_text": "I did have FC2 before i bought it on steam so the hour counter isn't accurate.  This is a very good game, yust like its predecessor FC was. I think i must have 120hrs+ on this because is played it trough at least 3 times.  This is a on-of-its-kind shooter/RPG game with some flaws but mostly cool and innovating gameplay mechanisms. It has 2 huge levels that are completely free-roam, it has many weapons, many collectables and many ways to complete the missions.  Some flaws however will hinder gameplay: degradating weapons, not a good loadout-switch-mechanism making you stick to a default weapon configuration, enemy's making it a hard time crossing the map, and top of that not a good functioning quick transport so you have to drive past all those annoing enemies with your degradating weapons to finish quests all over the place.",
            "review_score": "1"
        },
        {
            "review_text": ".....seriously? again? You ever get the feeling youve done this before? like.. like 4 minutes ago?  yeah, me either.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply addicting. Figure out how to use the bus transit efficiently, and you'll go far... Straight forward game play, multiple ways to complete missions (sneaking versus blowing ♥♥♥♥ up), plenty of weapon combinations. All around fun and immersive.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I ever played. It's way better then Far Cry 3.",
            "review_score": "1"
        },
        {
            "review_text": "Things I love about Far Cry 2:  Its dense atmosphere.  Its brutal, unrelenting challenge.  Its utter realism, not just in what it includes (realistically rendered animals, realistic fire propagation) but also in what it doesn't include (no magic, no mystical tribal tattoos).  The fact that it's sort of a piece of activism.  There may not ever be another game quite like Far Cry 2. Luckily, Far Cry 2 itself isn't going anywhere.",
            "review_score": "1"
        },
        {
            "review_text": "a game where youre mad that a man is selling weaponry to africans who then kill each other  youre so mad you cut out the ♥♥♥♥ing middleman and shoot said africans yourself on an adventure to kill an arms dealer known as the jackal but sadly you suck ♥♥♥♥ and he has to save your ♥♥♥ from yourself every time you try  you then realize that youre both killing africans so hey why not team up from there its the adventures of mighty whitey and the ♥♥♥♥shit brigade and somewhere along the line youre going to shoot your best friend in the head because youve already jabbed three morphine syrettes into him and thats the best you can do for the poor ♥♥♥♥ers health  rip warren clyde  ",
            "review_score": "1"
        },
        {
            "review_text": "Superb freeform and open world for a shooter. And it works! I didn't like the first Far Cry but this is nothing like it and the setting is totally different. Should have been called something else as it bears no resemblance to Far Cry 1 at all. In my opinion though, this is a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "I may have been playing this for awhile, but it is mostly because i fell out of my truck on the way to the store and had to walk a couple of kilometers back to where i needed to be. Don't lean on the truck door and wear your seat belt.",
            "review_score": "1"
        },
        {
            "review_text": "this game packs a lot of content up it's ♥♥♥. maybe ill find kony while ripping out a rusty barbed wire out of my arm. after that, ill get on my quad and find more idiots that drive into my car.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little game.",
            "review_score": "1"
        },
        {
            "review_text": "'A' Despite the negatives I'd heard this was a lot of addictive fun. Sure some of the elements seem poorly implemented, and the missions get monotonous fast, but the open world is beautiful and the do as you please action pulls you in well.",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 is a perfect example of how far Ubisoft can hype a game.This game failed on a lot of levels. One of them being immersion, survival, and the enviroment. I'll judge the game on those three things.   1. Immersion: There is none, to put it bluntly. They could've made this game very immersive but its failed at that completely.   2. Survival: To put it simply they didn't go far enough. The malaria thing should've been scrapped entirely. Instead you should've had to worry about your body getting Dehydrated,Overheating,Starvation, and sleep. You should've also had to worry about ammo more than you did in the final game. Their should've been different types of ammo for situations and quality types. Have the most common ammo have blanks or just be weak entirely. Honestly the weapon rust system was ♥♥♥♥. They should've removed that and instead replaced it with your weapons over a good period of time need springs replaced triggers stop working weapons jamming etc etc. It would've added more immersion.   3. The so called 'African' setting this game had was completely wasted potential. For one thing the entire game has the whole political feel to it. They should've based the towns and people you meet on real factions in Africa and have them have the same problems that the real people of Africa face. There also should've been Tribals roaming the Savannah hunting and gathering. There also should've been more animals like Lions,Hippos,Crocodile,Giraffe,Elephant,Hyena,Baboon, and lots of other typical African wild life. You should've had to worry about your scent when roaming the Savannah by your self at night.   All in all this game sucked and failed to deliver a worthwhile experience in my case.",
            "review_score": "1"
        },
        {
            "review_text": "It grows on you... in my opinion, one of the best FPS out there. Beautiful graphics, huge open world, ant lots of action.",
            "review_score": "1"
        },
        {
            "review_text": "Sci-Fi &amp; Fantasy are enjoyable for their settings, however you don't read stories for the author lovingly describing his awesome world. That's reading a textbook, and that gets boring by the end of chapter 1.  In the same way, as good as Far Cry 2's environment may be, if it's the only endearing factor to it, to which it hope's to pull up a non-existent story, it's a bad game. A bad game that dresses prettily, but is still cowshit ugly if you take it's clothes off.  One gets bored, as each mission is just a repetitive slog to push on to the tourist guide, the game plans. 'ooh look at the running zerbra.' 'Can't you see the wind effects on the fire?' and you smile queasily, as you turn up your headphones. By the end of tolerance, I was just nitpicking, like rusting AKs, indeterminate factions, friendly NPC's who are all teleporting mindreaders, to get through it all. If you find yourself picking out a flaws in a game, then it failed you. Far Cry 2 fails.  4.7/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game with a great story! If you want to enjoy this game, then don't be in a hurry. Take it slow and enjoy the enviroment. If you go too fast, everyone will be after you and death will come swiftly.",
            "review_score": "1"
        },
        {
            "review_text": "Like a hot babe that can't talk.",
            "review_score": "1"
        },
        {
            "review_text": "Just keep going. Seriously, another patrol? No, that is the same one I just cleared out! *rage quit*",
            "review_score": "1"
        },
        {
            "review_text": "Great game, def. worth the money. The graphics are impressive for the game, map is huge and almost no loading. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "heroin heals you 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Malaria suddenly makes me unable to even hold a gun.",
            "review_score": "1"
        },
        {
            "review_text": "I found the whole malaria bit to be quite annoying (interuptions in combat due to sickness) as well as the ever spawning bots that constantly attack. I uninstalled the game after 3 hours.",
            "review_score": "-1"
        },
        {
            "review_text": "I missed out on the original Far Cry and win7 won't run it, so this is as close as I come. I've only played about 4 hours, but so far, it seems like a great game with interesting gameplay, drivable vehicles, a munber of different weapons (not as many choices as I like, but...), and the story seems interesting so far. For the price I got it, definitely worth it. Reminds me a lot of Crysis without the armor, but more realistic.   Graphics: 8 Gameplay: 8.5 As a shooter: 9 As a story: 7  If it's on sale or under 12 dollars, grab it.",
            "review_score": "1"
        },
        {
            "review_text": "This game has amazing gunplay and atmosphere, but get the ♥♥♥♥ing prayer beads out and hope to god that your save isn't bricked 20 hours in at random.",
            "review_score": "1"
        },
        {
            "review_text": "Let's keep it and real.  Pros: The (vannila) weapons are pretty good and realistic (for a 2008 game) Large, intense map AMAZING fire system The effects are very advanced for it's time You can actually heal yourself The AI for the enemies isn't bad With the DLC the weapons are amazing  Cons: The ammount of guns is kinda short considering it's such a large game The map takes forever to travel across The machete is quite awfully animated in some moments It was heavily advertised for having 'no more invisible walls' but instead of invisible walls it just has a point that if you pass by it you get killed by some unreasonable force. The money system is fairly tough to deal with (it's rather scarce and it isn't exactly a con, just annoying at times) The health re-gen system is very creative and all but it's repetative, you end up healing the exact same thing over and over Stealth is a joke here. Why even bother sneaking?    ALL AND ALL GREAT GAME 8/10",
            "review_score": "1"
        },
        {
            "review_text": "You can set fire to everything. Everything.",
            "review_score": "1"
        },
        {
            "review_text": "I like exploring this games huge open world. Driving around is a lot of fun. The story is fun. The multiplayer is a lot of fun, and I actually played a lot of that.   This game is fun. If it is on sale, it is totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "It might be a bit older, but it is kind of like playing Skyrim in Africa. Super fun. Enough action to be interesting, big enough and pretty enough to be relaxing.",
            "review_score": "1"
        },
        {
            "review_text": "Just great",
            "review_score": "1"
        },
        {
            "review_text": "The 2nd game of the series. Very violent. The head counts will definately roll on this one. The game upgrades maps, weapons, and side quests. Takes double the time too complete as the 1st game. About 60 hours to find everything. Not in the jungle this time. In the safari. Not as good as the jungle, but was very interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun open world game to mess around in",
            "review_score": "1"
        },
        {
            "review_text": "So i bot this game onsale or some thing cant remember. It is like set in apartheid south africa were they use to collect black people and white man would kill them. it very racist abd it need removed from steam, there is no white man in game but you and you made to kill black man",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the series. Here's why;  - There is no cult-sorta thing in this game. Even if Far Cry simply means that, I don't know. This game demonstrates the facts about the war in Africa.   - Guns are totally great, the jamming-system is designed nicely, the recoil changes on worn guns is also good, and it's a blast using 'em.   - Variety of vehicles are acceptable, enough and maybe, just maybe even a lot vehicles.   - The map looks bad, but what do you expect? It fits PERFECTLY with the story.  While on a discount, buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game. There just is a lot of glitches for me. Like people are literally flying... I guess thats a cool glitch but one of the ones that annoys me is when the person you are supposed to talk to repeats his sentence over and over and never stops. That makes me not able to get past the mission and I have to literally restart the game and load that save and sometimes there are even save points near. But other than the glitches this game is really enjoyable.   10/10 would light Africa on fire again.",
            "review_score": "1"
        },
        {
            "review_text": "Jeep Wrangler Simulator 2008 gets a four, out of four wheel drive.",
            "review_score": "1"
        },
        {
            "review_text": "it is beautiful 100/10-ign",
            "review_score": "1"
        },
        {
            "review_text": "-Spawns -Goes to armory -Finds Silenced Shotgun -Poops pants",
            "review_score": "1"
        },
        {
            "review_text": "I get in a car and drive to an enemy encampment, my car gets shot 1000 times. While driving away I hit a tree at 40mph. then a enemy assault truck comes up and rams me off a cliff. I get out and fix the car with a few simple twists of a wrench on the engine its as good as new. 64/46. Play this game now.",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 tries to be an open world game set in an african country shaken by civil war.   You will spend 80% of your time just driving around from quest to quest. And more often than not, the objective will conveniently be set  on the opposite side of the map , which would take 2-5 minutes even without interruptions, but you will encouter numerous enemy camps and patrolling jeeps with mounted MGs on your way there. And after taking the objective, when driving back.  The idea behind forcing the player to travel so much seems to be to encourage exploring of the open world. However going off road is incredibly time consuming and unrewarding. The only thing to gain is scattered diamond cases which grant you 1-3 rough diamonds (the currency of the game), but quests give you 15. With the diamonds you can buy new weapons and upgrades which are fairly unnecessary due to the poor weapon balancing. Assault rifles and even mounted MGs are fairly useless compared to Sniper rifles. Just pick up the craftsman shotgun, the bolt action sniper and the crossbow/RPG and you shouln't have any problems whatsoever even on hardcore/infamous setting.  pros: - original setting  - huge map  cons: - too much travel time - dumb AI - poor weapon balancing - unrewading to explore - no interaction with wildlife",
            "review_score": "-1"
        },
        {
            "review_text": "Get it. Although it isn't as enticing as the 3rd installment, it has a great, griddy story that is difficult to watch and so amazing. It is beautiful and a work of art.",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 2 is a Harder, Unforgiving and more Realistic version of Far Cry 3.   That is all, if you excuse me... i need to gather more Blood Diamonds.",
            "review_score": "1"
        },
        {
            "review_text": "For a game that bears the Far Cry name it is not Far Cry. It has nothing to do with the first game at all, from gameplay to the plot. It is, however, one freakin' fun game. Exploring the vast wilderness of Africa is almost breathtaking ('almost' because of the awkward map system and iffy quest system). The gunplay is fairly standard kill-all-the-bad-guys-spare-the-civilians deal, but there is the idea of your gun becoming jammed. It works in well and adds to the immersion. Plotline you ask? In my opinion there is no plot.People that are looking for a nice open-world game that has depth this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "tldr= drive around, shoot dudes, blow up trucks, interesting wepons....thats it  Far Cry 2 is specifically geared toward mercenary work in africa so expect to be driving busted up coupes n trucks all over a large african sandbox shooting a bunch of dudes. The cool thing is that you can execute each killing however you want, from stealth killing each guy with a silenced wepon and sneaking around corners to running in with grenade launchers that act more like grenade snipers and blowing up everything. The bad thing tho is that there's not much to do other than drive around and kill dudes.The graphics are nice when turned all the way up but lose their touch rather quickly when turning down, so if you have a lower end graphics card i wouldnt recommend this game for that machine.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "Best Far Cry game IMO. I've played 2,3 &amp;4 on the 360...&amp; now 2 again on PC. In 3&amp;4 I've only ever got half way through those games due to such vast open worlds not being vast in challenge or variation. Far Cry 2 will give you a bloody nose every 5 mins &amp; challenge you to get back up &amp; figure out what just happened. These are some of the best open world, random gun fights you will have in a game, they'll outsmart you if you don't think quickly &amp; adapt on the fly. I think that's why FC2 is so much better than 3&amp;4..you know whatever you're trying to complete you're gonna get serverly bloodied in the process..I always feel I've just been throu a bar room brawl. A great challenge. Looks &amp; plays awesome..love the total feel of the African environs....good stuff :-)",
            "review_score": "1"
        },
        {
            "review_text": "In its core concept the game is great. However, the constant fetch quest and driving from one side of the map to the other makes the game a bit tedious...in a very unnecessary way. You’re constantly being attacked from random enemies at unknown locations who refuse to go down. Africa was a cool place to play when my interest was intrigued. But, you’re better to just power through the game and play FarCry3....it’s better.",
            "review_score": "-1"
        },
        {
            "review_text": "For me, the game originally didn't increase the graphics to the highest quality until I did it manually. I was playing on the lowest setting and thought this game was awful.   It is not, however... as this is actually a pretty good looking game. I haven't played through it all the way so far, and I have seen a few glitches in places, but I shall update this as I go.",
            "review_score": "1"
        },
        {
            "review_text": "everything catches fire....everything  and you might want to set fire to everything when you realise the same missions are repeated over and over, though it is still an enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "Still the best, and most aesthetic in the series. Even beats FC3. Wipes the floor with FC4. And let's not get onto the original Far Cry. But, this game is challenging, which is why people like it. I suggest if you're going to buy a Far Cry game, and can't decide, that you get this one. It will make you enjoy the others more.",
            "review_score": "1"
        },
        {
            "review_text": "This game should be bought for the game world alone. Just like GTA and Just Cause, the story isn't really the focus point of Far Cry 2. It really immerses you in this section of Africa and the mercanary lifestyle.  It's the ability to interact with the world and create your own challenges that makes this game great.   If you want to roleplay as Rambo and drive straight in, guns blazing, or try and sneak your way in, the game gives you plenty of options.  -Ability to control when/where you attack from (Resting until night/day, Boats/cars/air gliders) -Impactful environment that affect the AI (Rain Storms, Dry seasons, Windy/Clear nights, Full/New moons) -Weapons that have unique uses (Snipers, Pistols, Grenades, Flare guns, IEDs, RPGs, Molotovs) -Buddy's that can rescue you and provided optional ways to complete missions -Fire system (Flush out enemies, Create havoc) -Can't forget the graphics which still look great after all these years. The mission objectives get quite repetitive and that really the only downside. $9.99 dollars is the perfect price for this standard-setting game!",
            "review_score": "1"
        },
        {
            "review_text": "explosion everywhere started a big ♥♥♥ jungle fire with 1 molotov set up booby trap and watch the car blindy drive through ur weapon will rust if u swim (2real4me)",
            "review_score": "1"
        },
        {
            "review_text": "I can only do one mission at a time... Are you kidding me??  Driving all over the map in this manner is tedious, especially when enemy encampments that you have cleared do not remain under your control.  The dialogue is lacking emotion and drama... It means that you end up really not caring about the storyline.  The whole game feels robotic. Don't waste yout time on this... Get FC3 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "A game that has provided plenty of stories as you make your way through an open world safari of great plans and malfunctioning rpgs. A+",
            "review_score": "1"
        },
        {
            "review_text": "This game is a free-roam first person shooter adventure set in Africa. The main features would be the large variety of weapons, vehicles and a large beautiful map to use those in. You play as a mercenary and are playing both sides in the conflict, the missions you get usually involve picking something up or shooting the hell out of something else. The story I found somewhat uninteresting but I enjoyed playing through it regardless. The game has a few minor flaws which can be easily looked past and overall it's really immersive and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Heart of Darkness: The Videogame",
            "review_score": "1"
        },
        {
            "review_text": "great game I would recommend to anyone",
            "review_score": "1"
        },
        {
            "review_text": "Note: I've got more hours on the 360 version.   This is a very good sandbox FPS. The setting really grasps you—Africa is portrayed as a dangerous and lawless land with almost no women in the vicinity and definitely no children at all. The main antagonist, The Jackal, is also written brilliantly. If you play this game on the hardest settings (&amp; Dylan's realism mod if you wish) and with a desire to really feel like you're there in the game world, rather than just something you wish to master the mechanics of and beat and sort away as an 'achievement' of yours, then it will last you a long while.  Addition as of 12/5/2015:  I came across a review of this game on RPS by Alice O'Connor on August 10th, 2015. To quote:  'Far Cry 2 is a game about plans and contingency plans, then desperate makeshift plans when those both go wrong, then finally, after a crucial grenade rolls back down a hill towards you, hoping that your buddy will come pull you out the fire – and that you can cover them. [...] The problems some complain about – malaria, jamming weapons, NPC outposts respawning with silly frequency, and so on – are what make Far Cry 2 so much fun, creating more opportunities for unexpected cockups for you to triumphantly recover from. That’s where Far Cry 2 shines.'  That's exactly right. All of those things which I have seen people complain about with this game are actually part of what makes Far Cry 2 so good. The game is simply not out to make you feel like you are in control — it does EVERYTHING in its power to boost the sensation of hostility in the game world. You cleared out an enemy camp? It makes no difference, the camp will be restored by the time you come back to it. The frequent enemy respawns ensure that you never take the same route going back; it is a game about constantly improvising and measuring the stakes.  This is barely a game. It is more like an eternal struggle, a perfect fantasy for a Nietzschean male mind. That's what they wanted it to be.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an absolute masterpiece. The only reason you shouldn't buy it might be that it's to manly for you. If you dont like a game that'll kick your ♥♥♥ and put hair on your chest, you probably shouldn't get this. otherwise, proceed to one of the best games ever.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a powerful experience although it's still difficult to recommend it. It has very strong atmosphere, battles could be very satisfying, jungles are lush. However it feels like there is some disbalance between the atmospheric gameplay and shooting - it's too slow for a shooter, and there are too many unnecessary fighting for an adventure game. I'm happy I played it but bear in mind - it can become quite tedious",
            "review_score": "1"
        },
        {
            "review_text": "There are some amazing things about Far Cry 2, but anyone who doesn't admit it's a flawed game isn't confronting reality.. You will probably either feel unable to play it or addicted to it like I was.  ON THE GOOD SIDE...  The number one thing this game does right is atmosphere. The environment is beautiful but also suspenseful and slightly terrifying. The music and sound help to achieve this atmosphere. The graphics are great. I didn't play until 2015 but they look awesome to me. The game starts out feeling almost impossible, or at least very challenging, but as you get used to the non-stop survival you start to feel like you are a force to be reckoned with. Although the fights are quite formulaic, you are totally on your own and so you feel a sense of achievement when you lay waste to hordes of enemies. The game is like a sandbox shooter: At first you feel like a child abandoned in a war zone with a pistol, but over time you realize that you can choose how to fight (balls out or stealthy) and do things your way.  I also appreciate that I didn't have any technical problems or major bugs as I played; it was quite a smooth experience.  ON THE BAD SIDE...  I have to admit I enjoyed the game quite a lot in the end (I certainly got addicted until I finished it) but there are some problems with the game. No matter how much you get used to the non-stop 'survival mode' feel - and some people absolutely love it - it always seems silly that the whole game is basically you vs a never ending rain of thugs. Everywhere you go you have to wipe down an outpost full of enemies to get anywhere, even if you just cleared it a few minutes ago. It's supposed to feel harshly realistic, but it almost feels cartoonish how much crap is thrown at you all the time. And then you get the opposite problem: You realize everything is just a formula and as soon as you get used to it, everything is too simple (almost too easy). I did say that it feels good to be the unstoppable predator and that you earned that position yourself, but it makes the game quite one-dimensional.  To sum up the gameplay problem, the game crosses the line between being difficult and being tedious. Yes you can still enjoy it, but always asking yourself why you are playing this game that is basically a map full of enemy camps you have to ravage time and time again. Also, guns you pick up from enemies jam quite often, and even your own guns can jam over and over again during certain fights. Personally I didn't see that as any kind of addition to the challenge, it was just irritating.  The only time you don't feel alone is with your buddies, which brings us to another problem. The buddy system, wherein you meet people who provide missions or can save your hide when you get knocked out, feels incomplete. After playing the game to the end, I still have no idea what 'reputation' or doing extra side missions did for me. I'm pretty sure the answer is nothing.. The main interaction you have with buddies is that your best friend at any given time will call you after you receive each story mission and offer you a bizarre, convoluted way to do the mission. Sometimes it makes the mission more interesting, but given the brutal nature of the game I would usually just groan that I was given an extra set of tasks.  A quick note about the ending, which is SORT OF A SPOILER but not really. Actually, I might be doing you a favor if you play the game. Once you beat the final mission, you cannot go back and wrap up side stuff that you didn't finish. Considering there are 221 diamonds to find in the game (ugh) it's a bit funny. I guess this is just a choice developers make when ending the story of a sandbox game, but I personally never like when this happens. I wanted to wrap up the last side missions and diamond hunting, but now that I finished the story I don't feel compelled to load an old save and do all that again.  Also, the credits are like 10 minutes long and you can't skip them... I don't understand.  ALTOGETHER  This game is worth playing for the good parts, but for some the flaws can't be forgiven and I can honestly totally understand that. I actually almost put the game down the first time I realized that everywhere you go you will be attacked PLUS patrol cars make the roads unsafe as well.  A word of advice if you plan to play this game: Take it SLOW. Although it's kind a repetitive game, you'll still find it more enjoyable if you take it in and play wisely. If you try to rush all the time, you will probably just get frustrated (although I did choose to fly in with a truck and blow everything up half the time, instead of going stealthy). Also, buying the camo suit upgrade is a must, and I personally could not play without the silenced weapons.",
            "review_score": "1"
        },
        {
            "review_text": "Now that's what I call a huge improvement on a sequel!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game!",
            "review_score": "1"
        },
        {
            "review_text": "Far cry 2 is my favourite game in the series. Despite its problems, the long travel times, respawning outposts, and stealth being entirely too difficult. The game just oozes atmosphere, and is anything but a power trip, unlike the next 2 games, and does a great job at making you feel like just another gun-for-hire with no real possibility of stopping the civil war.",
            "review_score": "1"
        },
        {
            "review_text": "The best Farcry title so far !! Nice story and unendly Action in the most beautiful world ever seen in Farcry Games ! Farcry3 was low and i was stopping somewhere in the middle because the story was nearly not existing and the weapons and the upgrade system was also not very good. Better play farcry 2 one more time, so i was downloading it on steam eaven if i have the original disc :) NP for one of the best singleplayer shooter on the Net. eaven 9.90 is a present price for this title but if you can get it for -75% lol , there is no question about !! Just get it !",
            "review_score": "1"
        },
        {
            "review_text": "best sequel what makes the game so good because it has realistic atmosphere even if the graphics are old and the african landscape fits better than jungle also story is based on true story from less know historic event which makes it more interesting to play  of course there were some bad parts like malaria jamming guns and ( easily breaking vehicles ) which is the most frustrating part but the story and unique landscape makes the far cry 2 the best far cry",
            "review_score": "1"
        },
        {
            "review_text": "Not the most aesthetically pleasing game out there, but a good game for it's time nonetheless. You're out in the African savannah and other nearby places, killing people, chasing people in cars, killing animals and searching for diamonds. Has fire spreading for grass and trees, the ability to shoot tree limbs off of trees, a decent story and humorous A.I. Fairly different from both the original Far Cry and the later Far Cry games, also more challenging than said installments, because you have to take pills every so often to counter your malaria infection. You have a limited supply of these pills, by the way, so it kind of has a survival aspect. A dated game, but pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "wow, this game is really fun, and it looks great, Im enjoying the Hell out of it. it's very easy to get into, I like how you have a large amount of players you can pick in single player, now there aint much multiplayer severs but theres 1 or 2 severs that get 7 to 8 players on it. with me it's fun and I give it 3 1/2 stars out of 5. could of had 5 if multi player was more alive. ",
            "review_score": "1"
        },
        {
            "review_text": "Since I liked FC3, FC3: Blood Dragon and FC4 so much, I thought I should try this game out. I heard that it was supposed to be more difficult too, which made it all the more exciting. Truth be told, this game didn't live up to my expectations. Almost every single element of this game was refined and polished in it's sequels and that is no joke. I wanted to make a list of all the improvements FC3 brought to the series, but had to stop because the improvements are way too many for a short review.   I will allow myself to elaborate on some of the things that bothered me with a concrete example of FC:2:s gameplay: Say I want to travel to a safehouse and enjoy the facilities of it.   There is no fast way to travel to safehouses, in fact, contrary to what it's name suggests, the road to your safehouse is often very perilous, which defeats the purpose of getting there in the first place.  Now, there is a way to fast-travel in this game: it takes the form of a bus. The bus can take you to a different region on the map, but almost none of the bus stations are located close to a safehouse, to which you can travel, without hitting an OUTPOST. The outposts are always populated by enemies that shoot you on sight. You can either slowly sneak past the outpost, try to dash through it with a vehicle and hope they won't pursue you in one of their own, or you can, of course, wipe them out. Shooting things is fun, but one would think that killing everyone in an outpost might secure passage through later on. This is not the case though since enemies respawn every time you revisit the outpost.  You make it past anyway and carry on all the way to the safehouse. Here you can sleep and save the game! Yay! Saving the game in a safehouse is completely meaningless, since you can save the game anytime anywhere conditionless of your situation. Sleeping makes time pass by, so you can choose to play at morning, day, evening and night. This seems to be little more than esthetic. I can also choose to store a weapon here. I can take one of the weapons I have on my person and store it in one of the weapon boxes, provided I've bought one of those boxes. Now I have an empty weapon slot, but, should I int he future have wrong weapon for the occasion, I might travel here and pick up whatever weapon I stored here instead! Since I visit the weapon store frequently, buying improved weapons constantly AND since all my previous purchased weapons spawn here infinitly, this safehouse-weapon-storage feels like a self-defeating purpose. Wouldn't it be better to just have a caché or a safe in your safehouse with all the weapons you have acquired so far?   It might be fair to say that this game doesn't go easy on you and it doesn't give you anything (ANYTHING) without effort from the gamer. Maybe it's not particularily bad, just detrimentally cruel.",
            "review_score": "1"
        },
        {
            "review_text": "I more or less hated this game while I was playing it, but for whatever reason I seem to have a lot of fond memories whenever I think about it. I can't decide if it's really awesome or really terrible. It probably has a lot of both in it.",
            "review_score": "1"
        },
        {
            "review_text": "The interactive/influenceable environment earned Ubisoft my utmost respect. It's amazing. There could have been slight improvements on how the AI and the environtment work together since every now and then enemies tend to blow themselves up with car-mounted grenade launchers (might sound hilarious but it can get quite depressing). In general, Far Cry 2 is a great game and I personally loved the setting and the two competing factions were both interesting.  Oh yeah, just for the record:  Far Cry 2  &gt;  Far Cry 3  &gt;  Far Cry 4  &gt;  Far Cry ",
            "review_score": "1"
        },
        {
            "review_text": "In 2008, it's very exciting when you burn the whole tree with your framethrower. Now 2016, it's still very exciting to burn more.",
            "review_score": "1"
        },
        {
            "review_text": "A ok game when hella bored.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely pick up this Mercenary/Blood Diamond simulator! Make sure you get this game on sale! It's got some great mechanics, graphics and story!",
            "review_score": "1"
        },
        {
            "review_text": "Its like skyrim but with guns need i say more?",
            "review_score": "1"
        },
        {
            "review_text": "Besides the multiplayer servers not existing anymore, this is still by far one of the best games I own.",
            "review_score": "1"
        },
        {
            "review_text": "Unleashing remote death just never gets boring.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, if you like being in constant gun 🔫 fights then this is the game for you. The game is set somewhere in Africa and you catch maleria, you have to constantly battle the UFLL and (edit name later) while battling maleria. Love the game and I think the whole far cry franchise is brilliant. Still trying to get all the other far crys on Pc since the others are on my Xbox, but I'm more of a PC 💻. Gamer now. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, feels as though the devs were rushed since there are scenes in the trailer which do not happen ingame must be only 80% complete but even so its one of the best ive played. The story is good with the ability to select the main protaganist (one i always choose is from northern ireland!). The target you hunt is an arms dealer known as the jackal... A little bit of africa, a little heart of darkness, a little apocalypse now, infused with some nietzsche and mercs for hire you get far cry 2. What open world games should be. Plus the map editior it provided to consoles back in 08 was probably the best editior the console players will ever have the pleasure of using and ill even go as far as to say it still is.",
            "review_score": "1"
        },
        {
            "review_text": "i love the fire in this game its the best part",
            "review_score": "1"
        },
        {
            "review_text": "This game is EPIC! I am not sure whether I prefer it over FC3, but this game is still a GREAT one! I would advice to all of you to check it out!!! Also, it's very realistic!!! Especially in the Infamous Difficulty!",
            "review_score": "1"
        },
        {
            "review_text": "Why, OH GOD WHY UBISOFT?! You had ONE ♥♥♥♥ing job! They took the things that made Far Cry unique (smart AI, huge levels, optional stealth) and made them worse in every ♥♥♥♥ing way possible. The only smart thing the AI does is walking up to wounded teammates, even if they are lying in the middle of a ♥♥♥♥ing fire. Next, the huge levels became even bigger; and guess what? In each mission you have to drive from one corner of the map to the next. Joy. The AI? Stealth is almost impossible. You walk up to a guard with your machete in your hand, you get ready to kill him with one hit aaand...he falls to the ground and screams for his teammates. Even if you kill him with a silenced weapon, half of the camp magically knows where you are and starts shooting like its a ♥♥♥♥ing Michael Bay movie. Combine this with constantly respawning enemies, and a interesting, but flawed pseudo-'Heart of Darkness'-esque Story, and you get one of the most disappointing sequels of the past years. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "I know my hours of play, aren't too high...yet. I have been highly pleased with Far Cry 2. Far Cry 2 is not afraid of killing you if/when mess up, but gives you the equipment you need to complete the missions or to explore",
            "review_score": "1"
        }
    ]
}