{
    "app_id": 200080,
    "name": "Nancy Drew®: Shadow at the Water's Edge",
    "release_date": "2011-09-15",
    "developer": [
        "HeR Interactive"
    ],
    "publisher": [
        "HeR Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Mystery"
    ],
    "achievements": 0,
    "positive_ratings": 68,
    "negative_ratings": 30,
    "price": 5.19,
    "description": "Confront Terrifying Secrets in a Haunted Japanese Inn!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/200080/header.jpg?t=1524079594",
    "minimum_requirements": "OS: Windows® XP/Vista/7 Processor: 1.5 GHZ or greater Pentium 4 or equivalent class CPU  Memory: 512MB of RAM Graphics: 64 MB DirectX 9.0 compatible video card  DirectX®: 9.0 Hard Drive: 2 GB or more hard drive space Sound: 16 bit DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "THhs is one of the most well-done games in the series. The story was complex and excellent. Also really scary",
            "review_score": "1"
        },
        {
            "review_text": "i got killed by a robotic cat and that was the best part of the game",
            "review_score": "1"
        },
        {
            "review_text": "Puzzles: 8/10 Story: 6/10 Characters: 2/10 Ambience: 6/10 Scare Factor: 8/10 Overall Experience: 6/10  I played a lot of Nancy Drew when I was 14. If this game had existed back then, I would have DIED of fear. From my experience, this is the scariest ND game so far. Full of fun puzzles, though some seem very meaningless and unrelated to the plot. Biggest complaint was the characters, all of which were extremely annoying. The fact that a Japanese family spoke exclusively seamless, fluent English with one another was extremely unbelievable, and I resent that Her Interactive asks players to ignore it. Dear Her Interactive: stay in the States... and stick to the original, Carolyn Keene stories!  TL;DR: Recommended for ND fans who love puzzles and/or horror movies. Not recommended for ND fans that love story and ambience.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing Nancy Drew games for about 12 years now and have finished all of them, and I have to say this is probably my favorite one. This is by far the spookiest game, there are lots of fun-quirky-optional accomplishments you can procrastinate with, and the puzzles are new and unique to the ND series. They are fun and engaging and some of my favorites! Overall, I absolutely LOVE this game!!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite Nancy Drew games that I can remember playing. It's terrifying and interesting and I loved it.  Plot: Super scary stuff happens around the hotel you're staying in. I am a big baby and actually screamed at a few points. There's also some complex family drama going on that needs to be sorted out. It's very well done like most Nancy Drew games are.  Minigames: Okay, I could make bento boxes for literally days. Years, maybe. Adorable animal-shaped sandwiches in a puzzle game. Yes please. And nonograms. I did not know nonograms existed but now I am obsessed. (There is also Sudoku and another number game that is horribly difficult and I didn't last very long.) At one point, you have to write your name with a calligraphy brush. Having taken a Japanese class, let me tell you, this is already hard as heck. Trying to do it with a mouse is even worse. Survive that minigame, though, and the rest is awesome.  Puzzles: There were a few puzzles I needed to google the answers for because the game set them up strangely. Like walk aruond the garden a hundred times and you never see a thing, but after you know about the puzzle, click in a verrrrry specific spot and suddenly you can find new stuff. Also plenty of codes to break, timed puzzles with death looming, etc.  Exploring/Snooping: You get to shoo people from their places and investigate! It's great. This one (similar to the Waverly Academy game) has a time mechanic where you must wake up in the middle of the night to snoop around while everyone is sleeping. You get to visit different areas of Japan, play pachinko, etc. This game gives you a lot of freedom to run around and do things, and I enjoyed that.  Characters: One thing I liked about this game from the others is that several of the characters completely shut you down when you are snooping. In some of them, they open up so easily 'oh hey you completed a minor puzzle for me. Awesome. Let me tell you my entire life story.' This one made you work for it. There's also a cute romantic subplot with two characters off-screen, and the handyman at the hotel is adorable and fun.  All around, this is one of the better Nancy Drew games. Definitely give it a play if you like the series. :)",
            "review_score": "1"
        }
    ]
}