{
    "app_id": 200010,
    "name": "Quantum Conundrum",
    "release_date": "2012-06-21",
    "developer": [
        "Airtight Games"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Strategy"
    ],
    "tags": [
        "Puzzle",
        "First-Person",
        "Comedy"
    ],
    "achievements": 25,
    "positive_ratings": 1224,
    "negative_ratings": 225,
    "price": 6.99,
    "description": "Find and rescue your uncle by using his newest invention to work your way through a crazy complex mansion as you switch between dimensions and solve puzzles!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/200010/header.jpg?t=1506421283",
    "minimum_requirements": "OS:Windows 7 SP1 Processor:Intel Core 2 Duo 2.2 Ghz / AMD Athlon x2 64 3800+ Memory:2 GB RAM Graphics:GeForce 8800 GT 512 MB / ATI Radeon HD 2900 512 MB Hard Drive:1.75 GB HD space Sound:DirectX9 compatible sound card",
    "recommended_requirements": "OS:Windows 7 SP1 Processor:Intel Core 2 Duo 3 GHz E8400 Memory:2 GB RAM Graphics:nVidia GeForce 9500 GT / ATI Radeon HD 2900  Hard Drive:1.75 GB HD space Sound:DirectX9 compatible sound card",
    "reviews": [
        {
            "review_text": " Q : What do you get if you cross  Portal 's wacky physics puzzles with a modernized, gorgeously realized Tex Avery-like art style, and add in a mad scientist voiced by  John de Lancie  [en.wikipedia.org]  ('Q' from  Star Trek: The Next Generation )?   A : Well, if any of that description made you perk your ears up and drool, then you probably already own this game. And hey, the great thing is, if you absolutely hate any part of that description, you will probably avoid this. Easy!  It's a great game, and really, really scratches the  Portal  itch. The animations and artwork in the game are charming, demented and sometimes unspeakably cute. (I love the machines that barf crates! I love them so much!) De Lancie is suitably crazy, but not maliciously so -- he's just very determinedly absent-minded, that's all! The areas are filled with a nice array of collectibles, the game runs smoothly... I can't really find too many things wrong with this.  Well, except one: I'm stupid and haven't been able to finish the game yet. But chances are WILDLY in favor of you being much smarter than I am, and so you have nothing to worry about!  Adorably exasperating game.",
            "review_score": "1"
        },
        {
            "review_text": "Ok..this game. I got it with a offsite bundle when i bought it.  First off, you may notice the voice of the Narrator as 'Q' from Star trek series, also know as John De Lancie. His voice is great and somewhat soothing.  Now for the game itsef, it is a puzzle game with different situations to solve. Basically, you get different powers depending on the 'dimension' you are currently in. For example, the cloudy dimension makes everything so light you can move it around, including heavy bricks. There is also paid dlc for this game, but i don't own those dlc's. They just add more levels and stuff i think.  Recommended due to John De Lancie doing narrator is great reason, and i love puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "A very long, complex and crazy puzzle platformer. The only downside is the platformer part, as getting to the right solution usually is less difficult than perfectly executing it, which made it a very frustrating game to myself at times. The story is great though, the art design is spot on and it is highly creative. Definitely different, unique and worth a look.",
            "review_score": "1"
        },
        {
            "review_text": "Portal by Pixar. It's not on the same level as Portal but it does it's own thing and makes it work. The levels are heavily physics-based mechanical challenges rather than the 'this should logically be impossible find the loophole' puzzles that Portal sets up, and the game is unapologetic about this. The main reason I approve of this choice is the 'slow' dimension, which is basically 'remember those ridiculous Quicksilves scenes in the recent xmen movie? Here's a game of that'. The ridiculous spectacle of what this game has you do makes it memorable to me.  That said, the game is very much 'style over substance'. It's got the Pixar aesthetic, the wacky physics puzzles on a crazy scale, and that's basically it. There isn't much story to speak of, or much sense of progression until you hit a new third of the game. If you want to live out the aforementioned Quicksilves scenes and aren't hung up on the above flaws, give this a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, can get hard at times. Like portal but the storyline is not as strong!",
            "review_score": "1"
        },
        {
            "review_text": "Quantum Conundrum can compete with Portal. Underrated, interesting and funny,",
            "review_score": "1"
        },
        {
            "review_text": "The story might not be as full as Portal, but the game is a blast to play.",
            "review_score": "1"
        },
        {
            "review_text": "Quantum Conundrum is a really fun game to play. The puzzles are challenging but not impossible. Near the end though they get a little frustrating and seem to be more based on reflexes than actual puzzles. But I do recommend the game, it feels so good the go from not knowing what to do to figuring out the puzzle and solving them. Nice game for people who loved Portal.",
            "review_score": "1"
        },
        {
            "review_text": "This games holds a variety of puzzles with a touch of creativity that makes it stand out on its own. From shifting to different dimensions, to even getting timing down to a key; this games is rather entertaining even for the roughly 7 hours it took to complete.  Overall, the game left me wanting more(2 upcoming dlcs sometime soon) and that's a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "Always a fun game to back to =)",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game, got interesting and dinamic puzzles, very funny and entertaining. It also got secrets in often hard to reach places and a challenge system that makes the game even more challenging (time trials, no deaths and less possible number of dimentional rifts). Each dimention got its own paralel reality, as you can see on how objects and portraits change, another feature that makes the game even nicer. The dimentional change and the change they create on everything that surrounds you are instantaneous. If you are a puzzle lover, specially a dinamic puzzle lover, this game is a must.",
            "review_score": "1"
        },
        {
            "review_text": "I'm loving this game. John Delancie is a great VO, the puzzles are fun even if some will take a few goes. This game CAN run on XP, despite what the minimum reqs say. The DLC is just punishing BS though.",
            "review_score": "1"
        },
        {
            "review_text": "Science with Discord",
            "review_score": "1"
        },
        {
            "review_text": "Easy and relaxing puzzles, and funny dialogues. But the laser sounds are quite annoying.",
            "review_score": "1"
        },
        {
            "review_text": "If you like games that are similar to Portal and Portal 2, then you'll most likely enjoy Quantum Conundrum.",
            "review_score": "1"
        },
        {
            "review_text": "-Best basketball simulator. -Best slow motion platforming. -Best puzzles. -Best jokes. -Best furry friend. -Like Portal but not by Valve.   10/10 Spent 3 h just finding ways to hit IKE in the head XD (I'm a terrible person). And I still wonder what is with all the toilet flushing sounds...",
            "review_score": "1"
        },
        {
            "review_text": "Good first person puzzle game. Good enough to get dlc &amp; all the achievements? meh &lt;_&lt;     3/5stars ***",
            "review_score": "1"
        },
        {
            "review_text": "THEN I FLIP A SWITCH AND FLUFFY IS EVERYTHING PLUSH AND SWEET AND SOFT AND PINK I FLIP A SWITCH AND HEAVY IS EVERYWHERE CRASH TO THE GROUND FROM OUT OF THE AIR I FLIP A SWITCH AND TIME GOES DOWN, DOWN, DOWN STRETCHING THIN AND STRETCHING OUT I FLIP A SWITCH AND LOSE THE GRAVITY LIGHT AS A FEATHER AND FLOATING FREE",
            "review_score": "1"
        },
        {
            "review_text": "Great game when your bored, have it mentioned its great? EITHER WAY ITS FUN, but boring once you beat it...",
            "review_score": "1"
        },
        {
            "review_text": "It is definitaly, fun and chanllenging, but the puns get old pretty quick.",
            "review_score": "1"
        },
        {
            "review_text": "I give it 9* from 10*, because this is an AWESOME game! and only 9, because too short :/ but i enjoyed every second of it (:",
            "review_score": "1"
        },
        {
            "review_text": "Quantum Conundrum's nutty interdimensional experiments don't go off without a hitch, but this inventive first-person puzzler still produces some enjoyable results.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Portal, this game has some fun puzzle elements do it and a great art style.",
            "review_score": "1"
        },
        {
            "review_text": "This is an extremely fun game! It's kindof a puzzle game, semi-similar to Portal, but without the portals. Instead, you have dimensions. It's challenging, and is a whole lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Portal except with Q from Star Trek and time powers.",
            "review_score": "1"
        },
        {
            "review_text": "You control time, weight and gravity to solve puzzles. Timeruns, least dimension shifts and collectibles feed the replayability. It's a pretty good game which should have concentrated a bit more on the puzzles instead of jumping and sofa rides. For those who need a numbered rating: It's a solid 85.",
            "review_score": "1"
        },
        {
            "review_text": "quality game, bit like a poor mans portal but worth a purchase if your a fan of a genre",
            "review_score": "1"
        },
        {
            "review_text": "This game I had watched on youtube a long time back and was really excited for it. I finally bought it one day and it still is really good. I don't think people liked it that much because of its repetetiveness but I want a sequel, maybe the protaganist is older now and we can see something along the lines of a story about my uncle.",
            "review_score": "1"
        },
        {
            "review_text": "Very good puzzle game, if you liked Portal (and don't mind jumping puzzles) be sure to get this one.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, narrated by John De Lancie, what more could you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game. definetely pick this up at its great price.",
            "review_score": "1"
        },
        {
            "review_text": "About 7 hours. Puzzles start pretty simple and dull, but you end up doing some cool things, even if theyre mostly not difficult. NPC's personalities may be too goofy for some to take. The ending has zero resolution, it just ends. Overall pretty fun puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Innovation at it's finest, merging physics and fun into one marvelous game. Thinking outside the box has never been this much fun.",
            "review_score": "1"
        },
        {
            "review_text": "'Why did I make that?'  Featuring a cute interdimensional beast/elder god, the voice of Star Trek's 'Q' and lots of fun puzzles, this game is awesome incarnate. From the awesome dimension. There's a fair bit of tricky platforming (which some people won't like...), and the dimensions themselves have weird effects on the environment, which are necessary to solve the puzzles.  ALL THE STARS.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun! I think its as good as portal!",
            "review_score": "1"
        },
        {
            "review_text": "great game but can you fix the xbox controls?",
            "review_score": "1"
        },
        {
            "review_text": "Complicated but fun",
            "review_score": "1"
        },
        {
            "review_text": "A decent puzzle game “inspired by” Portal. The same silent protagonist, radio instructions, concealed mentor, one room – one puzzle rule and so on. But unlike Portal where you had to coordinate just two portals in one dimension, Quantum conundrum offers you four different dimensions. And in my opinion it doesn’t make the game better. It’s not enough just to plan your further actions, you have to use 3 (or sometimes even 4) dimension with extremely precise timing or you will fail. So it’s not the puzzle complexity that pisses you off, it’s the necessity to play some traps over and over again. You may say it is a game for you spinal cord rather than your brain. The other weak spots are the plot and physics engine that doesn’t handle all the dimensions correctly from time to time.  But it’s still a nice game with humor (put closer attention to the pictures on walls) to amuse yourself for a couple of evenings. 7/10. Gonna check out the Talos Principle now :-)",
            "review_score": "1"
        },
        {
            "review_text": "Quantum Conundrum is often dubbed as a spiritual successor to Valve's Portal. After all, they're both magnificent first person puzzlers by the talented former Valve employee, Kim Swift.  When wholly considered, the biggest similarity Quantum Conundrum shares with Portal is its narrative device. Puzzle after puzzle, players must endure the disgruntled remarks of the character's uncle whose behavior was clearly inspired by Portal's sociopathic artificial intelligence, GLaDOS.  Fortunately, the meat of this game, the puzzles, are original and incredibly fun! The player is given the ability to switch between four unique dimensions to get from room to room. These shifts include making all objects lighter or heavier, slowing down time, and reversing gravity. However, rarely will all four dimensions be available simultaneously, making solutions obvious and limited.  Despite its lack of replayability, Quantum Conundrum is still a welcomed addition to the puzzle genre worth playing.  Grade: B",
            "review_score": "1"
        },
        {
            "review_text": "Its kind of like Portal but not. Anyway its good.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun little game. Some lateral thinking required. If you want a good game to strain your brain, this is definitely one of them. Not as malevolent as the Portal games, but still pretty harsh. Have fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you loved Portal, then this game is a lot of fun! Instead of a portal gun, you have a choice of 4 different 'dimensions' to try and solve the puzzles with... hours of fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "A fun puzzle game that challenges you to think both outside and WITH the box. Some of the puzzle levels rely a little too much on precision rather than actual problem solving, and the script is somewhat lacking in wit and humour. But the very inventive gameplay, quirky production design and great soundtrack are more than enough reason for anyone to give this game a try.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, full of fun and mind bending puzzles!",
            "review_score": "1"
        },
        {
            "review_text": "A gust of unexpected fun, nice graphics, cool music, the perfect amount of irony and not so easy as it seems, all in a well designed physics game that seems a mix between portal and team fortress. I'd say a must.",
            "review_score": "1"
        },
        {
            "review_text": "A new way of thinking out of the box! Shift through the dimensions to manipulate almost every object that you come across!",
            "review_score": "1"
        },
        {
            "review_text": "First person puzzle / platformer, in the same genre as Portal. Primary mechanic is gravity manipulation. Interesting graphical style.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, I have to admit this is a brilliant puzzle game, but the pacing and game flow make it much inferior than similar titles like Portal.",
            "review_score": "1"
        },
        {
            "review_text": "Exxxxcelllent Muhha ha *cough* *cough* ha! Twist your mind around this portal like puzzler! More engageing than said other game.. Damn game drove me sane. Loooollloolllb boooff llaaa laa! ",
            "review_score": "1"
        },
        {
            "review_text": "Then I flip a switch~ If Quantum Conumdrum looks a lot like Portal, there's a reason for it. It's got the same guy behind the original Portal behind its reigns. Plus John DeLancie voicing your voice in the sky- err, pocket dimension. The gameplay makes it easy to feel really smart when you solve a puzzle, and even easier to feel stupid when you don't. Flipping between dimensions is quick and easy, but it's simple to press the wrong button and end up dropping out of the air into a bottomless pit. Honestly, the game is fun, even if it is short, and you should pick it up. Think outside the box, them make it fuzzy.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Portal or any other kind of puzzle game you will enjoy this one. Its a well designed and enjoyable game focused around dimensional shifts. Like portals these will effect the environment around you and allow you to perform preposterous stunts such as couch surfing through laser beams. On top of that the voice acting is fantastic and the story is hilarious. All in all a good game and well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant! Almost as good as Portal 2 :3",
            "review_score": "1"
        },
        {
            "review_text": "If you loved portal, you will love this silly little thing!",
            "review_score": "1"
        },
        {
            "review_text": "PORTAL DEV LEFT VALVE AND MADE THEIR OWN GAME. IT'S GOT A LOT OF CHARM AND QUALITY PUZZLES. THO AT SOME POINTS THE PUZZLES ARE UNINTERESTING, NOT PERFECT BUT OVERALL GOOD.",
            "review_score": "1"
        },
        {
            "review_text": "If they made Portal with a crazy Uncle instead of an insane A.I. with a manor house instead of an underground lab, and control over gravity/time instead of portals, you'd have Quantum Conundrum. Great game can't wait for DLC.",
            "review_score": "1"
        },
        {
            "review_text": "A charming first-person puzzle platformer (similar to Portal 2), with it's own unique narration and puzzle mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Its like portal, only with cooler 'powers'. be warned, this game is trippy, and will cause you to react to things in the real world is slightly a different manner... trying to lift cars.... expecting things to be heavier, running in slow mo.. ext.",
            "review_score": "1"
        },
        {
            "review_text": "A sort of... silly, fluffy Portal.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great puzzle game, almost as good as Portal! It has very interesting mechanics to create puzzles, and each puzzle has a lot of creativity involved. The context and story are very funny, it is actually very fun to listen to the narrator and look around at the environment details like paintings and such. The game is a bit short and easy, the hardest puzzle is much easier than Portal's hardest puzzle, but you will find harder puzzles in the DLCs, which I do not entirely recommend because some puzzles' increased difficulty is due to the addition of trial and error to solve, which introduces frustration.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Portal you will like this!  Don't expect it to be better than portal, but this is the first game I've played where I thought it's worthy to be placed in the same category as Portal.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my god. This is amazing. Playing this game for ten munutes was enough to get me hooked. 10/10, one of the best games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "This game's pretty good. A simple, light-hearted puzzle game with some interesting mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Quantum Conundrum's nutty interdimensional experiments don't go off without a hitch, but this inventive first-person puzzler still produces some enjoyable results.",
            "review_score": "1"
        },
        {
            "review_text": "You control time, weight and gravity to solve puzzles. Timeruns, least dimension shifts and collectibles feed the replayability. It's a pretty good game which should have concentrated a bit more on the puzzles instead of jumping and sofa rides. For those who need a numbered rating: It's a solid 85.",
            "review_score": "1"
        },
        {
            "review_text": "Has some of the people behind Portal working on it; and it's similar except the puzzles are solved by manipulating the properties of objects and the rooms by switching between various dimensions. Pretty clever situations in some cases.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a flawed gem. It's a very innovative way of playing, it's got a weird atmosphere, and the puzzles are very good. The game is visually appealing, and all the dimensions are fun. However the game tends to be repetitive and frustrating at times, and it feels that with some more polish, it could be much better. However at such a small price, it's a steal. I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Personally, I find this game boring, but intriguing. The mechanics are very well implemented but they get slightly over-used. I found always use each different 'state' fun but the zones where you used them went on for too long. I would get used to it, love it, then grow tired of it and would rush through the rest making me frustrated and tired. usually missing many of the small jokes and story.   5/10",
            "review_score": "1"
        },
        {
            "review_text": "Portal clone with a lighter sense of humor and some new mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "While the game does make Kim Swift seem a pit of a 1 trick pony, she at least shows that she is damn good at that trick and can switch things up to keep it interesting. The game plays just like portal did, except isntead of haing a portal gun you can switch between up to 4 dimensions, heavy, inverted gravity, slow motion and 'fluffy' (light weight basically). The game has a good sense of humour, just like portl did, but it's more aimed at kids this time around. All up it's a fun puzzle platformer kinda thing, almost as good as portal was and well worth it if you are into that kinda game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun physics puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "It is like Portal, but is family friendly &amp; harder. Be prepared to fall to your death, a lot.. so you won't be able experience cake, just sayin'.",
            "review_score": "1"
        },
        {
            "review_text": "A puzzle game in the Portal genre. You move from one puzzle room to the next, using your special gadget to alter the physics and timestream in each room in order to solve the puzzles. Featuring the voice of John de Lancie as the super-scientist guiding you through the story.",
            "review_score": "1"
        },
        {
            "review_text": "It plays alot like portal, move room to room, put object on buttons, avoid lasers and falls, all the while your trip being narrated by an all seeing voice. Still worth a play though. I'd reccomend picking it up for $10 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "Ok first off yes I know one of the creators of portal worked on this game. Yes it is a cheesy childs copy of a dumbed down version of portal. But the question is...is it fun? The answer is yeah it actually kind of is. The puzzles are stupid they are clever, however they do require alot of platform jumping. Yes...I said jumping for platforms. Which is really not a bad thing, however it's just EVERYWHERE. Decent game? Yes. Worth $15? Nah, but definatelly worth the $8 I paid for it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun physics puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Even before playing Portal I loved physics based puzzles and this takes it to the next level. This graphics are also very suiting to the style of the game.",
            "review_score": "1"
        },
        {
            "review_text": "I am inevitably going to draw comparisons to Portal for any first person puzzle game especially one for which cubes play such an integral part. You don't have a portal gun but an IDS device, no that's not an Iain Duncan Smith device that makes your pensions and benefits disappear but an Inter-Dimensional Shift device to flip between dimensions that give items different properties. A great puzzle game, like Portal, makes you feel clever when you solve a problem but a bad one will frustrate you and make you feel like an idiot. This game does a pretty good job, it is not as satisfying as Portal but it is still good fun. Some of the puzzles require precise timing and can take a number of attempts but do not get too frustrating. John de Lancie does a great job voicing the professor that adds an interesting plot to ties the puzzles together. The game is a good length. The locations designs are somewhat repetitive but all in all this is a good game just not as good as Portal.",
            "review_score": "1"
        },
        {
            "review_text": "+ Funny puzzles + Great graphics and sounds  - Longevity (it's not so short, but it could be longer) - The finale. It seems they didn't have many ideas on how to end the story... - Ike could be used better - A bit repetitive",
            "review_score": "1"
        },
        {
            "review_text": "This is easily one of the best puzzle platformers I've played since portal and I put it only one notch behind portal. I thought the 4 dimensions were genius and found the puzzles entertaining. The platforming was pretty good and I didn't find it too hard as some negative reviews have said. Game length was around 7 hrs being the casual that I am but I'm sure you could be quicker. Got it for around €2 on sale what more could you ask for. Best money I ever spent. You like portal you'll like this.",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzle game, keeps you thinking while still being very entertaining",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little game. Quirky and intelligent, it can be seen as a more platformer Portal (it was made by the lead designer from Portal, I believe), with music and puzzles that are 75% not falling into the abyss, 25% figuring out how to ride a couch being shot upwards through a battery of lasers to push a button while listening to the snarky remarks of your uncle.  The uncle is voiced by De Lancie, Q from TNG. He also sounds like my GR professor back in undergrad. Man that class was hard. It's finals week --I should be studying.   Ok, one more level and I'm done.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game indeed. I love the visuals and even though it's short, the story is good. There is some replay value, so overall this little gem gets a 9/10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely love it. It makes me think, sometimes it makes me curse in frustration, and the dialog is funny and interesting. Totally worth the money for the game.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game and perfect for on TV with controller. Challenging puzzles that really got me hooked.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Portal...but not",
            "review_score": "1"
        },
        {
            "review_text": "If you've played portal and loved it, you are gonna like this too. It's a puzzle game, yet the puzzles were quite easy to solve. Don't get me wrong, some of the puzzles took me a little longer than others, and they do get gradually harder the longer you get.  Although it's rather short, the story is okay, nothing too special. I completed the main story in less than 5 hours, wich is alright considering it cost me less than 3 eur on sale. I believe there is some extra levels, you can unlock by finding blueprints scattered, around the different story levels. Didn't look into those though, so can't really talk about them.  Did I have fun?  Yes indeed.  Buy at full price? If you like puzzle games, sure. I like puzzle games and I waited for it to fall in price. But it's still worth full price in my opinion.  ",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on sale for about $4, and I would have gladly paid $15. It is a very solid puzzle platformer with a (somewhat hit or miss) sense of humor. The puzzles feel clever and require a bit of trial and error, but no puzzle really felt like a wall. The difficulty curve felt fair. Expect about 6 hours of content if you are familiar with puzzle/platformers of its ilk. This game is not overly ambitious, but it does deliver excellently on small, iterative puzzles that manage to make you feel smart for solving them. If you go in expecting that, you will be happy with your purchase. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "In theory this is a game I should like. In fact, I WANTED to like it. John 'Q/News Anchor from Crank' DeLancie as narration, time/space manipulation in a 3D puzzle environment, a distinct visual style, etc.  Here is the problem, and to elaborate, I'm going to have to compare this game to Portal, which a lot of people did on its release due to one of Portal 1's designers (Kim Swift) leaving Valve to work on this title, which is a similar genre, let's be frank. Portal 1 worked because it was brief. It'd do a few things with a tool, then move on to something else, occasionally mashing all your obstacles up for a challenge room/test of what you'd learned. Part of what worked to keep this from getting stale was that you had hints and taunts from your omnipresent narrator/torturer, and part of it came down to the puzzles being tested to a good balance of 'solvable but not instantly'.  Quantum Conundrum has most of these attributes, but in sort of a 'they came back wrong' variety. John DeLancie is playing the same role of narrator/reason for being in this mess, but a lot of his hints are either weirdly couched in ways that you're not going to get them (and you will hear them 5 times as you try to figure them out, too), or just outright irritating. Between stages in the loading bridge areas you'll hear him spout what is basically monkey-cheese randomness about 'his' predicament, but there's not much reason to care because he's the dude what trapped you in Deathtrap Manor by accident where he decided to design really, really overzealous laser beams everywhere. (I'm not entirely convinced the lasers work as intended: stuff that's just supposed to destroy items had a tendency to fire right through into my skull more than once, ending my run at a puzzle.) The puzzles are indeed short rooms to solve and then move on to the next 'chamber', but there's not much chance at learning them and a few are just straight up blind luck. One in particular springs to mind as it has you choosing two or three different branch points on a conveyer belt and while it IS possible to backtrack on it, it's a real bear and a lot of them lead around corners or to paths you cannot immediately see are dead ends/death.  The other big Portal gripe I'm gonna throw out: in Portal, you get the gun, you get a few rooms of training, and then YOU HAVE THE GUN FULLY OPEN FOREVER. Quantum Conundrum gives you 4 seperate powers, which are clearly controller-mapped given how they show up on a keyboard, and then gives them to you and takes them away randomly from room to room, so that just as you earn something it's out the door for two stages, then you need to find the object in the level to swap it out with the other power, then... The juggling really makes the game more tedious than interesting, when I just want to play around with all these weird reality warping buttons instead of learn about DeLancie's fuzzy multidimensional friend who hid a bunch of barking robots all around the house*.  I did not finish this game. I'm sure some people will bash me for that, but I'll be honest: I got halfway? Most of the way? through the second of four hubs, and when the puzzle was repeating the same 'make object light, toss, turn on slow-mo to catch it' gameplay for a third room running, but this time with instadeath pits and sloppy wooden platforms to bounce between... I stopped. I realized that absolutely nothing in this game had any sort of charm or fun factor to keep me going. It wasn't even a CHALLENGING game, so long as you realize 'Okay I have two powers what can they do' and 'how to avoid lasers'.  This has potential, and I'm sure that the writing isn't going to be a turn-off for some, because comedy's amazingly subjective, yadda yadda. I'M going to tell you 'this game is a hot mess, avoid', but if you're remotely curious, it drops to like... $4 with all DLC constantly. Why not, it's your money.  * Not a joke.",
            "review_score": "-1"
        },
        {
            "review_text": "When I heard about Quantum Conundrum I jumped all over it. After all, I loved Portal and Portal 2, so why not?  Well, the game showed me why not. While I enjoyed the actual puzzle segments, the game veers into reflex trials. I hate reflex trials. I play puzzle type games for puzzles, not rote memorization and twitch gameplay. I know there are gamers who enjoy that sort of thing, but I cannot count myself among their number.  I'd love to be able to recommend this, but the reflex trials are just too much for me to see past.",
            "review_score": "-1"
        },
        {
            "review_text": "So this is a first person puzzle game much in the same vein as Portal. One of the creators of Portal is also behind this game so there are some similarities. But where Portal was ingenious and funny, Quantum Conundrum is not. The main difference as I see it between the games is that in Portal working out the solution to the puzzle can be a bit hard but once you do the execution of said solution is fairly easy. In Quantum Conundrum it is the exact opposite. The solutions are easy to figure out but the executions can be complex and frustrating. Needless to say, I prefer the Portal-way of doing puzzles.  In Quantum Conundrum you often have to time several jumps on the row which can make it frustrating when you miss the last jump and have to start over again. On the upside, the checkpoint-system is very generous so you dont have to redo a puzzle from the beginning but you usually continue at exactley the platform-puzzle where you failed.  I found the game easy and it took me about 3 - 4 hours to complete it. The problem is that it seems that they have opted for Quantity instead of Quality when it comes to the puzzle. If you play the game for an extended period of time (over 30 minutes) you get a bit bored by the fact that every puzzle bare some resembles to the one before it which makes it feel that you are essentially solving variations of the same puzzle multiple times. It works to play it in short spurts but over 30 minutes of gametime isn't recommended.  At this point it costs about €9 and I would recommend it when it drops down to $5 and if you have a real craving for a first person puzzle-game. If you haven't played Portal 1 and 2 I would recommend you to do that instead.  Edit: Also, I didn't find the game funny...at all. The portal games are laugh out loud funny to me but this game fell completely flat. I found the narration to be more annoying than anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "A quite average puzzle platformer, with 'humerous' monologues sprinkled throughout. I will be perfectly honest; I couldn't get through it. Not because it's difficult (the difficulty lies only in the logic of the puzzles - no biggie) but because I couldn't stand the gameplay and colour scheme. The movement is floaty, and ill suited to precision jumps, and the aformentioned logic of the puzzles have more to do with how funny the developers think they are than established mechanics. Beyond that I personally found the colorpalette grading and hard to suffer through.  If you are looking for a colourful comedy puzzle platformer, this is one. I found it to cringeworthy in it's comedy and aesthetics and lacking in gameplay, so I can't reccomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun for the first play through but after you know all the solutions to the puzzles it fails to keep you coming back.",
            "review_score": "-1"
        },
        {
            "review_text": "This game gives me really bad motion sickness when you turn, unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "I was really looking forward to this game, but it was one of 2012's disappointments for me. The premise is great and the art style looks unique, but the game itself just isn't fun enough. It's repetitive and, even worse, due to the physics, solving puzzles often comes down to luck, not puzzle solving or skill. It's kinda sad, with better design this could've been a great puzzle platformer, but in this state, it doesn't deserve the genre 'strategy'.",
            "review_score": "-1"
        },
        {
            "review_text": "If it worked i'd be glad. It seems there's a small amount of people that get a bug. When you start the player start going forward and left automatically, so it's unplayable. Searched for solutions but nothing solved. This game uses Unreal Technology and this bug on PC is somewhat common, but on QC is unsolvable.  Also you can't map your controls and the developers didn't even care to at least tell you what is 'Y' button on Xbox is located on your PC keyboard.  I saw this game on console and it's very good. But the PC version is s**t.",
            "review_score": "-1"
        },
        {
            "review_text": "A really boring portal knockoff. It came with really ♥♥♥♥ing sweet (at the time) TF2 hats though and I don't regret my purchase one bit.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly boring, story is poorly written, voice acting is lacking. Stanley P. and Portal are awesome, take the worst part of both (yes you'll have to look for it) and this is Quantum Conundrum.",
            "review_score": "-1"
        },
        {
            "review_text": "The implementation of this game's mechanics was a disappointment - the puzzles often feel unnatural, and the gameplay lacks focus. There is fun to be had, but the game wasn't inspiring enough to keep me pressing through the high difficulty curve - 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "like portal but without portals and with John De Lancie  0/10 never touch",
            "review_score": "-1"
        },
        {
            "review_text": "It's like portal.........but ♥♥♥♥♥♥ ",
            "review_score": "-1"
        },
        {
            "review_text": "First game in years that I haven't been able to run properly on my PC. I don't even know how the game plays. It starts lagging with resolution upwards of 640x480, not to mention bloom and motion blur. I sincerely regret giving money to the people who show such incompetence and disregard to the experience and product, programming-wise.  Kim Swift, I love your work, but you got yourself mixed with some bad crowd. I don't see myself giving money to Airtight Games again in the foreseeable future.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this to fill the gap of a missing Portal 3... It is a puzzle game, but there is something about it that just made it not very fun. I dont know if it is the narrator or what, but I just could not keep interested in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I would not recommend this game, especially if you're a fan of the Portal series. Lots of people are saying that if you like Portal you'll like this game but that was not the case for me. After a few hours of gameplay I figured out the reason I didn't like this game is because it relies too much on platforming and it floaty. For example I would die 20 times trying to land on a safe in the fluff dimension because my characters momentum would continue long after I left of the forward key.  The dimension's were a very cool idea, but the game is poorly implamented. Also on my system with an Nvidia GTX 760 I had framerate drops down to 20 FPS in some areas.",
            "review_score": "-1"
        }
    ]
}