{
    "app_id": 200020,
    "name": "Global Ops: Commando Libya",
    "release_date": "2011-10-26",
    "developer": [
        "Spectral Games"
    ],
    "publisher": [
        "Immanitas Entertainment GmbH"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Third-Person Shooter",
        "Third Person"
    ],
    "achievements": 24,
    "positive_ratings": 131,
    "negative_ratings": 191,
    "price": 3.99,
    "description": "An atom bomb has landed in the hands of terrorists, the threat of an attack… and only you can prevent a catastrophe!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/200020/header.jpg?t=1454920229",
    "minimum_requirements": "OS: Windows XP, Vista, 7 Processor: AMD or Intel dual-core processor 2.2 GHz Memory: 2048 MB RAM Graphics: ATI or nVidia graphic card with at least 256 MB DirectX®: 9.0c Hard Drive: 6 GB HD space Sound: DirectX 9 compatible soundcard Other Requirements: Broadband Internet connection",
    "recommended_requirements": "OS:Windows XP, Vista, 7 Processor:AMD or Intel triple or quad-core processor 2.8 GHz Memory: 2048 MB RAM Graphics: ATI or nVidia graphic card with at least 512MB VRAM DirectX®: 9.0c Hard Drive: 6 GB HD space Sound: DirectX 9.0c compatible soundcard Other Requirements: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "This game is like those bad movies ( The Room, Birdemic, Samurai Cop, Hercules in New York...) that are so bad that they are good. I dont recall the last time i laughed this much while playing any game, for the wrong reasons mind you, but still. Even when i die in this game i dont mind cause im dying with a smile on my face.",
            "review_score": "1"
        },
        {
            "review_text": "Reviewing Global Ops: Commando Libya is like reviewing a trip to the dentist, if you enjoy a little pain then you'll enjoy playing this game.   Your mission is to take control of half a two man special 'special' ops team as they make their way through 9 or so levels of corridor shooting one-dimensional gun play, The action is experienced as a third-person cover shooter in that you must use the environment to avoid taking damage as you shoot the hordes of dumb ai controlled enemy soldiers. You must run through various locations that are distinctly the same, moving from cover to cover, avoiding a barrage of shots that do not easily kill you (at least on regular difficulty) until you get to the end of the level.   There is barely any variation to the core gameplay. In some sections you must avoid lethal fire from tanks, helicopters or hvg. machine gun emplacements [that you cannot destroy,] or the like, while picking up ammo and grenades from fallen enemies, until you find conveniently placed weapons at the end of a level section. There are a few locations that require you to use some sort of heavy weapon to destroy a boss (helicopter, tank etc)  Graphics are nothing better than okay, while music if fine. The overall look and feel of the game is that it is something from the 1990s - probably due to the game engine being used. Story and voice-overs though are bad, really bad. I mean the stuff of bargain basements, not legend. Truly the narrative is something out of a Hollywood Z-list action movie. While the voice acting is just as bad. Your AI controlled buddy is practically useless, getting lost most of the time or moving out of position into the area ahead where the enemies are pouring from but, without actually killing anyone. Though he does chip in with the odd kill from time to time.  If you are wondering if there is anything positive about the game its probably that you can use numerous guns, even if there is little to differenciate them apart. Weapons include: UMP-45 SMG, M16+M203 grenade launcher, the latter of which doesnt work, AK-47, M1014 shotgun, frag grenades, M249 light machinegun, the Draguov SVD sniper rifle and M136 anti-tank/vehicle launcher.   I still cant believe I am recommending it. You maybe asking why... and how. The thing is despite all the negative aspects of the game, it actually feels fun to play. Yes the story is pants. The audio amateurish. Gameplay is basic but, if played in short bursts it can be mildly enjoyable in an old-skool kind of way. I found myself smiling as my AI buddy and me took on hundreds of cliche enemies ala Rambo style. I guess if you played games twenty years ago this may remind you of the titles of the same franchise and bring a smile of nostalgia to your face.  Overall though I would only recommend getting this in a sale. Its definitely a guilty pleasure. Though the game is over quite quickly and is nothing special. The ending is maybe worth getting too also. If you dont play it, you wont miss much. However Im off to replay this on hard. Pope if you're reading this... read a dictionary and learn to count past 10, you dumb s-o-b!",
            "review_score": "1"
        },
        {
            "review_text": "'This would be a laughable tribute to Gears at Best!'  When I first played this game, the first thing that came to mind was 'Hey that's not a B52 that just crashed! it's an Antonov ... Russian not American lol' so I'm letting the intro sequence play on and notice how funny the characters look and how they move. The movement seems almost limpish as if everyone was limping which just breaks the feel to the game. The action is mediocre wether you're using melee attacks to take out an enemy silently or the shooting aspect where you need to be in the over-the-shoulder view (iron sight) if you want to see the crosshairs. Then there's the cover system which is hit or miss and just like in Gears of War; you will die quickly if you're not behind it. The voice acting is sooo stupid it's beyond hilarious :) makes you feel like you're playing thru a parody of Rambo or Commando lol. All in All, I cannot recommend the game unless you want to get a good laugh and a few thrills here and there",
            "review_score": "-1"
        },
        {
            "review_text": "just had a try of this see if it works before i shoot off to bed and can say it plays fine, controls are easy enough just needed to figure out what button did what as i could not see a controls menu on main screen or under options but it is easy enough to figure out w,a,s,d for up down left ad right space to jump/eneter cover e button to pick up items or swap and open doors left mouse button fire right mouse button for sighting. graphically it aint amazing but good enough for £2.40. story is fine voice acting a little delay here and there but fine also. gameplay so far it looks generic but for a bargain price as mentioned no complaints. will be coming back to this soon.",
            "review_score": "1"
        },
        {
            "review_text": "It's exactly what it says on the tin.   Sure, it's not Gears but come on it probably had a hundredth of the budget if that .. and come on, all ye negative reviewers, it's on here for less than snacks and a drink at the cinema.   I like it. It's clunky, dumb, crazy, silly action fun like an 80s Schwarzenegger movie.",
            "review_score": "1"
        },
        {
            "review_text": "I want refound!",
            "review_score": "-1"
        },
        {
            "review_text": "No graphics options, no control info, poor aim setup (don't even try sniping), terrible voice acting. The list goes on. Thank god I got this game for free.",
            "review_score": "-1"
        },
        {
            "review_text": "Global Ops: Commando Libya fast game with modern day graphics with easy controls that moves from location A to B to C and so on,  good amount of action and special effects  good game. ",
            "review_score": "1"
        },
        {
            "review_text": "Played 7 minutes, nearly killed myself. Deleted local content.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought the game. Installed it. Opened it. Opened the settings tab and got an achievement. Closed the game and never opened it again.",
            "review_score": "-1"
        },
        {
            "review_text": "i like this game, its nice but its has a super tiny boolbool",
            "review_score": "1"
        },
        {
            "review_text": "Got through a hundred bullets then got killed by a slow rolling log! Funniest game I've played for a long time!",
            "review_score": "1"
        }
    ]
}