{
    "app_id": 200370,
    "name": "A Game of Dwarves",
    "release_date": "2012-10-23",
    "developer": [
        "Zeal Game Studio"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy",
        "Casual"
    ],
    "tags": [
        "Strategy",
        "Casual",
        "City Builder"
    ],
    "achievements": 29,
    "positive_ratings": 275,
    "negative_ratings": 167,
    "price": 7.99,
    "description": "A Dwarven Prince on a quest to reclaim his people’s stolen land will take you on a great journey. Explore a continent filled with buried treasures and unearth mysteries that have laid hidden since the Great War.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/200370/header.jpg?t=1447356097",
    "minimum_requirements": "OS:Windows Vista / Windows 7Processor:Dual Core 2.4 GHz processorMemory:4 GB RAMGraphics:Shader Model 4.0 compatible card (minimum Nvidia GeForce 8000, AMD Radeon 2000)DirectX&reg;:10Hard Drive:3 GB HD spaceSound:DirectX compatible sound cardOther Requirements:Broadband Internet connectionAdditional:3 button mouse, keyboard and speakers",
    "recommended_requirements": "Additional:3 button mouse, keyboard and speakers",
    "reviews": [
        {
            "review_text": "My first impression of this game was very optimistic; its gameplay was somewhat different from most games, and the games that this one is likened to are only in 2D, making this very promising.  However, after the first hour it became very apparent that this game was designed to be casual- no real resource management or needs/logistics to cover even the most sprawling of dwarven strongholds. Granted, the game IS in the casual genre, but a game like this has so much potential that it comes off as more of a half-baked idea than intentionally casual. This is evident in the lack of true challenges and very repetitive gameplay.   So, avoiding the strategy genre because there is nothing challenging, I wouldnt count it as a building game either. The number of items available arent very many for a builders' game, and what's available is most likely useless decoration, which would have been fine if the game had direction, but because of the immense amount of time it takes to make one or two decorations, playing this just doesnt seem worth the effort.   I was looking forward to this as an alternative to Towns, but I am disappointed to say that Towns is far more engaging and rewarding.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a good game. A little fun, but it gets dull. It is fun to dig a dwarf base. But story missions are pretty much all the same. The way enemies are handled is really annoying. Also, it has a bunch of bugs. Eg. Your dwarves will always fall down stairs once before going up them, because the game does not understand that it is not an empty space.  It also has a bunch of DLC, $5 DLC at that. I would pay maybe $2 for the game, so...",
            "review_score": "-1"
        },
        {
            "review_text": "Recently I looked on the store page wondering what others thought of this game, and looking over the reviews I could only see ones that did not recommend the game, and in all seriousness I strongly disagree with these claims.  The game, much like any managment game, plays very slowly, you start off with a barly functioning settlement and create a thriving dwarven city/stronghold/research lab, really whatever you want to make as long as it involves dwarves. From the start you must gather food and minerals, level up your dwarves as you go, fight off monsters, decorate your town/city/fort etc and make sure your dwarves are happy, you need specific materials for specific pieces of furniture and so you should really look to dig everything you can, you can make traps, barricades, grow food and create an army of adorable little dwarves.   Honestly I love this game, it is slow but when you finally finish your 10 story all-marble throne room with pillars and suits or armour it is extremly satisfying. At one time I literally filled up the largest map with a city which I named Moria after the lord of the rings franchise. The game is slow but satisfying and is NOT for people who do not like both trial and error and having to choose wallpaper for bedrooms...oh also you need to be patient, very patient.  Now, the game itself is only 10 dollars and I got a pre-order of it, it is fairly cheap comparing to most games and much better than a lot of more expensive ones *cough* infection survivor stories *cough*. All in all that is around pocket money price for the average teenage male/female assuming you don't spend it on something else.  As any proper review does, I need to point out the bad. The main point being that it is repetetive, very much so...to the point where the only reason you play story mode is to see what the ending is, which brings me to my next point, terrible writing. The story isn't immersive and feels like it was rushed, VERY rushed. But the levels are thought out well and allow a fun time while you struggle to understand what the hell is going on. And the worst part are the DLC's....ill just leave it like this.  All in all it a very fun game, it sqanders is potential a LOT, however I still love the game, and I love playing it, right now I am still trying to get enough dragonstone to finish my grand treasure chamber so I have to go, but seriously check the game out.",
            "review_score": "1"
        },
        {
            "review_text": "It needed a bit more work. The game is essentially fine but it could have used an update or two with some important features; like being able to create farmable soil so you don't have plants randomly all over your build. Buy it at $5 or less.",
            "review_score": "-1"
        },
        {
            "review_text": "oldskool classical dungeon digger, if u like dungeon keeper like games buy on sale. i finished the game in 28 hours, so not bad at all :)",
            "review_score": "1"
        },
        {
            "review_text": "I reallly wanted to like this game, but its just not that good.  The Digging is fun for all 5 seconds but then becomes tedious, The Levels take hours, im not kidding it took me 4 hours to do the first mission, Its VERRYYY slow paced to the point of me afk'ing whilst they digged, theres a Skirmish type game mode, but that's more a bug fest than anything.   I got this for £2 so i wont complain any more but i even felt that was steep.",
            "review_score": "-1"
        },
        {
            "review_text": "If you come here expecting Dwarf Fortress, you will be sorely disappointed. While the game is easier to learn, it does not have near the 'depth' that Dwarf Fortress has.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not finished, and will never be. Be warned. You better play DwarfFortress by Bay 12 games",
            "review_score": "-1"
        },
        {
            "review_text": "survivable, but only get it while its -75% in price. that's all it's worth",
            "review_score": "-1"
        },
        {
            "review_text": "i really wanted this to be good, but alas...  first, nobody should have to sit through a mission that's 2 hours long  missions are boring and sometimes to find the objective you have to mine out half the map!  story and writing is full of cheese, and are not engageing for me - i don't care about how my dwarf leader is a squeaky puss-puss, and the 'jokes' if you can call them that, are intentionally bad; bringing back my point that dwarves should not be seen as good-for-nothing puff!  tutorial is broken, i've seen many bugs during my time with the game.  Miners are kamikazee dumbos! one shall not dig a 1 block deep hole, get stuck in it and die [dwarves aren't puff!] when found a cavern filled with goblins, they think 'oh, that's a nice chair' , go sit in it and die! rightfully so, i have no desire to lead dumbos to victory of any sort.  dwarves falling down tunnels. AAAGH! there's only one animation- falling down one block! so if you dig into a 5 high room, your dwarf will play the animation, stand up mid-air, and play the animation after some time again 5 times!  why can i not refund prince upgrade points? if i spend 10 hours doing all the missions for one 'playthrough' so to say, i want full control to make the experience less infuriating. not to mention the countless bugs which mean that optional objectives give no 'influence' (used to gain Prince Upgrade Points) after mission is beaten, so off i go again for 2 more hours doing the side stuff just due to a bug!  happiness is a pointless, broken system. there is no advantage to building aesthetically pleasing stuff (most of which is behind a ridiculus 2pence pay wall) - you just use the excess resource to build a 'decoration'. this can be a {storage} room of statues- do that and suddenly your happiness meter booms! if you're gonna have me pay ANYTHING for DLC decorations, make sure i have a reason to do so. core game has more decoration than i can ever use, as anything takes up a 1x1x1 block.  mining, walking, eating, complaining all takes too long! if you wanna have me enjoy the 'slow' gameplay, ask yourself, what advantage would it give me? i've had a game where i lost mid way through because a goblin destroyed my main feeding table and my king starved. having sunk an hour into the mission, i was furious.  your game pauses every time you enter a menu! there's no way to change this, i've tried.   to say this again, i wanted to love this game, i wanted to have fun, and the game with full capability, refused to give this to me. artists, you've done well, coders, i wish you better luck next time.",
            "review_score": "-1"
        },
        {
            "review_text": "Too buggy, with a long winded and poorly executed tutorial that really lost me before the game had begun. Whatever happened to being able to discover the wonders of what each thing does in the game, must we really be told every little thing? What ever happened to surprises?",
            "review_score": "-1"
        },
        {
            "review_text": "Another game has lots of potential but end up abandoned half done. Game has some serious optimizing issues about graphics. kinda amazing how much GPU process needed for rendering very simple, primitive objects and textures. Not giving you feel of a completed game.   Don't hesitate if it's part of a bundle, sure it'll entertain you for a hour or 2. But Otherwise stay away, 10$ definately not worth for it.",
            "review_score": "-1"
        },
        {
            "review_text": "While the game is extremely fun, it appears to be extremely buggy as well. Bugs aside, the game claimed to be completely randomized. The truth of the matter is that the maps are only semi-randomized. Maps are predefined, but clusters of blocks which most can be dug through are randomized.  As far as the bugs are concerned, I have run into 2 that bother me. The first being that pausing the game, actually isn't a full pause; the game will actually progress even when paused, but at a much, much slower rate. The second would be a bug where buildable objects will drop below an item that has been moved just for the purpose of repositioning it (even when paused), right into the same place of the item you just repositioned, making the block where the item dropped from no longer buildable on that wall; this has been enough to make me have to keep restarting the game.",
            "review_score": "1"
        },
        {
            "review_text": "Goofy, fun and at times challenging. Good fun!",
            "review_score": "1"
        },
        {
            "review_text": "Hugely disappointing. Having hyped this game as a simplified 3D Dwarf Fortress, the developers either had no time to polish and add game functions, or they simply didn't have the skill to execute a game of this scale. Game mechanics are often hidden or pointless, navigation and moving the camera can be very confusing, AI struggles to accomplish simple tasks often doing it the most inefficient way leading to unnecessary deaths, animations and graphics that make me crave for Dwarf Fortress ASCII art, and a gameplay that does not infuse excitement or challenge with a dash of poor attempt at comedy. Paradox have a lot to learn when it comes to making games!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is NOT worth any of your money. A Game of Dwarves is a base-builder where you end up leading a small pack of dwarves and have them extend their empire deeper into the caverns, yet as you dare do so you begin to uncover caverns containing monsters and possible treasures. That is the only thing that makes you keep on playing until you realize how dreadful the game actually is. First, the game has no to little updates. You will find the game to be always the same bland pointless base-builder. Second, the game enertains you for a few hours until you simply realize you do the same thing over and over again throughout the entire game. Dig down. Discover Cavern. Kill monsters. Rinse and repeat until you discover every cavern in the entire game or slaughter every monster. Lastly, the game is simply not enertaining and does not give you that thrill every time you discover a cavern. You end up finding it actually boring upon discovering caverns as your dwarves just wave in and loot the place or kill the monster. There is no all powerful artifact or enchanted weapons in these caverns. Only gold or monsters along with some furinture! I reccomend buying another game that is worthy of your money.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a very good game",
            "review_score": "1"
        },
        {
            "review_text": "This game is so bad it isn't even funny.",
            "review_score": "-1"
        },
        {
            "review_text": "Amusing little time waster.   The 'carve out your kingdom' thing is fun - but the attacks five levels down can get complicated as your fighters wend their way up and down (or falll into a pit and starve without you noticing).  Actually, falling into pits and starving can be way to common if you get disturbed and 'forget' what you were doing . . .  A build without monsters option could be fun as well",
            "review_score": "1"
        },
        {
            "review_text": "fun and hard to stop playing",
            "review_score": "1"
        },
        {
            "review_text": "it aight I guess.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, like dwarf fortress, without the steep learning curve but lacks the complexity. Levels take acouple hours to complete. Well worth the $10 asking price.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Dungeon Keeper or Startopia, you'll love this game. It's a steal for the price and it's hours of fun! BUY!",
            "review_score": "1"
        },
        {
            "review_text": "Really good and fine game, there quite few bugs but game runs good. Simple nice game just for fun or just for pushing time.",
            "review_score": "1"
        },
        {
            "review_text": "You can lose yourself in this game forever to bad the music sometimes just randomly fades :'( ",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to play. Easy to get into when you just want to have a pint and build stuff.",
            "review_score": "1"
        },
        {
            "review_text": "When you play a game of dwarves, you win or you die.",
            "review_score": "1"
        },
        {
            "review_text": "Silly little game with a tutorial that makes learning game play very easy. The AI is sort of dumb however and can take a while for things to get done.  Glad I got it on sale. Wouldnt have wanted to pay full price for it but its a fun time killer for the casual player.  Relaxing. Doesnt require tons of thought.",
            "review_score": "1"
        },
        {
            "review_text": "I was able to have fun through the game design flaws maybe you can too.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game. I wish they'd continue the campaign. So much fun!!!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, everyime to make a new and epic settlement is good for passing time, After all its very enjoyable :)",
            "review_score": "1"
        },
        {
            "review_text": "Gnomoria + Autism = A Game of Dwarves",
            "review_score": "-1"
        },
        {
            "review_text": "Wants to be Dungeon Keeper... isn't.",
            "review_score": "-1"
        },
        {
            "review_text": "We may never see dungeon keeper 3 thanks to EA, but if you love DK series, this is one of those games you should play.  The game is simply and fun to play, just like DK; except this time you get to play with dwarves.   Sorry lad, no mistress this time!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, it have some pretty big bugs though. But it's a wonderful game, you do have to like decorating though XD",
            "review_score": "1"
        },
        {
            "review_text": "Honestly one of the best dungeon keeper type games I've played in a while. The art style is charming and the gameplay is simple to learn.",
            "review_score": "1"
        }
    ]
}