{
    "app_id": 200390,
    "name": "Oil Rush",
    "release_date": "2012-01-25",
    "developer": [
        "Unigine Corp."
    ],
    "publisher": [
        "Unigine Corp."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "RTS"
    ],
    "achievements": 40,
    "positive_ratings": 173,
    "negative_ratings": 170,
    "price": 5.59,
    "description": "Oil Rush is a naval strategy game that takes place in a world where nuclear war has melted the ice caps, changing the face of the planet forever. Oil Rush offers unique gameplay, avoiding micromanagement of every single unit, while still providing full control over all important aspects of strategy and economy.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/200390/header.jpg?t=1447355261",
    "minimum_requirements": "OS: XP                 Processor: 2 GHz                 Memory: 1 GB RAM                 Graphics: NVIDIA 9600 256 MB or Intel HD 4000                 Hard Drive: 3 GB HD space",
    "recommended_requirements": "OS: 7                 Processor: 2.5 GHz dual-core (Intel)                 Memory: 2 GB RAM                 Graphics: NVIDIA GTX 460 512 MB                 Hard Drive: 3 GB HD space                 Other Requirements: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "From the tutorial missions this seems like a pretty simple yet good RTS, but then you start the real missions and you find out that this game is terrible. For one thing it seems the only way to move units around is after they have reached their destination so if you send a unit on a long trip you will not have control of that unit until it is done moving. Secondly defensive lines mean nothing. If you try to set-up a defensive line the enemy AI will just roll right through it and start grabbing a territory behind your defensive line. Or better yet the enemies will just simply spawn at the very edge of the map way past your defensive lines and grab the last territory they would logically go after. The whole thing is just an absolute mess. This game gave me a headache and only deserves 1 speedboat out of 5.",
            "review_score": "-1"
        },
        {
            "review_text": "An odd hybrid between RTS and Tower Defense. Past the first missions the difficulty spikes aggressively. The voice acting and the script are ludicrous, specially when it comes to pop culture references and the character of Zhuang, some sort of derp Confucius. Its graphics are very impressive, the omnipresent water is a delight to look at. All things considered, Oil Rush can be an enjoyable, if sometimes infuriating, experience.",
            "review_score": "1"
        },
        {
            "review_text": "What a fun game! It's kind of like the C&amp;C genre mixed with mad max and waterworld.",
            "review_score": "1"
        },
        {
            "review_text": "On the surface this is a very simple RTS. Factories auto-produce units, there's not really any resource gathering (aside from capturing oil rigs), and you can only command your units to attack specific points rather than move freely about the map. Once you get into the thick of it, however, it's a fairly challenging game. You have to decide which points to leave units at to defend and which ones to leave basically defenseless (aside from fortifications) so that you can capture more points. In the later missions this becomes a nightmare but I enjoy the challenge. I still haven't finished it (I'm about two missions away from the end) but I've enjoyed the ride thus far. The voice acting and script is slightly terrible as it is all translation (I still don't understand why game dev's don't just hand their script over to a native English speaker to proofread before they record the voice actors) but as it only occurs before and after missions in most cases it doesn't really take away from the game.",
            "review_score": "1"
        },
        {
            "review_text": "It's the Waterworld of games... Both in a good and bad way.",
            "review_score": "-1"
        },
        {
            "review_text": "Very limited strategy game. Little tactical control, with the exception of timing being a better influence than anything else. If you have bad timing you will lose.",
            "review_score": "-1"
        },
        {
            "review_text": "'RTS' game where you right click and hope you win, 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice little anti-oil-propaganda-laced RTS/tower defense game. Good deal on sale. But almost too short.",
            "review_score": "1"
        },
        {
            "review_text": "This game was not what I thought it would be. I thought it would be an innocent puzzler with pointy-clicky gameplay and no story to speak of. What it IS is an RTS with heavy economic and social overtones and a slight learning curve. It features simple, squad-based gameplay where capturing targets from enemy squads is the primary objective. Production facilities, which automatically turn out new units to whoever owns them, oil rigs, which produce precious oil (the currency of the world and also the resource used to build upgrades), and more leave a bit to be desired for complexity and customization, but it works relatively well for the style of game.  The controls are a bit stiff, and they don't offer key customization (though there are hot keys for several functions), so navigating menus and selecting skills is a bit tedious. The camera does not have user-memory, and frequently resets itself to the default panoramic view, which is visually nice, but strategically useless. Action-oriented gameplay is supplemented by optional POV cameras that allow you to really see what's going on, but there are several camera functions that the game boasts of that simply do not work at all. Visually, it isn't stunning, but all things considered, in-game looks quite good (with the exception of the CGI cutscenes, which are stiff and awkward- the audio doesn't match the video, the facial animation is elementary, and the lighting is bad).  The story is simple and straightforward, with a few foreseeable twists and developments that, while largely unimaginative, are still disturbing and well done. It follows the quest for oil at any cost, and things get pretty out of control. The General is willing to sacrifice the lives of countless soldiers, betrays his word, and gives no quarter in the pursuit of the precious resource. The voice acting is sub-par and the writing isn't phenomenal, but more than anything, it is disturbing to watch the events pan out in the name of petroleum. It makes me think about the world we live in, and how much things need to change.",
            "review_score": "1"
        },
        {
            "review_text": "I'll be honest, I really not a big of strategy games where it's basically a bunch of points where it automatically generate units and you click that and right click another point to attack. That kind of game I call the pin point strategy, and frankly I was hoping this could be interesting to play but I couldn't get into it. Maybe you'd probably have more luck than I do but I don't think I'll be returning to this",
            "review_score": "-1"
        },
        {
            "review_text": "Oh WOW is this game bad. The voice acting sucks, the gameplay is just a lazy and bare minimum RTS style game that has been done better in FLASH GAMES, and it is just so mastabratory and self-pleasing. Theres a hotkey that does nothing except give you a 'cinematic veiw'. Yeah.  Don't even bother with this one. It is not worth your time.",
            "review_score": "-1"
        },
        {
            "review_text": "good strategy game, I recomend",
            "review_score": "1"
        },
        {
            "review_text": "An interesting idea but it just didn’t come together well",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game. Ever. Unless you are an ios 'gamer' that plays games to look modern rather than to enjoy them. Because you cannot enjoy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "On launching a round, it immediately becomes obvious why this is being called an uninspired mobile game clone with pretty graphics. It's cell war, plain and simple. Fun, but not worth anything close to €10, unless you count the pretty pictures.",
            "review_score": "-1"
        },
        {
            "review_text": "This is essentially a fancy tech demo of an incredibly basic game. In fact, I'd go as far as to say this is just Galcon in fancy clothes.  While the graphics are certainly impressive, and it makes me wonder why more games don't use the Unigine engine, the gameplay is flat-out boring.   Anyone that knows me knows that I'm far from a big fan of strategy games. For that matter, if I'm going to play a strategy game, it has to have a little more meat to it than simply choosing whether to send 25%, 50%, or 100% of my troops to a certain waypoint.   You may enjoy it, and it's certainly a valiant effort for an indie game, but it's just not for me.  ps the 'tutorial' goes on entirely too long, and makes a point of being intentionally too rough at first, to try and teach you what not to do.  Pass.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really bad, didn't even get longer then the tutorial mission before it got boring... Wouldn't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is pretty good but becomes repetitive after a few levels. not so well balanced. good graphics",
            "review_score": "-1"
        },
        {
            "review_text": "Now, we're on a bit of a dry spell with real time strategy games, and I totally see why - it's a genre that requires refinement. I'm more than willing to give unrefined games a pass, because at times they are hidden gems with interesting mechanics (Submarine Titans come to mind) but this one is simply awful.   The only thing it has going for it is beautiful water physics. Otherwise there's barely any strategy involved, it's like Euphloria with less nodes. Euphloria gives a pass with its abstraction, but Oil Rush on the other hand is simply infuriating for every RTS game fan out there. 'Why can't I click on this boat and move it out of the fire? Why won't you let me micro my units, game?' Pass. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Just don`t buy it, poor design decisions and in trying to simplify an RTS made it become an horrible point-and-click game. DON`T BUY",
            "review_score": "-1"
        },
        {
            "review_text": "This game is racist and poorly voice acted. The gameplay is incredibly slow, the story is boring, and I'm incredibly sad that I paid a small, small portion of the humble bundle for this game. You're better off playing literally any other RTS game.",
            "review_score": "-1"
        },
        {
            "review_text": "Easy to understand with great game play. Purchased on sale and is definitely worth it to pick up. The story is a little corny, but not obnoxiously so.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing ♥♥♥♥ ♥♥♥♥ ♥♥♥♥♥ ass ♥♥♥♥ clit ♥♥♥♥ ♥♥♥♥ shit ♥♥♥♥ bob saget ♥♥♥♥ ♥♥♥♥ 5.5/10",
            "review_score": "1"
        }
    ]
}