{
    "app_id": 201210,
    "name": "Pox Nora",
    "release_date": "2014-10-15",
    "developer": [
        "Desert Owl Games LLC"
    ],
    "publisher": [
        "Desert Owl Games LLC"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Free to Play",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Strategy",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 384,
    "negative_ratings": 148,
    "price": 0.0,
    "description": "Delve into classic turn-based strategy gaming with elements of table top miniatures, fantasy RPG and TCG style gameplay all wrapped into one.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/201210/header.jpg?t=1502833176",
    "minimum_requirements": "OS: Windows 7, Windows 8, Windows 10 (64-bit) Processor: 2.4 GHz CPU or greater Memory: 1 GB of RAM Graphics: NVIDIA or ATI Video Card with 512 MB of video ram, with current video drivers Storage: 2 GB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is basicly chess on steroids. It has a learning curve that will break your neck and is played over a long run and there are many things to learn about it because it has a lot of tactical depth. But if you do stick around for all that, it is very rewarding in the end. Unfortunately we live in an age where people are used to instant gratification, and games are not perceived as food for brain anymore. Do I recommend it? Yes I do, but not to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game. A mix between Card collection and turn based stratigy. Unfortunatly it doesn't have a lot of players, but hopefully that will change.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. If you like to strategize as you would playing chess or with miniatures and like diversity of units, spells and items to use tactfully in order to gain the advantage against your opponent in a turn-based scenario -- then you definitely want to give this game a try. It's easy to learn yet isn't monotonous. Expect to see me playing it quite a lot!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game once you learn and figure things out. The best TCG out there, tons of awesome artwork and different options to build your deck, plus the satisfaction of seeing your runes (cards) in action on the battlefield. Nothing else like it that I've found. The negative reviews I have seen are just people that haven't tried the game for long enough to give it a real chance, or people that simply don't like the genre. Even those, if given time, would realize how exceptional this game is. Improvements have been made recently and will continue to be made in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Great mix of tradional trading card games and strategy gameplay! Recommend for all who likes turn based strategy games and don't like the luck factor to have significant impact on the results. I liked the idea of the game, having a choice between single player campaigns and PVP battles! Hope the project will be constantly progressing and we could get a new content!",
            "review_score": "1"
        },
        {
            "review_text": "Hardcore colectible game. It's a bit of a grind, but good community and as I said hardcore strategy ala MTG. Good game for people who apreciate that.",
            "review_score": "1"
        },
        {
            "review_text": "evryone who like tabletop games must play this. its a deep strategy game with lots of possibilitys and except the 1 new runeset u can grind all from the shop via playing",
            "review_score": "1"
        },
        {
            "review_text": "Love the gane, but it seems a little unflexible when just starting out. You don't get really any real amount of cards to build your first deck, which means you're basically forced to using the static free decks you get after doing the walkthroughs.  7/10, way better off than the P2W s**t it was before.",
            "review_score": "1"
        },
        {
            "review_text": "I played Pox aswell years ago and I was totally hooked by it and now aswell is just too good! There are a lot of contents, and the single player campaing is just infinite.  The only things that bother me are the fact that is not possible for a game to have the Rune Manager (deckbuilding) NOT IN THE CLIENT, it's just not right that I've to open an internet page to build my decks!",
            "review_score": "1"
        },
        {
            "review_text": "A great game to spend few hours daily. It is maybe complicated at first but with time you get to meet some interesting friends and enjoy playing a game against them.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty good. Also it's free, why aren't you getting this?",
            "review_score": "1"
        },
        {
            "review_text": "Pox Nora is a great game if you are interested in complex strategic, turn based game play paired with trading card game mechanics; allowing tremendous freedom both while building your battlegroup (pulling from thousands of unique units) and while playing.  Building your collection can be slow but is not too difficult, as playing against the AI rewards you with runes (cards) and gold to buy packs which provide a wider variety of runes. In addition, starter bgs (decks) are available either for free or for very small amounts of gold, and give you access to pre-built bgs with a pretty decent power level that you can use in any mode. Artwork on the cards is excellent, on par with great tcgs like mtg.  Once you hit the competitive ranked play, there is a serious spike in difficulty, as many players have been playing the game for years and will play at a very high level. However, if you enjoy the challenge, it provides the best and most interesting matches, and matches you up against an enormous amount of different strategies. Balance is functional although not perfect, and in a constant state of flux, as relatively regular patches rebalance units and modify the meta.  Finally, though not a pay to win game, the wider access to runes players can get by spending cash can sometimes make it feel like it is, especially if you aren't running a strong bg (deck). However, many, if not most, of the strongest runes are in the lower rarities, so if you're willing to test around you will be able to put together something quite powerful.  All in all, Pox Nora is a game for a specific kind of gamer, lacking impressive graphics or simplified gameplay, but more than making up for it in strategic depth, great gameplay, style and uniqueness. Try it out, and see what you think.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great it has many runes to collect. Play this this game if you like strategy games. I like the way, collecting cards and a table top like game are mixed together.",
            "review_score": "1"
        },
        {
            "review_text": "Saw this game on steam and was very excited. I had played this game years ago and stopped playing because school and a part time job got in the way. But not that I am out of school and have my nights free again I am happy to play again. It's a very in depth game with a ton of possibilities. Since it has been around for so long the ranked games are full of people with very powerful decks, but the casual room is a place where I have won a few games and only have been playing for about 2 weeks. The campaigns are highly recomended because you can use them to get extra gold and cards. Only downside to this game is it takes a while to get a deck that you like. So I recomend picking a faction after you try all 8 of them and trade away any card that isn't in the one you like to a website like PoxBox so that you can easily trade for the cards you do like. I'm playing a deck right now that I love and was able to get after the first 3 days by trading in 1 exotic rune for a ton of lower level ones.",
            "review_score": "1"
        },
        {
            "review_text": "The Best F2P game.",
            "review_score": "1"
        },
        {
            "review_text": "Best turn based strategy",
            "review_score": "1"
        },
        {
            "review_text": "I tried writing a review of this game before, but back then I didn't think I had given this game a fair shake. First off, this game is not a card game, its essentially a strategy board game similar to... well, I don't know of many that are still played in this day and age so I'll just go with classics such as Heroscape and Necromunda. (You don't even know what those are do you)  You play by assembling your battlegroup from runes (cards that essentially work as model figures) and supporting them with spells and equipment. As far as these types of games go, Pox Nora is deep, and has had years to develop its rune catalog. There are eight factions, of which a battlegroup can be composed of at most 2. Runes have rarity and differing efficiency values, but all are useful in some way or another. That being said, discovering this usefulness can be tricky as the game is not straightforward and figuring it all out is essentially trial and error. There is a tutorial, but it's terrible, and the steam interface could use some improvement.  Is the game P2W? No, not anymore. It used to be, which is when I first started writing this review some time ago when the gold income was paltry and winning battles didn't give out free runes (cards. You know what? I'm just going to call them cards) Now, its possible to get really good cards for free without ever having to play another player, which is a good thing because, quite frankly, I find the community could try a little harder to accomadate newer players. It will still take lots of games and lots of times to put together your own battlegroup, but the game has many free battlegroups you can play while collecting your set, and no, they don't suck.  The graphics are a bit dated, but if you don't mind that, then their's no reason to talk about it. If you do mind it, your either going to look past it, or not. Either way, they are what they are.  To sum up, if you like card games and board games, and don't mind dated graphics or figuring things out by yourself, give Pox Nora a shot. The game is improving with time now that its under a new developer, but it still has a long way to go to compete with powerhouses such as MTG or Hearthstone.",
            "review_score": "1"
        },
        {
            "review_text": "A strategy card combo with a dedicated community, which took a trip down the p2w slope under SOE but was reclaimed by the old devs and has been revamped'  Thats not really true, but it is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Get past the fact ur gonna have to spend some money to get at least a starter deck and some good cards, but it is a card game after all. I like the fact u can level up ur individual Champions and customize it how u want. Has a lot of potential and I can already see the sleepless nights...For being free, I can even look past the $50 or so dollars i will spend in the first year. Compared to other online games that have cost me $20 or $30 just for a mount, that's great. Once u have a good start u can then trade for better cards through the player market. I can run it on lower end systems and netbooks as well as being a fast download and install. I was playing in under 15 minutes. So quit reading my over-zealous review and go get it and see for urself!!!",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game that can occupy your time for a while. it keeps me busy for hours at a time. Just make sure you have enough time to finish what you start. some matches can take an hour or two.",
            "review_score": "1"
        },
        {
            "review_text": "Under the new developer's the game has went from a pay to win crapshoot to a unique TCG + Turn based strategy. I would reccommend everyone give this game a try. I think if it weren't for the poor buisness model used by sony in this games youth it would be very popular.",
            "review_score": "1"
        },
        {
            "review_text": "Iv played this game for years now and it's always been one iv fallen back into, such a great and addictive game, really unique and fantastic to spectate.",
            "review_score": "1"
        },
        {
            "review_text": "If you love strategy games youll love Pox Nora. Im really enjoying this game",
            "review_score": "1"
        },
        {
            "review_text": "If you love strategy games youll love Pox Nora. Im really enjoying this game",
            "review_score": "1"
        },
        {
            "review_text": "I actually played this way back in the day. One of the very few such titles I would ever say was decent. And it's free. My opinion today might be different (going to load it up and play tomorrow), but for now I'm going to recommend based upon nostalgia. My gods, though, has it ever changed (just from looking at some of the stuff on their website). Would be like finding out that people still play Fuedalism on Armorgames. Or CastleCat on 'Gate. Actually, it's a lot more like finding Warlords Battlecry 3, Fate, and Rogue Trooper, here, on Steam of all places. Until I get hit by the 'Out of memory error'. GG, guys, GG. (Will keep it at a yes, but hopefully the warning that there are errors with the client will prove helpful to others.)",
            "review_score": "1"
        },
        {
            "review_text": "I was so excited when I saw that Pox Nora had switched to a new owner! And then I found out that it was available on Steam! (I don't know if this is a new thing, or if PN has been on here a long time, but for me it was new.) I decided to give it a try, despite bad experiences previously, and I was overjoyed to see that the client had gotten major updates; it looks fantastic and is very easy to navigate. and Desert Owl includes various daily challenges to help people new to the game to catch up. There is also a set of activities that all new players must travel before they can jump into an actual multiplayer competition, each of which also adds to the player's bank and allows them to score new 'runes' (cards.) There is a microtransaction mechanic in which a player can buy rune packs (thus the bank of game coins that I mentioned,) but players can also join a 'training' match, in which players have balanced starter decks and only player skill counts.  The gameplay was just as fun as I remembered, too. Essentially, each player generates 'nora' (mana) automatically each turn, and they can then play runes from their hand onto the board. Some runes are characters, others are equipment that is played directly onto said characters, and some are spells that have instant effects on the boardstate. The board also has nodes, locations that can be captured by characters that move into their sphere of influence. Nodes give extra nora each turn and act as secondary (or sometimes primary) summoning locations for the characters. Ultimately, each player is trying to destroy their opponent's primary summoning point, a shrine, and receive a revamped animation as the building is destroyed by magical explosions or stone spires that stab upward through the ground, or...  But.  As the Curators' recommendation explains, this game 'took a trip down the p2w slope under SOE.' I was there, and I saw this happen. I played, and I payed. I have a collection of runes from that time, but when I began playing, I quickly found that, 1.) nobody plays the skill-only training matches, and 2.) everybody's decks are still broken at the bottom of the p2w slope. I thought I might just have been a poor strategist until I hung out in the chat forum and read people's posts; nope, I still believe that I am a poor strategist, but this does not account for the entirety of the current metagame. Pox Nora involves runes of various rarities, from common to rare. Wait, no, then there is Exotic. Oh, also legendary. You get the idea. Further, according to the players talking in the forum, two of whom were in the top 5 players in the current iteration of the game, a player must have no fewer than 5 exotics to be competitive.  The curators claim that the game was 'reclaimed by the old devs and revamped.' I believe this is true, but the p2w slope is slippery, and the game has not recovered. It is still crouched at the bottom of the p2w slope, and if you want to be competitive, you will have to descend to its level to do so.",
            "review_score": "-1"
        },
        {
            "review_text": "You need to register another account.",
            "review_score": "-1"
        },
        {
            "review_text": "Too Buggy to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Bugs, bugs, bugs... The game seemed to have few bugs when it was made by Sony when I first ran it on Steam several years ago. Now parts of it still don't work, work intermittently, or with random lags. The Rune Manager link doesn't show for a while - I still don't know why it suddently appeared after I played for several days. You don't get any public runes after Beginner campaigns even though the game says you get them. Various interface bugs. I only wonder what the developers are thinking/doing??? Same bugs as two-three years ago. At least, the game launches reliably now.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely NOT what i'm looking for in a game. I can forgive poor graphics for amazing game play but not graphics that are from 1988. I love me some RPG games, CCGs, etc, but i uninstalled this after the first tutorial. Not fun. Not pretty. Not addicting.....and judging by a lot of reviews, apparently this will lead to a pay-to-win model anyways. I'm out.",
            "review_score": "-1"
        }
    ]
}