{
    "app_id": 201290,
    "name": "Sins of a Solar Empire: Trinity®",
    "release_date": "2011-11-16",
    "developer": [
        "Ironclad Games",
        "Stardock Entertainment"
    ],
    "publisher": [
        "Stardock Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Local Multi-Player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Space",
        "4X"
    ],
    "achievements": 0,
    "positive_ratings": 428,
    "negative_ratings": 149,
    "price": 15.49,
    "description": "In Sins of a Solar Empire: Trinity, you are the leader of a civilization embroiled in a galactic war, fighting for the survival of your entire race against relentless foes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/201290/header.jpg?t=1532974911",
    "minimum_requirements": "OS:Windows 10 / 8.1 / 7 / Vista SP2 / XP SP3 Processor:Intel Pentium 4 1.8 GHz or Equivalent Memory:512 MB RAM Graphics:128 MB DirectX 9.0c Compatible Video Card w/Pixel Shader 2.0 Support DirectX®:dx90c Hard Drive:4 GB HD space Sound:DirectX 9.0c Compatible Sound Card Other Requirements:Broadband Internet connection, also to activate this game you must create a Stardock account while launching the game on Steam.",
    "recommended_requirements": "OS:Windows 10 / 8.1 / 7 / Vista SP2 / XP SP3 Processor:Dual-Core Processor Memory:1 GB RAM Graphics:256 MB DirectX 9.0c Compatible Video Card w/Pixel Shader 2.0 Support DirectX®:dx90c Hard Drive:4 GB HD space Sound:DirectX 9.0c Compatible Sound Card Other Requirements:Broadband Internet connection",
    "reviews": [
        {
            "review_text": "I'll break down Trinity like this.  Sins (original) is an incredible game worth 60 dollars easily.  The 'Entrenchment' expansion adds starbases which are cool and pretty big game changers as well as mines. Probably worth no more than 10 dollars.  The 'Diplomacy' DLC adds envoy and envoy bonuses which are very nice to have but difficult to obtain and pointless except in big matches. I would say that's worth no more than 5.   If you're here because of a steam sale. I'd say grab Trinity so you can enjoy the full content (Or even better Sins of the Solar Empire :Rebellion) but if you're really tight for cash and the DLC are looking pricy. Just grab the original.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RTS games around.  Excellent pacing, detail, and beautiful to behold.",
            "review_score": "1"
        },
        {
            "review_text": "Trinity is a good game but, as many others have said, I think Rebellion is a much better game. The only reason to get Trinity is if it is on sale for $5 or so as it was when I got it.",
            "review_score": "1"
        },
        {
            "review_text": "Get Sins of a Solar Empire Rebellion. It has everything Trinity does. You miss NOTHING by skipping this game and buying Rebellion.",
            "review_score": "1"
        },
        {
            "review_text": "I have only one small problem with this game. The code you need to make an account is the one steam gives you but it doesn't say that. So be careful buying this game. On the plus side this is one of the best RTS games I have played in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "An epic RTS game that utilises fast expansion mechanics that could give you a tactical weakness, unlike more simply games such as the command and conquer fanchise. There are multiple different types of ships to choose from, which nearly all of them have a direct opposite that they are designed to destroy, meaning you need to learn quickly or be destroyed. However, saying that, the auto AI on targetting is second to none, as it'll target its counterpart and work together with fleets of other ships to burn down individual targets also, without the player micromanaging it. This is important as you probably won't be having a linear fight in 1 planetary orbit, as you could be defending numerous worlds at the same time! This game has the finest parts from titles like haegemonia: legions of iron, in regards to upgrades and planetary combat and then star trek armarda style fights where fleet size means nothing against fleet composition.  An example of such epic gameplay is I entered a 1v1 with the AI on normal. The AI discovered pirates, bribed them with a bounty on my head and the pirates sent a massive fleet that took me right back to my capital world for a last ditch defence. I'd made a capital ship (massive, well armoured and armed!) and a handful of frigates and managed to beat the fleet back. That then resulted in rapid expansion, putting me in a better position than I started with. Its situations like that which you won't find with other games. Highly recommend buying this!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing Awesome. So much time spent (not on my account) playing, and not a single moment regretted!",
            "review_score": "1"
        },
        {
            "review_text": "Sins of a Solar Empire is a great game, takes a while to play, but is so emersive, tactical, replayable, loveable.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, if you like AOE II and Eve this is a good mix for you!",
            "review_score": "1"
        },
        {
            "review_text": "Best space strategy ever!",
            "review_score": "1"
        },
        {
            "review_text": "Approved. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Me play. Me like.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome for people who love space battles, strategy, and vast space empires. You can play as different cultures/races like, TEC, Advent, and the Vasari. Furthermore,you are able to play a vast array of different scenarios with other players online, or against AI. Either way, this game is an amazing experience.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Space RTS on the market. It is outstanding how you can go from inches away from your battleship to thousands of lightyears away. It however is best when you get this Trinity so it has all of the improvements and add-ons that make this game more than worthwhile. Prepare to burn a few hours....  8.0",
            "review_score": "1"
        },
        {
            "review_text": "Do you like RTS? ok this game is probably for you. Do you like Leveling Systems that are commonly found in RPGs? this game has something for you as well Very specifically did you like warcraft 3, but found yourself thinking this game would be way cooler if it was in space? this is the game you have been waiting for.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty solid and fun strategy game. The only downside to it when playing against computers is that the fleet capacity can leave you in a position where you already know you've got the game won, but you need to play out the remaining 5 hours of gameplay to get that fulfilling 'Victory Screen' moment.",
            "review_score": "1"
        },
        {
            "review_text": "An empire builder, in space.....Great.",
            "review_score": "1"
        },
        {
            "review_text": "One of the more original and fun RTS games in the past decade. They took the classic RTS formula and did great work fitting it in a huge space environment.  Colonize planets, build your fleet, attack and defend, on an inter-galactic scale.",
            "review_score": "1"
        },
        {
            "review_text": "I know there has been another expansion come out after this, but i have to admit this is a brillant and challenging Real-time space stratagy game and it is one of the best out there",
            "review_score": "1"
        },
        {
            "review_text": "lots of good fun and takes stategy. but gets old quickly but fun for a while",
            "review_score": "1"
        },
        {
            "review_text": "epic space battles, what more would one want?",
            "review_score": "1"
        },
        {
            "review_text": "If you like the Supreme Commander series you will love this",
            "review_score": "1"
        },
        {
            "review_text": "On a personal note, I wanted to like Trinity, I really did, but I just cant find anything about it that I love enough to continue playing the game. However there was nothing that I can say is inherent bad about the game.  Over all the game is solid, graphics are legible and detailed even by todays standards. The strategy is good and simple, build lots of ships, fight your enemy, pay off pirates to not attack you, or pay them to attack someone else. The only problem that I had was that even today, this game, which was released in like 2009, still throttled my 2011 Toshiba Qosmio to the point where the over heating failsafes kicked in and shut my laptop down. I had to elevate my laptop using a couple of small boxes and use a fan to blow air at the underside of it.  While I do recommend this game I do so out of the fact that it is a good game, just not one that I found enjoyable enough to want to ever play again.",
            "review_score": "1"
        },
        {
            "review_text": "Massive maps, smart scrolling for changing POVs, unique game mechanics and addicting gameplay. An underrated gem.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game. However, the lack of story made me lose interest pretty quickly. Seemed like a decent enough strategy game, but there was no narrative to get me hooked.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "really nice RTS syfy game. games dont take too long either. must have for RTS gamers :3",
            "review_score": "1"
        },
        {
            "review_text": "Its a wonderful game",
            "review_score": "1"
        },
        {
            "review_text": "5/5 ***** Probably one of my all time favorite games. This is arguable one of the best 4X strategy games ever made. It is a real time game with turn based elements. The pace is very slow and methodical, getting rushed can be easily dealt with or avoided altogether, lol its just not really that viable to rush. If you like space games, and you love the idea of commanding literally hundreds of ships in massive interstellar battles, then this is the game for you. Just a warning though, you will want a high end PC for this. The settings allow it to be toned down for better performance on mid level machines, but it runs and looks its best on a high end rig.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down, the best space RTS game EVER! PROS:  Story Graphics Engine  Cons: DRM from Stardock.",
            "review_score": "1"
        },
        {
            "review_text": "This game is outstanding not as good as the Sins of a solar Empire Rebellion game but still outstanding and well worth the buy but it doesn't match the expansion you could technically call it outstanding game and well worth the 20 euro it costed me when I got it. Would buy again but deffo have put mroe time into the SOSE Rebellion ",
            "review_score": "1"
        },
        {
            "review_text": "Wow. I didn't expect much from this game when I got it on recommendation from a friend. However, this game did for real time strategy what Descent did for first person shooters in my opinion. It is amazing what adding a third degree of freedom can do for almost any game.",
            "review_score": "1"
        },
        {
            "review_text": "good game if you take the time to get into it",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game for a few years now, and I definitely recommend it to anyone who enjoys strategy games. I love games that take place in outer space, and this game certainly does not disappoint. Despite the game looking spectacular, the system requirements are fairly low, meaning that you don't have to have a beast of a computer to run it. There are three playable factions, each catered to a specific play style. Each faction has variations of several units, unique units, and different tech trees. The game has a lot of replay value due to the number of possible map combinations. There is a lot of exploration, economics, and diplomacy, in addition to the fleet vs fleet action. The game is more about macro-management, so you don't have to order each individual ship to do a particular task, and managing a large empire with multiple fleets is easy due to this approach. The downside to the game is the lack of a single-player campaign / story mode. You have to read up the lore on your own time if you want to learn who these three factions are or why they are fighting. Other than that, I recommend this game and give it a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game before and it was awsome until until i had to go through the stupid stardock crap",
            "review_score": "-1"
        },
        {
            "review_text": "Stardock kept my serial key with no way to find out which account its attached to :( Can't even re-buy the game to play it.",
            "review_score": "-1"
        },
        {
            "review_text": "The activation is such a pain in the a#s I had to give up. Do not buy this it is nothing but petty theft!",
            "review_score": "-1"
        },
        {
            "review_text": "I realize most people love this game. I don't like it at all. I'll preface my review by saying had I known what kind of game this was, I wouldn't have bought it. I was looking for a turn based game that was more complex than the game 'Deadlock' and less complex than 'Space Empires'. Google told me to try this game. Here are my problems with the game.  Everything costs too much money/resources. It seems you just spend hours and hours saving to be able to afford the most basic research. Almost every building requires research and once you finally get that research you'll find that you have no room for the building you need to build because every zone you conquer has a VERY small limit to how many buildings can be built in it. As well the bonuses the techs in the tech tree give are stupidly small for how much they cost. The tech tree is large but I how long I will have to for the resources to spend on research before I can get a ship that isn't complete garbage, apparently it's longer than 4 hours so I am not interested.  This game seems like it took the worst parts of Shogun 2, Age of Empires and Starcraft and threw them into a gigantic, boring, confusing game.   ",
            "review_score": "-1"
        },
        {
            "review_text": "This game ask for a serial number as so as you start it which steam doesn't give. I personally don't want to jump though hoops to get a game working. I already spent 35 min trying to get stardock to send me a serial number. Don't waste your time or money. ",
            "review_score": "-1"
        },
        {
            "review_text": "This is the most program i have seen yet. i own 2 copy and can't play due to the company's front end. what a waste of time and money",
            "review_score": "-1"
        },
        {
            "review_text": "Can't tell you about anything I liked because I have not been able to get the game to run. The CD key doesn't just have to be entered, apparently you need to have an account with the developer. And if you try to do it for an offline activation it will net send you the license it says it will, and after 7 attempts to activate the game from a specific IP address it won't allow you to activate at all from that IP address. Stardocks customer service has been one email saying to try it again, and Steams has been...Oh ya, no reply whatsoever. Both Steam and Stardocks have absolutly failed here and my advice would be to think twice about buying any game from Steam that requires this much effort to activate. Long story short, Stay Away from Sins!",
            "review_score": "-1"
        },
        {
            "review_text": "There are localizied version aviable but not inside STEAM.",
            "review_score": "-1"
        }
    ]
}