{
    "app_id": 201570,
    "name": "Really Big Sky",
    "release_date": "2012-02-24",
    "developer": [
        "Boss Baddie"
    ],
    "publisher": [
        "Ripstone"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Shoot 'Em Up"
    ],
    "achievements": 20,
    "positive_ratings": 1429,
    "negative_ratings": 462,
    "price": 3.99,
    "description": "A super fast, twin analogue shooter for the modern age!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/201570/header.jpg?t=1506940537",
    "minimum_requirements": "OS:Windows XP Processor:2ghz Core 2 Duo Memory:512 MB RAM Graphics:DirectX 9.0c or above DirectX®:9.0c Hard Drive:200 MB HD space Sound:DirectSound-compatible Sound Card  Additional:Controller support extends to official Xbox 360 controllers only.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a good take on the 'bullet hell' genre. Not as infuriating as most of the Japanese varients of 'bullet hell'. It's still frustrating enough to make you want to punch the screen, yet addicting and enjoyable enough to make you say 'just one more try...' about 83 times before you realize it's 0330, and you have to work the next day.  Great for playing in short spurts, as you can easily pick up for 10 minutes, die a few times, and then go about your business.",
            "review_score": "1"
        },
        {
            "review_text": "The game has a few interesting ideas for the bullet-hell/twin-stick shooter genre-hybrid, but it lacks focus and struggles to follow it's own rules resulting in a highly unsatisfying experience.  Here was my experience.  First thing that struck me was the obnoxiously flashy menu screen. I mean, the bloom rendered the menus unreadable! But perhaps it is my monitor that isn't perfectly calibrated that is causing the issue. I can try to look past that. So let me change the resolution so I can enjoy it in full-screen... wait a minute. Why is there an unsatisfying selection of screen resolutions? The game just reeks laziness now. If your monitor resolution isn't the top 4 most common resolutions, gg to full-screen experience.  I still decided to give the game a shot. I tried the tutorial, but it left me feeling very confused about many things. Why add in the drilling ability? The spinning ability? When would I use each one? What are you talking about 'hoops in the nebula'? Perhaps if I play a few levels I will come to understand... Nope. After playing a few levels, I didn't even understand how I died most of the time nor understand what I should have done to stay alive. Maybe the fun is in figuring all this out? But first I got to use my points to level up.  What should I level up? What does each of these do? The description doesn't clarify most of the time nor can I see how the leveling affects my ship. The leveling process is so unsatisfying, I don't even care what I level up as I often feel no sense of progress. Also, why are there two play/back commands in the level up menu? Such lazy menu design.  After playing and dying so many times, I decide to refer to the library archive in hopes of reading up on the enemies I faced. 'Know thy enemy' right? Well, it would make a lot more sense if they actually placed images of the enemies so I know what they are talking about instead of focusing on trying to be funny. For the record, their attempt at humor was so invasive, there was nothing funny about it.  I keep playing hoping I get over that hump to where I can start to have fun, but the more I play, the more I realize how rotten the game is. Due to randomly generated levels, each playthrough is unique, but it's also not satisfying because the difficulty feels very artificial and removes the feeling of progress. Also, by adding shields that absorb damage in a bullet-hell game, it removes the threat bullets have at all. I'll bet it was introduced because when things get too intense, all the flashy effects makes it impossible to tell what the hell is going on. So rather than toning down the effects, they removed the core of what made bullet-hell bullet-hell. It doesn't stop there though. What makes difficult games fun? Because the game lays out rules, and defeats you while following those rules. And the simpler the rules, the better. As such, when you die, you know exactly why you died and that reason was you. The game didn't cheap-shot you. Due to all the elements added to a supposedly simple genre, many times it's not clear why you died, and it breaks it's rules quite often, removing any fun from the challenge.  So in conclusion, the game ebbs feebly with nice ideas and flashy effects, but the game lacks much needed focus for the experience to be satisfying. Avoid this game if you can.",
            "review_score": "-1"
        },
        {
            "review_text": "The first time I played this, I heard a voice in the game saying 'You ♥♥♥' after defeating a boss.  I giggled. The next thing I saw was the game over screen.  11/10.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very good arcade game with lots and lots of modes.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fastest game I have ever played, I couldn't keep up! Get this game.",
            "review_score": "1"
        },
        {
            "review_text": "I've had a lot of problems with this game. Now I know why they were giving it away for free. First off, the game starts out in a dinky window. If you switch to 1080p resolution it's STILL in a window. If you switch to fullscreen it starts off looking OK, and then winds up like the screen is zoomed in too far and you can only see about 80% of the game (which takes up 100% of the screen).  OK, so you think you should quit and start over. CRASH. Really Big Sky has stopped working. Press this button to do nothing or press this other button to wait 30 seconds and THEN do nothing. Start the game over... nope it's still zoomed in way too far. There is just no resolution option that feels good so after a lot of fidgeting you switch back to the original windowed mode.  OK then, so let's try to actually play the game. It gives some really hokey tutorial about how you can use one stick to move and the other stick to shoot (or alternately explains WASD and mouse) while being narrated in this really bland voice that barely stands out amongst the game's bland soundtrack. The graphics themselves have a muted tone to them as well so it's like the whole game is trying really hard to be the visual equivalent of oatmeal or rice cakes.   I started this up thinking it would be another good shooter like Syder Arcade, but instead it came out like a really poor imitation of the genre. Maybe I'll change my mind after more than 10 minutes with it but at the moment the game has ♥♥♥♥♥♥ me off so much that 10 minutes was more than enough.  EDIT: Ok, so I have given it another run and... I still don't really recommend it.   For starters, the menu is actually kinda confusing. There's a set of options that looks like you should be able to press a button to toggle it from one selection to the other, but any button you press will exit the menu. Instead there's an arrow pointing in a direction and you have to press the analog stick in that direction to get it to change. For some reason I expected it to be the opposite (that the arrow showed the current condition and pressing in the opposite direction would change it).  The game has this annoying game mechanic where you have to Drill through 'planets' at random points in the game. You accomplish this by pressing a button that brings the drill around to the front of the ship and while it's there you can't fire.   It seems like the only thing the drill is good for is certain planet sized stuff, so you can't drill through an enemy (unless it's taking up the whole screen), and in general the game has poor conveyance of what is something to be shot and what is something to be collected. I wound up dying a few times because I thought it was a powerup to pick up and instead I collided with an enemy or something in the background.  The announcer is apparently going for the 'I'm talking to you from a distance over a radio' type voice effects, but that actually made it quite hard to understand. Combine that with the fact that he's British and sometimes I hear something that sounds like (to my American ears) 'Cor Blimey, crikey he's gone off his nutter, knees up mother brown. Off with his head, and mind your ♥♥♥♥♥♥♥♥ for that barmy ♥♥♥♥♥♥♥♥ Mate! Oy!' And that's if I understand anything he said at all.  The backgrounds in the game are nice to look at, but it's all quite distracting and it's hard to tell which are the important game elements and what is just scenery. I died a couple of times to stuff I thought I should have been able to fly by.  The music is all technoish and the flashing lights are reminiscent of a rave, but it still seems very muted somehow. So far nothing has made me feel psyched up to take on the enemy.   I don't know yet if there's a way to get the game to look good in full screen. I didn't want to risk it crashing on me again so I made sure to play it windowed.   The game's only saving graces from what I can see are the unlockable game modes and the fact that you can use your points scored in the last game to buy stats for your ship. At least this way you don't feel like your time was completely wasted and that you're somehow making progress.   That doesn't sound like enough to keep me interested in this game long term though. It's good for a 10-15 minute game here and there.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like 2D shooters this is a great game. It takes a little bit of getting into but if you are a SHUMP fan this is one of the best on steam. Its a dual stick horizontal shooter with semi randomly generated levels with a lot of diffent modes to keep you occupied. Its slightly annoying from the classical horizontal shooter viewpoint in that you can't memorize the levels but you can memorize the patterns of events. The scoring is also slightly randomized but really, if you just want to have some fun exploding things and dying very quickly, this is excellent.",
            "review_score": "1"
        },
        {
            "review_text": "Yuck. A shmup where trial-and-error is necessary to figure out what can kill you is a recipe for disaster, and that's exactly what Really Big Sky is. I can't recommend this game one bit.  On top of that, it doesn't support 1920x1080 and doesn't seem to scale up its 1280x720 native resolution properly, meaning you'll have to manually change your desktop resolution if you want it to fill your screen. If you actually want to play this piece of trash, for some reason.",
            "review_score": "-1"
        },
        {
            "review_text": "Really Big Sky is a side-scrolling space shooter/bullet hell game where you go through procedurally-generated levels, blasting enemies and upgrading your ship for the next time you play.  It seems like this game has a lot of strategic depth to it, but I'm having a hard time telling for sure because the game doesn't tell you anything. The tutorial is fine for getting the basic controls, but the game is terrible at describing anything else. I have little idea what most of the upgrades actually do, so I can't really make informed decisions. It's cool to blast stuff and all, but I feel like 90% of the game is going over my head, and the game itself is just fine with that.  The game, at least, is very pretty, and the music is nice to listen to. The narrator's somewhat entertaining. The controls really suck at first, and I had to do a lot of customization in the options before they were even passable.  Overall, this game seems like it has decent gameplay, but it's completely ruined by the poor execution of the rest of the game. I wouldn't recommend Really Big Sky to anyone but the most enthusiastic of bullet hell game fans.",
            "review_score": "-1"
        },
        {
            "review_text": "The classical arcade shooter with the ability to upgrade the ship. Back to the 80's. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the perfect game for those who do drugs or those who want to do drugs. Really fun, crazy at times.",
            "review_score": "1"
        },
        {
            "review_text": "♥",
            "review_score": "1"
        },
        {
            "review_text": "Don't know whats happening or what's going on but its awesome.  Don't Play this game if you are prone to seizures/epilepsy.  Really Big sky is a side scrolling Shoot em up game where you play as a tiny ship fighting Bosses and other baddies. This game has beautiful light visuals and addicting gamplay, This game does not require alot ofskill to play just shoot everything you see and dodge some projectiles the enemy is firing at you.  Overall rating: 9/10   Pros: -Very colorful -PEW PEW PEW PEW -MORE PEWPEWPEWPEWPEW -Simple -Amazing light shows -Good music (more enjoyable if you can set your own music, but damn wouldn't that be Beat Hazard?) -Lots of modes and Challanges to complete -Fun to play  Cons: -Sometimes you can't really see the screen because theres too much PEW PEW PEW and exploding enemies -The more you upgrade your ship = The longer you go = More killing baddies = More Neon ♥♥♥♥ in the screen = Cant see -The Narrator is sometimes annoying -Co-op maybe?  ",
            "review_score": "1"
        },
        {
            "review_text": "♥",
            "review_score": "1"
        },
        {
            "review_text": "kind of addicting",
            "review_score": "1"
        },
        {
            "review_text": "This game is AWESOME! I love it, love it love it. It is crazy , thons of bosses and places to find during your 2D experience, many strategies and gamemodes! This game really is a very good place to kill your time! Anytime I am nervous / sad I just come by to this game and relax in a sea of pixels. Love the effects, graphics, everything about this game is very nice. 9.5 / 10 ! Would play again ! Worthe it !",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game. Imo, it has high potential, but it lacks a decent tutorial, idk maybe the developers wanted to do it like that, so you have to 'explore' and 'experiment' a bit, how to kill that guy and stuff. People that like Arcade games will definitely like this one aswell. It's not a game I would recommend to anyone, since you don't NEED this in your library, but you WANT it. Another good thing about it is that you can easily open it while waiting for friends/sex and close it when you need to. This game has very good feedback (and it indeed is!) but as i said, it lacks a tutorial, but you can find out most of the things in the first few hours or so, based on how well you use that what you got in the game. ;)",
            "review_score": "1"
        },
        {
            "review_text": "I got this game when it was offered for free and have no regrets.  If you like bullet hell, shoot-em-up style gameplay, then you will really enjoy this game.  The aesthetics are wonderful, it reminds me a lot of geometry wars with all the crazy special effects. There is a lot of color and it can be overwhelming at times - the high activity on the screen can make it difficult to track where you are, enemy projectices, etc. The music is very good and adds to the intensity of the gameplay.   The controls are very simple, and the learning curve is minimal. There is a tutorial in the beginning of the game that is quick and very helpful. I find the narrator to be a bit annoying, but it is possible to turn the narration off.   Grinding in this game is actually quite easy because you can get a lot of credits very quickly with each game session (thanks to the score multipliers). The upgrading is simple, and they are mostly offensive-based.   There is a unique mechanic in this game where you will periodically encounter planets/asteroids. To pass them, you have to switch your weapon to your drill, allowing you to travel through to the other side. Inside the planets, there will be random bonuses like increased weapon spread, ship speed, score multiplier, etc - drilling through these will give you the bonuses. While your drill is active, your weapons will also charge, allowing you to shoot massive beams when you switch back to them.   As the game progresses, there will be times where your super boost activates, propelling you forward at a blinding speed. This is easily one of the most dangerous parts, because it is very easy to crash straight into an enemy projectile, or worse, any enemy ship.  The boss battles are not too difficult, but the game remains challenging, especially when the screen is filled with weapon effects.  Very fun game, pick it up if you like shoot-em-ups.  Recommend!",
            "review_score": "1"
        },
        {
            "review_text": "this game is very good.except that when the game is quit the app stops responding causing a windows error..    Update this game please.patch it atleast in the next one!",
            "review_score": "1"
        },
        {
            "review_text": "-Worth Playing- -I bought it in a Steambundle!-",
            "review_score": "1"
        },
        {
            "review_text": "Lasers, a drill and a narrator that probably needs to be shot - Really Big Sky brings back the intensity of side-scrolling shooters, but now with 50% more added fun. With over 10 gamemodes to play through, from the pointless Peaceful? gamemode to the ridiculous Hell gamemode, this game has infinite replayability value. Also of note is the fantastic upgrade system present in the Classic Mode, allowing a player to really soup up their ride.  +9001 respect, Ripstone &amp; Boss Baddie.  Currently in the Humble Weekly Sale!",
            "review_score": "1"
        },
        {
            "review_text": "This is a game alright.",
            "review_score": "1"
        },
        {
            "review_text": "YOU DIE REAL FAST.",
            "review_score": "1"
        },
        {
            "review_text": "What a horrible and buggy affair this game is. I have a state of the art rig and can't even get past entering my name. It locks up each and every time. The menus in the options screen are horrible and setting the different resolutions in the game is a lesson in futility. Avoid this one like the plague.",
            "review_score": "-1"
        },
        {
            "review_text": "Really Big Sky is one of those games you will never master. It has one of those unforgiving random event generators I swear is made by people who love the sounds of other people crying in frustration. Despite saying that, however, its one of those games where you never really get down to a point of 'Throwing my keyboard from the third floor of the apartment complex' frustration. It always leaves you wanting to play more each time you die, which will happen....alot.   So be prepared for a rail shooter space game where alien ships, asteriods, quantum fluxs, bosses, and planets (yes planets) will do everything in their power to kill you.  ....Alot.",
            "review_score": "1"
        },
        {
            "review_text": "Nice retro arcade game with beautiful visuals. Atmospheric.  Things that let this game down:  The game crashes when I try to make it fullscreen + One other game crash within 10 minutes of playing.  The beautiful visuals can make it hard to see what is going on. No proper tutorial or explanations. In the beginning you are running blind and doing things via trial and error Takes too long to retry/restart a stage.  Overall a thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "Big bright colorful mess. No proper support for 1080p. Gameplay is random, trial and error (mostly error) and more frustrating than fun. ",
            "review_score": "-1"
        },
        {
            "review_text": "wtf game wtf your in ♥♥♥♥ing space not in the sky really big sky my ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "This is an interesting game from a certain point of view. I enjoyed playing it, does have a special graphic and game mechanics, the overall sound is okay. Keeps you entertained and wishing for more.",
            "review_score": "1"
        },
        {
            "review_text": "The fun kind of tedious.   Visually striking and color complemented by the perfect soundtrack for this sort of game.   There is sizing issues when trying to display the game in 1080p and never achieves proper sizing.   'Cowabunga sir.'",
            "review_score": "1"
        },
        {
            "review_text": "Most idiotic game i ever played i cant even use the drill.....",
            "review_score": "-1"
        },
        {
            "review_text": "I was not impressed. You have 1million things on screen and you just move around because you have 1 gun and it just auto fires. If you get hit once my one of those million things its game over and you just start again. This is no story or real sense of progression. The game is basically continually replaying the same level over again after having upgraded your ship. with things that aren't well explained and don't make a lot of sense. I had no idea what most of the upgrades did and some said 'co-op' next to them for some unexplained reason. The game is not well optimized for PC. It starts windowed and trying to make it fullscreen doesn't work. Your keyboard and mouse to navigate menus is annoying and unintuitive. Good music though. 4.5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Woah man this game like changed my life you know? It's awesome and really brings me back to nature. I recommend getting high before playing it though - that way it makes some sense y'all",
            "review_score": "1"
        },
        {
            "review_text": "One of those games that gets blessed by the holy -86% discount hand of gaben (correct me if im wrong, forgot). Trading cards you get from this game actually cost more than the game itself, so when you sell it on the market, the game earns you money instead.  As a side note, those friends who own this game are usually cheapskate profit masters like myself.  Pros: &gt;Gives you three trading cards ($0.36 in my currency) &gt;Very cheap ($0.20 in my currency) &gt;profitable ($0.07 after taxes) &gt;cards can be easily obtained by IdleMaster (don't worry, you will not get banned) &gt;makes you look like a hardcore game collector so you get nice badges and look cool. Cons: I actually don't know, never played the game.",
            "review_score": "1"
        },
        {
            "review_text": "Beat hazard is far more better than this.... I have no idea at all how to beat the boss ship in this game i will recommend this only if i know how to play, ha!",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best bullet hells I have seen. And it has different game modes which makes it even more epic! Plus it looks amazing with even the lowest grapics.",
            "review_score": "1"
        },
        {
            "review_text": "i got it free it nice",
            "review_score": "1"
        },
        {
            "review_text": "Such great, much flash, very upgrade",
            "review_score": "1"
        },
        {
            "review_text": "the controls dont feel solid and the narrators accent is ear bleeding",
            "review_score": "-1"
        },
        {
            "review_text": "A gift from a friend, one of many. But of those gifts this is one of my definate favorites nice and fastpaced, without any overly crazy obsticles to worry about. overall just a joy to play.",
            "review_score": "1"
        },
        {
            "review_text": "It's full of colors and shinies and upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "Pure addiction, not too hard, but at the same time, still enough of a challenge to keep you coming back for more",
            "review_score": "1"
        },
        {
            "review_text": "Its a Good Game FOr kids :^^: :D:",
            "review_score": "1"
        },
        {
            "review_text": "Game is really fun and entertaining. I enjoy casually playing whenever I'm done raging and getting salty at League.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Got epilepsy attack from this game  10/10 would stare at shiny colors again",
            "review_score": "1"
        },
        {
            "review_text": "Shiieet dude kinda awesome graphic u got there!",
            "review_score": "1"
        },
        {
            "review_text": "this is still ♥♥♥♥ but now i know how to into planets but boss's are still ♥♥♥♥ed up",
            "review_score": "-1"
        },
        {
            "review_text": "Massive replayability, delicious art design, fast-paced frenetic twin-stick gameplay, glorious techno soundtrack and an enlightening cheeky Kent-originating narrator fight with the game's massive flaws (is it so hard to ask for fullscreen 1080p and xinput support that doesn't go off to the top?) and the lack of a pause button. RBS is fun yet all too flawed.  Still, 'Who at all the pie-manufacturing planets?' has to be heard to be believed.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastically trippy graphics and a thumping soundtrack make for a relaxing, easy-to-consume side-scrolling shooter.  Can stutter a little on weaker systems, so make sure your graphics settings are right- one wrong move and you're dead, so it's nice to not be blaming sucking at a game on overtaxing your machine.",
            "review_score": "1"
        },
        {
            "review_text": "Don.t buy",
            "review_score": "-1"
        },
        {
            "review_text": "THIS / GREAT LIGHTS AND BEST THING IT HAS TRANCE MUSIC MASSIVE GAME",
            "review_score": "1"
        },
        {
            "review_text": "When i open it,THE BLACK SCREEN shown up.",
            "review_score": "-1"
        },
        {
            "review_text": "I think I wanted to complain how I don't like this but could not because it wasn't released yet. If it's the game I think of, it's surely plenty unjolly. Too lazy to double-czech.",
            "review_score": "1"
        },
        {
            "review_text": "It's cheap, fun, has good music and graphics, and has a british man making snarky comments while you play. What more do you want?",
            "review_score": "1"
        },
        {
            "review_text": "An excelent game, the graphics are just beautiful, and the BGM is very good making the game even more enjoyable. I totally recomend, good to pass some free time when you just want to enjoy a simple game without have to face long hours of playgame like other games.",
            "review_score": "1"
        },
        {
            "review_text": "  DISCLAIMER: This is a first impressions review, and NOT a full review, if you want a full review, then please read better reviews then mine",
            "review_score": "1"
        },
        {
            "review_text": "Great music, great gameplay, can't stop playing it. The game is extremely challenging at first, and then it gets easier as you bump stats, but then it gets harder again. Some bosses can be easy to kill but you gotta remember to press 'A' to jump over what's leftover or else you'll die, lol. The sidekick voice is a crackup sometimes, and the music is very befitting to the game.  The best part of this game is that it is very rewarding. Keep on playing and keep on getting better and you will be handsomely rewarded with unlocks, perks, and a pandoras box of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Never really played the game much. It's not that I don't like it... but it won't go full screen at a reasonable resolution. I think that's just a developer fail. 1280x720 is the maximum resolution it will go if in full screen mode. It will hit 1920x1080, but in windowed mode, even then it won't align to the screen properly. Sorry... if I can't flip through the settings and set up a game for how I want to play it on my screen, then i'm not going to play it... sorry. Shouldn't have wasted money on this. Now it just sits in my inventory making me wish they hadn't failed so hard on such a basic and required technical aspect of any game. Furthermore, they locked in the fps at max of 60... this game would look and PLAY better with an uncapped frame rate. PC gamers historically buy GOOD MONTIORS so they dont' have to deal with that 60fps or less crap. (note: alt+space &gt; M then use the arrow keys to get the window to sit where you want it... but then windows FORCES the title bar to be onscreen)",
            "review_score": "-1"
        },
        {
            "review_text": "Sorry, but this game is ♥♥♥♥. The tutorial explains nothing, really. I got tired of dying for no reason at all, and I unisntalled.",
            "review_score": "-1"
        },
        {
            "review_text": "Da...yummmmm those beats. It's so AWESOMEEEY",
            "review_score": "1"
        },
        {
            "review_text": "Okay this game. Just. Amazing. It's one of those simple bullet hell games, but it's just got that extra charm that has you coming back for more. Each time you die, it's your own fault. Learning the enemy patterns is a must.  9/10 One point missing cause it didn't blow me.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect arcade. Lots of special effects + nice soundtrack. Funny commentator events. Pretty good game where you can spend many hours.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting shooter. You may wanna at least have a look at if you like shooters.",
            "review_score": "1"
        },
        {
            "review_text": "A 2-D game that makes me feel so high that it lags my computer 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome an addictive yet challenging really like it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so COLORFUL! Color and particles flying around a tons of enemies and pure awesomeness! If you have an xbox 360 controller you can play this game with it!",
            "review_score": "1"
        },
        {
            "review_text": "Very colorful, very bright, has an incredible soundtrack. Also with good gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "really really big sky in this game",
            "review_score": "1"
        },
        {
            "review_text": "After getting a key from a giveaway, I looked up the game to see exactly what I had won, and I saw something I had ever seen before.  So, I downloaded it and played it. A few hours later and I'm here typing this review.  So far, I love the art direction and the variety of the game, as each time you play, you will encounter new things, which is one of the elements I love the most besides killing everything you see. After a game, you could then upgrade your ships using points you have aquired during the game.  I am not sure if there is any backstory, but to be honest, I'm not sure it needs one. This is a fantastic shooter with variety, color, replay value, and plenty of humor. I highly recommend it.  The only complaint I have is that this game should support some more resoloutions such as 1366x768, or maybe I'm doing something wrong..  Overall: I'd recommend anyone to buy this.",
            "review_score": "1"
        },
        {
            "review_text": "3 words... Dont buy this....",
            "review_score": "-1"
        },
        {
            "review_text": "Takes classic arcade games to a whole new level for me. Love the giant atmosphere feel this game gives!",
            "review_score": "1"
        },
        {
            "review_text": "If you want to relax and destroy the galaxy Play this game",
            "review_score": "1"
        },
        {
            "review_text": "Personal Rating: 7/10  I like Twin Stick Shooters. Games like Geometry Wars and such. I'm going to cut to the chase, this is a good game. But there are a few things wrong. I'm just going to go through the good things very quickly. The graphics, music, voiceover are great. The controls are...okay. They do work, but it's a little odd to use and seems clunky. A tiny, tiny, TINY nitpick witht the game is that it doesn't have an exit button and for whatever reason that bothers me to a certain extent.  In summary, this game is visually enjoyable and a bunch of fun.",
            "review_score": "1"
        },
        {
            "review_text": "FRELL YEAH! Really Big Sky is another game I've been waiting to recommend. I pre-purchased Indie Royale's Really Big Bundle before the games were announced because of the obvious title hint. I have not regretted it. This is probably my game of 2011.  Are you interested in the shmup genre despite the pattern memorization it often requires? The procedural generation in RBS removes that problem. Do you like to earn upgrades? Do you prefer a level starting point to earn your score? RBS offers modes for both styles of play. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "A very fun and addicting twin stick shooter. I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This game has quite a steep learning curve, particularly since the tutorial doesn't go into any depth about the game. However, once you've progressed passed this and worked out how to pass planets, the game opens up and becomes a very enjoyable experience.  Lots of modes, ship upgrades and randomised levels keep things fresh and interesting, but you will have to play this game a considerable amount to get anything out of it.  One for the high score junkies and those who enjoy being abused by the Narrator (Why not?).",
            "review_score": "1"
        },
        {
            "review_text": "Really COLORFUL game, I don't really understand what I am playing though. Just shoot everything that can be shot at PEWPEWPEWPEWPEW",
            "review_score": "1"
        },
        {
            "review_text": "intense. fast. little ship gets mashed by big (everything else) things lots. upgrade ship, repeat. fun! fun! fun! must play one more level... just one more time... aaaaaah",
            "review_score": "1"
        },
        {
            "review_text": "Really Big Sky is a decent space shooter. It's got a great concept and amazing design, but in general it's overly flashy, at times there are too many light effects which make it quite hard to follow your ship, often resulting in death. All in all, it's an interesting game.",
            "review_score": "1"
        },
        {
            "review_text": "You just shoot everything you see!",
            "review_score": "1"
        },
        {
            "review_text": "I have no idea what is going on &gt;=/",
            "review_score": "1"
        },
        {
            "review_text": "Pretty simple game yet very fun. A colorful game with lots of expanding circle and lazor",
            "review_score": "1"
        },
        {
            "review_text": "lel u need beefie pc to play it maxed out :D lags on laptops",
            "review_score": "1"
        },
        {
            "review_text": "If you're ever flying through space and you're suddenly ambushed by bullet time and glowing neon T-Rex skulls, you're likely in this game. Or Walmart. But at least in this game you can shoot and faff about and not be penalized for it. 11/10 The narrator told me I did a good job, before promptly insulting me",
            "review_score": "1"
        },
        {
            "review_text": "Much sky, very big, really wow.",
            "review_score": "1"
        },
        {
            "review_text": "Fun as hell. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Has good music, catchy theme. It's extemely difficult though.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, interesting and has good music. The announcer can go suck a bag of ♥♥♥♥♥ though. Like most ship based games it pulls enemies and reasons to die out of it's ♥♥♥ and can be aggravating.",
            "review_score": "1"
        },
        {
            "review_text": "tbhis game is a ton of fun",
            "review_score": "1"
        },
        {
            "review_text": "really nice retro styled space shooter game. music and graphics are great. highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "I am vomiting rainbows",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AN EXCELLENT SPACE SHOOTER!!! Multiple Gamemodes, Awesome Soundtrack, Pretty Colours (EPILEPSY WARNING!), Fustrating But Fun Challenge, EVERYTHING YOU EVER WANTED IN A SPACE SHOOTER!! 10/10 WOULD PLAY!!!",
            "review_score": "1"
        },
        {
            "review_text": "Poor man's Geometry Wars but I like it",
            "review_score": "1"
        },
        {
            "review_text": "Nice concept but turn off the keyboard acceleration as you need accurate movement to survive really",
            "review_score": "1"
        },
        {
            "review_text": "This game has some issues. I haven't played much of the game, but these issues are clear and apparent within the first few minutes of gameplay.  The tutorial goes from peaceful control learning... To suddenly throwing you into the gameplay at a super-fast pace and you dying. That's okay... for some people. I'm one of those kinds of people, but not everyone is.  Secondly, the game's SUPA TECHNO LIGHTING screws with the gameplay. The effects hide an enemy somewhere and then you die.  By the way... The nice British narrator swears every time you die. He says t**, a**, and a number of other things. This is utter mindless garbage. Swearing is OK, but please make an option to NOT have it. Some menus even have curse words like d*** right on them (Peaceful mode says 'Throw in your god d*** towel.' Are you joking me? Nothing lets you know this game has that. Nothing. The game looks fine for kids, the tutorial is fine, then the game decides to showcase lots of cursing. The issue I have with this is that there is no 'noswear' option, no warning of this, and it is always constant and blatant. Goodness.  Back to the gameplay.  Everything in this game will kill you within a small number of hits. Lasers or ships alike, they will kill you. Instantly, on the lower levels. Once you start upgrading stuff, you will start making it to bosses... Maybe... And then you will die. Half of the 'enemies' on screen cannot be killed, half the objects cannot be destroyed. Most stuff you have to drill through. By the way... THE TUTORIAL MENTIONS NONE OF THIS. It gives you a short flying tutorial, and then just says 'screw you, MAJOR BLAM BLAM TIME.'  And yes. Half the enemies cannot be killed in a twin-stick SHOOTER. This game is more like a runner.  Other gripes. The game's HYPER TECHNO GRAPHICS strike again with performance. On lower cards, it will lag out for a few frames (usually resulting in massive damage / death). No health bar (sure, I'm one hit dead when I start, but could I get a shield bar?). No indication of certain enemies and what they do. Obsessively overintensive lighting that gets in the way (such lighting can be done without messing up the gameplay. Try Beat Hazard Ultra). Swearing is annoying as anything. Narrator repeats the same few lines (and I like his voice! They botched him up.) This game is not only difficult, but also punishing and annoying in almost every way. Game gives no indication or lesson on what will kill you, and with how obsessively good the AI is, you will never know.  So do I recommend this? If you're a child, no. Lots of swearing. If you're someone looking to cause carnage... No. The only carnage is your own. If you're someone who doesn't have the best gfx card. Nope, lag will kill you. If you're looking for a good experience of skill... Nope, this is just punishing. The list goes on.  If you are someone willing to put up with a game punishing you for buying it, with constant swearing at you and yelling at your incompetence (half of which is helped by the bad mechanics and lighting) and are willing to die over and over and over and over, with almost no reward... Maybe I could recommend it then.  Seriously... Developers, there are good and fun experiences that are fast-paced. Yours is too fast, and not willing to slow down and get a player pumped before the pain. And honestly, put in some indication that you don't give a darn about cussing, so some kid doesn't have 't**' and 'a**' running through their ears constantly, until they say it in front of their parents and then get their games taken away.  GFX: 7/10. Gameplay: 4/10 Story: *FAAAAAAART* Difficulty: About as difficult as cutting cheese, with a twig. Without the twig breaking, or you explode. And do it fast, or you explode.  I do not recommend this game.  EDIT: Also, I wanted to point something out. This game calls itself 'a twin-stick shooter for the modern day.' Does modern day mean swearing, lack of storyline, seizure-inducing graphics, lack of tutorials... If it does, then I am sorry, but this marks a bad future for gaming.",
            "review_score": "-1"
        },
        {
            "review_text": "A 2-D game that makes me feel so high that it lags my computer 11/10",
            "review_score": "1"
        },
        {
            "review_text": "lel u need beefie pc to play it maxed out :D lags on laptops",
            "review_score": "1"
        },
        {
            "review_text": "Impossible to start playing, black screen all time, no working solution, no 4:3 resolution support.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting shooter. You may wanna at least have a look at if you like shooters.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;PEW PEW PEW *dead* &gt;Tried again &gt;A giant spaceship shot stuff at me &gt;Died again &gt;************ 360/420 would die another time",
            "review_score": "1"
        },
        {
            "review_text": "The shoot 'em up has been seeing a resurgence lately in the land of indies. As technology has blossomed, so too has the love of flashy lights and cool explosions. Really Big Sky lives for the ridiculous and the flashy, with spinning psychedelic dinosaur heads and gorgeous 80's inspired everything to really keep the mesmerization of those watching all of that stuff explode in colorful, saturated bursts.  Whomever the art designer was, they must've really liked the most recent Star Trek films because my god is everything glare-y and saturated. Most of the time, it's gorgeous watching the chaos unfold on screen, but sometimes the overwhelming brightness of explosions or attacks and the sheer information overload can disorient and end an impressive run without even knowing what exactly killed you. It can be frustrating, but it's hard not to love a game so charmingly bombastic.   There is a lot of inspired ideas implemented into this little indie title, and more than enough to keep someone engaged to see everything it has to offer. Randomized encounters and an increasing difficulty, along with permanent upgrades and so forth adds further to the fun, even if it is fairly easy to max everything out quickly. The speed in which things are unlocked can be fairly cathartic, and wiping out swarms of T-Rex skulls is never not satisfying, but you will see just about everything before too long.  It's fun, it's wildly stupid, and it's fairly cheap and on sale often. Are there better games? Yes. Of course there are. But as a schmup, there are few so willing to embrace the insane, I can't help but love this one. Drilling planets at an insane speed is also one of the coolest things ever. Definitely looking forward to whatever else this studio releases.",
            "review_score": "1"
        },
        {
            "review_text": "I now have epilepsy because of this game.",
            "review_score": "-1"
        },
        {
            "review_text": "good one, worth $2 for sure. Atmosphere is a bit distracting and becomes really hard to see which is a bit frustrating. Music is good. Game breaks on my pc when I go fullscreen (pc running i7 &amp; nvidia 970 video card)",
            "review_score": "1"
        },
        {
            "review_text": "good one, worth $2 for sure. Atmosphere is a bit distracting and becomes really hard to see which is a bit frustrating. Music is good. Game breaks on my pc when I go fullscreen (pc running i7 &amp; nvidia 970 video card)",
            "review_score": "1"
        },
        {
            "review_text": "Too confusing and smudgy to be easy to get into to. Way better shooters out there to keep trying.",
            "review_score": "-1"
        }
    ]
}