{
    "app_id": 201510,
    "name": "Flatout 3: Chaos & Destruction",
    "release_date": "2011-12-13",
    "developer": [
        "Team 6 Studios"
    ],
    "publisher": [
        "Strategy First"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Partial Controller Support"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Psychological Horror",
        "Destruction"
    ],
    "achievements": 46,
    "positive_ratings": 290,
    "negative_ratings": 1874,
    "price": 6.99,
    "description": "Feel the adrenaline pulse through your veins as you barrel through insane race tracks against monster trucks, race cars, off road vehicles and much more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/201510/header.jpg?t=1525726017",
    "minimum_requirements": "Operating system:Windows® XP Processor: Intel® 2 GHz dual core CPU Memory: 2 GB Video: Nvidia GeForce 8600+ / AMD Radeon HD X2600+ Internet:Broadband Internet Connection DirectX®: DirectX® 9.0c Hard disk space: 16 GB Sound: DirectX® compatible Onboard Soundcard Supported Input Devices: Keyboard, Joystick, XBox Controller, Gamepad, Microsoft Controller for Windows Additional Notes: Also supports Razer Hydra.",
    "recommended_requirements": "Operating system:Windows® 7 Processor: Intel® Quadcore Memory: 4 GB Video: Nvidia GeForce GTX 590 / AMD Radeon HD 6970 Internet:Broadband Internet Connection DirectX®: DirectX® 9.0c Hard disk space: 20 GB Sound: DirectX® compatible Soundcard Supported Input Devices: Keyboard, Joystick, XBox Controller, Gamepad, Microsoft Controller for Windows Additional Notes: Also supports Razer Hydra.",
    "reviews": [
        {
            "review_text": "I was not able to complete even one hour game Flatout 3: Chaos &amp; Destruction. I at least when I bought the game expecting a Flatout 2 with slightly better graphics and either innovation in gameplay, it's true I did not expect much out of him, but what I saw is unbelievable.  Cade the excitement of each race in Flatout 2? There is none of that here. This is a completely different game, where every minute in this game, seem hours. If you played Flatout 2, please DO NOT buy this game. Guarantee dissatisfaction.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Flatout game ever.I used to play flatout before I had a steam account.I have played Flatout 2 demo for atleast 15 hours.(It has been some years though).But look at my activity on this game.I Couldn't stand it.Atleast I bought the flatout complete at a big sale so I didn't waste too much money on this awful game.",
            "review_score": "-1"
        },
        {
            "review_text": "I really loved Flatout 1, then Flatout 2 and Flatout Ultimate Carnage (although they were pretty much the same game, the latter graphically a bit tuned up and 'more to do'). So, since I bought the FO1/FO2/FOUC/FO3 package, why not play Flatout 3 although I've heard some pretty nasty stuff about it. Note: one of my Steam friends told me to keep my memory of Flatout as it was: when I did install, he uttered 'don't play FO3, uninstall and never look back'   Naturally, I rejected his advice, because I wanted to form an opinion that I made myself. How I wished I had listened. The game has graphics worse than Flatout 1, driveability worse than Flatout 1, a damage model worse than Sony's F1 2005-2009 (and that was horrible) and looks like a game made in....1998 at best. No, even the Half Life 1 graphics were better. 1996, 1997? For the Dutch in my list, it looks like A2 Racer. The first one.  Just one race, but enough to scrape the pieces of my Flatout memory to what it was after Ultimate Carnage. Don't buy, and if you do, I hope you are buying the other 3 Flatouts with it, because this game should pay you to have you play it.",
            "review_score": "-1"
        },
        {
            "review_text": "Flatout 2 was WAY better. This one had terrible physics, collisions, and just annoying when you ram someone full speed to only do a tiny fraction of their health. Only to realize someone else tapped you, and you lost more than half of your health. Just stick with Flatout 2, better yet, stick to Flatout 2: Ultimate Carnage.",
            "review_score": "-1"
        },
        {
            "review_text": "This has to be the worst game I have ever played/seen in my life.... and I have played some bad games, so trust me when I say this one beats any game in ther pure ♥♥♥♥'o'meter!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible optimization terrible controls and an ♥♥♥♥ load of forced post processing effects you cant turn off. This game isnt even worth your money if it was only 3 cents. This game is worse than a rushed unity game slapped on greenlight as early access",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a fan of the FlatOut series, and I bought this on release thinking it would be the latest and greatest. But this game is tough to get into, if not for the fact that the controls operate like your gamepad is begging for an immediate and swift death. The adrenaline of Ultimate Carnage is ill-supported here and the game lacks a lot of the punch that made past titles great.  Worth noting - this game was made by a third party studio, not the one responsible for the earlier games.",
            "review_score": "-1"
        },
        {
            "review_text": "A little bit better controller support still terrible. Not recommended for xbox controller unless you feel like tweaking the game frustratingly.",
            "review_score": "-1"
        },
        {
            "review_text": "By far the worst game and greatest missuse of a game series name ever. Don't buy, in fact: run away, fast.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is not worth $30.00, its not even worth $1.99 i bought it for with the other three games",
            "review_score": "-1"
        },
        {
            "review_text": "There are -bad games, -horrificly broken games, -horrificly broken bad games,  ...and then there's Flatout 3.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible. I'd rather cheer on my own firing squad than ever play this game again.",
            "review_score": "-1"
        },
        {
            "review_text": "Just pretend this game doesn't exist.  Buy 'Wreckfest' instead, it's made by the people that made Flatout 1 and 2",
            "review_score": "-1"
        },
        {
            "review_text": "Oh dear god, this game is a piece of turd! It is an insult to the Flatout series, hell this is not Flatout, its crap with the Flatout title stamped on it!  Avoid like the plague!",
            "review_score": "-1"
        },
        {
            "review_text": "fantastic game 0/10 would recommend xd Nah I kid, don't waste your money here. You'd have a better time buying a cheese grater and shoving it up your ♥♥♥♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I'd rather have a brick thrown at me then play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst racing game of all time? Quite possibly.",
            "review_score": "-1"
        },
        {
            "review_text": "Not the worst driving game ever, but if you loved the hell out of FlatOut 2 and/or FlatOut: Ultimate Carnage, then this release by a different developer will be a big disappointment. Still, it's not all that terrible, really, if you're not familiar with the older games (but they did make good effort to address issues). I would still recommend FlatOut: Ultimate Carnage instead (or FlatOut 2 for older computers); and/or if feeling adventurous, the next-gen early access Next Car Game from the ex-FlatOut devs. [Other great similar ones: Burnout Paradise, DiRT Showdown]",
            "review_score": "-1"
        },
        {
            "review_text": "No. I can't belive they would price this game at $30!!! Ok here is why this is a negative review: It isn't anything like the other Flatout games, since it was a different developer, And it is very laggy. Also no one makes any multiplayer servers. Also it is really hard! So don't but this game! Go with the other Flatout games made by the other devs. Because this is not what your looking for!!",
            "review_score": "-1"
        },
        {
            "review_text": "The hell happened? This is the Worst Fallout from Fallout Series... really..",
            "review_score": "-1"
        },
        {
            "review_text": "OMFG! This game is BAD. Dramatikally bad... like PS2 games... its 2004 or 2012 ??? NOT RECOMENDED AT ALL! AVOID AT ALL COST!",
            "review_score": "-1"
        },
        {
            "review_text": "Not even as a gag gift.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is nothing like the previous game in the series (and i don't mean it in a good way).It's totally different than FlatOut 2. And you know what I say about Flaout 3? IT FLATOUT SUCKS!",
            "review_score": "-1"
        },
        {
            "review_text": "What were they thinking??  Flatout 2 &gt; Flatout 3 I feel like Flatout 2 was released after Flatout 3...",
            "review_score": "-1"
        },
        {
            "review_text": "I hate this game,  I loved the first two flatout games. this one just does not feel like the flatout games i'm used to.",
            "review_score": "-1"
        },
        {
            "review_text": "Maby I was expecting too much. What I wanted from this game was something like Flatout 2, with that fun, cartoony art style and derby/racing game. First off, this game has aggonizingly slow load times and I run this game on a fairly modern computer! The soundtrack is so dark and mysterious which doesn't help with that fun part either. I also dislike how if you looked at Flatout 2 and Flatout 3, you would not see anything that represents each other. Set aside the bad stuff, I do like how this game looks, it looks absolutely goregous and I have to say I wasn't expecting Flatout 3 to be looking this good. I also like how you can finally choose your character which was something that was highly requested throughout the Flatout franchise. I also like how there is a whole new selection of cars to choose from. I don't like how there is no car from any of the previous Flatout games in Flatout 3. The number one thing that really bugs me the most, is the physics of this game, they are NOTHING like any other Flatout games, same with the camera angles. I won't get too much into detail with that because I have so much to rant on about with the camera angles and physics. I will probably play this game again being me who doesn't want to accept the fact that one of his most beloved franchises is now ruined by one simple game. I'd give it a 5/10.",
            "review_score": "-1"
        },
        {
            "review_text": "The first flatout proved itself wise to the world but this is a discrase to humanity. this brings a bad name to flatout and as most parents say 1 is enough.",
            "review_score": "-1"
        },
        {
            "review_text": "rember the days it used to be good well ♥♥♥♥ you its ♥♥♥♥ now.",
            "review_score": "-1"
        },
        {
            "review_text": "9/11 won't recommend   FlatOut 1 is still the best",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun game to play only the graphics are a bit low :S  6/10",
            "review_score": "1"
        },
        {
            "review_text": "ːLaserBeamː ːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamːːLaserBeamː   people that played Flatout 2 and thought this was going to be similar hate this game",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It's awesome and really cool. I had seen the the other reviews and some of them said, 'lololol th1s g4me 1s t3rr3b1e' I do not say that. THIS GAME'S PROS: Cool Cars, Nice Tracks, Lots of gamemodes and a lot of chracters. CONS:It's pretty hard.",
            "review_score": "1"
        },
        {
            "review_text": "THis is my favourite of the series. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Best game 10/10  Physics are incredible, the textures look amazing and the characters you can pick are so varied it hurts.  GOTY material.",
            "review_score": "1"
        },
        {
            "review_text": "Don't know why people give this game hate, just cause it was made by different devs doesn't mean it's bad. Infact it's much better than the previous games and here's why:  Much more responsive controls Many more game modes A lot more fun Just much better really  No this isn't a troll it's a damn fun game actually.",
            "review_score": "1"
        },
        {
            "review_text": "Believe the reviews - this game is truly terrible. The graphics look 10 years old and the handling is depressing.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME! I am a huge fan of all of the other FlatOut games and I really tried to give this a chance but it is just a terrible piece of garbage trying to cash in on a series developed by a company no longer involved with it. Show support for the original series and buy FlatOut 1, 2 and Ultimate Carnage, or support those guys directly and go check out Bugbear's Next Car Game, but pleast do not give these guys any more money. This is not deserving of the FlatOut name.",
            "review_score": "-1"
        },
        {
            "review_text": "Not very good compared to FO1&amp;2",
            "review_score": "-1"
        },
        {
            "review_text": "worst flatout ever difficult to get working bad graphics and much more ",
            "review_score": "-1"
        },
        {
            "review_text": "IF your remotely are a flatout fan at all then Just put your money back in your wallet and just walk away ..... Theres nothing to see here folks just keep on going",
            "review_score": "-1"
        },
        {
            "review_text": "I played like 12 minutes of this, and will never play another second. Excuse me while I erase this from my memory. *smashes head against brick wall until dead*",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "This is a pile of crap, do not buy! The other 3 flatout games are good though...",
            "review_score": "-1"
        },
        {
            "review_text": "Do not get this game. Bugbear is working on a new Ridge Racer title and you should focus on that. This is developed by completely different people, rendering the 'FlatOut' name uselss.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy.  Do. Not. Buy.    Do. Not. Buy.        Do. Not. Buy          DO. NOT. BUY        Originally posted by  Me :",
            "review_score": "-1"
        },
        {
            "review_text": "RIP company who made this game, never gonna sell good again",
            "review_score": "-1"
        },
        {
            "review_text": "i DONT RECOMMEND THIS POS GAME, this is the worse in the flatout series. Ive been a big fan of flatout games for years, and this is just horrible. Wont work with your steering wheel, gfx are horriable, AI is shi t, its just a big peice of donkey poop. If you want to waist your money then go ahead and buy.",
            "review_score": "-1"
        },
        {
            "review_text": "a bit too cartoonish for my likings, prefer Flatout 1/2 style",
            "review_score": "-1"
        },
        {
            "review_text": "want my money back",
            "review_score": "-1"
        },
        {
            "review_text": "To be very honest, the first flatout is a bit boring, and the third flatout just is completely horrible. Flatout 2 is the only good game of its series.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was disappointing. Was expecting massive crashes with particles flying and softbody physics. The improvements Bugbear made to this weren't enough to offset the bad effect on gameplay that the more arcady feel has. Rather wait 'til Wreckfest to be released. Or better yet just go right now and play either Flatout 2 or Wreckfest, they're both made by the same guys who made this and are better.  A rare miss for Bugbear.",
            "review_score": "-1"
        },
        {
            "review_text": "It is a bad game. I wonder that Flatout 3 has something to do with the original Flatout. What a waste of time and gigabytes!",
            "review_score": "-1"
        },
        {
            "review_text": "Alright, I was the biggest fan of previous opuses. I waited for this game to come out, unsure of what it would, because that it was not made by bugbear.   when I first runed Flatout 3, I thought it was a joke. And I still think it is. I think they make better games than that for toasters. The 3 races I had killed a part of my soul.  Seriously, dont buy this thing. And if you liked the other flatouts, well.. lets just hope Bugbear puts its hands back on the Flatout Serie.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd hoped they were all lies. Flatout created a format for success which the second one followed and improved on, but this, this cancer to the flatout series should be removed. It does not belong in such a series. The driving system in this game is worse than many flash racing games. Mario kart 64 handles more realisticly than this game by far. In addition, in the second race I ever played in this game I clipped through the ground. After that I just gave up on this game. THIS GAME IS BROKEN! Also, this game requires the highest hardware specs out of the series yet I think the turd I made this morning looks like a better racing game. I bought this game as part of a bundle. However, if you are just thinking about buying this game because you liked other flatout games in this seris, DO NOT SPEND MONEY ON THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "1/10  Made by a different studio and nowhere as good as Flatout 1 &amp; 2.  Poor racing mechanics, visuals and track layouts make for a game not to buy.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is about as fun as the dish network tutorial channel. 0/10 - bad bad bad",
            "review_score": "-1"
        },
        {
            "review_text": "I wouldn't call it broken, but the FPS goes down the toilet when you PLAY WITH MORE THAN 3 NPCS... *sigh* Buy #2, not this one",
            "review_score": "-1"
        },
        {
            "review_text": "It's so bad it's fun. But it's still bad.",
            "review_score": "-1"
        },
        {
            "review_text": "words cannot express how bad this game is. just buy flatout 2 and you will be much much happier",
            "review_score": "-1"
        },
        {
            "review_text": "Worst racing game! Horible!",
            "review_score": "-1"
        },
        {
            "review_text": "Alright wow, where to begin with this game? Whooo weee. Alright lets get started. The... Pros? To be honest, Its hard to really think of any, I got barely into the game before it started crashing so I guess this is off the list.. The Cons. Basicly this game is poorly put together, using the most generic looking models, the most generic music, the most generic AND I KID YOU NOT GENERIC sounds Ive ever heard, No joke that like 'Chink' noise you hear from like I dunno any youtube intro back in 2010? its all over the place. Graphicly this game is hideous, Everything is flat and rusty and low res. Lighting might as well be not there at all as its all this ugly yellow. Anything besides race mode crashes your game, first time I started racing the game dropped to 0 FPS for about a full 3 seconds only to shoot up to 80. and I am running a brand new high end GPU.  If you see the game don't get it, want a destruction derby style racing game? Get the first flatout.  Flatout don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "The handling is poor, the physics are rubbish, and the destruction is that by name only. If you want a good FlatOut, any of the previous ones is better.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, just... Wow. I think every other negative review here is spot on acurate. Absolute ♥♥♥♥♥. Sadly I paid money for this.   TL;DR  Avoid...",
            "review_score": "-1"
        }
    ]
}