{
    "app_id": 202130,
    "name": "Impire",
    "release_date": "2013-02-14",
    "developer": [
        "Cyanide Montreal"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Fantasy",
        "Villain Protagonist"
    ],
    "achievements": 48,
    "positive_ratings": 167,
    "negative_ratings": 208,
    "price": 14.99,
    "description": "Deep in the underworld of Ardania, a threat of the most evil nature grows and multiplies with an appetite for destruction that is unsurpassed. Summoned from the depths of the Bottomless Pit, the (once) mighty Báal-Abaddon has been torn from his throne of skulls and imprisoned in an earthly body of less-than-imposing stature (he's an Imp,...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/202130/header.jpg?t=1530640943",
    "minimum_requirements": "OS:Windows XP/Vista/7 Processor:Intel® Core™2 Duo Processor E8400 3.0GHz or AMD Athlon 64 X2 6000+,  Memory:3 GB RAM Graphics:NVIDIA® GeForce 8800 or ATI Radeon® HD3000 video card with 512MB of dedicated memory DirectX®:9.0 Hard Drive:3 GB HD space Sound:DirectX Compatible Soundcard Other Requirements:Broadband Internet connection Additional:3-button mouse, keyboard, speakers, Internet connection for multiplayer",
    "recommended_requirements": "Additional:3-button mouse, keyboard, speakers, Internet connection for multiplayer",
    "reviews": [
        {
            "review_text": "As you would probly guess it's like dungeon keeper with some gameplay changes while trying to keep the same brand of humour. That being said it's take on the humour, in my opinion, feels childish and drab while the gameplay leaves me struggling to keep my attention in order to finish. Not to say it's a bad game, you should know that if you want to play a dungeon keeper type game then you could do better.",
            "review_score": "-1"
        },
        {
            "review_text": "Went into this expecting a nice reboot of Dungeon Keeper with some changes and additional features. Although the game itself seemed okay, a clunky GUI, the unit micromanagement and the lack of flexibility that Dungeon Keeper had with placing dungeon rooms ruined it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Tries a bit too hard to be funny, but amazing game otherwise.",
            "review_score": "1"
        },
        {
            "review_text": "This game is funny. It is a dungeon lord type of game where you build your dungeon, train your monsters, kill the heroes who try to get into your treasure room and do the missions to raid and destroy and generaly do mahem and eeeeevil things!  It has a good sense of humour and the incompetence of your master is quite amusing! He's like the Austin Powers villain!   It is a fun game. I've seen a few crashing bugs tought, but when you restart the game it seems to go away. And my computer is rock solid in any other game, so i don't think its my hardware.  I recommend heartily!",
            "review_score": "1"
        },
        {
            "review_text": "A charming strategy, with pleasant gameplay, some original ideas and humorous wackiness. The cardinal sin, it wasn't Dungeon Keeper 3. This game doesn't deserve it's low score. The gameplay is fun and the mechanics are strong. The controls could have been better, but you get us to them quite fast. The game could have used controller support but by no means, does using a keyboard and mouse take away from the fun of the game. Allot of people talk about the 'ladder' aspect of the game being annoying. You can turn them off if you want. You can play with friends or online. Overall, it's not a bad game. Worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "I love dungeon game style but it's make me fun in a short times so it's worth in 'Steam SALE' price. /// good for who love &lt;micro troops and units&gt;",
            "review_score": "1"
        },
        {
            "review_text": "This is a bit of a guilty pleasure to me. It's inspired by one of my all time favourites: Dungeon Keeper: a classic dungeon management RTS. Impire borrows some basic concepts from this classic and is at times a fun and enjoyable game with good humour. But after a few hours, the slow pacing, some weird design choices and the tons of micro-management take the fun out of it and leave you wanting to play the classic Dungeon Keeper instead. Recommended only to hardcore fans of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Good game and well worth the money. I havent played a dungeon game this fun since dungeon keeper.",
            "review_score": "1"
        },
        {
            "review_text": "3/10, not very immersive. Poor dungoen keeper rip off, but ive seen worse. Bought on impulse.",
            "review_score": "-1"
        },
        {
            "review_text": "As much as I had high hopes for Impire, I was left with a sour taste in my mouth. The game attempts to mimic the glory of Dungeon Keeper and fails miserably. There is little to no ability to customize the dungeon as you want. The spells are boring and a pale copy of what its ancerstor had excelled in.  I would not reccomend this unless it is on sale.  Ticklepants",
            "review_score": "-1"
        },
        {
            "review_text": "Simple review, this is a strategy game that reminds me of D&amp;D, in this case you play the bad guys, and create a dungeon for heroes to pillage. Then you kill said heroes. And find treasure, and create an army of minions to do evil tidings.  Very simple to learn, and very fun to play.  Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Impire is probably the best dungeon management game that has come out in a long time. While the story is nothing special and almost linear, it is commendable that this is done flawlessly. The voice acting is on the spot, at least for the main cast. Micro- management has never been this much fun, since well… ages (in my opinion). Impire keeps you busy and interested from start to finish. Complaints about repetitiveness of the game might be founded, but I think it is more of a matter of preference. It is true that there are a couple of imperfections that should (and could be easily) addressed. The lack of grunt noises and the inability to be able to re-check the mission goals, are flaws that can be frustrating at times. The biggest imperfection is perhaps the lack of information when it comes to upgrading units. A micro-management oriented game is not as pleasant to play when the necessary information is missing.  But in the end Impire is a captivating game, unique characters and funny dialogues are more than enough to recommend it to everybody. A herd of (almost) impervious, impertinent, imps are waiting to serve their overlord. So what are you waiting for? You’re supposed to be on a highway to hell!",
            "review_score": "1"
        },
        {
            "review_text": "This game is abysmal. Like, it sucks. It's tedious to control your minions, the traps are useless, you're given little leeway in designing your dungeon (or in your dungeons defenses), the 'humor' is embarassingly bad, and the campaign is long and boring (with extra helpings of lame jokes). This is not Dungeon Keeper. It's not Evil Genius. The developers should give up and go home (I wouldn't be surprised if they already have). There's another Dungeon Keeper like project in the works. Maybe that one will be better. I hear there may also be an Evil Genius sequel. In the meanwhile, don't waste a second of your life on this boring game.",
            "review_score": "-1"
        },
        {
            "review_text": "Reminded me a lot of Dungeon Keeper, was a good time. One i've been meaning to go back and finish.",
            "review_score": "1"
        },
        {
            "review_text": "The game is remniscent of the Dungeon Keeper series and provides a slightly nostalgic feel. The graphical style and detailed overworld are quirky and creative but are ultimately overshadowed by the slow placed and repeitive gameplay. A major downfall is in its lack of flexible micromanagment and preset room layots. Players are also prevenetd from changing preset room layouts at the start of each new map which limits creativity and needlesy increases difficult as the treasure hold is always placed close to the entrance (where enemeies enter to plunder your dungeons treasure). Imire does provided a wide range of unique creatures and a interesting team combo feature, rewarding creative team combinations. The storyline also contains interesting aspects. Overall the agme is satisfactory if you want a casual play but is no Dungeon Keeper 3.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know about other people but personally I hated this game, it was billed as a Dungeon Keeper inspired game, instead of that we get a crappy tower defense game with horrible AI. In order to win, you have to micromanage every single thing, stay away from this one folks.",
            "review_score": "-1"
        },
        {
            "review_text": "5/10  Wow, it seems people are still buying this game.  on its own it is a game of slightly below-average quality with a lot of mechanics and concepts ripped-off from an old classic known as Dungeon Keeper. The graphics are pleasant but gameplay feels restrictive.  The main reason i've posted this review is for the following:  If you came here looking for a Dungeon Keeper fix then...  AVOID AT ALL COSTS!!! AVOID AT ALL COSTS!!! AVOID AT ALL COSTS!!! AVOID AT ALL COSTS!!! AVOID AT ALL COSTS!!!  and if that's not enough to dissuade you then may Horny have mercy on you.",
            "review_score": "-1"
        },
        {
            "review_text": "Got it in a bundle, played a little bit, was not inspired. It seems like there were some good ideas behind it, but nothing fantastically executed or much fun to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Neat little Dungeon Keeper style game. Not quite an Anno2070, but still entertaining for a few hours. The story is awful, but the gameplay is pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Like Dungeon Keeper 2, but with all the fun taken out.",
            "review_score": "-1"
        },
        {
            "review_text": "You know, I knew the reviews were bad on this game, but it was on sale, and was hoping it got better. It looks like it hasn't. The room management is simplified, and horrible for placing things. I tried to like the game, but I just find myself getting bored. The campaign is supposed to be funny but comes off as being dumb (partially because the animations appear off). And the annoying pinky to the face was lame before the main character did it for the 100th time. Definitely avoid",
            "review_score": "-1"
        },
        {
            "review_text": "boring dungeon keeper clone cant reccomand",
            "review_score": "-1"
        },
        {
            "review_text": "Imagine for a moment, that you started with Dungeon Keeper 2, a great game and an old classic. Now imagine that you added a whole bunch of pointless micro-managing, removed most of the dungeon customization, made the combat unspeakably tedious, completely destroyed the progression system and then had a 9 year old re-write the dialogue.  The game you would have is Impire.  If you don't hate yourself, play something else.",
            "review_score": "-1"
        },
        {
            "review_text": "My friend told me to get this game because it played like Warcraft 3. Worst mistake of my life. Don't buy this piece of garbage. Now I have to murder my friend. Thanks, Impire.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics give me a headache.",
            "review_score": "-1"
        },
        {
            "review_text": "DK like game many of us have been waiting for. worth every penny at just 20$",
            "review_score": "1"
        },
        {
            "review_text": "One of the worst purchases I've ever made. Bought it hoping it'd be a legit Dungeon Keeper clone. Wasn't nearly legit enough.",
            "review_score": "-1"
        },
        {
            "review_text": "So, lets start with game play. Controls are easy, there is an excellent starting tutorial at the beginning of the game.  The gathering of resources is relatively easy.  Upgrading isn't terribly difficult so long as you're not worrying about some timer count down.  The storyline is amusing, up until the end.   No matter what you do in the game choice wise, ie, the mini missions, it doesn't effect the ending out come. Which is bs in my opinion. Maybe the devs just got bored and couldn't think of alternate ones or were just to lazy to do them.   The dlcs are neat, but you wont get to use them unless you go through a bunch of profile setting changes (after figuring it out) and then getting to almost the end of the game.   There are several points where it looks like you can get rid of oscar in favor of a more compitent advisor thing, but, apparently your all powerful demon is too stupid to figure it out.   Spoiler:  no matter what you do the king always wins. He beats you, makes you kill what ever companion you've been traveling with (oscar or velvet), and you are left there to either rule the basement or go back to hell. The end.   It's honestly a shame the devs didn't put in five more minutes of time to add in alternate companions, ie the fire demon, the undead snake lady, and such. Let alone alternate endings dependent on the choices you've made through out the game.   I give the game a good rating, the creativity with the end and options a non existant rating, even negative. But, if you like the rts dungeon building bit, it is loads of fun. Just don't count on depth of story line or your options doing anything important.",
            "review_score": "1"
        }
    ]
}