{
    "app_id": 202370,
    "name": "Scary Girl",
    "release_date": "2012-04-09",
    "developer": [
        "TikGames"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Platformer",
        "Female Protagonist"
    ],
    "achievements": 12,
    "positive_ratings": 36,
    "negative_ratings": 24,
    "price": 4.99,
    "description": "In this side-scrolling action game, you play as Scarygirl – a girl who has been adopted by a giant intelligent octopus and is trying to figure out who the man haunting her dreams is. Traverse unique, extremely vibrant, colorful, and magical worlds in a seamless mix of 2D and 3D platforming action.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/202370/header.jpg?t=1479419714",
    "minimum_requirements": "OS: Windows XP, Vista, Windows 7 Processor: 1 Ghz Dual-Core Memory: 1 GB RAM Hard Disk Space: 2 GB Video Card: 256MB Shader Model 3.0 DirectX®: DirectX 9.0c compatible",
    "recommended_requirements": "OS: Windows XP, Vista, Windows 7 Processor: 2 Ghz Dual-Core Memory: 2 GB RAM Hard Disk Space: 2 GB Video Card: 512MB Shader Model 3.0 DirectX®: DirectX 9.0c compatible",
    "reviews": [
        {
            "review_text": "This game reminds me on why I swore never to buy artsy indie platformers. While it's visual style is bewichting, it gets absolutely totally bloody hard later.",
            "review_score": "1"
        },
        {
            "review_text": "Cute game, but nothing special.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe the ultimate example of a perfectly nice-looking game with potential being ruined by terrible decisions in key places. Specifically, the rubberiness of combat, and the awful checkpointing decisions here and there. But it's the combat that's key. I've actually reached the end, there's a long combat sequence to do, and after half a dozen attempts, you know what? I give up. I don't care. I've already screamed at the screen too much and too loudly. I'm going to tell people I finished this game, because according to the walkthrough I am indeed at the end. But I've drunk my fill of this game, and having experienced all of it, I think I'm going to tell you it's not worth the frustration.",
            "review_score": "-1"
        }
    ]
}