{
    "app_id": 202410,
    "name": "Scoregasm",
    "release_date": "2012-02-08",
    "developer": [
        "RC Knight"
    ],
    "publisher": [
        "Charlie's Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Stats"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Twin Stick Shooter"
    ],
    "achievements": 19,
    "positive_ratings": 107,
    "negative_ratings": 22,
    "price": 3.99,
    "description": "Scoregasm is an incredible, variety rich shooter with a non-linear, branching paths style galaxy to explore. It's pretty, accessible, fun and really rather good! Blast your way through the galaxy's many varied levels and use your skills to change your route, find new levels, new enemies, unlock bonus challenge stages and fight the bosses...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/202410/header.jpg?t=1447354931",
    "minimum_requirements": "OS: Windows XPProcessor: 2ghz or fasterMemory: 512mbHard Disk Space: 100mb Free SpaceVideo Card: 128mb PCIE2 level graphics cardAdditional: Supports Controllers including Microsoft Xbox 360 controller for Windows.",
    "recommended_requirements": "OS: Windows XP+Processor: 2ghz or fasterMemory: 1gb RamHard Disk Space: 100mb Free SpaceVideo Card: 512mb PCIE2 level graphics cardAdditional: Supports Controllers including Microsoft Xbox 360 controller for Windows.",
    "reviews": [
        {
            "review_text": "Scoregasm is a twin-stick shooter, in the vein of Geometry Wars, but with heavy inspiration from Mutant Storm Reloaded (various shapes for the arenas, combo system, big number of different enemies).  Its main selling points are a focus on huge scores, branching progression through the levels, and a focus on proximity bombs. Contrary to most games in the genre, in which such life-saving bombs should be spared for desperate situations, Scoregasm encourages the player to use them liberally as they help achieve higher scores and combos. Thid id probably the reason why Scoregasm is considred too easy by the most hardcore players.  The action is frantic enough to remain interesting and the controls (aside from the menus) are perfectly precise and responsive with the Xbox 360 controller. The music is good, provided you enjoy slightly outdated techno.  Technically, graphics are nothing too impressive, though perfectly serviceable, except in some rare levels where elements from the background can easily be confused with enemies.  The big problem with Scoregasm is the online scoreboard, which ceased to function just one year after the game's release and has never been restored, despite the developer's promises.  Scoregasm is not a bad game per se, but it's not original enough to make it easy to overlook the disappearing features and poor support, especially in such a crowded genre.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun, even if a bit simple. I love bullet hell games though and the end of round rush waves are a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice twin stick arena shooter. The audio and visuals blend well together, and make a nice fit for this game. If your in to twin stick or arena shooters or just want to reminisce of playing robotron as a youth you should buy this game. It is well worth the asking price. And its a steal when it goes on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Okay so i first saw this game and kinda giggled when i saw the name and bought it for ♥♥♥♥♥ and giggles... But once i started playing this game i realized why its called sc♥♥♥♥♥♥.. This game is quite honestly an ♥♥♥♥♥♥ topped off with lasers and spaceships, like damn.. You think an ♥♥♥♥♥♥ is the best feeling ever? Go play sc♥♥♥♥♥♥ and have your life changed forever. You had a tough day? Need a pick me up? Scoregasm is 10X better than any other thing you could think of.. Now go buy sc♥♥♥♥♥♥ and have an ♥♥♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "Great dual stick shooter, lots of flashing lights and what not",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly, this game is actually really hard. I'm no twin-stick guru, but the real challenge in the game comes from the 'Challenges' you can unlock by meeting certain requirements. Even the first Challenge is really quite crazily hard, and that alone does extend the lifetime of the game significantly. This game is probably best buying it only on special, because you might well get bored fast, but if you like twin-stick shooters I do believe it does justify paying full price.",
            "review_score": "1"
        },
        {
            "review_text": "Joy fills her heart like a silent but deadly fart fills a room with no windows.",
            "review_score": "1"
        },
        {
            "review_text": "Funny name but with Waves and Geometry Wars as competition...this can't really compete!",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty solid twin-stick shooter. The mechanics and design aren't really anything new for the most part, but they're done well enough to be fun. The branching levels/difficulties based on your performance both encourage replay and allow for people of different skill levels to play. It's rather forgiving on the easiest path, but getting all the medals on the hardest one or the achievement for beating it on a single life is substantially harder, along with some of the additional challenges you can unlock for each level. Not really exceptional in any way, but there's also nothing it does wrong either. Overall, I'd give it a 'yeah, it's pretty good, I guess'. Heh.",
            "review_score": "1"
        },
        {
            "review_text": "One of the better twinstick shooters to come out in the last decade. If you played the first Geometry Wars and haven't needed to find another twinsticker since, you need this one.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I bought a few shootemups lately, some of them really hardcore but this is awesome! lots of fun, highly recommended if you like this kind of game. Use a gamepad!",
            "review_score": "1"
        }
    ]
}