{
    "app_id": 202730,
    "name": "Dynamite Jack",
    "release_date": "2012-05-10",
    "developer": [
        "Hassey Enterprises, Inc."
    ],
    "publisher": [
        "Hassey Enterprises, Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 13,
    "positive_ratings": 345,
    "negative_ratings": 56,
    "price": 7.19,
    "description": "A brave space marine, armed with only bombs and a flashlight, must escape the Anathema Mines!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/202730/header.jpg?t=1527090045",
    "minimum_requirements": "OS:Windows XP Processor:2 Ghz Memory:512 MB RAM Graphics:OpenGL 256 MB DirectX®:8.0 Hard Drive:100 MB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The soundtrack is quite good, the gameplay is good and the game is unforgiving ( while going for achievements. ) I had a lot of fun playing through this top-down stealth game.  It took me 5 hours to complete the game and it's definately one of the best stealth game I have ever played. It's really intense and the last levels are quite a challenge! The graphics are nothing too impressive, but the game run well at least. There are 28 levels with 3 secondary goals each and there is no storyline at all. The controls with a keyboard only are responsive and the the game is easy to get into.  If you're a fan of the genre, don't hesitate to purchase this game, it's worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Adictive !!!",
            "review_score": "1"
        },
        {
            "review_text": "A top down stealth bomber/escape game in which you're trapped in the Anathema Mines and must reach the light coming from the surface on each stage. You begin most levels in the dark with only a map, but a flashlight, bombs and a detonator can be found lying around, along with other collectibles like door keys and cartridges which unlock bonus stages.  The design feels very 'game lite', but it's simple fun. Guards patrol set routes and you have to avoid being spotted by their flashlights. Using your own makes you more likely to get caught, but beasts will run away from it. Bombs can be used to distract and destroy enemies, cave walls, lasers and other objects.  Each level has in-game achievements shown along with your time/deaths on some very nicely done leaderboards. Also, Steam achievements, native gamepad support, a nice soundtrack and a level editor to build your own levels, as well as a plethora of community created levels to play.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad, although it will probably bore most of people... Cheevs, like having to finish the map without killing anyone, or without using the flashlight, make it more entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Actually a really good game and I WANT THE SOUNDTRACK IT IS EPIC!",
            "review_score": "1"
        },
        {
            "review_text": "Good easily made game, it's kind of adventures and good!! simply love it",
            "review_score": "1"
        },
        {
            "review_text": "A cheap and nice game, that has good old times retro game atmosphere but more sophisticated graphics and sound.  It's not a jaw breaking experience, but it is somewhat fun. It isn't very expensive so why not? I will recommend this yes, especially on a discount. Its like a stealth em up with bomberman elements and Arcadia 2100 Escape atmosphere. I liked it.",
            "review_score": "1"
        },
        {
            "review_text": "addicting",
            "review_score": "1"
        },
        {
            "review_text": "Well, got this in a Humble Bundle, so I can't put a price on it, but I spent a few hours playing it, and I find it rewarding and I liked that I could play it on my mobile as well (obviously not on Steam). Definately Good to pass the time.",
            "review_score": "1"
        },
        {
            "review_text": "The game plays with a mechanic that is sorely lacking / done right in gaming - stealth, especially using light/dark. you hide from your enemies, who have torches, and then (hopefully) blow them up, andmaybe some walls so that you can escape this nightmare prison that you are in.  If you are in light, you are seen, you are insta-giblets. Stay out of the light.  I didn't like the game. It felt like bomber man, and the graphics, although sufficient, felt lacking... which is understandable for a game built for Ludum Dare (a 2 day programmer competition). I actually felt it was too unforgiving, and too hard. I guess I was after somethign a bit more casual at the time that I tried it. I also hate time-trial based games (with the exception of racing games). This has achievemnts based on how fast levels are completed, although it does not seem to affect the early story progression (I have not completed the game so I don't know about the later levels).  I just didn't enjoy the game, thus my negative.",
            "review_score": "-1"
        },
        {
            "review_text": "basic but the achievments are easy so it gets a thumbs up from me",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really annoying and pretty ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "This game has some good ♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "I supper loved this game. I grinded, rage quit, got bored and utterly annoyed but every.....single.... time.... i came back to it. It was really fin and the difficulty ramps up nicely and even the achievements that 'seems' impossible have a solutiion. Overall, i really enjoyed it. Heing a stealthy bombing assassin was fun, both when i killed everyone and when i snuck through like a flipping ghost.   I highly reccommend this to anyone who enjoys stealth games or puzzlers. It is fun. And the developer balanced the levels really well. You got a 'destroy everyone's ♥♥♥♥' level after a super hard 'don't kill anyone and don't die' level so you could release the pend up stress and frustration. It took me around 7-8 hours to complete it and that was with me being super idle or walking away when i was raging. A decent game for a decent price.",
            "review_score": "1"
        },
        {
            "review_text": "Game is thought prvoking and fun ",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game... a real gem. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game. I like a game that need a strategy to play like this. The graphic is not bad, but also not kind of high quality graphic. Gameplay is great, (semi) new concept, because I think it's remmember me about 'Chip' game, lol. I you make a sequel, please add multiplayer and also improve the graphic and effect, I think it will become an awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Nice old-school graphics. Stealth is a must! Collect the items, comlpete certain level requirements for achievements, which add a bit extra to the gameplay. It won't take more than 30 minutes to complete this game, but it is really enjoyable.  9/10!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Easy to win up through about the halfway point. Extreme difficulty ramp after that point. I have tried about three dozen times to get the last anathemite level perfect without success. Even when it is garment rendingly frustating it is still quite fun. Recommend.",
            "review_score": "1"
        },
        {
            "review_text": "A fun casual game that's quite reminiscent of the labs in Galidor Quest...",
            "review_score": "1"
        },
        {
            "review_text": "A good combination of a stealth-game and bomberman. The difficulty is decent. The built-in achievments help to increase the difficulty for those seeking more challenges. The only downside is the lacking variety of enemies in the campaign. The map-editor and the possibility to play community-created games is a good addition to the 5-6 hour campaign. All in all a solid game. The price is a bit high though. I recommend to wait for a Steam Sale to get this game for a lower price.",
            "review_score": "1"
        },
        {
            "review_text": "It took me about 3 hours to finish this game , pretty short , but definitelty appropriate for its way of playing , annoied if any longer in my perspective . Beyond the story line , you can download maps from in-game community ,which has a good chance to level up its game experience , though I didn't try it . For me , it is not a great game , nor worthy of 9.99 USD. But if you bought it at a lower price and just try to have it for fun in a short period , then it isn't a bad choice. If you are looking for a good game , I don'k think it is the one.",
            "review_score": "-1"
        },
        {
            "review_text": "Darkness, enemies and you. The best thing about this game is that there is never only one method of finishing a map. Even the small arsenal you have gives you many choices and after you complete a map you instantly have the urge to complete it once again, but this time following one of the extra rules. A game with nice mood and medium level of logical challenge.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun little puzzle game. If you buy the Humble Indie Bundle it comes with a steam code for this game and a stand-alone version as well, :-)",
            "review_score": "1"
        }
    ]
}