{
    "app_id": 203510,
    "name": "Fortune Summoners",
    "release_date": "2012-01-30",
    "developer": [
        "Lizsoft"
    ],
    "publisher": [
        "Carpe Fulgur LLC"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Anime",
        "RPG",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 581,
    "negative_ratings": 93,
    "price": 12.99,
    "description": "A massive gameworld to explore with nearly a dozen dungeons to delve into.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/203510/header.jpg?t=1493504179",
    "minimum_requirements": "OS:Windows XP/Vista/7 Processor:Pentium III 1.0GHz Memory:384 MB RAM Graphics:DirectX 8 or higher compatible video card DirectX®:dx80 Hard Drive:250 MB HD space Sound:DirectX 8-compatible sound device",
    "recommended_requirements": "OS:Windows 7 Processor:Pentium IV 2.4GHz Memory:512 MB RAM Graphics:DirectX 8 or higher compatible video card DirectX®:dx90 Hard Drive:250 MB HD space Sound:DirectX 8-compatible sound device",
    "reviews": [
        {
            "review_text": "A light platforming adventure JRPG, it actually borrows some mechancis from fighting-type games, of all places. Enemies dodge basic attack spam, so you often have to find tricks of combos to pin them down. It's occasionally frustrating when you can't get anything working, which other reviewers seem to harp upon, but when you learn how to make everything work, it's a ton of fun, and feels like the real accomplishment for the difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "'Fortune Summoners: Secret of the Elemental Stone' is a sidescrolling action RPG developed by a japanese indie developer Lizsoft and localised by Carpe Fulgur. In this game, you follow the story of a young girl named Arche, who will learn new things, make new friends, and go on a grand adventure in order to reveal the secret behind a certain artifact, along with her hidden powers.  When I saw this game in the Steam Store, it looked interesting and unique, so I bought it. After playing it, I must say that I really loved it. This is in my opinion a one of a kind game, which is a combat-based platformer wih an anime art-style, classical music and action jRPG elements.  The audiovisual presentation is really good. The music is really good, and is a joy to listen to. It is mostly made of classical-style compositions, which are definitely vivid and not generic. The visuals, bearing a 16-bit aesthetic, are gorgous as well. They are colourful are well detailed, characters are pretty well animated. The actual anime artwork of characters in the game is actually really pretty as well. The enviroments are varied, every area looks interesting and unique. You will travel through mountain paths, dungeons, watery caves, medieval cities and more.  The combat system is quite nice. The game is quite challenging, as the foes and level design do not hold back. Enemy AI will make them block, jump, evade and use attacks depending on the situation, just pressing the attack button repetitively without any other action(like with ettins in Hexen 1) will not get you anywhere. A lot of enemies require different tactics to beat them, so use you brain effectively there. There are even a few bosses indluded, be prepared. Over the course of the game, you will have two playable sidekicks added to your party(and a third one, that is passive). You can play as one of the three people in the party, without spoiling anything, one is a powerful short-range attacker, second is a mostly healing mage, and the last one is a mostly offensive mage. Don't worry, they definitely are not plagued by the likes of retail version Daikatana sidekick AI, they will not get blocked by geometry and will follow you without having to babysit them. Just like the enemies, they will do things depending on the situation. If someone in the party is hurt, someone will heal you with a spell, if there's a lot of enemies, they will use powerful attacks, if there's a tough enemy, they will use buff spells, and so on. During the game, you can adjust what the AI is supposed to be doing with just a press of a few hotkeys. You can set their behavior to follow you, stop dead in their tracks or just fight whoever they want without needing to follow you. What kind of magic spells they are allowed to use can be managed too, you can set to not use magic, only heal, use powerful attacks, use buff spells, and burn their magic power as fast as possible. You can also set the camera to be static, dynamic or locked onto an enemy. Arche, the sword using character, relies on not so easy to pull off button combinations to perform attacks, later in the game she learns more combos, making fights easier. Mages generally rely on holding the button and letting go of it to cast a spell, so playing as one of them an letting Arche go berserk could be easier for some people. There is also a quickheal button, status effects are cured before wounds, mind that. Don't forget that during battle, applying items takes longer time.  The game is a metroidvania, therefore it's not a linear platformer where you just hunt the exit. You will go around towns and dungeons, and look and ask people around to ask for clues in order to progress through the plot. The game often involves puzzles, where you push things to solve them. In some cases, the game might get too cryptic, but that's not that much of an issue. You can only save in certain spots, however if you all your characters get K.O.'d you are given the option to restart at the beginning of the last room you were in, or be taken to the last safe area you've been in at the cost of 10% of your money. When a character gets K.O.'d, she can not be used at all. The only way to revive her is to use a special item or return to a safe area, or perhaps find a regenerating spot.  The story, due to involving cute little girls, is somewhat light-hearted, but it is actually interesting and gripping. During the course of the game, some serious business will be going on, especially at the end. The game is quite humorous, some adult jokes are even thrown in, so the story absolutely is not bad. The characters have their distinct personalities, the main protagonists consist of an energetic, brave and spontanous girl, a shy, but kind-hearted girl, and a cynical, easily annoyed, somewhat selfish, yet intelligent and helpful girl, and a cheerful cute animal, who speaks.  You will level up and gain new items as you progress, some of them have unique effects, so make sure to upgrade your characters correctly. The world contains a lot of secret areas and items, look them up, they totally can be helpful! There's also a few sidequests, so after you beat the game you will still have some things to do.  There is also a bonus mode, where you can see the characters autoplay an early portion of the game without your input. Unique, but not very exciting, to be honest. There is also a versus mode, where you can fight against characters from your party(except that you can totally have four of the same character on the battlefield). It is either AI vs. AI, or player vs. AI. Can be 1v1, 2v1 or 2v2. There further you are in the game, the more features that mode has. It is kind of cool. You can have fun with it.  Game does not support Steam Overlay, and can run in a window, fullscreen(with bad resolution for some), and fullscreen with border, making the whole game take place on a square in the middle. However, you can still use F11 to make screenshots, so for that matter you will be fine, check guides on how to inject them into Steam.  In conclusion, this a very great game, that sadly is not very well known. If you like challenging games, anime artstyles and not too serious stories, go for it and buy it, you will be in a treat!",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AMAZING.  The combat is deceptively deep and active for a game with a veneer of a cute and simple action platformer. The amount of finesse the game demends of you in controlling Arche's swordplay is really satisfying to a dedicated player. That said, I can see how the difficulty might turn people away. The party system and the AI for party members is actually impressively responsive and adaptive. Your allies feel like real people, and are not often a source of frustration.  The plot is intriguing, and has an undertone of Magical Girl anime, but not the kind that gets wrapped up in its genre trappings. It really takes care to construct a world and real characters that have a lot of dimension. Again, CarpeFulgur's OUTSTANDING localization shows through.  Highly recommended for action RPG fans, fans of quirky action games, and magical girl fans.",
            "review_score": "1"
        },
        {
            "review_text": "A difficult, technical side-scrolling dungeon crawler with a refreshingly lighthearted tone. Your main character is not a chosen hero on a quest to save the world; she's an adventurous girl who wants to get an elemental stone so she can practice magic with her classmates.  The game's combat seems very strange at first - I immediately noticed that jamming the attack button did not perform any kind of combo; rather I just kept swinging my sword in the same way. To combo, you actually have to use different attacks via directional inputs plus the attack button and chain them together. The fact that each attack differs widely in terms of attack radius, range, and speed means that every attack is useful in some respect, and makes properly performing combos and using them in the right circumstances somewhat of an art.  This is a really cool system that makes even the simplest fights enjoyable, and that's without even considering the enemies and their behaviors.  Enemies are tough. The first slimes I fought posed a challenge, as rather than flopping around at snail-speeds and waiting five seconds before striking, they actually moved quite quickly, performed several types of attacks, and seemed quite adept at jumping to avoid my sloppy strikes. The game does not hold your hand in combat, and rather than coaching you through every aspect, it expects you to pay attention and learn. Yes, this game actually respects your intelligence as a human being - thank heavens for that.  Within half an hour or so, I had learned to be patient while fighting. To block, to dodge, to poke quickly at enemies with fast attacks and retreat, and to counter aerial attacks with well-timed uppercuts. It's quite rewarding to see your efforts to learn the combat system come to fruition, let me tell you.  I haven't played enough of the game to give full impressions just yet, but I'm already having an absolute blast with the combat, and as someone who's rather picky about combat in games, that's saying something.",
            "review_score": "1"
        },
        {
            "review_text": "This needs a sequel so badly!",
            "review_score": "1"
        },
        {
            "review_text": "Fortune Summoners is good fun, but gets repetative rather quickly. I probably would have stopped playing a couple of hours earlier, but I wanted to give it more of a chance. I'll be keeping it installed and intend to come back to it later. I think it's a game that's better played in bursts, rather than a marathon.",
            "review_score": "1"
        },
        {
            "review_text": "This is a terrific game.  With over twenty-five hours of fun and challenge, there's so much you'll enjoy in this game. The story is a very simple one, but it turns out to be very effective and well-written as the game progresses. The dialogue also has a nice mix of things. On one hand, it's very comedic (especially the 'Holy Crackers!' line). On another hand, the characters can show emotion and they develop as well (Arche and Sana FTW). Combat is very fun with two ways to kill an enemy. One can use a sword, and the others can use magic. When you combine these two, you can dish out insane combos that can make battles very hectic. There's also puzzle-solving, and requires your teammates to help you out on certain areas, which is a nice plus in my book. Graphics are surprisingly detailed with fresh anime-styled art well-animated sprites. Music is also a nice joy to listen to. Whether it be the overworld music (second version) or some of the dungeon music, they really fit the area they are and you can easily hum into them should you play this game for some time. As for other things to point out, the game is challenging. It may seem difficult, but luckily, you're free to tone down the difficulty at any time. However, it's best played with the challenge. I do wish it had local co-op though. The CPU friends play very well, but if you have teammates around, it's also nice to at least have that. Then again, you can give them commands which can help in puzzle-solving.  Overall, this game has become one of my favourite JRPGs of all time and is definitely a fun experience from start to finish. Whether you're a fan of JRPGs or the Metroidvania genre, you will enjoy this game a lot.",
            "review_score": "1"
        },
        {
            "review_text": "HOLY CRACKERS is right. The combat is enough to accelerate hair loss. You have to be meticulous and cautious like Demon's Souls (holy ♥♥♥♥, yes, Demon's Souls). On top of that, the controls are as clunky as an old NES game. EVEN ON THE EASY SETTING, THE MONSTERS (Caps Lock is needed) MATRIX DODGE AND COUNTER MOST OF YOUR ATTACKS. I really wish I was recording, dear reader, for this is the first time I've almost seriously died to a level 1 Green Slime. Yes, a Level 1 Green Slime.  The worst, and absolute worst part of this game is it's charm. So ♥♥♥♥♥♥♥ charming  Some sick part of me receives SO MUCH MORE enjoyment of having my intelligence insulted in this than some $6million RPG involving depressed, teenage transsexuals going in a straight line in between cutscenes. Now, if you will excuse me, I just GAME OVER'd (again). I'm going to into the living room and viciously beat my wife and kids.",
            "review_score": "1"
        },
        {
            "review_text": "Still fooling around with the controls, they're plenty fluid alright and a bit complex too. I say it's pretty darn neat though that's not why I'm gonna recommend this game.  Less than 5 minutes in the game they ask you to go to a blacksmith. You can also search through this manly man's shop and find underwear then claim it for your own.  30/10 would steal undies again",
            "review_score": "1"
        },
        {
            "review_text": "Looks like it might be a fun story even if it's slow in it's own ways. My main prroblem is the controls, they make it too difficult to enjoy the game. Add in the fact you're running around trying to figure out how locations works etc at first. It just kind of ruined it for me. Wish the controls handled better truly do.",
            "review_score": "-1"
        },
        {
            "review_text": "I just finished the game, and I have mixed impressions. It is definitely not for everyone and it's hard to say what about this outwardly bland title made it appealing for me. There are MANY annoying aspects to the game. There's no map, and many sections of the maze like dungeons you roam around in look very nearly identical to each other. Enemies spam attacks in ways that are occasionally overwhelming. Status effects...are all evil. There's the constant knockdowns and the poison that won't quit. The sleep that if you're lucky only guarantees you get hit once or twice, and can otherwise disable a character for around thirty seconds. The confusion that will cause Arche to slaughter the rest of the party mercilessly! Fortune Summoners is punishing, but it isn't so unforgiving. In the typical worst case scenario you can restart at the last room transition from the game over screen. Later in the game I would just take the death if an encounter went too sour for me. Gearing up properly and figuring out the right amount of caution to approach a situation with is very helpful, but there are going to be cheap shots constantly regardless of what you do.  Some weird issues with multi-monitor setups. The game will begin to slow down when you have any menu open, it gets slower the longer you run the game. PC Gaming Wiki has a (psuedo) fix for this, but I still started to get slowdown after about two hours in session.   Outside of the combat, the game has a fairly charming goonies/rascal theme going on about it, as you run about becoming a master social engineer, breaking everyone's luggage, stealing people's underwear, commiting genocide and eating various other humanoid creatures ('canned salmon' and 'chicken leg' indeed). Adults are about as negligent as you'd find in any children's story. There's what I'd call a fairly standard RPG level of exploration, mostly hidden nooks and crannies, like you'd find in grandia or some of the older final fantasy games. Some spotty platforming, characters have a lot of momentum in movement and it takes a bit of getting used to. Definitely recommend playing with a controller. Oh and there are a number of clever, simple puzzles, nothing really challenging, but a bit creative.   Fortune Summoners is a competent action RPG, that falls short in several ways. It will challenge, it will frustrate and annoy. Some people find that rewarding I suppose. As a final note, I don't normally like to talk price, but I'm 100% confident there are better games to pick up for $20 or less. If you're curious I suggest you try the demo and if you enjoy that, well, it's bound to go on sale eventually.",
            "review_score": "1"
        },
        {
            "review_text": "Three little girls engage in the adventure of their lives in one of the most gorgeous action RPGs made in Japan. Beautiful graphics, awesome music, gameplay mechanics that are easy to learn and, perhaps more importantly, a party AI that actually does its best to help you rather than standing there doing barely anything or becoming easily distracted by the first thing it sees, make this game fun and absorbing for its entire length. A must have for lovers of action RPGs and simple, yet heartwarming stories.",
            "review_score": "1"
        },
        {
            "review_text": "I'm very glad I bought it, the beginning is a little hard to get used to the gameplay, but after becomes very simple, good story, very attractive background music, cool art, for those who do not mind of good and old 2D, is a great choice",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever wanted to know what it feels like to be an amputee trying to solve a Rubik's Cube while also being short sighted, then I've found a pretty great game for you. Abysmal controls that even Indiana Jones couldn't solve and graphics options so minimal it makes Saints Row 2 look like a masterful port. One guy compared it to Dark Souls in terms of difficultly.  DARK SOULS.  HARD.  HAHAHAHAHAHA.  Basically this game is terrible.  I played five hours forever ago and basically all I remember is walking back and forth from school. I can do that in real life except people won't lie to me and say that's a good story.",
            "review_score": "-1"
        },
        {
            "review_text": "The controls stop this game from being playable. Its entirely too floaty. Cant say much about the story as I could make it half an hour without running into a bug that didnt allow me to draw my sword, which means I couldnt fight.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me be clear, I had a lot of fun witht his game, but I started it up recently and it is literally unplayable. The framerate is capped at around 7 and I can't draw my sword. As you can see I've put 8 hours into this game and it's sad to see this happen. The difference between now and then is that I've gotten a BETTER computer? I don't know how the game runs worse now that my computer quality has gone up. Sorry but I can't reccomend a game I can't play.",
            "review_score": "-1"
        },
        {
            "review_text": "An incredibly cute and fun side scrolling RPG. The music, the art style the combat, the adorable characters.... there is not much to love about this game, even if it is a little cliche. The dialogue is reminiscant of Visual Novels and feels very much like an anime I would have watched when I was younger. While the plot may not be the most unique that does not mean it is poorly written; in fact I kind of like it more for that reason. Not to mention little Arche is just so cute! xD  I sincerely hope to see more games like this come out. ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, Except for it's one *major* flaw* - It's so old that modern hardware (HDMI) can't run it except at less than 11 FPS. I've tried various methods to get around this and it just won't work; I get maybe 10 FPS in town, and if I'm lucky 6 FPS in dungeons/caves. Needless to say such a handicap means only die-hard fans will be able to deal with the choppy graphics...Really too bad, I miss this kinda cutesy dungeon-crawler/action game. Plus it's 2d Anime-Style Graphics to begin with...but even Anime-inducing games usually get atleast 20+ FPS by comparison. Still I gave it a thumbs up because of it's charm, but no I'm not likely to recommend it if your using a 'Modern' PC (I Realize Some of us still have ancient hardware so it's not fair to judge it by FPS alone)  Edit: * - Upon Further Testing it seems this flaw only applies to Full Screen and Zoomed Modes, Windowed Mode i get over 120 FPS.",
            "review_score": "1"
        },
        {
            "review_text": "Poor controller support, enemies are walls of HP, frequent laggy load lines, controls just feel wrong.",
            "review_score": "-1"
        },
        {
            "review_text": "holy crap this game sucks the controls are so bad that I think they were designed an idiot do not buy this game there is nothing about it that can redeem just how bad it is. I think just about any other game is better then this pile of ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "I really enjoyed the Demo of this game, and so I purchased it. Had to replay the beginning that I played in the demo which was ok. What I found however, is that the difficulty ramps up to a crazy degree after the demo part of the game. The ramp up was frustrating with no ease into it, and that made me no longer want to play it. Some people might still enjoy it, and had it ramped up more slowly, I may have as well.",
            "review_score": "-1"
        },
        {
            "review_text": "Fortune Summoners is a 2D side scrolling Action RPG with anime-style graphics. The plot is pretty interesting and filled with hilarious scenes. The personalities of each characters are very well-defined and I love all of them. The art style is beautiful, the artist has my kudos. If you want to beat the game and get most of the extra stuff, this game will entertain for a good 30-40 hours and the difficulty level is pretty challenging even of easy. The only few things that made me frown in this game are the game resolution and the monster AI. The game can run in windowed mode on 640x480 resolution which is incredibily small and can't be changed or in full screen zoomed / not zoomed (zoomed is a fix for widescreen displays).The main problem here is that the steam overlay doesn't work in game so I have to run it windowed and it would be nice to have a bigger windowed resolution. The monster AI is kind of broken. Some monsters are incredibily hard to hit (especially flying monsters).",
            "review_score": "1"
        },
        {
            "review_text": "I've been looking for good platformer RPG's / Metroidvanias for a while and this one delivers perfectly. I love the combat, it is quite challenging to master. The writing is pretty good, and it's all family friendly, but the gameplay is definitely designed for experienced gamers.   The main downside is the primitive engine. There is a lot of sporadic lag even on my high-end gaming pc which seems to progressively increase the longer I leave the game open. Also the game crashes sometimes if I switch to a different application and then try to switch back to the game, which can lose me a lot of progress if I am deep in a dungeon where there are no save points or fast travel.  If they made a sequel/successor I would definitely purchase it.",
            "review_score": "1"
        },
        {
            "review_text": "A timeless tale of a girl and her taiyaki. The struggles and hardships the protagonist faces challenges all of us as humans seeking for a better tomorrow. And more taiyaki. The only truth in the end, however, is that humans will never escape the vicious cycle of struggles and hardships, as Fortune Summoners 2 doesn't seem to be a thing.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game. Its not a super game but if you like a good plataform game than you can buy this game and have fun. =3",
            "review_score": "1"
        },
        {
            "review_text": "Vary fun game, not too easy but not too chllenging ether, my only complaint is there is no map whatsoever",
            "review_score": "1"
        },
        {
            "review_text": "The game so far, even with hard to master game mechanics and button combos, is very fun and entertaining! The characters are well developed and really adorable.  However, the issue stands as to why they never put the deluxe edition VA in.",
            "review_score": "1"
        },
        {
            "review_text": "I played this because I got this from Carpe Fulgur Collection. I haven't heard this game before so I did not have any expectation. After playing, I would totally recommend this to everyone!  I heard that the developer is not developing game anymore. Too bad because I want a sequel.. :(",
            "review_score": "1"
        },
        {
            "review_text": "It's cutesy and I enjoy it but sometimes regress to pressing old buttons D:",
            "review_score": "1"
        },
        {
            "review_text": "underwear thieving simulator with cute little girls instead of pedophillic basement dwellers sweet",
            "review_score": "1"
        },
        {
            "review_text": "I've only played this for a little bit so far, but there is some very strange English and no 1080 option.   However, it's also a cute game that seems very enjoyable and I want to see how things turn out. For it's price, it's a pretty damn good rent. I'd love to be able to buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Kids go to school with a school bus, or their parents might be the one who escort them daily to the care of their teachers. Not in this game. You will play as a cute little school girl, and since she is still in school, she will need to go to school, on foot, through roads infested with monsters. Surprisingly the adults consider this as normal.  Whack away with your sword through various type of enemies with different attack patterns in this gorgeous 2D world. Nice soundtrack and solid storyline will accompany you throughout your journey.  Give it a try. This game is definitely one of the best among its genre.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is enjoyable and the story/atmosphere are on the silly side.   4 difficulty options.  The combat is very unique in this game, its about timing attacks and avoiding the monsters abilities. The difficulty continues to spike as you progress the game and because of this, it adds more depth on how you ready yourself before each dungeon.   If you enjoy a learning curve in a game, this is perfect. If you enjoy adorable storylines, this is also perfect.",
            "review_score": "1"
        },
        {
            "review_text": "UTTERLY FANTASTIC.  Castlevannia/2d fighting game/adorable= I quote 'Holy Cowbells!'",
            "review_score": "1"
        },
        {
            "review_text": "This game is more than it appears. It has the general flow of a story-driven platformer, but with a battle system comparable to a medium-depth fighting game and the speed of Devil May Cry! The fights often have more strategy and complexity to them then a simple hack-n-slash. Although the story is cliche and kiddish, the gameplay is serious. Even though it is a bit short, it's worth getting if you see it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "A platformer action RPG with good dialogue, useful allies and sword combat that works like a 2D Zelda. Expect some menu funnies if you are using an xbox controller however.",
            "review_score": "1"
        },
        {
            "review_text": "Hidden gem imo - Definitely for 'Moe' anime inspired fans. I found the controls perfect on a gamepad, I don't see how you could play any other way. The combat is something you really have to be semi-tactical about. You can't just rush in there and expect to kill everything. A little patience with the combat system will go a long way and by no means am I implying that the combat is slow! This is definitly an ARPG and prepare yourself for a challenge, a tiny bit of grind leveling for the challenges (Which isn't much at all, just kill everything you see) and super cute story.   I only wish the original developer made an expansion. You should know that this entire game was almost made by one person.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun little side-scrolling RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Good story, about 'SUPPARKAWAII' cute little girls. Now without lolicon.",
            "review_score": "1"
        },
        {
            "review_text": "The combat system works like in fighting games, so use a controller and set the walk/run to use analog sticks, otherwise it's a bit clunky. Too much backtracking and sometiems you've gotta talk to some random unimportant NPCs... Aside from those flaws I loved it! The style is silly, the jokes are pretty funny and the combat is just really fun once you get used to it. I sunk 30 hours into this game, so I think it's well worth the money. :)",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this game surprised me. Being a big fan of the 2d platformer, this 2d dungeon crawling jrpg hit me right where it counts: and has a unique girly flavor that you might not think is a good thing, but one that i love so much. Its also fun to just incinerate everything with Stella. Please get this game.",
            "review_score": "1"
        },
        {
            "review_text": "If Michael Jackson could be a little girl in South Park, I can be one in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fortune Summoners is an oldie-RPG-arcade-style game where... you know, where you find the key of a locked dungeon lying around in your own house! Recommend 7/10  The game is quite difficult. I died so many times in the game, maybe over 300 times. Leveling up makes things so much easier, and so the 'level cap' feature really makes this game worthwhile (don't wanna let you get lvl 20 and squish all the enemies).  The story is light and funny due to the character skits. Not much story to tell, but the setting makes the game presentable. Nice music, graphics are drawn pleasantly drawn. It's interesting to see/hear that all the incantations are in Engrish... FAIYA WOORU!!",
            "review_score": "1"
        },
        {
            "review_text": "It is a very beautiful and lovely game... but I have to solve the problem to reproduce it in a more fluent way.",
            "review_score": "1"
        },
        {
            "review_text": "- Unsatisfying and clunky controls - Crappy display setting - Intolerable slowdown (Seems like memory leaks. But guest what? You can't save and load everywhere you want to, so suck it up until the next save point punk!)  It's sad because the side scrolling action/rpg gameplay is really interesting but those flaw make it too frustrating to play.",
            "review_score": "-1"
        },
        {
            "review_text": "My TL:DR review of Fortune Summoners: Take Dark Souls 1 and Dark Souls 2 and mash them together into an action oriented side-scrolling quasi-JRPG and you get Fortune Summoners.  Now for the actual review of the game:  I just finished beating Fortune Summoners, an action packed side-scrolling adventure game staring Arche, a young girl with a dream. I have to say that I really appreciate the attention to detail that Lizsoft went into making this an enjoyable game. It’s got everything you’d think it should have and brings back memories a-la Magic Sword, Willow, and other exciting Capcom classics.  The voice acting is done in Japanese, but doesn’t take away from the experience. The sounds are cute, and the music is pleasant, but does get repetitive after hearing the same battle song over and over. The story is charming and I found myself excitedly loading the game just to experience the next little nugget of story in cute Arche’s life. As a new father myself, I simply adored Arche, Sana, and Stella. Though I wouldn’t have the same measure of restraint when it comes to Arche’s parents, I definitely played the game attempting to see it through my own daughter’s eyes.  Would I recommend this game? Absolutely. It’s inexpensive, fun, and challenging. The story and art style are worth it and it’s a break from the “norm” that most modern games offer us. Like I said before, a lot of thought went into the planning of the various cities, quests, and objectives.   However, there are some glaring problems with Fortune Summoners. Rather than spend too much time with them in paragraph format, I will list them and then expand on just a few to be more clear.  Pros: -Excellent ‘genre’ graphics -Fun and engaging story -Good sense of humor maintained throughout the game -Levels are well designed, puzzles are polished and cool -Has controller support -Interesting “bonus” modes and alternate (New Game+) material  Cons: -Horrifically painful controls* -Dastardly deviously difficult** -Somewhat repetitive and annoying music (only in battles though) -A lot of grinding***  Okay so let’s talk about the controls first. I played the game with my gamepad (the one you can use on your Xbox/PC, etc) and it worked well. The problem I had is that the controls are a bit “sticky” if that makes sense. I’d press a button and not always would I feel like the character was responding with the same efficiency it should. The controls weren’t bad in that they weren’t intuitive, they were bad because they just felt…sluggish, slow, and sticky.  Now let’s talk about the grinding. This is not much of a con to some people, but to me it was a bit annoying. Like most good quasi-RPGs, the game offers experience points that allow your characters to level, and money that provide them with a way to buy goods and services. In Fortune Summoners, the weapons and armor are expensive. Not just pricey, but downright EXPENSIVE. Like I remember a cape costing like 12,000g and to put things in perspective, one monster might drop 10g. To be fair, later on in the game, the monsters are dropping around 100-200g per kill, so you can quickly farm them to get a few thousand. The problem is there are three main girls and each girl requires you to equip her with the best stuff (trust me, the difficulty rant will explain more) and that means that you’ll have to come up with 36,000g for your three girls for ONE slot. Then you’ve got weapons, armors, and accessories. Obviously you can find these things in dungeons (as well as chests that have money) but you get the idea. It’s grind worthy. Levels aren’t so bad, as you can get those fairly quickly just progressing through the content.  Ok, finally, the difficulty. When you first play the game, it puts you in charge of one of the three characters. Either you play as Arche (swords), Sana (healing &amp; support magic), or Stella (fire magic DPS). The problem is that, this game does not screw around. Regular level 1 snakes will give you a hard time. If you like to button mash, you will die. If you don’t block, you will die. If you don’t pay attention, you will die. Eventually, when you have all three girls you will play as whoever you want (cycling through them at will) and you will see the computer take control of your other two girls and play them MASTERFULLY. No matter how good you think you are at video games, this game will test your patience. More than once I wanted to throw my controller across the room. I had to get up, take a deep breath, and sit back down and try again. Nothing really “bad” happens when you die, you are given the option to start again or re-start in town for a hit to your gold (see above) so most people would just opt to try again with no penalty.  But I think the reason the difficulty bothers me so much is that I attempted playing the game on the “normal” setting for the first few dungeons. Around level 8 or so, I realized that this game was a bit too hardcore for me, and I toned it down to Easy. I felt ashamed, but I wanted to enjoy the story. EVEN on easy, the enemies made me quick work of me over and over. I’m not joking, either. See if you can find a gameplay video of some of the combat for an example. In fact, the first time I fought a kobold as Arche, I thought it was a BOSS for how well it fought. Blocking, jumping, stabbing, flipping around, dodging every attack, counter attacking like a menace. I was dumbfounded. Luckily, magic does make things easier, so you’ll enjoy Sana and Stella’s company. Especially when Stella gets Chaser 2. Too bad it’s right near the end of the game.  So at the end of the day, do I recommend Fortune Summoners? Sure, I would, actually. Despite the difficulty I thought it was a cute and amusing game well worth the price and definitely kept my attention from start to finish. Just be wary of the difficulty. And the harpies. Oh god, the harpies. ",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big fan of all my Carpe Fulgur games, but they do come at the cost of very bad keyboard controls, and very spotty game pad support. So although I recommend this game, I would download the demo to make sure you can handle the quirks before purchasing. Basically none of the gamepads I tried worked, I can't play it in a zoomed window because I'm a pleb with a 1600x900 monitor, and I had to download a shady third-party patch to get fullscreen to run over 4 fps.  Once you've completed the dark ritual necessary to get the game stable enough to function and have attuned your mind to the hideous keyboard controls, the game is very good.  It's one of those classic action rpgs that Japan used to be so ♥♥♥♥ing good at making. You go through dungeons, find items, kill bosses, learn new attacks that actually change the way you fight significantly, all that good ♥♥♥♥. I really like the way things are laid out, I feel like grinding for enough gold to buy upgrades and simply getting better at fighting are equally viable ways to progress, which is nice. I have never been FORCED to upgrade my equipment, it's felt very natural. The combat feels very clunky at first, but after a few hours of practice, it becomes kind of an art form with a very high (but accessible) skill cap.  At a few points, I've outpaced the game and had to fight enemies that would be trivial if only I had the ability that I get next level. Those points in the game are few, but they all seem to be at the start of the game unfortunately. It'll sound like ♥♥♥♥♥♥♥t when I tell you, 'the game gets WAY better after the first 6-7 hours'. but that is actually true. It takes a LOOOOOONNNGGGG time before you have the full party and actually feel like things are going your way.  If you're ready to sit down and really sink a lot of time into a game about little girls defeating monsters with glitter magic, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "It's a tough game, so if you like games that are easy to beat, you should avoid it. However the storyline (at least what I've seen of it so far) is rather cute and enjoyable.",
            "review_score": "1"
        }
    ]
}