{
    "app_id": 203830,
    "name": "The Dark Eye: Chains of Satinav",
    "release_date": "2012-06-22",
    "developer": [
        "Daedalic Entertainment"
    ],
    "publisher": [
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Fantasy"
    ],
    "achievements": 36,
    "positive_ratings": 1279,
    "negative_ratings": 199,
    "price": 26.99,
    "description": "Face your Destiny!In Andergast, whose inhabitants are considered to be notoriously superstitious, King Efferdan awaits a state visit from high-ranking dignitaries. For centuries the kingdom has been at odds with neighboring Nostria, but now first steps are being undertaken toward a lasting peace.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/203830/header.jpg?t=1524045417",
    "minimum_requirements": "OS: Windows VISTA/7TM                 Processor: 2.5 GHz Single-Core-Processor or 2 GHz Dual-Core-Processor                 Memory: 2 GB                 Hard Disk Space:  6 GB                              Video Card: OpenGL2.0-compatible Graphic Card with 512 MB RAM (Shared-Memory is not recommended)                 DirectX®: 9.0c                 Sound: DirectX9.0c-compatible Sound Card                 Additional: Broadband Internet Connection, Mouse (third mouse button and Scroll-wheel recommended)",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game is well above average for the point-and-click genre of games. It, like the sequel, weaves a beautiful story with beautiful artwork and music, and is well worth picking up ('Memoria' is the sequel and is also available on Steam). Like all of this genre, there are some things to figure out which aren't necessarily intuitive, which can be frustrating. This is no worse than any similar game, however, and didn't detract from my enjoyment of the game.  The interface and inventory are very easy to use, which is much appreciated in a land of complicated inventory management and skill systems and perplexing (at best) UIs. For this genre, less is more in terms of making a player jump through hoops to work the interface. This game does just fine at that.  I've heard others say that the story isn't anything unique, but as I've never run into a story quite like this before, I'll politely disagree. There are some of the usual fantasy game tropes, but the overall story felt brand new to me. At least personally, I felt it was a beautiful story with some parts that were heartbreaking (caveat: I am a softie, so I might be more emotionally invested in the story than some are!).  The characters were all nicely handled; I especially loved Nuri's simple naivete, which the writers made work nicely by not confusing simplicity with stupidity. She is not stupid, even when her innocence about the 'human' world gets her into trouble, and even when her inclination towards trusting everyone works against her. 'Your humans are angry with me, Geron!' she says after opening the cages of a town's entire animal population. Her bafflement is endearing.  The artistry of the scenery and backgrounds is what really impressed me through both of my plays through. The attention to detail and sheer beauty of some of the backdrop scenes really showed hard work on the part of the illustrators, and I respect that. I have some screenshots uploaded from this game just because there were parts I went full-on tourist with the camera.  TL;DR: one of my very favorite games of the genre, beautifully done in terms of character, art, and music, and well worth picking up, along with the sequel, Memoria.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful adventure.   The strongest elements to me are the gorgeous art, nice music and great voice acting. Nuri and Geron in particular are two wonderful characters. Their voice actors sound so nice, soothing, believable and powerful. They can be cute, funny, heartwearming, sad. It's just a joy listening to them or to be there to witness and kinda share their pain. I don't know if I had ever heard emotions projected so well only through voice between two characters. I'd love to hear them in a third The Dark Eye game, and I think it must be these two doing it close together because I am hearing them in another game, the 'Game of Thrones' RPG, in more isolated roles but they just won't strike me there as much. Perhaps it's their skills and the script working magic here in combination - it looks like they were given a nice amount of freedom, or at the very least it sounds as if they were wholeheartedly enjoying their roles.   The puzzling is less diverse than in Memoria (= the sequel) but still fine in it's own, traditional right as far as I can tell. I'd say it's of the easier (not easiest, but average) kind as you won't always have dozens of items to handle and the solutions aren't as absurd as they can be for example in Deponia. You can have points of interest in the world highlighted by the press of a button, and there is a combination helper that has item labels showing up in either blue or white color depending on whether you can still do something with them or not. This mechanic was dropped in Memoria it seems, maybe because randomly using the little to average numbers of items you have works just quicker than memorizing this color coding.  The only flaws of this game I came to notice are some technical hiccups; between actions there can be very brief 'freezes' which didn't annoy me but which I heard one or another player complain about on the hub. This is nothing to lament over too much I believe though because there are no real-time action scenes that would require you to have everything work totally fluently.   Which is a bit unfortunate is that, like in Memoria, audio and text will not always align, at least not when playing in English. Some lines in certain scenes may appear in text or audio which simply don't belong there but to previous ones, or one or another sentence wasn't translated properly from German (the native language of the devs) to English. This doesn't happen brutally often, but it does on some occasions and you'll notice.  What works better here than in Memoria is the the journey/adventure log, which is a relatively simply book with a short text what had happened and what you are about to do, roughly, with a world map indicating where you are (roughly as well - not that it would matter much because the game has you go through specific locations, you won't be travelling around the world by your own merit).  Also, the ending felt a little rushed; beautiful and fitting in some ways, but I was surprised it came as quickly as it did, and there isn't much of an epilogue either, which would have left me 'unsaturated' if not for the fact that there is already a sequel which properly continues and somewhat ends what was started in Chains of Satinav.",
            "review_score": "1"
        },
        {
            "review_text": "I finished the game in a little over 12 hours, but it was so worth it. Good job, guys. You made me cry. :) I look forward to future game releases from you.",
            "review_score": "1"
        },
        {
            "review_text": "First off, I want to call this game out on it's anti-corvid bias. But wow, I started out this game thinking it was a banal medieval adventure game, but it grew into something far greater. I loved the lore, the stunning artwork, and fell in love with Geron (though he constantly berated all the decisions I made for him, his voice is like chocolate.) After playing Rufus in four consecutive Deponia games, it was nice to have a sympathic protaganist. I also really liked Nuri and her voice, even though she basically could have been swapped out with a 6 year old. I liked the choice to make her look very human, and there were times when I questioned whether she really was a fairy.  I played on hard mode and the puzzles started out deceptively easy. Then I found myself in a fantastic and terrifying realm where the rules didn't apply, and things quickly grew very difficult. The artwork in this realm was very evocative of Hieronymous Bosch, both beautiful and deeply disturbing.  Also the Fairy Scholar is basically David Bowie, so yeah, get this game.  ",
            "review_score": "1"
        },
        {
            "review_text": " 10/10 - This is just a beautiful game.",
            "review_score": "1"
        },
        {
            "review_text": "A click to play game which is told in artistic rendered backgrounds and black/beige colored painted video clips. This game has many interesting puzzles to solve and characters to discover. To find out about what you have to do or how to progress you have to either talk to people or find and make use of the itms which are located nearby, some of them have to be fusioned together.  This game has a beautiful and exciting story. I wont spoil about, you better discover it for yourself.  That beeing said i still must note i got this game on a recent Steam sale for 0,99 Euros it was very cheap and of course i did not regret the buy.  Generally i can recommend this game, especially when it is on sale. I cant say if the price matches the game, personally i would have not spent 20 € on it but i think its surely worth 10 €. What i miss in this game are better animations like when your characters walk or speak. Also some places for example close to rivers could show more motion like the waterflow or probably the wind blowing through grashalms would have justified the pricetag of 20€ way more.  The replay value is none existant if it comes to gameplay but rather when you forgot about the story and want to discover it again in the future. The voiceovers of the game as well as the sounds are well done and contribute to the exciting story. Personaly i have fallen in love with the main characters Geran, Nuri and the Raven i think you will too. ",
            "review_score": "1"
        },
        {
            "review_text": "  The Dark Eye: Chains of Satinav  - An unpolished gem that ought to suit most adventure enthusiasts",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game and would recommend it to fans of point + click adventure games. It's not going to take a spot on my top 3 list or anything (that would be Toonstruck, The Longest Journey and The Book of Unwritten Tales), but the story is definitely worth a playthrough. Just don't go in expecting Monkey Island style humour - it reminded me more of a good German told fairy tale.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful piece of literature  It was really a magical experience.  Voice acting was meh, the writing sometimes felt lacking, it is a typical 'from zero to hero, save the world' facade. Characters were so-so which were sometimes lovely (esp. Nuri).  it has considerable flaws but it delivered a WONDERFUL STORY The EXPERIENCE is nothing short of MAGICAL.   Its pieces were individually lackluster but if you put them all together they become brilliant. 'The whole is greater than the sum of its parts'   I advise to play memoria, its sequel. for another ride",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about this game...  Well, firstly let’s start with the most obvious IT'S BLOODY GORGIOUS!! This game has some of the best 'hand drawn' art work going. Secondly, the story...as with a lot of point'n'click adventure games, it has a very tongue in cheek clichéd approach to its story but my word it pulls it off very well. It has been many a year that I have actually sat at work, watching the second’s tick away waiting to get home just to play more of a game. Thirdly, some of the puzzles are actual brain ticklers. I have played a lot of these adventure games over the years and for a while now, it was almost like I was just going through the motions...you know 'I have a fish, I have some water, I have some beans...I bet I need to cook something with these...oh look there is a pot over there...let’s put these in and cook something'. Yes this game does have some very basic puzzles but as mentioned before, it also has some right pain in the ♥♥♥♥ ones that actually make you sit back and have to think 'hang on...how the f**k am I supposed to do this...'  *Cons* There are a few glitches here and there.  Some of the voice acting is a bit hit and miss.  Also a lot of the NPC's are quite forgettable (not all though)  Final Thoughts: If you like Point'n'Click adventure games, then add this one to your library ASAP! Also add memoria (the sequel to this one)  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Finished in about 6 hours. Good adventure game if you remember the days of point and click. Amazing art style and good voice acting make it something to remember playing. Over all not as complicated as the old gems like Kings Quest but there were a few brain teasers which made it a moderate challange. I really enjoyed it!",
            "review_score": "1"
        },
        {
            "review_text": "A gorgeous point&amp;click adventure game.  The art is wonderful. Voice acting, Music, Characters and Story are all good (even though a main character is bizarrely insane). Interface is ok. Puzzle are as you expect from a classic adventure game.  I got stuck on a game breaking bug at the troll cave drummer: a big shame. I still enjoyed what I played.   This is for adventure gamers. Get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful art, decent voice acting, haunting soundtrack and the occasional head scratcher of a puzzle but overall a solid experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game has some weak moments in the middle of the game (made me pause it for a few weeks), but the beginning and end of the game is just awesome.",
            "review_score": "1"
        },
        {
            "review_text": "A quite excellent adventure game with a much darker bent to the story than most mainline point-and-clicks. It fit well in the TDE universe and made for a refreshing change of pace. The puzzles felt natural and well done, not too hard nor too easy, and not illogical. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great story and characters and good art... literally the only bad thing is the Seer's voice actor. everyone else's voices are fine, why is just the Seer so bad??",
            "review_score": "1"
        },
        {
            "review_text": "pros  - gorgeously hand-drawn background artwork. cut scenes also so stylish and well made.  - immersive dark fantasy atmosphere  - likeable characters. i like to play with down to earth and humble Geron, naive and innocent Nuri  - it s an long game.  cons  - i found plot too convoluted to fully understand. i actually like dark fantasy stories. there are many fantasy elements such as fairies, magicians, a seer, dwars in game's plot and i should been fully interested and enjoyed with the plot but somewhat i couldn't get into story. i don't know anything about the lore behind the story maybe that's why i didn't understand what s going on and story didn't grab me.  - i think ending is rushed and weak.  - some puzzle solutions so obscure. i had to look a walkthrough sometimes and i don't feel bad about it.  - voiceovers are hit or miss but it didn't bother me too much.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful artwork, nice storyline. Can't wait to play Memoria after this.",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought this was a pretty generic game, not going to lie. I am familiar with the universe from other titles though and love adventure games... Somewhere about 8 hours in I was completely emersed in this a wonderful underdogs story and loved the games dark and menacing atmosphere. It had me hooked all the way to end and becuase the sequel is even better IMHO you MUST play this game....",
            "review_score": "1"
        },
        {
            "review_text": "It was good.",
            "review_score": "1"
        },
        {
            "review_text": "A dark and thrilling tale of a young man named Geron travelling across the realm in hopes of reverting the dark prophecy bestowed on his land. He's no hero though, and everyone blames him for being the herald of doom which is obviously not encouraging at all, his journey neither easy nor glorious. As for the gameplay, it's not the most challenging quest out there, but at the same time the game never gives you clear hints to your actions so you have to pay attention. The storyline is really charming and has a strong 'dark European medieval fantasy' feel to it (well, I suppose it's only natural, considering the Dark Eye setting), and the backdrops are breathtakingly beatiful, each scene working towards creating memorable atmosphere of the whole game. Voice acting was better than I've expected, but it's no Deponia. Overall, I'd recommend spending some time on this game even if you're not too keen on point-and-click adventures. It's an enjoyable experience similar to reading a good book.",
            "review_score": "1"
        },
        {
            "review_text": "i have an experience in point and click, and i think this game is totally awesome..",
            "review_score": "1"
        },
        {
            "review_text": "The Art Style Caught Me first on this game , and now i am 2 hours in and it has to be one of the greatest point and click adventures i have ever played !   I wont spoil the plot or story but its breathtaking let alone the character voice overs are perfect and it really brings this game to life let alone scenery in this game is beautiful.. The puzzles are challenging enough just aswell . I would advise to get this game if you are a fan of the whole point and click adventures ,,   for me 9.5/10 , i cant give it a full 10 yet cause i havent finished it",
            "review_score": "1"
        },
        {
            "review_text": "Great point &amp; click adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "Good game if you like old school point and click adventures.",
            "review_score": "1"
        },
        {
            "review_text": "Very badly optimized and jittery on the technical side, but a great adventure nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: The artwork is very charming. The two spells provide an interesting, but ultimately underutilized device.  Cons: For a game of this genre, there needs to be either some challenge/innovation in the puzzle solving, or some degree of user determination (or otherwise deep investment) in the narrative's course. Simply put, either the mechanisms by which the narrative is unlocked piece by piece need to be entertaining and satisfying, or the decisions that move the narrative forward need to be engaging. Ideally, both.   In this instance, the plot plods on deterministically with zero input from the player as to how relationships develop, characters grow, and moral decisions are made. Which may be due to a total lack of meaningful relationships, character growth, or moral decisions in the narrative. This is a shame, as there was ample opportunity for meaningful choices to be made that were passed up instead for rather trite and forced outcomes. As to the 'puzzles', there was always one solution, and it almost always veered between extremes of either being blatantly easy or almost completely unintuitive. Frequently I found myself clicking things into place with no real concept of what the intended outcome was supposed to be until it happened.",
            "review_score": "-1"
        },
        {
            "review_text": "The game started off good but then became so hard to play and solve the puzzles that i had to have a Walkthrough kept open all the time to play it. The same happened to me when i played Deponi.It is not possible to play it without walkthough which takes away all the fun of playing it. Its a No to Dark Eye and NO to Diadelic entertainment.  Diadelic entertainment needs to reconsider their difficulty ratings of the games.",
            "review_score": "-1"
        },
        {
            "review_text": "Meh. Voice acting is good but animation is poor. Interface is not intuitive. Story was only ok. I guess its hard to find a good point and click because they aren't uber popular and hence are low budget. Skip this one unless you reeeeeeeally love point and click. As you can see it gets good reviews somehow so maybe it's me.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate games where you have to stop in the middle of them. That was the case for this one. Great story, great concept, nice interesting plot, fun adventure... but it had immorality to a degree I quit mid game.  Hope the sequal will be different in that regard.",
            "review_score": "-1"
        },
        {
            "review_text": "terrible first impression.. no recommendation",
            "review_score": "-1"
        },
        {
            "review_text": "Was not what I expected. I was looking for an RPG like the old fashion paper and pen stuff like D&amp;D. I played a long time back the dark eye like that and was hoping for the same type of feeling from playing. Did not do it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Rich story and interesting characters in this quest-game impress any expert gamer.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics, compelling story, and interesting characters - this game is a must play for those who enjoy the adventure genre!",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting game! Amazing mysterious plot, unusual graphics, recommend both parts of this game!",
            "review_score": "1"
        },
        {
            "review_text": "This is a nice point-and-click-game. The artwork is just great, and so is the story. I loved the characters, the concept is awesome, but I think the voice of Geron could be better. Nuri was a perfect character, and fits good in the storyline. There are some puzzles in which do not make much sense, but it's entertaining. This the kind of game to play on a quiet evening with a drink.",
            "review_score": "1"
        },
        {
            "review_text": "It's been a long time since I've played a point and click adventure game and was pleased with this game. Most puzzles weren't too difficult, but a few near the end I probably never would have figured out on my own. It's a short game, but that's ok because there's no need to drag it out. I'm going to start Memoria now and I hope that it's as good as this game.",
            "review_score": "1"
        },
        {
            "review_text": "I do recommend this game for those who love point-and-click adventure games, but with some BIG caveats. First off, most of the voice acting really is not very good. The lead character's voice is very monotone, droll, and sounds like he just woke up. Some of the secondary characters are done well, however. Also, some of the puzzles are really, really obscure. This game will probably be good for those who are vey experienced with adventure games, but I would not recommend this to newcomers because of the frustration that some of the puzzles will cause.  The biggest issue for me is the ending. That's not to say that I'm dissatisfied with the final conclusion, but the ending sequence was literally as brief as '... the bad guy was defeated, and the hero went back to his home.' Wait, what? I can't say anything else without spoilers; but for all of the questions that were created, you get no resolution and no explanation. You get a brief statement of what happened (literally just two scenes) and the game ends. Maybe some of those questions get answered in the sequel ('Memoria'), but as a standalone game I cannot express how disappointed I am in how the endgame story played out.  Still, I have a soft spot for hand-drawn graphics, which make the entirely of the game. Most of the world is colorful and vibrant; and those areas that are bleak are indeed grey and miserable. The art in this game is nothing short of gorgeous, and some of the unlocked videos show how some of the backgrounds were drawn, giving you a new appreciation for how much work goes into the art direction of the game.   So, if you really like point-and-click adventures, this is worth your time. Just don't expect too much of an ending and don't expect a lot of humor. 'Chains of Satinav' is a very dark game. If you are looking for humor, the 'Deponia' games, also from Daedalic, are a much better choice.",
            "review_score": "1"
        },
        {
            "review_text": "I give this a 7 out of 10.  The art style is pretty distinctive and makes the game stand out from other adventure titles. I personally liked it, though I'd imagine it's not for everyone. I do wish the animations during the chat scenes were a little less stilted. All of the lines in the game have voice acting, which is a nice touch. The majority of the voice acting is decent, though some of them sounded like they didn't want to bother with it. The puzzles start out in a very logical fashion and can be figured out easily enough just by following the clues the game gives you if you pay attention to what's being said and what's going on around you. Unfortunately, in my opinion that changes part way through the game, roughly about the time you enter the fishing town. Suddenly you'll find yourself wandering back and forth repeatedly between the same few screens over and over frustratedly clicking everything in your inventory and speaking to the same characters for a thousand times to get that one oddball thing you missed. This seems to build up to an incredible degree near the end of the game with what I found to frankly be the most bizarre puzzle solutions ever.   The spot near the end where you put the wizard hat upside down in the chandelier and dump a decanter full of wine into it...I was shouting 'WHY WOULD YOU DO THIS???' at the screen. It only sort of makes sense after you're already through the end of that puzzle, but come on, really?   When you reach the final 'level', things get a little more straight forward again, but that's mostly due to the fact that you have almost no inventory and there's not a lot of things that are clickable or screens to move between. In spite of this, I'd still say to give this a play through. The story made it worthwhile in the end and I'm looking forward to giving the sequel, Memoria, a try.",
            "review_score": "1"
        },
        {
            "review_text": "A heart-wrenching story aboud a nobody man and a lovely girl on their runaway adventure. They could see ton of beautifull scenes and listen to tons of atmosphere music, while using their wit(mostly the man) to overcome harshness.  Press Yes to recommend to others instanly. Spread their love.  But why, why their lips is broken when talking, why the puzzle is somewhat difficult if you are not into fantasy theme of stories, why Nuri... please.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best point and click adventures I've played. Great story, great writing, great voice acting! The art was great as well. The puzzles were great and quite clever. Totally recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "A heart-wrenching story aboud a nobody man and a lovely girl on their runaway adventure. They could see ton of beautifull scenes and listen to tons of atmosphere music, while using their wit(mostly the man) to overcome harshness.  Press Yes to recommend to others instanly. Spread their love.  But why, why their lips is broken when talking, why the puzzle is somewhat difficult if you are not into fantasy theme of stories, why Nuri... please.",
            "review_score": "1"
        },
        {
            "review_text": "This game has an interesting mix of things:  - Mediocre story for the first 60%, improves dramatically after that. They could have cut the beginning half shorter. - An interesting mechanic that involves breaking and/or fixing objects using magic. - Some very uninituitive puzzles, occasionally, but nothing surprising for fans of the genre. - A less than 2 minute ending that is somehow satisfying.  The reason I played through was because I heard that the sequel, Memoria, was excellent. I hope it's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Well, as I loved playing Memoria and the story, so I like it as well. This game is absolutely the best for the story, you'll feel the adventure as playing the game and solve the quests.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Solid writing and voice acting Plot twists towards the end Main Character grows throughout the story from a weak willed bird catcher into the hero. Wonderful backgrounds  Good sound design Good and logical puzzles  Cons:  Most of the side characters are boring Overall tone of the game is downbeat and hard to get into Main Character whines a lot in the start",
            "review_score": "1"
        },
        {
            "review_text": "I find it a bit curious that there are so many reviews in English. I'd have thought that Chains of Satinav is most interesting for fans of the Pen &amp; Paper RPG 'The Dark Eye', which to my knowledge did not really catch on outside of Germany.  The game itself- we-ell. The story is quite good, the background art really beautiful.   Unfortunately, the character art and especially animations fall a bit flat. Movement tends to be clunky and somewhat unnatural. I am usually very forgiving regarding graphics, but this could have been better with not too much additional effort.  Then there is the puzzles. Most of them are solved rather easily simply because there are not that many things you can try. Although the difficulty increases, only the chapter in the realm of the fairies offers what I had hoped for. Remains to say that some dialogues can be lead in several ways with slightly different outcomes. However, this is only interesting for achievement hunters.  Speaking of which: I don't really like them in P&amp;C adventure games. Clicking 1.000 times on an arbitrary object is not an achievement. To be fair, the achievemts are mostly not that stupid, but still- this is an P&amp;C, where you can't perform stunt tricks, multikills or find collectibles (the latter would be possible in Jack Keane, btw).  Can I still recommend Chains of Satinav? Certainly. Though it's not among the best P&amp;C ever made, it is still (mostly) solidly made and very far from a bad game. And it is obligatory to any fan of 'The Dark Eye'.",
            "review_score": "1"
        },
        {
            "review_text": "This was the first point and click adventure game I've played for a long time and I must say I was happilly surprised that this game is really really good.  If you like a good story, likeable characters and beautiful art, this one is for you !   ",
            "review_score": "1"
        }
    ]
}