{
    "app_id": 204030,
    "name": "Fable - The Lost Chapters",
    "release_date": "2011-12-19",
    "developer": [
        "Lionhead Studios"
    ],
    "publisher": [
        "Microsoft Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Adventure",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 4384,
    "negative_ratings": 364,
    "price": 6.99,
    "description": "Each person you aid, each flower you crush, and each creature you slay will change this world forever. Fable: Who will you be?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/204030/header.jpg?t=1447355087",
    "minimum_requirements": "OS: Windows XP or later Processor: 1.4 GHz equivalent or greater Memory: 256MB Hard Disk Space: 3GB of available hard disk space Video Card: 64 MB shader-capable video card Sound: Sound card and either a set of speakers or a set of headphones are required for audio",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I kicked a chicken, while in my underwear. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I got a bad deal from a merchant, so I sacrificed him.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "They called me a Chicken Chaser I killed them.",
            "review_score": "1"
        },
        {
            "review_text": "Despite the tedious combat, this is a really good RPG game. It's somewhat short and quite linear, but there's enough interesting content in it to keep you busy for at least 20 hours. While a lot of the features are a tad superfluous. there is a good story, plenty of quests and a lot of interesting places to visit. The moral choices you have to make really add to the game. The only downside of the game is that the (melee) combat is just a lot of clicking. The training about blocking that you receive early in the game is rendered completely useless because you're (almost) always attacked by more than one enemy. Still it only lengthens the battles and doesn't really make them harder.  Recommended for 10$ and a no-brainer for anybody who likes RPGs when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This version NEEDS controller support!",
            "review_score": "1"
        },
        {
            "review_text": "Probably the last great game made by P. Molyneux. A classic, fun rpg with interesting characters, setting, combat, and pacing.  More games need to be like fable.",
            "review_score": "1"
        },
        {
            "review_text": "This game... is the reason i game",
            "review_score": "1"
        },
        {
            "review_text": "A timeless wonder of the Rpg Genre.",
            "review_score": "1"
        },
        {
            "review_text": "Fable! It has been blown out how good this game is way before it came out and... well, than it came out.  Besides the fact that there have been higher hopes for the game and later than everyone was a little upset with what came out (that happened before and it will again), this game is nice. You are playing in an RPG world that seems to be made for children 12+ and it is fun to see people react to the way you are playing the game.  I played that game a long time ago and than bought it again without knowing about it's relaunch in HD, so it seems that i don't know this game by hours spend ingame, but I can assure you: I am an dragon-slayer!  If you are searching for an not to hard game for RPG beginners, you might wanna take an closer look on this one.  8/10 If Fable, then Lost Chapters",
            "review_score": "1"
        },
        {
            "review_text": "Compared to its sequels, this game is completely fantastic. Fable is such a great game with a great story. Adding to that, each quest you venture through comes with different outcomes, which adds a lot to the re-playability of the entire game. The game is a great RPG for its time and, like I stated before, beats out it's newer, (and more flawed) sequels. I recommend this game for anyone who can spend hours into a story and trying to make the best character.",
            "review_score": "1"
        },
        {
            "review_text": "This game has aged surprisingly well It's Cartoony look and solid mechanics make this a must play even now.",
            "review_score": "1"
        },
        {
            "review_text": "This game brings me back to the old xbox days",
            "review_score": "1"
        },
        {
            "review_text": "473/10 better then Call of Duty Advanced Warfare",
            "review_score": "1"
        },
        {
            "review_text": "you can kick chickens. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I was playing this game as a small kid, and the game was so interesting and full of decisions you can take, that u can still replay it even now. the graphics doesnt matter. it makes a lot of fun and i can only recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "20 Hours well spent did'nt do all the side missions but story was great, But did you really have to put it on sale a week before I bought it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Yes, it looks ugly sometimes, but once you get past that it's super fun. The combat reminds me so much of  Legend of Zelda . This game takes skill sometimes with later enemies. You need to block and roll and time your attacks.  No character customization though, that was a bummer, but it doesn't matter so much. You change how you dress though.  Get the  Physical Shield  early on to save your  Combat Multiplier  to get more XP  9.999/10 Went in not expecting much. Got so much more out of it.",
            "review_score": "1"
        },
        {
            "review_text": "Love it! Classic.",
            "review_score": "1"
        },
        {
            "review_text": "One of the kings in story telling and RPGs. The story telling is great in terms of how you can decide your and others fate. You customize all aspects of your character from his appearance to his personality traits. This affects how others will interact with you. Do yourself a favor and pick this up if RPGs interest you. This game defines the term RPG.",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Maining through Fable &gt;Get a new PC. &gt;Installs it on new PC. &gt;No Steam cloud. &gt;Game's save files on old uninstalled.    10/10, would almost finish game again.  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the best, if not the best, game ever. Epic adventure with very funny moments, those demon doors have an incredible inner life... Played and replayed now and then. I wish it allowed you to continue in the game after finishing the adventure. Very recommended, everybody can play it, it's easy, sometimes even relaxing, and immersive. It gives off positive feelings, unless you play the evil side... lol   RECOMMENDED 100%!!",
            "review_score": "1"
        },
        {
            "review_text": "Arguably one of the best RPG's of its' time and transformed the way RPG's are today. Definitely one of my favorite games of all time and will be for a very long time. The graphics may not be the greatest but the action, story, adventure, and choices make the game. Highly recommend if you are a fan of RPG's ",
            "review_score": "1"
        },
        {
            "review_text": "After playing about 6 minutes of the HD 'remake' of this game I think it's safe to say that this is the only version of the game anyone should ever play ever in their entire lives at all ever.",
            "review_score": "1"
        },
        {
            "review_text": "It was no Skyrim or Fallout New Vegas, but it was still an enjoyable RPG. There are a few small glitches to just a tiny amount of major bugs, but it's nevertheless worth the investment.",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing and i love it i wish i could say more but words can't describe how good it is.",
            "review_score": "1"
        },
        {
            "review_text": "Still my favorite fable game. Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Fable and I go way back. Back to the days of the original XBox. When Fable originally came out, I remember not knowing what it was all about exept for the little bit of hype overheard at Gamestop. And while the game may not have lived up to the biblical proportions of hype this game apparently recieved, it certainly resonated with me. Fable was one of the first games I remember playing for long, multiple hour sessions. This game had transended the medium and reached out of the television and captivated my attention in such a way that my free time was forfeit to it's greatness. That being said, it doesn't hold up so well. A lot of what made this game unique has been incorporated into games that followed it and has since been improved upon. Not to say there's nothing here to enjoy. Fable is a great action RPG with a great story, fun character progression and fun combat.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played. Played the original on the Xbox when it was released. The spellcasting is a little clunky but you get the feel for it pretty quickly. Would buy over and over",
            "review_score": "1"
        },
        {
            "review_text": "100000000000000000000/10 Best damn game ever. Loved it from when it came out and still do today &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "This game is my childhood!",
            "review_score": "1"
        },
        {
            "review_text": "- Innovative storyline and animation. - Extensive customization. - Timeless graphics. - Simple, yet fun and diverse combat.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Why buy Fable Anniversary for 35$ when you can get Fable The Lost Chapters with more of a story AND its cheaper? To be honest it doesnt matter about graphics or just the name to be Anniversary, its about gameplay and the extention of the story... Please note if you are deciding between Fable Anniversary and Fable TLC then think again if you are looking more at gameplay and a cheaper price... So Fable TLC is a must have and I must admit it has been one of my favorite games since it first came out for the Xbox (the very first one).",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, Really good game for its time.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever get it or die first real game i ever played on Xbox origanal and is so good that its reviwes are better than every cod out!!",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game! Brings back so many memories! RECCOMENDED!!",
            "review_score": "1"
        },
        {
            "review_text": "I killed homeowners so I could purchase their houses and rent them out. 17/5 - IGN",
            "review_score": "1"
        },
        {
            "review_text": "I grew up playing this game and I still play it to this day. If you haven't played it, you're missing out BIG time.",
            "review_score": "1"
        },
        {
            "review_text": "I played Fable when it first came out in 2004 or something like that, was one of my favourite games when I was a child. Bought it during the sale to replay and is still fun and exciting. Kind of sad that I can't seem to get it into windowed mode though. Combat is pretty straight forward and I found the story to be interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Fable TLC is great for people who don't have an original copy of either Fable or Fable TLC for the original Xbox. The game is a direct port and I experienced no bugs or crashing when I played. One thing that players should keep in mind when purchasing this game is that there is no controller support for the game. Playing on the keyboard was incredibly difficult for me because I was so used to the Xbox controller format. To fix this I used Xpadder and made a specific profile that worked very well with the game. I've probably beaten this game about 6 or 7 times and it never gets old. It's a classic game and worth shelling out the cash to play it.",
            "review_score": "1"
        },
        {
            "review_text": "A great game but clearly shows its age",
            "review_score": "1"
        },
        {
            "review_text": "you should totaly buy this game, its so cheap. and so great. its just an amazing adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "This game really looks good for its age i played this game when i was younger but now i get to play again and i understand every thing XD",
            "review_score": "1"
        },
        {
            "review_text": "This game deserves better than very positive... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The love of my life &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs u can ever play 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "The game was first released on the original Xbox 10 years ago. Despite its age, the game holds up pretty well by today's standards. You can play as Evil or Good by making moral choices. The combat hasn't aged too well, but the combo system is still very fun. The game is mostly linear; however in-between main quests, you can choose to do side quests, explore around for treasures, or buy a house and marry someone. Visually colorful with a unique art direction. Musics are great and memorable. The story is simple and straightforward, but there is a lot of lore if you care to read the books and pay attention to what NPCs say. Overall a good RPG. It's humorous world, fun combo system, and exploration will give you a good 20 hours of Fable.",
            "review_score": "1"
        },
        {
            "review_text": "well, what can i say about fable? it had a great story, awesome gameplay, good visuals for its time. and some funny parts to it too, plus i got so into the game that i was done with it before i even realized. if i was a critic(which im not) i would give this game a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game deserves better than very positive... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "This game really looks good for its age i played this game when i was younger but now i get to play again and i understand every thing XD",
            "review_score": "1"
        },
        {
            "review_text": "Rather fun game from the people that came up with Black and White. I completed it, and all side quests, within 26 hours of game-time.  I really liked it; the fantasy, the world. Bear in mind that it is a 2005 game, it's a bit small, and there's no +1 game after you've completed it.  I found it rather easy though, unlocking the most powerful weapon and armour in the game quickly, but hey, that might just be me.  Definitely give it a shot if you've never played it before. It was incredibly enjoyable; at no point did I feel like I was grinding for experience or cash, I just wanted to continue to see the story play out in full.",
            "review_score": "1"
        },
        {
            "review_text": "Psst, don't tell anyone I said this, but there's no point buying the anniversary edition because this game holds up well in terms of graphics even without mods. Got that? Good. Don't waste your money.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game and one of the best fables. this is not the first fable but actually the expansion pack that came out for the first fable that included the first fable and more to the game. i like this version better than the first because it adds more to the first game. i recommend this to anyone who likes the fable games",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Nut up and buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Game is freaking awesome holy crap please buy it you won't regret this, damn",
            "review_score": "1"
        },
        {
            "review_text": "Looking forward to play Fable 3 and 2 &lt;3 on PC! &lt;3 &lt;3 &lt;3 -3-",
            "review_score": "1"
        },
        {
            "review_text": "Nominated the game for the 'villain most in need of a hug' award, tfw you want to play your character completly evil but you realize how hard it is for villains to get women.",
            "review_score": "1"
        },
        {
            "review_text": "British",
            "review_score": "1"
        },
        {
            "review_text": "An attractively unusal, enticing, and refreshing game. A must play for anyone searching for a fresh fruit from a familiar tree. Fable covers the basics anyone would expect from an RPG and adds comical and quaint ideas of its own. Gameplay is smooth and intuitive and the graphics are charming and timeless. The voice acting is superb, only adding more charm to the game. Don't listen to the hype on forums, anyone who has anything negative to say about this game ruined it for themselves by anticipating something this game wasn't meant to be. I recommend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Man, Fable: TLC was MY CHILDOOD. This game is SO HUGE, and has so much ♥♥♥♥ to do, also, morality, multiple endings/outcomes, great lore, and a pretty damn good combat system make for the best damn time ever. Only downside is, the terrains are KINDA fixed, which means you can't explore EVERYWHERE, but everything else MORE than makes up for that.",
            "review_score": "1"
        },
        {
            "review_text": "nothing beats the orginal",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, but after a recent update, It no longer starts, Its non stop crashing. Please fix. I don't know if it is an update on windows, or on steam. But please fix ",
            "review_score": "1"
        },
        {
            "review_text": "such a great game, played it on the original xbox years ago so was a nice experience to play it again in full HD",
            "review_score": "1"
        },
        {
            "review_text": "Pros -Can kick chickens  Cons -Never enough chickens to kick  10/10 game",
            "review_score": "1"
        },
        {
            "review_text": "I remember when this came out for the xbox back a while ago and boy did i play the hell out of this game. now i finally nabbed it for myself and after a bit of playing the nastalgia of playing it came rushing right back to me. boy the memmories of just sitting in my room for hours playing this and trying to get everything done. now to see how long it takes me this time now thati 'ma bit older xD",
            "review_score": "1"
        },
        {
            "review_text": "I Picked this up when it was £1 and it's Amazing, i still would of brought it if it was £6/£7 amazing and well worth it :)",
            "review_score": "1"
        },
        {
            "review_text": "I remember when this came out for the xbox back a while ago and boy did i play the hell out of this game. now i finally nabbed it for myself and after a bit of playing the nastalgia of playing it came rushing right back to me. boy the memmories of just sitting in my room for hours playing this and trying to get everything done. now to see how long it takes me this time now thati 'ma bit older xD",
            "review_score": "1"
        },
        {
            "review_text": "Found it for £1.39.",
            "review_score": "1"
        },
        {
            "review_text": "would play again/10",
            "review_score": "1"
        },
        {
            "review_text": "the water is fantastic",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant, engaging, masterful, These are the words i would use to describe The Fable series. Then Great, Still engaging, Waning,  This game has a quality story, and the combat system is perceptive and user-friendly with many exciting mixtures of weapons and spells. NPC's effectively react to the personality of the player that is derived through several ethical choices made throughout the story.  Keep in mind this game is fun, yet im not sure the repetative combat is worth the story. HOWEVER If this is your first time playing Fable.....You'll play for days.",
            "review_score": "1"
        },
        {
            "review_text": "This game brings a sense of nostalgia and peace as you play and battle your way through countless areas and monsters to find what you want... Answers.",
            "review_score": "1"
        },
        {
            "review_text": "best game in the whole world i loved it as a child when i first got it on the xbox was very happy to see it here on steam i cannot recommend this game enough",
            "review_score": "1"
        },
        {
            "review_text": "So much better than that shower of ♥♥♥♥ they call Fable Anniversary  I r8 8/8 m8",
            "review_score": "1"
        },
        {
            "review_text": "This is the video game that caused the Iraq war to start because Peter Molyneux broke his promise to make a good game.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favourite games of all time. An excellent modding adventure as well.",
            "review_score": "1"
        },
        {
            "review_text": "Fable Lost Chapters is great, the game play is beautiful for how old the game actually is and it's the game that convinced me to buy an xbox 360 over a ps3 I have played the rest of the series since and the original is my favourite the emotional bonds the franchise forms with your character is amazing",
            "review_score": "1"
        },
        {
            "review_text": "Fable,just the name alone makes you feel fuzzy inside,a great game for a wonderful price. love it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just amazing, worth the money 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game with fantastic gameplay. Cant wait for the Fable TLC Anniversery",
            "review_score": "1"
        },
        {
            "review_text": "A great game with a lot of choices with visual changes depending on your changes not to mention the wide varity of ways you can play the game as there is 3 main playstyles you can mix the way you wish to, Archer - magic - strength.  Now this is just a tiny part of the game as there is still the great story that almost compels you to keep on playing to find out what will happen next.  beyond this then we have:  - secrets to find - puzzles to figure out - minigames with reward connection to each other. - cities you can buy out  It would not surprise me if you played the game and ended up finding something i have not mentioned here.  So if any of these things sound interesting then go play the game right now and make the world the way you want it to be!",
            "review_score": "1"
        },
        {
            "review_text": "Fable,just the name alone makes you feel fuzzy inside,a great game for a wonderful price. love it.",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgic / 10  ~Foxy the pirate",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the best games I've ever played. It's a brillaint story combined with amazing mechanics and beautiful visual elements. I may or maynot end up showing my girlfriend this game. It's good. Get it dawg.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a unique and one of a kind RPG that they developers were never able to recreate in it's sequals. It is really fun however it is exetremely short so if your looking for a game with more then 12 hours of gameplay then this game isn't for you. Also, a lot of music is reused in later parts of the game, which despite Fable's amazing sound track, does get annoying. Also the game is pretty easy considering the fact I can complete it without dying once throughout the playthrough. I still recommend this game, however. This is one of the only games besides GTA where you can randomly kill villagers for no reason, and you do get more gameplay if you try to find all the secrets without looking them up on the internet.",
            "review_score": "1"
        },
        {
            "review_text": "WHAT CAN I SAY...... This is by far the best of the series, this game is full of magic, revenge and compassion as you start as a young boy waiting to avenge the death of his family.... This game is full of decision making which affect your overall outcome.... will you be a feared hero or a loved one, will you have horns coming out your head or surrounded by butterflys?? It's all up to you.... the story telling is remarkable, the creatures and characters are fantastic, the combat system is very easy to master and not all over the place like League of legends and other magic power inspired games....  Once you have finished the storyline, you are free to keep playing and unlocking the other secrets of Albion.... I would still pay $20 for this gem....Warning....be prepared to lose a few days in front of your computer.... If I was to say anything bad, I'd say that the graphics are getting a little old...but that's it!!!  Overall I give this game a 10/10...it's a classic and it's just too good!!!",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia, Fable! Fable! Fable! This game is a open world (slightly) with a funny humor based characters and arcade type of fill while trying to maintain serious, a great little game and perfect for anyone who enjoys the classic that birthed the series that we know today.",
            "review_score": "1"
        },
        {
            "review_text": "  It's pretty good. And i totally would hug Jack Of Blades, he just wants to be an immortal demi god, what's wrong with that?",
            "review_score": "1"
        },
        {
            "review_text": "Finished it 20+ times throughout the years. doesn't get better than that.",
            "review_score": "1"
        },
        {
            "review_text": "First thing I did in this game was accidentallly punch a small child ",
            "review_score": "1"
        },
        {
            "review_text": "i would recommend this to any1 its a good old school game which brings a great variaty in how u can actually play this game its all about being either good or evil neutral can be done but decisions must be made and every single one of them has a consiquince   fable the lost chapters brings even more content a hole new area to explore maybe even as big as the original map itself  it brings new and reskined enemies new weapons new loot new everything  but thats not all beyond this dlc lays a path of a great surprise of a story  u are interested in what this is? well then there only rests one thing   playing this game and having a hole lota fun being either good or evil  if u feel like slaying a town or making every1 love u its all up to u in FABLE THE LOST CHAPTERS",
            "review_score": "1"
        },
        {
            "review_text": "i would recommend this to any1 its a good old school game which brings a great variaty in how u can actually play this game its all about being either good or evil neutral can be done but decisions must be made and every single one of them has a consiquince   fable the lost chapters brings even more content a hole new area to explore maybe even as big as the original map itself  it brings new and reskined enemies new weapons new loot new everything  but thats not all beyond this dlc lays a path of a great surprise of a story  u are interested in what this is? well then there only rests one thing   playing this game and having a hole lota fun being either good or evil  if u feel like slaying a town or making every1 love u its all up to u in FABLE THE LOST CHAPTERS",
            "review_score": "1"
        },
        {
            "review_text": "Hella good game dog. You can easily get lost in the rich atmosphere that this game builds up effortlessly. You can also tell how much love and compassion was poured into its creation.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but seemed a little too linear to me.",
            "review_score": "1"
        },
        {
            "review_text": "Fable: The Lost Chapters Fable is one of the first M games I had ever been allowed to play when I was younger, and I believe that even now, it has aged gracefully. In Fable, it is simply astounding to the amount of interactions you can have with people. Sneer at them, scare the crap out of them, and children will run in terror at your approach. Or, become the saint that all love and respect, and give everyone a gift or two. Or, give 'em the middle finger and tell 'em to ♥♥♥♥ off. Then say sorry. Then ask a gay man to marry you. Reputation is everything in this game, be you good or evil, a good reputation for being good or evil is still a necessity. Or, live between the lines, but there are times that playing around with your alignment is not the way to go, and only one choice can be made. That choice, however, is entirely up to you. While the game does not entirely match up to some of the graphics of today, this game looks very beautyful and full of life, or death, especialy for it's time. The gameplay is very simple as well, and combat against multiple enemies can be fun, easy, very action packed once you get used to it. The replay value is actualy suprisingly high for the kind of game it is, and I'll tell you, I played this game on the XBOX dozens of times, each time telling myself I would become a different person, and each time, I found out something new about the game. I will say that if there is anyone out there who wishes to test their fantasy of a Hero or Villian, come along and experience the game that changed the way games were made.   9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "BUY THIS GAME IF YOU LIKE SINGLE PLAYER RPG. OTHERWISE, GO HIDE YOUR HEAD... BAD DOG!",
            "review_score": "1"
        },
        {
            "review_text": "this game is suck. dont play it.",
            "review_score": "1"
        },
        {
            "review_text": "While the graphics may be dated compared to the latest installments of the Fable series, this was the first game I played as a child and the nostagia I feel every time I play it makes up for this fact. The flexiblity of gameplay and the variety of quests available make this an interesting game with a lot of replay value and overall one of my favourite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, I love the choices you can make that push you towards good or evil, how you update your stats (extremly simple and easy to understand). Its a fairly simple game to where a novice like me can play it with little difficulty, but the openworld experience makes up for how easy it is sometimes. All the little side quests and little things you can do on the side make for a game you can play for hours and not get bored easily.",
            "review_score": "1"
        },
        {
            "review_text": "good game, fun battle, the main story is too short, side quests are fine.",
            "review_score": "1"
        },
        {
            "review_text": "I plaed this game too much times, but it still best",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs ever made",
            "review_score": "1"
        },
        {
            "review_text": "This game makes ♥♥♥♥ very good 2 thumbs toward the sky",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and fun fantasy game. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a freaking amazing game. One of the first hardcore RPGs and a classic. For its time, it looks great, has complex combat and gameplay and remains challenging up until the mid/late game. Terrific variety of opponents and locations. Variety of weapons/armors/clothes leaves something to be desired, but is more than made up for by the incredible look of the legendary weapons and armor one can find around the map.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoy this game, Prefer this one to the other Fable games",
            "review_score": "1"
        },
        {
            "review_text": "The only promlem i have with this game is that the childhood can crash other wise 10/10",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the best RPG's i have ever played and a top10.",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game with good and evil decisions. A older game being releaced around 04. Though still good graphics and very fun to customize your character's abilities. Also long and amazing story with a lot of hidden things to do, sometimes the side quests are just/ if not more fun then the main story. Always a delight to play and replay.",
            "review_score": "1"
        },
        {
            "review_text": "I never played a Fable game in my life, and I'm glad this was the first one.  This gave me a bit of nostalgia from older games though, and I enjoyed revisting the older graphics, animation, story, etc.   This game is somewhat lengthy, and a bit challenging.   Just buy it already...",
            "review_score": "1"
        },
        {
            "review_text": "The game from my childhood, only on PC. Amazing gameplay and story. Be a hero, or a villain.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful adventure, very fun :)",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece indeed. :3 Such an old game and yet still so amazing...",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, definitely worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing adventure game that is really story rich and you have to make good or bad decisions that will definitely affect the ending of your game. I love the weapons on the game especially the magical enhanced weapons! I also love all the magic spells you can cast on your enemies! All in all, Fable The Lost Chapters is one of my favorite adventure/fantasy games! I definitely recommend this game if you're up for an adventurous/fantasy game! :)",
            "review_score": "1"
        },
        {
            "review_text": "A game that has flourished me so much as a little pike, me and my big brother played this game a ton back in the day. And I stil play it nonetheless today. My only question would be why people were dissapointed by this game so much. Sure, nothing that was said to come out of release would come to be. But it still has the potential it recieved. That music, that gameplay, that RPG elements, DAT MUSIC.  ADHD Version: This game is awesome, get it right now.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game on the xbox orginal first time around and now i still love this game!  i reccomend playing this game out of the fable collection, then maybe play the rest of the games. this game has its own nice style of game play, its has a fun quirky feel to it, diffrent to the other fable games if you ask me. all in all 8/10 rating for me! i would gladly play this to the other games!",
            "review_score": "1"
        },
        {
            "review_text": "It's like one of the best RPG games for me. The story, the gameplay, the convenient controls and all make Fable the best. If you are looking for a fantastic, easy to handle RPG Fable should be the first option for you. Good old games!",
            "review_score": "1"
        },
        {
            "review_text": "A really good game, long and interesting story, i appreciate the secondary missions too, good variety of enemies and goodgraphic (for the production year). Final vote 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "horrible graphics but ok story if for a decent price id buy it (like 3 bucks)",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece indeed. :3 Such an old game and yet still so amazing...",
            "review_score": "1"
        },
        {
            "review_text": "Sure as hell beats that annivesary ♥♥♥♥♥♥♥t, and it does it for 30 bucks cheaper.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok but Fable III does it better!",
            "review_score": "1"
        },
        {
            "review_text": "Kill everyone and everything and you can still beat the game as the world's greatest hero.  8/10 - worth buying",
            "review_score": "1"
        },
        {
            "review_text": "A classic that needs to be played by all RPG lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Frieking classic. This goes on the list of best games ever with amazing replayability. That being said, I haven't played The Lost Chapters yet. This is an expansion to the story, so it shouldn't change the playability of the game. The game is quite dated, so for someone who has never played it before it might be difficult to get into for the first time. For me, Fable will always be a great game. No matter how dissapointing the sequels get.",
            "review_score": "1"
        },
        {
            "review_text": "The best out of all the Fable games. While the others made improvements on such features like Combat, this game rings true to the RPG experience. It is a great game with many funny, as well as serious moments. It has been one of my favorite games for a very long time, and the other Fables just can't even remotely compare.",
            "review_score": "1"
        },
        {
            "review_text": "Game is amazing. Wish they would make a 4th one though.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely the best Fable in the series. I have put much more time in this for it is such a good game. Being able to be good or evil and it looks so much better than Fable: Anniversary.",
            "review_score": "1"
        },
        {
            "review_text": "I always had heard the general misconception that Fable games are bad, or rather disappointing. I delved into this world looking for high fantasy with no questions asked, and it seemed like the right game for me. I kept seeing people saying 2 and 3 were bad, and that Fable the Lost Chapters was the best in the series, but I was still a bit, if not a lot, hesitant. I doubted and doubted, but I made up my mind and decided to purchase it and play it blind without knowing what is going on. As you may see I yet have to finish the game, but I cannot resist the need to just yell out how great, how excellent this game is. It strives for realism and achieves it in a 'videogamey' way. It is action packed and the decisions to be good or evil are very fun. The world does change around you. People hail you if you're good and loathe you if you're evil, even running away from you. You can marry shallow but good-looking characters, and the game even makes fun of itself in this aspect on a book in which it incites you to murder your beloved just because you're bored of him or her. It is great, simply and absurdly great, and it was a real surprise for me to see this game be so good. 9/10 would give a wedding ring to the Guildmaster again.  By the way, do not bother with anniversary, play this one, the real one, and see why it doesn't even deserve a remake.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most epic RPG games ever. Classic!",
            "review_score": "1"
        },
        {
            "review_text": "This version is superior to the original release. The game is not particularly demanding, so even older computers should be able to run the game without experiencing issues. If you like action RPGs it's worth trying out. Your choices have a far greater impact on your character's growth and appearance than newer games that boast a similar morality system. You're free to build your character as you see fit, instead of being limited by equipment and skill restrictions placed on typical RPG character classes. Not all combinations may be effective, but that's up to you to discover. It's a fun game that doesn't have a difficult learning curve, with added replayability that comes from the morality system.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, reminds me of playing Fable as a kid. Good game to kill some time with.",
            "review_score": "1"
        },
        {
            "review_text": "Childhood memories come back. How could i give this anything less than a 20/10? Best. Story. Ever. I would strongly recommend this to literally everyone!",
            "review_score": "1"
        },
        {
            "review_text": "''look at that Arseface!'' ''Chicken Kicker!'' ''Wait Until I get my hands on that husband of mine!''  all in farmers accents.  10/10...would Albion again  must've played about 80 hours of this on the original Xbox..one of the best games around in my opinion",
            "review_score": "1"
        },
        {
            "review_text": "I got this game for Xbox back in the day when it was new and shiney. I remember loving the game a lot, even though it was infamously short. It has a certain charm about it. Check it out for sure!",
            "review_score": "1"
        },
        {
            "review_text": "This story in this game is great and lasts long enough, there are also a lot of sidequests etc. if your goal is too complete the game 100%, you can sink a lot of time into this one. I also think this game is way better than its sequels.",
            "review_score": "1"
        },
        {
            "review_text": "Though there are glitches (like the original game), I still enjoy and love it! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Fable, I played this game when it came out and I was impressed, shame the second one was quite so great. The combat reminds me much of dark souls and it also has a somewhat similar rpg element. The art of the game was very well done and I must say this was worth my ten dollars.",
            "review_score": "1"
        },
        {
            "review_text": "Love fable: TLC. I'm glad they even remade it, despite it wasn't next gen. No doubt this was the best one in the series. I wish Lionhead would make more fables similar to this one.   *great plot and missions *great environment/atmosphere *cool powers and abilities *good graphics for a 2005 game *bit too easy ",
            "review_score": "1"
        },
        {
            "review_text": "So worth the money, itu'll 's awesome just be sue to read the tutorial boxes and if you are on a laptop you may want to reconfigure the keys on the game but they make it simple to do so. So good.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely beautiful start to finish, the LRA approves.",
            "review_score": "1"
        },
        {
            "review_text": "I have spent so many hours on this game when it first came out and I bought it again when it reached steam. This is a great game &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Still an amazing game but wouldent hurt to impliment some controller gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "One of my most favorite games, ive beat it like 7 times and still love it, no RPG can even come CLOSE to this, it blows TES out of the water",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly entertaining! Despite its age, the game is still more entertaining than most RPG's today. I recommend this to any gamer out there, whether they like RPG's or not.",
            "review_score": "1"
        },
        {
            "review_text": "A nice blast from the past. One of my favorite rpg's from the old days of xbox, playstation 1, and gamecube. The graphics are typical of that era and the stroyline pans out at about 60-70 hours, but you will enjoy every one of them. Good and evil can be as interchangeable as the wind and you could walk into a city and be feared as easily as laughed at. A personal favorite and recommended to all that have memories of those old days of console gaming.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun",
            "review_score": "1"
        },
        {
            "review_text": "Colorful world with moral choices and fun combat. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Really good game!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awsome thats all there is to it ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, always been my first and favorite rpg.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the first games i ever played and i can recomemend it for anyone i know. This game is what started me on fantasy games and i still find it great even to this day. I can not stress how reat this game is. Lots of people say it is bad because it not what was promised all thoughs years ago and i agree, yet the game is still fantastic. i recomemend this game to anyone out there who love fantasy games and enjoy a good story",
            "review_score": "1"
        },
        {
            "review_text": "Bring back so many memories! This game is worth buying for a low price!",
            "review_score": "1"
        },
        {
            "review_text": "A classic game, don't let the graphics put you off",
            "review_score": "1"
        },
        {
            "review_text": "Everyone should play this game...",
            "review_score": "1"
        },
        {
            "review_text": "You can become the owner of a Bordello with various types of women.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! Definetely the best one of all the Fable games &amp; I do hope that they will make the next Fable game more like the 'lost chapters' rather than some bs prince stuff like in the 3rd fable game.",
            "review_score": "1"
        },
        {
            "review_text": "i ownd this game when it first came out on the xbox and loved it. my buddy and i would play countless hours playing this game. im glad it is availble on pc. but, sadly i cant seem to play this on my pc. i start it up and watched the intro movie, after the video. it exits out and tells me that fable the last chapters has stoped working but does not tell me why. can someone help?",
            "review_score": "1"
        },
        {
            "review_text": "are there any female mods?",
            "review_score": "1"
        },
        {
            "review_text": "Play it again and waiting for Fable Anniversary",
            "review_score": "1"
        },
        {
            "review_text": "It was really fun, until I got to the end and it DELETED MY PROGRESS FOR NO REASON!!!! F.Y.I I'm SUPPOSED to be able to still do stuff after winning, but the game just decided to erase everything &gt;_&lt;.",
            "review_score": "1"
        },
        {
            "review_text": "KICK THE CHICKEN YOU SCUM",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game of all time. I remember first putting the game in the old obese xbox when i was 10 or 11. It was a great game then and it still holds my attention to this day. This is the game that made me love rpg's. You can't call yourself an rpg fan without playing this game. And at ten bucks, there is really no reason you shouldn't own it.",
            "review_score": "1"
        },
        {
            "review_text": "this game grew up with me, and even today with all the spoils of newer games it feels next gen, the amount of detail is amazing. granted, i first play this piece of artwork on the xbox and grew playing it, so when i found the whole thing on pc, i was ecstatic.  when playing this game, your a hero, a master of will(magic) skill(ranger stuff) and strengh(warrior) and you build by using things specific to that line, like magic gets you will, ranged and stealing is skill, and melee gets you strengh. you also have basic experience which levels up any line you want!  You play how you want to, and your not confined to one path.  this games story is however so and so, you can ignore if you want, but probably not even realize that your doing the questline. This games a classic, and if your looking for a good classic. here you are.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly didn't know how this game would be, I found save data on my aunt's XBOX, and wondered about it since. I know now that it's a quality game, that I can run from almost any computer I use. It's an excellent investment of my time, and it's worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Worth a play, for sho",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game since I had it on the original XBOX. Yeah, that old thing. Fable has some of the best story telling in any game series and I would highly recommend this and Fable II (even though its an xbox 360 exclusive) to anyone out there looking for a spectaculat experience.",
            "review_score": "1"
        },
        {
            "review_text": "This is awesome. Get it. Get it NOW. All this nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't buy this game you support animal abuse and think of the children.",
            "review_score": "1"
        },
        {
            "review_text": "I played Fable on the Original Xbox almost a decade ago and back then I stated that Fable was 'the best game I had ever played'- of course, better games have come along since then and have swept that title away from Fable's grasp, but that doesn't demote the fact that this game is an absolute masterpiece not only for its time, but by todays standards too.  I'm sort of nervous writing this 'review'- not because I fear the criticism I may get in return for creating it because I doubt they'll be any, but more for the fact that I want this game to get the good review it deserves as I absolutely adore this game, nonetheless, let me get into why.   Unlike most RPG's that force you to go down one linear path, Fable grants you the freedom to set which moral allignment you want to persue which will determine how you look visually and how people will treat you. If you chose to be evil, you will grow horns, flies will start to fly around you and villagers will boo and scream when they see you however if you chose to be good, you will grow a halo, butterflies will start to fly around you and villagers will cheer and compliment you when they see you- it's the tiny details that come together to make this game great. One thing I must critisize is the lack of sublety when making a moral decision, sometimes it can be so obvious that it's just 'press the LMB to be good and the RMB to be evil', which although it's still nice to be given the option, could of be relayed in a better way to the player.   The quests are actually interesting and never feel like a grind, gracefully not following the usual way of modern RPGs in the sense that all the work goes into the main questline and the side quests are just 'kill, fetch and return'. The characters are memorable and will stick with you throughout the game. The storyline, although starting to get slightly confusing halfway through, is still gripping.   If you've watched any videos about Peter Molyneux preaching Fable by lying and building it up to be better than what it is, then I'd understand why you'd be disappointed playing the game, however if you haven't and have just stumbled upon this review either by accident or by sheer curiousity, I'm almost certain that if you're an avid fan of RPG's that this will become one of your favourites for life.",
            "review_score": "1"
        },
        {
            "review_text": "A nice, lighthearted but well done fantasy game. A few years old, but still holds it's own. Filled with fun quests and great gameplay with the ability to take the good path or the evil path.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game when I had it on Xbox. I have heard and seen it as being one of the most disapointing games of it's time, but I loved it. I went into the game blind, and loved it. I think it was because it was expected to be much more, but I was very happy where it was. It had plenty of action, a good story, great characters, and a lot of humor. It had a quite ElderScrolls feel to the leveling up. Instead of like most RPGs, where you get EXP from killing enemies and used that to level up, Fable is a bit different. You do get EXP from killing, but you also get it from doing the killing. You shoot something with an arrow, you get skill EXP. Blast them with lightning, you get will EXP. Bash them with a hammer, you get strength EXP. They do not mix together, so you can't play as pure mage and have a high health. Not from Will EXP, at least. This is where the General EXP come in, the stuff you get from killing and quests. That can be put towards anything.   Also, what you do in the game effects your appearence. Like to crunch on little newborn chickens (yes, you can do that) and kill people? A red mist will rise from your feet and eyes, you will become pale, flies will be drawn to you like the corpses you leave behind, and you grow horns (also destroying the majority of your hairstyle). People will run in terror from you, and hate you though your power will keep them from doing anything. But if you play as good, people will flock to, you will get a halo and a beam of light when you stand still. I think your eyes change color, though it has been a long time. Max out strength and you will look like a bodybuilder. Will will make you glow. I can't remember what Skill does. Fighting badly leaves you with scars.  I could keep going on, but you should play it yourself. My only complaints are that the GuildMaster gets annoying 'Your health is low. Have you any potions, or food', and I am having trouble getting the game to run on my computer even though it should be able to run it no problem. But once I get it up and running I won't be doing much else.",
            "review_score": "1"
        },
        {
            "review_text": "Sure as hell beats that annivesary ♥♥♥♥♥♥♥t, and it does it for 30 bucks cheaper.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the first PC games I had ever played and I really enjoyed it. I had liked how I could be good or evil and have the world around me acknowledge which path I chose. (Though I still feel bad making evil choices.)",
            "review_score": "1"
        },
        {
            "review_text": "I had the original on Xbox (but had never played Lost chapters before recently)....STILL BEUTIFUL infact even better!, definately deserves its place as a true xbox classic, may not be as fluent as the others in the series but they do not come close to the story, comedy and true originality for its time. If you have not played this (including those who have only played the original version); Seriously consider even trying this game!",
            "review_score": "1"
        },
        {
            "review_text": "Is rly gud",
            "review_score": "1"
        },
        {
            "review_text": "A lot more in depth than Fable 2, and especially Fable 3, better weapons, spells, storyline, and better boss than both 2 and 3, and it's cheaper now. So....do you need any other reason to buy this classic?",
            "review_score": "1"
        },
        {
            "review_text": "One of my first RPGs I have played and beat it 5 times and it is still fun! Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "Great game amazing a little short and after beating it once i promise you will want to come back",
            "review_score": "1"
        },
        {
            "review_text": "I've never played any fable game before, and was a tad sceptical playing a game thats been out for some time now. That being said this game gripped me from the get go, and i rank this as high as Final Fastasy VII, The Witcher 2 and Dragon Age. I reccommend anyone who likes RPG's to get this game and enjoy it as much as i have. Ahead of its time. Cost me £1.04 in a sale, outstanding value. It's a must play game for all. Please enjoy :D",
            "review_score": "1"
        },
        {
            "review_text": "Wanted to play this game after years so i purchased it. almost immediately afterword, anniversary edition was released. boners in butts. poopy/not so poopy.",
            "review_score": "1"
        },
        {
            "review_text": "Wish that the new version gets supported with mods. Fable TLC is a great story though, regardeless of the low graphigs, I mean, true gamers know that the graphics not make the game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the very few games that i have enjoyed endlessly and still find myself returning after all these years. a true masterpeice of the genre and a groundbreaking game when it was released.",
            "review_score": "1"
        },
        {
            "review_text": "damn good game, better then all the others on the other platforms as well!!(in my opinion)",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the best RPG's i have ever played and a top10.",
            "review_score": "1"
        },
        {
            "review_text": "The controls for PC are lacking by a massive degree. But it's the best of the fable series soooOOoOooO. 50/50 trade-off in my opinion totally worth.",
            "review_score": "1"
        },
        {
            "review_text": "Since its on here on steam i dont have to carry around my Xbox wherever i go just to play it. I really love this game and its even better since its the regular game and the lost chapters bonuses.",
            "review_score": "1"
        },
        {
            "review_text": "Fable - The Lost Chapters. A boy loses his family when a dragon attacks his village, the guild takes him in and raises him to become a hero ... or villian, because that's your choice. Let the folk despise you or praise you.",
            "review_score": "1"
        },
        {
            "review_text": "Kicking a chicken like a football was the best thing i did in my entire life. 10/10 Game of the Year all time favorites.",
            "review_score": "1"
        },
        {
            "review_text": "I remember buying this for the first time on XBox just like it was yesterday, The fantasy and nostalgia factor is high. For 10$, Honestly you can't go wrong. You've got a great adventure with a nice storyline on the side, With favorable gameplay mechanics and a wide variety of spells. Downside is, The game unfortunately lacks a bit of difficulty, Takes about 16 hours to clear the main storyline. Since you can choose your destiny, Good, Neutral or evil, The game has a good replayability value. This, By far IMO, Is the best Fable title out there and one of my favorite single-player RPG experiences. This game might have been considered 'Over-rated', But it doesn't mean it can't be gold.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game, I enjoyed the second more, but this was also a GREAT game. I like it.",
            "review_score": "1"
        },
        {
            "review_text": "One of my most favorite games, ive beat it like 7 times and still love it, no RPG can even come CLOSE to this, it blows TES out of the water",
            "review_score": "1"
        },
        {
            "review_text": "I've never played any fable game before, and was a tad sceptical playing a game thats been out for some time now. That being said this game gripped me from the get go, and i rank this as high as Final Fastasy VII, The Witcher 2 and Dragon Age. I reccommend anyone who likes RPG's to get this game and enjoy it as much as i have. Ahead of its time. Cost me £1.04 in a sale, outstanding value. It's a must play game for all. Please enjoy :D",
            "review_score": "1"
        },
        {
            "review_text": "used to be grat but old now",
            "review_score": "1"
        },
        {
            "review_text": "brilliant game is all i have to say.",
            "review_score": "1"
        },
        {
            "review_text": "The only good Fable game.",
            "review_score": "1"
        },
        {
            "review_text": "I used to play the original Fable on the XBOX when i was younger. Even though the grafics are (they still are pretty good for the age of the game) a little bit outdated, the spirit of Albion is still flowing throughout the whole world. I played through the game about 4 times on the XBOX, and even though i know almost everything i cant stop playing. ''The Lost Chapters'' adds some cool and funny stories to the main game, i really like the PC-remake in overall.  Everyone who is searching for something to play on a rainy Weekend, something which he can dive into, he should definitely buy Fable - The Lost Chapters. I prefer the original Fable over the Sequels, so i suggest you try out this first.  ",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't matter that this game is annoyingly linear, this game is amazeballs, and needs to be in your life. It helps that I played it when it originally came out on xBox, but meh, if you can appreciate that it's a little old, and the graphics aren't shiny and perfect, then this game is right up your street. Love it!!",
            "review_score": "1"
        },
        {
            "review_text": "Fable: The lost chapters, surprisingly a quite enjoyable adventure/action game. Worth a try!",
            "review_score": "1"
        },
        {
            "review_text": "A goood but older game, and easily the best in the series.",
            "review_score": "1"
        },
        {
            "review_text": "Back in the old days it was a amazing game! And yet it stil is cause it runs on a 64 mb graphics card! Thats really amazing for a game like this! It has amazing graphics! Who needs those fancy high end graphic cards anyways! 64 mb graphic cards rules!",
            "review_score": "1"
        },
        {
            "review_text": "The original Fable will forever be one of my favorite games of all time. Great story, great music and level design. Neat spells and weapons. Good sense of progression. Fun combat. I wish they made an addon or expansion to make this game even longer.",
            "review_score": "1"
        },
        {
            "review_text": "The game that got me into RPG's this game is classic.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game it has everything multipe endings, weapon choices, chracter building, and SO much more. ",
            "review_score": "1"
        },
        {
            "review_text": "Why do I need to review this? You should have this game already, you should have played this already! WHY DO YOU NOT OWN THIS!  Fine.  ",
            "review_score": "1"
        },
        {
            "review_text": "words cannot describe the game",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, prbably the best RPG I have ever played. Excellent story telling and a very epic feel to the game make it well wortht the money and much more.",
            "review_score": "1"
        },
        {
            "review_text": "It's a Great Game ! :D",
            "review_score": "1"
        },
        {
            "review_text": "this is a great Game and i would recommend it to anyone BUT there is a Issue i have noticed, If u pick up a weapon and u already have 1 like it in your Inventory it does not give u the found u just found so u cant sell it and i just UP and Disaprees, this has happened to me with a Steel Axe and not a Obisdan Greataxe, i know this game is old so not like to get a patch to fix it but it is a Really annoy Bug more so if u need money.   Besides this is a good time passing game, but short from what i heard",
            "review_score": "1"
        },
        {
            "review_text": "Lots of thing to do highly recommend this game to anyone",
            "review_score": "1"
        },
        {
            "review_text": "Ok, first off... I have played and completed this game multiple times on the Xbox and oh my this gets better. The nostalgia when playing this game is incredible. I remember the days of kicking chickens and now I get to relive it for PC. I recommend this to anyone who played the orignal on a different platform.   Got it for £1.04 on Sale and I love it. :)",
            "review_score": "1"
        },
        {
            "review_text": "The best in the series",
            "review_score": "1"
        },
        {
            "review_text": "It is great game full of excitement and playable content but have lots of problems to be stable and its crashes a lot on many computers. So dont forget to save a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah. It's pretty good, but basically - but Skyrim/morrowind/Oblivion first, then when you get a bit tired of them, you need to get this.",
            "review_score": "1"
        },
        {
            "review_text": "Fable... i have played through this game more times than I care to ever admit. Buy it, Play it, Love it.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game. I first played it on XBox when it came out, but have since lost that copy. Now that it is on Steam, I can play whenever I want! The graphics are a bit out dated, but with a good story line and controls, I can get immersed for hours. I would recommend this to anyone that likes RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "I found them",
            "review_score": "1"
        },
        {
            "review_text": "STILL BEST GAME THERE IS!!",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game ever. This game started me on gaming, i love it to death.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game's story, before the DLC. Also, some pretty cool spells.",
            "review_score": "1"
        },
        {
            "review_text": "Played the first release on the original Xbox and loved the game back then. The art style and colorful characters in this game completely immerse you into its world and storytelling. 'Fable' is one of those games that most people have played, as its been out for so long and has been so highly acclaimed but always had one downfall. It was not long enough. This has been dealt with in 'Fable: The Lost Chapters' with so much extra stuff to do within the game, giving more replay value regarding side quests specific to whether you are playing a evil or good character. As well as this, there is a whole new section added to the original ending of the first released game really adding something to the development of the world you have become a part of in playing this game. I felt the need to write a quick review on this game to simply point out, if you've never played a 'Fable' game play this one! And if you've played the original definitely play this one, experience that awesome world created in the story along withh all those new things to do!",
            "review_score": "1"
        },
        {
            "review_text": "So please ignore the amount of hours I have played because I actually already completed this Game 2 times one on my original Xbox and then I replayed it after playing Fable 2 on my 360 so I’m just starting my 3rd run and Oh boy am I excited!  In a world were your choices define the world around you, how others perceive you and even how you looks change based on how you play you will make a perils journey of growing up from a Small boy into a young man after your family are killed and you must embark on journey of Revenge in a Rich Fantasy world laced with heaps of comedy.  So off you go thundering around the Kingdom of Albion kicking every Chicken in sight and farting on any man, woman or child dumb enough to allow you near them.  The one thing that always amazed me about this game and it still rings true today is how much fun can be had from being 'BAD' you wonder into a village you have terrorised them and then the people cower in fear and scream for there lives at the mere sight of you.  The same with being 'GOOD' people will praise you and sometimes even cheer in the great heroes presence....and trust me I know this just a game but its really really cool.  In fable - The Lost Chapters you will laugh you will cry and I'm sure you will most likely die from time to time too.  This is game is a Classic Among classics and is worth every penny of the £6.99 price tag.  8/10  An absolute must for any self respecting RPG lover.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutey classsic game. great game even whens its old. Great to play for memories back in the day. Great RPG, skills and powers, since before other games have been copying.  Of the 3 Fables, this is my favorite, to be honest the other ones seem to just be a cheap remake, exact copy of the story.  But the first one I went back and played (offline, hour count), even having beat in multiple times years ago.  Its good.",
            "review_score": "1"
        },
        {
            "review_text": "from ages 10 to friggin 100 you can punt chickens, bang whoever you want, kill everyone, (one event) get drunk, punch a guard, resist arrest, throw up, and do it again. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a triple layered fun cake with fun icing and sprinkles.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Wish it had steam achievements but other than that its worth buying more than the anniversary edition.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. If you played any of the other fable games, This one is the best",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! :)   The first game I ever bought for the orignal Xbox was the first Fable game. I sold it after a few years and bought Fable The Lost Chapters and I still own it. I also bought the new Fable Anniversary game.  This game is probably one of the best games I have ever played. The main story is simply amazing.   I think I have played through this game about 20 times and it's just as funny now as it was the first time!  This is a game you have to try!   Score: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is an emotional ride from the beginning. The way everything evolves and unfolds around you throughout this game just makes for a perfect story. This game is a must play in the RPG genre. It may be the first of the series and have not so great graphics for our time, but if you have not even so much as touched a Fable game, then I really, really recommend this one. A mere $10 for this gem is such an amazing deal for what you get out of it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun i love any fable, but as you would expect there are some down but those are just parts that get hard and you need a guide but this game is mostly like every other fable and is easy to run on low end computers",
            "review_score": "1"
        },
        {
            "review_text": "The best of its kind.  This game... Is so damn good. I have never ever seen anything better in this genere of games. It's always a pleasure to play this game, no matter what. This game may look old, because it is. But if you're going to judge the game just because of graphics, get off of steam. This game runs very smoothly and has a nice control system. The amount on content in this game also makes it better. It has all of the humor you could ask for, and the blood and gore you could ask for aswell. This game is the RPG to play when you want have the feeling being evil or good. Depending on your actions you can become a lord of the dark, or a hero of the heavens. There is only one thing wrong with this game. You can't choose a gender so that stinks for women.  10/10 - I love this awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Epic: I love Fable and think the first one had the best story. If you have yet to play the first Fable, I highly recommend it! I would say go pay the extra few dollars and get the Anniversary becasue the graphics are amazing! But if you can only pay the $10, this is well worth it! One thing I would add is being bad is fun and alot easier than being good... Some might say being bad has better perks, but thats because they have not truly been good. Play your own way and try being good and bad, it cahnges the game!",
            "review_score": "1"
        },
        {
            "review_text": "-Marries Lady Grey -Lady Grey says if I marry anyone else she'll hunt them down and kill them -Marries a woman in Knothole Glade -Marries a woman in Hook Coast -Marries a man in Oakvale -Marries a woman in Snowspire Village -Goes and has secks with Lady Grey   10/10 Would want to marry Whisper again",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game i remember playing is for the original xbox and so far for PC it seems like a great game but im still having a bit of a few issues where not sure what controls are witch and not sure how to become a thief..like picking locks on doors and stuff if anyone could tell me how so that would be great :)",
            "review_score": "1"
        },
        {
            "review_text": "Made a custom chest tattoo of Rolf (Ed, Edd, n' Eddy) opening a door.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Good Game 9.9/10 (Just some very small bugs)",
            "review_score": "1"
        },
        {
            "review_text": "I had this game when I had Xbox... decided that with my 16g of RAM, I should use it... Bought the game for Steam and i've been playing the last 16hrs... I LOVE this game.  bad day? Save the game. Go Into Oakvale. Reinact the bandit scene with just yourself. walk out of the village... or reload from before the massacre.  saves me a hefty bill from a therapist...",
            "review_score": "1"
        },
        {
            "review_text": "It's Fable, It's fun. The controls are a ♥♥♥♥♥ though.",
            "review_score": "1"
        },
        {
            "review_text": "Still an amazing game but wouldent hurt to impliment some controller gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "It's been my favorite game sins the original came out in september 2004 on xbox",
            "review_score": "1"
        },
        {
            "review_text": "Ran from gaurds in my underwear,while drunk as ♥♥♥♥.10/10 Best college simulator ever",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would buy the swamp brothel again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely amazing! Even without playing the second and third games in the series, I don't doubt that this is the best game out of the three; it'd be hard to top! Well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "The Fable series is my favorite game series of all time. This game will always be my favorite, even though I know what's going to happen, it's extremely fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you can choose between Fable Anniversary or Fable The Lost Chapters, always pick Fable The Last Chapters.  I want to stress two points: 1. When I saw that Fable Anniversary was Fable but with HD graphics, I was blown away, thinking it would look like Fable 3 (admit it, the only good thing there was the graphics), but no. They literaly just took the original graphics and 'sharpened' them. Due to the old player models, everyone looks extremely ugly in HD, especially The Hero. It is very unfortunate that Fable 1 will remain an aged game. 2. In the Fable games, the choices have been very obviously 'good' and 'evil', with little in between. In Fable 1, however, while the choices are still obviously one or the other, they are very complex. I usualy end up with good characters due to being soft, however in Fable 1 I found myself being evil for the entirety of the first part of the game, due to taking most of the evil options with good intentions.",
            "review_score": "1"
        },
        {
            "review_text": "Kickin' Chicken, Balverine whippin'.",
            "review_score": "1"
        },
        {
            "review_text": "This was the very first action-RPG I ever played back in the original Xbox.  It was the first introduction I had not only to the genre, but the medieval fantasy genre as a whole.  This game shaped me into what I am today. My love of everything fantasy, RPGs, and of course, British humor, stems from this game.  Fable TLC stands the test of time, and every time I play it it's like going back again.",
            "review_score": "1"
        },
        {
            "review_text": "The “Test of Time” Award? Fable - The Lost Chapters earned it totally. I need to play this game from start to the end like at least once a year. It's just astonishing. Try for yourself. You can play Anniversary edition as well; hard to tell which one is better - I'm in love with the original one, but Anniversary is much prettier.  PS. Don't look at my record - I've played A LOT outside Steam.",
            "review_score": "1"
        },
        {
            "review_text": "It's very short. If you want a good RPG where you can choose to be good or evil, you should prefer knight of the old republic.  Thanks to Beagán comment, I explain why I'm saying 'It's very short' :  Yes, i played it 28h but in fact i tried to compare the good and evil side, so it's more like 2x 14h. And I was very disapointed. If I read again :  'Each person you aid, each flower you crush, and each creature you slay will change this world forever' [...] 'Create your life story from childhood to death'  but it's not very like that, the side you choose is not very important. And there is a big ellipsis from child to adult. So it's not a bad game but since I buyed it for that I feeled like I was lied.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought it because it supposedly had an amazing story.   Other than a few good parts (escaping from prison was cool), it was mostly memorable only for the annoyances. The 'Chicken Chaser' joke was funny for the first three hours, but the repetition of the same voice acting wherever I went slowly drove me insane. The fact that ALL guards EVERYWHERE look and sound EXACTLY the same also killed any immersion and sense of exploration. It's like the kingdom got its guards from Kamino.  I ended up skipping most of the sidequests and unlockables, and I look back on the game as somewhat of a waste.  It probably held up better at the time, but it's no Bioshock. It's not even Skyrim's little brother in terms of story (and Skyrim only had a decent main storyline).   Gameplay is surprisingly good for a game this old though (lightning!) and it has a blend of action and tab-targeting combat, so there's that. I still can't recommend it though. Go play something else if you want gameplay, and avoid this one if you want a good story.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game on the x box so I purchased it for pc. Unfortunitely, the controls did not port over very well. I wanted to play this game with a controller and am unable to without a 3rd party emulator. I don't know why this game is not better supported for controllers since it was originally designed for them.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't work with windows 7, even in compatiablity mode. Disappointing basue the game is fun too play without prior knowlage of any of the Fable games. Kept crashing in loading screens, now can't load saves. I have restarting my computer after every crash. Extremely Frustating.... ",
            "review_score": "-1"
        },
        {
            "review_text": "too slow moving of a chater didnt like the saving process.",
            "review_score": "-1"
        },
        {
            "review_text": "Really sorry I bought this. Even at $10.00. It crashes constantly. I dropped it down to running on 1 core to get past the Will Power glitch only to get as far as the Arena before it now crashes every time.",
            "review_score": "-1"
        },
        {
            "review_text": "No controller support on a game that was made on a console with controller support. Use xpadder I guess. Nothing new has changed other than that on this game if you were one of the millions of people that bought this game more than a decade ago on the promise from its boneheaded creator that it was gonna be the most amazing thing out there with so many features (that sadly weren't in the game). You run around killing monsters, following a moderately good RPG story and do other stuff as well. Such as collecting, playing mini games and choosing wheter to be a good or bad guy. Most games do what it does better and just to name one around the time that this game out was Elder Scrolls III: Morrowind. The Knights of the Old republic game also was better on the rpg aspect and really letting you feel like you're making good choices or bad choices. The second fable to me personally was a better investment than this, but if it happens to go on sale you should buy it. After all we here at Steam believe in racking in as many games on our library and completely ignoring them when other games we will ignore as well go on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was one of my faves when it was released. Unlike most RPGs, there were immense amounts of choices on how to build, and essentially, how to play as well. There is a main storyline, of course, and a presecribed path to take, but the game does sell on its promised choose your destiny format.  That said, gameplay is quite broken in general, and takes adjustment if you wish to scrape by without the broken aspects. For instance, you can make money simply buy buying and selling stuff to the same shopowner, as his stocks of items fluctuate the cost. Additionally, the most broken skill in the game is Physical Shield, as it not only keeps you from taking any damage at all, but you don't get thrown around, and you never lose your precious combat multiplier, so long as you chug mana potions, and that helps break the game wide open for you. But, in general, any character can grind to the point of being all-powerful, with some time invested, of course, as any build path is open for any character, as even though 'Being good' or 'Being bad' does influence your skill pool minimally, it's even more minute because fluctuating between good and bad is not difficult (especially for being bad...).   All that aside, the game was pretty much the first game to give a hero any type of plotline choices that I saw, and I must commend them for that. However, the game has a poor look for being released on Steam nowadays, and only diehard plot enthusiasts or general gamers who want to experience it all will enjoy this. I had to buy it for old time's sake, and while it has managed to accrue a bit of playtime, I don't see many out there enjoying this for what it's worth in this age of gaming. I really don't know of anything like Fable still, and I enjoyed it more than Fable III (haven't played the others...), but getting through the early game will be hard to weather through to get to the better parts of the plotline and become strong enough to feel less than some shrimpy character at times. In my opinion, casters are very underpowered, partly because Physical Shield is so overpowered, and will sap your mana if you don't kill things fast enough as a caster. The other paths get so much more powerful, and I don't see why you'd even bother. Still a huge step in the right direction for a choose-your-own-path type adventure, but there is still a clearly prescribed path, like any adventure with an adversary. It just has good areas you can stray from the path a bit, and they will effect your destiny in various ways.  I checked... I played it on Steam for 2nd most hours compared to any reviewer, and that's not all that much... I don't know what that could mean for certain, but I'd guess that the majority of reviewers who upvoted it are in it for the nostalgia. It was a good game in its heyday, but I believe that the strengths of this game would be overshadowed too much by its weaknesses in today's gaming environment, even at its lower price. There are a number of games that deserve being carried over into today, but while this one is on the fence for me, I'm leaving my opinion where it was; This game doesn't hold enough appeal to stand out amongst today's games.",
            "review_score": "-1"
        },
        {
            "review_text": "DON'T BUY IF YOU HAVE REDIRECTED YOUR DOCUMENTS FOLDER.  Played it when it first came out and thought it a good game and decided to play through again so bought it when Steam had it on offer. However, this is the first game for ages that I have not been able to run. There seems to be a lot of issues in trying to run this game on modern hardware. If you have the patience it may be worth buying in the hope you can get it to run.",
            "review_score": "-1"
        },
        {
            "review_text": "'INTRUDERS! SHUT THE GATE!'",
            "review_score": "-1"
        },
        {
            "review_text": "NO CONTROLLER SUPPORT",
            "review_score": "-1"
        },
        {
            "review_text": "Possibly one of the ugliest games i've ever played, pretty boring start, the fighting stystem is weird. I guess if you like fabel it's okay. But not my cup of tea tbqh",
            "review_score": "-1"
        },
        {
            "review_text": "Immediatly found the Chapters. Very anticlimactic. Do not reccomend.",
            "review_score": "-1"
        },
        {
            "review_text": "This game shows it's age. Not just in graphics, but in plotline. Maybe the voice acting and side quest mechanics were interesting at the time, but now? Meh. Specific points:  Marketed as a game where you could have influence in the world, but.... -You can be mayor. What does it mean to be mayor? Nothing. You don't do anything, noone reacts. -You can own property. What does it mean to own property? Not much. You can upgrade the furnishings, hang trophies on the wall, and collect rent. And then never go back, because why would you? -You can get married. Find one of the many nameless NPCs and stand in front of them to show off your manly pectorals. Then throw a ring at them. You now have access to the sex scene, which is a fade to black with suggestive voice acting. Never interact with your wife again. -You can be good or evil. What's the difference? Halos or demon horns. You could slaughter the innocent one day, vanquish the wicked the next, and that's totally fine.  The running theme is that none of these decisions impact the story greatly. You can occasionally choose: 'kill this dude' or 'don't kill this dude.' That'll affect 2 or 3 scenes. Basically doesn't matter.  Not sure what to say about the core gameplay. I found it very easy, but YMMV.  ====================================================== Response to first comment:  I am skeptical of your rebuttal, and examined faqs and forum posts to investigate.  Are you sure about that mayor thing? Everything indicates that it does nothing. I did learn that I COULD purchase and rent out buildings and businesses other than the marital homes in each town, but you have to kill the tenant to do so. Which...geez. Talk about a hostile takeover. *rimshot*   Anyway, nobody reacted to me as mayor. And no new properties became available for rent. All signs point to violent death being the only way other property becomes available.  Still not sure what the point of renting things out is. It'd take an awful lot of time just making the rounds accumulating rent to earn the money back, and what is there to spend the money on? There's some legendary sword you can buy with it I guess, but there's dozens of legendary weapons sitting around everywhere anyways. You can pour it into the temple of Avo to shift alignment over to good. That's something I guess, but getting good alignment just happened as a natural result of going through the main quest, since every monster or bandit killed gave some good alignment points.  Didn't realize the spouse would give gifts. So that's something.  All indications also point to never having a child of one's own, that was added in Fable 2. If you marry the right person in Bowerstone, and they happen to be a single parent of one of the children in the school, then the child may be brought along. No sign that the child would eventually act like you. The aging mechanic gets weird here too, since you might get married at age 30, get married, meet your stepchild, then advance levels to age 65 and the stepchild is still the same age.   Good and evil have more result than most of these other effects, but...eh. Complaining that I'm not locked in? Hm. Perhaps I would like to be locked in a little bit. Redemption and corruption stories are interesting, and I don't want to always have to be the stupendously good-aligned butterfly-attracting goodly hero of goodness just because I ate some Tofu one time, but yeah. When I decided to try the other alignment, it was unsatisfying. Swapping the extremes is just too easy, and too without consequence. It doesn't seem the game particularly cares. Townsfolk alternately run away from me or come around to applaud me, and both are kind of annoying. Big clusters of sound files all being played at once either way.  I don't know what your last comment is supposed to imply. Do you mean I shouldn't have needed to spend that much time to complete the main storyline? I could have dropped the sidequests and paid even less attention to the economy, I guess. Do you mean I should have realized that I could kill townspeople and buy their houses? I was definitely surprised to learn that, but I don't see why I would.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like this game but the controls, the graphics style just weren't for me. Normally I would have given games more of a chance but it was just painful to play and having just come off from finishing games like Tomb Raider, DmC, Bioshock Infinite, I just couldn't bear to play this game for long. I normally wouldn't have bought it but I heard good things about the game and I saw it on super sale for less than Big Mac but darn it, I think I should have bought a Big Mac :-D.",
            "review_score": "-1"
        },
        {
            "review_text": "I dont understand all the rave about this game. I finished the game and I really felt I couldnt see what was so good about it. The story is very boring and stupid. Maybe I would appreciate it more if I played it as a ten year old. In fact Im guessing people who rate this game highly are mostly very young people.",
            "review_score": "-1"
        },
        {
            "review_text": "call me chicken-chaser one more ♥♥♥♥ing time",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes constantly. Difficult to even boot.",
            "review_score": "-1"
        },
        {
            "review_text": "boring and childish as hell",
            "review_score": "-1"
        },
        {
            "review_text": "This game is like the water temple in Legend of Zelda, but it's the entire game.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't even feel like this deserves a review. I have tried every Fable game as they came out and they were all without exception garbage. Remember how everyone acknowledged Fable 3 as a terrible, shallow game full of idiotic characters, dull to the point of ♥♥♥♥♥♥♥♥ storyline, ♥♥♥♥♥♥♥♥ to the point of dull button mashing gameplay? Yeah, that's actually every Fable game as seen through the eyes of people who are no longer 8-12 years old and couldn't read all the text in Morrowind.  It's not 'fine for it's time', idiots were fine with it at the time. Games far superior were released a decade before Fable decided to leave it's hideous stain on gaming history. Thanks for supporting the career of one of the game industries many ♥♥♥♥♥♥♥t celebrity developers while dumbing down an entire genre.",
            "review_score": "-1"
        },
        {
            "review_text": "equal parts ambition met with cordial shallowness, fable is a flat oddity. mind you, its not a generic game, nor is it missing anything crucial on a macro scale. fable's problem is that it's severely undercooked. yet simplicity itself can be a virtue within a sphere of confidence. sometimes a basic expression is all that's required to get a point across. it is fable's hinted aspirations among its genre identity that breeds contempt, yet it is no issue with the game itself. from the very start, fable makes apparent that the experience is going to be humble and straightforward. although it works on realization, it's too hard to deny a contradiction of the premise as expected when compared to the actual function. a broad comparison that falls apart as easily as its made would be likening fable as a western legend of zelda. both games are humble and straightforward action hybrids with identical targeting systems, but one game is serious, and one game is not.  in fable and in ocarina of time, the protagonist is a hero of a long bloodline, whose struggle is an inevitable result of that bloodline. in zelda, this is serious business, but in fable, it is not. though it took a total reevaluation of every event in the game to get to this conclusion, truthfully it is evident from the beginning of the game. the expression system of this game, likely developed to allow interaction than anything I’m saying, can only function in an atmosphere of normalcy, unseriousness, and even ridiculousness. yet, though I say heroics in fable are par the course, every person in the world takes it in with awe and reverence anyway. it’s an utter contrast, how unserious and whimsical the things you do are, and how great and magnificent they’re transposed on the world scale. eventually, the two ends meet, and the hero does things worth praising, and it further drives this rift. I think a work should properly separate what is serious and what is not and fable struggles mightily in that regard.  being good or evil is still treated with incredible importance. there are, of course, mundane acts that boost your karma either way. killing townsfolk makes you evil, while killing bandits and some monsters makes you good, among various other things, but consistency is not what I refer to. fable’s plot ramps up into clearly selfish and unselfish choices coinciding the the plot. though your choices have little mention, it is true that you’re allowed to do great good or great evil, and it shapes the tone of the story even if the choices aren’t totally integrated into the plot development. the great contrast of the choices makes them significantly less effective if the player harbors little malice; to me there was a single choice and its foil, never amounting to much weight. those who enjoy acting out villainy will find fable more accommodating, I believe, because the sharp contrast will create more viable choices. to be mentioned, no other pretense is at stake. fable wouldn’t work with morally gray choices, its charm is its exaggeration. if anything at all is successful in fable’s narrative, it would be the grand moral choices.  now, to put it bluntly, the gameplay sucks. fable borrows from the beat ‘em up genre ignorantly. its combat can be likened to prince of persia, which is the worst model on the planet for combat. block stops every attack with no repercussions for blocking, so if required, you can be invincible at any time. enemies annoyingly have the incredible block too, with no wind up or downtime on any of their attacks, making all fodder near identical. which is to say, unsatisfying and irritating. animations are awkward and contact comes with no good feeling or fanfare. a few lame hits in, the enemy will block. when you’re blocked, or you successfully block, the hero’s weapon will glow purple. the other attack button will let the hero do a slightly more damaging guard break attack that will knock the enemy down. unless you hit the enemy while it’s down, it’ll get up and begin blocking again. there are never any weak-tiered enemies; current level enemies will always take a few knockdowns before being defeated. battles only occur in mobs and waves, with the exception of two enemy types and boss fights. one of those enemy types is a flyer that has a limited window of vulnerability, the other and bosses have constant super armor. so, they’re annoying in different ways.  spells and ranged attacks can’t be blocked. it goes without saying they’re the mainstay of your repertoire. arrows are boring, but cost no mana, cost nothing at all, so they are vastly more efficient. offensive spells come out instantly, with a few exceptions, but have bland particles and effects. there are utility and summon spells which I did not use myself, so I can’t fully comment on, but considering the games difficulty and how quickly enemies were dispatched, they’re probably more effort than they’re worth. it doesn’t matter how you fight, despite my criticisms. the only requirement to win is to have potions. they’re very cheap for being basically full heals. I don’t know what revival potions do, because I didn’t die, but I guess they revive you on the spot. my arsenal of 50 potions defeated the game.  easily the best part of fable is its level design. areas are distinct and there are no repetition. they are busy with detail, a careful labor. that being said, every single quest area in the game is a corridor. there are few change ups and they’re in the form of loops or alternate corridors, but the levels remain corridors. towns are, at least, more open affairs. they’re painstakingly detailed too, but there isn’t much to do in them. not a lot to shop for with only 4 tiers of weapons and armors. you can play games at the inn or attempt to bed faceless people and that’s the extent of things to do in town. models are soft and rounded, built to look like toys instead of things. the style is a touch of unique, able to convey realism and fantasy. every character model in the game is ugly despite this. there aren’t that many models either. the guys look like apes and the girls look like dolls. seeing the same ugly models everywhere starts to become distracting and annoying. even the main character is unattractive by default. fable’s scenario design is ok. the main quest is a everlong chain of meniality and fetching until the plot drops, the sidequests are only terrible things like defend quests, escort quests, and timed quests.  overall fable is of poor quality. featuring embarrassing writing and voice acting, limited and blindly executed combat, and uninspired scenario. it has fantastic music and environment design, maybe top tier in both respects, so it isn’t an absolute pain. it might as well be, though, as those aspects are passive quality. the irreverent simplicity of fable’s world did not impress. I want bite with my satire or development with my seriousness, not a work that stops short of either. what fable does have going for it is a combination of things that cannot be had or found in any other game. it’s partly to how npcs react to your character and definitely how it frames moral choices, but fable is an adventure all to itself. it being curious and an obvious work of passion is not enough to overcome its massive flaws. being interested in odd combinations, fable was enjoyable to a point, but I can’t call it any more than a dead average title.",
            "review_score": "-1"
        }
    ]
}