{
    "app_id": 204180,
    "name": "Waveform",
    "release_date": "2012-03-20",
    "developer": [
        "Eden Industries"
    ],
    "publisher": [
        "Eden Industries"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Adventure",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Puzzle",
        "Great Soundtrack"
    ],
    "achievements": 65,
    "positive_ratings": 1778,
    "negative_ratings": 345,
    "price": 0.79,
    "description": "Navigate the beauty and hazards of the solar system while riding a wave of light through 100+ levels in this innovative action-puzzle game!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/204180/header.jpg?t=1492979313",
    "minimum_requirements": "OS: Windows XP or higher Processor: 1 GHz Memory: 512 MB Hard Disk Space: 660 MB Video Card: OpenGL compatible graphics card with 128 MB of memory Sound: Any sound card capable of stereo output",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " One of those indie games with dozens of levels and simple game mechanics. You change wave length and frequency that ship will follow. The goal is to avoid obstacles while catching as many plasma as possible. I don't know why, but it's quite fun for first hour...",
            "review_score": "1"
        },
        {
            "review_text": "I, personally, am not a fan of this game. Why? Because I suck at it. Horribly.  But would I recommend it?  Definitely. It's awesome and looks beautiful. It's well put together.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty damn fun puzzle game with a very simple concept that scales appropriately in difficulty over time. Admittedly some of the features introduced can be quite obnoxious (particularly wormholes) but it's a genuinely enjoyable challenge of skill and timing.  Then you get to the last set of planets and are immediately gated by obnoxious requirements. You see, at each level you are scored a percentage, which awards you a number of stars rounded down to the lowest ten e.g. 79% = 7 stars! Can you see where this is going? Waveform ultimately turns into an obnoxiously grind-fest wherein you're playing the same level over and over to scrap an extra few points out to potentially have enough stars to unlock another level or two. This star requirement is present throughout the game but it really ramps up towards the end.  Honestly it's quite a fun game, but I can't imagine actually finishing it. Probably the perfect tablet game for killing time as you gather those last few stars at a glacial pace over the course of a few weeks. Not worth buying on Steam unfortunately.",
            "review_score": "-1"
        },
        {
            "review_text": "One of those Indie Games that are the best to spend your time when you want to relax. +Nice Soundtrack +Visual Effects",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and well implemented, explored mechanic, mixed with an ambient, relaxing atmosphere. This game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Spent 30 hours on it so far during lunch breaks. It's addictive, fun, original and challenging.",
            "review_score": "1"
        },
        {
            "review_text": "This game is perfect to relax to and listen to music. :) Great vibes/bass within the game.  Worth to buy!  It doesn't make you fall alseep or get bored of. :)",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games you just play for short bursts, but it's fun to play and just challenging enough not to be boring.",
            "review_score": "1"
        },
        {
            "review_text": "Wow I did not expect this game to be this good, its got a story, its got good music, its relaxing, i started playing it yesterday and played it for about an hour straight",
            "review_score": "1"
        },
        {
            "review_text": "Bought it for 20 cents. Wasn't dissapointed, great game, and it gets really hard after the first two planets. Buy it till it's this cheap, and have fun. :)",
            "review_score": "1"
        },
        {
            "review_text": "really good",
            "review_score": "1"
        },
        {
            "review_text": "Vary Great game indeed You navigate by making a Wave with youre mouse and you try to collect some interesting things... And there are lot of levels which is the great for a great game like this It might be hard for some gamers but you will get the hang of it trust me.",
            "review_score": "1"
        },
        {
            "review_text": "If it runs at 60fps on an intergrated card, it's good. It also costed 27 cents. Bonus",
            "review_score": "1"
        },
        {
            "review_text": "For a game I got for 24 cents, I wasn't expecting much. Boy, was I wrong.  It kind of reminds me of a loose osu! spinoff.   &gt; Move around &gt; Follow Patterns &gt; Get points &gt; Get frustrated because you keep dying &gt; Close Game &gt; Re-open the game because you're a ♥♥♥♥ing idiot &gt; Beat the level &gt; Get cocky and try the harder levels &gt; Fail miserably  How could you not love that. At $2.00, probably not. On sale? Hell yeah! For 24 cents, this game is a steal!   7/10",
            "review_score": "1"
        },
        {
            "review_text": "Unique, challenging, and above all fun. Right mix between challenge and entertainment. Definitely try this game out. Cheap and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly challenging and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Simple premise- sort of a platformer in space, but cleverly executed. My first impression was 'neat', and replayable, as you try to get a perfect run. Then I try to clear Pluto. Rage. Why is this so hard all of a sudden? Then a boss fight! Well.. sort of. Great satisfaction upon clearing it though. Curious to see what else is in store, and gonna check out the DLC while on sale. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A challenging and addictive game in which you must control the character's 'path' to increase your score and avoid obstacles.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game! Incredible bass!",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this is awesome game!! I recomend to play it its only 5 euros not that much!!!! I Recommend to play it !",
            "review_score": "1"
        },
        {
            "review_text": "0.19Eur on sale, now this game is definitely on my 'Wavelength' ;)  Makes it a complete no-brainer to check out the beautiful little puzzler, like Pac-man VS The Universe. Sort of reminicent of a minigame you might find inside a bigger title, just with a huge amount of levels. Soundtrack isn't bad either if you're into synths/electro.  9/10 *Excellent way to chill out after an extended twitch gaming session*",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best indie games i have ever played. It is relaxing, challenging, beautiful, good music, easy to play but hard to master, fun...  SO worth buying!!!",
            "review_score": "1"
        },
        {
            "review_text": "While I did enjoy Waveform immensely, it falls just barely shy of being one of my favorites. It's fresh gameplay is strangely addicting, and the speed and movement of the game allows for a lot of adaptability and logic from the player's end. The game doesn't have any crippling flaws. Whenever I messed up, it was my fault not the games. But the game seems to have a bit of a resentful attitude towards adequacy. When I got to the Mercury and Sun levels, the game continuously smacked me in the forehead, saying, '450 stars!? You call that good! Go back and get some more, you ingrateful fool!'. For most of those levels, I'd continuously roll my eyes as I'd scroll back to Pluto and Neptune to replay levels I had already beat just to continue playing the game. If this doesn't bother you or you're rather the perfectionist, this game is perfect for you. I'd just advise caution to people who like to keep their casual games... casual.",
            "review_score": "1"
        },
        {
            "review_text": "What i love about this game is how it has a unique mechanic that is simple to understand but hard to master. It's a really fun challenge. The soundtrack is great as well.",
            "review_score": "1"
        },
        {
            "review_text": "7.2/10 - Challanging and Rewarding  Your goal is to ride a wavelength to the finish line. You use your mouse to control the sharpness of your peaks and craters. Such a simple concept, yet this game provides a serious challange. DLC is only $0.99. Graphics and soundtrack are fun. A great snag for the price.  Worth the full $2. Or more!     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "Very good music, and just the right difficulty. Well worth any price!",
            "review_score": "1"
        },
        {
            "review_text": "This might seem like a reverse review, but don't play this game.  SERIOUSLY!  You won't stop once you start! It will eat your soul.",
            "review_score": "1"
        },
        {
            "review_text": "Innovative, challenging, fun, and beautiful. Though somewhat stressful, its unique brand of on-the-fly puzzle-solving makes it one of my favorite puzzlers of all-time. Truly excellent sound design.",
            "review_score": "1"
        },
        {
            "review_text": "I really wish that there was a 'Maybe” option when writing a review because this game is good, but not great. I got the game while it was on sale and it is enjoyable. Good music, decent controls, and entertaining. But it is not worth $5. Honestly, if the graphics were just a bit worse, it could be a flash game. My one real gripe, besides the price, is that there seems to be a bug sometimes causing your wave to get off center or just not line up no matter what you do and that can ruin a good time. So I would say that if you find this game on sale, buy it, its not a bad game, However do not buy it for the whole $5 because that seems a bit over priced.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is quite buggy and strange to play. It has a lot of issues to start up, especially first time, and it can crash or break. The gameplay is hard to get used to as well. It's cheap, so not much of a waste. You can sell the cards too if you want.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty good game",
            "review_score": "1"
        },
        {
            "review_text": "Cost 24 cents right now, drops 3 cards worth 8 cents a piece. Freegame/10",
            "review_score": "1"
        },
        {
            "review_text": "For some reason crashes a lot",
            "review_score": "-1"
        },
        {
            "review_text": "A very interesting, easy to get into but difficult to do well game based on wave based physics. It may be a more casual game than most, but it is very satisfying!  If nothing else, buy it for the soundtrack, which is a great ambient album!",
            "review_score": "1"
        },
        {
            "review_text": "if this game was a potato, i would be a good potato :D 9.5\\10 potatos",
            "review_score": "1"
        },
        {
            "review_text": "I am not the only one who bought this game for the trading cards, am I?",
            "review_score": "1"
        },
        {
            "review_text": "Waveform is a game that I recommend because: - is a method to banish boredom - is a adventure game - have trading cards - is indie&amp;casual  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "would be more fun for ios/android",
            "review_score": "-1"
        },
        {
            "review_text": "This game isn't worth the $0.19 that I paid for it",
            "review_score": "-1"
        },
        {
            "review_text": "There's something wrong with the game, for some reason I only get a UI and a cursor, I don't get to see the game... I get points randomly when nothing happens, I can reach the limits of the wave controls, seeing the arrows around the cursor go away, but I can't actually play the game as intended. I've tried restarting, reinstalling, using it with different settings for window/full screen and resolution. Nothing works. I'm done wasting my time on this 'game'.",
            "review_score": "-1"
        },
        {
            "review_text": "What? What the... No, no.",
            "review_score": "-1"
        },
        {
            "review_text": "Seems like it would be a fun game if it worked. (Turn off lighting in the options menu if you want it to work.)",
            "review_score": "-1"
        },
        {
            "review_text": "I have a Macbook Pro Retina.  When I start the game it runs in an incredible resolution, something like 7000x4000 (I don't know true window size but it's HUGE), game window doesn't fit onto my 2880x1800 screen, so I can't even see the buttons PLAY and QUIT because they are waaaay to low below the screen edge. Can't play at all.  Also this game can't be switched to fullscreen, so it's a checkmate. Game supposed to be funny and beautiful, but I can't experience it.",
            "review_score": "-1"
        },
        {
            "review_text": "Hey! Where are my cards ( ͡° ʖ̯ ͡°)",
            "review_score": "-1"
        },
        {
            "review_text": "I love it      1/10 IGN - Glitched out really hard",
            "review_score": "-1"
        },
        {
            "review_text": "I have one too many music games and this is prolly not the best one to buy. Is it fun? Yes, but there are others out there that are better. Just search some up!",
            "review_score": "1"
        },
        {
            "review_text": "great game for the price",
            "review_score": "1"
        },
        {
            "review_text": "It says it in the name...",
            "review_score": "1"
        },
        {
            "review_text": "Finally a game that gives a real advantage with ultrawide monitor :DD Nice game, I suggest to try! :)",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for a staggering 28 CENTS. The experience I had was worth $20.",
            "review_score": "1"
        },
        {
            "review_text": "wave form is a very well made game that is based mostly on skill and patience, 100% worth the money that i paid for it, on overall great little game 8/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Great fun. So far it's easy to pass levels, but frustrating that I cannot come close to a perfect score. At first I thought this was a mobile app type of mini-game, but the levels grow and change as you progress. The game has some depth to it! Obviously the core game mechanic stays the same, which makes it wonderfully simple to play. But oh so difficult to master!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting concept, but the controls are very hard.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm intrigued by this game so far. It's nice, simple, and is pretty comforting to play after a day of action packed online shooters. I have to say I love it. It has a good difficulty curve (literally I might add), the music is relaxing, and for the price of a hamburger at a fast food joint (or 20 cents if you're getting it on sale) you really can't go wrong here. So far I haven't unlocked all the content, but I like what I see so far. I'll probably be updating this review as time passes, but it won't change the recommendation I give it. I'm not even half-way in, and I've spent several hours on this. usually indie games like this are super short, so I'm pleasantly surprised.",
            "review_score": "1"
        },
        {
            "review_text": "Cheap, simple and very fun game. Uses only mouse and has great soundtrack ('Venus' is the best) Completing game is easy but getting 100% is hard as hell 9/10 from me. (^ ω ^ )",
            "review_score": "1"
        },
        {
            "review_text": "Tricky to get the hang of at first, but overall a good, challenging, but relaxing puzzler.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting idea for a game but nothing terribly exciting. Worthwhile if it is almost free. Has Steam cards.",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting game",
            "review_score": "1"
        },
        {
            "review_text": "Probably (one of the, if not,) the best game in Steam your dollar can buy. Don't discriminate Waveform based on games within the same price range, this is VERY polished, with decent graphics, few technical bugs, and excellent soundtrack. Heck, I would gladly pay ten times it's $0.69 price tag. Singular mechanics, yes, but it is indeed one of those 'easy to learn, difficult to master' games.",
            "review_score": "1"
        },
        {
            "review_text": "Same as everyone else. Simple, yet challenging entertainment- You can't really go wrong here.",
            "review_score": "1"
        },
        {
            "review_text": "WAVE!! WAVE!! WAVE EVERYWHERE!! This game is really cool with those physics terms which is good for people to learn such terms. I love physics the most, so I'm going to say you should play this awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "I learn mathematical translations. Not only that... I get profit from selling trading cards. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I rarely feel this way about steam games; Waveform is definitely underpriced! I was expecting a very quick, lite and shallow game. It is none of that. I'll go into a bit more detail about this peculiar game.  It is the perfect game to play on a Saturday morning drinking a warm coffee. Mmmmm coffee.  It starts out quite easy, maybe a little too much so, and then takes you on a very skillful and unique journey. I love the mechanics, the mirrors and the bonus 'arrange' levels. The ambiance is also spot on. The music is hit-and-miss, with some great tracks and some not-so-great ones.  Replayability is through the roof. If you want to master this game, you will need to invest quite some time in it, which is good.  I'd say absolutely try this if you are adventurous in the games you enjoy. Or you want to experience short, novel and deep gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Waveform's really cool, a medium paced, gentle, abstract panic-inducer. The controls and gameplay are unique and basic, but like most great games, it takes a while to master. Think of a race game, but you're controlling a waveform .. Um. View video of it if you can and add a lot of active interaction. Every level you play can be beaten on the first time through, but you get bonuses in the game based on how well you do, so there is strong incentive to replay each level a few times to improve your rating on each. This might sound repetitive, but Waveform is excellent about each level being similar but different enough to keep players interested. Great music helps as well. So far, I haven't seen levels take longer than a few minutes, which also helps with replays, but that creates a very strong 'Just one more level' effect. Waveform is like a puzzle race... sort of. I like it quite a bit. Have a look at it if you like good games that are off the beaten path.",
            "review_score": "1"
        },
        {
            "review_text": "A cute little game you'll probably play just for a few hours, but it's a nice arcade with funny graphics and a pretty nice soundtrack. If you find it on sale buy it, it's like a crummy old hatchback: good, cheap, honest fun",
            "review_score": "1"
        },
        {
            "review_text": "It was fun playing the first two planets, but at the end of the 2nd, it started to get hard and then I said screw it, uninstall, this game doesn't hold a lot of replayability power, but since its for free. I recommend trying it out. I enjoy the sounds too!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great little game, nice music, plays nice just fun and relaxing game",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. (y) Just hard to learn..",
            "review_score": "1"
        },
        {
            "review_text": "Unsure why. But this isn't loading for me. Great game.. when it launched.. any advice would be appreciated. Thanks! :D (already reinstalled, no luck)",
            "review_score": "-1"
        },
        {
            "review_text": "Was on sale for 0,24, sold the cards for 0,26, im rich now. filty rich!",
            "review_score": "1"
        },
        {
            "review_text": "great idea and good game a bit too little for 5$ but it's on sale every now and then  so it's very recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Good game to practice your mouse control in.",
            "review_score": "1"
        },
        {
            "review_text": "mehhhh its ok i guess, not much 'i wana go play this game feeling tho'",
            "review_score": "1"
        },
        {
            "review_text": "Thx for this game!",
            "review_score": "1"
        },
        {
            "review_text": "Boring asf but kind of fun i guess?",
            "review_score": "1"
        },
        {
            "review_text": "Great game! My friend found out about this game when he gave it to me as a birthday present. At first I was a little bit sceptical, but after just a few minutes, I understood that this was my new Skyrim. There are so many things you can do in this game and I would recommend it to everyone that likes fast-paced wavy, formy games.",
            "review_score": "1"
        },
        {
            "review_text": "Difficult game and a bit boring ..",
            "review_score": "1"
        },
        {
            "review_text": "This game is addictive.  Does not have many levels but those they have are very good. And unlike other 'small' games it has the saving of level.",
            "review_score": "1"
        },
        {
            "review_text": "highly enjoyable game, simple but effective, one of those games you either play to relax or when you have a hardcore 100% completionist itch, either way its fun.",
            "review_score": "1"
        }
    ]
}