{
    "app_id": 204940,
    "name": "Crusader Kings Complete",
    "release_date": "2012-02-14",
    "developer": [
        "Paradox Development Studio"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Grand Strategy",
        "Medieval"
    ],
    "achievements": 0,
    "positive_ratings": 89,
    "negative_ratings": 53,
    "price": 7.99,
    "description": "Europe is in turmoil. The lands are fragmented into petty fiefs and the Emperor struggles with the Pope. At this very moment the Pope has declared that those who go to liberate the Holy Land will be freed of all sins. Gather prestige and piety and the world will whisper your name in awe.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/204940/header.jpg?t=1447355194",
    "minimum_requirements": "OS: XPProcessor: Pentium III 450 MHzMemory: 128 Mb RAMHard Disk Space: 600 MB Free Hard Drive SpaceVideo Card: 4 Mb Video CardDirectX&reg;: 9.0c or betterSound: DirectX 9.0c compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The King of Sicily went heretical and rebelled against himself, the King of Sicily, which in turn caused a massive revolt across my kingdom. Was unable to put down said revolt and the King's Grandson went on to defeat his grandfather and claim the title King of Sicily for himself.  I still have no idea how any of that was possible but I'm having too much fun to care.",
            "review_score": "1"
        },
        {
            "review_text": "Crusader kings 1 loses the fight against Crusader Kings II, but it is still fun and a cheap game. I like it and the only negative thing in this game in my opinion is that you cannot play as a pagan ruler, which I would really like to do.",
            "review_score": "1"
        },
        {
            "review_text": "the incest is always accidental",
            "review_score": "1"
        },
        {
            "review_text": "Not optimized for modern hardware. I suggest playing it on an outdated computer with WinXP. It's full of graphical glitches making the game unplayable on my computer.",
            "review_score": "1"
        },
        {
            "review_text": "I am fairly dissapointed. Even though the game seems pretty complex, many of its mechanics don't work very well. For example, I tried to conquer some pagan tribes in the Eastern Europe, sent my armies there, but as I declared war on them, after some bigger battles, which they lost, they just kept trying to fight me with diminishing number of forces and even though I crushed them repeatedly, couldn't really defeat them. On top of that, they kept 'spamming' peace negotiation proposals every few seconds and, as I was a vassal to the 'German king' (I know there wasn't such a title in this era), he just kept accepting the proposals and all my sieges were repeatedly broken, even though they had 10 troops left against my armies of thousands. The funny thing is that in that situation, I could decline the peace proposal, but, only if I was FASTER than the German king when clicking on the popup - and then the siege wouldn't be interrupted!  So in the end, every few seconds I got a popup for a battle, a popup of the pagans offering to cease hostilities (which I had to click really fast or risk the German king accepting it) and several random popups for various events. Add to that the fact that armies have something called 'attrition', which means that a number of your troops diminishes over time, depending on various factors - which sounds great and complex and all, but combined with the situation mentioned above, it's just... stupid. I could have probably solved that by picking a different faction, but it's still pretty lame.  No, this is definitely not complexity, more like poor game design.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played many games like this. Games like this seem to confuse 'difficult' with 'cluster-♥♥♥♥'.  As soon as you press play, the game goes full speed ahead without you. In order to stop this, you have to click this tiny banner which does not even look like a button. The game throws out notifications all over your screen before you even know what is going on, and even then it is difficult to ascertain what it is trying to convey. The UI is not even remotely intuitive. The AI makes decisions that make no sense at all. Controlling anything is totally unintuitive.   This game is perfect for people who like to feel superior to others because they spent the time fighting the design, rather than playing the game. You can actually lose before you even started getting into things and then lose over and over again after having your first ruler die because they could not produce offspring. There is nothing you can really do to control this besides going 'please respond' to every ruler on the map when looking for a wife. Even then, you can screw yourself. Not like it matters since your ruler will start to gain vices for no explicit reason, impairing his or her ability to rule. Again, you have NO CONTROL over what happens.   You want to simulate the trait rolls in this game? (DO NOT ACTUALLY DO THIS DO NOT ACTUALLY DO THIS YOU WILL DIE DO NOT ACTUALLY DO THIS) Get a jar of used medical syringes and some rusty nails you found on the side of a construction site. Smash them on the ground and roll around and see what kills you. It does not really matter, but it's an accurate depiction of what it is like being a character in this game. (DO NOT ACTUALLY DO THIS DO NOT ACTUALLY DO THIS YOU IDIOT DO NOT ACTUALLY DO THIS)  Just get CKII. There is much more to do and it's just as 'difficult' without being as obtuse. You won't have to deal with the resolution issues either.   Still, if you absolutely love these types of games, I suppose you can get this one.  Also, it's pronounced 'DOMAIN', not 'DEEMEENZEE'.",
            "review_score": "1"
        },
        {
            "review_text": "FYI This had fatal, horrible display issues on Win 7. Just get CK2.",
            "review_score": "-1"
        },
        {
            "review_text": "Now, I understand that this game is old as dirt but I feel I was tricked into buying it due to the phoney release date set on the Stream store page. I would also like to point out that the publisher of this game has a new game out called Crusader Kings 2, As it happens they were able to release about 20 different DLC packs for that game to nickel and dime you to death but are incapable of updating this game to work properly with a modern PC.   One word comes to mind here and it is 'lazy'. What else can you say about a game which lists it's specs as requiring an obsolete operating system such as XP? I would like to play this game but I can't in it's current state without putting myself at great inconvenience. I have a duel monitor Windows 7 setup and every time I want to play this game I have to disable one of the monitors to prevent the game from putting my main monitor out of range for me when I try running it. If you run it with a multiple monitor setup it'll send one of your monitors out of range forcing you to restart your PC just to regain your primary display. Another thing I would like to make note of is how the game seems to never fully install because each time you launch it from within Steam It'll popup a UAC warning due to the fact that it wants to update DirectX EVERY. FREAKING. TIME.   I bought this game to demo Grand Strategy games in general because Crusader Kings 2 was on sale and I was interested in buying it, I consider the money I spent on this game wasted because I cannot enjoy it fully on my desktop. I hear good things about Crusader Kings 2 but will not buy it now as a matter of principle given the fact that the apathetic developers of this series care only about money and push incompatible garbage like this game on the public without so much as a warning on the store page. Don't bother with this outdated and incompatible game and get the second instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Though Crusader Kings 2 is much better, Crusader KIngs still offers a rich experience. If you want to experience how Paradox grand strategy games felt like before they were cool, try Crusader Kings!",
            "review_score": "1"
        }
    ]
}