{
    "app_id": 204960,
    "name": "Magical Drop V",
    "release_date": "2012-11-15",
    "developer": [
        "Golgoth Studio"
    ],
    "publisher": [
        "UTV Ignition Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "Indie",
        "Casual"
    ],
    "achievements": 23,
    "positive_ratings": 218,
    "negative_ratings": 192,
    "price": 0.79,
    "description": "Magical Drop V is back in a new version fully designed to taking advantage of proven game mechanics, modern visuals and focus on a Social Multiplayer online experience.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/204960/header.jpg?t=1519784050",
    "minimum_requirements": "OS:Windows XP, Vista, 7, Windows 8 Processor:CPU 2GHz Intel Duo Core  Memory:2 GB RAM Graphics:GeForce 8800 GT or equivalent DirectX®:9.0c Hard Drive:500 MB HD space Sound:Compatible DirectX 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I'll be honest, this game is actually fun just like the good old Magical Drop games for the arcade (at least if you're lucky enough to avoid the so reported crashes like me).  Unfortunately I just can't recommend this game because its developers proved themselves to be extremely incompetent. They promised a big patch and never released it nor even mentioned about it ever again since 2013. The game, albeit functional, is clearly unfinished. I don't think they deserve your dollar if they'll keep lacking some proper devs and a proper PR department. They abandoned this game, plain and simple.  Golgoth Studio should be ashamed and learn a lesson.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't be fooled by the notion of Magical Drop on the PC, this is a complete mess by a hack of a publisher. If it seems colorful well, I'm in a bit of an AVGN mood.  For starters, the personality and plot of the cast was more or less written over with generic stuff. This in itself might not be such a gamebreaker if the gameplay itself was good, sadly THAT IS NOT the case.  The game freaking crashes half the time when you start it up. It's like the game itself is trying to save you from it.  Got the game loaded up nice and good? There's not alot beyond versus and story mode, where in the latter you'll run into some cowcrap difficulty where the AI will smack you around far too easily. That leaves versus mode which may work well, but it'd involve inflicting this upon your friends.  Even if it's on super sale, that money's better off someplace else.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like the franchise then stick with Magical Drop 3, really.  This version lacks charm, polish and balance; The AI difficulty is so messy it's not even funny. Matches are lost just because the CPU character is moving absurdly fast, while... The Player character feels slow and unresponsive.  All in all, avoid it like the plague.",
            "review_score": "-1"
        },
        {
            "review_text": "This game's a lot of fun and reminds me a lot of the days of my severe Bust a Move addiction! But, while I was fine with the dudes from Bust a Move being nekkid since they were dinosaurs and dinosaurs didn't wear pants, imagine my embarrasment when my daughter walked in while I was playing Magical Drop V and her first comment was 'That other girl should really be wearing clothes.'   But beyond that, it's a pretty fun puzzler. I'm going to try multiplayer soon, but I swear I'm not being a creeper, I just like puzzle games. For serious. No, really!",
            "review_score": "1"
        },
        {
            "review_text": "Magical Drop V is an interesting, fun, fast-paced game, but it is extremely rough around the edges and randomly quite brutal. The graphics are decent, and the designs of the game are nice (though perhaps not the series' best).  It's worth the price on sale and is fun for as long as it's playable for you. The game itself can be fun, but there is no difficulty curve. Just difficulty. Even on Normal. One minute the game will be challenging enough to be fun, and then suddenly you'll spend the next five rounds swearing that the AI is cheating and wondering if you really should have bought this game until you ultimately rage quit or win by pure luck. This especially happens with the special Ghostlop mode, which can be smooth sailing until its impossible-seeming final boss.  'Auto-save' is also apparently broken, it seems. My personal control settings are never saved and I have to play the tutorial every time I start up the game again. For a while I thought this was just because my display name had special characters in it, but ever since changing my display name it still glitched.  The translation is unrefined though and at times incomprehensible. The game was obviously made for Magical Drop fans, but some of the dialogue exchanges probably aren't any more understandable with background knowledge.   Thankfully, the developers seem to be listening to fans and are still patching the game, so maybe it'll get better. But at the same time, the patch seems to be delayed and the gaem's been released just too long for its current problems to be excusable.  I truly WANT to like this game. I do. But perhaps I would be better off seeking out the previous entries in the series rather than letting this one constantly disappoint me.    EDIT:  Since I bought this game, it has dropped down to $0.99  For that price, I suppose it's a good enough buy if you don't have a previous Magical Drop or don't have a similar game. That's a low enough price for it to just be a novelty, so if you're interested in it then $0.99 is a fine price for it.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is super hard and awesome!! (I dont know why other people hate it.)",
            "review_score": "1"
        },
        {
            "review_text": "if you like ~~uguu kawaii~~ autismic vs. puzzle games, this might be the game for you ;)",
            "review_score": "1"
        },
        {
            "review_text": "DOU DESU  its bright and colorful and kinda loud i dont know its like a dollar its worth it        (Stars the best)",
            "review_score": "1"
        },
        {
            "review_text": "I would like to thank Lachlan for purchasing this masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "Gotta just drop balls everywhere. EVERYWHERE.",
            "review_score": "1"
        },
        {
            "review_text": "I like it for what it is. It's a nice time-waster kind of game. I would like if the game included a single-player quick game mode.",
            "review_score": "1"
        },
        {
            "review_text": "I originally was searching for Magical Drop III, which I couldn't locate anywhere, so I bought this. Not a bad game. Pretty fun overall. Not what I was wanting though (seriously love III better). Yet, still a decent game!",
            "review_score": "1"
        },
        {
            "review_text": "Furiously controller throwing fun! Too bad its kinda busted and it dosen't look like it will be updated anytime soon.",
            "review_score": "1"
        },
        {
            "review_text": "I'd rather play Bejeweled. Not only is that more enjoyable, but it has better functionality.   This game has been abandonded by the developers and remains unpatched, despite it's many many many flaws. The online is dead (and barely worked when people did play, apparently), single player is only five short stages, the story is terrible and achievements are broken.   It's a dollar, but save your money. This game will never be fixed and will probably remain in it's buggy state, since the dev hasn't touched it in 3 years and probably never plans to.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Good stuff, but this is a tough one! I can only recommend it if you are really good at puzzling at high speed or if you have players that are even skilled.",
            "review_score": "1"
        },
        {
            "review_text": "This game has full controller support, I dont see why it isnt on steam big picture, this is a simple puzzle style game, its simple and fun. Just relax and lay waste as you go to war choosing epic bloodhirsthy heros to defend magical land against the forces of evil. Are you brave enough to take on the challenge and stare into the eyes of horror as you battle to save Magical Land???  Rating: 10/10 Value: $9.99",
            "review_score": "1"
        },
        {
            "review_text": "It's decent. It's nothing to write home about, but it's not bad. It's good, and fun in short bursts. GET A CONTROLLER, though. Using the keyboard hurts, as you need to be wicked fast or the AI will KICK YOUR ♥♥♥ repeatedly. It's no Magical Drop III, but it succeeds on what it needs to do, and that is be a fun puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "cute game with lot of japs VA , just like the old arcade version one ..... a lot of fun.  ",
            "review_score": "1"
        },
        {
            "review_text": "Pro:  -its fun with friends  cons:  -Every character screems about something every second it gets annoying quickly - the difficulty spike is masive, most people wont even be able to beat easy at all - constant crashes - little to no back story for new players  overall: I can see me playing this with friends from time to time while waiting for a better bubble popper puzzle to download do to this games quick download, but the solo content is just unforgiving with its major difficulty spike causing it to be un-playable. And im sure this game has decent music but il never know because after 2 minutes of playing i muted the game because of every character screaming/complaning.  1/10 even though it only costs a small amout of pocket change i feel riped off.  ",
            "review_score": "-1"
        },
        {
            "review_text": "If you love Magical drop 1 2 3 , you will love this too.  I love every charactors story in gallary so much.",
            "review_score": "1"
        },
        {
            "review_text": "soooooo worth the price.. buy it and add me (JDOUGH570)",
            "review_score": "1"
        },
        {
            "review_text": "dont know why there is so much negative.  Ilove this game. and its super challenging. its a super kawaiii bubble pop type game.  love the controller support i paid like $.20 cents during the summer sale. no complaints here. lol &lt;3 and i would have gladly paid a dollar.",
            "review_score": "1"
        },
        {
            "review_text": "This is the same gameplay as Magical Drop III but with ♥♥♥♥♥ier art and fewer characters. Where's Tower? High Priestess? Hanged Man? Ghostlop is implemented poorly and the translator attempted to cover his poor work under the guise of intentional humor. Don't pay for this ♥♥♥♥♥♥ product. Just get Kawaks and Magical Drop III, you shouldn't have a problem finding someone to play witrh on the Kaillera servers.",
            "review_score": "-1"
        },
        {
            "review_text": "can Selection Figure in the list",
            "review_score": "-1"
        }
    ]
}