{
    "app_id": 205080,
    "name": "BIT.TRIP FATE",
    "release_date": "2013-07-11",
    "developer": [
        "Gaijin Games"
    ],
    "publisher": [
        "Gaijin Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Music"
    ],
    "achievements": 20,
    "positive_ratings": 68,
    "negative_ratings": 41,
    "price": 6.99,
    "description": "FATE is the penultimate chapter in the six-part BIT.TRIP series and will leave you wondering what’s next.Key Features:The arrow keys control CommanderVideo while the mouse allows you to fire anywhere on screen! Or if you prefer, plug in a controller for dual-stick shooting action!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/205080/header.jpg?t=1478115050",
    "minimum_requirements": "OS:Windows XP SP3 Processor:2.0+ GHz Memory:512 MB RAM Graphics:OpenGL 2.1 and shader model 3 with 128 MB of memory DirectX®:9.0c Hard Drive:100 MB HD space Sound:Any sound card capable of stereo output Additional:Playing with a keyboard and mouse is recommended.",
    "recommended_requirements": "Additional:Playing with a keyboard and mouse is recommended.",
    "reviews": [
        {
            "review_text": "This game is literally a 'linear bullet hell'. It's a unique and cool take on the shoot'em up genre with nice downtempo/dubstep music. Really short though (I beat it in exactly 60 minutes).",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like this game, I really did. Since I loved all of the other BIT.TRIP games, I figured this one would be great! Sadly, it wasn't.  Pros- Good Music Okay Graphics Controller Support Trading cards  Cons- Hard to control Gets boring after a few minutes Levels aren't designed very well  I really wouldn't suggest buying this game, considering it is $10. I might get it if it was $.99 on sale. But other than that, I would stay away from it. ",
            "review_score": "-1"
        },
        {
            "review_text": "A literal 'Rail - Shooter' with electronic music. Who comes up with this!? 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I cant even play it. Just because a fullscreen error &gt;:(",
            "review_score": "-1"
        },
        {
            "review_text": "Well its pretty fun when your bored i guess",
            "review_score": "1"
        },
        {
            "review_text": "i want to liek this game but the mechanic of being on rails in a bullet hell game is just a really dumb idea. sadly this game is a 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "Bit. Trip Fate is a rail shooter game in the style that Bit. Trip is known for. It's 'darker' than the other ones, but it's just as fun.",
            "review_score": "1"
        },
        {
            "review_text": "I like Bit.Trip..... and this one was not a disappointment :)",
            "review_score": "1"
        }
    ]
}