{
    "app_id": 205060,
    "name": "BIT.TRIP CORE",
    "release_date": "2012-10-02",
    "developer": [
        "Gaijin Games"
    ],
    "publisher": [
        "Gaijin Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Action",
        "Rhythm"
    ],
    "achievements": 21,
    "positive_ratings": 70,
    "negative_ratings": 51,
    "price": 6.99,
    "description": "Takes the player into unfamiliar territory as they use NES-style controls to blast their way through the barrage of Beats in this rhythm-music adventure.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/205060/header.jpg?t=1478115100",
    "minimum_requirements": "OS:Windows XP SP3 Processor:2.0+ GHz Memory:512 MB RAM Graphics:OpenGL 2.1 and shader model 3 with 128 MB of memory DirectX®:9.0c Hard Drive:100 MB HD space Sound:Any sound card capable of stereo output",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game required as ton of sacrifices. Pad is near essential, port is completely horrible and functionality of the PC version is near non-existent. If you don't want to risk, I can completely understand that. Avoid if you are not prepared or are not interested in rhythm games in particular.  That said, I just cannot force myself to give this game a negative review, since I had great time playing this. Yes, it's most difficult of the Bit.Trip original series, but the rhythm in this one is nearly hypnotizing. You need to be more precise with hitting those flying bit and pattern recognition is ESSENSIAL but I was constantly finding myself replaying those levels enjoying how much a great musical experience this game is. Your whole mind will act and react to the beat.  That said... Someone should contact the authorities. Making that poor port of such a great game should be considered a crime. This is like leaving a cute, poor puppy alone in the forest. It's sad and unfair.",
            "review_score": "1"
        },
        {
            "review_text": "As much as I like this game, I simply cannot recommend it on PC due to the input lag caused by the game's VSync (disabling it results in the graphics glitching up). I found the keyboard controls to be a hindrance as well (the DPad is simply better).",
            "review_score": "-1"
        },
        {
            "review_text": "It couldn't be any easier to get into the game and it's crzy hard to master. Must buy for any 'old school styled game' lover.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously anoying, as it is VERY diferent from all of the others in the series. Messed my brain up alot. Didnt even bother playing more than a hour",
            "review_score": "-1"
        },
        {
            "review_text": "It's an interesting concept but it's way, way too hard. You'd have to be an alien to be able to play it well. Even harder than beat.",
            "review_score": "-1"
        },
        {
            "review_text": "IF YOU HAVE ANY TYPE OF EPILEPSIA DONT BUY THIS GAME!  This is one more entry in the bit trip series and is not by far my favorite. Its still a good game with good soundtrack and good rythim but i personaly didnt enjoy the mechanics used in this one like i enjoyed the ones in BIT TRIP BEAT. If you are looking to buy a bundle with all the colection then go for it. Its worth it. Otherwise dont buy this title anlone if you havent checked the other titler of the colection that are better in my opinion.",
            "review_score": "-1"
        },
        {
            "review_text": "Simple and challenging arcade rhythm game. Not for everyone, sure, but the game is proof that a game's quality is often more about restraint than bombast, that good mechanics and design often far outweigh production and flash.",
            "review_score": "1"
        },
        {
            "review_text": "This game has nice beats and a very fun challenge.",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty addicting but there is no rhythm or checkpoints. The game is also really short, not at all worth $11.",
            "review_score": "-1"
        }
    ]
}