{
    "app_id": 20510,
    "name": "S.T.A.L.K.E.R.: Clear Sky",
    "release_date": "2008-09-15",
    "developer": [
        "GSC Game World"
    ],
    "publisher": [
        "GSC World Publishing"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "Open World",
        "Atmospheric",
        "Post-apocalyptic"
    ],
    "achievements": 0,
    "positive_ratings": 5550,
    "negative_ratings": 903,
    "price": 7.99,
    "description": "S.T.A.L.K.E.R.: Clear Sky – standalone prequel for the acclaimed S.T.A.L.K.E.R.: Shadow of Chernobyl, which tells you story about the Clear Sky group, that want to research the Zone and understand it better.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/20510/header.jpg?t=1547059383",
    "minimum_requirements": "Supported OS: Microsoft® Windows® XP(Service Pack 2)/Microsoft® Windows® 2000 SP4  Processor: Intel Pentium 4 2.0 Ghz / AMD XP 2200+  Graphics: 128 MB DirectX® 8.0 compatible card / nVIDIA® GeForce™ 5700 / ATI Radeon® 9600  Memory: 512 MB RAM  Sound: DirectX® 9.0 compatible sound card  Hard Drive: 6 GB free hard disc space",
    "recommended_requirements": "Supported OS: Microsoft® Windows® XP/Vista (SP1)  Processor: Intel Core 2 Duo E6400 / AMD 64 X2 4200+  Graphics: 256 MB DirectX® 9.0c compatible card* / nVIDIA® GeForce™ 8800 GT / ATI Radeon® HD 2900 XT  Memory: 2 GB RAM  Sound: DirectX® 9.0 compatible sound card  Hard Drive: 10 GB free hard disc space",
    "reviews": [
        {
            "review_text": " Immersive &amp; unsettling // Recommended for horror-survival enthusiasts looking for a challenge",
            "review_score": "1"
        },
        {
            "review_text": "I don't own this game, but for some reason I can write a review.",
            "review_score": "1"
        },
        {
            "review_text": "This is fallout for real men enough said and your best companions are F5 and F7.",
            "review_score": "1"
        },
        {
            "review_text": "  [muffled cheeki breeki in the distance]",
            "review_score": "1"
        },
        {
            "review_text": "If you like fallout, you will like the STALKER series.  Open World RPG Mutated/Radiated HELL...And some horror  IN RUSSIAN   Play Shadow Of Chernobyl before this one.",
            "review_score": "1"
        },
        {
            "review_text": "Just be in the middle of a battle between two factions, then all of a sudden you hear an echoed 'CHEEKI BREEKI' throughout the area, then you feel haunted for the rest of the game, fearing that the next 'CHEEKI BREEKI' will be heard again, but this time, much louder, and before you know it, he's right next to you. As he takes out his AK-47 he whispers into your ear 'Cheeki...' then guns you down relentlessly as he chugs vodka and yells 'CHEEKI BREEKI' into the sunset as an emission is going off. It's very beautiful. :^)",
            "review_score": "1"
        },
        {
            "review_text": "Spent 1 hour in a Belarus-tractor waiting for backup that never came.   11/10 would wait again.",
            "review_score": "1"
        },
        {
            "review_text": "My recorded playtime is not reflective of actual playtime. I've bought Clear Sky twice now, and I play a modded version now.   So first, I'll give a review of the game by itself, then add a little something for the vets. This is a great tactical fps and rpg game. The gun mechanics feel so good in this game. It's not like most games where bullet spread and accuracy is just enough enough of a factor to notice it in game. Here you you really have to have good aim, and you have to stabilize your gun before you fire. Getting into a battle with a couple bandits with a shotgun in this game feels more epic and real than anything you'll see in a COD or Battlefield or just about any other shooter. The AI is just awesome. Taking cover, blind fire, flanking, retreating, grenades, camping, even sneaking on a rare occasion. The combat mechanics are my favorite part of this game; every gun feels different and realistic, and every encounter gets the adrenalin going.  The art is another thing, some people find the game ugly, but I think it's got the best sun rays and dynamic effects I've ever seen. They had volumetric fog in this around the same time as the AAA games started getting it. There is nothing like the zone though, I find myself screenshotting a lot in this game. Seeing water stream down walls and the sunrays through trees or windows... it's just a beautiful game.  The story is great too, but it is mostly an addition to the story of Call of Chernobyl. That game had a bit of a better story with the whole 'Kill Strelok' mission, but this one simply adds to that. What this story does better than the other STALKER games, and heres where I start talking to the vets, is it takes you through the areas of the zone at a much more balanced and compelling pace. It kinda funnels you through these scenarios that slowly feel more and more epic, because of the gameplay challenges presented.   Now with all that said, I think this is the best of the STALKER games, and I think it's worthy to note that it is cheaper than the others last I saw. Of course they all have their own merits and flaws but I like the mechanics the best in this one, and the challenge. I also believe that it has the best mods available for it, there's a few that combine it with the first stalker which is just perfect I think.",
            "review_score": "1"
        },
        {
            "review_text": "The atmosphere is great, as in any STALKER game, and things are up to the level of SoC and CoP for a while.  Until you decide to get involved in the faction wars (extremely bugged) or until you reach the last 25% of the story: then it's just a military shooter, where enemies will home their granades right between your eyes. Tons and tons of human enemies to kill, but the atmosphere is completely lost. What made SoC and CoP great games was slowly passing though abandoned towns and desolated landscapes, looking for precious artifacts and watching your back from bloodsuckers and other mutants. If you want this in CS, you need to really force it upon the game. On top of that, mind that most (all?) maps and locations are the same of SoC. I played SoC some 4/5 years ago and still got lots of deja vu. It can be nice, realising that you actually know this or that place, but feels a bit lazy somehow.  Overall, I recommend it to STALKER veterans who want a challenge, but perhaps CoP with mods is a better choice. In any case, do not forget to install the Sky Reclaimation Project to fix bugs and enhance the experience. If you have never played a STALKER game, play Shadow of Chernobyl and Call of Prypjat first. Those are the real deal.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing even for 2017, i can't believe i didn't play it sooner (like in 2008). Graphis are good and in some parts better then the AAA crap that was leased in 2016. If you like post apocalyptic FPS survival then give it a go! :)",
            "review_score": "1"
        },
        {
            "review_text": "drinking vodka to reduce radiation, seems legit xD",
            "review_score": "1"
        },
        {
            "review_text": "The Prologue of in my opinion the best open world post apocalyptic games! Clear Sky is trully awesome! I recommend it to all the gamers that want to experience the life in the Zone! STALKER Clear Sky is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "I really think that this game was a nice continuation to Shadow of Chernobyl, but it still doesn't feel as free as Call of Pripyat.",
            "review_score": "1"
        },
        {
            "review_text": "there is a mass amount of cheeki breeki-ing in this game      please buy the ♥♥♥♥ out of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Many say this is the worst S.T.A.L.K.E.R game. Well, for the worst game in the franchise, this game is amazingly addicting! First of all, if you enjoy survival games that are not cheap and full of gimmicks (I'm looking at you Dean) then you will most likely enjoy playing this game! Food, water, and radiation are all there to aid and tear you down as you march through The Zone! Encountering wild animals, dangerous humans, and seemingly other-worldly creatures keeps you on your toes at all times even in 2015! This was my first S.T.A.L.K.E.R game and it will NOT be my last!",
            "review_score": "1"
        },
        {
            "review_text": "Ukrainian and Russian post-apocalyptic open world RPG/FPS taking place around a fictional second accident at Chernobyl. Like the other S.T.A.L.K.E.R. games, mod for best results. Clear Sky is the second game in the series and probably the least favored by the community because of it's bugginess. A strong addition though to the three titles Clear Sky takes players to the Zone before the events of Shadow of Chernobyl. Clear Sky's defining mechanic is faction wars, absent from the other two titles, it also features some new areas and some old but differently inhabited.",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game with a amazing story. Being free to explore is worth it and can let you get good loot to use later. Allot of cool places to see but some are very hard to get to due to mutants / bandits / anomalies. Worth getting if you like post apocalyptic games  Hints: 1. not everything is worth keeping so sell what you dont need 2. bolts are always helpful 3. if you cant kill it, run",
            "review_score": "1"
        },
        {
            "review_text": "In the second installation of the wonderful S.T.A.L.K.E.R. franchise you play a mercenary named Scar. Clear Sky takes place one year prior to the events in the first game. In this prequel, you not only learn about Strelok's past, but you also discover that before settling in The Zone, all of your enemies were participants in the NFL. Becoming quite nostalgic about their past in the world of sports, these said individuals recreate their days on the football field with live grenades.",
            "review_score": "1"
        },
        {
            "review_text": "I fully recommend this game! I've played alitle bit of all three and they're definitely the best game I've played. I don't think there will be another game made like these for awhile",
            "review_score": "1"
        },
        {
            "review_text": "My least favorite of the series but still great.",
            "review_score": "1"
        },
        {
            "review_text": "I have never played a stalker game till steam sales , and as my first stalker game i cant believe how amazing this game is , its so well done way better than fallout. I cant believe i easily maxed this game out and it looks very well detailed. This game is something new its difficult at first but once you learn how to survive you never get bored , cant wait to see its new sequal",
            "review_score": "1"
        },
        {
            "review_text": "this ♥♥♥♥ got more bugs then your momma but its still bangin and just like ur momz i come back for seconds everytiem",
            "review_score": "1"
        },
        {
            "review_text": "Yep play this",
            "review_score": "1"
        },
        {
            "review_text": "(With CS: Complete)  The game even with Clear Sky: Complete is very crashy. During the beginning of the game, crashed on me more than DOZEN times. Yet I was able to make it to the second area. Everything else is good gameplay and very hard. Though word of advice, quick-save often.  7.4/10",
            "review_score": "1"
        },
        {
            "review_text": "Clear Sky tries to follow its predecessor - and fails miserably.   Just take a look at some of these awesome features!  - Hardly any atmosphere, nothing compared to SoC - Characters that have little to no originality and - well - no character. They just sit there and talk. Or they run around and are meaningless. These will probably die soon. - Even more bugs than the first game - Ridiculous AI (sees you in the dark with your lamp off, behind things, inside foliage... just everywhere, but every time you have allies, they are the worst you could imagine) - Incredibly monotonous gameplay -&gt; Just shoot. Kill entire armies of soldiers on your very own, over and over again. Well, if you can spare some time, deal with brutally pugnacious mutants. It doesn't matter what kind of enemy you encounter - they're all mostly bulletproof, unless you hit them multiple times in the head with high-end gear.  I'll just add that I actually play the community made 'Clear Sky Complete' mod that is meant to 'ENHANCE' the entire thing... seriously don't wanna see the vanilla original.  There is exactly one positive point about this game, but solely for those who played the first one: + Many of the areas from SoC are recognizable, but a little different. Veterans will revel in memories. And the new portions of the map are quite interesting as well.  .........BUT: Don't celebrate too much - 'cause if you just fell in love being 'home' at the Cordon or the Garbage again - well, enjoy, because you most likely won't get there a second time. The story line is just too linear to find any sense in travelling back.    Well - all in all it's really sad. But I wanted to have the entire trilogy, so i got the bundle. At least it was on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "OMG, just WoW first type of these games I have played, was big into console gaming till I tried this game now I have about 30 computer games with in 3 months, graphics better, game play smoother, bigger on-line comunity, just all in all better fun! Yes the investment is high to build or buy a good gaming computer, But it is wll worth it!!!!",
            "review_score": "1"
        },
        {
            "review_text": "While not the best of the Stalker series, it does have its merits. The downsides however are multiple, not limited to the repetetive push and pull of faction battles. If the system were more refined this would be an excellent game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best STALKER I have ever played. The textures are outgoing and the combat is easier than the original STALKER. Trust me the game is worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "A worthy sucessor for the second part. Same dense atmosphere and the same depressing zone as usual. New feature are the weapon upgrades and armor upgrades. One of the best games i have ever played. Especially the faction wars that take place while you play and that you can influence.",
            "review_score": "1"
        },
        {
            "review_text": "Very similar to STALKER ShoC (Shadow of Chernobyl). The only differences I can notice (besides internal game mechanics here and there) is that the Clear Sky is a bit bigger from what I've noticed and that this game is longer than ShoC. I have not beat ShoC but in the time I got to say the city that was located at 75% story in Clear Sky, it took me a much shorter time to reach in ShoC. I dont know if there is a magestic throw back in ShoC like the one in Clear Sky that scared the ♥♥♥♥ out of me but other than that Clear Sky is great! I use this game to break my friends into stalker because in my opinion the others are harder, and have better mods. This game is open world, has grid like inventory where say a pistol takes a 1x3 slot and an ak takes say a 2x5 slot and you also have to watch weight encumbrance. There is a nice balance between scavenging, dodging anomalies, hiding from blowouts, and fighting. I would say that the AI get a debuff here, and a buff there. Sometimes the AI no scopes you, sometimes they miss by a bit (which is good!). I hate how the AI scoots you out of the way. Nothing game breaking was spotted, just bugs here and there. This is most definately bolt-throwing simulator 2014 and auto-saving simulator 2014. Why 2014? I wrote this in 2014.I recommend it, worth full price but I always get games on sale:)",
            "review_score": "1"
        },
        {
            "review_text": "Good game not the best in the series but definitely worth playing",
            "review_score": "1"
        },
        {
            "review_text": "the most difficult game i own. anyone who owns this game probably has pressed quicksave more offten then the fire button",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favourite games! Very atmospheric!",
            "review_score": "1"
        },
        {
            "review_text": "In my book this is a classic post-apocalyptic game, with an awesome atmosphere and story even it moved away from novel that inspired the creation of it. You should definitely play it.",
            "review_score": "1"
        },
        {
            "review_text": "S.T.A.L.K.E.R.: Clear Sky  It has been a while since I last played it, but after noticing some updates for some mods I used to play and the lack of a review, I decided to write this.  Anyway... What can I say? An aweful lot, but I'm going to keep it short. This review will touch on two aspects of the game; modded and unmodded.    Modded",
            "review_score": "1"
        },
        {
            "review_text": "Just had some vodka 10/10 would be russian again",
            "review_score": "1"
        },
        {
            "review_text": "You are only Cheeki Breeki enough if you have more Vodka than Boolets",
            "review_score": "1"
        },
        {
            "review_text": "this is my first s.t.a.l.k.e.r game, and i read some reviews and they all said this is the worst in the series because it is half the price of COP and SOC but i was very impressed with the games atmosphere and realisim, even in endgame i had that awesome feeling that my work was being appreciated, and this can be a horror game too, (just hang out in the red forest when night falls) this game impressed me a whole lot and i had alot of fun  8\\10",
            "review_score": "1"
        },
        {
            "review_text": "Great game and a great buy especially on sale. The stalker games are quite challenging due to the strength of the baddies and lack of ammo, and age really well. The only downside is it doesnt have much replay value. An excellent choice if its on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game has many things inside. However over 30% of them are totally broken. But even than this game is great and atmospheric. Shows the zone before the catastrophy. Instead of billions of mutants and 3 days of march without meeting a person u have a game in which u can join a fraction (freedom,duty,bandits[broken but joined and won the game anyway],loners[Loners? Wait what? How can u have a society of loners????? If u are in a group u are not a loner anymore!] and play the game ur way. Not like in shadow of chernobyl the ending is much less scary and much more fair to the player. Simiulary the entire game is much more fair to the player. But still not fair enough. For example if u join bandits every single fraction in game is going to become hostile towards u! So dont join bandits at beggining of the game cuz you wont be able to play the game and finish the singleplayer. Fraction wars are completely BROKEN and Boooooooooooooring and there is a ♥♥♥♥ load of bugs,glitches and stupidity. However it still gives lots of fun and makes ur brain grow. This is a good sci fi not like that stupid Fallout 3 loser over there with its GE.c.KO and Enclave(WE RACIST........... DIE)",
            "review_score": "1"
        },
        {
            "review_text": "After u past the turret section. Haha don't worry the game is fun as hell  10/10 would godmode on turret again",
            "review_score": "1"
        },
        {
            "review_text": "5/10, crappy end game. If you're new to Stalker series, play SoC or Call of Pripyat.  Clear Sky has it's moments. There are lots of well designed environments for geocaching. Day/night cycles highlight game's excellent shadow system. Anomaly artifacts are rare enough. Game works a lot like Shadow of Chernobyl in most aspects.  On down side, some missions aren't that much fun on harder difficulty levels, there is little or no benefits from finding hidden caches, Faction Wars seems like afterthought and won't lend much to gameplay after starting area. Looting corpses for money is very easy. But those problems aren't nothing compared how bad end game is which must be probably one of the worst I've played. It's time-constrained pipe-running in midst of one-shotting grenade-spam enemies spawning from thin air. If you eventually grind it through by memorizing enemy positions, bugged end game makes you finally turn difficulty down and restarting from auto-save. Or go to YouTube for end video.",
            "review_score": "-1"
        },
        {
            "review_text": "Nominated the game for every cheeki and breeki it worths.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but I'd suggest skipping vanilla and go with Clear Sky Complete mod.   It patches up bugs and improves the game just like it did with the other two.",
            "review_score": "1"
        },
        {
            "review_text": "I had high expectations for this game, because of all the good things i've heard about the stalker series. I didn't like this game because there isn't much freedom in the game, you can't free roam much so you have to do the story to progress. That's why i like call of pripyat. That's a real game!",
            "review_score": "-1"
        },
        {
            "review_text": "ANU CHEEKY BREEKY IV DAMKE",
            "review_score": "1"
        },
        {
            "review_text": "Hoping to play through this game again like I use to.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "STALKER Clear Sky review, by Filthy Nick  Graphics: ----------------------------------------------------------------------------------------------------------------------------------------------------- Well the graphics aren't that good, the game runs on the X-RAY 1.5 engine, it's a very old engine, I beleve it was introduced somewhere in 2002. with Oblivion Lost (Yes, STALKER was suposed to be called Oblivion Lost). Xray engine is full of bugs. Damn bugs, anyway this is the Xray engine 1.5 so it's in the 'top form'. It's stable if you use the vanila game. ----------------------------------------------------------------------------------------------------------------------------------------------------- Gameplay: -------------------------------------------------------------------------------------------------------------------------------------------------- STALKER is one of those games, when you start playing them you just can't stop, it's too good, my favorite thing about this game is the faction war (install Clear Skies mod for the better expiriance), you feel like the factions are in a real war. At the very start of the game you need to clear out the Regenade scum so that Clear Sky can take over the swamp. When you are short on cash there is always artefact hunting, with a detector you can find these things so called artefacts, you can sell them for a nice ammount of cash.  The worst thing is when you are in a fight and then your weapon jams, that one second may be the diference bettwen life and death, that's why you always need to reparir your gear. Clear Sky is the first STALKER game that features weapons/suit upgrades, every upgrade has its pros and cons.  Weapons in this game use a realistic bullet physics, they have tracers and everything, bullets will fall after some time so don't expect to kill somebody that is 200m from you with no calculation or what so ever. -------------------------------------------------------------------------------------------------------------------------------------------------- VERDICT: Would I recomend this game? ♥♥♥♥ yeah I would, I got this on steam just because there was a sale, I have the retail version of the game. Oh yeah , all of you who bought the game as a retail copy I suggest you buy it on steam, steam version is really stable unlike the retail version.  8/10 Engine is old, gameplay is damn good, crashes sometimes, get mods for it, it's way better with mods.",
            "review_score": "1"
        },
        {
            "review_text": "'Live and let live' But It doesn't seem like they would let me live. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "In My Opinion Better Than Pripyat.",
            "review_score": "1"
        },
        {
            "review_text": "i'd like this game if it was actually playable",
            "review_score": "1"
        },
        {
            "review_text": "Tryed to put a mod in changing what the characters say every time i shoot my gun it say 'Get out of here stalker' very loudly",
            "review_score": "1"
        },
        {
            "review_text": "Played for 4 hours. Got stuck between safe spots with only 14 seconds left before blowout because I didn't know to check my PDA for a safe spot and other Stalkers were unaffected entirely. Lost all save progress. Shadow of Chernobyl was more fun than this one.",
            "review_score": "-1"
        },
        {
            "review_text": "the worst out of the three stalkers by far. honestly not even worth modding and playing a second time but if thats your kind of thing go for it.  every single enemy is the video game adaptation of the guy from the navy seal copypasta. no matter where you're hiding or how far away you are from them they will scope you out and pop you in the head like its nothing. they also have an absurd amount of merc-seeking grenades on hand at any given time that are always cooked to perfection so you have little to no time to get out of the way before you're bloodsucker chow. not to mention they all like to throw them at the same time so enjoy having 5-6 grenades directly at your feet at least twice during a firefight.  theres also the faction mechanic, funnily enough absent from CoP but its easy to see why. the whole system was half ♥♥♥♥♥ and only relevant in the first hour or two of the game. after that you can pretty much ignore it since it doesnt really affect anything. it would have been a great free-play mechanic but clear sky lacks that entirely.  also the story is bad, like really REALLY bad. what starts out as a simple 'go find strelok and stop him from getting to the center of the zone ok' turns into a long convoluted fetch quest that can be boiled down to 'person A has details on where strelok could be but wont tell you until you do a task, then person A will tell you to go to person B and person B will have you do an exceedingly ♥♥♥♥♥♥♥t task to then tell you to go to person C who does the same exact thing until you finally have a romp through limansk which might as well be you running naked through a football field while a bunch of russian dudes hopped up on cocaine shoot at you from all angles.'  it ain't worth playing. its a prequel to ShoC and really adds nothing to the series as a whole. you could just straight up ignore this game and play ShoC and CoP and you'd get just a good experience as any.",
            "review_score": "-1"
        },
        {
            "review_text": "Non-functional and near impossible to mod with any stability. Play Call of Chernobyl (standalone mod) instead.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game to be A Nu, Cheeki-breeki iv Damke!  Now I am А ну, чики-брики и в дамки! (Double cheeki breeki blyad)  10/10 would cheeki breeki again",
            "review_score": "1"
        },
        {
            "review_text": "Better than first stalker,but not the best of the series.",
            "review_score": "1"
        },
        {
            "review_text": "I could remove kebab at x2 the speed!",
            "review_score": "1"
        },
        {
            "review_text": "CHEEKI BREEKI",
            "review_score": "1"
        },
        {
            "review_text": "huge fan of stalker SoC and metro series. this game replaces the cool story and exploration of SoC with a clunky, poorly implemented faction-war system that'll have you constantly sprinting across the map to bail out your otherwise useless allies.",
            "review_score": "-1"
        },
        {
            "review_text": "I could not get into this game the way I did the original, even though it has been tweaked and improved. The visuals are amazing but the whole clan wars thing never gelled for me. And the sense of purpose that drove me through the first (insanely difficult) STALKER is missing here. There is also no sign of the ultra-cool storyline that popped up just often enough in the first game.  Oh, and the enemy still can head shoot you in pitch dark when you are hiding behind a tree.  Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "I had trouble playing this game as its so much like the first that It was super boring. I still havent beaten it yet. Just skip this game and play pripyat and shadow and you got the full stalker experince",
            "review_score": "-1"
        },
        {
            "review_text": "The game isn't terrible, but it's not great either. The game devs were quite cruel when making this game.  -Possible Spoiler Alert-  Pros: -Repair system. This was much needed, as equipment tends to degrade quickly, which can make the game unnecessarily difficult. -Upgrades. Feeling of progression with the ability to improve your weaopns and armor.  Cons: The game devs were really cruel when making this game. -The beginning of the game is pretty dumb. The bandits have all of the advantages against you (better accuracy, can spray accurately, tank more bullets than you), and you're constantly in 1v8 situations with little to no cover. -A powerful sniper rifle (VSS Vintorez) is available at the very beginning of the game. However, it is unusable without paying a hefty repair cost, and the ammunition it uses cannot be obtained until late in the game, at which this sniper is readily available. In short, it's just dead weight. -There's a machine gun emplacement that guns you down while you run for your life. This is impossible on the hardest difficulty, and even on the easiest difficulty, the machine gun will probably warrant a somewhat expensive repair. -At one point in the game, bandits steal all of your money. Adds insult to injury. -Bandits are total ♥♥♥♥♥, but only they can help you install the best armor upgrades.  -Not many side quests. -The is too linear. I found myself passing through each area exactly once with little reason to backtrack. Unlike the other STALKER games, there's no central hub(s) where one can settle down and relax.  Overall, not recommended unless you're a hardcore STALKER fan that wants bragging rights for playing all the games.",
            "review_score": "-1"
        },
        {
            "review_text": "By far the worst STALKER game of the trilogy. The bugs are gamebreaking, common and unavoidable. The optimization is cancer, and far worse than the other two. The map is ripped straight from shadow of chernobyl, with no changes, moreso removals of previous areas, and the storyline is so boring I had to watch gay porn to get a better narrative after refunding it.",
            "review_score": "-1"
        },
        {
            "review_text": "Your bullets won't ever hit anything past 20 feet. This is getting in my mind. Even Golden Eye for the N64 has a better hit box...",
            "review_score": "-1"
        },
        {
            "review_text": "As much as I love 'Shadow of Charnobyl' and 'Call of Prypiat' - this one sucks all the way !!! From the point of Limansk I had to force myself to even finish it. First of all - no matter how difficult you set the game - the difficulty level is absurd. Be prepeared to load last save countless times. But the worst of all - bugs, bugs and even more bugs. Enemy hits with the grenades ALWAYS, while you... well, I don't really remember hitting the spot even once (and I tried really many times). Above all - your granades DOES NOT WOUND the enemy at all. Adding that your enemies see you all the time (even when you are hiding), and can shoot trough walls, while your supposed 'friends' simply push you out of the way (usually out of cover into direct firinig line or off the bridge). Oh, and almost all sub-quests fall into category 'go fetch something and bring it here' - fun once or twice, but that's all. In other words, if you liked 'Shadow of Charnobyl' and 'Call of Pripiat' - DO NOT TRY THIS GAME !!!",
            "review_score": "-1"
        },
        {
            "review_text": "One of the most broken games available. Even if you've got a load of extra cash lying around, I wouldn't recommend buying this game. The game seems great at first with wide-open areas and decent visuals but it all goes downhill from there. It seems the vast majority of the game is plagued with radiation that keeps you from exploring it, and all other areas are loaded with bandits and military goons. The biggest problem with the game are the loads of human enemies that litter the world turning it into a standard spray and pray shoot-out, but with a special catch: every single enemy is a bullet sponge that can absorb clip after clip, the only saving grace being that sometimes a headshot will kill them instantly. Other problems rise from certain parts of the game being a pain to get to because of broken hit-boxes or dozens of 'anomalies' being in the way that make traversing slow and mind-numbing. The tutorials also don't explain a whole lot, the UI is mediocre, and secondary quests are a pain to deal with because of a bad map and the many environmental blockages that will get in your way. It would be enjoyable to wander the expansive wastes, but sadly every five steps you take runs you into an irradiated field or an anomaly that will explode into a cloud of lightning and send you flying. Overall, a terrible game with basically no redeeming qualities.",
            "review_score": "-1"
        },
        {
            "review_text": "Eh, it's alright... nothing special...",
            "review_score": "-1"
        },
        {
            "review_text": "The Stalker series is great, just not this one. Though I have only played about 6 hours, the game has no substance. If you want the STALKER experience get Shadow of Chernobyl, plus there are tons and tons of mods for SOC that make gameplay even better.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has no tutorial and kind of hard to know who you have to talk too",
            "review_score": "-1"
        },
        {
            "review_text": "The A.I. is just pathetic. A whole group of enemy 25 yards away will forget you are there if you duck behind a corner. Enemies wont even react to being shot if they dont see you poking out from behind a corner.   Needs serious work on AI.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't play it because my PC is ♥♥♥. 2/10. ",
            "review_score": "-1"
        },
        {
            "review_text": "Skip this, go straight to Call Of Pripyat, a massive misfire.   Pro's  - Better graphics - An upgrade system   Cons  - Removes atmosphere/edge of original - Spams AI until it becomes a chore - Characters barely speak Russian - Recyled areas - Poorly thought out choreographed sections   ",
            "review_score": "-1"
        },
        {
            "review_text": "it sucks the whole series is lazy and unbalanced its hard to explain but trust me spend your 10 dollars on something better",
            "review_score": "-1"
        },
        {
            "review_text": "I love the graphics and atmosphere. It puts you in a surreal mood.  Put gameplay wise im shocked, i just can't believe how many rounds it takes to kill an enemy. After the first section of the game you encounter enemies who can take 40 assault rifle rounds to the chest and still live. But don't worry.. you still die in two shots.   For a game with such a mature and gritty atmosphere i was super surprised to see how poor and unrealistic the combat was. Also the weapon models don't fit the gritty atmoshere, the shotguns look shiny and round. Its hard to describe but i just think the weapon models look bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Not working!!!! buy retail copy",
            "review_score": "-1"
        },
        {
            "review_text": "I spent 22 hrs of my life for nothing!!! ..Thanx to GSC Game World !!!  P.S. somewhere in the middle of the campain (after 22 hrs of gameplay), all my saves stop't loading. (the game was giving out an error, that the Xrengine has F*ck't up)  Thank you GSC Game World ...u suck",
            "review_score": "-1"
        },
        {
            "review_text": "this game is nothing like the reviews say i died 5 times on the first mission on easy the game would probly be good if you could beat the game but atlest it runs on windows 10",
            "review_score": "-1"
        },
        {
            "review_text": "Ball of ♥♥♥♥♥, saddens me that i can't get a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is unoptimized as ♥♥♥♥, stalker SoC and CoP is better than this ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks big time.",
            "review_score": "-1"
        },
        {
            "review_text": "Died randomly after waking up from the first mission. 10/10 like skyrim with guns",
            "review_score": "1"
        },
        {
            "review_text": "' Get out of here stalker! '",
            "review_score": "1"
        },
        {
            "review_text": "The game has some serious issues with crashing and corrupting save files. So look for ways to fix this before playing it. Otherwise the game play is a f****** masterpierce and will drag you in like a sponge.",
            "review_score": "1"
        },
        {
            "review_text": "My favourite entry in the S.T.A.L.K.E.R trilogy. This is a thinking man's hardcore mouse &amp; keyboard shooter.  I strongly suggest you play Shadow of Chernobyl first. The story of Clear Sky presupposes a familiarity with Shadow of Chernobyl, but mostly the game mechanics are so much better in Clear Sky that you won't enjoy the first game as much if played out of order.",
            "review_score": "1"
        },
        {
            "review_text": "More like S.T.A.L.K.E.R. Clear Colon (Becaue I Had An Anal Evacuaction All Over This ♥♥♥♥♥♥ Game!)  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Overrated piece of ♥♥♥♥, almost unplayable without mods. There are games in alpha that feel more complete than this crap.",
            "review_score": "-1"
        },
        {
            "review_text": "Toughest STALKER out there. Chiki Briki.",
            "review_score": "1"
        },
        {
            "review_text": "You know what... this game isn't good. Yet somehow I managed to have lots of fun it it. I can't explain it. If you're looking for an example for why you can still have fun (and not in an ironic kind of way) in bad games, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I went to a freindly camp I was allied with and shot everyone there, and noone knows about it   10/10 best game ever for betraying people :D ",
            "review_score": "1"
        },
        {
            "review_text": "Love The Stalker games but this one crashes all the time for me and I have an ok Pc and can run the other ones just fine its a bummer.",
            "review_score": "-1"
        },
        {
            "review_text": "again a oldie but goldie. pre-story for SoC? Master was pretty intense and rage-quitty. but the zone wars were fun. Sky-Reclamation-Project-Mod for anti-bug. ay comrade!",
            "review_score": "1"
        },
        {
            "review_text": "Ok so this is my first S.T.A.L.K.E.R. game and I have to say I LOVE IT. I almost didn't get it however, because of video reviews on youtube. They were all pretty negative but I have to strongly disagree with them and say I'm super glad that I got it. Now here are two things that I have seen so far to be common negatives in reviews but I haven't seen in game: - I have not been sniped with a pistol. - I can easily avoid grenades. (I use easily lightly. I just mean they're not like tactical nukes)  I am, by the way, using no mods. Don't get me wrong though, this game is extremely difficult. Especially if you have no idea what your doing and die from radiation without noticing it and making the same mistake... again.. and again. But to me this makes this game beautiful. It's a harsh world that you just get thrown into. If you save a lot (and I mean A LOT), you should be fine and get a hang of the game pretty quickly without too much frustration.   Another thing I will address is that some people have a problem with the shooting mechanic. I have heard that it's really just rolling the dice. Now I know this sounds bad, I thought it did, but when I actually played, I realized it wasn't as bad as it was said to be. You are going to miss, but this just adds to the realism. And the AI aren't that bad either. The worst I've seen so far is a soldier still firing his gun after all the enemies were killed, which, by my standards, isn't anything incredibly bad. They are kinda tactical and are good to fight alongside.   Now, on the line of atmosphere. IT IS PHENOMENAL. Keep in mind I don't use any mods, so this game is just made this well! Speaking mostly from the swamps, the atmosphere is pretty engaging. From the AIs all moving around and communicating within a real time world to the footsteps you can hear in the bushes alongside the path (I'm not kidding. It's creepy), this atmosphere really plays out the situation well and keeps you engaged.   So if you take anything from this review, just know that your opinion is probably different from another review, so if you're even thinking about getting it.. get it. Trust me it's worth it. DARK SOULS + FALLOUT = S.T.A.L.K.E.R.   8/8 m8 would stalk her again",
            "review_score": "1"
        },
        {
            "review_text": "Great game even though it is known to be the weakest in the whole series (and has many bugs) it is still a very unique and great game to start off the series with, just get mods or patchs to fix up the bugs. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "awsome!",
            "review_score": "1"
        },
        {
            "review_text": "great atmosphere. bleak and apocalyptic but with a eastern european flavor to it .",
            "review_score": "1"
        },
        {
            "review_text": "This is an improvement of Stalker SoC. It looks nice, but with mods better, sometiems crashes but overall its very fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Your not alone in the begining and wear the brown pants when playing at ALL TIMES. Good day.",
            "review_score": "1"
        },
        {
            "review_text": "Not much to say about it. However, it's a little disappointment compared to CoP &amp; SoC. But it's a good game, &amp; I recommend it! :)",
            "review_score": "1"
        },
        {
            "review_text": "Had a blast playing this game! If you've played the first game of the series, Shadows of Chernobyl (SoC)—this second installation is a prequal—you'll find lots of similarities, but a few distinct differences. Gone are the moments of terror and tension of 'stalking' through radiation- and anomaly-infested facilities wondering in fear of what may be around the corner. You still do a lot of it—the game world is near identical to the original SoC; however, this time the pace is much more action-oriented.   A new 'faction' mode compels you to spend a lot of your time fending off other humans (bandtis, renegades, military, etc...) in a 'capture-the-flag' type game mode, so a lot of time is spent fending off enemies in weapon-to-weapon situations. If you're a fan of the horror motif of SoC, it's been toned down quite a bit, but if you enjoy working with very intelligent AI to take control of key positions, then you'll find that aspect of the game very engaging.  The upgrade mechanic is also a welcomed mechanic; however, it was frustrating at first using low-end base weapons and watching them miss their mark more often than not. Cost of upgrades were also a little pricey, forcing you to choose very carefully or run the risk of spending additional hours grinding to make enough money to craft a new weapon to your liking.  Overall, definitely worthy of the series, albeit a slightly differenty type of game than the original, but the differences were definitely more of a positive than a negative. Would definitely recommend this game, even if you've never played SoC (but I would recommend playing SoC first, as their are some major spoilers right away that reference aspects of that first game).  Now I'm looking forward to finishing off the trilogy with Call of Pripyat!",
            "review_score": "1"
        },
        {
            "review_text": "Easiest S.T.A.L.K.E.R. game pretty much open world survival not much of a story but its still fun but its even better when you listen to cheeki breeki hard bass while playing trust me",
            "review_score": "1"
        },
        {
            "review_text": "Play S.T.A.L.K.E.R. Because all you really need in a game is a gas mask, some vodka and a fully customised AK-47.   This game has the best ballistics engine i've ever played, and combat that is so satisfying you will walk around the huge maps just looking for things to shoot.  Combine that with a gritty rpg mission system that makes Fallout 3 look 'linear',and you are close to seeing why I love this game so much.",
            "review_score": "1"
        },
        {
            "review_text": "The first Swamps level is probably the best thing about Clear Sky -- it really does feel like it is building on Shadow of Chernobyl to greater heights! Unfortunately, it builds the game up to a level it cannot sustain.  It's kind of cool to revist a lot of the same places and see them in a slightly different light. But by the time you are going through the Agroprom and Yantar, the novelty begins to wear off.  Add in the numerous bugs and outright crashes towards the end of the game, even with the Complete mod, and I was seriously getting frustrated towards the end of my 150-hour playthrough. Oh, and the final act feels rushed, just like it did in SoC. And don't even get me STARTED on the final level! Argh!  Still, the nod to the film Stalker in the penultimate level is very nice, though it is a shame the game rushes you through it without too much chance to revel in the environments.  Overall -- definitely weaker and less polished that SoC Complete, but still, I managed to clock up a good amount of hours out of Clear Sky. It never quite manages to surpass its opening, though, which is a shame.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people have rightly said that Clear Sky was disappointing after Shadow of Chernobyl. I agree, mostly because a lot of the maps are just reworkings from the first game. Also, there is a little less depth in the story, tipping the scale into Clear Sky being more of a straight shooter.  However, the 'factions' war element brings something genuinely new to the game. Moreover, all the great visuals are still there and, when the new maps come along from time to time, they are still a real treat! I like the changes that have been made to the artifacts 'system' as well - there are fewer of them to be had, and they are harder (and more dangerous) to acquire. This adds value to their value.  If you have an itch to replay Chernobyl, but perhaps don't want to play through the exact same game again, get Clear Sky, especially if its on offer. Clear Sky proivdes enough of a difference for you to get your STALKER fix!   People tell me that Pripyat is even better again... I'm saving it though!",
            "review_score": "1"
        },
        {
            "review_text": "Combining my favorite game genres, Stalker is an FPSRPG you just shouldn't miss. A prequel to Shadow of Chernobyl, it takes a lot of maps from the original game and a few new areas of its own, with a new twist and improved gameplay mechanics. It's unique system creates gameplay scenarios you really can't find anywhere else. A game worth playing if you enjoy survival games.   There are plenty of mods to choose from as well, but if you want to play a modded game, you'll usually have to start a new one. You can't decide in the middle of the game you don't like something, and go find a mod to fix it, most require a fresh start entirely. Definitely do-able without mods, though there are some frustrating things that were never fixed (like NPC nade spam) and some bugs or quirks to address. Doesn't hurt to do a little reading up first, to decide if you'd like a vanilla or modded experiance your first time through.",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is, If you haven't played any of the S.T.A.L.K.E.R. games, you need to START!!",
            "review_score": "1"
        },
        {
            "review_text": "Very moody and atmospheric, it will have you on the edge of yout seat for most of the game. If you want a nice, slow absorbing role playing game, then stalker clear sky is your game!",
            "review_score": "1"
        },
        {
            "review_text": "Moooore ESS TEE AYE ELL KAY EEE ARE, this time with extra levels and DirectX 10! Wowee! A huge graphical leap over its predecessor, and a solid step in terms of gameplay, but kinda hard to get started with, and not just because the objective system is kinda crummy. It suffers from much of the glitchyness of the first game, so even with all the new stuff (and a lot of recycled levels) it's kindofa suck. It's my personal favorite just because it hits the sweet spot of scope and graphics, though, and also because I streamed it one time and decided the protagonist is Russian Batman. 3/5 for execution, but 5/5 in my -heart.-",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting engine update with some nice visuals and some cool new areas. However, the game felt very short compared to SoC and was not nearly as involving for me.  However, it is still a good game thoguh I personally feel it is the weakest of the three.",
            "review_score": "1"
        },
        {
            "review_text": "this game is by no means the best STALKER game, but it is also by no means a bad game  while riddled with bugs, it is still an enjoyable STALKER game",
            "review_score": "1"
        },
        {
            "review_text": "Though by far the buggiest and often considered the worst of the STALKER games, the prequel Clear Sky is in its own right a good game, especially when paired with the Clear Sky Complete mod. Unlike Shadow of Chernobyl and Call of Pripyat, the various factions in the Zone have engaged in open warfare, and you can side with either the Bandits or the Loners, or Duty and Freedom, along with the titular Clear Sky faction. The main game areas comprise of much of the areas present in STALKER: Shadow of Chernobyl, along with several new locations. New features introduced in Clear Sky include weapon upgrades and modifications, along with the faction wars feature.  Do note that many players, myself included, consider the Clear Sky Complete mod almost mandatory to enjoy this game.  Now get out of here, Stalker.",
            "review_score": "1"
        },
        {
            "review_text": "Great game that is very atmospheric, immersive and realistic.",
            "review_score": "1"
        },
        {
            "review_text": "If you play DayZ, you might like this game S.T.A.L.K.E.R.: Clear Sky, on storymode, you must survive, and scavenge for supplies as you would do in DayZ. In this open world game, you can venture into the zone and either kill npc's, or sooperate with them and start missions, and choose missions be important characters in the game, but only in storymode, multiplayer is only deathmatches and captures. But the game is thrilling, and fun to play, I really do suggest this to DayZ fans.",
            "review_score": "1"
        },
        {
            "review_text": "Not many games can run on my windows vista home premium computer so when I found that this game ran just fine I had to get it. The game is so immersive you can follow the main quest or you can choose a faction and wage war against all the other factions,,,,,though at times the game will throw a jumpscare at you at complete random. But it's a really good game and should be appreciated as such.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. The firefights were a little wonky compared to what you'd usually expect from like Fallout, as the recoil and accuracy on many weapons are little until they're upgraded, but the upgrading part is also what makes it really fun as well. The graphics are a bit old, but the gameplay is still fresh. But just know that this game is not easy. It took over 25 hours for me to beat on the EASIEST mode.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, i'll write a decent review for this one. It is a challenging game. A tad glitchy, yet very entertaining. Plenty of factions to take part in with varying side missions and areas to explore. You need to scavenge to survive, it doesn't have an experience system which kind of disappointed me but none the less a great game.",
            "review_score": "1"
        },
        {
            "review_text": "the S.T.A.L.K.E.R. series are literally the best games i have ever played. -ign  10 out of 10 would bang again (I mean the 'nades) -GabeN  This is the real reason I want to take Ukraine 'back' -vladimir putin",
            "review_score": "1"
        },
        {
            "review_text": "Great game, BUT.... Buttload of freezes, about every 10 min at least. Make sure to hit f5 every 30 seconds or so guys otherwise your gonna have a brutal time. Loved the game, but the constant bugs and non existent freeplay after the end killed it for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Weakest in the series. The game gets really unintentionally hard at master difficulty. For better experience use Complete mod or OGSM Clear Sky mod.",
            "review_score": "1"
        },
        {
            "review_text": "This game was ambitious and had a lot of potential but bugs brought it down. If you decide to start playing it now, it's a lot smoother than it was at release. Clear Sky complete makes it MUCH better.",
            "review_score": "1"
        },
        {
            "review_text": "The worst of the staler series but still a stalker game.Have this grim feeling of loneliness and great details in the environment.It has some improvements (the artifact hunting) to first game ,and some dis-improvements (especially the immortal bloodscukers).  Will going to write more detailed resumes for the two other games (more over the story line depends too much on the first game).This one worth its money , just the other two are better.  Anyway who gives this one downvote will be banished to the Zone for a life.",
            "review_score": "1"
        },
        {
            "review_text": "Is a bit repetitive if you want to aquire enough money to upgrade weapons and armour. But I imagine that just makes it all the more realistic. Might be nice to have an easy setting for those of us who would like to escape for a bit into a game and not just enter another world of rats in a maze searching for a reward. I haven't noticed any glitches mentioned in reviews I read before puchasing the game. The odd error here and there that may have nothing to do with the programming. I'm running it on an HP Pavillion dv6 laptop and it seems fine. Haven't tried mods, just strait up been playing the game. Could be a 'finish the main objectives, get the good gear, then go back and explore type game.' I printed the manual and it has proved useful. There could be a better tutorial. But, then, that just makes it more like real life. And that can be detrimental to enjoying a game.",
            "review_score": "1"
        },
        {
            "review_text": "I love these games, CoP was by far the best coming out 2 years after. But CS has it's problems. It's weapon aim and style are odd mainly in small arms (pistols) and the game is slow starting out. DO NOT PLAY THIS GAME WITHOUT PLAYING CoP OR SoC BECAUSE IT GETS BETTER AFTER THE FIRST SEVERAL MISSIONS, BUT FAR LESS LOVABLE THAN THE OTHER TWO.",
            "review_score": "1"
        },
        {
            "review_text": "Solid FPS, but I think SoC, the previous one, was better. The story isn't engaging, and looses the focus on the main character, sudenly you don't know why you are killing everyone. The ending was meh... There is no point in upgrading weapons and I used the same initial armour all game without problems. In SoC it teared out, and was imperative to buy new ones and better, and radiation was an issue. Here in CS losses those challenges. AI is not that smart, although now they use their granades, wich is a nice touch. I ran through the main missions, rushing it a bit. But there are many factions and side quest to do if that is your thing, maybe the story develops there.",
            "review_score": "1"
        },
        {
            "review_text": "Another fantastic stalker game. Never followed the plot or the factions, just made my way to the story checkpoints. Nearly got stuck a few times due to difficulty spikes and running out of ammo/decent weapons, but eventually managed it. Some really fantastic moments.",
            "review_score": "1"
        },
        {
            "review_text": "A great series, game was pretty good but it crashed more than Paul Walker and was buggy as hell, Spent about half my game time rebooting and reloading corrupted saves.",
            "review_score": "-1"
        },
        {
            "review_text": "I absolutely loved this series. The S.T.A.L.K.E.R. series was one of my favorite. The game can be fun and challenging but it has a litany of problems. A list of GAME BREAKING problems, one of which I would say caused me to rage uninstall and that's it's quick load system. The quick load system can potentially destroy the game by making potentially hostile people you need to talk first not even give you the time of day! This causes you to have to kill them which makes you miss an essential portion of the game and you have to entirely restart a new playthrough to fix it. So rather than do that, I'll just uninstall it. It's a damn shame that THIS of ALL THINGS be what makes me quit. So as much as I love it, I can't recommend this game because of how much of a buggy piece of garbage it can be. That such a little thing be some game breaking is a massive over sight in my eyes.  tl;dr - The game is easy to break and impossible to repair due to their save system. One of MANY glitches.",
            "review_score": "-1"
        },
        {
            "review_text": "I feel something is creeping towards me at nights. I feel i might get jumped by some bandits in forest. I feel vodaka might be a good drink. I feel i am like a stalker who is trying to survive each and every day lol.",
            "review_score": "1"
        },
        {
            "review_text": " Plot Summary",
            "review_score": "1"
        },
        {
            "review_text": "I started playing clear sky because i had bought the stalker bundle. prior i had played shadow of chernobyl 2 times already.  -gameplay the clear sky gameplay on master difficulty is frustrating. The enemies have insane accuracy and can only be easily killed if you already know their location and can get a quic shot in the head on them. But when you try to outgun them they will kill you with ease. also if you try to peak amd kill there is one more obstacle to be overwon. That would be the ♥♥♥♥♥♥♥t sniper grenades. EVERY enemy in the game has atleast one grenade in their pockets. The moment you seek cover you can hear them pull the pin out. this mechanic is extremely ♥♥♥♥♥♥♥t when you stand far away as the grenades will explode at your feet instantly killing you. cs also has the worst bleeding any stalker game has ever had. you need atleast 3 bandages to heal your bleeding which are hard to come by.  -story the story is very lame and dissapointing lame. -faction wars a fun mechanic which had been implemented horribly. it is the only way to earn some good money in this game which feels like a grind(i would rather do some jobs).  -artifact system the new artifact system is better than soc. you have to scan for them in anommalies risking your life to make a buck or 2. which is a fun experience. The builds of the artifacts make more sense also. you start with antiradiation artifacts like jellyfis and wrenched and then you pick a artifact which increases one of your stats (which most likely have a debuff on them). i would recommend call of pripyat more but if you like a game with a good story shadow of chernobyl is the way to go.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I edited the outfits file to sprint and carry 5 artifacts in an Exoskeleton 10/10  But seriously, it's a lot of fun. It may be the most unstable of all the STALKER games, even with the complete mod, but it's still a lot of fun. Even if the sidequests don't work for me. Even if the bandits keep taking over the grabage. Even if their trader shoots me while I buy stuff from him. Even if it crashes occasionally. Even if I can't get the reward for getting to Limansk. It's seriously flawed but absolutely amazing. Great environment, fun gunplay and customization, and plenty of squatting people. I've just done my 3rd playthrough of it (though only the first for my steam copy). Absolutely a wonderful game.",
            "review_score": "1"
        },
        {
            "review_text": "I actually was trying to buy call of prypiat.Its a good kind of diffrent using the whole minature war system instead of relationships but the game can get annnoying in the first hours.(i owned it before)",
            "review_score": "1"
        },
        {
            "review_text": "Another story of Stalker universe. It's before the Shadows of Charnobyl. A group of stalkers has for the first time reached the very heart of the Zone, Chernobyl Nuclear Power Plant. An immense blow out of anomalous energy changes the Zone. Stalkers and even expeditions die or end up sealed on the lost territories. New areas, which remained unknown since the zone in Shadows of Charnobyl, appear on the map. You must look out on blowouts what can kill you. The anomalous activity is at its maximum. Changes of the Zone map known to stalkers shake the fragile balance of forces in the Zone. Among the groupings, there flare up hostilities for the new territories and artefact fields. There are no more old enemies or friends. The Factions War has started between the groupings and you are who will choice, who you join in it.",
            "review_score": "1"
        },
        {
            "review_text": "vanilla clear sky is a nightmare, guns are stupidly inaccurate and rifles feel like they have the stopping power of a water pistol. install the arsenal overhaul mod, it makes the gun combat much more fun which is important as there is more fighting in this game than in SOC. even with the combat and bug fixing in the overhaul mod clear sky pales in comparision to shadow of chernobyl, the story is essentially the same, taking you through all the same areas in mostly the same order, but without the sense of mystery the first game had. throw that in with a buch of other problems and you have a weaker game. that being said, this is still stalker, and stalker is amazing. despite this entries problems there is nothing quite like a stalker game.",
            "review_score": "1"
        },
        {
            "review_text": "The one thing I've noticed about the S.T.A.L.K.E.R. series is how it always maintains it's appeal through simple-seeming tasks that always branch off into multiple quests and missions. This game also does just that. It is immersive in the sense that every character has a story, be it simple or not and that the horror situations generally aren't planned like they are in most other games. They are purely situational. Unlike CoP, this game doesn't necessarily have as much of a large focus on survival insomuch as it does on killing the enemy; that could be taken positively or negatively depending on what genres of games you like. Either way though, this game appeals to multiple aspects of different genres which I feel is why it such a good game.    Also, 'ANUUU CHEEKI BREEKI I V DAMKE!!!!' *cheeki breeki hardbass intensifies*",
            "review_score": "1"
        },
        {
            "review_text": "I walked into a bandit camp to a bunch of non adidas wearing slavs squating, drinking vodka and eating potatoes.  I was trying to be sneaky since my squat isnt very slav more western, wound up robbing them of all their said vodka and potatoes.  I walk out of camp to later die of a Alcohol and potato indused coma after walking into an anomaly and getting thrown 40 feet in the air.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "So difficult... But still good, even after all these years  likes to crash on windows 10 in my experience so far",
            "review_score": "1"
        }
    ]
}