{
    "app_id": 20540,
    "name": "Company of Heroes: Tales of Valor",
    "release_date": "2009-04-08",
    "developer": [
        "Relic Entertainment"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "World War II"
    ],
    "achievements": 0,
    "positive_ratings": 1337,
    "negative_ratings": 101,
    "price": 9.99,
    "description": "Company of Heroes®: Tales of Valor™ is the expansion to the Game of the Year winner and highest rated real time strategy franchise Company of Heroes®. Featuring new campaigns to overcome, units to command, and battlefields to conquer, Company of Heroes®: Tales of Valor™ delivers evolved gameplay mechanics and 3 episodic adventures...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/20540/header.jpg?t=1521806653",
    "minimum_requirements": "OS: Windows® XP or Vista                     Processor: SSE capable processor, 2.0 Ghz Intel Pentium IV or equivalent or AMD Athlon XP or equivalent.                      Memory: 512 MB RAM. 1GB MB RAM required for Vista                      Graphics: DirectX 9.0c compatible 64MB video card with Pixel Shader 1.1 support or equivalent and latest manufacturer drivers                     Sound: DirectX® 9.0c compatible 16-bit sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "One of the last True RTS games out there after the golden age of RTS died long time ago... Its Still the best out there, not outdated as many people think, worth the money for sure, just check out METACRITIC. Its starcraft with more base building, recommended mod: Blietzkrieg, it adds a whole new game to whats already the best. ",
            "review_score": "1"
        },
        {
            "review_text": "by far the first company of heroes is still the better than the 2nd . and there are more choice and mod in the first company of heroes",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS-game ever made, expansion ToV adds only couple maps and units to game. new gamemodes has very few players. After game went to Steam many players left and now game has only handful of gamers, hardcore vets or total noob cheaters. Finding good legit teams is rare these days, but if you find them then you have awesome battle coming.",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing CoH series for years. I don't get tired of it. Have collection of CoHs. Like to play RC Realism mod of CoH ToV, the best mod among all of mods, lots of new units,... The game itself needs more units I think and it has few units without installing mods like RC Realism2.2.5 I'm addicted to CoH -_-  8.99/10",
            "review_score": "1"
        },
        {
            "review_text": "Pure entertainment what you don't want to miss which for my personal opinion this would be the best strategy game iv ever come to.",
            "review_score": "1"
        },
        {
            "review_text": "absolutly the best strategy game of all time, would recommend to anyone",
            "review_score": "1"
        },
        {
            "review_text": "COH FTW! How can you not like this RTS game? This historic WW2 RTS game is brilliantly crafted. It's amazing. Better than a lot of other RTS games out there. You should get it and get the other games in the series to unlock extra units and factions! 9/10, brillant game.",
            "review_score": "1"
        },
        {
            "review_text": "Very addicting strategy game. The firefights are just amazing and requires thought and skill, not just the ability to click the mouse. Overall 15/10",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS game I've ever played, still one of my favorites to this day. Graphics are highly detailed in every aspect. Fully destructable environment, AI is very well done, no major bugs. Highly recommend this for any RTS fan or World War II buff.",
            "review_score": "1"
        },
        {
            "review_text": "Played for years and had a blast! Had some great times with great friends, some I already knew, some I met in the game. If I only had a time machine to go back, this is what I would go back to, best days of my life...",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS ever. Too bad it ended this way.",
            "review_score": "1"
        },
        {
            "review_text": "CoH the best wwii game!",
            "review_score": "1"
        },
        {
            "review_text": "I need more practice.",
            "review_score": "1"
        },
        {
            "review_text": "their focus on engine served this game very well 5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is bad.",
            "review_score": "1"
        },
        {
            "review_text": "+1",
            "review_score": "1"
        },
        {
            "review_text": "good expansion",
            "review_score": "1"
        },
        {
            "review_text": "It's best to pretend that this poor entry in the franchise doesn't exist. It's a collection of tedious maps bound together by terribly written cut scenes backgrounded by uninteresting campaigns.",
            "review_score": "-1"
        },
        {
            "review_text": "Loved this game before, but why does it need CD key??? It's f***ing destroyed my game!",
            "review_score": "-1"
        },
        {
            "review_text": "THQ bankrupt RIP COH it goes along with it it keep crashing, I tried both the new steam version and this it seems they're crashing omg they ruin my favorite game...   Give me back my old COH!!!!! I dont like the COH2",
            "review_score": "-1"
        },
        {
            "review_text": "Stalin didn't make this one",
            "review_score": "-1"
        },
        {
            "review_text": "Dev's do not care about player base or keeping there games, runable, playable, or blanced do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Defenitely worthy of it's Title, this game truly is a work of art.Felt like a bit of a letdown on the short Campaigns, but the point was made.COH can make a 3-hour long campaign turn into a lot more.",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding game! It never gets boring, each match is always different.   Great graphics, explosions and firefights are awsome to watch. Fantastic sounds, you can feel the power of an artillary strike by just how it sounds, espcially the V2 Rockets... Gameplay is just awsome. One of the first games to include a cover system in an RTS format, which adds a little realism in each battle as men dash towards the nearest cover.   A must buy game, get it now or wait for company of heroes 2!",
            "review_score": "1"
        },
        {
            "review_text": "Epic Game,  One of the best Game's I have played to date, The simple layout and the unique unit's granted to either side add's a twist to almost every game. If you like rts games but not so grand and more engaging, this game is for you. Wicked game and true to it's rating 9/10 -    Pro's  Wicked Graphics Unit layout's Upgrade's    Con's  Besides people leaving the game when were trying to start a multi player.   Nothing.. This is a great game.     PRE-ORDER COMPANY OF HERO'S 2",
            "review_score": "1"
        },
        {
            "review_text": "All round a great game, one of., if not the BEST RTS game out there.",
            "review_score": "1"
        },
        {
            "review_text": "An older game that continues to offer some of the best RTS out of any game out there.",
            "review_score": "1"
        },
        {
            "review_text": "a very fun game with killer graphic and game play.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't have this, get it!! One of the best world war 2 games.",
            "review_score": "1"
        },
        {
            "review_text": "86%",
            "review_score": "1"
        },
        {
            "review_text": "Beyoned Awesomeness",
            "review_score": "1"
        },
        {
            "review_text": "Hey look the last good COH game Relic made. COH2 is not even close.",
            "review_score": "1"
        },
        {
            "review_text": "I've got him all lined up. ",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game! I don't really get into RTS's but this one has won me over. So much better than that ♥♥♥♥ they call Serious Sam. What the ♥♥♥♥ is with that ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Really like playing this with friends of mine.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best dlcs i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "One of the best strategy games i've played.Also graphics are still nice :D",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game! I don't really get into RTS's but this one has won me over. So much better than that ♥♥♥♥ they call Serious Sam. What the ♥♥♥♥ is with that ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Company Of Heroes is the best WWII Real Time Strategy game out there. The Depth of Combat, Great Graphics, Atmospheric Sounds all put you directly in to the game. You Should'nt Miss this one! ",
            "review_score": "1"
        },
        {
            "review_text": "Good game, easy to learn, fast gameplay. Problem? Yes: cheaters and drop hackers, anyways this is a GOTY in my opinion",
            "review_score": "1"
        },
        {
            "review_text": "RTS perfected. It plays like a tried and true genre title, but is intuitive and true to the historical setting. Tanks behave exactly like tanks should, machine guns and mortars likewise. Add in gorgeous graphics and well balanced factions/team... this game is simply amazing.",
            "review_score": "1"
        },
        {
            "review_text": "best rts game . i dont recommend the second(2) company cuse it not yat finished. but first got back on steam . ",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game for years (long before the weird steam version hours started counting), and I always come back to this game for clean RTS fun. There are few games that hit just about everything you want in an RTS like Company of Heroes, including longevity. This game is far better than CoH2, offering great balance, (still) great graphics and performance, entire standalone games as DLC (instead of crummy map packs), and a modding community with years of material for you to explore (including the amazing Eastern Front mod which does everything and more that CoH2 does). I don't think I'll ever stop playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game for years (long before the weird steam version hours started counting), and I always come back to this game for clean RTS fun. There are few games that hit just about everything you want in an RTS like Company of Heroes, including longevity. This game is far better than CoH2, offering great balance, (still) great graphics and performance, entire standalone games as DLC (instead of crummy map packs), and a modding community with years of material for you to explore (including the amazing Eastern Front mod which does everything and more that CoH2 does). I don't think I'll ever stop playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "'Jawohl, attacking their armor... with my rifle'",
            "review_score": "1"
        },
        {
            "review_text": "GOOD GAME IF YOU LIKE STRATAGY GAMES LIKE C &amp;C",
            "review_score": "1"
        },
        {
            "review_text": "The best RTS game that i have played. 我玩过的最好的即时战略游戏。",
            "review_score": "1"
        },
        {
            "review_text": "Great game about WW2! It's worth buying!",
            "review_score": "1"
        },
        {
            "review_text": "This game is Awesome and the mod 'Eastern Front' makes it even more awesome )",
            "review_score": "1"
        },
        {
            "review_text": "Company of Heroes - Talors of Valor, was at first not a game I would of originally bought but after playing the game with friends on the mod 'Blitzkreig' it became interesting to play.  I wouldn't say Company of heroes is about base building but more about having units take strategic places on the map and holding them by taking resource points. When you get a kill you get given experience which you can put points into like a talent tree system; this only makes your units better or unlocks special off map support options.   The Blitzkreig mod which works for this version of company of heroes gives more options in the command trees and more units unlocked making each team seem more balanced compared to the original talors of valor game.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games i have ever played",
            "review_score": "1"
        },
        {
            "review_text": "9/10 My favorite strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "Best RTS ever. Awesome details all the time, great approach on economics, combat, graphics and physics... simply the best WWII RTS to date!",
            "review_score": "1"
        },
        {
            "review_text": "Company of Heroes is definitely my all time favorite RTS game. The fact that your units fire while moving and will get behind cover when the battle gets heated makes any other RTS with brainless units seem frustrating. The map destruction and explosion effects are amazing. Any Company of Heroes game is a great pick up for any real time strategy fan, but if you were to buy one, Tales of Valor gives you the most bang for your buck multiplayer wise.",
            "review_score": "1"
        },
        {
            "review_text": "Great game over all",
            "review_score": "1"
        },
        {
            "review_text": "These are my favorite games of all time and I play and like them over everything else.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game in which you spam Panzers and Flameweffers and win.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best RTS made in the last 10 years.",
            "review_score": "1"
        },
        {
            "review_text": "great expansion",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It is a strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "still playin COH and Tales after 10 years. Best RTS game on the market and at steam sale time price of 5 bucks you can not got wrong.  Get Blitzkrieg mod ",
            "review_score": "1"
        },
        {
            "review_text": "I loved how the final campaign feel, a lost cause but you can protect the retreat of the army and finally relieve your troops and evacuate them.  What I hatted was the cheating AI, after some tries at hard to accomplish all the medals y began to use mines and tanks obstacles, then the AI started spawning unlimited Shermans with plows apart of their regular army and destroy my defensese. And even if you manage to stop them it will start spawning units behind your defense.  I know it is designed to defeate you, hell i played the campaign as the allies I know you have to lose as the Germans, but at least make it by your own rules, trowing thousands of units and not cheap spawning tricks.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most realistic WW2 game ever made",
            "review_score": "1"
        },
        {
            "review_text": "Good strat game :D",
            "review_score": "1"
        },
        {
            "review_text": "fantastic RTS, shame it was ignored by relic and didn't get the proper love it should have.",
            "review_score": "1"
        },
        {
            "review_text": "Note: Only played CoH's Campaign and my hours are chalked up against the new steam edition of CoH.  Tales of Valor's campaigns breath fresh life into CoH by introducing some interesting mission/campaign features. While these features are unique to Tales of Valor, at the same time they feel at home within the CoH universe. Some of these mission features include a rotating map, alerting your units to an incoming attack and commanding an overpowered lone wolf tank against the British!",
            "review_score": "1"
        },
        {
            "review_text": "A fun game to play when things get boring around the house. Keeps you on your toes to be successful. Keep an eye out for an attack from your flank when you least expect it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a really good game to play to get you started playing  strategy games",
            "review_score": "1"
        },
        {
            "review_text": "This would have to be the best game of any I have played.It starts with Company of Heroes and right through to Tales of Valour.Can't wait for C of H 2",
            "review_score": "1"
        }
    ]
}