{
    "app_id": 205550,
    "name": "Foreign Legion: Multi Massacre",
    "release_date": "2012-07-09",
    "developer": [
        "Sakari Indie & GriN"
    ],
    "publisher": [
        "Sakari Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie",
        "Casual"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 43,
    "positive_ratings": 200,
    "negative_ratings": 108,
    "price": 4.79,
    "description": "Foreign Legion: Multi Massacre is the (far too) long awaited follow up to Buckets of Blood. Now you can continue the cartoon-style third person battle online and battle your friends, enemies or even frenemies across 6 maps and various modes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/205550/header.jpg?t=1447355242",
    "minimum_requirements": "OS:Windows XP or laterProcessor:2.4 GHz or fasterMemory:1 GB RAMGraphics:DirectX compatible graphics, 128 VRAMDirectX&reg;:9.0cHard Drive:800 MB HD spaceOther Requirements:Broadband Internet connection",
    "recommended_requirements": "OS:Windows 7 or laterProcessor:2.2 GHz or faster, multi-coreMemory:2 GB RAMGraphics:Dedicated graphics card, 512 VRAMDirectX&reg;:9.0cHard Drive:800 MB HD spaceOther Requirements:Broadband Internet connection",
    "reviews": [
        {
            "review_text": "This game is a gem. It's not a game that you sink many hours in, but the time you spend in it is pure joy.  You instantly notice that GRIN were not held back in their creativity and madness. So there was no blown up marketing department to say 'Oh my god, we can't do this!' They just did ;)  Show me another game in which it's an achievement to kill hundreds of dolphins. Ya, we're talking this level of freedom in design.  All that said - i highly recommend getting it, but for full price only if you really want to support GRIN. But with all those sales on Steam, it's just a question of time ;)",
            "review_score": "1"
        },
        {
            "review_text": "I need a refund. This game is unplayable. None of the text is legible. It's all blurred in every setting, every resolution. Pls help",
            "review_score": "-1"
        },
        {
            "review_text": "It is just a shame there are no online servers!",
            "review_score": "1"
        },
        {
            "review_text": "I'm glad I only paid $7 bucks for this. It was worth about half that.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, this is one of the best shoot-'em-up action games I have ever played, with beautiful graphics, especially the particle effects. For an only MP game I found myself loving the deep and incredibly fun progression system and interesting maps obviously made by a skilled developer. Although this masterpiece falls a bit short to compete for my GOTY award, it's still worth a buy, or maybe two, to support the developer. I can't wait for Foreign Legion 2! Buy this NOW!",
            "review_score": "1"
        },
        {
            "review_text": "This game is just kinda dead without other players. It's just too easy. Nobody's ever online.",
            "review_score": "-1"
        },
        {
            "review_text": "Great Multiplayer , and CO-OP game :D doesn't need any skills and contain alot of fun content for everyone :D  Nice, and funny graphics :D, but hard to find players to play with :3",
            "review_score": "1"
        },
        {
            "review_text": "See the details ESRB rating",
            "review_score": "1"
        },
        {
            "review_text": "Next gen FPS, intense graphics, your newest companion is a dog, extensive fish AI, THEY EVEN SWIM AWAY FROM YOU! I would reccomend this for GOTY 2012, though it is a bit late. This is an innovative game, absolutely everything is perfect!",
            "review_score": "1"
        },
        {
            "review_text": "Looks neat. I see control systems. I see multiplayer. I see news (whcih is empty and crashes the game). But I see no single player. And I see no people playing multiplayer. And none of my friends owns the game.  I declare it underpopulated, and shoddy.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't bother with this game. If you want it, buy the first one, it was great fun.  Basically all the additional content should have just been released as part of updates for the first one. If you really want it for the multiplayer, well, seems I can't stop you from throwing your money away then.  4/10",
            "review_score": "-1"
        },
        {
            "review_text": "My Friend buys me this game  Now my ♥♥♥ had ebola and i never again suck his ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "This game has:♥♥♥♥♥♥ GRAPHICS,♥♥♥♥♥♥ MUSIC,♥♥♥♥♥♥ GAMEPLAY.IT IS ♥♥♥♥♥♥♥♥ RIGHT IN YOUR FACE.NEVER PLAY IT!!!!!! NEVER!!!!!3.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "It relies on the old low-brow rule of instant satisfaction: bloody explosions and senseless violence = fun. The game's AI is sub-standard, it's got minimal content, and quite a few glitches. BUT, it's fun, addictive, and leaks naive charm.",
            "review_score": "1"
        },
        {
            "review_text": "One of the worst indie titles I've ever tried. The gameplay videos are blatant lies, the mechanics are utterly broken, and if you can find one other unfortunate sucker to play a round with, your only enjoyment will be derived from having someone to hear you rail about being cheated out of your money. Yeah, even at $1.74. (Christmas sale price) ... Buyer beware.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is ♥♥♥♥ing genuis!",
            "review_score": "1"
        },
        {
            "review_text": "I...I wish the devs wernt dead they made a good game i wish they came back and contunue the game",
            "review_score": "1"
        }
    ]
}