{
    "app_id": 205650,
    "name": "The Testament of Sherlock Holmes",
    "release_date": "2012-09-20",
    "developer": [
        "Frogwares"
    ],
    "publisher": [
        "Frogwares"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Detective",
        "Point & Click"
    ],
    "achievements": 32,
    "positive_ratings": 1488,
    "negative_ratings": 301,
    "price": 14.99,
    "description": "As the greatest detective of all time you must find clues, interrogate suspects &amp; unveil a mystery in a story full of twists!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/205650/header.jpg?t=1462538647",
    "minimum_requirements": "OS:WINDOWS XP SP3/WINDOWS VISTA SP2/WINDOWS 7 Processor:AMD/INTEL DUAL-CORE 2 GHZ Memory:2048 MB RAM Graphics:256 MB 100% DIRECTX 9 AND SHADERS 3.0 COMPATIBLE ATI RADEON HD 2600 XT/NVIDIA GEFORCE 8600 GT OR HIGHER DirectX®:9.0c Hard Drive:14 GB HD space Sound:DIRECTX 9 COMPATIBLE",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game was quite disappointing. Despite being a detective game, there is very little actual investigations - the game turns into a simple point and click adventure game pretty quickly. While that is done quite well, and the puzzles themselves are quite good, albeit quite standard for the most part, the narrative structure of a Sherlock Holmes novel just fits terribly. As a game, you expect to be able to influence events as you come across them, not have Sherlock Holmes solve them behind the scenes and present the results afterwards - when you PLAY as him. As a player, I would have liked to be the one to logically think up the clever plots and put them in motion, not switch to Watson and be forced to ignore evidence available to let the plot move along. As a mystery game, this fails spectacularly... which is surprising considering that this game is quite well made - with the exception of some of the worst animations I've seen in a long time.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is gorgeous. Some of the puzzles are challenging, but most are kind of easy. The voice acting sounds a little strange sometimes with odd inflections as if the actors don't understand the context of the lines they are reading. The controls can be a pain sometimes and not very intuitive. The end credits are a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game looks and feels solid. It can be frustrating at times when you cant connect the dots but the if you take too long on a puzzle it will give you the choice of skipping it because... you suck. And the game will let you know when you are correct which sounds like cheating but you will be thanking God at times for that little saving grace.  The voice acting is also solid but none of the words matches the characters mouth movements.",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR A point and click crime game that I found surprisingly enjoyable even if its a bit rough around the edges  Full Version: The Testament of Sherock Holmes is a point and click crime adventure. The story begins with Holmes and his sidekick Dr.Watson investigating a murder which soon turns out to be part of a wider plot. I went into this game not really knowing what to expect and ended up pleasantly surprised. Its a pretty good game even though it lacks a bit of polish. The story is pretty good, Sherlock Holmes and Watson are both likeable and the game has pretty good puzzles and investigation.   Theres a lot of 'use this item with this thing' but rather than having ridiculous item combinations , like a lot of other point and click games, this one is quite good for having logical solutions. Even when I picked up an item and first thought 'what the hell will I do with this?', with more investigation the solution nearly always became clear with a bit of logical thought. It keeps the game flowing nicely without any frustrating sections.  There are minor problems like an annoying camera, occasional difficulty moving Holmes around and for some reason interacting with an object would sometimes cause Holmes to walk a few metres away before reacting. Luckily theres no issue bad enough to ruin the game.  Good points: - The game has a great story and it kept me involved enough to want to find out what happens next - Good puzzles and solutions that rarely are frustrating or ridiculous  Bad points: - The game has a few minor bugs and glitches like annoying camera angles and the occasional glitch when interacting with something but nothing major -Some of the voice acting for the minor characters is terrible",
            "review_score": "1"
        },
        {
            "review_text": "Great game, even though I had to jump through hoops to actually get it to run.  Once I actually started playing, I was pleasantly surprised with how enjoyable it was. It's always hard to find a good 'mystery' game that isn't just a seek-and-find snoozefest, and I enjoyed this game immensely! Controls can be a little frustrating sometimes, but the game is really more about the plot and the investigation than anything else, so it wasn't a huge issue by any means.  Get it on sale, because as fun as it is, it just isn't worth $20 - it didn't last very long and there isn't a lot of replay value. Don't let the '~20 hrs on record' fool you - most of that is from when I accidently left the game running overnight. You're looking at around 10-13 hours of gameplay, depending on how thorough you are in each map.",
            "review_score": "1"
        },
        {
            "review_text": "This game is AWESOME for anyone who enjoys a good puzzle game and/or loves Sherlock Holmes. I had my doubts before I bought it, because I was afraid that it wouldn't be so good or mentaly challenging enough, but I was proven wrong. You constantly have to use your mind to solve puzzles with logic and deduction. I also love the fact that you can easily change perspective from first person to third person depending on what's most suitable at the moment. If you aren't so good at first person shooter-games and want to use your logic and deduction skills then this will probably suit you perfectly, but I think pretty much anyone who enjoys puzzlegames will find this entertaining.  PROS - Challenging riddles and puzzles - Beautiful and detailed setting - Ability to change perspectives - Good Sherlock Holmes-feeling - AMAZING twists, especially at the end  CONS - Slightly repetitious from time to time - Many details to remember, sometimes a bit too much",
            "review_score": "1"
        },
        {
            "review_text": "Conveys the Sherlock Holmes I know and love from the books and short stories, in a way most other visual media won't do. The puzzles are brilliant. Very difficult to guess correctly; you certainly have to think about it. Watson is funny but very like the Watson I'm familiar with from the books. He's slightly slower to cop on here but that's fine.  The game design is nearly flawless. Just a couple of glaring UV seams not worth mentioning (would you look at that, I've mentioned them) but no-thing else to complain about there. Some slightly overused NPC models but it's an indie game so you expect that sort of thing. Really good attention paid to Victorian English culture, accents, clothing, architecture, &amp;c. Though a couple of articles of clothing, if I'm to be overly fastidious, are American and not British. You won't notice. Only me.  The story is perfect. The acting is mostly perfect. A couple of less believable actors but most of it's great.  I will complain about the controls. It doesn't matter much because you don't really need fast response time in this game, but in third person some stuff is annoying because it takes far longer than you'd expect, and this is fixed by going into first person view.  Overall, great game, great story, great puzzles, great Holmes, great Victorian London. Very impressed by the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "To be frank, one of the best games I've played in a long while. This may be due to my growing fascination with Sir Arthur Conan Doyle's masterpiece of Sherlock Holmes, but I found this game to be riveting until the very end. It's not often that I find something that I am actually saddened by its ending. The story was magnificent, and the gameplay was not bad either.  As a game this is a point and click adventure that you can also play in first person (as the third person option I found to be frankly useless). It's a damn good one at that. This contains some of the more frustrating puzzles I've seen in a game, yet it managed to actually keep me engaged in figuring them out instead of just angering me until I quit. I admit that I have not beaten this without a walkthrough, although I felt bad for using it when I needed it. This game makes you use your brain.  The game itself was also made quite nicely, the animation not perfect, but voice acting and immersion were fairly great, at least to me. In short, magnificent puzzle game with wonderful story, Sherlock being one of my favorites.  I simply cannot wait for Sherlock Holmes: Crime and Punishments to be released.",
            "review_score": "1"
        },
        {
            "review_text": "Frogwares has been doing Sherlock Holmes games for more than ten years. You'd think they'd gotten pretty good at it, but judging by The Testament of Sherlock Holmes, they've just gotten sloppy. The engine is getting visibly long in the tooth, and the mystery you're solving this time does some very un-Holmesian leaps of logic and plausibilty towards the end.  The production values are just plain mediocre all around. While some of the puzzles are fun, there is an alaming number of inventory puzzles requiring you to combine various ropes and ladders into longer ropes and ladders. At its worst, the gameplay just devolves into a hotspot hunt, a variation of the dreaded pixel hunt. Not recommended unless you're either a hardcore Holmes fan, or a hardcore adventure game fan.",
            "review_score": "-1"
        },
        {
            "review_text": "A somewhat janky but oddly compelling adventure game, the best in the series up to this point.",
            "review_score": "1"
        },
        {
            "review_text": "This game is full of puzzles, clues that you have to piece together and even some mulipule choice actions. You get to play as Sherlock, Watson and even the dog, Toby! The characters personalities remain true to the original story by Sir. Author Doyle while the story line in game encompasses bits and pieces of other Sherlock Homes stories written by various people. I have greatly enjoyed playing The Testament of Sherlock Holmes.",
            "review_score": "1"
        },
        {
            "review_text": "Really Awesome Game!  Nice atmosphere pretty spooky at some points. Small Puzzles that can be quite hard to figure out in between the different sections, puzzles dont repeat themselves, very good!  Graphics 8/10 Sound 10/10 The whole game has a spoken text Controls 6/10 Walking can be hard if you want to turn around it sometimes doesnt get the 'walk'-input, sometimes you cant see the thing youre supposed to click on, even if youre near. Gameplay 9/10 awesome story, nice plot twists Replay Value 2/10 if you manage to get all the achievements in the first run (dont skip the Puzzles) there is no reason you should play it again",
            "review_score": "1"
        },
        {
            "review_text": "Indeed Watson, they stuffed up the graphics and controls, but the core idea of the great detective is there",
            "review_score": "1"
        },
        {
            "review_text": "I never played any SH game before, so i had no prejudices how this game would be. I was positively surprised!  + It looks great for a three year old game. + The gameplay is easy and works without any problems + Interesting and very diversified puzzles + the voice actors are really well selected  One downside lies in the story: It starts out really intresting but it gets a little bit too predictable until the end.  ",
            "review_score": "1"
        },
        {
            "review_text": "All the Sherlock Holmes games are fun to play. If you like RPGs and Story driven games I believe you'll enjoy these Sherlock Games.  I would recommend this game more so over the other Sherlock Games due to much improved graphics and quality.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. If you love Sherlock Holmes. Then you will definatly love this game. Enjoyed every minute of the story.",
            "review_score": "1"
        },
        {
            "review_text": "Intriguing game, but not without flaws.  I just love investigation games where you have to find clues and then deduce to figure out what really happened, and you definitely expect that from a Sherlock Holmes game. In that department it doesn't fail to deliver, except that I wish there was more of it. The story of the game is fairly interesting too, quite dark and a bit out there. Actually I feel it is a bit too far out there at times.  You can choose to play from a 3rd person perspective or 1st person. Because of the somewhat clunky controls and movement I ended up playing it in 1st person to not become too frustrated. You alternate between controlling Sherlock Holmes and Dr. Watson through the story and even Toby the dog. Especially Toby here felt out of place and especially clunky and odd. Not only did that part feel unrealistic to the point of ridiculousness, but for he most part it did not even make any sense. I do not want to spoil too many details, but let's just say don't get caught up in where the tracks lead you. Half the time they didn't even show up. At least not until you'd been going back and forth several times. It is good to see that a developer is trying something new and original, but this was not a success in my eyes.  What really stands out in this game, in my opinion, is the voice acting. They were just really really good. I don't know if it is because the British language just seems more dramatic and sincere or what it is, but everyone felt very believable.  There's a good mix of search and find, puzzles, mini-games and exploration. I found the deduction boards to be creative and fun and the puzzle boxes to be less so. Either way I enjoyed the game as a whole and would easily recommend it to anyone enjoying these types of games.  I rate the game 7/10  Happy Gaming!",
            "review_score": "1"
        },
        {
            "review_text": "Be warned this game has some pretty challenging puzzles worthy to be called a Sherlock Holmes game. The main downside of the game is that graphics are acceptable but not particularly outstanding (particularly some character models) however considering it isn't developed by a big game development company it's pretty good.  That said, the game also has very strong plot-story driven storyline also worthy of a Sherlock Holmes game and character development especially Sherlock Holmes really came through strong enough you come to know to his personality and character like a book. The epic ending of the game really does a 360 and giving his character development a complete home run.  Took me 15 hours to finish the game (without using guides)",
            "review_score": "1"
        },
        {
            "review_text": "great game. loved solving all the puzzles and hearing the banter with watson. great ending too!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for those who enjoy mystery/detective/point and click genres. Definitely enjoyed playing it, and the mystery did keep me guessing. It's a good length too, definitely worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "While the gameplay is a bit choppy and we do get a puzzle overload (deduction tables are good and in-character, unlocking fantastically-designed safes, not so much) it's got good atmosphere and likable characters, as well as a smattering of Easter eggs for fans of the books.",
            "review_score": "1"
        },
        {
            "review_text": "If you're even mildly interested in Sherlock Holmes, this game will do right by you. I've enjoyed it all the way to the end.",
            "review_score": "1"
        },
        {
            "review_text": "A game with a fascinating story line, well thought characters, variety of different puzzles and most importantly a mysterious case which you have to solve, my dear Watson! :D ",
            "review_score": "1"
        },
        {
            "review_text": "+ Graphics are OK + Story isn't terrible + Puzzles mostly don't suck + Not too short + References to other cases  - Sloppy controls (which is very bad considering the game is mostly point&amp;click) - Story is predictable right up until the end - Some puzzles are unnecessesary or boring - Not nearly enough 'Sherlock Holmes'ing -    Played as a dog way too long    - Played as Watson way too long - Not very long - Replayability is nonexistent  5/10",
            "review_score": "-1"
        },
        {
            "review_text": "Very story driven and intense game. Felt really cool solving different puzzles and uncovering the story. Wasnt perfect though, felt really dragged out at times and the ending happened a bit too fast. Some puzzles felt impossible without a guide since they didnt really give you any information at all. But if you like a challange and a story driven game then i recommend this game to you.",
            "review_score": "1"
        },
        {
            "review_text": "I should start saying that this one belongs to the adventure category, and it's of the same spirit as the old-school, 2D poin-n-click games. It seems necessary to point that out, because, apparently, some reviewers let the 3D graphics fool them, and forgot about this fact. As a matter of fact, no other adventure could really beat this one in graphics or atmosphere, but it's still an adventure game; not an action game, not a RPG. And it's great at that. Anyone who feels the need of a change in pace, and want to slow down a little bit, and imerse themselves in a fantastic world of decadence, misteries and violent, apparently unsolvable crimes, can always count with the cold-blooded, logically-minded Mr. Holmes, and the loyal and righteous Dr. Watson as their guides. The characters are inarguably great on this one. Sherlock Holmes is clearly at his best, but Dr. Watson really awes the player for his distinction: a completely independent and complex character on his own. Their voices match perfectly and are totally convincing. Actually, the whole soundtrack is perfectly adequate to the game as a whole. Really good adventure, indeed. But, to be honest, there are some drawbacks also. The player will be every now and then distracted by the likes of bad lip sincronization, the somewhat awkward character movimentation, clunky gameplay, lots of invisible walls, and lack of animations when using objects. Also, the puzzles are not too much of a challenge for experienced puzzle solvers, no more than two or three of them would hold an adept back for more then ten minutes. On the other hand, they are so well crafted and fun to solve, that one can not help but feel well rewarded when the problem is solved. Anyway, if there are drawbacks, none of them could prevent the player from getting addicted to the appealing atmosphere and charming characters. 'It's simplicity itself': just get it right now.",
            "review_score": "1"
        },
        {
            "review_text": "the best",
            "review_score": "1"
        },
        {
            "review_text": "This game is fairly slow paced, which doesn't appear to take a long time to complete. Most of it seems to be a story line. Additionally, the game doesn't always reveal how puzzles work or some capabilities you have. Unfortunately, I had to use a guide to get the ball rolling on a few things. I'd say the game is quite challenging because of the lack of some instructions. Also, it doesn't seem like one needs to do anything special for the achievements either. It seems like achievements just come along with the successive completion of the story.  For the price of $4.99, I was really excited to buy it. It isn't too bad, but I'm not sure I'd recommend it. It would depend on your game preferences. Good story, but I'm just completing it for the achievement hunter in me now.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is extremely underplayed! The graphics and physics are nothing special, but the story is riveting! ITS A MUST PLAY!",
            "review_score": "1"
        },
        {
            "review_text": "I had no idea what to expect from this game since I rarely play adventure games at all. Usually I enjoy the more fast paced games, but I decided to give this a go and I was not disappointed. The game offers tons of puzzles, clues and a well written story that leaves you sleepless at night. The dialoges were compelling, and the general content off the game was vast.  The game is, however, not perfect. The controls were really stale and the entire character coordination in the game felt stiff. There was no lip sync and, to be honest, I was a bit surprised that this game was released as late as 2012, since the graphics was more of a 2008-2010 caliber. Nevertheless the game was enjoyable, beautiful and well written. A metascore of 73/100 is not too far off, but a bit cheap and I would rather say this game is closer to 80/100.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed playing this game. The puzzles were fairly challenging; I looked forward to trying to solve the next puzzle. I was truly interested in the story line, and I liked how the story came together. The controls were difficult at first. I actually ended up playing with a controller because it was easier. My major critique of gameplay was that the clues were always very obvious - meaning the magnifying glass or the hand popping up. I would have enjoyed playing this game as an interactive without those tips. Make me really look at the surroundings to find clues, etc. Otherwise, time and money well spent.",
            "review_score": "1"
        },
        {
            "review_text": "Quality puzzle adventure. Great voice acting, and overall atmosphere =)",
            "review_score": "1"
        },
        {
            "review_text": "Saw Sherlock Holmes dressed as an old lady. Now I have seen everything.  10/10 would old lady again -iggn",
            "review_score": "1"
        },
        {
            "review_text": "Personally I do not really care for Sherlock Holmes but the puzzles in this game are interesting and challenging and I would recommend this to anyone looking for just that.",
            "review_score": "1"
        },
        {
            "review_text": "Decent adventure game. Nothing really special, but quite a Doylesque Holmesian experience, which is not bad. Guess I'll try other game or two from this series.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of Sherlock Holmes novels, you definitely like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "I like the idea, and the little bit of it that I saw appeared well done. But it won't play without downloading outdated drivers. I'm not going to load old video drivers to play a game. Glad it was only 5 bucks...",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 would solve crimes again",
            "review_score": "1"
        },
        {
            "review_text": "It sucks big time!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Insanely good game, has got some glitches but is fine if you can overlook them.",
            "review_score": "1"
        },
        {
            "review_text": "Good solid adventure. Especially if you like Sherlock Holmes. Definitely worrth it although the ending was a bit anticlimactic.",
            "review_score": "1"
        },
        {
            "review_text": "An uninteresting whodunnit, which begs the question - who cares?",
            "review_score": "-1"
        },
        {
            "review_text": "I love Sherlock games, but this one is slow, boring, and completely asinine. Sure, it's got a couple neat puzzles, but so do puzzle games, and you don't have to sit through a painfully poorly-written story to get to them. Get Jack the Ripper or The Awakened instead.",
            "review_score": "-1"
        },
        {
            "review_text": "4/10  Want a game like this but better? get L.A. Noire",
            "review_score": "-1"
        },
        {
            "review_text": "Really been enjoying this game. There were a few things I didn't like, and don't like about it. Overall though a fun game good plot. I didn't like the ♥♥♥♥♥♥♥♥ children telling the story good thing they are barely in it. Graphics are good, some of the puzzles are hard, certain crucial things in this game that you need to move on can be super hard to find, or can leave you stuck for 30 min to an hour til you get ♥♥♥♥♥♥ and look it up. I like that that it isn't another shooter. It isn't open world, but I kinda like that it isn't it works for this title, and keeps you focused and on path. Worth gettting on sale very entertaining get it.",
            "review_score": "1"
        },
        {
            "review_text": "What an excellent Sherlock Holmes game. It has gorgeous graphics and excellent settings in various London locales. Everything is shiny and many things are just dying to be investigated. The voice acting is spectacular. This is not another awful EE broken english game. It is an absolute joy to play Watson and Holmes as they try to solve various puzzles from magic squares to traveling knight on the chessboard. I got stuck in a few spots requiring a guide but I didn't think anything was ridiculously unfair. I am absolutely hooked and now want to play the sequels. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Despite being a rather good looking game, I found there was nothing new in it. The puzzles were barely rebranded versions of a dozen other puzzle games and there was little, other than the fact I'd bought it already, to keep me interested in playing.  The 'hint system' is awkward and in most cases useless, there's a lot of going round in circles as you have to inspect the same item more than once with little more than a word to direct you to it. Being that the game lacks a progress tracker, or 'quest log' it's very easy to lose track of where you're supposed to go, doubly so if you get bored of the overly dramatic dialog and skip it.  I took the time to finish this game and it frustrated me in all the wrong ways. I definitely wouldn't replay this (although I did miss out on a couple of achievements...) and probably won't play any prequals or sequals.",
            "review_score": "-1"
        },
        {
            "review_text": "I played it straight for an entire day. It was elementary, my dear Watson. If you love mystery adventure games, you owe yourself. Buy everything. The Awakend Remastered. and VS Jack The Ripper to go along with this, and buy yourself a bubble pipe.. Real Treat. 4 stars / 5",
            "review_score": "1"
        },
        {
            "review_text": "Got to sniff for clues in dog mode 10/10",
            "review_score": "1"
        },
        {
            "review_text": "In twenty years of PC gaming, this is one of the best adventure games I've ever played. So many reviews begin that way, but there isn't any other way to put it. The Testament of Sherlock Holmes had not only the many hours of gameplay I was looking for, in actually double what I expected, but engaging puzzles, the ability to switch characters (we even get to be Toby for a part of the playthrough!) a terrific storyline weaving past and present, and emotional tugs at my heart I hardly expected in a Holmes &amp; Watson adventure. I happened to get this on sale and can't believe the bargain in entertainment I received, but would still highly recommend it at full price. If you love first person adventure, mystery, Sherlock Holmes, and well-crafted storylines with beautiful, rich scenes, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Bit old and therefore the movement system is very slightly clunky. Requires thinking and needs a long time to finish it all. Tons of puzzles and problems you need to solve. Would recommend anyone who loves these kinds of games. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I will admit, this game is quite the puzzle. Not in-game, mind you. Just trying to get it to work is a mystery! I have been having an issue that it seems a lot of of players are having, the Blue Screen after the very first cutscene. My computer is well above standards for the game, and it seems the root of the issue is from nVidia drivers. Because I am fully up to date with my drivers, I still have the Blue Screen. Because of this, I highly recommend not purchasing the game. I'm a giant Sherlock Holmes fan and had great expectations for this game. This made me quickly think otherwise, and I'm very disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "A very good game with a clever story.",
            "review_score": "1"
        },
        {
            "review_text": "after you get the hang of it the game is pretty challenging but fun. some of the puzzles are simple some are complex. good story.",
            "review_score": "1"
        },
        {
            "review_text": "Yea the lip synch sucks and there are some minor details which could've been done better. But apart from those small things the game is great! The voicework is spot on, some of the puzzles are annoying but still at least diverce. Haven't played it enough to give it a proper ratting but from what I've gone through so far it's a definite 7/10 for me.",
            "review_score": "1"
        },
        {
            "review_text": "I am a big fan of the Sherlock Holmes games. I love the character, I love the mysteries, I love the atmosphere, and I love the pixel-hunting. There, I said it! Now that I've gotten that back, let me tell you what I think of the Testement of Sherlock Holmes.  First, the good things. 1. As usual, the atmosphere is spot on. And I could swear that the dialogue is written by Conan Doyle himself. It genuinely feels like a Sherlock Holmes adventure. 2. The investigation is really well done. Whenever you need to search a body for marks or a room for clues, it feels like L. A. Noire. 3. The tension in the first half of the game is really thrilling. The sense that Sherlock Holmes may be insane, or not who he says he is is gripping and kept me playing to try and decipher why exactly Sherlock Holmes was being so edgy and confrontation. There is no greater conflict in a Sherlock Holmes adventure than questioning the legitimacy of your hero.  Now, let's talk about what' bad. 1. Puzzles. Puzzles, Puzzles, Puzzles, Puzzles, Puzzles! Way too many puzzles, and most of them are stupid, complicated, and have no explanation of mechanics, objective, or context. I am grateful that the game includes a 'skip puzzle' button, but it's a bad sign when it needs to be included. 2. Adventure-game inventory management. In the early game, the investigation of murders was so strong in gameplay, that it was a shock when I started to have to search for random objects with no idea why I needed them or how they were supposed to be used. Most of the rest of the game is classic combine this with that and use it on that. This wouldn't be a problem, if it was simply transitions between one mystery to another. But instead it makes up the majority of gameplay, and doesn't do it particularly well. 3. The ending is completely non-sequitor and the prologue with awkwardly animated and voice-acted children is really poorly handled, it almost felt like a completely different story spliced into one about Sherlock Holmes struggling with an insidious threat to his integrity. 4. I hesitate to mention this, because I am a strong believer that poor graphics, animation, voice acting, etc. can be compensated for by compelling gamplay. And Bullfrog has come a long way since Sherlock Holmes: the Awakened in terms of animation and cinematics, but it still looks pretty amateur, and it would go a long way for their franchise if they worked on animation and cinematic timing.  So ultimately, I recommend this game for its strong beginning and great tension. But regret that it missed its mark in a lot of technical respects.",
            "review_score": "1"
        },
        {
            "review_text": "If you're already a fan of games such as Broken Sword with it's cursor mystery style, then this game is recommend for you too. Fits in well with the franchise and has plot changing moments that will leave you guessing.",
            "review_score": "1"
        },
        {
            "review_text": "Don't bother. Doesnt work with latest Nvidia PhysX drivers. Developers suggestion is to remove new drivers and install old ones, rather than them fix the game. Should be removed from Steam for this reason alone.",
            "review_score": "-1"
        },
        {
            "review_text": "Very slow pace not a lot of investigation",
            "review_score": "-1"
        },
        {
            "review_text": "Das Videospiel ist fantastisch!   Wait why did I go German? Nvm.  The game has a pretty awkward mechanics. When I started, I had to force myself to get used to the controling and movement of the character. It almost turned me off immediately. You can switch from third-person view to first and vice versa anytime. First person view makes the best control. But alas, I got used to it and it gets comfortable the further you go.   While the mechanics aren't something to cheer about, the game itself provides an excellent and well made story followed by amazing puzzles to be solved. Help yourself and be the detective for once and not go through any walkthrough or guides. The puzzles aren't straightforward and can be really tough but the satisfaction everytime you solve them on your own, fantastisch!  This game should set a benchmark for more awesome Sherlock Holmes games to come.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, quite a classic Sherlock Holmes story but nice ending. I would definitely recommend this game to anyone!",
            "review_score": "1"
        },
        {
            "review_text": "enjoyable game. Short and good for only 1 runthru.",
            "review_score": "1"
        },
        {
            "review_text": "This was hands down the coolest Sherlock Holmes game I've ever played. The graphics were very realistic, and the puzzles were at the perfect difficulty. I did have to look up hints once in a while, but just enough to have me heading in the right direction. This game has an incredible story line that keeps you captivated to the very end. Well worth it, and I can see myself playing it again and again in the future. I highly recomend this game for mystery and puzzle fans!",
            "review_score": "1"
        },
        {
            "review_text": "World's ugliest children.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game...9/10",
            "review_score": "1"
        },
        {
            "review_text": "The game had an interesting enough storyline, but what really kept me playing was the puzzles. The only thing I don't like about this game is that it's quite buggy. I have had to reload previous saves several times to get past a glitch. The game isn't worth $20, but I'd pick it up on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Best of the Sherlock Holmes games from Frogwares (as of 2012). Exciting and fairly well down mystery adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful Sherlock Holmes game with beautiful graphics. Some of the puzzles are very tricky and will require multiple tries to get right, but after you solve them it's all the more satisfying. Voice actors are good, but sometimes they seem to not know the context that goes with the lines they are saying. For me this doesn't detract from the experience as I play with the sound low any way. Definitely would recommend for fans of Sherlock Holmes and point and clicks.",
            "review_score": "1"
        },
        {
            "review_text": "This Game had an amazing plot, I never realize that until the end, all of it was connected and I was really surprise, every time I play this game I'm fascinated,you can play as Sherlock, Dr. Watson, even Toby, this awesome game has a good plot.",
            "review_score": "1"
        },
        {
            "review_text": "The game grabs you into the world of Sir A C. Doyle matermind detective Sherlock Holmes in a very well manner way. The story is very gripping and the puzzles are fun.   The game start like a very promising adventure game. Well performed voice acting, excellent and varied environment and exciting investigation set the tone. The graphics may not be upto date for many, and the controls are stiff and sometimes difficult to deal with. Nevertheless, it had its charm, and I wanted to see what happened next as the investigation revealed a web of different threads that had a connection I should get discover. The way Sherlock portrayed on fidelity, and it fits well in this context. He is the type who does not care about what others think, because he knows he is always right. His counterpart , Dr. Watson, is also well poytrayted, and the dialogue between them entertains.  To resolve matters using 'Deduction board' I thought that was an interesting way to do it. Here I got really used the brain, and it gave a great sense of achievement when I understood the context. Unfortunately there were not enough of these, in my opinion. I would like to see that they made a few more varieties of these, and fewer of mini games that were too difficult gradually. If they had evened it out so that it was more different methods for solving problems and more options to solve a case,I would be impressed. Yet overall a very decent adeventure game",
            "review_score": "1"
        },
        {
            "review_text": "A truly interesting tale that has much inspiration on the original stories of Arthur Conan Doyle. The Sherlock Holmes presented here is incredibly faithful, losing maybe only to the Jeremy Brett interpretation of it.   The puzzles are simple enough to understand and solve which I see as something good for this game.",
            "review_score": "1"
        },
        {
            "review_text": "BEST MYSTERY GAME I'VE EVER PLAYED",
            "review_score": "1"
        },
        {
            "review_text": "The Testament of Sherlock Holmes is a hard game to nail down as to whether it is good or bad. So I'll give it the patented 'Zacryl: Meh+'. There are many moments, particularly in the first 2 acts of the game, where the opportunities to explore a (for a 2012 Indie title) incredibly beautifully-rendered Victorian London are a real treat. And trapsing around 221B Baker Street and looking at all the fun nods to the original stories is a pleasure... for a few minutes. Then the clunky mechanics and occasionally asenine puzzle-solving makes it feel less like a game about Sherlock Holmes, and more like having Sherlock Holmes' name slapped onto a rather dull point-and-click adventure. The voice acting is pretty good, though Watson (whom you hear more of in this game than anyone) was a bit too whiny and nasaly to want to listen to for 10 hours.  In all, if you're a big Sherlock Holmes fan like myself, it's definitely worth buying when it goes on sale. The game is wonderful when it pays homage to the original stories and keeps to the established canon. But when things start going off the rails story-wise toward the end, or when the puzzles start just being puzzles for puzzles' sake rather than real mysteries to be solved, it becomes a bit of a chore to muscle through.  TL;DR? 6.5/10, Good graphics, decent voices, good fanservice, but clunky and story gets dumb at the end.",
            "review_score": "1"
        }
    ]
}