{
    "app_id": 205730,
    "name": "Insanely Twisted Shadow Planet",
    "release_date": "2012-04-17",
    "developer": [
        "Shadow Planet Productions"
    ],
    "publisher": [
        "Microsoft Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Metroidvania",
        "Adventure",
        "Indie"
    ],
    "achievements": 17,
    "positive_ratings": 547,
    "negative_ratings": 83,
    "price": 11.99,
    "description": "In this Insanely Twisted, 2-D action-adventure game, explore unique environments and battle bizarre creatures.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/205730/header.jpg?t=1447355265",
    "minimum_requirements": "OS:Microsoft Windows XP/Vista/7 Processor:Intel Core Duo (1.25ghz) / AMD Athlon XP (1.8ghz) Memory:1 GB RAM Graphics:GeForce FX series+ / Radeon 9500+ DirectX®:9.0 Hard Drive:2 GB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Excellent little Medtroidy style game about an alien and his saucer trying to save his world.  The game looks and plays amazingly. From the great environments to the many tools you gain in your quest.  The Multiplayer (although dead, it's super easy to start a game with friends) modes can also be played solo, and has a surprising amount of RNG and challenge that I feel is overlooked in this game.  The overall campaign is around 8-10 hours, but it's very enjoyable, and never feels tedius.  It used to be GFWL, but the Dev switched it all over to Steamworks so it doesn't die with the GFWL platform. (Thanks Devs!)  Definite, absolute buy!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game expecting to dive into a dark abyss of cool monsters and 'visual madness' (if that makes any sense to you), as the title 'Insanely Twisted Shadow Planet' suggests. I watched the trailers and knew there would be puzzles and it wasn't a hardcore game, but all the time the whole 'insanely twisted shadow planet' feeling seemed to be solid and interesting. Well, it wasn't quite like what I wanted. Here's a list of pros and cons:   Pros: - Great visuals overall. - Really good and original enemy design. (even though some of them are re-used with little differences they still are great to look at) - Nice soundtracks that fit in with the shadowy atmosphere. - Fluid control.  Cons: - The plot is extremely simple, being almost meaningless. - The puzzles aren't challenging, some will require a little bit of thought, but overall they are pretty simple. - Bosses are quite easy. - Too short for its price. (finished it in a little more than 5 hours and it could be much faster)  There are many indies games that are very simple and yet you find yourself wondering about what's happening or wanting to help the characters to reach their objective. As already mentioned, you don't get attached to the character's objective or anything, you simply have one mission and complete it. The game is very forgiving and will give you several checkpoints along the way so you don't lose almost any progress when you die, I didn't put that on the lists because it can be pleasant or not to you. The most challenging things are to get optional upgrades, so you should have in mind it's pretty casual.  In the end I recommend only getting this game if it is on sale and you want something casual to pass time.",
            "review_score": "-1"
        },
        {
            "review_text": "This is just a great game. The visuals and ambient sounds are amazingly well done. There are plenty of puzzley parts that require some actual thought on what to do, and which upgrade to use. It reminds me of Metroid, but flying in a ship instead of hoofing it. You get lots of different upgrades to progress as well as open up areas in places you've already explored. My only complaint is that it is too short. I finished the game in about 7-8 hrs, plus another hour to find the remaining upgrades which weren't required to beat the game.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are great, like Tim Burton made a video game. Gameplay reminds me of Pixeljunk Shooter but with better graphics and more cinematic presentation. Didnt get far in the solo campain, but LOVE the coop mode. This is where this game really shines!  Coop is local or net, but I strongly recommend a local game on your couch.  Together with a friend its great fun, with 4 players its fantastic!  The game mode   Latern run   this is one of the best coop party games along with some beer. :-) You and your friends are little flying saucers who try to escape a giant tentacle monster chasing you.  Totally worth just for the fun in the local coop mode. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I really love playing this game, so far I only played campaign. But that is enough for me to say, if you love puzzle games, buy this game. It's puzzles are not that hard, but some are pretty difficult imo. The game is very straight forward.  Definitely a must-buy for puzzle lovers and players who liked VVVVV! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great metroidvania style game. Beautiful artstyle. Very simple storyline that is told through cutscenes. Not too long, but fun for the few hours it will take you to beat it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun metroidvania-stype game with a persistent singular world that encourages backtracking and such to get upgrades and items that you couldnt get before a certain point, which keeps things not feeling too linear. It's pretty challenging too, which is nice, yet the controls are intuitive and easy to handle. I love the artistic style of this game as well, it's a very simple aesthetic that conveys the alien-ness of the world you're exploring very well. It's also not too long; I finished the game with 100% completion in 6 hours or so, so if you are looking for a relatively short yet complete experience and you like the genre, pick this one up.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little game with an art-style that reminds me of Samurai Jack. Considering the short lenght of it, I'm glad I bought it in an Humble bundle. I played with a controller and it's alright but for some parts (namely the 2-3 missile puzzles) I used the mouse. The online part is dead and I managed to try it only because I create a game and played it with my brother.  All in all a little gem.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but be aware, that the singleplayer stuff is rather short, and when you don't leave the game running over night, you probably won't spend over 10 hours in it. It's a nice little story though. Very much worth it when you get the game for a few bucks.",
            "review_score": "1"
        },
        {
            "review_text": "Very mysterious and intriguing game. Will give you just enough to make you want to explore every damn corner of the map. It's a very imaginative game, and it will tell you a story without a single word.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, with good atomosphere. Thanks too the devs for the Linux release also!",
            "review_score": "1"
        },
        {
            "review_text": "Insanely Twisted Shadow Planet follows the Metroidvania formula well with a diverse selection of weapons, all of which suit the theme and present new options both for exploration and for combat. The world is almost entirely open and gates that can only be unlocked with new weapons pop up from the beginning. The map clearly shows what has been explored and what hasn't and can even note the weapon needed for a particular gate. It's all here, save the fun. There's just too much frustration to allow fun to flourish. Enemies respawn at surprising rates which would be fine if it was any fun to shoot them. Past the first time realizing that a new weapon would be better used on this enemy or that, fighting is a chore. The often narrow, obstacle-fulled corridors would be more at home in a puzzle-platformer which Insanely Twisted Shadow Planet very nearly is, and would be better for being. The two co-op modes - a feature that should be an absolute boon for such a short game - doesn't help with that either. They both emphasize the worst elements of the game by adding more combat and forcing the player to cart something around for the entire mode, a mechanic that only serves to point out how finicky the grabber arm is. Both modes also feature a timed element and remove all the enjoyable exploration and permanent advancement that made the main campaign so close to being something great in the first place. And there is something great hiding in Insanely Twisted Shadow Planet. Sadly, it's just too buried under layers and layers of poor execution to really shine.",
            "review_score": "-1"
        },
        {
            "review_text": "Simple, but a lot of fun!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for me and my boyfriend to play coop.   Its a fun little game to play with other people, but after 30-60mins it becomes boring.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just so fun. I have never seen anything like this. You should buy this. If I say anything about this, it'd spoil it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun exploration-type game. Personally I felt most of the mechanics ended up underused, nearly abandoned completely when you acquired the next puzzle item. Not too challenging of a game but it doesn't need to be to be enjoyable. There's also some multiplayer-type modes that I barely touched because whatever. They're probably fun enough too but I wouldn't know. I enjoyed the game for what it was. $15 might be a bit high of an asking price, though.",
            "review_score": "1"
        },
        {
            "review_text": "Finally on STEAM! A game worth playing and exploring. threw me back to 'Shadow Complex' a classic 2D platform adventure waiting to be explored with appreciated.",
            "review_score": "1"
        },
        {
            "review_text": "  fun               doing this for the community badge :|",
            "review_score": "1"
        },
        {
            "review_text": "What to say about this game.  I love the stlye, i love the combat, i love the exploration, the upgrades, i love it all...  However!  3 hours of 2d content really isn't worth the $15 pricetag. While it looks big when you first start playing, you get through it way too fast, it could really benefit from a few more levels or bosses or anything in terms of more content really.  So if it goes on sale for like $2 or something, i'd say go for it, but as it is now, it needs to fill out quite a bit to justify the price.",
            "review_score": "-1"
        },
        {
            "review_text": "Buyer Beware! Lack of support for Local co-op. You MUST have two controllers in order to co-op, as their inept execution makes both the keyboard and controller act as player 1.",
            "review_score": "-1"
        },
        {
            "review_text": "Wish i'd never read the reviews and bought the game. It's downright boring and lame.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is dope. I agree with everyone else that the art style is very well done. Controls are really good too, even with mouse and keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "I'm only about 60% through the basic campaign, but have been enjoying myself immensely. This is a very clean, visually striking, exploration focused adventure, with some pretty intense SHMUP style combat.",
            "review_score": "1"
        },
        {
            "review_text": "Fantasic game, get it now",
            "review_score": "1"
        },
        {
            "review_text": "Ok, but not for the full price.",
            "review_score": "1"
        },
        {
            "review_text": "Overall one of the better releases this year, albeit a bit short. Fun, entertaining for a whole day, not too hard or too easy, just plain 'ol casual fun :) Highly reccomended.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Not much replayability, but really fun and enjoyable for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game a decent amount. Varied enemies and tools, varied puzzles (though not particularly hard puzzles). It's not the most fun I've had in the genre, but it's a good buy if you get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Simply fun as it looks as well as unique art and music. Not much can be said without detracting what great little ganme this is",
            "review_score": "1"
        },
        {
            "review_text": "A neat blend of Metroid-style weapon/armour upgrades and exploration combined with arcade-like shoot-'em-up mechanics. While the game is very short (5-10 hours depending on how much you want to explore and collect powerups), the sharp art style and tried-and-true gameplay make for and engaging game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like solar jetman crossed with super metroid, great stuff",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun and addictive puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Insanely Twisted Shadow Planet is a gem. A solidly designed game that reminds of cinematic platformers of yore. The excellent and very animated art immerses as you descend deeper into the planet, deeper into the madness... and emerge stronger... or perish.",
            "review_score": "1"
        },
        {
            "review_text": "A magnificent dark and twisted adventure that comes with a great score and graphic detail... Simply genious.",
            "review_score": "1"
        },
        {
            "review_text": "Artwork, athmosphere ,animation, puzzles and boss-fights are a pleasure to watch as well as to play. -Innovative controls -Never stops to surprise you  Style &amp; feel is a mix of 'world of goo' and metroid. ",
            "review_score": "1"
        },
        {
            "review_text": "Insanely Twisted Shadow Planet is a decent side scrolling adventure. You play the role of a trapped flying saucer looking for a way off a dark and twisted planet. You end up having to find multiple puzzles pieces and ship upgrades to move through the different areas. There are several boss battles that require certain weapon strategies along with several cool physics based puzzles. It's short, slightly boring, but still enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "So Its a metroidvaniaish kinda thing with a little UFO. The design is pretty distinctive and with an xbox controller it controlls very responsively as well. Not deep, but definately enjoyable. (8.5/10)",
            "review_score": "1"
        },
        {
            "review_text": "highly recommended. perfect length, progression, and feeling of reward and satisfaction. beat it over a span of 3 days.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously now, it was a surprise to find this game was a Metroidvania game where you play as a flying saucer. Beat it in one sitting but my ♥♥♥ was numb as hell afterwards.",
            "review_score": "1"
        },
        {
            "review_text": "Funny swisted game. You are lonely ship against strange monsters. Calm game for people who like such genre. AS for me it a little boring. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best independent games I ever played. The quality and originality is amazing. The game strongly reminds me of Metroid Prime and is just as fun. My only complaint is the game was too short and the final boss could be beaten using solely your plasma cannon (or whatever it's called). Some of the powerups you collect just don't get used enough, which is disappointing considering how cool they are.  If you're looking for a great game to spend a weekend, I'd highly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "Grab this ON SALE if you're a Metroidvania fan. Otherwise, it's expensive fluff.  A quick, twisted dive into Metroidvania-style gaming. The art style is cool and atmospheric. In eight hours, I finished the game with a fully upgraded ship and most of the items, barring a couple artifacts and/or concept art pieces.   Bosses are infrequent and not so difficult, or creative with regard to gameplay and the items you find along the way. The items themselves are pretty cool and fun to use, for the most part, but a few lack imagination. I was particularly disappointed by the main laser upgrades.   I'd hoped for more content, more challenge. It's fun, but honestly 14 euro is too pricey for what it is.",
            "review_score": "-1"
        },
        {
            "review_text": "well the game isnt for me because i dont really like puzzle strategy games and that god dam black backround so i say no to this but for a person who likes complex puzzle strategy games this is for them",
            "review_score": "-1"
        },
        {
            "review_text": "Super fun game and relatively cheap. I would recommend this to any one. But a controller is the best way to play this game so make sure you have one of those.",
            "review_score": "1"
        },
        {
            "review_text": "Short and fun Metroidvania with an awesome art style. Had a bit of trouble with the Steam Controller on this one, but it was a blast to play. The different weapons are fun to play around with, the onboard scanner tool makes sure you're never totally lost but the puzzles still manage to be challenging, and again, the game looks just plain awesome. Definitely recommend it to anyone with a love for trippy sci-fi visuals or Metroidvanias.",
            "review_score": "1"
        }
    ]
}