{
    "app_id": 205840,
    "name": "Yesterday",
    "release_date": "2012-03-22",
    "developer": [
        "Pendulo Studios"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Mystery"
    ],
    "achievements": 0,
    "positive_ratings": 551,
    "negative_ratings": 113,
    "price": 6.99,
    "description": "Yesterday is a thrilling and dark mystery from the masters of adventure, Pendulo Studios.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/205840/header.jpg?t=1447355271",
    "minimum_requirements": "OS: WINDOWS XP SP2/VISTA SP1/WINDOWS 7 Processor: INTEL/AMD 2.0GHZ Memory: 1024 MB (XP)/2048 MB (VISTA/7) Graphics: 256 MB 100% DIRECTX 9 COMPATIBLE.  ATI RADEON X800/INTEL GMA 3000/NVIDIA GEFORCE 6800 OR HIGHER* DirectX®: 9 Hard Drive: 8 GB Sound: DIRECTX 9 COMPATIBLE Other: INTERNET CONNECTION REQUIRED FOR GAME ACTIVATION *SIS AND VIA/S3G GRAPHICS CONTROLLERS NON SUPPORTED",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Is this a game worth your time? It has lots of casual murder, so yes. YES!  But…  …the game is very, very short and very, very easy. I’m neither a clever man nor an avid adventure gamer and I always need to look up what to do in walkthroughs sooner or later. That being said, Yesterday took me roughly 3.5 hours to finish and I breezed through it. Some of the riddles are just stupid too, like right at the beginning you must reconstruct a payphone to call someone and even though you have a mobile and the person you’re trying to call has one too the game never even allows you to try to use your mobile.  …all the cut-scenes are… minimalistic, is a word that could describe them, I guess. They’re mostly just a series of snapshots and fade-to-blacks instead of a short movie or there’re just animations in front of a black background.  …the game has very few locations, very few riddles, very few dialogs, very few items, very few of everything basically. For example, the cast size is tiny and there are basically no secondary or background characters.  …the story is rather incoherent at times, which is a result of budgetary limitations, I think. Too many holes in the narrative, too. Throughout the entire game I had the impression that half of it was missing. Scenes just start and you don’t know why, scenes just end and you don’t really know how, facts are stated and information are given and there is a general lack of context present at all times.  …there are story twists planted in the narrative but they’re NOT played out so that at some point you just think to yourself “oh, that person was this?” and then you shrug your shoulders because the timing is messed up. And that’s very unfortunate because early on they actually prove that they know how to properly time a twist.  …everything feels really underdeveloped, especially the characters. By now we can see the theme I’m going for, I reckon. Because of the tight budged nothing really has room to breathe and time to unfold. You meet a villain and in the same scene you dispose of him, you meet a character and five minutes later you’re already big chums with them. It’s stripped down to the bare essentials.   So I think what I’m trying to say is this: There is a jarring chasm between the very big and lavishly played out prologue and the rest of the game, which really hammers home the point that they planned a big old adventure game in the tradition of their very own Runaway series but were forced to make a very, very small game in the end.   And still, the atmosphere is fantastic, dark and creepy and weird and aloof and just spot on; the music is sometimes great (and sometimes just cringeworthy), the voice acting is rather good all around, the writing is never bad and quite good at times; the game is not funny nor does it try to be funny and the story is dark and evil and heavily inspired by the occult. They also have played a lot of PlaneScape: Torment, I’d say and that is never a bad thing. And they start the game with a proper mind♥♥♥♥!  So yes, it is absolutely worth the 3-4 hours you’ll spend with it. If 3-4 hours are worth 10 Euros to you, that is for you to decide though.",
            "review_score": "1"
        },
        {
            "review_text": "This starts out innocuously enough...a couple teens are going into the subways to help out some homeless people. Then the ♥♥♥♥ goes down. Flash forward and you are John Yesterday, whose memories have been wiped clean. You end up on a journey of discovery while unraveling the mystery of your lost memory while finding out why homeless people have been disappearing.  This was a pretty cool point and click adventure with quite a bit of depth. The story was one of the better ones in a PnC game, IMO, The graphics were well done in classic PnC style. The travels and adversity you face makje for a compelling journey. There are flashbacks, including a bit of a Kung Fu/Carradine rip off which was still pretty cool.   The puzzles themselves were mostly reasonably easy, but there were a couple intricate ones that had me guessing for a while before finally sorting them out, so there is definitely a challenge awaiting you in this game. Nothing insurmountable however.  I really enjoyed this game and in fact played through it twice (although my Steam time played count is skewed due to the process not shutting down over a weekend for some random reason).  I think this game deserves about an 8 out of 10 across the board. Everything about this game was right at that rating in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "Great adventure (point and click) game with a great story. I really like the fact it has logical puzzles and no pixel click. It's quite a short game, I want more ;) Waiting for Yesterday Origins.",
            "review_score": "1"
        },
        {
            "review_text": "Mixed opinion. I liked the story and the darker tone. On the other hand, I hated to see the character teleporting around instead of walking, didn't like the comics-like stuff. And the game is short. 2€/h if you take your time... No.  I liked the game, but not so much. The best Pendulo Studio's game is definitely Runaway. Go buy this one instead.",
            "review_score": "-1"
        },
        {
            "review_text": "I remember a couple years ago when I got this game for like $30, and at the end I felt like I made a very good purchase. The story is actually pretty interesting (can screw with your head a bit at the end) once it starts to pick up, and the point and click elements of the game are solid. There are not many puzzles, but this is not a puzzle style game. Think of this more as a Telltale style point and click  The game is now $10... I beat this in about 6 hours, and I didn't really blow through it either. So the playtime is definitely a bit short, but it FELT long (looking back at my playtime I can swear I played longer than 6.1 hours). I recommend this to anyone who appreciates a good point and click game",
            "review_score": "1"
        },
        {
            "review_text": "PROS:  Story. Animations. Music. Challenges.  CONS: Very short. Long Dialogs.   ",
            "review_score": "1"
        },
        {
            "review_text": "A dark story with distinctive characters and a great adventure game, but it cuts a little short and I personally don't like how Pendulo handles animation - their humorous dialogue, however, remains a good quality in the background for this one, despite being more serious than The Next Big Thing.  Expect alchemy trivia, cults and some romance. Even though it ended much too early (the story has a lot of potential), I can't decide which of the endings I liked best because they were all really great in my book.",
            "review_score": "1"
        },
        {
            "review_text": "Really cool point and click! Nice twist.",
            "review_score": "1"
        },
        {
            "review_text": "For Yesterday all his troubles seemed so far away, but now it looks as so they’re here to stay. While this game does a great job at building rich environments and suspense, it just as effectively ruins it with the occasional flatly delivered dialogue. Yesterday has a few good story twist but over all characters feel as close to you as that third cousin you only see at family reunions. This ‘point &amp; click’ adventure game visits the story/puzzle based games we all loved of yesterday, but with the unfortunate price of today. Would you pay 30 bucks for roughly 5 hours of game play? No? What if it had 4 endings?... Me neither. Don’t discredit this game, if you have the itch for a little nostalgia, and a day off go for it. Rating 5/10",
            "review_score": "1"
        },
        {
            "review_text": "Pendulo studios was creating best point and click games in last few years as I heared. I really LOVED The Next BIG Thing, but this, this is something new. Introdusing serious storyline and new caracter John Yesterday, they did the great job. If you bored of games where you don't use your brain, this is what you need.",
            "review_score": "1"
        },
        {
            "review_text": "For Yesterday all his troubles seemed so far away, but now it looks as so they’re here to stay. While this game does a great job at building rich environments and suspense, it just as effectively ruins it with the occasional flatly delivered dialogue. Yesterday has a few good story twist but over all characters feel as close to you as that third cousin you only see at family reunions. This ‘point &amp; click’ adventure game visits the story/puzzle based games we all loved of yesterday, but with the unfortunate price of today. Would you pay 30 bucks for roughly 5 hours of game play? No? What if it had 4 endings?... Me neither. Don’t discredit this game, if you have the itch for a little nostalgia, and a day off go for it. Rating 5/10",
            "review_score": "1"
        },
        {
            "review_text": "This hidden jem of a game that is severly underrated, although yesterday is a short title it is one that shines in its mystious story, somewhat dry humor, and intersting charicters. it is a dark point and click adventure tale and one to be picked up when its on sale, the main downside is a campain that only lasts about 3 hours and sadly no real replay-ability.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about Yesterday?  Yesterday is a rather good mystery adventure game for those moments you cannot be bothered to do a lot of heavy thinking. The puzzles are very logical, but still require you to put some effort into things. Every level is a gem and you'll feel happy when you finish it. None of the puzzles require you to take any notes or use items in ways you'd never imagine them being used. This game is really more geared for when you just want to play a short game and not bother with too much hassle, it's a casual game.  The story offers you a nice little mystery of which I won't tell you anything in order not to spoil anything. It won't leave you reeling with any great revelations, but you are offered some interesting characters and situations and sometimes things do turn out just that little bit different from what you were expecting. The themes can a bit heavy even though nothing too gruesome is shown, but I would recommend that players at least be teens before trying out this little gem.  The voice acting in this game was sublime, the voice actors really did a good job. What I did not like about the game was the lack of graphical options. The game was pretty and ran very good, but like most PC gamers I'd at least like the option to view the game optimally from my machine, which differs from other machines. Especially in a game that offers a lot of story and thus quite a few cutscenes. Still, some of the setpieces were fantastic.  The only other complaint I can offer was that this was not a very long game. With only something of three to four hours and a replayability of nill (it is an adventure game, after all), this is rather limited. But the story was finished and the last thing this game needed was unnecessary padding. If you are looking for a good value:time ratio I'd say that anything lower than $/£/€5.00 is a steal, 7.50 seems fair, 10 is the very upper limit. But this is something everyone has to decide for themselves, of course.  Anyway, this game comes highly recommended, enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "Yesterday is a good point and click adventure with an interesting and quite dark and gritty storyline.  Yet, and that is the major disappointment, it is way too short and can easily be finished in under four hours.",
            "review_score": "1"
        },
        {
            "review_text": "Not a fan of point and click games but this one have nice taste to it with makes very enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun and interesting. The plot is quite dark, creepy and keeps you guessing. It's only an evening's worth of gameplay but it's also quite cheap. The interface is a bit clumsy but there's a button to reveal where all the hidden objects are (the most annoying part of point and click adventure games!) and a hint system in case you need it. If you enjoy this sort of game, it should be worth buying :o)",
            "review_score": "1"
        },
        {
            "review_text": "a teenager version of gabriel knight (or broken sword? never played one). story is kinda lame and have a so-so voice act (havent finish it yet, tho'). but the puzzle is really great and very logical.   recommended for point and click fans.",
            "review_score": "1"
        },
        {
            "review_text": "Pendulo's Latest Reduced to This? This game and those that follow in its example are the death of point and click adventures!  Good point and click adventures consisted of long elaborate stories to compensate for the lack of everything else, like: lack of gameplay, variety, etc. This game's dollar value ratio is: $30/4hours of game (and I'm counting the cut sequences).   What a far cry from 'The Walking Dead,' 'Sherlock Holmes' (pick one), and - dare I say - the original point and click 'Dream Fall' which came out like 10 years ago!   This is not even a third of a game! Award-winning films that cost millions of dollars to produce end up costing $15 to own the Blu-Ray.   The reason why critics didn't tear this game apart is because they get their copies for free. If I got this game for free, I wouldn't complain; it's awesome for a 4-hour game! For gamers - those for whom games are made - this game represents paying top dollar for minimal value.   *Shaking head in shame, confusion, and dissapointment.*",
            "review_score": "-1"
        },
        {
            "review_text": "love everything about this game",
            "review_score": "1"
        },
        {
            "review_text": "Very good game with an impressive story!   I'm playing adventure games since the first Monkey Island came out and I can say that this is one of the best point and click adventrue games I have ever played!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great looking point and click adventure game, but I found it to be mired in nonsensical puzzles and an incredibly boring story tangent in the middle of the game. More patient players might enjoy this more than me, but it lost me very early on.",
            "review_score": "-1"
        },
        {
            "review_text": "Totally bugged. Can't really play it...",
            "review_score": "-1"
        },
        {
            "review_text": "Okay story/puzzles, but feels rushed mostly because of how short it is.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game if you hate reading but like good stories. It is short but like good stories or books it only takes a few hours to read them. The puzzles are not extremely difficult to figure out and with the help of the hint system the puzzles are a breeze.",
            "review_score": "1"
        },
        {
            "review_text": "A short amazing point and click game with a crazy story. Nice visual style throughout and puzzles that makes sense.   A must if you like the point and click genre.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely well done point and click adventure. I rarely play these kind of games because they're time consuming, but this one has an exquisite storyline that honestly could've been a bit longer. I loved the ironic humour in the hints! Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little click adventure. Worth the story and humor.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Simply great. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "This game deserves better. I feel really sorry that this game is not well known.",
            "review_score": "1"
        },
        {
            "review_text": "This game was such a mind f*ck in some places. I loved it. I wasn't expecting half of what was going down. Great game, super interesting story and wonderful art. Totally recommend to all who might want to play.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game...yes, it's a regular point and click and it's pretty straight forward, but the story is nice and now the game is in steam summer sale! I recommend you buy it! Just €2,50 for almost 4 hours of good story telling...you'd spend more buying a good book ;)",
            "review_score": "1"
        },
        {
            "review_text": "A little 'janky' here and there animation wise but the bonkers story kept me playing!",
            "review_score": "1"
        }
    ]
}