{
    "app_id": 205950,
    "name": "Jet Set Radio",
    "release_date": "2012-09-19",
    "developer": [
        "Blit Software"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Great Soundtrack",
        "Classic",
        "Action"
    ],
    "achievements": 30,
    "positive_ratings": 3398,
    "negative_ratings": 631,
    "price": 5.59,
    "description": "Tag, grind, and trick to the beat in SEGA’s hit game Jet Set Radio!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/205950/header.jpg?t=1523026191",
    "minimum_requirements": "OS:Windows XP SP2 or newer  Processor:Pentium 4 or Athlon CPU &gt; 1Ghz or newer  Memory:1 GB RAM Graphics:256Mb video RAM or more (256Mb video RAM or more) DirectX®:9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "SOMEONE PLZ MAKE A PC PORT FOR JET SET RADIO FUTURE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "'A few high school dropouts are spray painting some walls.' 'Obviously, we need 4 helicopters, a SWAT Team, attack dogs, bombs, and tier gas.' 10/10 would be a victim of police brutality again",
            "review_score": "1"
        },
        {
            "review_text": "One of my most cherished childhood games. This might've been my favorite game on the Dreamcast, next to Sonic Adventure 2. Great soundtrack, crazy characters, and fun gameplay. Nothing like opening a game up and hearing the awesome announcer blurt out, JET SET RADIOOO!~",
            "review_score": "1"
        },
        {
            "review_text": "Game of my childhood, thank you Sega",
            "review_score": "1"
        },
        {
            "review_text": "This music just turns me ON!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ING AMAZING!!!!!!!!!!!!! I ABSOULUTLEY LOVE THE SOUNDTRACK AND WISH SEGA WOULD MAKE A FUTURE PORT!!",
            "review_score": "1"
        },
        {
            "review_text": "Now I want to go rollerblading and look like a complete idiot. Game is still good though. jsrf when",
            "review_score": "1"
        },
        {
            "review_text": "  Jet Set Radio is a must buy, it's gameplay is so unique and innovative for it's time, and heck, It even still is unique for today! I played Jet Set Radio on the Dreamcast back around '10 and I fell in love with it. It's music was so catchy, the art style was great, and the graphics i considered great back then, even in 2010.   In my opinion, the music is easily the one of the best game music ever composed, it's so catchy, clean and I still sometimes listen to JSR OST to this day! Gameplay is fun, I love skatin' round the streets of Tokyo-To and getting chased by cops while I spray graffiti all over the walls.   I defiintely recommend this game, it really does stand out and is so unique from all the other games from it's time and today. If you wanna try something new, I say, go for this game.   But, however, YOU NEED A CONTROLLER. This game considered almost  Impossible  with a KB/M, and try not to go so hard on the joy sticks when spraying graffiti, as it could lead to blisters on your hand and they kill.",
            "review_score": "1"
        },
        {
            "review_text": "This game was great for the Dreamcast, and the PC version is even better. Not like, 'super better', but definitely really good.   JSR is far superior to the Xbox sequel, 'Jet Set Radio Future.' Don't listen to the heathens who would tell you otherwise.   Anyway, get this game, pair it with an Xbox 360 controller, and be ready to experience one of the best gaming soundtracks and weirdest gameply you've played in quite some time.",
            "review_score": "1"
        },
        {
            "review_text": "QUIT PLAYING WITH THAT RADIO IM TRYING TO GET SOME SLEEP",
            "review_score": "1"
        },
        {
            "review_text": "  'HQ to all units! We got a rollerblading graffiti artist in the construction area of Kogane!      DEPLOY ALL CHOPPERS!   '",
            "review_score": "1"
        },
        {
            "review_text": "Jet Set Radio was an amazing game for its time. but imho the controls were clunky and the camera angles were a little off. The graphics although decent could have been done better considering that its a PC port.Still though the game ran smoothly on my Rig.Get this game if you were a fan of the Jet Set Series for the dreamcast and Xbox.For New players get this on sale instead.  6/10  Note:Keeping my fingers crossed that Sega will release Jet Set Radio Future for the PC",
            "review_score": "1"
        },
        {
            "review_text": "I'm 17 years old and what is this.  Nah, really, JSR is a game where you're a group of people called the GGs, spraying graffiti around the fictional town of Tokyeo-To. Sega always nails it when it comes to graphics, as this game has a nice, visualized art style with vibrant, popping colors. All throughout the game, you're tuned in to the 'Jet Set Radio' station where awesome music plays during the stage. Keeps everything upbeat and fun to listen to. The gameplay is essentially to spray the entire area with your graffiti while avoiding the authorities (Which you can also spray on them. For fun, you know?) It's fast paced action with a decent play time. You can even make your own graffiti in a little creator! (That is, whatever you can make by using a controller...) All in all, this game is pretty god damn awesome, and for 5 dollars, that's quite the steal. I whole heartly recommend it.  ...Although it kinda boggles my mind that they send it choppers with missles to get some punk kids :/    ",
            "review_score": "1"
        },
        {
            "review_text": "this game is just as sick as aggressive inline, but it also hurts like aggressive inline.",
            "review_score": "1"
        },
        {
            "review_text": "I might just be nostalgic about this, but this game is still smooth as ♥♥♥♥. It's supercharming. It has well-designed levels, fun gameplay, an acceptable difficulty level and one hell of a style.  But most of all, if you don't like the game itself, you can leave it on just for the tasty jammy-jams.   SUPA BRADASU",
            "review_score": "1"
        },
        {
            "review_text": "-SEGA -DREAMCAST -DJ'S -HIP HOP -UPBEAT -COLORFULL -GRAFFITI -INLINE SKATING -CELL SHADE  Do I need to say more? BUY THE DAMN GAME  SEGA! Relese JET SET RADIO FUTURE on STEAM!",
            "review_score": "1"
        },
        {
            "review_text": "Basically the best video game adaptation of The Warriors.",
            "review_score": "1"
        },
        {
            "review_text": "Great and fun game. This game is SEGA's most underappreicated. We need the PC port of its sequel and a reboot immediately.",
            "review_score": "1"
        },
        {
            "review_text": "A cool arcade-style game. Skate and grind around different parts of Tokyo-to while spraying grafitti all over the place. Easy to learn, but takes dedication to master the grinds and execute the spraying. Avoid police and later mafiosi and spread glorious youth culture.  The soundtrack is one of the best ever I have ever heard, outstanding, like the graphical style. It uses cel-shading, I think it might have been the first game ever to use it back on the Dreamcast. It's cleaner and crisper in the HD version.  3D platformer mixed with skating mechanics, all presented with an unique graphical style, amazing soundtrack and a colourful cast of characters create a game unlike any other. High replayability for prefectionists and completionists.",
            "review_score": "1"
        },
        {
            "review_text": "one of my favorite games i've played. the graphics are amazing in HD and paired with the cel-shaded graphics, it looks beautiful. the soundtrack is one of the best i've ever heard. really fun if you enjoyed the old tony hawk games or even the DC version. Either way, buy this game now",
            "review_score": "1"
        },
        {
            "review_text": "*sprays graffiti* *suddenly three attack helicopters appear* oops",
            "review_score": "1"
        },
        {
            "review_text": "A great port from the Dreamcast's 'Jet Grind Radio'.",
            "review_score": "1"
        },
        {
            "review_text": "what a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Skating trick game with graffiti objectives.  Gameplay is fun and satisfying especially coupled with the legendary soundtrack, I always feel happy playing this or any game with the JSR soundtrack. The levels start off fairly simple but have a good difficulty curve that really demand some level of planning and skill by the second half of the game.   Very stable considering it's a 2000 console port. Only ever crashed once for me, everything else has been fine, no slowdown even on a mediocre PC. Gamepad is almost mandatory due to the control scheme, but I'm sure some people will be able to use keyboard if they really want to.  10/10 would ride high on a smooth stream of supersonic sound again",
            "review_score": "1"
        },
        {
            "review_text": "Jet Set Radio is a great classic gem during the Dreamcast era and because of that mouse and keyboard weren't in mind when Sega made this game. A controller is highly recommended while playing this game only because when one makes graffiti the game will ask the player to make curved motions. Other than that, this is an amazing game with amazing music, dated but colorful visuals, and is simply a fun game. I only wish that the game was longer!",
            "review_score": "1"
        },
        {
            "review_text": "Jet Set Radio is a game where you play as the GGs, a set of 'rudies' who graffiti the city of Tokyo-to, a spinoff of Tokyo. The game revolves around you performing tricks, but mainly spraying graffiti at certain points. The small graffiti just ask you to press a button to spray, but larger spray tags, named large or extra-large sprays, require you to perform quick time events with the analog stick (or keys if you played on keyboard, like I did).  The game features 4 rival 'teams', the first 3 are the Love Shockers, Noise Tanks and Poison Jam, and then finally the Golden Rhinos. The first 3 are just rival gangs which you are targeted with spraying over their tags while the police stop you from doing so, which leads to the captain Onishima leading a SWAT team, Helicopters, Air Squads, Tanks, Guard Dogs and even more to stop you. Eventually, after beating all 3 teams, the Golden Rhinos then make an appearance.  The story is silly and is quite fun to play with. The game is generally quite fun and easy unless you plan to go for Jet ranking on all levels, unlocking all the characters and graffiti in the game.   The game is definitely worth playing and buying, but hopefully in the future we'll get the sequel Jet Set Radio Future.",
            "review_score": "1"
        },
        {
            "review_text": "Really original and unique gameplay with a basic but enjoyable story and the best soundtrack in a video game ever",
            "review_score": "1"
        },
        {
            "review_text": "Though not as polished as JSRF, the original Jet Set Radio still kicks an incredible amount of ♥♥♥. It is the symbol of the Dreamcast era of SEGA for a reason.  First of all, the graphics aged well, thanks to cel-shading (arguably, this game invented cel-shading) and an awesome artist work. If you can appreciate the great style over the amount of polygons per model, you're going to enjoy how this game looks even today. The soundtrack is all kinds of awesome. I don't think anything needs to be said here. The gameplay however, is the reason why I would take JSRF over this one. The controls could be wonky at times, the tutorial is borderline impossible to complete because of one needless challenge at the end, and also the time limit will make you rage at one point or another. And overall, Jet Set Radio is not as smooth as it's sequel. Well, after all, this game turns 14 soon. JSR is still one of my favorites, and still is a classic. If you consider yourself a true gamer, you need to check this out. P.S. It would be great if SEGA ported JSRF here (since it was an XBOX exclusive, sadly), it would make me the happiest person ever.",
            "review_score": "1"
        },
        {
            "review_text": "Be a rebel while skating through the city spraying graffiti!  The funky music, the clean cell-shaded graphics, and upbeat gameplay makes this an addiciting classic!",
            "review_score": "1"
        },
        {
            "review_text": "One of THE games of my nostalgic Dreamcast-era. By that I mean it is one of my favorite games of all time that left an unwashable trace inside me for being of the best and rad games of that time as a crazy stylish roller-blading simulator AND at the same time a graffiti artist always on the run.  It was a tremendously fun game then and it still is, a port or not a port (which is surprisingly not badly done at all). Not to mention a soundtrack I used to listen many many times all over across a span of many years (and rollerskate listening to it too haha, along with Air Gear ost). The title is hilarious and unique in many ways. A masterpiece in my eyes. Recommended for every rollerblades, graffiti, quirky art style, nice electro music or just funny outlaw action lovers. P.S. An analog stick is highly recommended, graffiti painting is done by rotating the analog a lot and it is crucial. Can be done with a keyboard but it's pretty laggy and unreliable in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "As one of the pioneers of cell-shading and the star-making project of video game composer Hideki Naganuma, Jet Set Radio sports a visual and audio presentation that is simply ageless. Unfortunately, one thing that has aged is the control, with the jumps being floaty and the dash only kicking in when it wants to. Still, get over that learning curve, and you are rewarded with one of the most unique, flowing and fun games around, even today. This PC HD remastering is all around solid, the entire soundtrack is still here as well, which is a must. The options menu have some visual issues on higher resolutions, but the game itself work as it should.",
            "review_score": "1"
        },
        {
            "review_text": "It's a funky game with a ton of skaters.   Players coming from Future should know that the game is less clicky when it comes to getting on rails and stuff. Also, you can't shoot up poles and traffic lights.   Lot less CRAZY, but still a game that's worth your time and money. I highly reccommend the entire series to newcomers.",
            "review_score": "1"
        },
        {
            "review_text": "Jet set radio is like 1000 years old at this point and still looks ♥♥♥♥ing beatiful. The music is on point throughout the entire game. The songs havent left my head since like 1894 or whenever this game ♥♥♥♥ing came out.   The gameplay is slick nasty and theres a lot of fun to be had just rolling around (Not at the speed of sound) and tagging up the city with your custom pixel ♥♥♥♥ and weed leaf graffiti. Honestly 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "A blast from the past!",
            "review_score": "1"
        },
        {
            "review_text": "The fun local multiplayer game of telling your friend named 'Jet' to turn on the radio",
            "review_score": "1"
        },
        {
            "review_text": "I first played Jet Set Radio on the SEGA Dreamcast back when the game was first released. I had fond memories of it from back then and so I was keen to add it to my Steam collection when it came out on PC.  Sadly, I have found that just like my hazy memories of childhood cartoons, those of Jet Set Radio were somewhat rose tinted. The game certain still looks good thanks to the bold colour selection and cell-shaded graphics. But the game itself is nowhere near as fun as I seemed to recall.  The major issue with the game is the sense of movement from the character. Remember, that here the characters are supposed to be ‘super-cool’ skater/punk/rebels that zoom around Tokyo-to on their powered inline-skates. Indeed, this game is all about movement. Yet it utterly fails to deliver on this front.  The character moves slowly and there is never a sense of inertia from the roller skates. Moving around feels more like wading in treacle than skating. It’s virtually impossible to get any real momentum up at all.   This was made very clear in an early level where the character starts in a half-pipe area. There are locations to tag at the top of either side. My first instinct was to get some momentum up going back and forth in the pipe in order to perform the graffiti tags mid-air. But it’s not possible since there is no speed gain from coming down the steep slope. The character just grinds to a halt at the bottom. Tony Hawks Pro Skater this is not…  That the movement is so poor is really strange given that this game is all about movement. Yet rather than letting me feel cool by pulling of speedy moves I ended up feeling more like Chris from Resident Evil using a pair of Fisher Price my-first-skates.  Also, I’d add that given the game chooses to focus its plot around a radio station, it might have been nice if they had put a little more effort into the sound-track. As it stands it’s like skating to an album of B-sides from Parappa the Rapper on the PS1.  And so there we go. It’s a game that I once loved but time has not been kind to it. The movement is terrible and the soundtrack is just as bad. It’s all the more annoying as I am sure there is a fun game in here somewhere. But as it stands the strange design choices manage to quash any spark of joy before it gets going.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This Game Is one Of The most Entertaing games i played i just couldent put it down",
            "review_score": "1"
        },
        {
            "review_text": "even though i barely played this game (I only did 20 to 30 minutes because it was difficult without controller) this game is so freaking awesome. the art and style of the game just goes with the music and it's so colorful. It looks good and is fun.",
            "review_score": "1"
        },
        {
            "review_text": "A really Amazing game!   Great Gameplay, Over the top Music",
            "review_score": "1"
        },
        {
            "review_text": "Pure awesomeness, the only game that sucks you in right from the title screen, with a great soundtrack that enhances a great gamepaly !",
            "review_score": "1"
        },
        {
            "review_text": "I reccomend people to get a controller for this game, otherwise dont play it.",
            "review_score": "1"
        },
        {
            "review_text": "A really Amazing game!   Great Gameplay, Over the top Music",
            "review_score": "1"
        },
        {
            "review_text": "is this crashbox?",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game from the music,the cel shaded graphics,and gameplay (most of it)  the gameplay consist of spray painting certain areas while avoiding cops (sometimes) under a time limit, or tagging rival gangs under a time limit.  the controls ( the key pad controls) you use wasd to move space/mouse 1 to jump mouse 2 makes skate faster for a while and mouse wheel resets camera/ spray paint and move the mouse/jkl to control the camera, speaking of the camera.  the camera wont be your friend some times as in it gets stuck near walls, and remember the cops i mentioned,well their AI is not too bad but in bantam street the AI get really stupidand a bit unfair.  But over all this game is pretty good, 7.9/10   the reason this isn't an 8 is because the AI and camera but it has another saving grace is its price for $ 5.00 for a dreamcast game with all the good things this game is not too shabby.",
            "review_score": "1"
        },
        {
            "review_text": "Classy SEGA gane. One of the best wicked soundtrack ever put in a game. I still own DC original, but my Dreamcast is in bodybag for a long time. Please SEGA bring JSRF an REZ HD to Steam",
            "review_score": "1"
        },
        {
            "review_text": "The art direction and music in this game a great, though you're also going through an early 2000s pop culture trip as you play.  My biggest problem with the game is the controls. Even with a controller, controls for movement and jumping are incredibly inconsistent, and make some levels almost unplayable.   If you're fine with lousy controls, and you have a controller, it's worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "It really good and works on my craptop but when u spraypaint u cant do some of the arrows, at least i cant...so I gotta press q and release q along with the down arrow for all of the graffitti, which is kinda annoying but eh",
            "review_score": "1"
        },
        {
            "review_text": "is this crashbox?",
            "review_score": "1"
        },
        {
            "review_text": "Just wonderful the controls are easy, has a mess around mode and challenging missions. I was surprised that there are a few more characters to play as. But I was a person who got it for free but for five dollars and a possible sale on it is worth it. Now I wouldn't quit some other game for it but it lets me relax and learned new things around the levels. A excellent game done right.",
            "review_score": "1"
        },
        {
            "review_text": "game of the century",
            "review_score": "1"
        },
        {
            "review_text": "I reccomend people to get a controller for this game, otherwise dont play it.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like music ahead of its time, spraying graffiti and inline-skating? Go get this.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really nice conversion of the Dreamcast classic, with support for higher resolution graphics and achievements. It's just about possible to play this using the keyboard, but I'd very strongly suggest taking advantage of the game's controller support. The controller setup screen shows an XBox pad, and the USB SEGA Saturn pad I tried wasn't recognised, so I guess there isn't a lot of choice.",
            "review_score": "1"
        },
        {
            "review_text": "Graphic is somehow interesting (not for people with high standard), Soundtrack is great, Control is a bit difficult for first time. Overall 8/10  but  why there's no retry button  on menu? like i need to fail the mission to retry?",
            "review_score": "1"
        },
        {
            "review_text": "Not bad, got me to play through once, but I stop playing immediately after beating it. I didn't like it as much as JSRF. 3/5",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game for everybody who likes this kind of games. A special mention belongs to the soundtrack, wich is second only to Jet Set Radio Future's soundtrack, and to the art. For everybody who played JSRF, you will love this game just as much as you loved it's more popular sequel, the only pity of this game (other than the graphics being a bit old since the game was published in 2000) is that missions have a time limit, and thus you can't lurk around like in JSRF. Apart from that, definetly worth 5€ and some hours of your time.",
            "review_score": "1"
        },
        {
            "review_text": "One of my top 5 and a half, great soundtrack, beautiful visuals, and a crazed police officer hellbent on putting you in the slammer. Jet Set Radio is one of my favourite games of all time I was hooked after I played JSRF back in the good ol' days of 2003 (I'm pretty sure it was the only game I played) now I can finally experience how the series began and soon plummeted into an ongoing hibernation, where fans year after year slowly die out due to the lack of JSR games. It is/was/and always will be a fun game for anyone to get their greasy, disgusting, @#$% and !@#^ stained hands on. The only con for the PC version is that you're better off playing with a controller.  so long review short: I spray-painted phalluses all over Tokyo-to  G to the O to the T to the Y  11/potato would most certainly bang",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game and it has a great soundtrack compared to other cheesy music today -_-. Some people argue about controls but to me its really easy to use on the keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, what an amazing game. It has an awesome and unique atmosphere, fantastic soundtrack, unlocking/recruiting characters, fighting against rival gangs, sweet art, and cool story! Also, trying to create your own graffiti to use in game is fun. Seriously, this game is a piece of art. For under 10 dollars this game is a steal, try it out. It's so much fun!",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the most enjoyable games I have ever played.  Jet set Radio, originally known as Jet Grind Radio on the dreamcast, is most easily relatable to Tony hawk's pro skater mixed with a grafitti simulator. The gameplay consist of timed challenges that can vary from racing your grafitti crew, to covering all the other gang's grafitti in town. Though sometimes the controls may feel clunky, I found that there were rarely any problems that forced me to restart the level. (I played the entirety of the game with a keyboard and mouse instead of a controller as well.) I did find that after chapter 1, there was a difficulty spike that caught me off guard, that was the only spike in difficulty in the entire game, it stayed steady and fun after that.   The character roster in this game is also pretty big, with characters you unlock throughout the story, as well as secret characters. I did find that some characters had pretty OP stats in comparison to others. YoYo especially, he pretty much has his technique and grafitti maxed. Other than that, character roster is awesome.  This game looks amazing, the colorful, cell shaded style reminds me of wind waker a bit, but with more of a comic book feel to it, which I adore. The texture quality isn't very high, but that's to be expected for a game that origninally came out in the late 90's to early 2000's.  Just a side note, this game runs on pretty much any computer, which is amazing.  I saved the best for last, thought I missed the soundtrack didn't you? No way, this soundtrack is unforgetable. The soundtrack feels like a fantastic mixtape of what someone would actually listen to, with songs that range from hip-hop, to rock, and back again. My personal favorites of the bunch are 'Sneakman' and 'Rock it on'.  If you're on the fence about purchasing this game, I can very simply say, it's worth it.  Now I just have to wait for Sega to make J.S.R.F HD. Haha.  ",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely a favorite! The music is pumpin' and visuals have aged stupendously; it's no wonder it's considered a classic. Along with an even challenge (fair difficulty especially if you're going in with a mouse and keyboard, good luck to you) the character designs range from oddities to A-grade adorable (Gum and Mew being my favorite example). Now, for a more in-depth review of my favorite parts without all the fluffy intro [spoiler warning for those looking for a fresh experience]   There is a large variety in unlockable characters available after completing the comfortably paced levels. Now, I wish I could say the levels are perfect, but there tends to be a bit of a cramped angle and because of the quickly paced movements you'll crash a  lot  without practice. Enemies are easy to drag behind you if you do happen to pick up speed with some carefully timed rail grinds and boosts (fun tricks and all!). Typically missions are fun (even for being timed) and with the previously mentioned unlockable characters the play style tends to be fairly diverse. It's probably also worth noting that the difficulty curb is a bit like a spoon; taking a while to get used to, then comfortable, and then difficult again.   controller recommended, not required. Had just as much with one as I did without, but it is quite useful if you plan on going for a good score or, say, less frustration with tight controls. Otherwise I'd absolutely recommend!",
            "review_score": "1"
        },
        {
            "review_text": "JET SET RADIOOOOOOOOOOOOOOOOOOOOOO",
            "review_score": "1"
        },
        {
            "review_text": "This is my review of Jet Set Radio.  I first played this game when I was 11 years old. The Dreamcast was a short lived console that was greatly snubbed. I was one of the people that cherished the console and this was one of the games that I owned and played a lot. However, due to some unforeseen circumstances, the disk broke. I have wanted to play this game since then and now I have finally finished it.  Me and My Associate played through this game in one sitting, which gives you all the information about the length of this game. Getting a controller to work on this was a bit annoying at points, cutting out on us and making us restart the whole computer before the game would work. I forgot how floaty the controls were on this game. It took me about 3 hours to get the hang of it and be able to move easily. However, once I got the hang of it, I had quite a lot of fun. The music can only be described as Funkadelic, as it blasts through the Jet Set Radio. The art style is simple, yet effective and is very reminiscent of the Dreamcast Era. It was a lot of fun and I would recommend getting this game if it was on sale and take your time to enjoy it. Playing it through in one go can get a bit boring and repetitive.   Remember Dear Readers, You heard it here first. Off the record, On the QT, and very Hush-Hush.",
            "review_score": "1"
        },
        {
            "review_text": "ty sega for giving me this classic for 0 monies",
            "review_score": "1"
        },
        {
            "review_text": "The greatest game on the Dreamcast, and easily in the top 20 games of all time. Why haven't you bought this yet? I need them to make a port of Jet Set Radio Future, dammit!",
            "review_score": "1"
        },
        {
            "review_text": "this game is nostalgic and kinda tough :P",
            "review_score": "1"
        },
        {
            "review_text": "this game is super awesome, it's possible to play with a keyboard but is best with a controller. The music is some of the best I've heard in any game ever honestly and though it can be frustrating at times and a few level layouts are annoying, I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "its good my famila",
            "review_score": "1"
        },
        {
            "review_text": "A classic fun game great game very hard too will last you a long time but has some downsides like the port for the pc is terrible you need an xbox controller or a diffrent type of controller to play this game apart from that its a good game give it 7 out of 10 because of the bad port",
            "review_score": "1"
        },
        {
            "review_text": "Super cool, hyper stylish game. I never played much of the Tony Hawk games, but I assume it's similar in its gameplay. Jet Set Radio is a tough unforgiving rollerblading game where you grafitti the streets of tokyo and race others with a strange plot that honestly doesn't matter.  The game is very cool though, the music is hip, the art is flashy, and it's a good time if you are okay with being a failure and getting wrecked.  As far as PC ports go, this one is really good. Don't worry if the tutorial destroys you, it's not really a tutorial.",
            "review_score": "1"
        },
        {
            "review_text": "JET SET RADIO!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I miss the dreamcast dearly",
            "review_score": "1"
        },
        {
            "review_text": "If you have not played the original on the Dreamcast, Now is your chance! All that is changed is Leaderboards and Remastered GFX!",
            "review_score": "1"
        },
        {
            "review_text": "If you want easer controls use an xbox one conntroller thats what i do how to do that you may ask get a USB cable plug it in your PC then in your controller BAM easy controls",
            "review_score": "1"
        },
        {
            "review_text": "UNDERSTAND UNDERSTAND THE CONCEPT THE CONCEPT  OF LOVE",
            "review_score": "1"
        },
        {
            "review_text": "SEGA, IM WAITING FOR JSRF PORT, you better make it...",
            "review_score": "1"
        },
        {
            "review_text": "A Dreamcast classic, remade in a semi-modern fashion. Down to earth idea, presented with a ridiculous art style and absolutely comical animation. Eye catching, addicting, and fiercely challenging, its a retro relic that deserves to be played. Also, features the ability to graffiti tag police. 60000/10 would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "you can spray images of billy herrington all over town, what more do you need",
            "review_score": "1"
        },
        {
            "review_text": "Well that was a waste of my money, my time, and my hopes... I should have seen it coming though, videos I had watched of the game didn't lie about the floatyness of the game. Something I never ever liked in any game. But hey ! If there is good level design, it'll be all right !  Oh.  Oooooh...  Everything feels wrong abut this game. Levels are not as open as they should be, often you'll simply find yourself in a dead end with the only way to go being climbing up stairs. Which of course doesn't mesh with the skates. I might as well not have the skates for unless you're in a slope or have been grinding for a while you hardly go faster than the police officers chasing you. And you trade that modicum of speed you have on them with incredible imprecision over your direction. It's really hard to gain some speed, it's really hard to move around. The game is not snappy in the slightest.  But let's pretend you actually got some momentum. What now ? STOP. Do a graph. Just stop moving. It's time for contextual stick wiggling, harly different from a QTE. It's not very fun, but it is the objective of the game as far as I could tell from these few levels I played. In that regard, it turns the game into more of a platformer as the point is not to build speed but to jump around so that you can reach spots to graph. But again, it's so imprecise I'd rather play a genuine platformer like Sly Cooper.  There is a point system too based on how you trick, but it basically amounts to how long you grind. Which goes in direct contradiction with the tagging objectives that asks you to stop dead in your track, not that it matters considering it's useless and you'll get good grades without even trying. By that I mean that you won't feel like you deserve it and will end up thinking that good grades are actually bad. Seriously. It's that irrelevant. I don't remember any level in the fews I've played that actually recquired you to get a certain amount of points anyway. Why is it even here ?  Let's add to that unskippable cutscene, unsuprisingly dreadful camera, the police forces that feel like they waste your time more than anything else, escaping them stucks you in a cutscene everytime for no other reason but to break your flow so everything about the opposing force, be it avoiding them or escaping them, is annoying, the narrative might as well not be there...  It's not fast enough to be cathartic, it's not precise enough to be rewarding. The levels aren't open enough to give any sense of flow unless perhaps you master them but nothing makes me want to. Graphing is just there to stop you in your tracks. The obstacles on your way are more annoying than threatening. Everything feels wrong. Nothing about it is satisfying.  I want to like this game, I really do but it's all around frustrating... I don't recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "meh...... its ahight",
            "review_score": "1"
        },
        {
            "review_text": "Only good sega game ever made/10",
            "review_score": "1"
        },
        {
            "review_text": "Best ♥♥♥♥ ever 10/10 buy it right now or your mom will die in her sleep",
            "review_score": "1"
        },
        {
            "review_text": "Drop the beat. Boooom oooouuuuu wob WOBWOOOOOOOOB/10",
            "review_score": "1"
        },
        {
            "review_text": "Rollerblading has been a core part of my life for the past 12 years. I've gone through a pair a year and always had my eye on this game since its debut on the Dreamcast.  I've heard Jet Set Radio Future improves the game, but unfortunately this one deserves a pass. For a skate game, the levels are oddly interruptive of flow. It's difficult in all the wrong ways, with terrible controls and poorly thought out paths that abruptly end. A small bump into level geometry (or one of those random cars) stops you solid and that's a pretty fatal flaw for a game about maintaining the flow of motion. A second earnest try at completing the game still resulted in frustration and tedium. Levels are beat based on memorization of paths rather than improvising one.",
            "review_score": "-1"
        },
        {
            "review_text": "Still waiting for Jet Set Radio Future....",
            "review_score": "1"
        },
        {
            "review_text": "It's Jet Set Radio. Use a controller, listen to the soundtrack and just, just play it. Go ahead. Do it. Buy it. Play it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great port with controller.",
            "review_score": "1"
        },
        {
            "review_text": "A blast from the past. The songs are just pure nostalgia, I wish they make Jet Set Radio Future available on steam",
            "review_score": "1"
        },
        {
            "review_text": "This game has been in my life since early childhood. My dad got me this game for the Sega Dreamcast when I was really young, but I never really got into it due to it's difficulty. I found it a while ago because of my friend, and bought it instantly. I don't regret a thing! ==PROS== -Amazing Gameplay -Intuitive design (who would have thought of a game where you spraypaint while getting shot by tanks?!?) -The difficulty (Also could be a con) ==CONS== -The controls. If you don't have a gamepad, you're gonna have a bad time. Except for me I guess. The controls don't really bother me I guess. -Like I stated, the difficulty is INSANE!!! If you miss something, or don't see some small details, you won't be able to beat the levels. Why are tanks attacking a graffiti artist!?! Lol. -It's not free :P In conclusion, this game is AMAZING, but if you don't want to play a game harder than Dark Souls, then this isn't the game for you. My Rating: 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Love it, wish you guys would get Jet Set Radio Future, I would love to buy that too",
            "review_score": "1"
        },
        {
            "review_text": "First things first, without a controller the game is mostly unplayable. Keyboard really wont cut it for this, but thats not much of a barrier to entry as logitech has really good cheap controllers. Just worth noting as a common problem Ive found with ports of console games to steam is they arent ported very well and can sometimes be completly unplayable.  I never played this game before so I dont really have any nostalgia tinted glasses to view it through. Gameplay was alright, not gonna beat any tony hawks game but certainly playable. But the music is... eehhhh... which is a problem because you will be listening too a lot of it. I suppouse you could turn the game music off and just listen to your own stuff but that seems like an odd thing to have to do for a game called Jet Set Radio.  I dont think I'd recommend. I bet it was pretty good for its time but it doesnt feel like its aged well enough for someone like me who is just playing it for the first time.",
            "review_score": "-1"
        },
        {
            "review_text": "There is no save feature but hey it's pretty cool, however this sucks compared to Jet Set Radio Future. We need Future on steam",
            "review_score": "1"
        },
        {
            "review_text": "Jet Set Radio made me angry. It made me happy. But out of anything it made me long for the days when games were simple but packed with raw fun. Lets head to the pros and cons eh?  Pros: Excellent gameplay-simple objectives with fun concepts. The soundtrack is absolutely stellar and worth a listen. Perfect length, not too short but not repeating itself too much. Beautiful, stylized graphics.  Cons:  (This is only for the PC version) Camera is wacky and sometimes interferes with gameplay. Don't use a keyboard like I did...it makes tagging a pain, but using one is doable if you map the keys.  Overall Jet Set Radio is a pure classic, and the visuals and soundtrack make it stand out. Best deal you could find for 5 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "Such a good soundtrack it's crazy. This is actually an accurate depiction of Japan prior to the earthquake crisis. 💎👌💎",
            "review_score": "1"
        },
        {
            "review_text": "Such a good soundtrack it's crazy. This is actually an accurate depiction of Japan prior to the earthquake crisis. 💎👌💎",
            "review_score": "1"
        },
        {
            "review_text": "C'mon, admit it: We all bought this thinking it would be JSRF",
            "review_score": "1"
        },
        {
            "review_text": "FANTASTIC game with a great soundtrack, but WILL NOT LOAD SAVED GAMES IF YOU EXIT. Do NOT buy this in it's current state.",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is fantastic. I remember it from xbox. But my god this is the clunkiest port for pc, the controls just do not work making simple missions impossible.",
            "review_score": "-1"
        },
        {
            "review_text": "game crashes when I fail level 1",
            "review_score": "-1"
        },
        {
            "review_text": "JET SET RADIOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO",
            "review_score": "1"
        },
        {
            "review_text": "I got this game because I heard it was a great game. All I have to say is this game is BAD Now this game dose have a great soundtrack, Awesome artstyle, and great atmosphere. BUT the controles SUCK and I would always have to fight the controles just to get it to do what I wanted. Every time I wanted to grind I could never stay on the grind rail but when i wanted to get off the rail I stuck like mother focking glue. The camera in this game is bad and sometimes ends up screwing me over. ON TOP OF THAT ENEMIES YOU CAN'T GET RID OF WITH THE ADDED BOUNSE OF TIMED LEVELS SO MUCH FUN RIGHT RIGHT!  But hey JSRF fixed all the problems with the first game if only it would come to PC",
            "review_score": "-1"
        },
        {
            "review_text": "As a non weaboo I have to say that this game is a masterpiece! But if I was a weaboo I would say why the ♥♥♥♥ is jet set radio future not remastered yet this one is!",
            "review_score": "1"
        },
        {
            "review_text": "FOR SHAME THIS IS THE DEFINITION OF A PC PORT FOR SHAMEEEEEEEEEEEEEEE",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good enough game, with an interesting subject and interesting mechanics. The controls for tagging can be tricky to execute with a keyboard though, since instead of simply spinning the joystick around, you have to press each individual directional key (which oftentimes leads to failing the tag). Overall I found the game a bit hard, in part because of the keyboard issue but also general gameplay things like how it sometimes requires very precise timing and aim. I've been told that it can take a lot of time and practice to really get into the swing of things, but until then it can be pretty frustrating.   In spite of that, I was willing to keep playing this game. The reason I can't fully recommend it is that it seems to be prone to bugs that make it impossible to play - after having played for a few months with no problems (aside from an early glitch that automatically erased my save file), the game suddenly began crashing upon startup. I've tried every fix imaginable, and none have worked so far. There seems to be 0 interest from the developpers in making any sort of patch or update, so I don't expect the situation to get any better - I'll keep trying once in a while, but I've pretty much lost hope of playing this game until I get a new computer someday (and even then, nothing's guaranteed). Obviously no game is perfect and I don't want to be too harsh when it comes to bugs, but this is the first game I've ever come across that remains completely unplayable even after trying many different fixes and the apparent indifference from the developpers is a bit discouraging.  In short, it's not a bad game at all, but there's a chance that after a while you won't be able to play it anymore with no fixes in sight - so just keep this in mind when buying, I guess.",
            "review_score": "-1"
        },
        {
            "review_text": "  Let's keep it short.  Pros: +Sweet jesus this OST +Sweet jesus this OST +Sweet jesus this OST +Sweet jesus this OST +Sweet jesus this OST +Sweet jesus this OST +Sweet jesus this OST +Sweet jesus this OST +Sweet jesus this OST +Sweet jesus this OST +Sweet jesus this OST +Sweet jesus this OST  Cons: -Game crashed on me twice after getting a JET ranking in one of the levels :/ ",
            "review_score": "1"
        },
        {
            "review_text": "Having played &amp; loved Jet Set Radio Future, I was keen to try this out, but honestly, it's utter garbage compared to Future. This is one of those rare occasions where the sequel VASTLY improves on the original.  It moves at a snail's pace, and the controls are so awkward &amp; frustrating it takes away from any element of fun this tries to go for.  Characters interpret your control input as more of a vague optional suggestion than a command, throwing themselves at walls &amp; off ledges and only landing on rails if they feel like it (but never the rail that actually has the items you need) and tags, when you can actually find them, take so long and so many cans to complete that you spend more time crawling around the level looking for health &amp; spray cans than actually taking care of the objectives, while being bombarded &amp; swarmed by enemies that never leave you alone and almost never miss, to the point I cannot finish a single level because they then have the nerve to put you on a TIMER through all this, so when I don't die from constant health loss from cycling around the level attempting the same failed grind over &amp; over, I die from timing out because it takes too long to do anything.  This is honestly one of the worst games I have ever played, and this is a real shame, because I LOVE Jet Set Radio Future. Future improves on almost every aspect of this god-awful game, and I can't possibly understand what went through Sega's heads when they thought THIS was the version they should port.  If you can, try to get your hands on Future, or help the fanbase convince Sega to port Future to Steam. Save yourself a headache, and more importantly, save your money. If you have a 360, it's backwards compatible with minimal issues, so no worries there.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow that was some bad &amp; clunky controls man. Super frustrating level design. Too much chaotic situations, such a limited time to do anything, no hud, no guides. It was a mess for me. Can't believe I was excited for then when I was a kid.",
            "review_score": "-1"
        },
        {
            "review_text": "love this game but it runs really bad, audio cuts out and it laggs and crashes. buy the ver on xbox 360",
            "review_score": "-1"
        },
        {
            "review_text": "horrible, game does not save at all. very bad bug. great game if you could save. you have to start from the beginning each time you play",
            "review_score": "-1"
        },
        {
            "review_text": "Don't have a controller? Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "After having to install manualy DirectX setup (included by the game) in order for the game to start instead of just crashing. I can't play cause my nVidia GeForce Titan is 'not recognized as a compatible graphic card.' oO  Run away from this game. I so loved the original game I bough it, but it's no use if it just does work. It's like no one care anymore in the video game industry.....",
            "review_score": "-1"
        },
        {
            "review_text": "this may be the worst port I have ever played.  why?  it will crash randomly whenever you beat a mission, do a trick, land, take a step, breathe to fast,or whenever if ♥♥♥♥ing feels like it.",
            "review_score": "-1"
        },
        {
            "review_text": "6min of my life I will never have back",
            "review_score": "-1"
        },
        {
            "review_text": "Why did people enjoy this game?",
            "review_score": "-1"
        },
        {
            "review_text": "The controlls are really awful on the keyboard and on the controller aswell some button combinations are so stupid made! :( But i can say good game for ps3 or xbox but for the pc not really good :( Nice sountracks  and a good game for a console (not for pc)",
            "review_score": "-1"
        },
        {
            "review_text": "Classic title ruined by an awful PC port.",
            "review_score": "-1"
        },
        {
            "review_text": "After the Windows 10 Anniversary Update, this game locks up the computer when trying to exit the game. I cannot recommend this game until this gets fixed.  I forgot that, compared to JSRF, JSR's controls are abysmally sloppy. On a positive note, though, the style and soundtrack of this game are just amazing.  Make an conversion of Jet Set Radio Future and I will wholeheartedly recommend that game!",
            "review_score": "-1"
        },
        {
            "review_text": "I cant get passed the 'tutorial' you get when you start the game. What the heck",
            "review_score": "-1"
        },
        {
            "review_text": "*Not the same as jet set radio future* Bad port, Horrible controls and will have to download other files to get controller to work and impossible to play without controller  Wish there was a proper remake or a sequel ",
            "review_score": "-1"
        },
        {
            "review_text": "WE ARE RIDERS!",
            "review_score": "1"
        },
        {
            "review_text": "Runs at about 1 FPS no matter what I do with the settings. Completely unplayable. No, my setup is not some POS that can't run this.",
            "review_score": "-1"
        },
        {
            "review_text": "controls are slippery. setup screen is ♥♥♥♥ed and it looks like the game'd get repetitive anyways.",
            "review_score": "-1"
        },
        {
            "review_text": "  Man, just give us JSRF HD. Please!",
            "review_score": "-1"
        },
        {
            "review_text": "Simply terrible :/",
            "review_score": "-1"
        },
        {
            "review_text": "At least I didn't pay a cent for this gross game",
            "review_score": "-1"
        },
        {
            "review_text": "Cool concept. neat style. Interesting story...... but why do the controls suck so bad?",
            "review_score": "-1"
        },
        {
            "review_text": "This game makes no sense. A radio cannot be 'Jet Set', you cannot even bring a Radio onto a jet. Don't waste your time with this game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not jet set radio future 1/10  ♥♥♥♥ this game. not even the same soundtrack why",
            "review_score": "-1"
        },
        {
            "review_text": "bad game with low graphics that promotes vandalism",
            "review_score": "-1"
        },
        {
            "review_text": "11!/10, probably the best game of my childhood, now that I can do a propper playthrough and finish the game, I see that it's better than I though. Grace an Glory now makes sense.",
            "review_score": "1"
        },
        {
            "review_text": "The game is really fun and super nostalgic to play, but during the short amount of time I played, the game crashed. It also crashed after I beat the first level. In both instances it lost all of my progress. It's so upsetting, because I was two hours into the game, and about a quarter or so done with the campaign. Now I have to do it all over again for a lousy reason. I won't be playing it anytime soon, because I don't want to go through the same levels again so soon, and the crashes left a really bad taste in my mouth. If you're considering buying Jet Set Radio HD, buy it on a console. They are not riddled with crashes.",
            "review_score": "-1"
        },
        {
            "review_text": "I freakin love this game, i've been playing this like 3 years, but I still loving it :D  PLS WE NEED Jet Set Radio Future NOW :C",
            "review_score": "1"
        },
        {
            "review_text": "would be better if ♥♥♥♥ing autosave worked",
            "review_score": "1"
        },
        {
            "review_text": "This game made me a cool kid. Now I'm super wanted. Being wanted by the police is hip.",
            "review_score": "1"
        },
        {
            "review_text": "favorite game, there isn't anything to hate about it. hopefully jsrf will b available on pc eventually.",
            "review_score": "1"
        },
        {
            "review_text": "Graffiti was a mistake, it's nothing but trash.",
            "review_score": "1"
        },
        {
            "review_text": "The charm of this game is located on its awesome soundtrack (IMHO) and I can see how this game has its cult follower.  Say 'Hi' for me to DJ Professor K if you play this game. :)",
            "review_score": "1"
        },
        {
            "review_text": "I clicked recommend as a biased factor towards this game. It was on sale for $1.25, and as an impulse, I bought it thinking of the nostalgia of this being one of my first games for Xbox (Jet Set Radio Future). If you've played it and you think this is going to quench your nostalgia for JSRF, you'll only be partially satisfied. It is the same style, but to put it kindly, there is a reason that they remade it. The characters are blocky, the costumes in JSRF are a lot better (as are the graphics). I know this was for Dreamcast when it came out, so I tried to keep it in mind. You can't change up tricks and keep your speed up on the rails, and the controls (with an Xbox 360 controller) are more rough and unforgiving. Overall, for $1.25, it's worth the taste on your tongue to remember those days...the normal price, not so much.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest dreamcast game on steam, what's not to like. well controls don't seem to translate well to keyboard especially spray painting",
            "review_score": "1"
        },
        {
            "review_text": "Loved it as a kid and still love it today!",
            "review_score": "1"
        },
        {
            "review_text": "Even better on PC! Thank you for releasing this! I still haven't played the sequel for xbox but am very interested and would buy if ported to pc as well",
            "review_score": "1"
        },
        {
            "review_text": "Honestly its a great game, sadly it wipes your save on accident at times, guess you'll have to wait for sega (or some person) to fix the save patch",
            "review_score": "-1"
        },
        {
            "review_text": "great game and its addictive. sound track can also help. old but still a top game",
            "review_score": "1"
        },
        {
            "review_text": "i sprayed grafitti on like 2 walls and then a cop comes after me, then he requests backup from a S.W.A.T. team, other officers, tanks, and even helicopters and a bunch of other ♥♥♥♥, while i'm just skating away spraying more grafitti and some how disabling the officer by spraying grafitti on his back. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Well. You're just a street punk who does not harm besides graffiti. Why o why is a ♥♥♥♥ing psycho cop with a ♥♥♥♥ing huge gun firing at will? WHAT THE ♥♥♥♥ IS WRONG WITH THIS OTHERWISE FRIENDLY GAME?  Otherwise, it's fun, challenging if you don't have a controller, but fun nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Pro: It's a jet set radio game, and great! Where else where tanks and helicopters shoot rockets at you for your creativity? Nowhere but Tokyo-To!!!   Can't wait until Sega finally makes a Jet Set Radio Future Remake, that was the best!",
            "review_score": "1"
        },
        {
            "review_text": "The visuals and soundtrack are amazing but it means very little when the controls are utter crap. You have very little movement when you jump and will end up missing a lot of intended landings. Save your money on something more playable.",
            "review_score": "-1"
        },
        {
            "review_text": "You play as a person on roller skates, tagging up a super stylised and cell-shaded Tokyo, running away from police officers with guns and helicpoters, while listening to an amazing soundtrack. Whats not to like?",
            "review_score": "1"
        },
        {
            "review_text": "I'm not going to lie, when I first got this game I HATED the controls. I thought they weren't precise, I thought the jumping was terrible, and alot of other stuff to the point of writing a bad review about it. But now I have figured out that I was doing it all wrong. And now that I've mastered the controls, I 100% LOVE this game and finally see what the whole fuss was about. Before, I use to think people who enjoyed this game were 'nostalgia babies' and to that I apologize greatly too everyone who likes this game on how hard I was now that I've completed the game.",
            "review_score": "1"
        },
        {
            "review_text": "why wont it let me like save the game? am i stupid or something? lol like i go to save and game settings and idk if it does anything",
            "review_score": "1"
        },
        {
            "review_text": "If you wanted 90's, you found it!  This game is rad.",
            "review_score": "1"
        },
        {
            "review_text": "This game leaves me speechless.  But its really good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Cool artsy graphics, great music, and cool story. The only thing is on some lower resolutions you can't see your keys that are binded and the game does't save.",
            "review_score": "1"
        },
        {
            "review_text": "would be better if ♥♥♥♥ing autosave worked",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much.... BUT on the pc version there is a really BAD bug where you cannot save... Also the controls aren't too great ethier, atleast for a keyboard.",
            "review_score": "-1"
        },
        {
            "review_text": "Alright. This Dreamcast classic is a bit on the touchy side for me. All Dreamcast titles had their issues, but the gameplay is so hard to control. If you go a certain speed, you are NOT going to make that rail. If you go too fast, you're going to FLY PAST that rail. Time to compare to its sequel, Jet Set Radio Future. JSRF does not have that freaking timer that the first one has, which allows you a lot more time to get to explore each level. It also causes a lot less stress, so you're less prone to screw up whatever stunts you're trying to accomplish. The music is nice, but the variety is a lot better on JSRF as are the level designs. Truly, the nostalgia and beauty of the game is very nice. The story isn't all that shabby, and it IS fun to an extent. I do recommend it since it is cheap, but don't be too surprised about how much the controls suck.",
            "review_score": "1"
        },
        {
            "review_text": "great game and its addictive. sound track can also help. old but still a top game",
            "review_score": "1"
        },
        {
            "review_text": "This is the kind of game you buy to hint to devs that 'I want the next game in the series, nobody actually wanted this. Im a greedy ♥♥♥ consumer and ill never be satisfied regardless of what you do, devs are all just placed on a scale of how dissapointed I am in them' 10/10 would buy this for the next game in the series.",
            "review_score": "1"
        },
        {
            "review_text": "First playthrough is very fun, but short. It has an amazing soundtrack and an interesting visual style. Don't go into this game looking for more than a very average skating game, though. It has a story that makes absolutely no sense, the control takes some getting used to, and many enemy attacks cannot be avoided. It lacks replayability aswell, unless you enjoy tedious tasks in a very small amount of areas. It is just a port of a Dreamcast game, too. The textures aren't updated at all, the draw distance is terrible (rather, the game only loads a small chunk of an entire level at a time, causing pop in for other chunks), and the camera is still garbage. It adds nothing new but a couple of new graffiti souls to spray and a movie you could just watch on youtube. For all of these complaints, it's still surprisingly fun and engaging. Get it if it's on sale, it's an okay game but nothing amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game, but it doesn't save, so I am going to leave it with a not recommended score until that is fixed UPDATE: After using a hex editor, I was able to get the game to read my saves. This fixes it, but why must I manually edit the exe file???",
            "review_score": "1"
        },
        {
            "review_text": "Let's face it... all the dreamcast games made by sega were awesome...",
            "review_score": "1"
        },
        {
            "review_text": "Oldschool. Amazing. Times when games were made with heart.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, Good graphics (For the time it was made, I know people sayings it worse than COD o_0) Superb music! Awesome character designs and graffiti. This game is just simply perfect.",
            "review_score": "1"
        },
        {
            "review_text": "this game is the jam play it for a long time and you will lone it to death",
            "review_score": "1"
        },
        {
            "review_text": "This game is forever.",
            "review_score": "1"
        },
        {
            "review_text": "A classic game I've been desperate to play for years. The sparkly diamond in a vast dreamcast rough. Thank you steam for making this possible at the sheer bargain of £3! The single best £3 spent in my life. As arguably the pioneer of cel-shaded games, it's easy on the eyes and hands to play - though not keyboard friendly, essential to own a USB controller. I actually contacted Nintendo some time ago to make this possible on 3DS, but they ruled it out. I hope that the sequel (JS future) becomes available now, and if it does, I'll snap somebody's (anybody's) hand off as I never got the chance to play it.   A satisfying, nostalgic experience. Only now in my maturity can I appreciate the underpinning metaphors throughout the game. I would implore anybody and everybody to buy this game. My only complaint is that it's a rather short and narrow game story-wise, though it has plenty of post-game playability.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, Good graphics (For the time it was made, I know people sayings it worse than COD o_0) Superb music! Awesome character designs and graffiti. This game is just simply perfect.",
            "review_score": "1"
        },
        {
            "review_text": "JET SET RADIOOOOOOOOOOOOO!!!!!! Amazing songs, cool gameplay.... But it teaches a giant lesson  GRAFITTI IS WRONG, SO GRAFITTI THE WHOLE CITY",
            "review_score": "1"
        },
        {
            "review_text": "this is good game. play it. get ur xbox controller too, dont b a lazy person and dont get 1 like me. play the game already u noob",
            "review_score": "1"
        },
        {
            "review_text": "This is not summer camp! The Latch Brothers are through playing games with you. ",
            "review_score": "1"
        },
        {
            "review_text": "The best game that came out on the Sega Dreamcast.   Has an awesome soundtrack, fun gameplay and graphics. Holds up to modern games still. Get It!  Be warned some people have to change the hex code of the exe to save, there are guides to follow on the community hub, it's easy and worth it.  Now if they just did an hd version of JSRF that would be SICK!!",
            "review_score": "1"
        },
        {
            "review_text": "would play this game everyday but too lazy to touch it.",
            "review_score": "1"
        },
        {
            "review_text": "this ♥♥♥♥ rocks",
            "review_score": "1"
        },
        {
            "review_text": "Another classic Dreamcast game. Another classic SEGA game, for that matter.  If you expect this to be at all similar to Tony Hawk's Pro Skater... then you're sorely mistaken.  'Mr. Osaki asks, 'how do I get rid of these nasty roaches,' easy, just burn your house down!' -DJ Professor K, in-game soundtrack DJ and story narrator.  Being a release from well over a decade and a half ago (2000), you can't expect much in the graphics department, but even then, they're nothing to scoff at. The combination of bright, colorful artwork, cel shaded models, and heavily atmospheric level design makes it a quite remarkable display.  Whereas most games provide a flagship visual style, Jet Set Radio goes one step further and banks heavily off of the amazing soundtrack, featuring incredible remixes, and Hideki Naganuma's excellent tracks.  The plot is perhaps too short to explain in a review without spoiling the game, but I'd recommend watching the trailers to get a sound idea of what the gameplay will be like.  Just a few things to point out before you buy,  -The game speed is tied to 30FPS. Any attempt to run the game at 60FPS will result in the game running at 200% speed.  -A controller is absolutely necessary. If you don't have a 360 controller, use a PS3 controller with Better DS3 Tool.  -The camera can be a bit wonky at times. Use the left trigger to straighten it out.  -Jet Set Radio Future, SEGA's 2002 XBox exclusive is worth buying an old XBox for. Seriously. Check that out if you enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "It probably looked great during it's debut, and it's tightened up a bit for the the PC release, this game is almost too simple, and some of it's stages, particuarly against other gangs, pretty frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "If its for the nostalgia, i say wait for one of the steam sales. The controls are not horrible, but they can get pretty frustating when you are trying to ace that trick on the last second. Also, for a revised game, they could have at least touched up the graphics a bit more...",
            "review_score": "-1"
        },
        {
            "review_text": "allright sega, that was fun and a great trip through memory lane...... but now do jet set radio future!",
            "review_score": "1"
        },
        {
            "review_text": "Best Soundtrack, Best Challenge and Simple Controls. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "the best XD",
            "review_score": "1"
        },
        {
            "review_text": "  PROS: - The music just turrrns me on.  For real though, this game's soundtrack is outstanding. The perfect background for skating around and defacing public property.  -Sweet graphics. The cel-shading makes it hold up incredibly well.  -Can I just talk about the music more? It's catchy and upbeat, if not a bit cheezy. Seriously, I'd buy this game for the soundtrack alone  -The gameplay formula is engaging. Grab paint cans, spray everything in your path, and run away from the cops as they get increasingly more batshit insane. (THESE KIDS ARE SPRAY PAINTING WALLS? BETTER SEND IN THE HELICOPTERS)  CONS: -THE CONTROLS. They do not hold up very well at all. Jumping requires you to be extremely percise and feels clunky. Once you get some speed going from tricks it takes off, but the rest of the time it feels like you're walking through molasses. They do take a lot of time to get used to. This is the biggest issue I have with this game, which is a shame, since everything else about it is brilliant.  -Though the art style is great, the textures themselves are a bit lacking. It's most noticeable with some characters faces (looking at you, Officer Onishima). Considering this was a Dreamcast game, I'll give it a pass.  -Took some tinkering to get it to work on Windows 10  I would wait for a sale unless you're 100% sure you're going to love this game. There's a lot to love about JSR, but the controls really ruin what would otherwise be a near perfect game. (That being said, it's still very enjoyable!)  3.5/5 ",
            "review_score": "1"
        },
        {
            "review_text": "Great ♥♥♥♥ing music. 12/10",
            "review_score": "1"
        },
        {
            "review_text": "An absolute classic. The game has definitely aged some but very much worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "  One of the earliest instances of a cel-shaded game (even before WindWaker). And much like Windwaker, the graphics still hold up very well today. The soundtrack is probably the biggest draw here but the gameplay is pretty solid too. There isn't that much of a story but it's the type of game you can play without really thinking about.",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as you remember it when you first played it on the Dreamcast 15 years ago, but for a few bucks it's still worth the pickup, especially if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Classic arcade gameplay with fun art style and sweet music.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game, and I'd still be playing it on the dreamcast if I hadn't lost the disc. It's not the most active game, but there's something intensely satisfying about mapping a perfect route and executing it with a simple series of button taps and joystick pushes. I imagine serious fighting game players must feel the same way. The graphics are clean and stylish, and the the music is classic.  And man, does that shot of Shibuya make me nostalgic.",
            "review_score": "1"
        },
        {
            "review_text": "This was my childhood, now after years I can play again and I see why I loved this game. The OST, perfect with the game theme, the characters are so diferent for everyone's taste, the difficulty is the needed for casuals and perfectionist, the levels are awesome and the gameplay is smooth, completely recommended &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I needed to write a review for some ♥♥♥♥ but this is pretty much gotyay anyway so there.",
            "review_score": "1"
        },
        {
            "review_text": "An older favorite, I remember playing this on Xbox when it first came out. I loved it, and the music is unfortunately very catchy, haha. Very fun, competitive, I was very excited when it became available on PC.",
            "review_score": "1"
        },
        {
            "review_text": "If its for the nostalgia, i say wait for one of the steam sales. The controls are not horrible, but they can get pretty frustating when you are trying to ace that trick on the last second. Also, for a revised game, they could have at least touched up the graphics a bit more...",
            "review_score": "-1"
        },
        {
            "review_text": "Very good controls, remakes was better for PC than what I expected, a great story line, a lot to collect, A lot of fun and just an all round great game with amazing music. I think you should all try it out.",
            "review_score": "1"
        },
        {
            "review_text": "'No, you were supposed to jump onto the other grind rail, not into the sodding ocean!!' ...Occasionally frustrating physics aside, JSR is an absolute blast. I'd never played it on the Dreamcast (Never owned one ;_;) so I'm glad I bought it on Steam. The gameplay is fun and makes you feel like a badass when you get it right, but even more importantly, the visual style and the music are outstanding. I'd heard Hideki Naganuma's music in Sonic Rush before and loved it, but now I love the guy even more. Not to mention the game is only £3. I'd pay at least 2 or 3 times that amount for it.",
            "review_score": "1"
        },
        {
            "review_text": "Jet Set Radio is one of those games that has something for everybody. If the gameplay doesn't hook you in, the music and art styles will!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Gameplay = Check. Cel-Shaded Graphics = Check. INSANE Soundtrack = Check. Tight Controls (with controller capability) = Check. Memorable Level Design = Check. Customizable Graffiti = Check.  I love this game and so glad they made a HD version, all this game is missing is its sequel brother JSRF !",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoyed playing THPS when you were young, I'd recommend you to play Jet Set Radio. Although it doesn't truly allow you to do combinations for different moves/tricks, it provides great enjoyment with the graffities you can make throughout the map, and how you decide to make them. Not only that, but the music is far greater than THPS', so if you like to listen to some non-stop hardcore music, tune in and play some ♥♥♥♥♥♥♥ JET SET RADIOOO!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥n' awesome game. Mostly for nostalgia, but even if you've never played it, it's still worth it. It's a very faithful port; it even includes a few extra songs that were only in the European and/or Japanese version. Sort of barebones PC settings, but it's fine (set resolution, MSAA and custom keyboard controls, though it's best-played with a gamepad).",
            "review_score": "1"
        },
        {
            "review_text": "If you liked this game back then, i suggest you to pick it up because its the same. The same colorful design, the same awesome music, the same gameplay even the same bad camera. The new menus that they integrated are a little bit dull though. A decent port from a great game, nothing else.",
            "review_score": "1"
        },
        {
            "review_text": "Great music, great style, pure classic.",
            "review_score": "1"
        },
        {
            "review_text": "This Sega Dreamcast classic has easily the best port over of the Dreamcast games that were brought onto PC and modern consoles. The visuals were overhauled to allow for higher resolution and smoother animation, but does so without deteriorating the core gameplay that makes this a game that not only was one of the best games on the Dreamcast, but is one of the most culturally powerful games ever made. The graphics and music of this game are still as enjoyable today as they were in 2000. Only complaint is they didnt fix the slightly janky camera of this game that it has had from the Dreamcast days as well, but its easy to overlook when you get into it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent PC port, absolutely better than the Dreamcast version.   Soundtrack is still awesome even though two songs were removed for the HD version.  Doesn't seem to have framerate issues that the 360/PS3 HD versions have and the controls are perfect with a 360 controller.  Almost makes me forgive Sega for shutting down the Streets of Rage Remake fan project.  Still waiting on ports of Shenmue and Power Stone 2.",
            "review_score": "1"
        },
        {
            "review_text": "I love it but it would frustrate some. The controls feel a bit clunky, and I can't even imagine what the keyboard controls are like. Probably only go for this if you have fond memories of the original on Dreamcast.",
            "review_score": "1"
        },
        {
            "review_text": "DISCLAIMER: I play this game with an xbox controller, NOT with a keyboard. This review assumes you have a gamepad/controller to play with. Keyboard control is not exactly ideal for this game. Now then:  Jet set radio is a good, good game. Let's run down the checklist:     Challenging yet fun arcade gameplay:  Check. Skate around, do tricks, tag graffiti, chase, and be chased. Every mission has you racing the clock for a high score and looking snazzy doing it.     Stylin' visuals:  Check. The cel-shaded graphics get their point across.     Great music:  Triple-check! Shout-out to Hideki Naganuma for composing like a boss.     Story:  Sorry, I can't hear you over the attack helicopters that are here for some reason     Mechanics:  Check. Solidly well put-together. This game makes the act of simply  moving around  feel fun as heck.     Mechanics, really:  Sorry, I can't hear you over the sound of my jumps on these FRIGGIN' HALF PIPES DANGIT I NEARLY GOT THAT ITEM THAT TIME     Unlockables and achievements:  Check. This is where much of the replayability comes in. I normally don't care at all for this kind of thing, but nevertheless I'm having a blast progressing to 100% completion. Do prepare to be frustrated at times, though. Training montage not included.     Characters:  Check. There are many playable characters, and they're all hippin' cool. Except for Slate. I think he looks like a squidward/muppet hybrid, but hey, that's just me.     Understanding of the Concept of Love:  Merely a... bonus unlockable? DARN IT, WHERE'S JET SET RADIO FUTURE WHEN YOU NEED IT?     Rail-Grindability:  Checkaroo.     Spunky, funky DJ narrator:  Check set  RADIOOOOOOO!      Sequel:  Sadly, JSRF is not on Steam. Just the original Xbox copies. Sega Pls.    Overall Rating:  ThisgameisfantasticanditmakesmewantJSRFforsteamtoo/10   Recommendation:  This game is worth the $5 price tag. Heck, the style it packs alone is priceless. If you like arcade-style games, you'd be missing out if you didn't play this classic.",
            "review_score": "1"
        },
        {
            "review_text": "Jet set radio Is amazing lml it reminds of my childhood",
            "review_score": "1"
        },
        {
            "review_text": "i loved this game on the dreamcast and i'm so happy to have it back now!",
            "review_score": "1"
        },
        {
            "review_text": "This game is forever.",
            "review_score": "1"
        },
        {
            "review_text": "Clunky controls, awful camera, and inferior soundtrack. Sega should have ported JSRF instead. This game feels like a alpha build of JSRF",
            "review_score": "-1"
        },
        {
            "review_text": "Find the fix for the save issue, game actually works and its fun.",
            "review_score": "1"
        },
        {
            "review_text": "A Sega classic that you have to play, but only if you have a Xbox controller, otherwise will be really unconfortable to play with keyboard and mouse, since its a Crappy port, but still is one of the best Sega games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Jet set RADIOOO!  was made by sega near the end of the dreamcast era  has lots of good vibes awesome hip hop muisic and  COLORS!  9/10 get youre good vibes goin with jet set radio",
            "review_score": "1"
        },
        {
            "review_text": "Pretty amazing remake. I still have my Dreamcast and my original Jet Grind Radio disc so I was a little slow to pick this up. It's as crisp as you'd expect, though not as difficult thanks to cam control, steadier angles, and better controls. We still regard our scores on the DC at a higher esteem here because we never saw those parts of JGR as flaws so much as challenges, but this is fun and gorgeous. I really wish Sega would release more Dreamcast titles on Steam now, even if they were just basic ports. How about an Ecco Defender of the Future remake? Ready 2 Rumble? Power Stone? Anyone remember Bangai-O?",
            "review_score": "1"
        },
        {
            "review_text": "God this game just has 'Your kinda game' written all over it for me, from the soundtrack, to the theme, to the cellshading! its just so good i just can't play this anymore because the sequel is much better and not on steam for reason!",
            "review_score": "1"
        },
        {
            "review_text": "We need a Jet Set Radio Future HD port from the masters SEGA and smilebate (if they are still around :3)",
            "review_score": "1"
        },
        {
            "review_text": "10/10 soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those classic games that is hard to put down untill you finish it. Jet Set Radio came out in the late 90's. It is a great piece of gameing history that like Mario, it changed gameing history and made it what it was today. So do yourself a favor,buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Epic classic! Still as amazing today as when it first was released for Dreamcast. Fun and creative game play, unique style and one of the best soundtracks ever.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fundamentally broken on Steam. You have to hex edit the .exe to be able to load saved games. This kind of basic broken functionality is unacceptable, and I'm not about to give a positive review to something that's so unable to be played out of the box.  Other than that, this port is decent, running at 1080p with an Xbox 360 controller without any fiddling (it did crash at the end of a level once without saving). FPS is locked at 30, a bit of a shame since the game looks so good. It's a good game with a ton of style and a great soundtrack.  I always found parts of this game difficult. I never got the full hang of landing certain grinds, and the easiest/fastest way to deal with enemies seems to be letting them shoot you while brute forcing your way through a tag. I wish the maps would show the full level instead of just the area you're in too, it can be hard to find a missed tag if it's not in the same area you're in. I like JSRF better but this is worth playing and the price is right.",
            "review_score": "-1"
        },
        {
            "review_text": "Really cool game  7,5/10",
            "review_score": "1"
        },
        {
            "review_text": "There are so many things I love about Jet Set Radio. The presentation is phenominal, with the music being one of my favorite soundtracks in any game EVER, the graphics look styalized and somehow still don't look dated to this day. The game is great in it's simplicity and underlying complexity. However, the controls can be a pain. There'll be times where you just don't gain enough momentum and are halted as you struggle to grind a rail, or you'll over steer and fly right off the level. The camera can be bothersome, but not as bad as some other early 3D games of the time. Near the end of the game, it really did become frustrating, as there were enemies a-plenty with no means of defeating them. Despite all this, I still think that there's plenty of fun to be had. This is an exellent game. JSRF next sega? Please?    PLEASE",
            "review_score": "1"
        },
        {
            "review_text": "jet set radio is amazing and it is in steam finally and i love this game back in the day on the saga dreamcast that i play with my fiends and now its here in steam i am loving it",
            "review_score": "1"
        },
        {
            "review_text": "As a first timer to this franchise, this game is a TON of fun. Just finished beating the Story mode. The Story is great, the game looks nice and runs on probably anything. While I don't plan on 100% the game (just because I typically don't do that and it seems REALLY hard), I looked it up and there are plenty more characters to unlock after you get all of the ones in the main game, so if you go after that it'll keep you going a WHILE. Fantastic soundtrack. This game is one of the most unique games ever and is worth MORE than it's current $5 price tag.  Buy it.  And it's soundtrack.  Seriously.",
            "review_score": "1"
        },
        {
            "review_text": "Rollerblades + the coolest hip hop since Michael Jackson = awesome",
            "review_score": "1"
        },
        {
            "review_text": "Anyone that tells you this game is objectively perfect is driven by pure nostalgia fuel. Everyone everywhere talks about this game's good features, so here are the game flaws:  - No song choice option in levels (yes, to me this is important). - Clunky controls. - Exit routes on all levels, some located in the way of graffitis or moving cars, meaning you can leave stages accidentaly. - Weird sense of momentum. - The default center camera button is the same graffiti button, leading to some confusing gameplay. - No objective way to compare stats between characters. - No reset option on menu (you have to leave the level, then go in again). - Trick cutscenes that interrupt the game flow in complicated jumps - Once you get yo play in the big maps (3 maps connectd), the game becomes confusing and it gets easy to get lost.  It's not so bad if you can look over these things, but I personally don't enjoy it enough to bother getting all 100%. If you want a real skating game, go play Tony Hawk Pro Skater 3.",
            "review_score": "-1"
        },
        {
            "review_text": "Game has a short story, but it has amazing gameplay, art style, and a dank soundtrack. Have JSRF ported to PC would be great, but Sega doesn't care so whatever.",
            "review_score": "1"
        },
        {
            "review_text": "4/10 its not JSRF ",
            "review_score": "1"
        },
        {
            "review_text": "I used to own this on the Sega Dreamcast. It was my favorite game back then, after sitting down and playing it again I can say the greatness still holds up. It's a very different experience than most of the games that have been coming out lately or really anything I've played at all.   The game's center mechanic is graffiti spraying, you spray walls, statues, billboards and even people to solidify your gang's territory all while rollerblading and grinding through the streets on your magnetic rollerblades. Not to mention this game has easily one of the best soundtracks of any games I've ever played.   All in all JSR is a different genuine experience that I think everyone should at least give a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Though the controls are a bit to get used to, this blast from the past is definitely worth a few playthroughs (especially at only $5). Plus, it got me into skating again. 8.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "It was a well-made port from the Dreamcast to PC, but unfortunately it wasn't well made to be played with traditional PC controls, which make you resort to using a controller (which I totally recommend, unless you wanna spend a long time trying to figure out how to decently play with your keyboard and mouse... an xbox controller works just perfect for this game)  Despite this little problem with the controllers, it's still a fun experience even for those who didn't live the Dreamcast era",
            "review_score": "1"
        },
        {
            "review_text": "  This game is now on my favorite games list. I enjoyed everything about this game, from the characters to the music, to the action, even when I was playing this with a Genesis controler, this is now #3 on my list of favorite games......SEGA, please put Jet Set Radio Future soon",
            "review_score": "1"
        },
        {
            "review_text": "one of my favorite games to date. really brings back my childhood. still just as amazing as it always has been, but if you dont have a controller set up; playing on your keyboard is going to be annoying.",
            "review_score": "1"
        },
        {
            "review_text": "this game is very fun when will we get jet set radio future i want to buy it now lol",
            "review_score": "1"
        },
        {
            "review_text": "PLS MAKE JET SET RAIO FUTURE, PLEASE, WE ALL WANT IT, IT WAS THE BEST!  also i love this game, loved it on console but it is impossible to play with keyboard, I recomend a controller",
            "review_score": "1"
        },
        {
            "review_text": "  JSR is a very good game, with the soundtrack being its biggest advantage. Can be frustrating sometimes, though.",
            "review_score": "1"
        },
        {
            "review_text": "  I've been playing this game for a while now, and, though I haven't finished it, I feel I've been playing long enough to speak my mind, because this game has a lot of things I think will be of interest to the potential buyer.  First off- unless you're a masochist, get yourself a controller for this. I rarely, if ever, play any game ever with anything less than a mouse and keyboard, but for this one it's absolutely essential.  This game has character. Ever watched a strange anime on adult swim or online at two AM, half asleep? This is the best way I can describe it. The characters are nice, the world is interesting, the textures, while they show their age in the form of pixels on static, animated faces, do their job well enough. The controls are on and off for me. I've seen gameplay of people handling their chosen character very well and acing levels, as for me I've been having a lot of trouble coming to grips with so much as maintaining a chain of grinds or getting my character to jump exactly where I want them to- something that in free play or graffiti missions doesn't make much of a difference, but in something like a race is crucial, and this game loves to make you race other characters to try and see who can tag a certain area first. One missed jump or failed grind, and it's over, and unlike the trick competitions, this game doesn't have the courtesy of failing you outright- you've got to wait until your opponent sprays his tag, either by futiley trailing a country mile behind him, or having your character standby and do a little jig while you have a fit in the corner and try to compose yourself for the twentieth go at it- after you've skipped the cutscenes, which you can do unless you quit the game, return to the garage (which acts as a sort of hub for choosing your level and character, among other things) or otherwise have to leave in the middle of one of them. When whichever is the real problem here- the game, or my thumbs- works, it works like a damn dream, and it's a fine little piece of entertainment here for eight bucks- it looks nice if a touch dated, it runs great (as well it should, given how old it is), and everything going on it keeps you guessing, for better or worse. Just when you think they've gotten predictable with riot police and parachute troops on your tail, they bring out missile firing helicopters and tanks to try and waste you, and grinding down the road, tagging the wall up and jumping onto a rail for an added boost, all this stuff combined makes this game great and a joy to play and replay despite it's age and my lack of mastery of it. Now, from what I hear, they made a sequel a while back, and if it improved on all these things or at least kept in the spirit of the original game, I'd love to have a crack at it, or better yet, another sequel. Until then, I hear there's a spiritual successor in the works by one of the people who used to work on the series named Hover: Revolt of Gamers. Might be worth a shot, who knows?",
            "review_score": "1"
        },
        {
            "review_text": "Best Soundtrack, Best Challenge and Simple Controls. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Dude this is awesome. I have bought this game 3 times up to now and damn, it has to be one of the most underrated SEGA Dreamcast games ( when compared to the likes of Sanic Advanturr 2 at least )",
            "review_score": "1"
        },
        {
            "review_text": "In what other game can you grind down a fire escape and spray paint in a cop's face?",
            "review_score": "1"
        },
        {
            "review_text": "A fun futue punk skating game,I played it heavily on the dreamcast. This was one of its better titles, really enjoyable for all ages with little discretion advised. ",
            "review_score": "1"
        },
        {
            "review_text": "It's so amazing. I used to play this game on my Dremcast when I was a child and this was one of my favorite games. This is very exciting game, though is quite difficult. Many thanks to Sega for this release.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 I love this sega classic. It's the only kind of game that plays Funky Fresh musi- WOULD YOU STOP PLAYIN' WITH THAT RADIO LORD? IM TRYNA' GET TO SLEEP!!",
            "review_score": "1"
        },
        {
            "review_text": "This games a true classic and is worth every cent. ,visual good lookin shaded graphic It has aged like fine wine aesthetically, graphically its the same thing from 2000 but with more resolution options. gameplay is simple yet great !",
            "review_score": "1"
        },
        {
            "review_text": "Jet Crush with a Jet ranking is just an early taste of death.",
            "review_score": "1"
        },
        {
            "review_text": "A classic with a God-like OST.  It brings childhood memories of my friends and I trying to see who could beat this game first on the original Xbox. With a fantastic port and an HD graphical update make this game a must get.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Who are you? What's yo name? Supa brudda!",
            "review_score": "1"
        },
        {
            "review_text": "A fairly good challenging game that still holds up decently. With good variety of things to do outside of story mode.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Music and Gameplay for a game of the 2000s, A unique idea for a game where using grafiti to make your domain as big as you can. The single player is a blast and the soundtrack is great too.  I recommend to play this game with a gamepad or Xbox360/PS3/XBONE/PS4 controller for better combos with the paintings",
            "review_score": "1"
        },
        {
            "review_text": "Really hard to do the spraycan maneuvers on a keyboard. if I had an analog gamepad this would be a lot more playable. Still a lot of fun tho.",
            "review_score": "1"
        },
        {
            "review_text": "Story 5/10* : You are a teen that wants to stick it to the cops while listening to music, painting graffiti and riding on your futuristic blades. Music 9/10*: One of the strong points of this game has to be the music, one of the best soundtracks i've ever heard. Gameplay 7/10* : If you're wondering if you should play this game with a keyboad or a gamepad i'd suggest the gamepad seing as how the game was ported from a console, it makes things easier. Art 7/10* : What can i say im just a sucker for the whole thing  (Would still chose this game over overwatch) P.S. WHERE IS JSRF???",
            "review_score": "1"
        },
        {
            "review_text": "  A must-have for any game lover. A classic that innovated many game types.",
            "review_score": "1"
        },
        {
            "review_text": "Really entertaining game! Lots of missions and time trials in 5 big levels to play but the movement is really hard to master so it requires practise.",
            "review_score": "1"
        },
        {
            "review_text": "Great old game with his bugs and gameplay flaws but incredibly fun. Definitely a dreamcast gem, still waiting for an other game of the licence since Jet Set Radio Future on Xbox.",
            "review_score": "1"
        },
        {
            "review_text": "A one-of-a-kind game where the main point against it is exactly how good it is at what it sets out to do.   'Clunky controls' gets thrown around a lot to describe maneuvering in this game, but it bears in mind that this is a game (partially) about riding around on inline skates. The game is really, really good at making you control like a person riding on inline skates. Momentum plays a key role in your ability to maintain traction and smoothly get from point A to point B, so a loss of that momentum can be like hitting a brick wall. While sometimes jarring, it's sort of an extension of the premise and ultimately, you merely have to be extra mindful of your surroundings--an exercise made much easier by the inclusion of camera controls to the second analog stick.   I'd highly recommend this for being a game that doesn't have anything much like it before or since (besides the sequel), but be warned that it can get punishing. This is a short game that emphasizes trial and error to lengthen play, like old 'Nintendo hard' titles back in the 8-bit era. Racing missions, though sparse, get especially brutal. But an arcadey, play-it-in-bursts format makes that the perfect direction for it to take.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Faithful to the original Dreamcast release down to the pixel, throw in some high resolutions and anti-aliasing and you have one slick looking game. TAKE NOTE: The game only supports changing the resolution, vsync and anti aliasing level up to 8x. Also, the game NEVER exceeds 30fps, has a lock that cannot be removed. But really, it never hurts the experience. I didn't go into this expecting to look at a can on the ground and find it indistinguishable from the can in my hand.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, just do yourself a favor and play it with a controller.",
            "review_score": "1"
        },
        {
            "review_text": "Jet Set Radio Future was a top game for original Xbox and the cell-shaded graphics could hardly get any better. Unqiue music packed with unique game-play. The control scheme might be a little difficult to grasp at first but if you remember rockin' out on Tony Hawks Pro Skater or Matt Hoffman's BMX... be sure to take on this fantasy spin on roller-blades.  Take on Tokyo's underground radio and shake those spray cans.. J.S.R. is guaranteed to put you in a good mood with it's bright colour scheme.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite soundtracks of all time, mixed in with a fun game makes for a great time. Now, if only they'll release JSRF on here...",
            "review_score": "1"
        }
    ]
}