{
    "app_id": 205990,
    "name": "Warlock 2: The Exiled",
    "release_date": "2014-04-10",
    "developer": [
        "Ino-Co Plus"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Fantasy",
        "Turn-Based"
    ],
    "achievements": 74,
    "positive_ratings": 558,
    "negative_ratings": 288,
    "price": 14.99,
    "description": "Warlock 2 is a turn-based strategy game of fantasy warfare. Rival against Great Mages, lead mighty armies into fierce battles, wield ancient magic and faith as your weapons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/205990/header.jpg?t=1545355704",
    "minimum_requirements": "OS: Windows Vista 64-bit, Windows 7 64-bit Processor: Dual Core CPU  with 2,66GHz clock speed or higher Memory: 4 GB RAM Graphics: nVidia GeForce 8600 GT or ATI Radeon HD 6570 DirectX: Version 9.0c Storage: 2 GB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": "OS: Windows Vista 64-bit, Windows 7 64-bit or Windows 8 64-bit Processor: Intel I3-3240 @ 3.4 GHz or AMD Phenom II X4 955 @ 3.2 GHz Memory: 4 GB RAM Graphics: nVidia GeForce 550 Ti or ATI Radeon HD 6850 Storage: 2 GB available space Sound Card: DirectX 9.0c compatible",
    "reviews": [
        {
            "review_text": "I bought Warlock 2 during the Summer Sale, and I've quite easily gotten my money's worth. It is a lot of fun, though not without serious flaws. My review is based on three (partial) plays of 'The Exiled' story mode, and one full playthrough in 'Battle for the Outplanes' mode.  A big complaint a lot of people have is that it seems like a content update, rather than a sequel to Warlock. This is true to an extent. However, the handling of the planes was the biggest flaw of Warlock 1 but seems to be the central appeal of Warlock 2. In Warlock 1, there were other planes, and they were full of big bad monsters, but they weren't very interesting and the rewards for going there weren't significant enough to bother with them. A game of Warlock 2, on the other hand, has a hierarchy of planes, where you (and your A.I. opponent mages) start on less threatening planes, and you work your way down through to planes with significantly more dangerous fauna (and sometimes flora), or back up the hierarchy to fight the other great mages. Each plane has its own unique flavor, and most special resources only occur in one or two types of plane. The special resource thing is key... most races don't have strong research-producing buildings, so you need to chase after the research-producing resources, which tend to be a couple planes down from where you start. The first time I reached a Shadow Plane, and established a fortress there to defend myself against the horrible shadowy horrors that awaited me, it felt ... well... I would say 'epic', but that word is way overused these days. But it was awesome.  I was also impressed with how much the game made me care about terrain, and provided a multitude of terraforming spells that I actually want to use. The ability to throw up a mountain where I want a defensive chokepoint, or to raise up a landbridge when I want to cross an ocean is quite empowering.  The big flaws of the game, are that the AI is quite poor (and the game is pretty easy in general), and that the game gets tedious once you have a big empire.   Planar portals provide your primary military chokepoints in the game. The A.I. takes advantage to this to an extent, in that it's smart enough to build fortifications on its side of a portal. However, it's really bad at launching offenses through portals. If you stay perpetually at war with an A.I., it will continually send a trickle of one or two units at a time through the portal to be slaughtered on the other side. The only threat the A.I. can pose, is if you let it build up during peacetime, and send a large number of units through at a time. If you let this happen, A.I. units will pop up in funny places as they exit at the nearest unoccupied hex on your side of the portal.  The late-game tedium arises mostly from troop movements. Moving troops across your empire takes an awfully long time when you're spread out across several planes. I don't trust the pathfinding of the game to do it for me, as it often works rather poorly (though this is somewhat understandible technical hurdle, given the many movement modes of units, as well as all of the terraforming). One thing about the game alleviates some of the late-game tedium though. You are limited in the number of normal cities you can have at once (starting at five, and increasing with research). But you can also have an unlimited number of special cities, which are less beneficial than a normal city, but require no management. Managing cities doesn't become a slog, because you typically only have 5-10 of them that ever need any attention.  The story mode ('The Exiled') is cool the first time, but is essentially the same each time you play.  My plays thus far:  1. Exiled Mode, average difficulty, small multiverse, two opponents. I was friendly with the other great mages and focused on the storyline. I had a lot of fun exploring the game for the first time, but ultimately got bored while fighting through the penultimate plane (which is full of tough monsters, but is way too big and unvaried to hold my interest) and quit.  2-3. Exiled mode, hard diffuculty, small and medium multiverses, max opponents. Did some conquering of great mages and had fun conquering my first few planes, but ultimately got bored.  4. Battle for the Outplanes mode, impossible difficulty, small multiverse, two opponents. I played this one all the way through . I had quite a bit of fun with it, but was overall very dissapointed with just how easy I could conquer the 'Impossible AI' opponents.  I'm off to try Sandbox mode next. I'm hoping the A.I. will handle it a bit better.",
            "review_score": "1"
        },
        {
            "review_text": "So far this game seems entertaining. But it appears to be just a slight bit of an updated version of Warlock I. Way to grab our money Devs... That being said if you liked Warlock I you will like this too.",
            "review_score": "1"
        },
        {
            "review_text": "**If you enjoy Civ V or the HOMM series then this game is a bargain bin must buy!**  The world map and battle system play like Civilization V except you have hero units and spells you can cast to assist your units, towns, and even morph your landscape. The hero leveling system takes a large part of its functionality from the original Heros of Might and Magic series (Pre V and VI) were you get a random roll of abilities, these abilities then stack and you get unique heros. This game isn't for everyone its quite slow paced and the mulitplayer is a completely different beast from the single player. Meaning multiplayer is more intense but still turned based it takes anywere from 1-6 hours to complete on average for me. Over all the further you get into this game the more you will come to appreciate the depth of the game as i have read in other review and as i will put in mine the more enjoyable the game becomes! Oh and i almost forgot the game has a sort of quest generation system that seems to be random at points similar to FTL and other story games quest for things like resources, artifacts, and even spells. Hope you enjoy",
            "review_score": "1"
        },
        {
            "review_text": "Just like the original: This is a really fun 4X game that feels a bit like the Heroes of Might and Magic games with exploring of different planes, dungeons and worlds, as well as magic and spells being thrown around and researched. Instead of nukes and missiles you got fireballs and world changing spells/events.   But it have more of mostly everything.",
            "review_score": "1"
        },
        {
            "review_text": "A well done 4x game. The unit talent trees and fun theme are what set this title apart from other good 4x games.",
            "review_score": "1"
        },
        {
            "review_text": "I have played a bit so far and I have to say Warlock II is really entertaining! I like the quick pase combat as compared to the long tactical battles. The spell count is great, lots of good spells to make use of in the game. Another great feature is the random map generator, it is a must have in these kinds of games. The graphics are perfect for the setting. There seems to be a great variety of units with their own unique qualities. You can customize your wizard with a variety of different perks to help during the game. Units and heroes level up and gain perks. One of the most important factors about the game is that it will be moddable! I haven't had the chance to play Warlock Master of the Arcane but I would definitely recommend Warlock II! Great stuff 9/10!",
            "review_score": "1"
        },
        {
            "review_text": "An excellent turn based 4x Fantasy Strategy game that keeps you up late at night.",
            "review_score": "1"
        },
        {
            "review_text": "I found this game quite addicting despite being almost the copy of  Warlock - Master of the Arcane . Some new nice features added and overall a bit more polished.  Be ware that the game apparently doesn't work on Linux/Mac!",
            "review_score": "1"
        },
        {
            "review_text": "I liked the Warlock 1 and this game is a worthy continuation. It improves balance; makes game play more complex, and with all DLCs gives a lot of interesting game modes.  I recommend it as a best contender for modern remake of Master of Magic, without flaws of the original. The elegant design beats my other favourites - Endless Legend, while preserving magic-centred mechanics that makes it interesting each time I play.  Let's hope that Warlock 3 will have even more interesting quests, and improved AI, even though current AI is already challenging to beat on even footing.",
            "review_score": "1"
        },
        {
            "review_text": "Even the game is still on development, it is worth to purchase... The game does not beat the CIV V and DLCs, but it is uniquely more challenging than the CIV V. This is of course because the game is made more challenging than the Warlock: Master of Arcane. 20 euros for early access wasn't too much for me, and I enjoyed for the Master of Arcane. However, development team has not fixed the 'permanent' fortify for the units: Player still have to move all the units before the round ends, and this deeply sucks since when the game has been played for a middle of game, there might exists more than 20 units that have to be moved at each round..I hope that development team takes a look at this one, and adds finally the 'permanent' fortify, so that the player does not have to select and move all the units at each round... ;-) ",
            "review_score": "1"
        },
        {
            "review_text": "As everyone says, it feels like an expansion to the first game, though it's a lot harder(at least the Exile mode). Still fun and an improvement. I hope that you have hours to sink into gaming if you get this. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I haven't had any of the bugs other reviews mentioned. The UI seems fine to me. Supposedly the developers are unhelpful but I've never had any reason to need them. Good support for mods. It's not perfect, mind you, but then it's not $60 either. It's very fun once you get the right mindset; this isn't a vast Civ-type game, it's much smaller scale. You have 5-10 cities, ~5 powerful units that you fawn over, and ~5 supporting units at any given time. It's almost closer to a party-based RPG.  Note: I have not played Warlock 1.",
            "review_score": "1"
        },
        {
            "review_text": "Essentially a re-release of the first game but with a weird campaign added. A campaign I dont particularly like. If you havent played the first, get it you will love it. If you have... this is essentially an expansion pack being sold as a full game, if you have the money to spare then sure otherwise not worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Needs more updates that also addresses problems with in game crashes and Ai.",
            "review_score": "1"
        },
        {
            "review_text": "At full price Warlock 2 isn't enough of an upgrade over the first one, to warrant getting. Pick it up on sale if you like 1 this will be like an expansion.  You can see they did make some improvements in the AI, in previous version the AI would just spam low level units, here the AI uses a wider range of units, you will still be playing the same difficulty you were in the previous version.  Can be modded, a plus.  A built in tech tree making it easier to see where you are and how to get the units you want.  They added unrest and a soft cap on city limits, can be a pain when conquering towns, if you have too many towns you can convert them to free towns, so they dont hurt but you get so small bonus. any buildings you had in the town you convert disappear.   I like the game just feels like an expansion,",
            "review_score": "1"
        },
        {
            "review_text": "I never played the original Warlock, so I can't make the comparison that many reviewers are making. As someone new to the franchise, I enjoyed this quite a bit. If you're in to 4X games, then this might be for you, though it doesn't come close to being the new Master of Magic that I've been longing for for 20 years.  I see that the monster spawn rate is adjustable now, which is great. That was one of the things that bugged me at launch. The only other drawback I can think of is that the game feels a bit slow at times. If you think games like Civilization 5 are slow, then this is sloooooow. (I love Civ 5 btw)  Anyway, all in all it's a thumbs up for me. Especially if you get it at a discount.",
            "review_score": "1"
        },
        {
            "review_text": "Just play it. Grand strategy in clown shoes (that's a good thing). Constantly mocks itself, very disk-worldish.",
            "review_score": "1"
        },
        {
            "review_text": "Well It's Warlock 1 with some changes, it has more bugs and some really game-breaking bugs (mostly for people who plays on Mac and Linux versions).  If you didn't play Warlock 1 then your missing a great 4X fantasy game (with one of the greatness DLCs I have ever seen, *wink* Dremers *wink*) and it's worth playing if you enjoy Civ 5 but you want something more then history. Warlock 2 seems to be in the middle when people talk about it as It's a great game but has massive flaws, I recommend you to grab the first game over this however if you like the first game alot (and you're not using a Mac or Linux) then you should grab this as well. If you're not sure then just wait for the sale, It's a great 4X game but it doesn't compare to the first game. Also the DLCs are mostly just extra (besides the Naga one), there is a great mod on the workshop called Renaissance Mod what needs the DLCs (this mod adds alot to the game and fixes couple of stuff).",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the best turn-based strategy game since Civ IV. Really jumps to the core mechanics of 4X without bogging you down in empire micro-management or spending too much energy trying to tell a half-♥♥♥♥♥ fantasy epic. This is game design, not fan service.",
            "review_score": "1"
        },
        {
            "review_text": "Do you fondly remember Age of Wonders: Shadow Magic? This is like that but better!",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Really love the empire building and fantasy units.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Similar to Civ, though city improvements go on surrounding tiles. Plenty of magic, and there's more of a mission for the endgame than in Civ. I miss roads, though.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is alot different than the first game. Your armies are smaller, less towns, lower economy, less upgrades available for all units to use. Overall it has made the game more streamlined and faster paced which is good for multiplayer. Previous game you would have to wait a very long time for players to make their turns because of how huge everything got. Overall I would say this is well improved in the edition for online player vs player gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Warlock II: The Exiled is the kind of game that I should have written a review for a while ago, but because of the size of the game, and the VERY slow pace the game takes, I am now finally able to write up a review. First off this is a fantasy turn based adventure game where you are going to play the part of a powerful warlock who saved all the realms, but in his absence from the main realm became exiled. You will now have to gather troops, heroes, knowledge, and more if you are going to be able to retake what is rightfully your's. There will be many portals you will have to transverse, but if you can make it out to the other side you might just find your chance to exact your revenge.   Graphically this game is not going to blow you away, but at the same time it looks well done. I do like the concept that every realm is a floating island, and that there is a wide variety of lands that you will have to deal with. You might be dealing with snowy lands, deserts, lava, cursed lands, and water. You never know what the next world will bring. There's also a very wide variety of enemies to face off against, you will get the chance to battle sea serpents, minotaurs, elementals, dragons, bats, and more. The one thing that I wish had a little bit more TLC to it was the city screens. I understand that there was definitely a minimal approach to it, but it doesn't feel as polished.  The music does a great job of blending into the game to the point that you don't really notice it after a while.  The controls are pretty straight forward, you are going to be using the mouse almost exclusively, with the exception of WASD when you are playing on dual monitors. If you don't you will notice that you are constantly clicking out of the game when trying to scroll across the map.  Even though there is a story to follow, most of the game is randomly generated and is customized to the experience you want to have. You can choose the size of the land masses, the number of warlocks you will have to deal with, and of course the difficulty. Now I will say this, no matter what you are going to have to deal with micro-managing of resources until you can't take it any more. This game hinges on the fact that it plods along slowly so if there were issues you wouldn't see them. There's also a large amount of randomly generated neutral enemies that will pop back up after a while to keep you on your toes in areas that you have removed all your troops from. Speaking of troops, it is damn near impossible to be able to successfully sustain more than a handful of troops. The cost of gold, food, and mana per turn for each unit, hero, building, it will drive you made. There were only a very few times in the game where I was actually gaining on all 3 and that was when I didn't do anything on those turns. The one thing that did completely drive me up the wall was the fact that you have a limited amount of towns that you are allowed to have, and out of those you can only change the ones that you personally settled to specialty towns to help with your micro-managing and decrease your town count. Here's the problem, I'm a conquerer, I never built a second town, I've capture all the cities I've found, and yet I get penalized for it.  At the end of the day the thing about this game that you are going to NEED to have is the editor. This is probably one of the best and most in-depth editors I've seen in a long time. You can build an entire game out of it utilizing Warlock II as a backbone. If you are willing to put in the time you can EASILY make something light years better than what comes out of the box. So with that I have to give a grade on the game, as is, and not what the game can potentially have with user contributions. This game gets a 6.5 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "never played the first warlock game. I'm liking this one very much though. If you like 4x games, you should definitely get it. especially with it costing 30 bucks.  that adventure trailer.... lol  'I'm A.D. Ventureman, Adventure man; and I'm on a hunt for adventure again...'  I would honestly hope someone, someday will make a funny rap song with it....",
            "review_score": "1"
        },
        {
            "review_text": "An excellent modern version of Masters of Magic (MoM). :-)",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. I love strategy games and this is so reminiscent of Civ without being an exact copy that it makes for a whole new experience. It may not be all that different from the first, but the differences it has are fun and worthwhile. The mod builder included in the game is itself worth hours of fun, not to mention the time spent playing the scenarios that you or others have built. The DLCs add plenty more to play around with as well. Well worth the time and money in my eyes.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, love the voice acting, a light hearted mp event where you can put on the coffee get in teamspeak with some friends and chat and play to have fun and win if you really care too! I have seldomly seen a game with very well thought out hero perks (some of them hilarious) and the heroes = a paladin with no pants - priceless! A couple of bugs here and there but that's minor. Continuing to hope for some mp action with 3+ friends on a consistent basis, look me up let's play! Lots of different play modes to choose from, high replayability, steam mods, create your own leader, a very fun, pleasant game experience, this game led me to buy the warlock games of the past, they deserve my business. I pickup copies for friends from time to time on the 75% off sales to share this gem, it's too good not to have in your gaming repitoire if you like fantasy turn based games.",
            "review_score": "1"
        },
        {
            "review_text": "Great continuation of the first game. The workshop is fun to play around with, however some of the mods are very overpowered. If you are a fan of the Traditional 4X games this one is for you. The only complaint I have with this game would be the slow turn progression later in the game.",
            "review_score": "1"
        },
        {
            "review_text": "I bought both Warlock games at the same time, and played them both in order. The first is a really decent game, I'd say 8/10, but this second game isn't as good. Both are basically glorified Civ5 mods with some better features thrown in, though - which isn't necessarily a bad thing, but if you didn't like Civ5, you probably won't enjoy this.  The reason I like the first game better is the first game is much cleaner. The UI really takes a hit in this second game, especially in the city interface. They went from simple icons of food-money-specialized military buildings to individual icons that you can't tell what they are most of the time. The main screen UI is much smaller and hard to read, and even the diplomacy window is muddier. UI is also pretty buggy, tooltips getting stuck etc.  There's some good features added, a clearer 'tech' tree for your spellls, more of a campaign, and the new races are pretty cool, but now that the maps are a series of shards, it's pretty easy to control the choke points and just keep pushing forward - no real challenge of full open world combat or watch-your-back element (worth noting that there are other options of map to play on). Combat is much faster now, which is good except that it's almost too fast - you can't tell sometimes that an NPC has declared war on you, there's no notifications like in the first game, so you constantly have to check in the diplomacy screen for the tiny war icon.  Good: - clearer spell tree - new races - kept most of the old elements without breaking too much - something of a story/campaign mode now - more modding available - movement costs and build bonuses now able to view  Bad: - UI very small and doesn't give as much information, notification system is much worse, can't choose from a list - doesn't center on the unit properly when starting unit turns - tool tips are buggy, get stuck during mouseover - Less notifications, can't tell if war is declared - much less challenging than the first  I recommend it, I mean it's still better than a lot of TBS games out there, but it's definitely not as good as the first.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "Warlock 2 is decent enough but for the asking price, it's too small an upgrade over the original. Another beef that I have with the game is that you spend FAR more time fighting against the endlessly spawning 'wandering monsters' than you ever do against your fellow wizards and that brings an absurd amount of randomization into the overall strategy of the game. The endless spawning also tends to make things drag on in the end-game, long outlasting its welcome.  On the plus side, the game has a fine sense of humor and the visuals and audio are a treat (although it seems that much of the music was recycled from Warlock 1 as well).",
            "review_score": "-1"
        },
        {
            "review_text": "I was really looking forward to Warlock 2, but the game quickly became repetitive and tedious. As much as I enjoy building an army of monsters, dragons, warriors, and the like, the game pacing, ridiculous number of randomized monsters, mediocre diplomacy. and uninspired spellbook really squanders this game's awesome potential as a great 4X fantasy game. I guess I'll have to wait and see if Endless Legend succeeds where Warlock 2 clearly fails.",
            "review_score": "-1"
        },
        {
            "review_text": "TL;DR Don’t get this game get Warlock: Master of the Arcane. It’s the same and better.  I do not recommend this game, because I believe the previous game in the series, Warlock: Master of the Arcane is more fun. Even though this game tries to improve on the previous edition with more races, more features, and even some better systems, it also creates other problems that overshadow the improvements. Being less fun would be ok if this game was different from the original... it's not. Alot of the art and models are literally the same, the gameplay is almost identically, even entire tech trees for races remain the same. This game feels like a bunch of mods/dlc added to the old game instead of a new game. So since its not different and is worse, just get Warlock: Master of the Arcane.  First, what the game got right, because credit where credit is due: Spell research is much improved over the previous edition. You pick and plan your spell research instead of being given 5 random options to pick from.  Monster lair spawn rate can be adjusted to be less annoying in the late game, or you can have more of it if that's what your into.  Some of the additional races, spells, perks, and resources add some complexity and are interesting.  Temples allow you to gain reputation with specific gods, even in early/mid game.  Now the bad: Too many strong neutral monsters are found everywhere. You're early game, the most crucial part of any run, depends almost entirely on whether you can find city locations away from strong mobs. Too make maters worse, sometimes monsters wander, so it's even more random whether you are going to get crushed. Worst of all, because the Player AI is not great, the neutral mobs end up being a more of a challange than your computer opponents, even on higher difficulties! I want to fight other Players not the environment! While this is somewhat true of W:MotA, its much worse in W:tE.  The unrest mechanic adds nothing. One new feature is that unrest can build in your cities which if it gets to 100 unrest overall leads to bad things. What bad things? I'm not sure, and neither is anyone else. Sometimes mobs spawn, sometimes growth is affected, sometimes... nothing. After looking online and trying to figure out how exactly it works, it seems to be pretty universally ignored mechanic. The only way to stiffle unrest is by slowing expansion and its simply not worth it. I've now completely ignored unrest for 3 games and have been no worse off for it.  Exiled mode is tedious. Like Armageddon mode in the previous version, now there is alternate mode that has different objectives to the normal game mode. But all you do is slug your way across many different 'worlds' until you get to the final set of uber bosses. Once you have an economy going there is almost no chance of failure because you never get attacked, you just have to wait to build very powerful units to take on the bad guys. Its slow and requires almost no strategy.  The game help and info system sucks and there is too much complexity. With 20 something resources, which each may or may not have a unique application for each of the 7 different races, you find yourself having to constantly look at the tech tree. There is too much. If it all added something to the game, then maybe it would be worth it but often times you find that different units, with different upgrades, and different perks, do the exact same thing and are just as strong.   In conclusion, this game only adds minor improvements to the original while also adding many more unneeded features that just make it worse.",
            "review_score": "-1"
        },
        {
            "review_text": "There is nothing I can say about this game other than it suffers from a very bad case of 'the mediocres'. Bland story, bland mechanics, bland gameplay. When I first played the 'original' Warlock, I kind of enjoyed it and gave it a decent review. I cannot do that for this one. If you want to play an excellent game, try Masters of Magic. That is the game Warlock is attempting to emulate here. It isn't succeeding, but it's trying. I don't hate or think this game is the worst thing I have ever played, I just...well, like I said, think it is MEDIOCRE.",
            "review_score": "-1"
        },
        {
            "review_text": "Warlock 2 has randomly generated levels. It's done poorly.  Playing through the tutorial level, my randomly generated world had terrain that was impassable. Not impossible -- I just had to research Tier 3 spells of a particular path and then teach a settler to fly, so that I could follow the tutorial and expand. The game would give quests I simply couldn't do half the time because I was choked for resources due to lack of expansion options. Then enemy AI from an unknown location woke up and started pelting me with land-destroying spells, which just extended the time until I could teach my units to fly. Tier 3, as it turns out, takes a really long time to get to, and the gameplay in this period was horrible: set my units to defend, set a new research target (no research or construction queues), then skip turn after turn while my research progressed. I quit before getting to the spell that would let me get off my starting location. I imagine that the correct response is to restart the game and get a better shaped world. I'll play a different game instead.  (The narrator Sean Connery soundalike is awful.)",
            "review_score": "-1"
        },
        {
            "review_text": "I've tried several times to get into this. Sadly I just don't think its going to happen. The main reason being that although looking and feeling a lot like Civ V is generally a good thing, the emphasis on the combat side of things just isn't. Its always been the most tedious aspect of Civ for me and not where its charms lie. So you're left with war(lock)mongering to victory against a bunch of randomly spawning mobs and if i'm going to do that, then i'd just rather play Civ which is just a much deeper game.   It doesn't help that there doesn't seem to be much community around the game either. r/warlock is just dead.   Still if Civ style hex-based combat is your thing or you just really wanted Civilization : Fantasy Tropes edition, then you might well enjoy it a lot more. Me not so much.",
            "review_score": "-1"
        },
        {
            "review_text": "DO NOT BUY THIS GAME FOR LINUX  This game is really good (graphism, design, art, mood...) and I loved playing it on Windows, but it currently has a bug that makes it COMPLETELY UNPLAYABLE ON LINUX: ending a quest doesn't grant the reward and instead reboots the quest, and quests are the base mecanism for progressing in the game.  The devs stopped supporting the game and Paradox keeps selling it with the Linux tag. This is unacceptable.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ AI, spamming cities is basically free and there's absolutely no reason not to (you can just turn the cities to specialized cities later if needed). Exile mode is the big thing compared to Warlock 1, but it's just all about getting 3-4 heroes and maybe some high tier units, and buffing them with everything. The Exile mode maps are tiny, and the map generator sucks big time. There seems to be no way to actually lose in Exile mode either.  On the positive side, patches/mods may fix this. I do regret buying this right now, 30 euros (!) is way too much for Warlock 2 in it's current state.",
            "review_score": "-1"
        },
        {
            "review_text": "Warning: you do not get all the DLC's when you purchase the Great Mage edition. The in-game items mentioned on the steam page are included. There is now one line saying '*This game contains in-game purchases.' hidden after the features list implying you can purchase these items later. Only after purchasing can you see the in-game store page that includes more DLC's that will cost you just as much as the Great Mage edition upgrade.  So, on top of being only a minor upgrade from warlock 1, there are now cheesy hidden microtransactions. I want to support the company but come on...",
            "review_score": "-1"
        },
        {
            "review_text": "Nice try Paradox. I've enjoyed a lot of your other works, but this feels empty and repetitive. Next time I won't be so quick to buy.",
            "review_score": "-1"
        },
        {
            "review_text": "from paradox interactive 2/10 would kill myself made by the geniuses behind europa universalis 4 and victoria 2 comes the ♥♥♥♥♥♥ flash game civilization 5 clone made by a 2 foot tall bearded neckbeard with autism. ♥♥♥♥ you",
            "review_score": "-1"
        },
        {
            "review_text": "So i finally did it, I bought this game on sale despite all the mixed reviews.   And it feels like I am playing a copy of Warlock 1. Except the graphics/art is worse to look at.   I really, really, really got what I deserved.",
            "review_score": "-1"
        },
        {
            "review_text": "I remember how I was having fun with the first Warlock, so I can't believe how unplayable this game is. It constantly crashes (after around 20-30 turns, and I do them really fast), have bad UI and the graphics are terribly unreadable, it's hard to tell apart different map hexes. The questing system is a little disaster, doesn't bring anything fun to the game, just bugs you with something like 'kill that newly spawned unit' or 'build a specific building', it's really a waste of potential.  It's more like a bad expansion or a Warlock 1.5, don't be fooled by the number two at the end of the title. I bought it for less than 6 euros, and I am now really regretting this decision.",
            "review_score": "-1"
        },
        {
            "review_text": "If u're on linux, this game is buggy as hell. Some quests make the game crash and, since when you continue the game has you accepting some main quest as soon as you restart, the game crashes over and over. Wait until bugs have been worked out.",
            "review_score": "-1"
        },
        {
            "review_text": "This game builds on the original's flaws rather than strengths. While it introduces a few new things, it's not enough to change my feelings towards it, and it also runs significantly worse than the first for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Buy the first game. Its far better than this turd they squirted out.  The first was fun for hours and hours, this was dreary and horific.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, if you've played the first the full way through there is very little difference. I tried to get into it but just felt it was the same long winded trap as before. Not that I dont appreciate or like these games, but I find XXXX games a little hard to play when its got the same formula going from the 90s",
            "review_score": "-1"
        },
        {
            "review_text": "I like the simple gameplay. It's almost like playing Civilization... ...except that it is buggy. I've had my game crash on almost every occasion I played it. The game was supposed to autosave after each turn, but when I tried to continue from where it crashed, it took me back to an earlier game that I saved. It just wasted my time.  I'm sorry, but this game is not worth the money I paid for it. :(  ",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage. Crashes on loading save games.",
            "review_score": "-1"
        },
        {
            "review_text": "I expected mor for 15 euros. It is basically a worse Civilization game with Fantasy elements.",
            "review_score": "-1"
        },
        {
            "review_text": "Glitchy as hell system doesnt work well. After a while if you dont finish quickly you end up dieing in base and on the front because the system is broke.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fun strategy game with colorful races to choose from but it crashes often in Linux and there still are some bugs. If you are not a Linux user, feel free to buy the game as it is pretty fun.  If you are a Linux user and made the mistake of buying the game, use the beta version instead of the regular download. Just right click on the game, click Properties. Betas, osx_linux_beta. The beta fixes a lot of the most eggregious problems, still crashes from time to time but not as often.",
            "review_score": "-1"
        }
    ]
}