{
    "app_id": 206370,
    "name": "Tales From Space: Mutant Blobs Attack",
    "release_date": "2012-08-15",
    "developer": [
        "DrinkBox Studios"
    ],
    "publisher": [
        "DrinkBox Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Platformer",
        "Action"
    ],
    "achievements": 14,
    "positive_ratings": 544,
    "negative_ratings": 57,
    "price": 7.19,
    "description": "A sci-fi puzzle-platformer of cataclysmic proportions! You’re an ill-tempered blob that grows in size by swallowing everything in its path. Evolve from a tiny captive into a world-eating giant. Use your mutant blob powers to devour the pathetic humans and all of civilization!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/206370/header.jpg?t=1553890895",
    "minimum_requirements": "OS:Windows XP, Vista, Win7 Processor:2Ghz+ Memory:512 MB RAM Graphics:&gt;= 256 MB, Shader Model 3.0 or better DirectX®:9.0c Hard Drive:300 MB HD space Additional:Supports XInput-compatible controllers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A cute, simple platformer that's enjoyable for all ages. You are a blob who eats what is smaller than you. As you eat you grow meaning that you eventually can eat just about everything you see. The levels are well designed and the art style, music and sounds all work perfectly for a fun experience. Expect a bit of a challenge if you plan to get all gold and unlock all achievements, but you won't pull your hair out. The gameplay is simple, and slowly new additions to the gameplay are unveiled as you progress in the forgetful but entertaining storyline. You will learn how to wall jump, how to use your telekinesis powers to move levers and slide platforms, and how to use magnets that attract and push you away.  Nothing hugely groundbreaking at all, but there's nothing wrong with taking a known to work recipe and splashing with a fresh coat of paint for you to enjoy. Definitely recommend, especially if you are playing with kids.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let other reviews fool you,&nbsp; Tales from Space: When Mutant Blobs Attacks  bears only a superficial resemblance to  Katamari Damacy . Whereas the later could be described as the ultimate chill game full of wacky Japanese humor, this is more of a traditional puzzle-platformer based around using your weird mutant blob powers to avoid ever-present death. 'Eating' is only present as a way to bypass roadblocks in your&nbsp;quest to get from point A to point B.  First of all, check the amount of time I've spent into this game and divide that by two: that's a good estimate on the amount of time&nbsp;you'll invest. I'm a completionist who spent way too much effort&nbsp;trying to complete some of the more frustrating jumps,&nbsp;hence why it's over five hours. Check with&nbsp;other reviewers if you don't believe me:&nbsp; Tales from Space: When Mutant Blobs&nbsp;Attacks  is quite short, undoubtedly the shortest game for me to complete in my library. Compounding&nbsp;this problem is how little there is for you to do: apart from the&nbsp;jumping around and a dive move, you only have  three  gameplay mechanics. Shoulder buttons control the Magnetize and the Telekinesis powers, and on certain stages you gain rocket powers.&nbsp;The game is imaginative enough in finding enough challenges for these abilities but compared to other products&nbsp;from  Lunchbox Games  (and particularly&nbsp; Guacamelee ), this seems incredibly limited.  Enjoyment of the actual product is a mixed bag. On one hand, I  really  want to congratulate the person in charge of the physics engine. From the&nbsp;soft physics of your mutant blob to the inertia produced by your rocket travels to the orbiting of magnetic bodies,&nbsp;everything  feels  great. If there's a failing, it'd be in the actual platforming. 97% of the time it works fine (if not a bit floaty); it's that last 3%, the jumps required for some of the hidden blob&nbsp;friends that are simply ♥♥♥♥♥♥♥t. It's so frustrating looking over the solution online, know what you have to do, then fail repeatedly because the theory doesn't follow practice. I'm not going to downvote a game for a couple of ♥♥♥♥♥♥♥t jumps but it needs to be said that some platforming depends on ridiculous&nbsp;edge-of-platform running jumps that simply don't work, or a&nbsp;'magnetized-bouncy-super-high-jump' technique... Yeah, this review doesn't&nbsp;make it easy for the prospective&nbsp;buyer to understand so let's just leave it at '♥♥♥♥♥♥♥t jumps'.  This game is both easier and more frustrating than  Guacamelee . Those who've played&nbsp;the lucha libre Metroidvania will get to&nbsp;reexperience the furious shoulder button pressing extravaganza&nbsp;needed&nbsp;to bypass treacherous areas&nbsp;all over again.&nbsp;Puzzle-wise you have your blob use its telekinesis powers to move platforms around, the solution to which shouldn't take more than a few minutes to discover.&nbsp;There's very little replay value because the game offers so very little in the first place:&nbsp; Tales from Space: When Mutant Blobs Attacks &nbsp;has the least amount of Achievements in my library and&nbsp;only offers a leaderboard in terms of additional content.  I never paid any monies for this product, having won it off the Steam winter auction at a little over 1000 gems. I'd say&nbsp;its value comes more as an interesting physics engine for a blobby protagonist than as a puzzle-platformer anyways.&nbsp;Don't pay more than five dollars for it and you shouldn't regret anything. It's not  bad  or anything, just unsatisfying. You could say that it still left me hungry.",
            "review_score": "1"
        },
        {
            "review_text": "+Excellent level design +Awesome music +Tons of games references +You can eat people!  -Too short -Too easy -Clunky controls(PS Vita port)",
            "review_score": "1"
        },
        {
            "review_text": "If Katamari and World of Goo had a kid it would look like Mutant Blobs Attack. The story is pretty short and not too challenging. The gameplay is fun and the humor is great!",
            "review_score": "1"
        },
        {
            "review_text": "The story of  Tales From Space: Mutant Blobs Attack  is pretty simple: You play as a blob breaking out of a blob torture research center and getting his revenge. On his way to do so the blob automatically absorbs everything that is smaller than him and so he is getting larger and larger and is able to absorb even more.  Over the course of the game you gain new abilities like smashing, telekinesis, magnetism and sometimes you can even fly around. Combined with the six different themed world stages and the never stopping growth of your blob the game never gets to repetitive besides it simple basic gameplay idea. The puzzles in the game are fairly easy what I did not really mind. The platformer part on the other hand is a bit tougher mainly for one reason. Besides the blob being a blob, and therefore precise movement can be a bit tricky, the controls are unusual. I have read some complains about them, because the game contains parts where you have to use the mouse. People playing the game solely on keyboard or gamepad have to shift over what can be annoying (Edit: This has been changed since the initial released and the game is playable with gamepad only by now). Personally I played the game one hand on the keyboard and the other one on the mouse. This combinations works pretty well. And even if you die you will start by one of the nearby checkpoints. Normally you should pass each passage with less than five times dying except you are trying to get the gold medals or you are collecting your blob friends. Those unusual controls are a left over from the porting because the game was made initially for the PS Vita. Another leftover are the mini-levels which are a lot easier in the PC version but still fun. The graphic is cartoon-like and colourful and fits the theme of the game. The music is nothing special. It does not really stand out but it does not annoy you as well. The game took me eight hours for completion of all achievements and replaying some of the levels for getting better times in the leaderboards. And for that the price tag is really fair.  All in all  Tales From Space: Mutant Blobs Attack  is a really, really fun and colourful game if you can forgive some sometimes clunky controls and you do not mind the repetitiveness of the basic gameplay idea. Obliteration of mankind can be so enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice casual platformer!   It's more old-school, collect-a-ton, like Super Mario, rather than the more modern precision platformers like Super Meat Boy. So, even if you don't really like how tough most platformers are, this one you can certainly enjoy.  I've never played Katamari Damacy, but the idea is clearly similar. More recently, perhaps Agar.io. Also, Gish! The physics were absolutely nailed, as the character you control really feels like a blob. Very fun to just play around, trying to collect everything.  The level variety is fairly high, with different sections, some timed, some more puzzle oriented (although there is very light puzzling only), etc. The levels are replete with references to other games through alien-related puns.  The graphic style reminds me a lot of old cartoons, and the music fits the silly, old sci-fi vibe very well too.    If you're into leaderboard climbing, each level counts pretty much everything you do, from collectibles to time spent to count your score, so that may be up your alley. I'm not sure how much better the levels would seem with a 100% speedrun mindset, but many of the orbs' arrangements do seem to have an optimal path. So yeah, if mastering physics is your thing, I'd doubly recommend this!    A very fun diversion, if nothing else! If you enjoy more casual platformers, give it a go. It's fairly short, though, as I've finished (with about 90-95% of the collectibles and medals, etc.?) in 3.7 hours.",
            "review_score": "1"
        },
        {
            "review_text": "A cool and addictive Katamari-like game.  Not too easy but not too hard,either. It has a nice sense of humour too, I love it!",
            "review_score": "1"
        },
        {
            "review_text": "Revenge is a dish best served cold and gelatinous which is why it's so satisfying to roll over everything that has mistreated the titular mutant blob, growing with each new acquisition like a sentient snowball. Conquering an area is followed by a little newscast vignette, showing those yet to be consumed in increasing stages of panic. Tales from Space: Mutant Blobs Attack creates the feeling of playing an old horror movie complete with dust-cracked edges (just like the CRTV you'd have to watch it on). The bonus levels delve further into this 'blast from the past' aesthetic by mimicking older game experiences. The change of play style that the bonus levels offer is also a welcome change of pace from the series of similar set pieces positioned around the very basic goal of growing larger and moving to the right.  The game has a keyboard and mouse control scheme that is more than functional, but clearly it was designed around a console as a controller offers greater precision. Oddly enough, there is still one mechanic that the mouse served better for which makes the ability to switch between the two control schemes on a whim an absolute boon. The point system is similarly flexible as it presents an incentive to be meticulous and thus makes things more difficult without punishing players that choose to take an easier way out. The 'beat my high score' mentality this creates gives the short game some much needed replayability.",
            "review_score": "1"
        },
        {
            "review_text": "A really great game with fluid gameplay and great art-style. Especially the little cutscenes and the references to other games on billboards made me giggle quite a few times. I bought it on a Steam Sale, without great expectations and i was blown away by this little game.  If you like 2D-Platformers with unique gameplay-mechanics and great visuals, you should give it a try. Hey, it´s just a few bucks on Sale, go get it!",
            "review_score": "1"
        },
        {
            "review_text": "There's only about 3 hours of content here, but it's nonstop fun. Imagine a mixture of Katamari Damaci, Gish, and Strange Attractors.  You play a blob that grows by eating things, and as you grow you can eat larger things. The levels are closed and linear, and it is played as a side-scroller. Best played on a gamepad. Gameplay is fairly easy.  Controls are smooth and responsive. There are no unskippable cutscenes, rail sequences, or slow character animations to take you out of the action.  Any replay value comes from the online leaderboards.",
            "review_score": "1"
        },
        {
            "review_text": "Tales from Space: Mutant Blobs Attack is a side-scrolling puzzle platformer about a mutant blob that can consume anything that is smaller than itself, yet grows every time it consumes something. I think you know where this is headed...   For starters, Mutant Blobs Attack is very well designed. The art style is truly awesome, a cartoony world in a 1950's horror movie setting, most likely with a wink to Steve McQueen's (hilarious) The Blob. Combined with small cutscenes in a similar style, this side of the game is genuinely funny. The soundtrack is catchy and fits well with the chosen aesthetics.   The level design is excellent, its never too hard to figure out where to go next. With 24 levels in 6 zones the game provides plenty of variation, with an enjoyable mini game in each of these zones. The puzzles are no brain teasers but do provide a nice shift from otherwise continuous platforming. The gameplay in general is fairly straightforward, but every level has another approach or gimmick that took away every sense of repetitiveness.   While in general Mutant Blobs Attack is not very challenging, once you go for the gold medals and finding every secret there's a whole new level of difficulty for those seeking a challenge. The checkpoint system is rather brilliant, avoiding that even the harder parts of the game become frustrating. The controls are decent, with the exception to wall-jumping, which is a little dodgy.   Concluding, Mutant Blobs Attack is a truly funny game that excels to great heights if/when you also decide to challenge yourself. It's not perfect, but its definitely one of the best platformers I've ever played. And for its price, you really should not ignore it.   + Hilarious visual presentation + Fitting soundtrack + Challenging if you let it be + Smart checkpoint system + Never becomes too repetitive   - Dodgy walljumping mechanics - A wee bit on the short side   8.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "A really fun game that's drawn beautifully.",
            "review_score": "1"
        },
        {
            "review_text": "A casual platformer with puzzles here and there. A very addicting game.  Mr. 2 Bon Kurei approves this game",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. There were a few parts that felt impossible at first, but the game is generous with checkpoints, and I don't think I had to attempt anything more than about 10 times before succeeding. It's a lot of fun, with some challenging puzzles, funny cut-scenes and a nice look. Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Ehhh, its just ehh.  Not much gameplay, it feels like a $2 iPhone App :( 5/10 (for trying).",
            "review_score": "-1"
        },
        {
            "review_text": "Good, fun time waster.   Simple controls, simple plot, interesting gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little platformer that over time has you playing from a blob the size of a coin into a blob the size of planets. It isn't overly hard even when going for 100% though it remains challenging enough to keep your interest with mechanics like propelling, magnetism, flying and lasers.",
            "review_score": "1"
        },
        {
            "review_text": "delightful 2d platfomer, really works hard at letting you explore the controls and play around the enviroment. wonderful of humor and art style, the music will get stuck in your head.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game fun mechanics and tight controls make it a very fun experience.",
            "review_score": "1"
        },
        {
            "review_text": "In this game, U can destroy tanks and helicopters with ur giant butt. So easy :)  8/10!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is streamlined fun. It's simple, easy-to-play and very satisfying. It should put a smile on your face. :-)  On the other hand, VERY short.  I can see similarities in the artwork and fun factor for this game and Guacamelee (both are from same developer).",
            "review_score": "1"
        },
        {
            "review_text": "Not bad for a couple bucks. Fun and funny :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game. A bit easy (even to get gold medals), but great gameplay and a satisfying end.",
            "review_score": "1"
        },
        {
            "review_text": "★★★☆☆  Surprisingly good and full of humor ! But a bit short though.",
            "review_score": "1"
        },
        {
            "review_text": "Mix Katamari-esque 'grow when you absorb' gameplay with a revenge-focused Mutant Blob and you get Mutant Blobs Attack! Basic platforming, some small puzzle elements, collectables, and score modes. All you need in a game like this.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good game!",
            "review_score": "1"
        },
        {
            "review_text": "aHAhAH DrinkBox Studios top notch humor",
            "review_score": "1"
        },
        {
            "review_text": "Like a side scrolling Katamari Damacy. There's something inherently satisfying about just collecting stuff and getting bigger. Some interesting platforming stuff too.",
            "review_score": "1"
        },
        {
            "review_text": "Great platformer with nice mechanics.  Has a brilliant artstyle and the absorbing a lot of stuff is really satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "Some say it's not like Katamari, some say it is. Well, the concept is the same, you have to absorb random things around the levels to progress to the next, but it's a little less 'sandbox' than Katamari.   While I do like this game, I'm not a fan of the 'floating' bits. I could do without those. I've not finished it yet, but it's probably reasonable value at £5.49 or your local equivalent. Maybe stick it on your watch list though and keep an eye out for a sale if you're unsure.",
            "review_score": "1"
        },
        {
            "review_text": "Usually I do not like platform games but this game has a brilliant sense of humor. You are a Blob which starts eating small items and ends in the solar system :D I would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Nice platformer by a Toronto indie developer. Cool music, interesting mechanics, and some great humor lie within. Check it out.",
            "review_score": "1"
        },
        {
            "review_text": "This game is streamlined fun. It's simple, easy-to-play and very satisfying. It should put a smile on your face. :-)  On the other hand, VERY short.  I can see similarities in the artwork and fun factor for this game and Guacamelee (both are from same developer).",
            "review_score": "1"
        },
        {
            "review_text": "It has ♥♥♥♥♥♥, unintutive WASD-based controls that you can't change at all, it's clumsy, and it's way too easy to die in ways that are almost unavoidable.",
            "review_score": "-1"
        },
        {
            "review_text": "☣Great pick up and play physics based puzzle/platformer. I find it to be a great palate cleanser between other games because you can play through most of the levels pretty quickly.☣",
            "review_score": "1"
        }
    ]
}