{
    "app_id": 206610,
    "name": "3SwitcheD",
    "release_date": "2012-03-29",
    "developer": [
        "Reality Pump"
    ],
    "publisher": [
        "Topware Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Casual",
        "Indie"
    ],
    "tags": [
        "Casual",
        "Indie",
        "Match 3"
    ],
    "achievements": 0,
    "positive_ratings": 117,
    "negative_ratings": 196,
    "price": 6.99,
    "description": "Be careful! This Game is addictive! You won´t find more challenges, more speed, more fun and more treasures anywhere in the known Universe!3SwitcheD™ combines classical Gameplay with fascinating new technologies. Find yourself in a new World arcade gaming.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/206610/header.jpg?t=1516707652",
    "minimum_requirements": "OS:Windows XP Service Pack 3,Windows Vista/Windows 7 Processor:2.0 GHz Single-Core Processor Memory:512 MB RAM Graphics:Per Pixel Shader 2.0 128 MB Ram DirectX®:dx90 Hard Drive:300 MB HD space",
    "recommended_requirements": "OS:Windows XP Service Pack 3,Windows Vista/Windows 7 Processor:2.0 GHz Single-Core Processor Memory:512 MB RAM Graphics:Per Pixel Shader 2.0 128 MB Ram DirectX®:dx90 Hard Drive:300 MB HD space",
    "reviews": [
        {
            "review_text": "Looks like it might be a nice game. BUT:  It's saddled with some extra DRM junk that requires you to activate it on TopWare's servers. TopWare's activation server for this game are DOWN, and seem to have been that way for months.  So I'm forced to play in DEMO mode...  Avoid this and any game with extra completely useless DRM!  It forces us to pirate the game we payed for legally, just so we can play it.",
            "review_score": "-1"
        },
        {
            "review_text": "In the world of video games, if there is a hell it is filled with match three puzzle games.  Now I will preface this review saying I am not the biggest fan of match three games in the first place, but even with saying that, 3SwitcheD is not a good game.  Now I am going to go on and skip explaining what you do in a match three game and focus on what is 'new' here, there are six game modes, 'Snazzy Swap' being your standard game mode that plays like a poorly optimized version of Bejeweled with a combo clock that makes a man/woman's voice go higher and higher as you gain combos till it sounds like he/she is having a real good time from your abilities to match three (And really who wouldn't?)  Outside of the main mode all the other modes of the game... rather suck, 'Falling Stars' is somewhat alright where you start with a blank board and they drop jewels from the top for you to match like a proverbial rat in a cage, but outside of that one the rest are about matching jewels in odd ways such as making shapes or effecting gravity.  The game reports to using 'Face-Tracking Technology' which is a fancy word for saying you can turn on your webcam and look around the 3D play-field... but you will never do that because there is absolutely no reason to, the graphics, animations, and environment hold nothing special at all and look mediocre at best with poor optimization, and when you play a match three puzzle game, you are not going to be moving your head to get a better angle, this all doesn't matter anyway because none of it works... seriously, it works for like a few seconds then pops back to normal.  And finally to top it all off it has third-party DRM, you must activate the game using a CD-key on TopWare's servers, so not only is it a bad game, if the servers are down (Like they usually seem to be) you can't even play it, though maybe that is a good thing overall.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a lot of negative reviews...  and I'm supplying another one...because it is just an overpriced clone of Bejeweled.",
            "review_score": "-1"
        },
        {
            "review_text": "i hate this game!",
            "review_score": "-1"
        },
        {
            "review_text": "3Switched is basically a clone of Bejewled but it has more game modes with no explanation on how to play them. I can't figure out 3 of the 5 game modes. Also the regular match 3 has no timer which is very nice for the more casual gamer. Instead it ends when there are no moves left.   It has a combo bar that drains fast and a high score.  Pros:  +Fun and addicting +No timer (But ends with no moves left) +More variety of game modes +Fast paced  Cons: -No explanation on how to play the game modes -Very dated graphics (They look like graphics from early 2000) -Combo bar drains extremely fast  So if you like or liked Bejewled you would certaintly enjoy this game. I do because it brings back memories of when I was a child when I played a flash game version of Bejewled.",
            "review_score": "1"
        },
        {
            "review_text": "A complete pile of ♥♥♥♥. Very little content. I'm pretty sure this is actually just an email harvesting scheme with a shiny front-end... Not a joke.",
            "review_score": "-1"
        },
        {
            "review_text": "3SwitcheD is a game is a puzzle game at heart but is it a puzzle game you would want to play ? This game is bassicly Bejeweled with some really lame 3D Effects. The game is of course almost an exact copy of Bejeweled or as many of these match 3 games. It has 6 diffrent game modes which all feel sort of the same just one of them feel diffrent then the rest. The soundtrack is pretty bad its just a few sounds that replay until it gives you a head ache. Overall this game is pretty lame for the price is going dont buy it. Go buy Bejeweled instead or another match three game just skip this one i give 3SwitchedD 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game feels like a mash-up of several gimmicks at once. It has six different game modes, but they're essentially split into 3 pairs of game modes. The different game modes seem fairly similar: There's two where gems fall and you move them around a grid, there's two where you double-click on clusters of gems to clear them, and there's two where you're swapping gems normally as per Bejeweled. These pairs of similar game modes don't feel like they have any substantial differences.  To be fair, a lot of the non-Bejeweled game modes seemed at least somewhat innovative, but everything you do in the game is commentated on by a voice that sounds like he's aspiring to be Leonard Nimoy. Instead, it just comes off as abrasive and annoying. You'll hear such lovely phrases as 'Space-♥♥♥♥!,' 'The combo meter is about to blow,' and 'This party train is now leaving.' This incessant voice-over is my least favorite thing about this game, and I wasn't interested enough in the game as a whole to check whether I could turn it off. I couldn't try out the much-touted 3D feature, either, so I can't speak to that.  Honestly, the only reason I have this game is that I was given a 90% off coupon for it, and I only paid a single dollar. For one dollar, it's a half-decent puzzle game, but it does things that have been done before - and with less annoyance for the player. For ten dollars, I recommend you skip it.",
            "review_score": "-1"
        },
        {
            "review_text": "awesome game I love it",
            "review_score": "1"
        },
        {
            "review_text": "The game requires you to enter a key, but you can't even paste it, way to make your DRM extremely annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a great Bejeweled knock off. Excellent time waster.",
            "review_score": "1"
        },
        {
            "review_text": "A game that tried to copy another succesfull game and tried to use gimmicks to make it look new. I would rather stick to playing Bejeweled thank you very much.",
            "review_score": "-1"
        }
    ]
}