{
    "app_id": 207020,
    "name": "Bang Bang Racing",
    "release_date": "2012-06-08",
    "developer": [
        "Digital Reality Software & Playbox"
    ],
    "publisher": [
        "HandyGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Arcade",
        "Local Multiplayer"
    ],
    "achievements": 12,
    "positive_ratings": 317,
    "negative_ratings": 82,
    "price": 7.99,
    "description": "Be one step ahead of your competitors, finding shortcuts, repairing your car in the pit lane, and dominating your opponents from the top-down view.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/207020/header.jpg?t=1534406114",
    "minimum_requirements": "OS: x86 or x64 bit versions of Microsoft Windows XP/Vista/Win7  Processor: AMD/Intel single or dual-core processor running at 2.2GHz (Intel Pentium D or AMD Athlon 64 x2 are probably the lowest CPU architectures recommended)  Memory: 1024MB for MS Windows XP and 1536MB for MS Windows Vista/Win7  Graphics: ATI/nVidia graphic card with at least 256MB of dedicated VRAM and with at least DirectX 9.0c and Shader Model 4.0 support. ATI Radeon HD 3600 and NVIDIA Geforce 8600 are minimum required graphic cards. The game also works on the latest generation of Intel HD 3000 IGPs and AMD 6500 series IGPs.  DirectX®: 9.0c Hard Drive: 300 MB HD space Sound: Integrated or dedicated DirectX 9 compatible soundcard  Additional: Keyboard, XBOX360 Controller (optional)",
    "recommended_requirements": "Processor: AMD/Intel dual/triple/quad-core processor running at 2.6 GHz  Memory:1536MB for MS Windows XP and 2048MB for Vista/Win7  Graphics: ATI/Nvidia dedicated graphic card with at least 512MB of dedicated VRAM and with at least DirectX 9.0c and Shader Model 4.0 support. ATI Radeon HD 3800 series and NVIDIA Geforce GTX260 and above are recommended graphic cards.",
    "reviews": [
        {
            "review_text": "As a seasoned player of this game, I would recommend it as a 7/10, but it is definitely not without flaws. I'll list the pros, cons and debatable features from my experience so you can decide if you think you'll enjoy it as much as I did!  Pros - 4 Player splitscreen, a rarity on PC. I spent most of my time playing this mode. - Simple and yet brilliantly original car damage/pit stop system - Good variety of tracks with different routes - Car class system lets you pick the speed you want to race at - Plenty of unlockable car liveries - Each racing class has a car that is strongest at something different (one for handling, one top speed etc.) - 8 cars on track is refreshing as lots of arcade racers only have 4  Cons - Computer controlled cars rely on 'rubber banding' (If they drop too far behind they will go irrationally fast to catch you, but the same works in your favour if you fall behind) - Compatability issues, there is no guarantee this game will work on your system, I have encountered problems with it myself - The single player is a quite short, and once completed time trials, single races and split screen are the only other things to do - No online multiplayer, one of the game's biggest disappointments - No Steam workshop or modding facilities, creating your own liveries and tracks would extend the life of this game significantly - The price is a little over the top for me, for such an inflexible game   Other features - No Mario Kart copying pickups/powerups, one of the biggest pros of the game for me! - Shortcuts on tracks which you'll do well to remember the positions of, but other cars will frequently utilize - Time delayed explosive barrels, and oil barrels can be used for your benefit or doom",
            "review_score": "1"
        },
        {
            "review_text": "As any other Racing games. Fun Hard and Challnging. Dat's all you need on racing game :) If you like A raceing games so I guess that can be suitable to you ..  Have fun",
            "review_score": "1"
        },
        {
            "review_text": "at first it was nice, little car, simple gameplay. But when you arrive at the level 3 cars, you feel kinda frustated... repetitive track, same style of drift and not a great challenge at all (even you play the hard mode).  you can find some other better games of this 6/10.",
            "review_score": "-1"
        },
        {
            "review_text": "THERE IS NO ONLINE MULTIPLAYER",
            "review_score": "-1"
        },
        {
            "review_text": "Seriously fun racing game even if the only multiplayer is split screen.",
            "review_score": "1"
        },
        {
            "review_text": "Nice physics. Cute Graphics. Good Tracks. A lot of fun. For SuperCars Veterans I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun little Micro Machines esque racer. Everything you could want from a racing game in this style - pretty, easy to pick up, and good fun. Handles well with keyboard or controller.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, decent controls, and good for short bursts of racing. A short game but worth it if you can pick it up cheap. I beat it in about 3 hours. The tilt-shift map previews are good and the crowd in the grand stand looks like Mii characters from Nintendo. Charming and fun, for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Playschool/Rescue Heroes art meets an oddly Fast and the Furious race feel. Causal game without much depth. By it for a $1. Played for 30 minutes and thats all I would of it.",
            "review_score": "1"
        },
        {
            "review_text": "I found it quite good, the Graphics are nice, smooth and crisp. The cars handle as well as can be expected for an arcade game.  the boost as usual only seems to be good when you are not winning, and the catch up handicap is a pain, you can be half a lap ahead on the last lap, then al of a sudden, the computers are right behind you.  Bought it on the weeklong deal for £1.19, so Im happy, and at that price I would get it and not worry about the price",
            "review_score": "1"
        },
        {
            "review_text": "Nice little game, but no multiplayer so pointless :(",
            "review_score": "1"
        },
        {
            "review_text": "just a really fun simple racing game, with good graphics, and great gameplay - would def recoomend",
            "review_score": "1"
        },
        {
            "review_text": "why Half of my games dosent support controler logitech dual action WTF ?",
            "review_score": "-1"
        },
        {
            "review_text": "Bang Bang Racing is essentially Micro Machines with 95% of the game consisting of boosting out of tight corners. ",
            "review_score": "1"
        },
        {
            "review_text": "No comment is already a comment right? Lel",
            "review_score": "1"
        }
    ]
}