{
    "app_id": 207230,
    "name": "ArcheBlade™",
    "release_date": "2014-04-25",
    "developer": [
        "CodeBrush Games"
    ],
    "publisher": [
        "Codebrush Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie"
    ],
    "tags": [
        "Free to Play",
        "Anime",
        "Action"
    ],
    "achievements": 77,
    "positive_ratings": 5642,
    "negative_ratings": 2086,
    "price": 0.0,
    "description": "ArcheBlade is a free to play 3D multiplayer fighting game that captures the essence of combo-based fighting games combined with unique game modes. Play as one of many characters and master your skills to become the best fighter.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/207230/header.jpg?t=1447355405",
    "minimum_requirements": "OS:Windows XP 32bit Processor:Intel Core 2 Duo 1.86 GHz, AMD Athlon 64 X2 2GHz Memory:2 GB RAM Graphics:ATI HD3850, GTX250 DirectX®:9.0c Hard Drive:1500 MB HD space Other Requirements:Broadband Internet connection",
    "recommended_requirements": "OS:Windows 7 32/64bit Processor:Intel Core i3 3GHz, AMD Phenom II X2 3GHz Memory:4 GB RAM Graphics:ATI HD4870, GTX460 DirectX®:9.0c Hard Drive:1500 MB HD space Other Requirements:Broadband Internet connection",
    "reviews": [
        {
            "review_text": "I play the game for the plot ( ͡° ͜ʖ ͡°),",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game to play to kill time lol but archeblade would have been a nice game if codebrush haven't abandoned it",
            "review_score": "1"
        },
        {
            "review_text": "first game skeleton man kills me non stop leave game go to other game train hardcore get better with renny enters same game again skeleton man is still there, killing everyone cue the theme to jojo's bizarre adventure dramatic fighting happens manage to get the higher ground, literally preform a blazing dive kick on him kill him skeleton man leaves become god of sever get sniped by renorah",
            "review_score": "1"
        },
        {
            "review_text": "It's like a real Multiplayer Online Battle Arena! It's not Aeon of Strife which DotA and League of Legends are based off of. It is a legitimate online action brawler.  Archeblade is still very much in development, in the process of continually improving itself for an enjoyable game. The developers like to be involved with the community to help this process, whether it be for buffs and nerfs or general suggestions.  I think it's a great game with a lot of potential behind it. It's free to play, so give it a swing. Also remember, this game is STILL IN DEVELOPMENT. So if you have problems or suggestions to report, it is recommended to post in the Archeblade Community Hub for any constructive feedback and suggestions. As well as general solving of problems.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, decent game. Nice graphics. Decent enough servers from a server browser that seem to be dedicated with the only problem (so far) being random connection drops every so often. Nice choice of characters to use throughout the game; however, some characters are just too over-powered and (in my opinion) need to be 'nerfed'. A rip-off of League of Legends and/or Dota 2 (probably) however controlling one's characters from a 3rd person view it would seem.",
            "review_score": "1"
        },
        {
            "review_text": "This is essentially a 3d team based fighting game. It has most of the core mechaniocs of fighting games. ESPECIALLY stuns such as when you get hit. This is the most crucial thing ive found people to dislike about the game, as they dont realise what they are getting into. ",
            "review_score": "1"
        },
        {
            "review_text": "It's Free to Play...  You don't need to pay for anything other than what you want to buy from the Shop.  It's Free to Play...  It has 7 Women and 7 Men, 14 Total.  The match making is slow at times but the rematch system makes staying with friends easy.  Oh Yeah! It's Free to Play!",
            "review_score": "1"
        },
        {
            "review_text": "I wanna rate this game buuuuuuut. the server list does NOT cover demands well. had this game for 2 days now and at all times the Servers are full and the ones that aren't have 0[zero] people playing. Would love to enjoy this game but can't seem to get an available room at all :/",
            "review_score": "1"
        },
        {
            "review_text": "If you like some non-stop action is a pretty cool game to give a try.",
            "review_score": "1"
        },
        {
            "review_text": "You get owned and then you go jump off a cliff.... But you don't dies...",
            "review_score": "1"
        },
        {
            "review_text": "Good game but ı think limited content. Most probably it will be good for first 10 hours then it will bore you. Also don't listen to pay 2 win idiots. Alright it has some items but they dont change much and can be bought with in game currency. And why play a game to be the first, just enjoy the game.   Oyun güzel ama muhtemelen 10 saat oynadıktan sonra sizi sıkar, fazla içerik yok çünkü. Onun dışında arkadaşlarınızla oynamak için güzel bir oyun. Bir de p2w diyenlerede kulak asmayın pek, çokta birşey farkettirmiyor itemler ayrıca oyunun parasıylada alabiliyorsunuz. Hem zaten birinci olamıcaksınız muhtemelen kasmanın alemi yok alabileceğiniz zevke bakın.",
            "review_score": "1"
        },
        {
            "review_text": "can take a very long while to find a game some times but when u do it is fun to play, some ppl moan over OP chars but I would say I've only seen 1 OP char and it was only OP cos the player knew how to use it right, so it is still skill based.",
            "review_score": "1"
        },
        {
            "review_text": "Its ok not the worst I played yet needs some balancing still and hard to find some matches. When you get into one its actually kinda fun. Plus there are positives to the gameplay mainly how the characters move and attack and each have their own unique style of combat. Getting locked in an attack is annoying, yet you can learn to over come it depending on the character you use. I hope they add more to this game its rare to find a multiplayer, action, fighting game. Seriously balance the large guy he needs to have high flinch resistance and health.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say, it's been a while since a game captured my attention like this one. While it's somewhat easy to pick up, it takes a lot of time to master.  The gameplay, controls, are simple on the surface, but to really learn the ins and outs of how to actually play the game takes a lot of time and experience. So, if you are not willing to spend that time, you're going to get pummelled by those who have spent the time...  ...because the combat in this game is, for the most part, all about timing. Yes, there's some relatively simple combos which you can learn fairly easily, and there's not a whole lot of depth to that part. No, the challenge is in learning when each character's vulnerability periods are in their moves, and learning when you should or should not use a move, and when you can take advantage of another character's vulnerable periods.  As mentioned, the controls are relatively simple. Standard FPS-style WASD+mouse type movement, jump, two attack buttons (being mouse L and mouse R), guard, dash, reload (which only is used in a few characters), two special skills, and a power attack modifier. Your basic attacks are made with your attack buttons, and hitting an attack button during the animation of a previous attack can chain an additional attack to it... the concept behind most basic combos. What will/will not chain depends on the character, though there are some which are universal, eg. L mouse attack followed by R mouse attack, which follows up the first hit with a knock-up move, allowing further comboing subsequently.  Aside from that, there's a rage bar that builds up from hitting/being hit, which after having a sufficient amount, you can use to execute your special skills. There's also the stamina bar, which is used up when you dash, but slowly regenerates over time. Using the power attack modifier (which is allowed at certain points in certain combos) allows you to enhance specific moves, such as a guard breaker or adding a knockup to a regular non-knockup move, but consumes stamina (though once upon a time it used to be rage).  Each attack animation though, has its own wind-up and wind-down delays, which leave you vulnerable to being hit yourself since you cannot interrupt the animation while it's in progress. Hence, the key to winning fights in this game is taking advantage of the opponent's vulnerable timings while avoiding leaving yourself vulnerable. And this is what takes time and experience to learn, and it's not something that you're going to pick up your first hour in the game. It will take a lot of lost battles while you learn, 'Okay, if I do this move, it leaves me open to being hit if it doesn't connect or they block it,' etc.  My first few hours in the game during the beta period, I was often up against people who had played hundreds of hours in the beta before, and it was a struggle to get a hit in at all against many of these players, and every opening I left was exploited. So, you learn not to leave the openings, and where the openings are that you can take advantage of. And when you're up against multiple opponents, you not only have to worry about the one person you're up against at the time, but that someone else might hit you from behind while you're trying to execute a particular combo.  Which brings me to what some consider a flaw in the combo system, that the combos are not particularly intricate or varied. If Archeblade was solely a 1 vs 1 game, I would agree. However, Archeblade is a team game for the most part, and the idea of combos being a focus is sort of a hard thing to implement in such an environment, because multiple players participating in a battle means that you're not likely to be free to finish off a big combo chain in any case. So while the fighting game enthusiast in me bemoans the lack of combos as such, the nature of the game sort of means that you can't really do a whole lot of them to begin with... I honestly don't know if there is a way to make the two integrate.  About character balance... quite frankly, it reminds me of fighting games, where some characters are easy to pick up, may have 'cheap'er tactics they can use, and certain characters will have certain advantages over other characters. But in my limited experience with barely 90 hours in the game, it seems to me that given that the nature of winning a 1 vs 1 fight is more about play/counterplay and mindgames, it's still pretty good for balance. Throw that all into a team play environment though, and such arguments should honestly become moot, since the goal then becomes to help the team win, and diverse roles where characters can complement each other become an advantage. Then again, true to the state of many multiplayer team games, you always have (too many) people who are focusing on getting kills rather than helping the team win, so they complain about the little imbalances...  Okay, enough about the gameplay.  Graphics: Nothing special, modelling and texturing are decent. Effects are not too flashy so that they are overwhelming, which I appreciate, because too much flash can become distracting and take away from awareness in a battle. Animations are well done, smooth and natural looking. Art design's well done overall and has some decent variation, but not completely to my tastes... more on that later.  Audio: Some of the one-liners from the characters are cheesy. Sound effects are fitting, and do their job well. Music is well done, but may or may not be to everyone's stylistic preferences, being a bit of a mix between a contemporary orchestral style with rock and electronic, mostly up-tempo as tends to be found in fighting games. The amount and variety of music though is sadly limited though, so while I had the music playing for the first 20 or 30 hours of the game, after that I turned it off and played whatever I felt like in the background instead, though every now and then I'd turn it on just to hear it, since the music isn't bad, just too short.  Network: This game seems to lack retroactive hit detection or any kind of latency compensation. So, it plays much like games in the early days of internet gaming in that you have to lead your  fire swing in the place that your target will be, rather than where they are currently on your screen at the moment. This is not a deal-breaker for me, having learned long ago how to play with this kind of lag, but I know some players have been quite vocal about the game being too hard to play without a sub-100ms ping. Nevermind that from where I am, most servers end up ~200-300ms, and I still think it's playable with some learning to adjust.  Issues with packet loss over the network or possibly server-side slowdown are likely responsible for some of the 'rubber-banding' issues which you sometimes run into, but I cannot confirm the technical issues with that, only that it makes sense logically from past experience with networking and online games.  Complaints: No deal breakers for me, but definitely some annoyances.  1. Minimum player limit for a map to start. And while you're waiting, you're stuck in the lobby... you can do nothing but chat. A more polished solution would be to let people run around inside the map, practice movements or fights, but not have the actual game/scoring active. Switch teams (if applicable), autobalancing, etc. during this time as well. Once the minimum requirements for the game to start are met, everyone is killed so they all respawn at the same time, and then the match can begin.  2. Outfits, specifically the gals. Renoah's the only one that comes with a default outfit that's got decent coverage. Ended up getting the alternate skin for Valle just so she could wear a proper dress! Well, at least they don't limit skin showing to the females exclusively.  Overall: Fun game, have enjoyed playing it a lot, and hope to continue to playing it for some time still. Too bad Codebrush didn't succeed financially with it.",
            "review_score": "1"
        },
        {
            "review_text": "I had fun with the little time i played",
            "review_score": "1"
        },
        {
            "review_text": "Like RPG's Characters? Ever played s4League? This game is the combine of RPG's characters with gameplay like s4league. Kind of easy control and nice UI. And it's free to play~",
            "review_score": "1"
        },
        {
            "review_text": "Give it a try",
            "review_score": "1"
        },
        {
            "review_text": "Ho-ho-ho-ho-holy snap. :D This one is awesome. Not just a simple awesome, like this: OK dude this is awesome, more like: Ohohohohoooo meeeen this is AWESOME!!! Hack n slash, acrobatic moves, quick maches, boobs, lot of players, ♥♥♥♥, enough character to everyone, no stu*id BOT players and yes BOSOMS.",
            "review_score": "1"
        },
        {
            "review_text": "What the hell is wrong with this stupid error 111??? Does ANY ONE know? -.-",
            "review_score": "1"
        },
        {
            "review_text": "The booty game is strong, booty had me like D: ZOINKS",
            "review_score": "1"
        },
        {
            "review_text": "So I went into this game completely blind, and I've gotta say, overall I'm impressed.  Archeblade is a Free To Play, online Third Person Brawler. With a character system similar to League Of Legends (minus the free rotation system), and gameplay which I imagine is a dumbed-down version of the niche title, Anarchy Reigns (although honestly I've never played it, but I imagine it's similar; so take this with twelve metric tons of salt). The game starts you off with enough 'currency' to buy up to two different characters. As all characters are priced the same, you can pick the two you like (I'd reccomend picking two characters that are distinct from one another though so you can get used to a variety of different playstyles).   You must purchase a character before you can play. However, the game does a poor job of explaining this.   After playing the (optional) tutorial as a character named Valle - some form of blonde Valkyrie wielding a giant hammer - I was given a free 7 Gems (paid currency; hardly enough to get you anything). I then noticed a Training mode on the main menu. This mode allowed me to try any character I want against a couple of static bots. Useful for figuring out combos, both listed and unlisted (and by unlisted I just mean attacks that recover quick enough to be chained) and how a character feels in general.  I recomend you try out every character in this mode before purchasing your first two characters.   My first match was a Free-For-All match, in which I had chosen Elika, a gun-toting, tan, dark elf lady with a bountiful chest, lucious legs and a  booty fo' dayz . She's kinda ugly, but I can see the appeal. She mows down her foes using a series of kicks and gun-fu; VERY reminicent of Bayonetta. The game is very quick to pick up provided you're observant and already used to similar third-person brawlers (i.e., Dynasty Warriors experience will transfer a little bit here). Characters control using 6 buttons (not including WASD), for:  &lt;&gt; A light attack - Standard; leads into a combo of some sorts &lt;&gt; A heavy attack - Can be any number of things; for Elika, it's a forward sliding kick that is followed up with a backwards dash and two gunshots, for Valle it's a series of 360-degree hammer spins. Can also be comboed with light attacks for unique moves. &lt;&gt; A special move - Default keybinding is shift; again, this can be any number of things. For Elika it was a backstep, for Valle it was a forward dash. Costs stamina. &lt;&gt; Jumping - Characters can use their light or heavy attacks while in mid-air. &lt;&gt; Power Charge - Holding the ALT Key will change the properties of some moves in exchange for stamina usage. Some moves become capable of breaking guard, others do more damage, some even gain 'super armor', which prevents the character from flinching (similar to it's usage in fighting games, but not exact) &lt;&gt; Skill Buttons - Every character has two skills which cost RP gauge segements to use (RP being gained on-hit and being hit) [/list] The controls are quite intuitive, in my opinion, and responsive too (all my actions are done with purpose; I rarely misclick ).  Talking outside my first match or two, I've come to the conclusion that the characters are fairly balanced for the most part, with no characters outright dominating the field (however, there are cheap characters - looking at you, Renoah and Hyde). One issue I have though is that the characters all appear to be balanced for duels, rather than teamfights. This leads to some AoE buffs becoming stupidly strong when stacked (for example, Valle's regeneration), or duplicates of the same character in a fight becoming too strong as they can cover for eachother's weaknesses). There is also an issue with juggling, as once you are knocked up in the air, successive hits from any source will keep you up there. This means that if you're laid into by multiple enemies at once, and they get past your guard, it's likely you'll die unless you have an ability that actively prevents it, such as DanMei's temporary invlunerability, or Renny's teleport. In duels though, juggling is much harder to pull off, and can only be done effectively with a few characters (others are just better set using their other comboes). There are also some issues with hitboxes and animations. My best example would have to be DanMei, whose light attacks are far lunging. However, due to his large size and his melee attack's lunge, it is needlessly hard to hit targets that are at point blank as you can easily overshoot.  After poppin' some caps in foo's heads with my gun-fu, I came close to the top of the scoreboard on my first match. Unfortunately, I earned a meager amount of meceta (money) for my win (I earned around 70; characters cost 1400 each, and items can range from 800 to over 5000).   ...this brings me onto the subject of 'items'. In Archeblade you can kit out your character in all sorts of tacky, cool or cute looking gear. This gear affects the stats of you character, and can change all sorts of things, from armor, to attack damage/range. Unfortunately, there are items that are  exclusive  to the paid curency, Gems.  HOWEVER , before you stop reading this review, turn 360 degrees and nope out of this store page/community. The stat boosts on these items are not outright insurmountable. As the bulk of fights come down to user skill and error (rarely will that extra 5 speed units or 240 HP make a difference in a lot of situations). It's a horrible practice, but one that I, personally am willing to overlook  temporarily  because I enjoy the gameplay enough. I do sincerely hope the developers will rethink their business approach in the near future though. Else I fear for this game's future (and my playtime).   As of the 12th of May, 2014, the developers have officially stopped supporting this game. In light of this,  they have removed the stats from all gear in the shop . In a way, this is great, because now experienced players cannot have any statistical advantage over newbies. Fights are now PURELY skill-based. The downside is that there will be no more updates. Offical servers are also gone, but users can host their own ones.   To sum this game up:   Genre:  Third-person Brawler  Balance:  Good outside of teamfights - Only decent in them  Grind:  Considerably long unless you focus all your money on kitting out a single character. Pricing and meceta gain rates need adjusting. However, upon leveling up you get an extra 200 meceta, so that can speed you along a bit, especially at the earlier levels.  Learning Curve:  Moderate - Very low if you have decent prior experience with third-person brawlers.   Pay2Win?:  In the literal sense, yes. However, the advantages are not end-all and can easily be circumvented if you're a more skilled player.   Pretty?:  Boobs, butts, thighs, abbs. Many of the character designs are quite sexualized. If you're the kind of person who legitimately believes that 'trigger words' are a thing in written text, or tells people to check a privilege of some sorts. This game might not be for you.  No, I was talking about the game in general:  Eh, it's passable. Characters are a tad too differnt in theme, but are distinct enough that you can recognize them at a glance and are interesting to look at. Environments are generic and expected from a game of korean heritage, but not ugly.  Is it worth a go? Yes. Especially since the PC scene has been starved of games from this genre as of late.",
            "review_score": "1"
        },
        {
            "review_text": "fresh out of beta, still has some balancing issues but great overall :3",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite steam game, if only someone could pop up from out of nowhere and update it or something :/ We can still hope I guess?  I love everything about it, from graphics, to characters and the whole idea is actually pretty nice. I really do hope someone would one day fix it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Watch a gameplay video and fall in love.",
            "review_score": "1"
        },
        {
            "review_text": "This game has lots of potential, the characters have nice design and easy to learn, I even manage to chain kill on my first game. It's not pay2win since most accessories are just for cosmetic purpose.  And the negative thing about this game, developers already abandoned this game, it's mean don't expect we will get any update such as new characters, maps, or anti hackers anymore. And worse, I met hacker on my second match.  However, It's still fun game to play for f2p game.",
            "review_score": "1"
        },
        {
            "review_text": "Well, Not bad with a F2P game. :)",
            "review_score": "1"
        },
        {
            "review_text": "Rip my life",
            "review_score": "1"
        },
        {
            "review_text": "Nice boobies =)",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this game is fun and has gone greatky unnoticed in my opinion. I have played it for only a day but enjoy it greatly. Maybe, if this game recived more traffic, it will only get better. While there is a low player count, it is rediculously fun and enjoyable fighting games. I would suggest this to all my friends and ask that they make this game a little more popular by sharing it too :3  `Sprite",
            "review_score": "1"
        },
        {
            "review_text": "nice game, but is a king generic",
            "review_score": "1"
        },
        {
            "review_text": "I don't even know how to play and the only charater that i bought is that guy who looks like blitzcrank.bones/spooky consider to put shrek in this game please",
            "review_score": "1"
        },
        {
            "review_text": "ArcheBlade is somehow becoming one of my favourite fighting game. The animations are nice , it isnt a pay to win game. I dont know why u guys are saying Renny is over powered , if you know how to play properly then u will think twice. Most steam games are a boring without friends but this game u can just happily without friends :) I RECOMMEND THIS TO OTAKUS. Well i just started so dont expect to see like 200 hours of playtime",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game, quick access to any kind of maps, the gameplay is very good, sometimes it lags when you never played on a map but it takes only a few seconds to go back to normal, I highly recommend this game because you can have fun with your friends or just join a random game and change the results it has.",
            "review_score": "1"
        },
        {
            "review_text": "Tense and exciting!",
            "review_score": "1"
        },
        {
            "review_text": "Tense and exciting!",
            "review_score": "1"
        },
        {
            "review_text": "I recomend this game to people who like anime and girls hitting people with giant hammers",
            "review_score": "1"
        },
        {
            "review_text": "This game got much better after Codebrush put it on hold. All the P2W aspects have been removed, and all items and accessories are simply cosmetic. The game feels much more balanced now. The only thing holding it back now is the lack of players and servers.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent and nice game.",
            "review_score": "1"
        },
        {
            "review_text": "Let me start by saying: THIS IS NOT A P2W GAME.  Now that's done, this game is a really fun and addicting fighting game based on your actual skill. The store items, wich can be bought with real or in-game money dont ad that many stats, so there is not an item that will make you OP, making the game a skill based game.  Pros: -Good Music. -Good Graphics (Anime art style). -Easy to learn.  -Every character is different from any other character and every single one of them has a unique role in team gameplay. -Wide range of matches, from 1 vs 1 to 7 vs 7 (including Deathmatch, TDM, Capture point and Round Match) -Includes a Host Server exe so you can play with your friends in private.  Cons: -There is no match making. You simply enter a server and if you're lucky its almost full. -You need to stay in the lobby and wait for everyone to be 'locked' wich means that in a 5 vs 5 match you need to wait for 5 people in both teams to be ready and actually start playing. -Servers lag a lot. Even the server with lower ping have lag spikes from time to time. -Every character needs to be bought for you to play with. They give you 3000 game money, enough to buy 2 characters (1400 each). -There is very few maps and two of them are actually bugged. -There is a character called Renoah (sniper) that has a unfair and OP ultimate that takes almost half the amount of hp every enemie has.   Rate: 7/10 The server and match making need to be improved a lot.",
            "review_score": "1"
        },
        {
            "review_text": "The game has the potential to be good, but to choppy, clunky and for me, is just a series of button bashing combo's and hoping for the best",
            "review_score": "-1"
        },
        {
            "review_text": "Game is terrible unresponsive and laggy",
            "review_score": "-1"
        },
        {
            "review_text": "  Game died to quickly",
            "review_score": "1"
        },
        {
            "review_text": "That's cool Thing  Let's Dic in A Box",
            "review_score": "1"
        },
        {
            "review_text": "Was good back in the days, now its just one of 'those' games",
            "review_score": "1"
        },
        {
            "review_text": "Compared to other MOBA-style games such as League of Legends and DOTA 2, this one is actually legitimately fun.  Plus, with the close 3rd person view, it makes the battles much more dynamic and fun to watch, too.",
            "review_score": "1"
        },
        {
            "review_text": "Love the gameplay and style and control of the game!",
            "review_score": "1"
        },
        {
            "review_text": "Compared to other MOBA-style games such as League of Legends and DOTA 2, this one is actually legitimately fun.  Plus, with the close 3rd person view, it makes the battles much more dynamic and fun to watch, too.",
            "review_score": "1"
        },
        {
            "review_text": "AB is a fun game. The community is decent, the mechanics are interesting, and the soundtrack is alright.   The game(like all fighting games) will need balance patches, new characters, etc. etc., but as a whole I feel like it is a worthwhile venture for people's time.   Takes a bit of skill to get into, but a little bit of practice goes a long way (no i'm not talking about that 5 hour combo memorization that fighting games require, I'm talking about learning when to guard, when to attack, and when to use abilities).   Since pretty much the only game to ever do what AB did with even the smallest success was Anarchy Reigns and that bombed, I'd give AB a chance while it's still around.  Devs don't make these games very often, so a decent one is a 'GEM' of sorts.",
            "review_score": "1"
        },
        {
            "review_text": "For a small company to release a game such as this is huge!! This game does need some improvements, but that is expected. People that are bashing this game because they think a champion is OP need to get there head checked. Game Balance come with patches and seeing champion stats on a large scale can provide this information. It's very difficult for game dev's to make a completely balanced game with just a small beta or in house testing.   As far as bugs and gliches there are not many and I don't know if you have ever played an EA game on release, but they are all terrible and rarely work properly until days/weeks later. I give mad props to Codebrush for creating this game. I have already played abour 5 hours and have had a blast.   Pros   - Unique Champions to choose from  - Multiple Game Types/Maps  - Fun Competitive Gameplay  - Training allows you try champions before you buy  - Seems like the Devs care about the community  - Boobs  Cons   - Pain to find/join servers  - Account/Menus/Shop could be more intiutive  - No ranked play (yet)   @Codebrush - Things I think should be improved to make your game better and more profitable.      -- Big Enhancements --  - Queue System - Having to find and locate a server is a pain (Seperated by regions/gametype) - Ranked Play - Create a ranking system similar to Starcraft 2, Leage of Legends, or Dota 2. - Shop - Everything should be purchasable with enough gameplay. Making items that affect stats only purchasable with real money is a terrible idea (this is why 95% of FTP games never get a large playerbase). You will still make money I promise! People don't mind spending money if they think the game is being fair to everyone. **Note I have spent $20 on your starter pack - Release New Champions to play with on a monthly/bi-monthly basis     -- Small Enhancements --  - At the end of a match if enough people click restart match; It should just restart not kick you back to the menu. - Combine Gear Up/Account Info/Items/Leaderboard into one easy to use Account page. - Allow players to set the difficulty of the bots in training.  All in all I think the game has promise and plan to have some fun playing it the months/years to come. I hope codebrush continues to patch and development the game to make it as succussful as possible.   -Dank",
            "review_score": "1"
        },
        {
            "review_text": "I actually found this game to be very enjoyable, I went into it a little hesitant, but after my first game I was craving for more. It's a really fun game, and I think more people should play it! :D",
            "review_score": "1"
        },
        {
            "review_text": "Unbalance but i like feeling when weaker win stronger",
            "review_score": "1"
        },
        {
            "review_text": "pls allow bot matches",
            "review_score": "1"
        },
        {
            "review_text": "was fun best game 2014-Nadaz 2014",
            "review_score": "1"
        },
        {
            "review_text": "It's like neo unreal tournament o:",
            "review_score": "1"
        },
        {
            "review_text": "FANTASTIC game! A must have for any steam user! The controlls are really well thought out with a steep learning curve but the game is still fun to just pick up and learn, gameplay progresses well and is super adictive! this game NEEDS to be more popular!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, not P2W, game modes include team deathmatch , FFA, capture and hold, and a bigger version of capture and hold(however, that one seems laggy)  Note: Range attacks doesn't go through allies(this happens alot), however the massive damage from a successful hit make this ok Lighter characters swings faster and will interrupt your heavier fighters to a point where you will be standing still, doing nothing(this is the most annoying) Stick to servers within your level range, there will be uncapped ones (LVL 1-100) not a good idea going into one at lvl 1  I recommend getting Renoah first, she is pretty and her sniping is OP. Alot of people will complain, but it sure does feel good hearing them cry.",
            "review_score": "1"
        },
        {
            "review_text": "A good arena fight rpg game. Best thing is the combo system really makes u learn how to work with ur keyboard not just smash it around xD",
            "review_score": "1"
        },
        {
            "review_text": "This is a game where scantily women and old men in robot suits can battle it out to the death in a server that pings every 3 seconds. 420 stars out of meme",
            "review_score": "1"
        },
        {
            "review_text": "This is a game where scantily women and old men in robot suits can battle it out to the death in a server that pings every 3 seconds. 420 stars out of meme",
            "review_score": "1"
        },
        {
            "review_text": "Its a very good game with great graphic and large content but I am very dissapointed by developers that stoped to update the game and fix bugs(with network).",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥.... This is such a great game and i really want to love it i really do, but the server problems and lag are real problems :| BUT if you can get past that, ITS SUCH AN AWESOME GAME!!! I really recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "nice game even its kind of action fighting gameplay",
            "review_score": "1"
        },
        {
            "review_text": "This game is bad... the video looks cool..Me and my friends download it...play it... everyone is a pay2win... game sucks .. deleted it with in 20 mins... never talked about it again..",
            "review_score": "-1"
        },
        {
            "review_text": "They stopped development of this game because they are noit making enough money.",
            "review_score": "-1"
        },
        {
            "review_text": "It's not real often that I can find a game that really captures my interest for an extended period of time, but this one has. It's now Free to Play (optional $10 all-access pack) so there's no reason not to try it. It's entirely PvP but well balanced. You can literally take any given character and become amazing with it based on your personal level of skill. It's not a 'this one characer or class beats all' kind of game. It rewards a fast reaction time and ability to learn a person's pattern's &amp; behaviors with a character. If you can do these two things you'll be extremely great at the game. Each character has a strength and weakness that can be played upon and knowing each character's abilities and limitations helps greatly in battle. There's not so many maps to choose from, but this is made up for by really great gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "The game itself may look appealing but overall wasn't that good in terms of gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "like the game. but its very obvious soon off that there is a few characters that triumph over the rest. -__-  that can take the fun out of it...  BUT, i find the button mechanics different. and it has nice graphics for a free to play i think its fine. :D why not give it a go?   ITS FREE. lol",
            "review_score": "1"
        },
        {
            "review_text": "The game its fun , nice characters designs , good controls and map.  Well ,i played for a while until lvl 8. Playing with more experienced players made me start to get really bored. Theres no balance between new players and more experienced players. Just get smashed on the face all times . This ♥♥♥♥ me off because im not the type of player that fits fast. They need to divide the new players with ``pros``  This game is really fun , but really need to have an balance , some players may enjoy this challenge to fight against people with more experience , but some players not , like me . They tell me to learn to play and call me noob ,ok . I go , do a research to know more about the game techniques , block etc. But its impossible to learn something when u just get smashed on the face without any chances to fight back.  Is nice to play, but is not a welcoming game for new players with that current balance between players . May ♥♥♥♥ off some new player like me , or delight for those who enjoy learning while dying all the time. This can make new players to stop without fully enjoy all the game give u , i think im one of these players.",
            "review_score": "1"
        },
        {
            "review_text": "Complete ♥♥♥♥ matchmaking, all you get is low lvls vs high lvls, constantly being stunned by high lvls while they just resist everything... not worth anyones nervs  I wouldn't recommend this game if someone paid me..",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun, quick and free. I've invited my friends to play it with me and I've never had so much fun in a long time, as far as character balance goes I've had no issues, all of them seem pretty fair and it all depends on YOUR own skills, some easier and others harder to handle, definitely worth a try!",
            "review_score": "1"
        },
        {
            "review_text": "it's so beautiful game",
            "review_score": "1"
        },
        {
            "review_text": "DO GOOD FIGHTS. THE GAME IS ABOUT LEARNING TO CHOSE SERVERS THAT ARENT LAGGY.",
            "review_score": "1"
        },
        {
            "review_text": "Not a perfect game but i like it anyway :)",
            "review_score": "1"
        },
        {
            "review_text": "Way too glitchy :/",
            "review_score": "-1"
        },
        {
            "review_text": "best fairplay PvP game",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, although still needs some work. Definitely has a lot of potential.",
            "review_score": "1"
        },
        {
            "review_text": "this should be call assblade bcause the camera is fixed on your ♥♥♥ haha laugh godammit",
            "review_score": "1"
        },
        {
            "review_text": "Stay away. Stay far far, FAR away.  Rinoah / Rionah (whatever) is the only class you will ever need to beat this game and top leaderboards in matches. The balancing is non-existant and laughable. WIth Rinoah, if you get a certain amount of kills you unlock an Ultimate that allows you to practically one shot everything across the ENTIRE map.   The map design is awful. I spent more time chasing around a ♥♥♥♥♥♥♥ corner or through a hole then I did actually fighting most of the time. One map, I cannot recall the name has 2 connecting bridges that allow you to 'sneak' across and cap your enemies crystal base/altar. Problem is the gap connecting to the opposing teams side (wooden side) is almost unjumpable.  The characters are composed of mostly stereotypical hentai anime girls. Whilst not offended by the comment, the one character whom runs around with demon wings and a g-strings opening line is 'I just got out of the shower~'.  The voice acting is awful, then again I wasn't expecting much from an F2P game.  There is a memory leak that is still prevelant in the game.  Even though its awful overall, there are a few good points.  Easy to earn in-game currency (sorta).  Easy to pick up and play. I didn't struggle to memorize any specific combos (then again I played Rinoah and the Skeleton).  Its F2P, meaning you don't have to waste cash on this garbage...unless you wanted the costumes. Speaking of costumes, may I ask how they got away with plagarizing the following armors? I saw a Captain America Armor, a Hitman armor for Hyde. Splinter Cell-esque gear.    I'm curious, did this get greenlit off of Steam or something?  ",
            "review_score": "-1"
        },
        {
            "review_text": "it is a awesome game",
            "review_score": "1"
        },
        {
            "review_text": "Life is like a Blade The more sharper it is, the more effectively it cuts through.",
            "review_score": "1"
        },
        {
            "review_text": "Very awesome game! Although I havn't played much, I intend to put a few more hours in.",
            "review_score": "1"
        },
        {
            "review_text": "this game is really good i got addicted in an instant only downside is it take too long to get more credits",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay(complexity) is about the same quality as the English localization. Which isn't exactly a compliment. I've seen flashgames with both better gameplay, a more elaborate fighting system and more adequate graphics. Game itself is free, but there is NO way to unlock characters past paying money (and freerotation). If you run out of options, it can kill a few hours, but that's about it...",
            "review_score": "-1"
        },
        {
            "review_text": "great beat'em up brawler game, lots of fun recommend to anyone who likes fighing games",
            "review_score": "1"
        },
        {
            "review_text": "This game needs one thing: NERF For ♥♥♥♥s sake, there are 14 characters and 10 are overpowered and don't need a single amount of skill to 'play' and win. People takes a character with Tons of damage and o Tons of damage per second and SMASH a single button, they don't make combos, don't have tactis, THEY DON'T EVEN RUN, THEY JUST SMASH A SINGLE BUTTON If you are a fair player like me, don't play, you will get angry as hell because players with Down syndrome prefer to spam the same attack Btw, the game have good graphics in anime style, nice characters and endless possibilities of combos(wich most people ignore this part), cool shop for costumize your character and get more characters,weapons,costumes and colors sets. Sorry for the bad english, i'm brazilian",
            "review_score": "-1"
        },
        {
            "review_text": "Anyone can play, relitively simple but lots of fun for a noob like me",
            "review_score": "1"
        },
        {
            "review_text": "I just took a shower 10/10",
            "review_score": "1"
        },
        {
            "review_text": "ArcheBlade is a pretty good game and in many cases you must think about what to do in certain situations and how to avoid them",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game if you are bored",
            "review_score": "1"
        },
        {
            "review_text": "______________0000_________________  _______________000000________________  ____00_________000000__________00____  _____0000______000000______00000_____  _____000000____0000000___0000000_____  ______000000___0000000_0000000_______  _______0000000_000000_0000000________  _________000000_00000_000000_________  _0000_____000000_000_0000__000000000_  __000000000__0000_0_000_000000000____  _____000000000__0_0_0_000000000______  _________0000000000000000____________  ______________000_0_0000_____________  ____________00000_0__00000___________  ___________00_____0______00__________ You have been visited by the dank weed leaf of ultimate euphoria and autism! Fame and eternal no scopes will come to you but first you need to 420 $wagsc0p3 this message to 5 other MLG blokes. If you do the $wagsc0p3 (must be really dank), then you will be a proper MLG bloke no scoping m80. If not, you will be hardscoped to kill by campers for the rest of eternity",
            "review_score": "1"
        },
        {
            "review_text": "I highly Suggest u try this game, Amazingly Detailed and fun to play, especially with your friends 10/10",
            "review_score": "1"
        },
        {
            "review_text": "very sexy!",
            "review_score": "1"
        },
        {
            "review_text": "Even if this game is 'down', it is a really good FTP game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the worst games I've played in a while. You get dropped into a tutorial that teaches you almost nothing, and then you land on one of the Archeblade servers which contain several hackers.  Would not recommend",
            "review_score": "-1"
        },
        {
            "review_text": "Dead game, Used to be fun with a bunch of people  They put up a paywall for all the characters so it's like league of legends the way you buy chracters  Just a graveyard for BR's to hangout  7/10 for gameplay 0/10 for current community (dead + BR's)",
            "review_score": "-1"
        },
        {
            "review_text": "5/10",
            "review_score": "1"
        },
        {
            "review_text": "Why the heck are the numbers of played hours increasing. I only testet this game for 15 minutes. There is no process running in the background. Must be a bug. Besides, i dont like the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm afraid I don't have much love for this game. While in combat, I had serious issues trying to land any hits on my opponent. The lack of a targeting system keeps you on your toes to try and hit your opponent before they move out of your line of action. Because of that, slower characters are always at a disadvantage and quicker characters can be difficult to play due to the intense sensitivity. In the public games, 9 out of 10 times the games were seriously mismatched. At a starting level, I was pitted against level 20's and 30's on my first playthrough. Also, many times the teams were unbalanced, leaving one side to always be the winner. One final mention is that several times I found myself choosing one character, and being thrown into the area with a completely different one. There needs to be some serious adjustments made, in my opinion, as I really do want to like this game, but can't at its current state.",
            "review_score": "-1"
        },
        {
            "review_text": "I would really love to recommend the game buuuut the devs gave up on the game like 2 years ago so ... that is basicly why I can't recommend it. You can give it a go cause its free and try it out but you probably will only see a very small player base if any at all, and they will be very experienced and stomp you in the ground. Nice game. but dead.",
            "review_score": "-1"
        },
        {
            "review_text": "ONly fun at begining and hard to earn coins to unlock characters",
            "review_score": "-1"
        },
        {
            "review_text": "Well, it's completely stagnant of ♥♥♥♥ING CONTENT, it got old REALLY quick for me, so, honestly, I don't reccomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Meh. It's free, can't complain. Fast install, interesting character design, and a decent tutorial.  It lacks a decent matchmaking system, and every 3rd lobby has a hacker or someone who plays WAY too much. Finding a game is really hard, because it's the old-fashioned 'find a match yourself' kind of nuisance.  The game is fun when you aren't facing someone with invincibilty hacks or it isn't lagging due to poor net code. I just wish the combat was more fighting-based rather than feeling like I am playing an early 2000's action game.  Final Verdict - 5.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "I honestly think this game is pretty bad, also kind of a pay-to-get-good.",
            "review_score": "-1"
        },
        {
            "review_text": "I do like it. Reminds me of the good ol Sega arcade games.",
            "review_score": "1"
        },
        {
            "review_text": "I tried to like this game but first impression is the shop, very buggy and has a chance of not buying the item and waste your in game money, totally sucks, unless they fix this issue, becareful of what you buy :\\",
            "review_score": "-1"
        },
        {
            "review_text": "Really nice 3D fighter aspect, bad manual match making. Really helpfull veterans that help you from combos all the way to what characters are easier to start off with. Recently glitches and hacks release, nobody seem to use them.",
            "review_score": "1"
        },
        {
            "review_text": "Need more SE asia server.....",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░█▀▀░░█░░░░░░ ░░░░░░▄▀▀▀▀░░░░░█▄▄░░░░ ░░░░░░█░█░░░░░░░░░░▐░░░ ░░░░░░▐▐░░░░░░░░░▄░▐░░░ ░░░░░░█░░░░░░░░▄▀▀░▐░░░ ░░░░▄▀░░░░░░░░▐░▄▄▀░░░░ ░░▄▀░░░▐░░░░░█▄▀░▐░░░░░ ░░█░░░▐░░░░░░░░▄░█░░░░░ ░░░█▄░░▀▄░░░░▄▀▐░█░░░░░ ░░░█▐▀▀▀░▀▀▀▀░░▐░█░░░░░ ░░▐█▐▄░░▀░░░░░░▐░█▄▄░░░ ░░░▀▀░Archie Blade ▐▄▄▄▀░░░",
            "review_score": "-1"
        },
        {
            "review_text": "Play this game",
            "review_score": "1"
        },
        {
            "review_text": "the best game ever! awesome game! but some times lag",
            "review_score": "1"
        },
        {
            "review_text": "Played 2 hrs, unlocked 15 achivements...nuf said :3  Anyway this game is really fun. If love casual fighting in a battle arena then its recommended for you. Its not like other pay2win games which call themselves free2play.  Overall 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice.. but it's hard to hit other player for me... maybe i weak for this game :(",
            "review_score": "1"
        },
        {
            "review_text": "tried it out when me and my friend were bored. To quote Danny DeVito, 'This is crap. Pure, unadulterated crap'",
            "review_score": "-1"
        },
        {
            "review_text": "Not Good At The Game But It Has Good As F Eye Candy ;P ",
            "review_score": "1"
        },
        {
            "review_text": "kinda fun to play except the level up process takes way too long so it is way to difficult to try to catch up and take some of the other characters. plus the hackers and cheaters are way to out of control on this game. for those reasons this game does not carry the fun factor enough for me to keep it installed. shame too it has so much potential.",
            "review_score": "-1"
        },
        {
            "review_text": "This could be enjoyable if I understood why I was mouse and keyboard mashing my characters into a whirlwind while waiting for shotguns to reload so bots could attack me under the guise of training for another greater purpose or level?   Like is there a princess to save here? Or gold bars to collect?   No. I didn't enjoy this game.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Arche Blade is an Epic Game i just love it join in on the Fun (2013) The Characters seem to be balanced at a good rate where it's all fair and square. Currently there are hardly or no hackers.  Now here we are in 2015 yes just over a year later and I have to say this game went from good to outright Bullcrap. you got your pros who can reck with the characters who take like an entire 1-2 seconds to use a move (really slow in this game) and than there are those who grab a character who activates their's in about 100 mirco seconds (Yes about 10-20x Faster) and than hackers that make their's 1 micro second or faster (Which is about 1000-2000x Faster than the slow ones) The matches might have balanced team as a rule but.... Once someone in that match leaves (Or Rage Quits) it turns off and can end up having fights of like 2v28. seriously what the hell is with this game.  Finally the bad bits (If you thought the top bits were bad they were actually the good bits.) spamming on this game is like watching hackers on cod or battlefeild. one moment you have full health about to kill someone and than pooth they get behind you and spam you like there ain't a tomorrow...You Ded that is the spamming in a nutshell. The fact you can spam potions is just stupid I believe you should have a limit or just make them more expensive. (I shouldn't have to tell you the pain of that) and next and last bad thing I will have to say. For anyone in the Australian Continent or Oceana Region your connection most likely will suck... Not joking The best ping I get is 168 on a team deathmatch server. than it just seems to go up to 600+ (I have never seen a ping so high in my life before. 300 being the highest before this game)   Okay now some actual good things: ---------------------------------------- ---------------------------------------- Did I mention There aren't any  conclusion: you a sadist or a masochist than this is your game People who want to keep their sanity hit that back button and never return here again, unless something actually get's done about this. (Quick warning those mostly liked people, most don't actually play anymore. there are only about 35-45 people on most of the time rarely it goes up to 60 and most of them are people trying this out or regulars.)  Thank you for rading this and sorry for incorrect spelling and grammar...Had to learn it myself  =====EDIT===== I came back in mid-2015, I must say the game got even worse. Lag was higher, even more hackers and much more.",
            "review_score": "-1"
        },
        {
            "review_text": "Eh this game is just....... wishing to be something it can't.",
            "review_score": "-1"
        },
        {
            "review_text": "crap game graphics are nice controls are clunkyer then hell",
            "review_score": "-1"
        },
        {
            "review_text": "Good anime fighting game.",
            "review_score": "1"
        },
        {
            "review_text": "Need More Update",
            "review_score": "1"
        },
        {
            "review_text": "This game looks pretty awesome! ^^ I think it's a really cool game for a F2P.",
            "review_score": "1"
        },
        {
            "review_text": "I Play for the plots, hahaha",
            "review_score": "1"
        },
        {
            "review_text": "Greatest game I have ever played. If steam had more free games like this, my library would be full of them.",
            "review_score": "1"
        },
        {
            "review_text": "it's dumb it's korean I can't believe it's not run by nexon   it sucks don't play it",
            "review_score": "-1"
        },
        {
            "review_text": "don`t look pictures it just fake and it`s very bad game , if u just play 5 min this game , u will understand what i say ",
            "review_score": "-1"
        },
        {
            "review_text": "It's a full pvp game, aka snoozeville. There's no pve qualities to it, and there's a lot of catching up you have to do when you start. First, you have to buy a character, then you fight other people in an attempt to get a ranking to get money in order to get gear for that character so you can get MORE money for more costumes, gear, characters, pots, etc... It's not uber shabby or anything, but it's definitely not worth your time if you like both pvp and pve. Just refer to Tea Time Sensei's review. It's quite accurate. I honestly don't know if i would recommend this game just because it's not my cup of tea... I can definitely see where they were trying to go with it, but a lot of the skills are too ridiculous, (the robots and the gunner sniping skill,) and the movement mechanism is a bit odd for me. My suggestion to the ones who created this is to allow people to teleport out of the homing attack. What's the point of the teleport if the game is just going to auto track you?",
            "review_score": "-1"
        },
        {
            "review_text": "They start you off with JUST enough money to buy the succubus character and her bunnygirl costume. (Don't forget to equip the optional tail!) Best freemium system ever.",
            "review_score": "1"
        },
        {
            "review_text": "this game is like a drug, for anyone even for haters, they always say ' this game is dead ' and I answer ' so what you doing here? ' , it is really a drug when u starting you never get enough. characters design and look is attractive.  what is bad about it that cheaters are exist now because no one can stop them, and there must be a count down for the leaderboard reset time, because the date included is not accurate.  best thing about this game is that you meet great people in there so it is alive, even if you don't feel playing today you can chat other players and have a good times.",
            "review_score": "1"
        },
        {
            "review_text": "Avoid if you don't like MMO Action PVP.. fighting requires to much time sunk into the game for it to be worthwhile &gt;.&gt;  Honestly not worth your time, as it's done better by other games now.",
            "review_score": "-1"
        },
        {
            "review_text": "Say, do you like games that are really ♥♥♥♥♥♥? Are you a connoisseur of all things truly awful? Do you just plain hate yourself? Then boy howdy, have I got a game for YOU, friend!",
            "review_score": "-1"
        },
        {
            "review_text": "ArcheBlade has a good idea but has failed to execute it. Without dropping my age, I grew up on Street Fighter. It is and always will be my all time favorite. What ArcheBlade appears to try and pull off is making a sort of arena based Street Fighter. That is something I could definitely get into as a change of pace. Unfortunately they half-♥♥♥♥♥ it.   The characters are not great. Maybe 3 I was kinda excited about trying. The move list is shallow. The skins are wack. And the arenas are stale. It also faces a severe launch problem if launching the game from a 1920x1080 resolution. You have to set your computer screen to 1200x780 and then launch the game and then set the game resolution and then go back and reset your screen resolution. Took a while to figure out that one. All they need to do is create a launch window to start the game with an option field inside that window. C'mon Korea! You usually make cool ♥♥♥♥ over there!  If someone were to create a banging line up of fighters with a variety of colorful moves and arenas that have different levels, mazes, rooms, etc. where you can run into someone one on one, this concept could work. But this is just one open room with a bunch of people button mashing 4 on 1 while the one person just runs for their life. This isn't it.",
            "review_score": "-1"
        },
        {
            "review_text": "it's kind of a repetitive game, no objective beyond buying new expensive characters..",
            "review_score": "-1"
        },
        {
            "review_text": "^_^",
            "review_score": "1"
        },
        {
            "review_text": "I guess it´s alright.",
            "review_score": "1"
        },
        {
            "review_text": "i cant play cause this hakers",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun game, but whatever potato they use for a server needs to get upgraded, when a server has 32 ping and users are rubberbanding across the map and falling out of combos, means the lag has severe impact on a games turnout, and it's not only me many people in game complain about the terrible lag, and have multiple people leaving games because of it.",
            "review_score": "-1"
        },
        {
            "review_text": "'Looks like an ok game, maybe i should try it' Installs game... 'Ok so i know the controls, lets go' Instantly 1 shot by bs characters. 10/10 would die in 1 second again",
            "review_score": "-1"
        },
        {
            "review_text": "L.O.L meets POWERSTONE meets SUPREME NEED OF 10MB or more net speed to play against other players. if it wasnt SOLOLY based on the mouse as your way to attack or rotate camera itd be a little funner. ALSO the OPEN rooms are all level 30 people that spam ultra bought moves from different costumes OR just spam the R-click no stop.. also none RESPECTS 1v1 match ups. it way to gayly gang bang. so YEH ♥♥♥♥ this game",
            "review_score": "-1"
        },
        {
            "review_text": "This game very unbalance in characters",
            "review_score": "-1"
        },
        {
            "review_text": "I do NOT Recommend this game, Because i have seen NUMEROUS Cheaters in this game, Those who don't enjoy being constantly beaten by cheaters, DO NOT PLAY THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't, tho. You'll regret it",
            "review_score": "-1"
        },
        {
            "review_text": "I admit this is a really good game since i updated my graphics card to play watch dogs it replaces cosmic break i used to own and to be honest i love this game and i only played it for 2 Hours i have gotten addicted and better at it i have gone from noob to adept and i love it if jin comes back i would love to see more charecters its amazing i also recommend this to my friends £3:25 To unlock everything thats very cheap in the haloween sale",
            "review_score": "1"
        },
        {
            "review_text": "Nothing wrong with the game but it was just annoying to collect coins to purchase charachters, thats why i left in the beta. pvp was not soo good back then eitehr because of some charachters were better then the other ones so the game got inbalanced but i do not know now tho",
            "review_score": "-1"
        },
        {
            "review_text": "This is very funny battle Game.",
            "review_score": "1"
        },
        {
            "review_text": "Very Nice RPG game ",
            "review_score": "1"
        },
        {
            "review_text": "this game sucks ♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't like this game, the gameplay is kinda weird, not much players. You may try it because it is free.",
            "review_score": "-1"
        },
        {
            "review_text": "Basically this was Overwatch before Overwatch was even an idea. Great F2P title. Too bad it was never finished",
            "review_score": "1"
        },
        {
            "review_text": "Interesting concept, poor realization.    Awkward and clunky controls  - most of the times the block doesn't work + each hero seemed to have a prefered combo to deal dmg (for example space+LMB+LMB) so you hardly even used anything else + each attack causes a relatively long animation that can't be cancelled which is not a con per se, but I found it pretty hard to understand when it was complete    Not so great graphics     Limited hero pool  - heroes are not that many in general + you get to choose only 1 hero at the beginning, the others you have to pay for (either real money or in game currency - you can also buy everything (heroes + skins) for 10$). You can try all of them in practice though.    Console-like menu screens   Looking at my playtime this is obviously a first impression so take it as you wish, but I don't think i'll likely play this game again.",
            "review_score": "-1"
        },
        {
            "review_text": "So hard to control and the fighting is so laggy. But good job on character design and outfits. 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "Gamepad Support?",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Anime Ladies With Big ♥♥♥♥ And its freeeeeeee&lt;3333 Buy DiS ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Worst graphics ever ",
            "review_score": "-1"
        },
        {
            "review_text": "It's a pay-to-win game :/",
            "review_score": "-1"
        },
        {
            "review_text": "...It's not even fun. Don't play it. You'll regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "it sucks",
            "review_score": "1"
        },
        {
            "review_text": "If you like Anime Girls with big boobs beating each other up you might like this game.  I don't so there you go.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is dead :(",
            "review_score": "-1"
        },
        {
            "review_text": "not very free to play when you have to use real monies for certain weapons and items that DO effect gameplay, tasteless character design, and meh gamplay.",
            "review_score": "-1"
        },
        {
            "review_text": "The game, in this state, is unplayable and disgusting, in my honest opinion.  THE GOOD: The graphics are suprisingly decent. The characters are fun to play and the combo system works to an extent. You can try out characters in-training before purchase.  THE UGLY: The game can't run on my computer even though it meets all system requirements. The game is horribly optimized. The characters, despite their nice models, are oversexualized to Hell. Imalanced characters, it's scary how bad it is in this game.  Fix these flaws and you'll have a nice brawler that I'll get into, Codebrush.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one terrible game...",
            "review_score": "-1"
        },
        {
            "review_text": "Brings new meaning to tedious button mashing.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS THE WORST ♥♥♥♥ING THING I HAVE EXPEIRIANNCED SCINCE RIDE TO ♥♥♥♥ING HELL, GO ♥♥♥♥ING SHOVE YOUR FINGER UP YOUR ♥♥♥♥ YOU PERVERT ANIME ♥♥♥♥♥♥♥T",
            "review_score": "-1"
        },
        {
            "review_text": "Gay, only played it for the boobs and ♥♥♥. all male characters are op, as a feminazi I am very offended by this.",
            "review_score": "-1"
        },
        {
            "review_text": "I would love to be able to recommend this game, I really would, but I can't. I started off thinking it would be some sort of moba similar to Awesomenauts only 3D and with some cool Skullgirls style combat, but I was sadly mistaken. The game is filled with mainly useless characters who don't really fit to the block, bait, and hit from behind play style this game has. Also there seems to be some sort of large gap in skill, as they let new players mix in with people much higher levels than them. The combat seems to follow this same pattern every time of just blocking and then unblocking to hit a player from behind. This seems kind of easy to do right? With some characters, yes they move fast in a straightish path and can do this easy. Others can't do this at all. My first character had two pistols and it seemed cool at first until you realize everyone wants to go do their own thing and you are left defenseless. I bought a melee character because they give you enough in game money to get two characters to start off with. This is when I really started to notice how much the camera fights you when you are attacking. It was just dreadful. Every time you attack the damn thing starts moving in all directions and it just made the whole experience harder. I loved the concept of a moba based on fighting games, I think the intro video on the company's website used Street Fighter as an example, but yeah, it was just not there. The game needs to work itself out a little bit and comeback with a more balanced roster and a way better camera.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't think I've seen a more ♥♥♥♥♥♥♥♥ game...",
            "review_score": "-1"
        },
        {
            "review_text": "Free to play, Pay to win.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is donkey balls. I wouldnt trade... actually I WOULD trade my left testicle in order to go back in time and make sure this game was never developed. I hate it. I hate it more than Tobey Maguire's version of Spiderman. This game gave me aggressive 3rd world diseases. Only play it if you hate yourself, puppies, and you mother.",
            "review_score": "1"
        },
        {
            "review_text": "Worst user feedback ever",
            "review_score": "-1"
        },
        {
            "review_text": "BAD game, horrible commands....Ive play one match and deleted. Don´t waste your time.",
            "review_score": "-1"
        },
        {
            "review_text": "A waste of time. A cheap ♥♥♥♥♥♥ game aimed to score a couple bucks from people who only like looking at over sexualized characters male and female in funny costumes.  Every server is lagging and the game is comepletely unbalanced and frankly, unfun. Don't bother with this ♥♥♥♥♥♥ attempt at a free to play model game.  Not even worth a try.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 Best 3D F2P fighting game I have ever played. No other 3D F2P fighting game comes close, but then again I haven't played any others. Must-buy (DLC).^^",
            "review_score": "1"
        },
        {
            "review_text": "The Developer of this game has dissolved, it is an online multiplayer game that will NEVER have any more content than it doesn now, and relies on user-created servers for the actual mutiplayer. I would reccomend against playing it as there are many other games woth playing that has a developer that continues to exist.",
            "review_score": "-1"
        },
        {
            "review_text": "in the beta of this game,it was ot polished but the gameplay was quite promising.when i played it again all i saw was a polished game but the gameplay from the beta was not the same,i dont know if i should recomend it or not, ignore my recommend box and read this message and i recomend to try this game out yourself.",
            "review_score": "-1"
        },
        {
            "review_text": "server selection screen lags, the gameplay has weird teleport lag and even if the server shows that there's still room it doesnt mean you get to join the game! there isn't even a ♥♥♥♥♥♥♥ quick join button! atleast they could have put a versus bots to have some sort of game to play!",
            "review_score": "-1"
        },
        {
            "review_text": "F this game! It plays like this... First- do tutorial. Next- try then get characters. Then- WAIT FOR-FREAKIN'-EVER FOR A ROOM TO START AN ACTUAL GAME!! Lastly- rage quit the game...  This isn't a fighting game, it's a waiting in the lobby simulator...",
            "review_score": "-1"
        },
        {
            "review_text": "Got like 10 achievements in the first game, and my team was STILL uncarryable. Do not play if you don't want cancer.",
            "review_score": "-1"
        },
        {
            "review_text": "Slow animation response... bad latency... ya. Gets old when you watch people run though your attacks and take no damage over and over, then get air locked by rennys. Might be worth playing if they can balance the characters better and clean up the animations",
            "review_score": "-1"
        },
        {
            "review_text": "They completely ruined this game with the release. A game that was based on skill became a Pay to Win game. You either pay to gear up your character or you will find everyone one-shooting you. If you visually dislike the gear, well, shame on you, you will still have to buy it and use it if you want to survive. I had great hopes for this game before the release, but now I am just uninstalling it. If they implement servers where gear don’t affect gameplay and it’s only used for cosmetics, then I’ll be back. Hope Codebrush realize the greedy mistake they made. ",
            "review_score": "-1"
        },
        {
            "review_text": "I've played this game since beta way back and now when i got back into this game with its new model and review i feel like this game could have had so much potential to make a decent brawling f2p game. The animations and skins are awesome. i love the combos and various playstyle each character has to offer. so overall if they change a few things in this game ( example: matchmaking, price change on heros ' too expensive' and just work out a few things in the game it could rise up again and possibly make me want to play this game more.",
            "review_score": "-1"
        },
        {
            "review_text": "This game blow you can tell its pay to win just by looking at the items and the fighting system is clunky.",
            "review_score": "-1"
        },
        {
            "review_text": "Great for competitive persons. It's like DN in a way. I hope this game comeback..",
            "review_score": "1"
        },
        {
            "review_text": "Since the DEV have cash out the game, the game right now is unplayable, since there are a lot of hacker.",
            "review_score": "-1"
        },
        {
            "review_text": "I know this is great. But it not my fighting taste.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome fighting game. But its hard to win if the server doesn't have different by level. just 1 - 30, its very hard to a newbie character.",
            "review_score": "-1"
        },
        {
            "review_text": "Very Good Games !!",
            "review_score": "1"
        },
        {
            "review_text": "This game had a lot of potential at the time. It's fun, but the thing that everyone seemed to have complained about Pay to Win (P2W). I started to think this is true. When they had the old starter kit you started with all this armory that gave you an upper edge. I understand it's something that gives the player something for being supportive, but it didn't need to give the player so much to start with. There were two ways to pay for armor real money so you can buy tokens, and in-game money that you get for each match depending how well you did. Tokens had the potential to get you the item sooner that the in-game money. That was something I thought was pretty good.  The servers were possibly the worse of this game. For me living in the western part of the US I can still get pings in most games under 60, but when it comes to this game. I'm lucky enough to get one that is remotely close to 70. The servers had the worst ping reading and made it almost impossible to play.   The gameplay is really simple. Move click click dodge dodge. Just a regular beatem up style game, but there's one flaw to this. The range attacks. I can see that they wanted to touch on all aspects and classes as much as possible, but when it came to players using just one button it made the game completely boring. I don't remember that Ice girl's name I used, but her and very very few characters were actually somewhat balanced. The characters that can go strictly range made the game boring since you move as fast going backwards as you do going forward. The characters that had a roundhouse attack which I think only one did at the time I played players abused it alot. Abilities like that needed to have a strict cooldown so players didn't resort to just that.   The game has a lot of unique characters and some I never thought I would see. The game kept you wanting to play, but due to it's lack of support from the developers after seeing how things were getting abused and how servers didn't meet up to par with ping. I'm not kidding, more than 90% of the servers they had weren't even populated so there was no need for them. Certain Characters overpowered the other characters. Players relied on one move to win them the game with no mix ups. I spent a lot of time in the training sessions for every character before picking my first one and let me tell you Archeblade players:   Every character has combos if you can't land them then try to approach them differently.   My Ice character was a short melee player which can dish out a lot of damage. I spent time on her the most and won a lot of matches against players who were supposedly title 'Pay 2 Win players' It's a challenge but it's not impossible.   Gearing up wasn't really too bad. Obtaining gear required 2 steps.  1) Get to the level required to unlock it 2) Have enough money to purchase it (Tokens or In-game)  Step one didn't have a problem to it. It was just the money part. Matches didn't give you a lot even if you win the match. This was a flaw mistake made by developers which I think was something they thought of to get players to buy the starter kit rather than waste the time getting beat up from other players who were higher skilled than them. That's not how you draw a crowd to play your game. It's like putting a band-aid on the player for them giving you $20 and holding their hand through everything. That doesn't teach the player only gives them the thought that if they just cough up the money they can have whatever they want.  Gaming isn't like that. Call of Duty, Halo, Super Smash Bros. All these games have something unique and every player new or veteran have to learn new things bring up new tactics against other players. Archeblade had that going for it, but the way you obtain gear from not getting enough money and players just having enough and buy the kit gives them the wrong mind set. As a developer you should listen to your community, but not to a point where you give them everything they want.  This brings up another argument. As developers you guys refused to listen to your community. Even when there was video evidence over unbalanced content. That's what disappointed me the most getting shut out by the people who brought a great game and watching it fall with the team. I may not be a developer, but I know that if you screw up on a game and not listen to your community you are going to start losing them one after another.  The team has then separated and they are under a new team. Whether they still have license to Archeblade is beyond me. I recommend this game to give it a chance, but I don't recommend to those who believe in Pay to Win parts of games.   Developers if you read this I want you to understand I played this game for 5 months even though my time playing it over all is 10 hours that was because I was trying to find matches to play in each day and server pings were really bad, and the reason Archeblade failed wasn't because of financial reasons it was because you guys didn't want to listen to us. As an Archeblade player I say this.   You guys still have the potential to bring this game back. I pointed out 3 flaws in your game that I think caused this game to fail. What you guys do from this point on is up to you. I have put my review in and I'm not one of those high end groups like IGN that put a review only a day after a game's release. I give it a chance to show it's true colors over time. I gave you a fair chance just like the other developers.",
            "review_score": "1"
        },
        {
            "review_text": "Wow what a committed development team. Into the trash it goes.",
            "review_score": "-1"
        },
        {
            "review_text": "Solid game. Decent multiplayer beat em up. Nice easy controls which puts more empathsis on timing and execution.  Good character designs and the game is playable even as a free to play player.  Despite the occasional empty servers and the loss of support; the current state of the game is very much playable and still enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game tbh. Really good fighting system and very well made champions/characters or whatever u want to call them. like the shop thingy :)",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, and takes little to no time to join and play a game.",
            "review_score": "1"
        },
        {
            "review_text": "No anti hack at all full of hackers unbalanced no point even playing this game even though it is only a small game it is a waste of disk space a waste of your time. If this game was not full of so many noobs/hackers it would be fun unfortuantly it is swarmed with hacking noobs who take a good game and ♥♥♥♥ people off in it...",
            "review_score": "-1"
        },
        {
            "review_text": "It's got Fytan and boobs",
            "review_score": "1"
        },
        {
            "review_text": "A really great game. If you are a fan of fighting games like Streetfighter or Tekken, then this is a must-play. Getting great at the mechanics and controls is hard at first but once you get used to it, it's easy. You can play with a team or a freestyle battle where you can basically bash everyone's head off!",
            "review_score": "1"
        },
        {
            "review_text": "Really Fun. It's compleatly skill based so no one has any in-game advantages.",
            "review_score": "1"
        },
        {
            "review_text": "PLEASE NOTE: This review does not cover actual gameplay, nor is it meant to be taken as a legitimate critique of the functionality or entertainment/replay value of Archeblade.  All the female characters have skimpy armor and high heels and terrible voice actors and it was too painful to continue.  /uninstall",
            "review_score": "-1"
        },
        {
            "review_text": "The game is very much based on pay2win and unfair gameplay. One side will always single-handedly destroy your team without much of a dent in their HP. Most of the time the opposing team will always have one hitters and you will never have a chance at suceeding.",
            "review_score": "-1"
        },
        {
            "review_text": "this game so collll realy make me loved this game",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun; a lot of moves to explore. Not pay to win. Competitive. Satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a great feel as you battle other players in multiple maps to the death!",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is pretty solid and the art is nice. It has a nice mix of moba and 3D fighter. The only downside is the matchmaking aspect. You have to manually find a server to play on which can get annoying. Other than that, the game is great and I would reccomend giving it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Meh..This game is an online third person brawler, which I have no problem with. It's just that as it stands there's nothing really to make me want to go back with its skill cap, store, character unlocks, etc. If you like third person brawlers, Give this game a shot and see for yourself.",
            "review_score": "-1"
        },
        {
            "review_text": "A 3rd person beat em up/shooter:if u play with the bow/But it is very fun to play,but its lagey for me Note:i like turtles",
            "review_score": "1"
        },
        {
            "review_text": "I Love This Game",
            "review_score": "1"
        },
        {
            "review_text": "PLEASE NOTE: This review does not cover actual gameplay, nor is it meant to be taken as a legitimate critique of the functionality or entertainment/replay value of Archeblade.  All the female characters have skimpy armor and high heels and terrible voice actors and it was too painful to continue.  /uninstall",
            "review_score": "-1"
        },
        {
            "review_text": "..",
            "review_score": "1"
        },
        {
            "review_text": "This game had promise, and for what it is, its a fine game. But for several other reasons it ends up on the played but never revisited list.   No progress, no charecter building. No campaign or singleplayer or coop. Coop being the biggest sin for me, i need a game i can play with friends and have fun while doing it. This does not deliver on a lot of the factors i believe makes a successful game.  And as someone else mentioned, this stopped all its support and development?  To sum it up, it has decent unbalanced action pvp. thats about what i can say about it.",
            "review_score": "-1"
        },
        {
            "review_text": "Played it for months till the launcher decided to stop updating 1 single file so now when ever i wanna play i have to delete that file and reinstall yea for well built games?",
            "review_score": "-1"
        },
        {
            "review_text": "this game it's cool   i like it its not bad",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun by yourself or with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "It's a tad unbalanced, the gameplay is choppy, the rank system and shop currency is some of the biggest pile of ♥♥♥♥♥♥♥t you'll ever see in a f2p game...  So why am I having fun?",
            "review_score": "1"
        },
        {
            "review_text": "This game somehow ended up in my games library and the hours keep going up even after i deleted it. I don't ever want to play it or see it again, but it won't go away.",
            "review_score": "-1"
        },
        {
            "review_text": "Well worth a try, I don't do PVP games, but what I tried was fun. find a hero that suits you and you're good to go!",
            "review_score": "1"
        },
        {
            "review_text": "This game is Amazing, shut up and take my money. =D",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the most enjoyable games them the devs stopped supporting it.the items have no stat and theres no real game for actually playing its just fight after fight its extremly enjoyable just a shame.",
            "review_score": "1"
        },
        {
            "review_text": "The game has great action and is very fun to play. I like it and I do recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "yes great game",
            "review_score": "1"
        },
        {
            "review_text": "The game is simple and easy enough to understand, I don't like how you have to unlock characters through either hours of gameplay or throwing money at the game though. However I admit, none of the characters are bad, just different playstyles so you always have a chance to hold your own against cash players and even win. Aside from unlocking characters money only unlocks skins (change appearence) for them, thus there is no pay-to-win since everything can be gained for free or only has a cosmetic effect on the game. I say give it a chance at least.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, some characters have a bit higher learning curve than others but still enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing I really reccommend it to you. Download it if you like third person fighters.",
            "review_score": "1"
        },
        {
            "review_text": "Ping as high as the Space Needle; slippery, imprecise hitboxes; exploitable characters; terrible performance; and, as the icing of the cake, P2W elements, such as the cash-only cosmetic skins that give stat boosts. Take a pass on this one - it wasn't worth the time.",
            "review_score": "-1"
        },
        {
            "review_text": "Archeblade is a Free-To-Play 3rd person multiplayer action game that tries to pull off the idea of a multiplayer Devil May Cry, does it succeed? Not exactly. The concept of the game is to play in team vs team multiplayer matches and buy new characters with your in-game currency (like League of Legends for example) And the modes consist of your standard Deathmatch modes and Point Domination modes. The characters vary from strong brutes to fast assassin types and each character has several moves to choose from. The problem with the game though isnt so much the concept as it is the execution, since it suffers from performance issues, confusing interfaces and flat out boring combat. While it does have some good things going for it, it has an overall and overwhelming blandness to it that prevents it from reaching a wider audience.  THE GOOD: &gt; Character designs are interesting &gt; Moves look cool &gt; Can sometimes be fun &gt; Scantily clad female characters are R34 waiting to happen  THE BAD: &gt; Latency &amp; Performance issues &gt; Lack of players &gt; Absolutely no feeling of weapon impact, and no hitsounds either. &gt; Gravity has characters jumping as if they were on the moon. &gt; Characters take longer to unlock than youre probably willing to play. &gt; Unshakable feeling of dullness and boredom &gt; Developers supposedly abandoned the game. &gt; TERRIBLE DIALOGUE &amp; VOICE ACTING.  THE UGLY: Not even the half-naked elf-girl wizards of this game can save it. And i think that was this games trump card.  BOTTOM LINE: Unless you REALLY have nothing else to play, there are SO many better options. I cant imagine anyone playing this for too long unless youre a desperate anime fan or new to computer games.  Not recommended 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game seems very limited in scope. I can't see myself playing it much at all which is a shame because the character design and animations are not bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool game sadly I suck at it lol",
            "review_score": "1"
        },
        {
            "review_text": "Arche Blade - the best free 3D multiplayer fighting game !",
            "review_score": "1"
        },
        {
            "review_text": "This was a good game, but it fell down because it was abandoned.    the same thing about Alien Swarm, such a shame :&lt;",
            "review_score": "1"
        },
        {
            "review_text": "Personally I enjoyed the game when I first launched it, but you have to realize the community consist of a variety of people, the game has a ton of issues including the hacks that people use in the game, no one is going to play the game if they can't enjoy the game...its sad that ab has took the downfall tbh, I've wasted many hours on this game and there is always that one person who has no skill and clearly can't function properly. If you'd like to waste your time witht he ab community feel free.",
            "review_score": "-1"
        },
        {
            "review_text": "many players are stupid spamming one combo.",
            "review_score": "-1"
        },
        {
            "review_text": "really interesting",
            "review_score": "1"
        },
        {
            "review_text": "it is amazingly good machanics and fighting styles i recomend it ",
            "review_score": "1"
        },
        {
            "review_text": "Trash. Obsurdly clunky gameplay that makes trying to fight opponents a fight in itself. If you made the mistake of playing Fist of the North Star by Koei, you know exactly what this is like.  ",
            "review_score": "-1"
        },
        {
            "review_text": "i'd like to see controller support for it . but very fun game",
            "review_score": "1"
        },
        {
            "review_text": "an extreamly fun game",
            "review_score": "1"
        },
        {
            "review_text": "Yea this game is awesome! Cant wait for it to be finish.",
            "review_score": "1"
        },
        {
            "review_text": "Wesome addicting game",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best free to play games on steam in my opinion so try it out !!!!",
            "review_score": "1"
        },
        {
            "review_text": "try this",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty decent for a free to play game, although you can purchase characters and skins I would recommend against it. The gameplay is fun once you get the basics. Treat it like you would in Dark Souls... Block and wait for your moment, or die die die and die.",
            "review_score": "1"
        },
        {
            "review_text": "Started playing just last night, been in for ~8h. I LOVE THIS GAME. I look forward to seeing it grow. :D",
            "review_score": "1"
        },
        {
            "review_text": "Best game with its Gameplay and the anime Styles Plus its Free With Extra Features Not bad for thoes who like compitative game at the games where you can choose different Classes and start fighting in the arena with no items or levels earning or states. But not Updated For a Long time",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, if you like fast action hot girls and anime then your going to love this! I highly recommend this game if your into this kind of stuff.",
            "review_score": "1"
        },
        {
            "review_text": "While there aren’t that many champions, this game is amazing. It is fast paced and the different skills for each champion are quite fun. It is unfortunate that they are having to shut down the official servers, but you can play on the unofficial servers. I wish the best of luck to the developers and hope we will eventually see updates in the future once they get their financial situation sorted out.",
            "review_score": "1"
        },
        {
            "review_text": "this game 10 out 10",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty addicting, definately need a better tutorial system to learn the controls but all in all it's a lot of fun! Was slightly confused at first and always died but i started to get the hang of it and after my first kill, well let's say i've gotten better ;] Good game! still in develpment can tell but it's still addicting and fun once you get the hang of it!",
            "review_score": "1"
        },
        {
            "review_text": "this game sucks ignor dont install",
            "review_score": "-1"
        },
        {
            "review_text": "Usually, as a game goer, I dislike games that are fully PvP online. However, this provides, an immense amount of fun as well as intense gameplay, every game providing a unique challenge. Character selection, I was incredibly happy with the character roster, with so many different characters to choose from it makes the game have an immense variation factor. All over I say this game is 9.5/10!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, wish my computer could run it at full graphics.",
            "review_score": "1"
        },
        {
            "review_text": "It's really good and competitive! They closed the shop but that doesn't affect the gameplay...",
            "review_score": "1"
        },
        {
            "review_text": "cool, 3rd person... 861.1mb download... we're u can attack people xD with bows/blades/swords/hammers or last but not least powers.. it's quite cool... =D",
            "review_score": "1"
        },
        {
            "review_text": "No anti hack at all full of hackers unbalanced no point even playing this game even though it is only a small game it is a waste of disk space a waste of your time. If this game was not full of so many noobs/hackers it would be fun unfortuantly it is swarmed with hacking noobs who take a good game and ♥♥♥♥ people off in it...",
            "review_score": "-1"
        },
        {
            "review_text": "uninstalled as soon as i realised its P2W.",
            "review_score": "-1"
        },
        {
            "review_text": "'I am survived' 11/10",
            "review_score": "1"
        },
        {
            "review_text": "When I decided to download the game and try to play it with a friend of mine, most of the reviews were positive. They aren't now. This game is boring at best and broken at worst. Just try to join a game and you'll see just how broken it is. If after you can't join a game you want to just test out the mechanics in training and see just how bland and uninteresting the combat is.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the best game I have ever played. :)",
            "review_score": "1"
        },
        {
            "review_text": "wish more peeps played this",
            "review_score": "1"
        },
        {
            "review_text": "don't really like it, Newer people dont have much of a chance against people who are high leveled/pay for items. it may be free but when I played it seemed more of a pay to win",
            "review_score": "1"
        },
        {
            "review_text": "In the universe of RPG action games, I'd rate this as one of the best proposition of VFM and VFT (value for moolah and value for time-played).",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, specially cuz its Free To Play, I really like every character in the game...well I pretty much like EVERYTHING except two little things: 1- Seon's Final combo attack saying 'Quick Deposit!'...I find that annoying 2- Reonah is WAAAAAAAAAAAAAAY TOO OVERPOWERED, she can almost kill you with one hit, and has an ability that breaks your WHOLE SHIELD APART!  Besides from that, I really recommend",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game",
            "review_score": "1"
        },
        {
            "review_text": "terrible game, crashes alot and its such a pay to win it hurts.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is crap. The only redeeming quality of this game is the art style, and even then the game is saturated with ♥♥♥♥♥ characters which is admittedly what pulled me in in the first place. There is zero depth to the fighting. Blocking is absolutely pointless because you don't have enough time to even counter attack after blocking an enemies combo. Basicaly all you have to do is mash left click to get kills. It's almost impossible to get out of hit stun and you can be permanently stunned or juggled with only two enemies attacking you.  If you like mindles mash-fest games with zero skill curve and sexy characters models, then this is the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is super cool ",
            "review_score": "1"
        },
        {
            "review_text": "Really nice F2P game with good gameplay, nice graphics, nice butts and boobs, shame that it's not very populated and doesnt receive any updates or patches. Needs a bit more work IMO.   6/10",
            "review_score": "1"
        },
        {
            "review_text": "The game is pretty fun until you play against players that are level 20-30 which they know pretty well how to spam one move that can hit fast. Yes you may see other review saying alot of 'hero's' are OP(over powered) but, if you have played this game when it came out, you will see each hero has stats on att,def,speed, etc. some are way to powerful but! they are slow on attacks. Also if you see reviews that say this game is a 'pay 2 win' well its not, the only thing you can but with real money is either all heros's or all hero's and skins and thats it!  In the end, the game is really fun beat'em up game and its not a smash button type. I'd give this a 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely postively fantastic game, even in it's early state. My only problem is the lack of controller compatibility. I play on a laptop and yet to have gotten a mouse for it yet, but I DO have a controller, and I really wish that i could play with my prized logitech controller, but i can't",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good action game if you're into games that require skills. no targeting system, aim yourself. Very fun to play even just casually. ",
            "review_score": "1"
        },
        {
            "review_text": "not very good but enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "Archeblade is th best game to play if you're trying to past time.",
            "review_score": "1"
        },
        {
            "review_text": "Archeblade is a decent game. Tons of action, hours of fun so far. Recommend playing.",
            "review_score": "1"
        },
        {
            "review_text": "Good action game :) , Very fast paced",
            "review_score": "1"
        },
        {
            "review_text": "its good",
            "review_score": "1"
        },
        {
            "review_text": "A great 3D fighting game with beautiful/handsome characters. Do I need to say more? I didn't think so.",
            "review_score": "1"
        },
        {
            "review_text": "Atcheblade is an unique fighting game for pc, the controls are a little messy on keyboard and mouse, and have a little problem with the pad too (like no pad compatibility for the menu) , but for a game still in development it's pretty well done and playable , i see potential, the engine result a bit heavy for my pc's but its not a problem, the sound effects are nice, the main theme is pretty awesome , but the thing who brings my entusiasm down is that.. some character are extreme overpower , it looks like that the locked character (the one to purchase) will be even more op, i hate the fact that you have to pay for had character and skins, i'd prefer unlock them doing some quest in game , like ' kill 50 players with etc' but for a free to play it's understeandable.. i think.. not the skins but the other ch.  So what we got here.  -A game still in develop who looks like going ti the rigth way.  -Can't tell about the visual , from the immage and the trailer looks smooth and clean, but in game it's bot so affascinating,( and i play on the minus setting possible)  -Sound and effects pretty nice  -Controlls not so easy to get used to on Pc and playable but not perfect on Pad   -Fun fact its absolutly present, even if you dont like the graphical styles  -The worst parts of the game are the ov characters and the extreme repetitive gamemodes",
            "review_score": "1"
        },
        {
            "review_text": "Meh its an alrite game with good mechanics i like it kinda",
            "review_score": "1"
        },
        {
            "review_text": "Just plain fun, dont expect anything too serious. But if you like cool characters with uniquie abilities beating the ♥♥♥♥ out of eachother deathmatch and team co-op style, then you will like this game. Probably wouldnt hurt if you liked anime either lol",
            "review_score": "1"
        },
        {
            "review_text": "Alex is a basic ♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "very nice game. RECOMMENDED!!! ",
            "review_score": "1"
        },
        {
            "review_text": "Really Fun. It's compleatly skill based so no one has any in-game advantages.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely dreadful, an unpolished turd with some nice graphics.",
            "review_score": "1"
        },
        {
            "review_text": "defintley a good game. very little microtransactions (mainly for cosmetics), the only problem i really have with the game is the chat and some characters are way to over powered.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most fun free-to-play game on steam that I've tried and I've tried a lot. There's no paywalls or anything like that either.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun, although some of the people can be really overpowered",
            "review_score": "1"
        },
        {
            "review_text": "Best game with its Gameplay and the anime Styles Plus its Free With Extra Features Not bad for thoes who like compitative game at the games where you can choose different Classes and start fighting in the arena with no items or levels earning or states. But not Updated For a Long time",
            "review_score": "1"
        },
        {
            "review_text": "I am sorry, where does this game have co-op game mode?  It doesn't. As a PvP multiplayer game it is fun on a short term... unfortunatly for 'it' there are too many games like this around.  And again: Playing together with other players to hunt down more players does not make it a co-op game. At all.",
            "review_score": "-1"
        },
        {
            "review_text": "By far the best game i have ever played! :D",
            "review_score": "1"
        },
        {
            "review_text": "got the game, launched it. nad apparently im banned from it. PLZ TELL ME WHY",
            "review_score": "-1"
        },
        {
            "review_text": "Really i love this game but im guessing the developers didnt have a girlfriend play this you will see what i mean i have to spend so much money just for something to cover my character",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "Its too cool to play ",
            "review_score": "1"
        },
        {
            "review_text": "While the game certainly has it's moments of undenyable lag. It's theme is pretty unique. If I have any complaints its that every character short of maybe 2 has 1 combo chain that far surpasses anything else you will use with them. Aside from the nitpicking, gameplay is great, stages are great, characters are....relativly balanced...It's one of those instances where everyone is op, therefor everything is balanced. The only other game I've seen this executed effectivly is Dota2, and since this is nowhere near as professionally made, that definetly says something.  Some will like it, some wont, in the end I recommend you at least give Archblade a try.",
            "review_score": "1"
        },
        {
            "review_text": "The game is actually great it really needs more gameplay modes all i see is death matches it be more fun if there was alike (monster attacks,raids,defend the castle..or something,escape enemy traps or stuff....ANYTHING ALIKE) and it be awesome if they fix all those crashes but the game is still great",
            "review_score": "1"
        },
        {
            "review_text": "good, fun, and, free :) but characters seems imba :( 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game needs A LOT of work.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool Amazing But Sometimes it goes Boring",
            "review_score": "1"
        },
        {
            "review_text": "Usually, as a game goer, I dislike games that are fully PvP online. However, this provides, an immense amount of fun as well as intense gameplay, every game providing a unique challenge. Character selection, I was incredibly happy with the character roster, with so many different characters to choose from it makes the game have an immense variation factor. All over I say this game is 9.5/10!",
            "review_score": "1"
        },
        {
            "review_text": "There aren't many arena brawlers that make it out of South Korea, so I was pleasantly surprised to find that this game was not hilariously broken as most of them tend to be.  It's not super exciting or anything, but the distinct lack of Pay2Win means this ends up fairly satisfying. Have fun trying to figure out how to abuse the Assist system as Cezanne, that's what I did.",
            "review_score": "1"
        },
        {
            "review_text": "I don't really like this game, but idk",
            "review_score": "-1"
        },
        {
            "review_text": "I recomend this game because its amazing! Everything about is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "one of the best online games . should be in your arsenal .",
            "review_score": "1"
        },
        {
            "review_text": "great game :))",
            "review_score": "1"
        },
        {
            "review_text": "Meh its an alrite game with good mechanics i like it kinda",
            "review_score": "1"
        },
        {
            "review_text": "its easy if you having problems with this games .. rules simples:  1.download 2.play 3.SHOW EM NO MERCY 3:D",
            "review_score": "1"
        },
        {
            "review_text": "TOO MANY BOOBS AND I LOVE IT............. 10/10  IF YOU LIKE BOOBS PLZ PLAY....... ",
            "review_score": "1"
        },
        {
            "review_text": "It's slow and boring with no real skill cap or depth to it. There are better F2P games that play like this with better GunZ if you catch my drift",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is amazing",
            "review_score": "1"
        },
        {
            "review_text": "It's okay i guess",
            "review_score": "1"
        },
        {
            "review_text": "Really fun to play &amp; the characters are unique (but limited)! ",
            "review_score": "1"
        },
        {
            "review_text": "I miss you.  So much.",
            "review_score": "1"
        },
        {
            "review_text": "the game is pretty much dead with no update, the devs insulted players with rude words and pretty much abandoned the ship, many hackers already broke the game up so it's just matters of time before the game removed, it has so much potential to be good but the devs messed up big time",
            "review_score": "-1"
        },
        {
            "review_text": "this game it's cool   i like it its not bad",
            "review_score": "1"
        },
        {
            "review_text": "ArcheBlade is really great HOT. Same of Dota 2, LOL or any of the hots... Everyone can play this game and I really recommend this game. But only one bad: not too many Heroes.",
            "review_score": "1"
        },
        {
            "review_text": "Game needs to be rebalanced, and fix the way the servers are set up.",
            "review_score": "-1"
        },
        {
            "review_text": "&gt;Was combo'd until death by Renni   &gt;Play as an op tank woman and never die because heals and shields  &gt;Play as a sexy succubus and only care about the sexy succubus  &gt;Play as a big buff black priest and heal 4 days  &gt;Play as a black accountant with big boobs and spam 2 win  &gt;You think spam doesn't exist in an actual online fighting game? IT DOES.   &gt;Get ♥♥♥♥ed by people who countlessly spam right click.  &gt;No P2W but Pay to look like a god.   This game would have been really good if it was never abadoned tbh. Still worth the try. ",
            "review_score": "1"
        },
        {
            "review_text": "Anemic server creation options, lack of characters or combos, and a rather annoying control system make ArcheBlade a dissapointing addition to the fighting game roster.",
            "review_score": "-1"
        },
        {
            "review_text": "The game has been abandoned... The only rooms available to play in are for levels 1-100. If you are new to the game, you have to play in those rooms. The problem is, you get one shotted and you can't do anything about it. If it was still active, it would be a great game.",
            "review_score": "-1"
        },
        {
            "review_text": "Much boobs",
            "review_score": "1"
        },
        {
            "review_text": "WARNING!!: SEA REGION NOT RECOMMENDED TO PLAY THESE GAMES!",
            "review_score": "-1"
        },
        {
            "review_text": "'All hail for my lord!' 'Just got out of the shower~' 'Icecream forever!' 'Quick deposit!'",
            "review_score": "1"
        },
        {
            "review_text": "Check this game out yo!",
            "review_score": "1"
        },
        {
            "review_text": "I'm dissapointed that this game lables itself as a fighter, considering the majority of the commuinity just sits in lobbies and chats about how bad the free-to-play users are. Couple this with the horrific netcode and you've got a ♥♥♥♥♥andwhich called archeblade.",
            "review_score": "-1"
        },
        {
            "review_text": "You will love this game. You will love it enough to completely loathe it. Here's why.  I've been playing Arche Blade for a few hours now, and when I first picked it up and started playing the tutorial and training mode, I was absolutely immersed in the action combat system. It's something that will remind you both of Dark Souls and Smite.  The problem is that it's also got some elements of an early 2000's first person shooter- that is, the games modes are centered on deathmatches and point control, which, don't get me wrong, is incredibly fun. But only for so long. I find myself thinking that this game would be a fantastic action game for the next generation of F2P multiplayer battle games. If you've heard of Gigantic (an upcoming action game by Motiga), it'll feel something like that. If you haven't heard of it, definitely look it up.  The game also uses an old school server list system instead of the now integral 'Play Now' button you find in most mobas and team fighting games today. This isn't necessarily an issue, but it lends itself to the problems that result from server lists. This would include having too many players, not enough players, not being matched with players by ELO and instead just hoping you get a good match, etc.  The characters are balanced enough to play the game, but you'll definitely run into some games that you're raving about how OP the healer character can be. (Wtf!?).  You can also play the same character as other people on your team- something you can't do in MOBAs for this exact reason: your team comp will either become completely OP, or complete trash. You can modify your server to remove this feature, but most servers don't do so.   Oh, and I forgot just one thing. There are instances in the game where a skilled player can fire off a combo to knock you up (which prevents you from doing anything to attack or defend yourself) and repeatedly *keep* knocking you up without ever getting a chance to save yourself. It's extremely annoying and unfair.   This could easily be an MLG E-Sport to contend with the next generation of team based fighters. But the devs have basically left it as it is and refused to update it for months at a time. That's why I can't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Meh eh sure whatever meh eh",
            "review_score": "1"
        },
        {
            "review_text": "you can't play as the dude with the big sword because your attacks don't register half the time and the other half they get stopped because some one sneezed in your genral direction",
            "review_score": "-1"
        },
        {
            "review_text": "It's see nice out!!! ",
            "review_score": "1"
        },
        {
            "review_text": "This game already dead ^_^",
            "review_score": "1"
        },
        {
            "review_text": "It's alright I guess.",
            "review_score": "1"
        },
        {
            "review_text": "installed this because of bewbs",
            "review_score": "1"
        },
        {
            "review_text": "This game is so awesome, really impressive for its stunning characters and gameplay. However, this game should add a game mode that we can choose to fight against bots instead of real players around the world. For this we will not only experience a fast loading in game but will also can play everytime without any amount players requirement for joining a fight.",
            "review_score": "1"
        },
        {
            "review_text": "Good game but don't play it. No one that isn't like pro player.",
            "review_score": "1"
        },
        {
            "review_text": "So Archeblade is a great game sadly the company who made it moved on, but many people still play it and most of them are english. :D   #hailtheskeletonking  And i mean you can be you can buy everything in the game with a pack they have for 10 bucks so yeah .-.  P.S Boobs... :)",
            "review_score": "1"
        }
    ]
}