{
    "app_id": 207250,
    "name": "Cubemen",
    "release_date": "2012-03-16",
    "developer": [
        "3 Sprockets"
    ],
    "publisher": [
        "3 Sprockets "
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Tower Defense",
        "Indie"
    ],
    "achievements": 44,
    "positive_ratings": 347,
    "negative_ratings": 134,
    "price": 2.79,
    "description": "Just Updated! Version 1.1 now has 6 New online Mayhem levels, Character Customization, 35 Defense levels, 25 Skirmish levels, and more!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/207250/header.jpg?t=1447355406",
    "minimum_requirements": "OS:Windows XP, or later                 Processor: Intel or AMD                 Memory:1GB                 Hard Disk Space: 120MB                                 Video Card: Nvidia 8000, Radeon HD3000                 DirectX®:9.0c                  Sound:any",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "In my opinion,  Cubemen  is a ludicrously underrated game. It is incredibly simple in concept but it is executed incredibly well making it a huge amount of fun, the really simple but highly polished graphics also give this game a great charm to it.    Cubemen  is a blend of Tower Defense and Real Time Strategy, something that can be very difficult to balance but  Cubemen  does it relatively well. There are a nice variety of units to chose from and an eclectic selection of official &amp; community-made maps that give this game a lot of playability in both single and multiplayer games, this is a great game to play either alone or with friends. Another thing that I love about  Cubemen  along with it's simplistic but great graphics is the brilliant soundtrack, it may be minimal in variety and some tracks sound like remixes of others but there are some really good pieces that fit perfectly into the games art style.   The hardest thing to achieve in any Strategy or Tower Defense game is balance, and even though  Cubemen  does it fairly well, it also has some unfortunate flaws; they aren't necessarily global flaws as the problems only seem to occur on certain maps, but the issue is still there. This is the fact that there is one particular strategy that works 95% of the time said maps, mainly some of the earlier ones but is also prominent on the later/more advanced maps too. If you rush the enemy spawning towers with basic infantry early on, it can be incredibly easy to dominate the rest of the game by pumping more and more infantry to that location. Like I said, this doesn't happen on  all  maps, just a handful, it is also my only real problem with this game. Another flaw is that some infantry can feel fairly redundant such as Freds or Sids whereas other infantry like Grills, Flints and Rickys can dominate the grid most of the time in large numbers. This is again the balancing issue that lurks in these kind of games, it's a very difficult thing to overcome but non-the-less, it is nice to have a selection of units to chose from, especially since it doesn't clog up the interface and use minimal space.   So as this game is fairly cheap and is practically given away during sales, I would suggest trying it out if you're a fan of Tower Defense or RTS games. I believe some of the reviews that this game has recieved are relatively harsh and undeserved, sure, it has some issues but what game doesn't? This game and it's sequel are a lot of fun so if it's going for cheap or is in a bundle, I highly recommend it! I'm looking at you, my Command &amp; Conquer buddies.  Also, for the record, those of you that call this game a  'Minecraft ripoff'  are clearly morons.",
            "review_score": "1"
        },
        {
            "review_text": "Now let me be honest here. I am not the best gamer when it comes to strategy, but even with that in mind, this game is bloody hard. Before I get to that, I will say that the graphics and music of this game are fun, and enjoyable. But; the gameplay is slightly unbalanced, call me a whiner, but in the early levels of the game, grenedeirs (excuse my spelling) Totally out-gun you. You really don't stand a chance, however, the freeplay matches are actually somewhat enjoyable.  On to the multip- wait, what multiplayer? No one plays this game online, really, no one. So I wouldn't bother.   The level creator is fun, and is well deisgned, I would reccomend making some of your own levels for gameplay, although no one is going to play them online, seeing my above statement on multiplayer.  Overall, the game is fun and challenging, to good generals this would be a fun and replayable game, I however, out of personal taste, don't like the game all to much.  Overall 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game that you can spend time trying to beat your friend's score with. The stategy element involves buying block people which represent different classes like grunts with rifles, flame-throwers, morters, grenaders, lasers, snipers and so on. The idea of the game is to win at a war of attrition by beating the enemy's waves in a tower-defence kind of way.  It's a fun little game and fun to compare your score to other's online but beyond that I don't know much.",
            "review_score": "1"
        },
        {
            "review_text": "This tower defense is more like Age of Empires in a sense that you have troops to command. You place them in spots on the map and they act like towers you can also move them.  Pros  Easy to learn  Alot of game modes  cubemen customizer  level editor  level themes  Age of empires like gameplay  Cons  achevements are hard to get",
            "review_score": "1"
        },
        {
            "review_text": "I get very high impact sexual violence from this game.",
            "review_score": "1"
        },
        {
            "review_text": "Super simplistic  Highly difficult Reccomended",
            "review_score": "1"
        },
        {
            "review_text": "Um...no. It's very slow and repetitive, the gameplay is very limited and it's predictable. I understand it's not meant to be a big game, but there's no story, it looks terrible and I honestly couldn't bear to play it any more than I already have. It was a mistake buying it and I wish I hadn't. Don't make the same mistake",
            "review_score": "-1"
        },
        {
            "review_text": "Cubemen has earned the coveted status of being one of just 4 games that is hidden in my games library. Need I say more?",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game, great graphic and improvement!",
            "review_score": "1"
        },
        {
            "review_text": "I got this as part of the Humble Bundle a while back. The only reason I'm not absolutely furious about this game being in my library is because I actually do enjoy a few of the other games I got in that bundle. This game is repetitive. Every level follows the exact same idea, and after about the very first one, it just gets tedious. This game is incredibly difficult, and not in a good way. The enemies attack the men that you place throught the level. This could be seen as a good thing, if not every dingle ♥♥♥♥♥♥♥ one of them fired on the same guy at the same time. In the time it takes you to be able to destroy a single enemy, pretty much every one of your towers has been destroyed, and you sure as hell don't have the money to replace them.",
            "review_score": "-1"
        },
        {
            "review_text": "I got Smuckified by my friend 11/8",
            "review_score": "1"
        },
        {
            "review_text": "Can't remember why i bought it 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Just ♥♥♥♥ing no, pls save your money",
            "review_score": "-1"
        },
        {
            "review_text": "Get the second one. This game would be recommended, if it weren't for the fact that the second one is the same thing but improved in so many areas.  (8/10 I guess? Shouldn't really matter)",
            "review_score": "-1"
        },
        {
            "review_text": "AWESOME! I love this game, it's a perfect mix of TD and RTS.",
            "review_score": "1"
        },
        {
            "review_text": "load of ♥♥♥♥ worst buy i ever made",
            "review_score": "-1"
        },
        {
            "review_text": "Bretty gud. I mean it's no masterpiece but it's really something to try out. It's not expensive and it's really fun.",
            "review_score": "1"
        },
        {
            "review_text": "A simple Tower Defense game with fun core gameplay and clean aesthetics.  Unfortunately, TD games are not to my taste.",
            "review_score": "1"
        },
        {
            "review_text": "Bretty gud. I mean it's no masterpiece but it's really something to try out. It's not expensive and it's really fun.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game. You can't get too many hours out of it, but if you grab it while on sale with a friend it has some entertainemnt value.",
            "review_score": "1"
        },
        {
            "review_text": "HHAHAHA Well good fun, AI seems a little simple....",
            "review_score": "1"
        },
        {
            "review_text": "A fun little strategy game -&gt; Which is good for 10-30mins play and if you want – more. I spent many hours playing it and I recommend it to everyone who wants a little shooting and strategy :)))",
            "review_score": "1"
        },
        {
            "review_text": "This game has no balance. It's basically a game you play when you need your mood ruined. The computer doesn't have the resource problems you suffer at every turn, his units hit things better and generally don't crumble away before being useful.  In short, don't buy this game. The concept itself isn't great, and the horrible, horrible gameplay doesn't help one bit. It's not worth your however little money.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun and very unique. A must have considering it's only around 2 bucks. 3 bucks and you even get a copy for a bud. What are you waiting for!?",
            "review_score": "1"
        },
        {
            "review_text": "Cool little game for $1",
            "review_score": "1"
        },
        {
            "review_text": "It's an original game, and really fun",
            "review_score": "1"
        },
        {
            "review_text": "Tower defense game with cubemen. Also insanely hard.",
            "review_score": "1"
        },
        {
            "review_text": "The TD parts of the mixing TD with RTS was 'restricting spots cubemen can move to and occupy to a few blocks'. You can only make and control the cubemen when there are spots unoccupied. If all of the spots near your base already got occupied by enemies, you have to make your cubemen going into their base. I think 'fast and accurate click skill' in TD or RTS is not meant for this.",
            "review_score": "-1"
        },
        {
            "review_text": "Cubeman is a very barebones strategy game. The idea is pretty simple: You're given a variety of nondescript cubic soldiers, all of which require a certain amount of resources to be summoned, and are tasked with positioning them on the battlefield in a way that will give you control over your opponent. All units perform a different task and all of them do better under certain conditions, so choosing where to place each of them is vital to your victory.  The gameplay, albeit solid, can be kind of slow and boring at times. Its basic nature makes it so that there isn't a lot of room for strategy in it: Position your units correctly, and soon you can start spamming heavy-hitters, giving your opponent little to no room for recovery. It feels more like a slaughterfest than it does like an actual strategy game. The online community is pretty much dead, and after you figure out the game mechanics, beating the AI opponents isn't too hard.  Graphically, there isn't much to say: They don't suck, but they're not very appealing either. I give the designers credit for giving you the option to customize how your soldiers and the levels look. A+ for going the extra mile.  The soundtrack is actually pretty good. It's not something I would listen to on my free time, but I took notice of it when I first started the game and was very pleased with it while I played. Deserves a special mention because of that.  In the end, I think cubemen will appeal more to those who aren't very into the RTS genera and looking for something simple that will help them get into it. It's a very solid game and it can definitively be a lot of fun if you have a friend to play with. For its low pricetag, it’s definitively a worthwhile deal.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great Indie game to hone your strategy skills. There are quite a few different ways to customize your cubemen, and the enemy as well. Each character has it's advantages and disadvantages, so you have to sort out where each unit works best. You get everything from flamethrowers to particle beams to snipers. Almost all of the playing fields are challenging and make you think in their own way. Each of the three modes is also very enjoyable. All in all, great game.",
            "review_score": "1"
        },
        {
            "review_text": " Cubemen  its a good RTS and Tower Defense game, its funny and with minecraft style  10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "It's just a tower defense game.",
            "review_score": "1"
        },
        {
            "review_text": "I have only played this game for around two hours, but I'd have to say it's really fun. I was able to buy a copy for me and my friend for 60 cents, and we had a blast. Most of the time we played we were on mayhem, as it has so much action, but sadly we couldn't make a full group as nobody is ever online. I'd say though that is you have friends, PLAY IT.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best TD games i've played for a long time! I recommend it.",
            "review_score": "1"
        }
    ]
}