{
    "app_id": 207420,
    "name": "Wizorb",
    "release_date": "2012-03-14",
    "developer": [
        "Tribute Games Inc."
    ],
    "publisher": [
        "Tribute Games Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Arcade",
        "Pixel Graphics"
    ],
    "achievements": 20,
    "positive_ratings": 538,
    "negative_ratings": 224,
    "price": 1.99,
    "description": "The once peaceful Kingdom of Gorudo is threatened by an evil presence. The only hope for salvation is Cyrus!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/207420/header.jpg?t=1447355414",
    "minimum_requirements": "OS:Windows XP or later Processor:Dual-core processor (Intel Dual Core 2.0 GHz or AMD Athlon X2 5200+ 2.6 GHz) Memory:1 GB RAM DirectX®:9.0c Hard Drive:250 MB HD space Sound: DirectX 9.0c compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Introduction:",
            "review_score": "1"
        },
        {
            "review_text": "This was a fun little thing. It's the classic Breakout formula with some sprinkles on the top, kind of reminicant of Arkanoid (but with magic).",
            "review_score": "1"
        },
        {
            "review_text": "Arkanoid/Breakout clone with a fantasy story. The presentation is great (just the repeated music will eventually get on your nerves) and the controls are flawless. For the price a really great little game if you like(d) Breakout.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fairly fun throwback to the block-breaking games of the past. Pixel graphics and 8-bit sound complete the retro experience, with cards and achievements to add some modern meta-game. Some of the achievements help to motivate for a little bit of replayability, but you're unlikely to get all of them unless you really like this style of game. All in all it's worth a go, but little to keep you playing once you've played a couple of times.",
            "review_score": "1"
        },
        {
            "review_text": "Such a fun and simple game. The price is well worth the experience! Low 5 out of 5 Matt faces!",
            "review_score": "1"
        },
        {
            "review_text": "Wizorb is an Arkanoid-style brick-breaking game, dressed in the style of an 8-bit fantasy RPG. --- Side thought: what is up with this retro RPG style trend lately? At first it was novel, but now it's getting a bit old --- Anyways... despite that, this is still a fun little game for fans of the genre.  For those who don't know what this type of game is, you basically move a paddle at the bottom of the screen left and right, hitting a bouncing ball back and forth towards the top of the screen in order to destroy various types of objects and enemies. You also have the ability to use a handful of power-ups such as shooting fireballs from the paddle and slightly altering the course of the ball, among others. The game consists of 5 worlds comprised of around a dozen levels each (which makes the experience only 3-5 hours long, unless you are a completionist). Between levels, you can also visit a sort of 'hub town' where you talk to characters and help them out by giving them money. It's a neat side aspect of the game, but really doesn't offer all that much to the core experience other than a little background story and a few extra items and achievements. So unless you are down with the core brick-breaking gameplay, there's nothing much else here to recommend for you.   The game was well worth the small asking price for me. One of my favorite games as a kid was the original 'Breakout' for the Atari 2600, so I have always had a soft spot for these brick-breaking style games. If you aren't a fan of that style of game, then nothing about Wizorb will change that. However, if you've enjoyed games like that in the past, then this will definitely give you a few hours of solid mindless fun.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun block breaker with unique features such as the usage of magic. The levels look fun and pretty cool with some pixel art and the paddle with mouse movement is precise. You'll love the pixel art made by Paul Roberston and enjoy the look of the bosses. Only issue I see is the difficulty of the silver unbreakable blocks and how they are placed which can leave your orb flying around for almost an entire minute without hitting anything. Still a solid game and I enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Wizorb at its core is a block breaking game similar to Breakout and Arkanoid. The difference from these classics is how it expands on their simple formula in almost every way possible. You play as the wizard Cyrus who transforms himself into his staff to be used as your paddle. Like any true wizard you have magical powers that will help aid you on your journey. If its adventure you find yourself on you can bet there is a story too. This game tries to do a lot of things and usually manages to do so quite successfully.  Wizorb is a very vibrate and colorful game with its 16-bit inspired, retro, graphics. The different monsters, environments, pick-ups, and bricks all come together for a clean, uniform, style. While the story isn't quite a enthralling as the visuals it does help incentivize your progression. Tarot village has been ravaged my monsters and all the town folk need money to repair their homes and businesses. By playing through the different levels you'll even money you can use both to help out the citizens and buy different power-ups. The power-ups will give you a temporary boost that last until you lose a life. The different power-ups from range from paddle extensions to sticky, slow and multi balls.  The long the ball remains in play it will move faster with each hit off your paddle. At top speed its become quite difficult to keep your paddle lined up with the ball. Thankfully, you have different magic powers you can to help make life easier. As soon as the ball bounces off your paddle you can transform it into a burning ball that will pass through multiple bricks or give it wings and guide it into a certain area. While the ball is flying around you can shoot fireballs from your paddle or blow a gust of wind to change the direction of your ball. These all drain your magic bar which can be replenished with potions. Also, if you go so long without hitting anything your ball will start to glow and the next time you hit it you'll receive some magic.  There are five different areas you must fight through to save the kingdom. Each area has a unique theme, a set number of stages, and a boss battle. Each level becomes progressively harder with bricks and enemies becoming tougher and harder to hit. Look for rooms that provide bonuses and shops. Watch out as any purple objects that falls onto your paddle with have a negative effect and could even kill you. Replay levels for coins, score, and bonus stages used to free four sages who when reunited grant access to a special power.  Wizorb is a beautiful indie game with some really unique mechanics. The sense of progression of the difficulty feels spot on. Only in the last area does the game really start to almost too difficult. There are times too where it feels the paddle isn't quite as responsive as it needs to be which can be frustrating when the ball gets up to top speed. These aspects do make this game feel a little bit harder than it needed to be however Wizorb is still easy to recommend. The magic abilities are a blast and there is a wonderful sense of adventure. This is arcade style game is wonderfully crafted and thoroughly enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "if there was a thumbs sideways button thats what i would rate it i think. its ok but v simple",
            "review_score": "1"
        },
        {
            "review_text": "This was a great game, at times it can frusterating. Overall a great experience!",
            "review_score": "1"
        },
        {
            "review_text": "I really tried to give this game a chance. I really did.   It looked awesome, but yet it's plain and boring. It takes too much time and sometimes you think you fall asleep in front of the PC. I mean for what it is, it ain't bad, but yet it takes way too long and 12 Levels and a Boss for every world is too long. It doesn't keep me entertained, so I would keep playing the game.",
            "review_score": "-1"
        },
        {
            "review_text": "WIZORBING MUCH MORE THAN JUST A TIMESINK IN WHICH TO UNLOAD YOUR DRUNKEN URINARY STREAM AT THE BACHELOR PARTY THIS TREATISE HARKENS YE AGE OLD TRADITION OF UNLEARNING THE COMPLEXITIES OF REALITY AND DEVOLVING INTO A SENSELESS DESTROYER OF BLOCK AND BRICK. IT WILL BE HARD TO CONVINCE THE JUDGE THAT YOU DID NOT MEAN TO KILL HER ONCE THEY SEE THIS IN YOUR LIBRARY. YOU ARE TOO OLD FOR THIS ♥♥♥♥. GET MARRIED. STOP PLAYING VIDEOGAMES. 1/125 RINGS",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME EVER PIXEL PUNCHERS GAME OF THE YEAR MUST BUY IF YOU LIKE BALLS :D.",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun if you want to play some Breakout. With a twist! I think it's a very refreshing game and doesn't feel like your average Breakout clone at all. I wouldn't recommend playing this in long stretches unless you're a fan of the genre.  ----[Rating weighted based on the genre]----  Story: 3/5 Gameplay: 4/5 Challenge: 3/5 Discovery: 1/5 Replayability: 5/5 Aesthetics: 4.5/5 Visuals: 5/5 Atmosphere: 2.5/5 Music: 3/5",
            "review_score": "1"
        },
        {
            "review_text": "A story of a wizard that becomes a breakout paddle",
            "review_score": "1"
        },
        {
            "review_text": "It's Arkanoid with a 16-bit RPG theme. If you like Arkanoid and don't hate 16-bit RPGs, you'll like this!  It turns out I hate Arkanoid and don't like 16-bit RPGs. I found the city-building metagame tiresome and distracting from the actual brick-breaker part of the game, and the brick-breaker just frustrated me. Not my thing.",
            "review_score": "-1"
        },
        {
            "review_text": "I would much rather be playing Shatter or DX Ball. This game is slow, tedious and repetetive. The spells are almost completely useless in later levels and take such a huge amount of magic that you'll never really get to use them much. Rebuilding the town is mostly pointless because the shop is the only building that has a function. I found most of the music to be rather annoying, especially the bonus stage. There are better games out there.",
            "review_score": "-1"
        },
        {
            "review_text": "Try out Wizorb. It will show you the extent of how uninspired, unrewarding, and repetitive a game can possibly be. Then you can go back to playing other games, feeling grateful for what you have.",
            "review_score": "1"
        },
        {
            "review_text": "'Wizorb', which is basically 'Breakout' as an action RPG, has an interesting, original concept; in order to beat the level, you have to take down ALL THE ENEMIES IN THE STAGE; even if it means breaking down stuff that get in the way.  The game has a good retro 8-bit feel to it, and for effort, if they ever get the money, this could be a good game, as a homebrew title for NES and/or Sega Master System. (That is, if those consoles can handle that kind of memory!)  Plus, for only $2.99? Score! I give this 6/10, saying that I'm not very hardcore at Breakout, and that's what makes the game interesting and challenging, as well!",
            "review_score": "1"
        },
        {
            "review_text": "OMG, its so boring. Try Shatter instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, unique and cheap, perfect combination. But play it with mouse+keyboard. If not, will be terribly difficult.",
            "review_score": "1"
        },
        {
            "review_text": "The only challenge in this game comes from how uselessly, ponderously the paddle moves. It's a frustrating, ridiculous design and makes you feel as though you're moving through syrup.",
            "review_score": "-1"
        },
        {
            "review_text": "Arkanoid, without any of the improvements the genre has had over the past 30 years or so. Try Shatter, BreakQuest, or Ball Attack.",
            "review_score": "-1"
        },
        {
            "review_text": "Love some of the pixel art here, but the creators seem to have taken the most tedious and annoying aspects of the old Breakout games and focused on them entirely when they designed the levels.",
            "review_score": "-1"
        },
        {
            "review_text": "You wouldn't tell from the title or the first screenshot for that matter that this is one of those one-paddle pong block breaking games. It's not really a bad type of game if done properly as it was here. The art style is that 8 bit pixel art deal that we see often these days. I don't have nostalgia goggles so I don't get that warm fuzzy throwback feeling from this as much as someone else might, but it's still pleasing either way.  It also has controller support which is the reason I decided to start playing it. I just got a logitech gamepad and this fits right in with the type of game I want to use it for (games that are callbacks to the ones of yore, that are actually beneficial to use a controller for).  There are also minor RPG elements in it, you evidently (I'm not too far into it yet) have an inventory system and you can collect gold and help a town get rebuilt. But in the same vein as 10,000,000 don't get this if you think it's an RPG in any form.",
            "review_score": "1"
        },
        {
            "review_text": "An RPG twist on an old arcade classic. Also right now it's less than a $1.  BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "🌟🌟🌟🌟",
            "review_score": "1"
        },
        {
            "review_text": "Not my type of game",
            "review_score": "-1"
        },
        {
            "review_text": "Old school concept.  But I love this like tetris! ;D",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, it worth the few cents that it cost.",
            "review_score": "1"
        },
        {
            "review_text": "Saying the word 'Wizorb' is one of the most gratifying video game experiences I have had in my entire life. It's amazingly simplistic yet allows for so much complexity. Easy to learn, tough to master, etc. This in turn adds to it's replayability. I can lose days just saying 'Wizorb' over and over again. It's fun, It's great to play with friends, and it's easy to play on the go. Ultimately, saying 'Wizorb' is one of the best values in gaming. Though I haven't actually played Wizorb, if Steam tracked tthe time I spent saying 'Wizorb,' this would easily reach the triple digits in play hours. So, in conclusion, I give it a soft 6.",
            "review_score": "1"
        },
        {
            "review_text": "As weird as this sounds, it's an oddly addictive combination of Breakout and one of those old NES side scrolling shooters.  Okay, I just like killing the monsters.  Still good though.",
            "review_score": "1"
        },
        {
            "review_text": "Mysterious old man takes four girls into hell so they can watch him smack his balls with a paddle",
            "review_score": "1"
        },
        {
            "review_text": "A breakout / arcanoid clone with mediocre features and not the best ball physics. Nice if you like to play a little but not for to long.",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing about the game is really bad, it's just boring. Very boring.",
            "review_score": "-1"
        },
        {
            "review_text": "It has been years since a great reto-styled Arkanoid/Breakout type game was released yet the 16-bit stylings of Wizorb are just that. Fantastic fun and I got hours of enjoyment out of it. Would at least have paid double the price that this game is.",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgic design style, and an equally nostalgic game play. If you miss Arkanoid, then it's time to be a wizard.",
            "review_score": "1"
        },
        {
            "review_text": "Game never gets old. Good mix between retro, RPG and break ball game.",
            "review_score": "1"
        },
        {
            "review_text": "Everybody needs a copy of Wizorb",
            "review_score": "1"
        },
        {
            "review_text": "paul robertson did the sprites",
            "review_score": "1"
        },
        {
            "review_text": "The 8-Bit soundtrack brings me back to the NES days. It's a great game. Very fun with its retro feel. It'll feel like you've got your ole' Nintendo back in your computer!",
            "review_score": "1"
        },
        {
            "review_text": "If you like breakout and wizards then don't play this game because you'll hate them afterwards. This game is super tedious but if you somehow make it past the 1st level it gets a bit bitter.",
            "review_score": "1"
        },
        {
            "review_text": "Its the game play of Arkanoid with the music of Zelda and the sound effects of Bubble Bobble. Totally worth the $0.75 I spent for it. It's like a short trip down 8-bit memory lane. Not a complete clone; it brings a few new things to the table.",
            "review_score": "1"
        },
        {
            "review_text": "Great Arkanoid clone. RPG elements and magic add some great flavor. Got a good 7 hours play out of hard mode before starring every level and finishing the game.",
            "review_score": "1"
        },
        {
            "review_text": "So amazing. Graphics are great and solid gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "If you like tile ball bouncing madness then you'll like this!",
            "review_score": "1"
        },
        {
            "review_text": "Old school gaming goodness",
            "review_score": "1"
        },
        {
            "review_text": "Arkanoid - the JRPG version. Fun Little game. Hard as nails as it goes on though.",
            "review_score": "1"
        },
        {
            "review_text": "Everything you love about Breakout  but with magic .",
            "review_score": "1"
        },
        {
            "review_text": "Never played anything as immersive or exciting as Wizorb(?). A must buy!",
            "review_score": "1"
        },
        {
            "review_text": "I played this game until I reached the end-boss, and quit upon realizing what a waste of time it would be to beat this game. Ultimately, this game feels like a worse Arkanoid, with some additional mechanics tacked on top. However, these changes ultimately did little to improve the gameplay for me. For anyone looking for a different take on this formula, I would much rather recommend Shatter, which is also available on Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "What a pain in the ♥♥♥ game.  U can spend an hour on 1 lvl and have nothing happen.",
            "review_score": "1"
        },
        {
            "review_text": "This game may look stupid but it is not, it is one of the games that is fun when you are bored and will keep you entertained for hours.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad little game. Very short but for the price I can't complain I suppose. Finished in one sitting, took about 2 hours and didn't offer much of a challenge, but it's a good game for a change of pace.",
            "review_score": "1"
        },
        {
            "review_text": "Wait until sales to get this game I managed to complete all 60 levels coz I love its beautiful graphics and I'm also a fan of master Paul Robertson  Pros: Awesome pixel art  Cons:  Poor level design Problematic pacing Insignificant variety in magic spells.  Mediocre boss fights",
            "review_score": "1"
        },
        {
            "review_text": "This is easily the second or third least powerful wizard I've ever seen. At least Radagast had those sled-bunnies.  This isn't a bad game. It's like some forgotten Super Nintendo game, but not a hidden gem. More like something you rented or played for a bit, then got bored with. It isn't remarkable-- it doesn't reinvent Arkanoid/Breakout, which is fine, but being a competent version of a well-trodden game isn't really good enough for me. I love the art and animation, which is what I bought this for, but the music is sub-par, which is strange considering how tight and polished everything else is.  Maybe this is your Breakout. Good for you, young persons. I already had a few of those, though.",
            "review_score": "-1"
        }
    ]
}