{
    "app_id": 207400,
    "name": "eXceed 3rd - Jade Penetrate Black Package",
    "release_date": "2012-08-02",
    "developer": [
        "Tennen-sozai"
    ],
    "publisher": [
        "Nyu Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Bullet Hell",
        "Anime",
        "Shoot 'Em Up"
    ],
    "achievements": 0,
    "positive_ratings": 489,
    "negative_ratings": 41,
    "price": 4.79,
    "description": "eXceed 3rd reboots the eXceed storyline, taking it in a new direction. In this installment, Rayne Lindwurm, a descendent of the Dragon Clan, fights her way through a tournament to become one of the 7 Cardinal Lords who rule her world, Pandemonium.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/207400/header.jpg?t=1453838744",
    "minimum_requirements": "OS:Windows Me/2000/XP/Vista/Windows 7 Processor:Pentium 4 or better Memory:512 MB RAM Graphics:NDIVIA Geforce 5200 or better, AMD(ATI) Radeon 9600 or better DirectX®:8.0 Hard Drive:309 MB HD space Sound:Standard",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I hate fun so I buy these bullet hell to torment myself with and drown in sprays of bullets because they're super fast and I deserve to die for playing these.  It's like Touhou or Ikaruga. those are like Space Invaders, except the screen is made of bullets and tears are streaming down your face because you keep dying because there are so many bullets. The patterns are pretty.",
            "review_score": "1"
        },
        {
            "review_text": "if you like dying and the colors blue and/or pink then this game is for you  on a scale of 1-10 i give it a death  rip",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥ing game man. Definitely the best of the eXceed collection. The soundtrack is face-melting good and blends well with the fast paced, bullet hell gameplay. I can't think of a more geniuinely fun to play STG. I really can't.",
            "review_score": "1"
        },
        {
            "review_text": "If you like bullet-hell games, this is a game for you! Great OST (Intersect Thunderbolt :D), challenging stages and more! This is my second favorite danmaku, just after Touhou :3",
            "review_score": "1"
        },
        {
            "review_text": "This is the best out the 3 eXceed games. To be honest, the first one was pretty bad, and the second one was so so. If you are interested in this series at all, this is the one to get. It's nothing crazy or very original, but it's a good bullet hell game and worth a few bucks. The bullet patterns are a lot of fun and great practice for other bullet hell games. If you are new to the genre, this is a great, inexpensive way to start and test the genre out. If you are looking for something to hold you over until the next Cave release, this is a good bet too. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "One of the few problems I have with Steam is the lack of good 2D shooters. While there have been some recent additions like Ikaruga and Danmaku Unlimited 2, the selection isn't anywhere near what I'd call satisfactory. Thanks(?) to the lack of releases I find myself spending a little time with Jade....Penetrate...Black...Package....uh..okay then.  The storyline is about what you'd expect from a shmup, absolute swill. You're playing these games to dodge bullets and get high-scores anyway. There are multiple stages with bosses at the end of each. These bosses have several forms and numerous bullet patterns to fling at you. Like most doujin shooters, the bullet patterns are immense in their density but don't move very quickly. You don't have to be a veteran of the genre to get far in this game. The scoring system revolves around medal-chaining and multipliers. It's not quite as deep as an arcade shooter but it does the job.   As far as I'm concerned eXceed 3rd is the only game in the series worth playing. This is because rather than being completely inept &amp; frustrating (eXceed 1) or a poor man's Ikaruga (eXceed 2), this game focuses on what makes doujin bullet-hells work. Pick it up, play it, enjoy it.   While we'd all love to make more jokes about black packages, it should be mentioned that originally this game was just Jade Penetrate. It's an earlier version that's very different, and it is more difficult with faster bullet patterns. The 'Black Package' is akin to Cave and their habit of adding 'Black Label' to different versions of their games. Unfortunately you'll have to look outside Steam if you want to play the original eXceed 3rd. It's more likely to be an overall better game if you're looking for a challenge. I guess most of Black Package's difficulty comes from the scoring system, I cleared the game on my first attempt(and by cleared I mean without using continues).  Overall though JDBP isn't too bad a game. I've certainly played worse in the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Hey this is pretty good!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this video game.",
            "review_score": "1"
        },
        {
            "review_text": "Follow Rayne Lindwurm as she fights her way through the Cardinal Tournament. Taking a big turn from the mechanics in the 2nd game, 3rd goes back to the old style of GBC but adding a few things. You can have 'options' by picking up the powerups aka the little dragoons. Rapidly hitting the fire button will get you a fairly wide shot and also have the options fire straight ahead, going into slow-mo will give Rayne a more concentrated shot and make the options auto-aim at targets. Grazing is back as that will allow a meter to build up and then you can fire multiple homing shots at the enemies. There are 2 types of bombs, a regular bomb which has a hit range of 1-2x above your character. There is also a death bomb which has a range of 0-1x above your char and lasts significantly less time.   This is the Black edition, so it's actually a lot easier than the vanilla eXceed 3rd, I think capcom should have bundled them together.",
            "review_score": "1"
        },
        {
            "review_text": "i want an anime ♥♥♥ in my face",
            "review_score": "1"
        },
        {
            "review_text": "bullet hell + trading cards awesome soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Good game but REQUIRES A LOT OF SKILL! Its basically Galaga on steroids.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, short but the gameplay is very smooth.. and btw the soundtrack is amazing. This was my entry to bullet hell, and i really liked it.",
            "review_score": "1"
        },
        {
            "review_text": "Superb soundtrack, really fun gameplay. A must-play! The patterns also aren't ♥♥♥♥♥♥♥t like the ones from the first game ^.^",
            "review_score": "1"
        },
        {
            "review_text": "bretty good",
            "review_score": "1"
        },
        {
            "review_text": "Ehh... the 2nd is a little bit better. It's still pretty good though.  And it has the same thing as the other games: it runs worse on better computers. Dunno why. If I couldn't switch my graphics card to Intel Integrated, I wouldn't have been able to play!",
            "review_score": "1"
        },
        {
            "review_text": "You and Jade penetrate all of the Black Packages in this one.",
            "review_score": "1"
        },
        {
            "review_text": "too bad I am not asian.",
            "review_score": "1"
        },
        {
            "review_text": "playing it oldschool, every pc can play it easily, it shows how much gaming has changed a lot in the days. one of my favourite oldschool arcade games",
            "review_score": "1"
        },
        {
            "review_text": "I already had really low expectations coming into eXceed 3rd - Jade Penetrate Black Package since the first two games were awful. It turns out that the third game in the series is probably the worst.  While the second game made some minor improvements over the first, eXceed 3rd - Jade Penetrate Black Package is the most basic out of the three games. The anime style artwork and characters continue being shallow and meaningless, appearing as 10 year old girls with breasts and showing underwear. The voice acting is the same as before, with the voices of children screaming at each other constantly through gameplay. The bullets are still abstract and indescribable. For this third iteration of the game, the developers decided it would be a good idea to add incredibly large 'coins' that drop from enemies in very high amounts, taking up most of the screen. Something else that did not occur in the previous two games in the series but now happens often in eXceed 3rd - Jade Penetrate Black Package are the major frame rate drops during certain parts of the levels. This happens in every level.  The resolution continues being really low in addition to the well below amateur level of graphic and sound design. Everything about this game is awful from beginning to end. The fact that Capcom associates themselves with this rubbish is depressing. The developers expecting people to pay money for something this bad is a joke.  eXceed 3rd - Jade Penetrate Black Package is awful.",
            "review_score": "-1"
        },
        {
            "review_text": "The third in the eXceed series, much like Mario and Link before it, this third entry returns to the series' roots after having a departure in the second game. So it plays like the first, but controlls much better. The story is new however. Also in addition to the usual bombs, your character, a dragon demon hybrid gains access to dragon 'option' familiars who fight alongside you and home in attack when in slow mode. You are also given access to a special attack that charges over time. Both Vampire REX and Jade Penetrate Black Package Badge are excellent games for different reasons. If you want an Ikaruge experience, play Vampire REX, but if you want a more bullet hell Touhou style exerience, play this game.",
            "review_score": "1"
        },
        {
            "review_text": "The game is good and dynamic! Pays its cost.  Especially deliver game characters.  After playing the game, you can plunge into the era of Mario!",
            "review_score": "1"
        },
        {
            "review_text": "Third installment of eXceed series doesn't have the polarity system used in eXceed 2nd, but instead gives you slow, autobomb feature seen in eXceed 1st and a special attack. Leveling is done with mini dragons that aid you in battle and this goes well with the story too. Some bullet patterns seem to 'lean' to a direction where you're heading and it looks like a programming bug or consequence of win 7 compatibility settings I had to apply. Good game for its price.",
            "review_score": "1"
        },
        {
            "review_text": "Best use of my money",
            "review_score": "1"
        },
        {
            "review_text": "Black Package... hue  ",
            "review_score": "1"
        },
        {
            "review_text": "Awe-inspiring chaotic perfection in the form of a vertical shooter",
            "review_score": "1"
        },
        {
            "review_text": "For those who wanted Touhou on steam this game is clearly it.  Joke aside, its a really a polished shmup so its definitely worth picking up. Also that OST be Metal as ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Entry-level danmaku/bullet hell. Graphics are low-res but still sweet, soundtrack is great aswell. Interface is a bit laggy, but in-game controls and gameplay is smooth so it's not a big deal.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "I'd buy it again just for the music  10/10 get it",
            "review_score": "1"
        },
        {
            "review_text": "great game cant say anything else about it",
            "review_score": "1"
        },
        {
            "review_text": "I CANT STOP DYING BUT I LOVE IT",
            "review_score": "1"
        },
        {
            "review_text": "From a bullet-hell perspective, this game is easily as good as touhou. From a gamer perspective, holy s**t this soundtrack is amazing.",
            "review_score": "1"
        }
    ]
}