{
    "app_id": 207530,
    "name": "Noitu Love 2: Devolution",
    "release_date": "2012-04-23",
    "developer": [
        "Joakim Sandberg"
    ],
    "publisher": [
        "Joakim Sandberg"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Pixel Graphics"
    ],
    "achievements": 0,
    "positive_ratings": 469,
    "negative_ratings": 28,
    "price": 3.99,
    "description": "A century after the legendary boy Noitu Love saved the world from the evil Darns, they rise again, but in a chaos of time-bending mayhem!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/207530/header.jpg?t=1479398176",
    "minimum_requirements": "OS: Windows 98 Processor: 1 GHz Memory: 500 MB RAM Graphics: Any system capable of software rendering DirectX®: 5.0 Hard Drive: 15 MB HD space",
    "recommended_requirements": "OS: Windows XP Processor: 2 GHz Memory: 1 GB RAM Graphics: Any system capable of software rendering DirectX®: 5.0 Hard Drive: 15 MB HD space",
    "reviews": [
        {
            "review_text": " Basically you kill stuff",
            "review_score": "1"
        },
        {
            "review_text": "A great little game. It's very short, but has additional content and replayability (for speed and/or points). Nice controls and interesting bosses with multiple stages.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful sprite works from veteran sprite artist Joakim ‘Konjak’ Sandberg, even this game is intended for using mouse and keyboard, i think the controller is well implemented, while this game also is kinda short, but it really had a full of variation of cute monster design and great boss battle",
            "review_score": "1"
        },
        {
            "review_text": "Random, Numerical Rating: 10/10  This game is an action-filled, ♥♥♥♥ing delight. My right index finger hurts more than any intense weekend filled with crazy, competitive Diablo II.  Noitu Love 2 is an extremely fast-paced arcade beat-em-up—god-fighter—robot-destroyer platforming game. This ♥♥♥♥ing game is so good you'll want to kiss a swan. These controls are so freaking tight—the precision makes for amazing combat.",
            "review_score": "1"
        },
        {
            "review_text": "This is like if Treasure made a top-notch GBA action game    BUT FOR THE PC   This is most certainly one of the best action sidescrollers available on this site and it's ♥♥♥♥ing cheap. NO EXCUSES GO GET IT NOW",
            "review_score": "1"
        },
        {
            "review_text": "High speed and high action, Noitu Love 2 has the pace of a Sonic game. Every level is unique and different, and the graphics are amazing while retaining their retro style. Each boss has its own special gimmick and attack patterns you need to learn to survive. It's nothing like a typical hack n' slash: it's complex and wildly varying. You can play as three vastly different characters which completely change the way the game is played, and the game is very replayable. If you've got a fast mind and fast reflexes, Noitu Love 2: Devolution is for you.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic 2D beat-em-up that's like a high speed rush on a freeway in the middle of a paintball gun shootout. Catchy music, great gameplay, &amp; unlockables. Highly worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "Fun but short game. Good arcade fun.",
            "review_score": "1"
        },
        {
            "review_text": "I totally love this game! Its absolutely the best.",
            "review_score": "1"
        },
        {
            "review_text": "HOLY CRAP! This game is everything that I've been looking for! It's kind of like Gunstar Heroes....and I don't want to say it's better, but it does things differently and it is on par with that glorious masterpeice. 10/10 would recommend to ANYONE. If you have ANY doubts about this game, I can assure you can't go wrong!",
            "review_score": "1"
        },
        {
            "review_text": "Having not played the first game, I wonder how credible my opinions may be. This game plays really well as an action arcade game. It's surprisingly difficult given how much power the player has, Konjak really knows what he's doing.",
            "review_score": "1"
        },
        {
            "review_text": "Once you get accustomed to the control scheme,  Noitu Love 2: Devolution  is a very fun action platformer with interesting and varied boss fights.  The biggest downside I'd say is the game is quite short, but for the price tag I'd say it's definitely worth it. The additional unlockable characters and hardest difficulty give some replayability (and an extra boss), and there are some secrets and easter eggs to find (including a  secret  boss).  All in all,  Noitu Love 2  is a fun but short game, that probably won't take you longer than a few hours to beat, but the imaginative boss designs, nice artstyle and awesome music make it worth the price tags, even if the story is nonsensical and completely irrelevant.",
            "review_score": "1"
        },
        {
            "review_text": "not the best game, but it is really enjoyable, unique and VERY fun and the crouch-running animation is the best thing ever",
            "review_score": "1"
        },
        {
            "review_text": "NL2: DEVOLUTION is your classic 2D sidescroller. What it does differently is integrate a really good story along with a different set of controls. I could play this game for hours without realizing it.",
            "review_score": "1"
        },
        {
            "review_text": "A fun, neat little beat 'em up, with some neat moves, nice looking scenery, great art, nostalgic music and a fast pace. Only real downside is it's extremely short. I beat it in under an hour.",
            "review_score": "1"
        },
        {
            "review_text": "First impression: this ♥♥♥♥ is cocaine, man (will update after playing more)",
            "review_score": "1"
        },
        {
            "review_text": "It's like Gunstar Heroes on crack",
            "review_score": "1"
        },
        {
            "review_text": "Plays a little like megaman, really unique controll scheme, and it looks really cool.",
            "review_score": "1"
        },
        {
            "review_text": "great music and grahic this game really knows the needed for those player loved 8 bit style   Have to say Joakim Sandberg is one of my favorite indi game maker one Earth  I found his website several years ago ,the time he release 'Iconoclasts' #1 I was totally charmed by his game style whem I open the game so I download every demo(Ivory ,Noitu Love, Legend of Princess etc) on his site and hope those game will be finished some day  Until now,I'm still waiting for the Iconoclasts full version hope it will be done soon!",
            "review_score": "1"
        },
        {
            "review_text": "I seriously enjoyed this game, and I also got an alpha copy of Iconoclasts which was totally bad ♥♥♥. Joakim Sandberg is a developer to watch. He seems to have a very creative vision, and he captures the old school soul (SNK, Treasure, Sega, old Capcom, etc...). I hope this guy has a long and prosperous future. I really want the Iconoclasts on Steam as soon as possible.",
            "review_score": "1"
        },
        {
            "review_text": "This game startled me with how fun it was. Nothing that will blow your mind, but fun as hell. Takes about one to two hours for a single play through. But you will be going back to it to try the alternate characters and difficulties.",
            "review_score": "1"
        },
        {
            "review_text": "A very amusing game, great music, great pixel art, I LOVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "Fun action, unique controls, amazing music, and crazy bosses! What's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "Mix of ATATATATATATATATA and bullethell  WHY HAVENT YOU PLAYED THIS YET?",
            "review_score": "1"
        },
        {
            "review_text": "Awesome stuff. Why is this not more popular?",
            "review_score": "1"
        },
        {
            "review_text": "controls are a big thing with this title. idk why, cuz they work. there was hype behind these being innovative again idk why. they arent broken. set with a 16 bit style this game is action packed, but is actually very short. I beat the first run in a little over an hour. Kind of wish there was a bit more to it. but its fun and well put together.  6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "It's indie and it has big pixels! What's not to like? It's a short but quite worthwhile trip with very charming graphics and a memorable soundtrack. Action starts off as a little confounding and can be a little tricky to work with, but overall functions fairly well. Has some funny bits too. A pretty likeable little semi-retro action platformer romp which I think deserved more attention.",
            "review_score": "1"
        },
        {
            "review_text": "It's a mix between a Beat 'Em Up, and a platforming game. This game takes good advantage of the keyboard+mouse control scheme so it controls fine, but there is nothing too unique about this game. It's still a small amount of fun, and if you want to pick it up do so during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "pretty fun game but very short.",
            "review_score": "1"
        },
        {
            "review_text": "A very good and fast paced action platformer with a great soundtrack!",
            "review_score": "1"
        },
        {
            "review_text": "Noitu Love: Devolution is a really stellar fighting/platforming game. The uniqueness of the combat and the movement really makes it its own game, and it can be really challenging as well. The art is great along with the soundtrack, I can't say much that would be bad about it, unless you think a bit over an hour of playtime is too little. You get other characters, but each one is after beating the last, and personally, I dislike the last character the most.  For the Steam Winter Sale price of $1.99 it is definitely a worth-while purchase. For the normal $4.99 price it is still a great purchase. If you like intense action-platformers with a bit more emphasis on bosses over levels, such as Gunstar Heroes, then this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "This was just mindless fun with some intuitive design. I loved every second of it.",
            "review_score": "1"
        },
        {
            "review_text": "Some dude ten years ago told me this was a cool game. I get spawned into the floor on level 3 and I think he was a ♥♥♥♥♥♥♥ liar.",
            "review_score": "-1"
        },
        {
            "review_text": "The game really is bad. You're only holding one button down the entire game, the left mouse button IIRC; the game plays itself for you as long as you just repeatedly click that button. So really, it's just a button masher that takes maybe 90 minutes to beat, even on the hardest settings. I'm also not a fan of the art style as it reminds me of amateur pixel art tutorials you can find anywhere online.",
            "review_score": "-1"
        }
    ]
}