{
    "app_id": 207690,
    "name": "Botanicula",
    "release_date": "2012-05-07",
    "developer": [
        "Amanita Design"
    ],
    "publisher": [
        "Amanita Design"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Point & Click",
        "Adventure",
        "Indie"
    ],
    "achievements": 53,
    "positive_ratings": 3524,
    "negative_ratings": 136,
    "price": 7.99,
    "description": "Humor-filled indie adventure game created by the makers of Machinarium and Samorost.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/207690/header.jpg?t=1527759179",
    "minimum_requirements": "OS:Microsoft® Windows® XP/Vista/7/8/10 Processor:1.6 Ghz Processor Memory:1 GB RAM DirectX®:5.0 Hard Drive:700 MB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Charming, delightful, and at times breathtakingly beautiful, Botanicula is a great point and click adventure for anyone of any age who appreciates an imaginitive world full of endearing characters. All the communication among the characters consists of emotive noises and gestures, so anyone can understand what's going on, regardless of their native language(s). Unique hand-drawn artwork and a wonderful music score and overall sound design. A game children, parents and grandparents might enjoy, alone or together.   I will note that the puzzles sometimes seem arbitrary rather than logical - sometimes getting ahead in the story involves just clicking on everything until something happens, but that didn't detract too much from my enjoyment of the game. Indeed it often lead to discovering whimsical little moments in the game that might otherwise have been missed.",
            "review_score": "1"
        },
        {
            "review_text": "I have been meaning to review Botanicula for quite some time; it's one of my favorite casual point-n-click games. Botanicula is absolutely sweet and delightful, full of details and all-around captivating.  Several people who gave this gem a negative review did so due to comparing it to Machinarium.  Botanicula has little to nothing to do with Machinarium  – so much so that  I , for one, didn't enjoy the latter. So don't expect glaring similarities.  I strongly recommend this game to casual players, fantastic OST seekers, point-n-click die-hards, and artistic aficionados. In those regards, this game does not disappoint: it elevates.",
            "review_score": "1"
        },
        {
            "review_text": "Marvelous music.  Fabulous gameplay.  Funny, tender, interesting, mesmerising.   Fantastic!  Just 'OH!'",
            "review_score": "1"
        },
        {
            "review_text": "Playing with weeds and mushrooms, everything is glowing and you hear a lot of funny, cute noises. It's just eaaasy, you need to take this game eaaaasy, my man. These mushrooms.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a casual adventure game that has a feel good story line and an amazing art style then this is the game for you. This game is extremely charming in the way it delivers the plot and puzzles; there is no dialog so it's all done with visual clues and some very clever sound effects. Although it does seem a bit short, it's a perfect game to relax with and just explore the alien ecosystem, see what everything does and how they interact with each other and from doing this is how the solution to the puzzles should come to you.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is Absolute Beauty!  * Though short the gameplay is very enjoyable with occasional puzzles. * Stunning visuals and the Music is also so soothing &amp; charming. * Only con is no replay value but nonetheless a great point &amp; click adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Botanicula, part of the Amanita collection, is a lovely little indie game. It's from the same studio that brought us Machinarium, so if you enjoyed that game, you'll like this too.   It's the story of a group of friends who have to band together to dispatch an evil presence threatening their home.  The game is incredibly light and fun, filled with humour and an eclectic soundtrack. I completed the game in 3.4 hours, which included unlocking 47 of the 53 achievements. Afterwards, I felt compelled to go back and finish the last 6, giving a full completion time of 5.1 hours.  If you played Machinarium, you should find this easy enough. It isn't as difficult, focussing more on the unique art and animation than the indepth and complex puzzling aspects, but there are still some great puzzles to be found.  If you fancy a light, fun puzzling experience that'll occupy you for a few hours, check this out. Definitely worth it.  -Nilesy",
            "review_score": "1"
        },
        {
            "review_text": "This is a cleaver game! It's very challenging at first until you figure out the little critters and then you can enjoy their personalities as you try to beat the bad spiders who are killing everything!",
            "review_score": "1"
        },
        {
            "review_text": "Very cute. Extremely cute. Probably the cutest games I've played. Cute.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute. Extremely cute. Probably the cutest games I've played. Cute.",
            "review_score": "1"
        },
        {
            "review_text": "Just amazing!   Very entertaining game.",
            "review_score": "1"
        },
        {
            "review_text": "A simple point &amp; click game that has beautiful artwork and a heartwarming storyline. I have completed three play-throughs and each time I have continued to uncover more and more subtle details that have made the game even better than before. I also really enjoyed playing Amanita's other title 'Samorost 3', so if you end up liking Botanicula then I recommend that you give that game a try as well :)  ",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful art design and illustrations with intersting puzzles and exotic sound effects. The background music is definitely a masterpiece because it will interactive with your mouse. Though the levels are linear, there are several half-open regions for you to explore. The only disadvantage is the lack of hints for solving puzzles. You can't go back to previous level, so make sure to collect all cards before progressing to next level!  Most important of all, you can easily complete all Steam achievements!",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful game with a lot of things to discover. Nice artwork and funny 'hand-made' sound.",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun and relaxing game.",
            "review_score": "1"
        },
        {
            "review_text": "A standard point-and-click LSD simulator, except there is nothing standard about it.",
            "review_score": "1"
        },
        {
            "review_text": "Great.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! Really lives up to Amanita's previous game, 'Machinarium.' Beautiful graphics, soundtrack and gameplay. Truly awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Major WTF! Super original, nothing you've ever played before. Just warm milk you sip and enjoy at every click. Proves that golden era of 80s video games is not dead: games that were not just based on graphics but on substance and originality. Don't copy, create. Bravo!",
            "review_score": "1"
        },
        {
            "review_text": "A very cute and amusing point-and-click puzzle game. If you like exploring, a unique design and soundtrack, and if you just like smiling, this is a great game for you. Also, if you would like to try out an intereting and different game.  I found myself laughing a lot of the times I clicked somewhere and something strange and random happened.  It's a game that made me smile a lot mainly because I didn't see any of the things coming.  The music and sounds add to the cozy and cute overall feeling that the design brings.  Some of the puzzles were a little hard and I found myself quitting on some of them just to get some time to think them out.  It's a very interesting point-and-click game since it's traditional but yet different. I think that the mysteriousness of this game is what makes it so unique and great. Both in the artistic way but also in the story.",
            "review_score": "1"
        },
        {
            "review_text": "A good adventure indie point and click game.  + unique and funny design and illustration about vegetables + adorable sounds + secrets - can't say any really wrong, maybe sometimes a lack of hints, when no clue what to do",
            "review_score": "1"
        },
        {
            "review_text": "This game just makes me smile. I can't help it, and you won't be able to either, should you choose to play it. It's just one of those quirky, funny, simple games. The basic premise of it is light vs. dark. The protagonists (a group of cool little plants) go on a quest to defeat the evil spiders, which are sucking the life out of plants everywhere. The plot is quite simple, but all the little details thrown in throughout the world will entice you to explore more. This is a game for all ages, literally. My parents and I both played it and loved it. You do not have to be a 'game player' to love this game. Its easy-to-master point-and-click gameplay is suitable for players of all skill levels. The length of this game is really based on how you want to play it, on how much you want to see of the amazing world that these plants inhabit. The soundtrack and animation are both top-notch. This is a game that will leave you feeling uplifted and happy. Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "Wow, where do I begin? This game has a great design, unique animation style that reminds me of a more pleasant David Firth style, a whimsical and interactive soundtrack that I would find myself sitting around listening to for a few minutes before moving on, and a story simple enough to understand only through pictures, but complex and immersive enough to rope me in and keep me on my toes until the end. If you're a fan of point and click games, fantasy settings, and really colorful artwork and designs, this is the perfect game for you, and completely worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "A nice and cute graphic adventure with the unique Amanita Design style.",
            "review_score": "1"
        },
        {
            "review_text": "This is a super cute, point-and-click exploration game. The music is enjoyable, the art is beautiful (and sometimes bizarre), and the overall game just oozes adorableness.  There is no dialogue -- just sounds and images to portray events. Although there are a couple places where I got lost in a network of tunnels/branches, none of the puzzles were particularly difficult to figure out. Just a lot of good, casual fun. I found the game extremely relaxing to look at and play.  (My only complaint is that there are no Steam cards for this game. The whole achievement system is built around exploring and finding creature cards, for crying out loud!) :)",
            "review_score": "1"
        },
        {
            "review_text": "Great visuals, fun puzzles, amazing music. Really great sound just in general. An imaginative and fastastic little game that delivered much more than I expected.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best adventure games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun for the whole family. Grandma wanted something that she could play with me so we looked into games that would fit her hobbies, that of horticulture. We went to the steam box and bought a game. I played the game about Plants where they shoot things but it was too difficult for Grandma to understand (she has the Dimentia so she's constantly asking who I am) but this game is perfect for her Alzheimers. What? What was I doing again?  In it you play as a bunch of bug things and climb trees. There is a bunch of stuff to collect which is perfect because Grandma is constantly finding new things to look at. There isn't really a point to all this, which is why Billy didn't like it, but for someone like your Grandma or Billy's friend 'Harold' from school (he has the autism, I hope it's not contagious). But what? What was I doing again?  Billy? BILLY!   ~in the background~ what grandpa?  Billy, where's my rifle? I think we were going to go hunting for gooks? I can't remember. What was I doing?  Oh yeah, this game gets a 5/10 because my grandson and I didn't understand it, but grandma and harold did. So maybe it's a feminine thing? Grandpa needs to go now, his meeting with the special 'Chinese massage lady' is in 30 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a fan of point and click game but this one called my inner child instantly, forgeting i'm clicking on button to get my story.  Magnificent music and soundscape make that game immersive in a 'storyteller' way. Your caracters make funny noises out of vocal audio sources and many of the tracks you encounter are also made that way (which it great.) The visual design feels dreamy, organic and living.  I definitly recommand it, even if it's just to try it, knowing the low cost for such a good work.",
            "review_score": "1"
        },
        {
            "review_text": "Great plot. Cool animation. Awesome gameplay. Best bonus scenes ever.",
            "review_score": "1"
        },
        {
            "review_text": "I was moved to write a review for this delightful game after watching a Extra Credits video on the value of short games. I can't say I remember how long it took to complete everything in Botanicula, but every minute was worth it. Rarely have I seen a game that captured whimsy in such a poignant way. With no dialogue other than sounds and grunts, the game manages to portray a story of despair &amp; hope, longing &amp; belonging and wonder at the vastness of everything.   The visuals are just sumptious. The soundtrack is perfectly suited and individualized, like a theme song for each character or unique moment. I don't think you could ask for a more compelling take on a puzzle quest type game, that never has to beat you over the head that it's a puzzle quest.  I don't think I could more highly praise the work of the designers and production team. This one is worth every moment you play the game, even if it only takes you a few hours to finish.",
            "review_score": "1"
        },
        {
            "review_text": "The game emits Light in visible wavelengths.",
            "review_score": "1"
        },
        {
            "review_text": "This game is wierd, plain wierd... O_O But the style is genius! (graphicly)",
            "review_score": "1"
        },
        {
            "review_text": "Botanicula manages to be massively cute without feeling saccharine. Its art is amazing and the sounds - mostly people mouthing sound effects in silly voices - are equally good. Its world feels like a picture-book for kids and the story is sweet and sincere. You play a little guy called Mr. Lantern, who vaguely resembles a hazelnut. He has a vision of evil spiders that are sucking the life out of trees. He gathers up some friends (for the record: Mr. Twig, Mr. Poppy Head, Mr. Feather and Mrs. Mushroom), and sets out to stop them.  As your little group moves about, you will run into obstacles that require you to collect one or more items to pass to the next area. This, in turn, requires you to explore your surroundings and click on anything that looks clickable to see what will happen. Even if what happens doesn't really help, it will likely charm you and make you smile. You'll encounter lots of imaginative, strange bugs and plants which are then helpfully catalogued in a little folder for you to browse.  I can imagine that this is a game you'd want to play together with your kid, assuming he or she is patient and won't be traumatized by evil spiders. Things do get a bit dark and weird later on, but Good - of course - prevails. I would advise doing a first run-through on your own, though, as finding your way around gets a little tricky later in the game - despite an in-game map - and some of the puzzles are obtuse. If you missed out on clicking on something vital at some point, you may need to backtrack but be unclear on where to backtrack to, requiring a look at a walkthrough.  If you want to relive that feeling of running wild in the forest during summer as a kid, gathering chestnuts and being in awe of the greenness all around, Botanicula is the game for you.  @PopCultJunk",
            "review_score": "1"
        },
        {
            "review_text": "I brilliant journey. A very artistic adventure and a must play for any point-n-click lover. The story is brilliant and the presentation is simply stuning. Great art, amazing sound, challenging puzzles. I highly recomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "A short game from start to finish, but still worth the play. The music and sounds in this game give it a calming yet sometimes creepy atmosphere. Most of the puzzles aren't too challenging and there are a few secrets to find. The story is cute and the design is aesthetically pleasing. It's worth the buy, but considering the short gameplay and lack of replayability (aside from collecting achieves you may have missed) I would recommend waiting for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "A short game from start to finish, but still worth the play. The music and sounds in this game give it a calming yet sometimes creepy atmosphere. Most of the puzzles aren't too challenging and there are a few secrets to find. The story is cute and the design is aesthetically pleasing. It's worth the buy, but considering the short gameplay and lack of replayability (aside from collecting achieves you may have missed) I would recommend waiting for a sale.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Pleasant surprise this game, left me with wanting more. It's a quirky point click adventure which encourages exploration. Puzzles will probably have you a bit stumped in certain places and at times you will be scratching your head wondering where to go next and what to do. The little bit extra the game gives you for collecting all the animal cards is worth the challenge also. My only gripes with the game is that the animal cards don't have their names on them or story. Other than that 8/10...",
            "review_score": "1"
        },
        {
            "review_text": "A very beautiful, colourful and interactive ambient, Botanicula is one of the loveliest and most relaxing games I've come across. The images and the sounds are great and, although it's a point and click game, it gives you the feeling that you are inside it, something like the wind. A very good idea in an even better execution. Thank you Amanita.",
            "review_score": "1"
        },
        {
            "review_text": "Whole lotta artsy, and a heaping helping of fartsy. Still, oddly entertaining for the while I played it. Working through a monsterous backlog, but this is going in the 'come back and finish it later' caregory.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good, my name is based upon it! That should tell you enough.  In other words - GET THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "Found Wurms that poop the most adorable little circles in the world. 11/10 would watch them poo all day.  BTW...this game is good lol..soooooo random...but good xD",
            "review_score": "1"
        },
        {
            "review_text": "I found Botanicula's whimsical take on biology absolutely enchanting. Five unlikely heroes wander through the forest attempting to banish the evil parasites, and meet many fantastical and adorable creatures along the way. Learn enough about a new creature and you will receive a collectible card. This adds a lot of replayability as it's fun to try to collect all the cards. The visuals and sound are superb and fit perfectly with the overall feel of the game. This may be my favorite game this year.",
            "review_score": "1"
        },
        {
            "review_text": "Little clicky adventure full of charm and heart from the guys who brought the world machinarium and the samorosts. Its totally worth just supporting them in general and this is their most polished effort to date. Yeah its 'just' a flash game if you want to be pejorative, but its also really cute and amazing and the soundtrack is great. (9/10)",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wondered what it would be like... if the forest came to life? A point and click adventure! 3/10",
            "review_score": "1"
        },
        {
            "review_text": "Simultaneously one of the cutest and disturbing adventure games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Botanicula is the best point-and-click adventure you'll play this year. It is not as big or as complex as Machinarium, but it has the same great atmosphere Amanita is known for.",
            "review_score": "1"
        },
        {
            "review_text": "If you're tired of the mainstream games, try this for a change.",
            "review_score": "1"
        },
        {
            "review_text": "I really liked Botanicula. It's got loads of style and charm. It's not a difficult game. I only really got stuck once. It's a lot more in the vein of Samorost than Machinarium. So, there's no evil bast.ard puzzles to solve. There's around 3-5 hours of game here. If you like adventure games, you're probably going to like Botanicula.",
            "review_score": "1"
        },
        {
            "review_text": "This game is gogeours looking, artful and unique, but it definitely won't be for everyone. I didn't particularly enjoy it myself, mostly because I got easily frustrated by all the 'click everything and hope it leads to something useful so I can progress' angle.   I think some people might enjoy the slow pace, cuteness and challenge of the game, but for me, I prefer logical puzzles and I struggle with abstract stuff that my brain can't find a pattern in. Most of playing time I spent clicking on things, trying to figure out what the next step was and suddenly I'd be in the next level without even realizing what I'd done to get there or how it fit in to the story.  Like I said, not for everyone, but I can deffinitely see the appeal for people who enjoy a less linear approach to puzzles solving.",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥ gives me the chills.",
            "review_score": "1"
        },
        {
            "review_text": "From the makers of Machinarium this charming point and clicker improves on the developer's previous title everywhere. It's fairly short but great for anyone of any background as the entire thing is done with pictures and the like. You may only play it once or twice ever, but it's worth that play.",
            "review_score": "1"
        },
        {
            "review_text": "  I like everything about this game",
            "review_score": "1"
        },
        {
            "review_text": "This is a super unique game, it has a great vibe too it. There are also some pretty weird sound effects haha",
            "review_score": "1"
        },
        {
            "review_text": "Very cute game, but not very long. Click on things multiple times to find the easter eggs and unlock more creatures. One click is just not enough. Lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Starts off as amazing; finishes as frustrating. Worth experiencing nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "this is great and really cute and funny at times and sad and scary to. worth the money to get for me",
            "review_score": "1"
        },
        {
            "review_text": "If ya like cute games, with cute/weird characters, you'll love this game. Or not. Play it, and see for yourself. Or don't.   8D",
            "review_score": "1"
        },
        {
            "review_text": "This game is so bloody delightful! Such amazing detail and fun storytelling that needs no dialog or silly tutorial popups. Truely a remarkable game that oozes of fun and pure joy.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful and lovely puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "I thoroughly enjoyed playing this game. It is very relaxing and visually stimulating. I believe it took me around 4 hours to play through. It is one of the better point- click games offered out there. I mostly recommend this game because its something you'll want to play all the way through and come back later to play again.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this game is very original and the art style is stunning. Made by the creators of machinarium, this game explores wonderfully creative puzzles and a world exloding with shroom-induced wackiness. Cant wait to play this game some more!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most charming point and clicks I've ever played. The characters are well designed and very endearing. The puzzles aren't particularly difficult, but they're compelling enough to make you want to play there.  It's a dialougeless game, but the story is easy enough to follow.  The soundtrack is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "An original and awesome game, I recommend this to puzzle/adventure game lovers. :)  Positives - Unique - Fun - Original - Good story - Good concept - Different art style  Negatives - Frustrating - Easily lost/confused - Can get boring - Puzzles get difficult to solve and lead to frustration  I only just completed the game, and I've had it for over a year now. Maybe I just suck at the puzzles. :3",
            "review_score": "1"
        },
        {
            "review_text": "If you want to watch a beautiful story unfold in front of your eyes, with cute characters and a few downright stumper-of-a-puzzles, give this a whirl.",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing and beautifully created game, pick it up i you want to chill out after a tense day at work ;)",
            "review_score": "1"
        },
        {
            "review_text": "The art is gorgeous, the story is vibrant and whimsical and the music is beyond lovely. It's a beautiful game.",
            "review_score": "1"
        },
        {
            "review_text": "Its one of those quirkly little games that makes you love it to bits.  10/10 no doubt.",
            "review_score": "1"
        },
        {
            "review_text": "A curiosity, but one I enjoyed. It's a game with some very basic puzzles, wonderful settings and its own little story to tell. Not gonna change your life but if you want to try something low key and new I'd give it a go.",
            "review_score": "1"
        },
        {
            "review_text": "Aminata design have a knack for this sort of thing. Again, just with Machinarium, they have put together a succinct world for you to solve puzzles in. The only difference between this and Machinarium (Other than the art and music style) is that Botanicula has a better story running through it.  2D point and clicking at its best.",
            "review_score": "1"
        },
        {
            "review_text": "I loved to play this adventure. The characters, styles, music and sound effects are so lovely. I just dived deep into this atmosphere of Botanicula which didn't released me till I finished this game.  In my opinion the puzzles were a bit too easy. But that's a subjective critic. It's depending in how good you are to solve puzzles. I love game like Puzzle Agent etc. So I have some practice.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game!",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous little puzzle game! Both the characters and music are absolutely fantastic, and the ways in which you have to figure the puzzles out are great. Though I haven't currently spent a huge amount of time in this game, I can already recommend it! It's just.... all round fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful music/sounds and visuals. LSD is a very powerful drug.  ",
            "review_score": "1"
        },
        {
            "review_text": "Super gorgeous art and challenging puzzles. It's a very fun, chill game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice thing. Didn't get what should I do to make progress and so on, but walking around and experimenting is also cool.",
            "review_score": "1"
        },
        {
            "review_text": "Starts off as amazing; finishes as frustrating. Worth experiencing nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't think it was possible to write a one word positive review of a game .... but here it is .....  'Magical'",
            "review_score": "1"
        },
        {
            "review_text": "bEaUtIfUl! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Very original art and a creative, relaxed gameplay. Would also be very good for a child as well.",
            "review_score": "1"
        },
        {
            "review_text": "I purchased this game on sale with Machinarium. Both are fantastic point-and-click puzzle games with excellent artwork and challenging (but fun) puzzles. This one took me slightly less time to beat than Machinarium, but it was no less fun. Loved the sound effects using vocals. Some of them cracked me up. Easily 3 - 4 hrs of gameplay (or more if you're an achievement hunter).",
            "review_score": "1"
        },
        {
            "review_text": "I know it isn't helpful, but there isn't much I can think of to say about this game. It's just perfect. The art, the music, the story are all quirky, cute, and charming. Whenever I think about this game, I smile; this game just makes me happy.  All of that is vague, but I didn't write this review to help other people decide whether or not to buy this game. I wrote this review to support this game and its developer because I think they deserve it.  But you should buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so incredibly cute! While simplistic in nature, there is a lot that this game has to offer: wonderful art, beautiful music, and characters that you truly grow fond of and enjoy taking through the game. Would recommend to anyone who likes simple puzzle games or point and click adventures - it's even worth it for the art, music, and experience if those normally aren't your game types.",
            "review_score": "1"
        },
        {
            "review_text": "fan·tas·tic (fn-tstk) also fan·tas·ti·cal (-t-kl) adj. 1. Quaint or strange in form, conception, or appearance. 2. a. Unrestrainedly fanciful; extravagant: fantastic hopes. b. Bizarre, as in form or appearance; strange: fantastic attire; fantastic behavior. c. Based on or existing only in fantasy; unreal:  3. Wonderful or superb; remarkable:",
            "review_score": "1"
        },
        {
            "review_text": "anything made by amanita design is cool",
            "review_score": "1"
        },
        {
            "review_text": "This is a charming, creative and heart capturing puzzle game. The art style and sound bits will make you smile. It's not super difficult, and I enjoyed it's simplistic approach to the puzzles. Overall fun!",
            "review_score": "1"
        },
        {
            "review_text": "Botanicula is the single-most charming game I've ever played. Also a serene study of the beauty in nature.",
            "review_score": "1"
        },
        {
            "review_text": "Superb art-make and sounds make this game an unforgettable experience. Feel like a child and set a journey to save the world with your cute friends :D",
            "review_score": "1"
        },
        {
            "review_text": "Just magical. If you can play with kids, you have to. They'll love it, and really bring out the wonder",
            "review_score": "1"
        },
        {
            "review_text": "Another gem from the studio that crafted Machinarium, Botanicula hearkens back to Amanita Design's roots with the Samarost games. Charmingly abstract and whimsical, the dreamlike tree-world and its assorted organic creatures will quickly whisk you away to a land with a more vivid imagination than most.  While Machinarium was more challenging and puzzle-focused, I really liked the brighter, more lively feel of Botanicula as a game (despite clocking it in one evening). If you like adventure games and are ready to accept the whimsical, then allow Botanicula to take you on a journey beyond your wildest imaginative fantasies.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unusual and awesome experiences I've had with a point and click. These guys make true gems!",
            "review_score": "1"
        },
        {
            "review_text": "love that bug english.",
            "review_score": "1"
        },
        {
            "review_text": "Having played Amanita's other games I had high expectations for Botanicula and I was not disappointed! The game is a wonderful visual and auditory experience. During the course of it I experienced bursts of laughter and joy no other game has delivered. Amanita once again proves that games can be art and that they are master artists.  I highly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "From the makers of Machinarium, this is one of the most charming games you'll ever play. Oh, and the music is great too. Definitely play with headphones.",
            "review_score": "1"
        },
        {
            "review_text": "Super adorable point and click adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "A clever game with cute graphics and a fun storyline. You and your friend are various aspects of nature (a dragonfly, an acorn, etc), and are trying to save your tree world from the forces of evil - spiders. The puzzles challenge you to think more logically and consider nature/physics, as opposed to match-three or hidden object. No puzzle is so hard that it would make you rage quit. Definitely recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Marvelous adventure for all ages! And the best thing that game greatly rewards player's curiosity, just try to click or drag any uncommon object on the screen and you'll always find something interesting and fun.  Write to me if you need help with achievments :)",
            "review_score": "1"
        },
        {
            "review_text": "10 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Botanicula is the kind of game to play with a significant other (which I would've done had I realized), exploring the amazing tiny world is something that just brings a smile to my face. The little voices in each mushroom, branch, bug and stone are so charming I couldn't help but feel happy every time I heard them. While simple in it's formula (just click stuff) it gives a sense of wonder as everything plays an intricate part of the environment, and it's up to you to find out how it all fits. Top that with some great feel good tunes and some of the most adorable creatures you'll ever discover, Botanicula is a perfect adventure game that won't leave your heart anytime soon.",
            "review_score": "1"
        },
        {
            "review_text": "A 2d point and click game where you run from the creepy black holes on legs, encountering the daily lives of strange, awesomely curious creatures. It's an imagination-stimulating, interactive picture book.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unusual and awesome experiences I've had with a point and click. These guys make true gems!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pure joy in software form. It's beautiful, and the sound design is amazing. There are some annoying sequences and it is very much a linear point and click, but it definitely makes up for its negatives tenfold. If you have any interest in the genre, you owe it to yourself to pick Botanicula up and give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "This game is just purely for puzzle solving and just to sit back and relax to it's amazing soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Blissful at times. Definitely worthwhile.",
            "review_score": "1"
        },
        {
            "review_text": "Botanicula is a point and click exploration puzzle game that is just fun and fills you with warm fuzzies. The music and characters are just delightful and imaginative, and every time you solve one of the puzzles, the little jingle and dancing characters is more than enough reward, even if it wasn't particularly difficult. The game just oozes creativity, and over the 4 or 5 hour playtime I only got frustrated at one part, and the rest was just a joy. Very recommended if you like point and click adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "game, music and graphic are so funny~",
            "review_score": "1"
        },
        {
            "review_text": "More cute than any game should be allowed to have. Short, but I enjoyed it thoroughly. There are secrets to find if you care for them.",
            "review_score": "1"
        },
        {
            "review_text": "An amusing, creative journey with lots of funny and entertaining moments along the way! I've been a fan of Amanita Design for several years now, after enjoying Machinaruim so much. Definitely recommended!",
            "review_score": "1"
        },
        {
            "review_text": "no joke, this game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "It is cute, but gets dead boring within minutes. Though this game was never designed for hardcore gaming in the first place :)",
            "review_score": "1"
        },
        {
            "review_text": "Like Point'n'Click Games? Then you will Love This 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Score: 8/10  This is probably the most balanced game this company has produced in terms of length, story, and difficulty. I highly suggest it to anybody that enjoys adventure games and the preview video of it. If you follow this company as a fan I'd say it is a for sure purchase.",
            "review_score": "1"
        },
        {
            "review_text": "This game is magical. Like, if a unicorn and a wizard had a baby, it would be this game. I wouldn't recommend this game if you're uncomfortable with feeling positive emotions, or if bright colours and music give you a serious case of the frownies.",
            "review_score": "1"
        },
        {
            "review_text": "For those of you who like a game with likeable characters, a good storyline, and decent gameplay this game I recommend. You will see a lot of similarities between this and the Pikmin series of games.",
            "review_score": "1"
        },
        {
            "review_text": "Wow that was a beautiful game! Sometimes the puzzles get a bit tedious, and sometimes there were action sequences, but overall it was very much worth it. The entire thing is an absolute visual feast.",
            "review_score": "1"
        },
        {
            "review_text": "The music is beyond beautiful and extremely fitting. Plays like previous amanita games. 8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Basically the best game ever.  But why are point and click adventures so hard?",
            "review_score": "1"
        },
        {
            "review_text": "An extremely charming puzzle game that's great for relaxing.",
            "review_score": "1"
        },
        {
            "review_text": "I have never seen a game quite like this first you don't really know what's going on, then as it goes you see that you are a seedling of the giant tree. And some kind of spider parasite thing wanted to kill you and drain all the life from your body. Like any normal parasite would, trying to feed it's hunger, acorn thing has it's friends and all of them have their own talents. Think of it as a giant puzzle game that you're not sure what it looks like. Never seen it before and just can't get enough of it since you want to find out the whole pictue of it. For 10 bucks is a pretty good price. Had this for a while never played it before today and wished I played it a lot sooner. Love this game since it's something your child could just watch you play and they would love the sounds and colors and think that maybe they could draw and do artwork and such like this indie game has. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Pros *Great visual design and animation. Great music and the atmosphere and non-verbal story-telling is really cool, similar to Machinarium (same devs) as far as characters speaking through picture speech bubbles. I like the contrast of the very vibrant, colorful, livid, lively, green environment and some parts where it's dying and a part close to the end when things get a bit dark, but no very heavy. *Would probably be great for children  *Can run on very low-end computers  Cons *There are only a couple things that were really puzzles. Mostly I was just clicking a bunch of stuff watching all kinds of weird (yet entertaining) things happen before it gave me whatever item I needed to proceed at the time.  *It's very abstract (which I like) and not really as much of a little world that Machinarium was, having really randomness to the different places and organisms you meet. Which I think Machinarium is a better game overall, telling a more cohesive narrative versus this game's sort of child drawing story (that could be taken as a negative or a positive).  *The game was really short. I have 2.7 hours on this game and that was with clicking on everything I could find, though I didn't quite 100% it but I wasn't far off. I had little to no problem with the 'puzzles' so I went through it pretty fast but even someone getting stuck a lot, if that's even possible, would still beat it fairly quickly. I think $10 is a bit pricey for a game that has little replay value and is so short.   In summary, this was an enjoyable experience especially at first glance at how wildly out there it was. It's a very sort kid's dream and occasionally nightmare with how abstract it is. But it was very short. I liked Machinarium more.",
            "review_score": "1"
        },
        {
            "review_text": "This is not a simple game, it's a poem. It's not only fun, it's tenderness. You manage to complete something in the game and just spend time staring at the screen, enjoying the little and yet beautiful things that happen. Puzzles are challenging but not that difficult as to make the game frustrating. Visual art is amazing, especially during the first part of the game where everything is so pastel-colored and relaxing. Music is great and sound effects are sooo cute. The only bad thing I can think of is that it's quite short. A little imaginative trip in a tree hidden wonderland.",
            "review_score": "1"
        },
        {
            "review_text": "This game was an absolute delight! Do recommend! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Charming and Imaginative.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, great artstyle and soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "It feels like playing cute art. The music, the characters and the story are beautiful. And the fact that it does'nt have words in it make it a really well made puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "Cute little point and click adventure. Not completely my thing but quite fun.",
            "review_score": "1"
        },
        {
            "review_text": "Amanita Studios is phenominal, and they show it through the quality of their games. The first game that sucked me into it all was Machinarium - this game has the same familiar feel and care of it. Soundtrack is excellent, animations are adorable, and it was really hard to stop smiling through the game. I highly recommend giving it a go!",
            "review_score": "1"
        },
        {
            "review_text": "Botanicula is the perfect escape from reality into this awesome world of silly creatures and beautiful music. Most indie-games are really dark or Bit-trip but this game looks so good and is full of sweet happiness. I wish it was a bit longer, definitly wouldn't say no to more!",
            "review_score": "1"
        },
        {
            "review_text": "Glad I bought this game. So much fun and cutness :3",
            "review_score": "1"
        },
        {
            "review_text": "-Good game  -Good music -Good game play",
            "review_score": "1"
        },
        {
            "review_text": "Very relaxing adventure with a low difficulty level.",
            "review_score": "1"
        },
        {
            "review_text": "Perfect game",
            "review_score": "1"
        },
        {
            "review_text": "This game is a charming, reasonably intuitive little puzzler which will get you emotionally involved in five... insects? And their quest to save and plant a seed from their tree.  I only had a couple fo instances of really getting stuck, which for someone who is quite poor at point and click style puzzles was pretty good. I love this game and it's visual/audio style.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very cute little puzzle game, pretty simple to 100%, and will give you a fair few hours of entertainment!",
            "review_score": "1"
        },
        {
            "review_text": "A lovely game, very short but there are a lot of hidden acheivements to try and collect!",
            "review_score": "1"
        },
        {
            "review_text": "Funny! Original! Amazingly designed and just makes you want to keep playing non stop ! A very special and unique game! oh and GENIUS sounds and soundtrack! adds A TON to the experience of the game!",
            "review_score": "1"
        },
        {
            "review_text": "Just finished playing this game, Had a fun time! The art is fantastic, and the music is nice!",
            "review_score": "1"
        },
        {
            "review_text": "Botanicula is odd. But it's an amazing type of odd. This puzzle, adventure, plant game takes you through a tree, where you have to solve puzzles and help the dwellers of the tree. This game requires patience, as some of the puzzles are hard but they are all the more rewarding for it. The soundtrack, for me, is amazing, and very relaxing at times. Pick this game up on sale if you dont have it, it's a good experience to have, one I would reccomend having.",
            "review_score": "1"
        },
        {
            "review_text": "This was a nice relaxing game. The art and music is fun and quirky while you click through exploring these little creatures' world. I would recomment playing through at least once just to uncover whatever you can before looking to the internet for hidden creature cards.",
            "review_score": "1"
        },
        {
            "review_text": "A cute point-and-click adventure game with a very unique and beautiful visual style and a world that's full of whimsy. Considering the time it takes to complete maybe not worth the full price, but definitely worth picking up during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very cute little puzzle game, pretty simple to 100%, and will give you a fair few hours of entertainment!",
            "review_score": "1"
        },
        {
            "review_text": "bEaUtIfUl! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "a very beautiful point'n'click exploration game. - gorgeous visuals - challenging puzzles - hilarious sounds  résumé... BUY IT :)",
            "review_score": "1"
        },
        {
            "review_text": "It's not often that a game can woo me with a memorable experience without ever saying a word of dialogue, but this one certainly did.  Botanicula is nature personified in all the most enthralling ways - you have this little party of seedlings of various types who explore different regions of this massive tree together, learning more not only about its inhabitants, but its history and its looming crisis as well. Everything you experience here has a charming, hand-crafted feel to it, from the characters to the backgrounds - even the soundtrack is a lovely, quirky mix of accapella in a sound reminiscent of the band Sigur Ros.  For some people, point &amp; click gameplay may not be the most exciting, but then again, most people who will enjoy this have played a few point &amp; click adventures, so the gameplay isn't too surprising. Aside from a few clickable areas that seem to keep you guessing a little bit too long, It's fairly easy to navigate. If you manage to make it through the game in one playthrough, you will definitely be staring back at the screen in awe. It's no Final Fantasy VII, but the sense of accomplishment after struggle is certainly there.  If you enjoy indie games, games with a hand-made touch, or games that are great at visual storytelling, then pick this up - you'll be glad you did, like I did :)",
            "review_score": "1"
        },
        {
            "review_text": "A captivating world full of whimsy, humour and lovable characters. Wonderful sountrack and delightful graphics. This is definitely a game I would come back to again and again when I am in need of a little magic. The game is forgiving and the puzzles are logical. There is much room for exploration and the attention to details is astounding even in the non interactive elements. Thank you so much for a wonderful experience!",
            "review_score": "1"
        },
        {
            "review_text": "a very fun, cute and relaxing game :-)",
            "review_score": "1"
        },
        {
            "review_text": "Reminds me of the 2000s.",
            "review_score": "1"
        },
        {
            "review_text": "One of the sweetest point 'n click games I have ever played.  Everything in this game drips of perfectness, from the music to the art style, and yes, even the story.  If you like the genre, this is a MUST.",
            "review_score": "1"
        },
        {
            "review_text": "The game doesnt take long to complete but it i a fun puzzle game with beautiful graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Another work of art from Amanita Studios. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Cute game that is enjoyable and can be played with a female companion who is not into gaming (girlfriend for example)",
            "review_score": "1"
        },
        {
            "review_text": "grate game that doesn't need any words to tell a storry and give you hints, what to do next.  lots of wonderful creatures, details, music, animations, soundeffects, puzzles.  also has some darker parts, where gamemechanics changes to you can actually do something wrong and you have to react. (darker mood part could be a bit scarry for for example younger children)",
            "review_score": "1"
        },
        {
            "review_text": "Literally 'Takk...' by Sigur Rós in the form of a video game. Absolutly stunning and beautiful, with its themes of life and bravery revolving around plants, fungi, bugs, and seeds.   Make sure this is one of the first things you pick up when there happens to be a Steam Sale.",
            "review_score": "1"
        },
        {
            "review_text": "I dont understand. linux version is available on  gog.com . Why there is still no linux port? too lazy? you don't care about us? I have several your games but i cant play.  I was waiting too long....",
            "review_score": "-1"
        },
        {
            "review_text": "not a lot of gameplay, really. basically a lot of random mouse clicking, some cutesy stuff and that's about it.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok game, Hard at times, got it with a bundle of games and it wasn;t he best but not the worst either. Overall, I would rate this game a 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "It's weird, and not in a really entertaining way. The sounds are sometimes really disgusting too. If you like weird games then I guess this could be great for you, but 51 minutes is all I could stomach. I loved Machinarium and Samorost, but Botanicula is just not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't smoked weed in, like, twelve years. The last time I chiefed that keef I was at a party at some DJ's house and he was handing out joints to everyone because I guess that's how DJ's win friends and influence people. I hesitated, but being that everyone else was doing it and I had no real reason not to, I smoked the one he gave to me.   Weed is really stong these days. I don't know if they still grow the dirt weed that I used to smoke in high school, but back in the day I could do bong rips until the sun went down and not really be any worse off, just really hungry and couch-locked. That joint the dude gave me - that one joint - had me laid out on the couch thinking that my heart was going to explode and wishing I had never gone to that party in the first place. After we all smoked our joints the DJ announced that it was time for a cigarette break and motioned us all to step outside because for some reason weed was ok to smoke indoors, but tobacco was not. So I stood up to follow everyone outside and as soon as I got up, my vision went black and I passed out on the floor. Just, like, crumpled and fell down. No one cared. Absolutely no one gave a ♥♥♥♥. Nobody ran to my side to see if I was okay, no one rolled me over to make sure I wouldn't vomit into my airway. Nothing. I came to a couple minutes later when everyone had finished smoking and these girls were just walking over me to get back inside and claim a spot in the comfortable chairs.  A real friend - no, any decent human being - would have the compassion to check on the guy who just fell down and went unresponsive. And as unpleasant as that evening was, at least it taught me not to hang out with Ken and his DJ friend anymore.  SO, this game may look cool, and have pretty colors and seem slighly reminiscent of Samorost, but the similarity ends there. It's not really that fun, and I would be remiss if I let you click that buy button. The puzzles are okay, I guess, but the more I played this pile, the more I found myself wishing I was playing Samorost.",
            "review_score": "-1"
        }
    ]
}