{
    "app_id": 208200,
    "name": "Doom 3: BFG Edition",
    "release_date": "2012-10-18",
    "developer": [
        "id Software"
    ],
    "publisher": [
        "Bethesda Softworks"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Horror",
        "Action"
    ],
    "achievements": 65,
    "positive_ratings": 3957,
    "negative_ratings": 772,
    "price": 14.99,
    "description": "The ultimate collection of games that defined the first person shooter, the BFG Edition includes the entire DOOM series and a remastered version of DOOM 3!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/208200/header.jpg?t=1447355476",
    "minimum_requirements": "OS:Windows vista/ Windows 7 Processor:2.0 GHz dual core Memory:3 GB RAM Graphics:NVIDIA GeForce 9800 GT / ATI Radeon HD 5750, 512 MB video RAM Hard Drive:11 GB Sound:Windows compatible sound card",
    "recommended_requirements": "OS:Windows Vista-64/ Windows 7-64 Processor:2.4 GHz dual core Memory:3 GB system RAM Graphics:NVIDIA GeForce GTX 260 / ATI Radeon HD 5850, 768 MB video RAM Hard Drive:11 GB Sound:Windows compatible sound card Additional:3D Monitor + compatible glasses",
    "reviews": [
        {
            "review_text": " Review for the VR mod for DOOM 3 BFG (RB + OpenVR)      Doom 3 BFG VR might be the new best solo VR game on the market. It offers the perfection of a Doom with free hand-movement, room-scale and fully 360 / 3D immersion. It feels, it looks and it plays like the Doom game we were all dreaming about when Carmack was first talking about it regarding the Oculus Rift. At the moment the mod is Vive exclusive as far as I know.",
            "review_score": "1"
        },
        {
            "review_text": "If you play for achivements or if achivements are kinda important to you, then I have a big surprise:  Taking screenshots with F12 will disable achivements because the game detects it as console input and therefore as a cheat.  They set a console command for a game that they release on Steam on the same key as the screenshot key. To ever get any achievements you gotta restart your whole progress. It wouldn't be so bad if it notifies you instantly that you activated a debug command... it does so many hours later in the game when you would unlock your first achivement.  Yes, you can rebind the F12 key, no problem but it's not the only instance when the game locks you away from certain features. When you change the graphic settings during a running session, it will also be detected as a cheat. (Not joking, lots of people complain about this in the forums)  The game is out since 2012 and this was never updated.   Is the game good, other than that? Yes it is, it's very good in-fact. It's a blast.  But not fixing such a MINOR issue after 3 years shows how little interrest they have in the BFG editon. Not a single post of a DEV in the Steamforums, no moderation, nothing.  They simply do not care about this game on PC and this is why I can't support this.",
            "review_score": "-1"
        },
        {
            "review_text": "Ahh, Doom, one of the first FPS games that changed gaming. The original Doom's were pretty much perfect, perfect levels, perfect enemies, perfect weapons, great games.  Now even though Doom 3 is a good game too, it kind of lacked some things that the older Doom's had. Doom was all about rushing through hell while destroying all of hell's minions, while Doom 3 was a bit different. None the less, Doom 3 somewhat offered the same experience as the older Doom's. Same enemies and weapons, but not necessarily the same level design.   I am going to compare Doom 3 to Doom 3 BFG with some pros and cons, so you will know which Doom you'd rather get.   Doom 3 BFG Pros:",
            "review_score": "1"
        },
        {
            "review_text": "Even though DOOM 3 is old-school, it still scares the pants off of me when I play it. Lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "Don't make the mistake that I made and buy this game. The games included are not only not moddable, but censored and lacking certain pieces of content, at least in regards to Doom 3. On top of that, this game is surprisingly vulnerable to just straight-up not working. My copy of the game just started crashing at launch at the point when I had already clocked in about 18 hours of play. Fan-freakin'-tastic.  Sure, this bundle includes Ultimate Doom, Doom II (with No Rest For The Living) and a remastered version of Doom 3 that has a significant amount of graphics, engine and performance-related improvements with some superficial negative changes to the original Doom 3 experience that can simply be rectified with a few mods, but the same can be said for a singular copy of Doom 3 that you can buy individually. That's where my main problem with the game lies; the upsides of the BFG edition are only ever expressed through a few more dollars that you just saved, but even then, you'd be better off buying the Classic Doom Bundle and Doom 3 individually. Here's why.  First off, the inclusion of Ultimate Doom and Doom II. It's great, isn't it! You get a neat little collection of two legendary games that defined generations to come and are still fun to play to this day and Doom 3... but, as I said, just buy the Classic Doom Bundle. Not only do you get Ultimate Doom and Doom II, you also get Final Doom and Master Levels for Doom II for, like, two extra dollars. It's worlds better than the copies of Ultimate Doom and Doom II included in the BFG edition for two extremely important reasons. For one, the BFG edition copies are censored. For two, the BFG edition copies   ARE NOT MODDABLE.   On the other hand, the copies included in the Classic Doom bundle are absolutely moddable. That's right, folks, the BFG edition is not moddable.  Second off... well... Doom 3 is Doom 3. It has its audience and I won't really be doing a full review of the separate game here, but if you ask me, just do yourself a favour and buy Doom 3 by itself when it goes on sale for about $2.49. Sure, it's missing the exclusive Lost Mission pack... but... I wouldn't give a scrap of an iota of any interest. I just don't care about it, to be honest. And yes, Doom 3: BFG Edition has some pretty significant changes to its singleplayer such as the changing-up of already-delicately-structured combat into an inconsistent mess and the complete omission of certain elements such as the Hazmat Suit. These changes don't exactly help to strengthen the initial construction of Doom 3's singleplayer. To be frank, they really weaken the whole survival-horror aspect of the game.  Believe me, you're not saving yourself any money here with this bundle. Just walk on by.",
            "review_score": "-1"
        },
        {
            "review_text": "This is great if you've never played, or don't have all the DOOM games. Doom 3 BFG edition gives you a (most fans would say worse) remaster of Doom 3('enhanced' lighting, 'better' graphics... no more mod support...), and packs them with Doom 1 and 2.  If you don't have any of the DOOM games, sure get this. It'll be cheaper. If you own all, some (or at least just Doom 3) you shouldn't bother... It's probably not worth it.  Yea, bfg is a downgrade compaired to the original Doom 3.",
            "review_score": "1"
        },
        {
            "review_text": "The original doom is probably why you should buy this, I grew up with it and its still fun to this day, doom 3 is eh and Doom 2 is pretty much a continuation of the original doom.",
            "review_score": "1"
        },
        {
            "review_text": "It has censored and broken IWADs for Doom 1 and 2, no Master Levels of Doom 2; and adds nothing to Doom 3 that the SIKK mod didn't already do.  However, it comes with NERVE.WAD; which is now the third 'official' IWAD alongside DOOM.WAD and DOOM2.WAD. So if you want to play No Rest for the Living then pick this up.  On sale. Don't pay more than $5 for this shovelware.",
            "review_score": "-1"
        },
        {
            "review_text": "I honestly wouldn't recommend getting this BFG Edition if you already have Doom 3 on PC already. But if you are a hardcore fan and you want the extra levels included as well as having the originals within one game then for the price it's currently available at go for it. There are hardly any graphical improvements as in all honesty for its time Doom 3 looks AMAZING, it was like the Crysis of the PC games in 2007 but for the Xbox. The game is pretty scary and you'll be very thankful for that flashlight by the time you finish it!",
            "review_score": "1"
        },
        {
            "review_text": "I got this for around 7 bucks at gamestop to prepare for DOOM 4. I enjoyed it all the way from E1M1 to Sin, to the cyberdemon.  Let's start with the best feature; this game contains 3 games, DOOM 1, a censored DOOM 2 (no nazis for a german release), DOOM 3 with Resurrection of evil, and a new DLC full of deleted scenes. Graphics aren't the best, but I recommend turning the Texture lod slider to minimum, as turning it to the maximum actually lowers texture quality.  Not really sure what else to say, so I'll make things quick  Pros:    Flashlight - now on the suit, making it less dark     Good Story - An actual book writer was hired for it. It's not much, but the game IS story driven.     Good gunplay - The main feature is gunplay, good strength.   Neutral     The biggest complaint, yet biggest strength among the fanbase is that it's 'it's own thing', being a horror based game in the beginning, but slowly becomes an action based game with horror elements.      PDAs - They're very helpful with backstory, comic relief, and finding hidden stashes. Keep an eye out.   Cons     A sort of complaint I have is that bodies dissolve on death, and cannot be dismembered. The dissolving is seen in DOOM 4, too, though, but it's sad to see the chainsaw make something just dissolve.     You cannot press f12 without the game disabling achievements for the entire playthrough. It claims the console was opened, but there is no console in this version.  ",
            "review_score": "1"
        },
        {
            "review_text": "Very good classic oldschool game!",
            "review_score": "1"
        },
        {
            "review_text": "should have been called Call of Chuthulu: Spess edition instead of doom 3  on a more serious note, doom 3 dousn't really feel like doom, but its still an enjoyable shooter",
            "review_score": "1"
        },
        {
            "review_text": "This game is special to me. I could go on and on and on how much I recommend this game. Horror filled, blood, guts, gore, and great atmosphere. I remember playing this on the Xbox and having my mind completley blown. Great, great game. Person to person, I urge you not to pass this game up.",
            "review_score": "1"
        },
        {
            "review_text": "Excessive screen-tearing and sub 60 fps renders this game unplayable imo. Better off buying the original Doom 3 which has the flashlight as its own item.",
            "review_score": "-1"
        },
        {
            "review_text": "TOOT. And ♥♥♥♥ you ID for almost abandoning this game.",
            "review_score": "1"
        },
        {
            "review_text": "Doom 3: Bretty Fun Game edition.  sate all of your demon killing needs in one place.",
            "review_score": "1"
        },
        {
            "review_text": "Time Bought: 3 months after released ON STEAM Money Spent: $14.99 Worth The Price?: Yes Position In Game At Time Of Review: Played it before I had a Steam account....played it ALOT   I ABSOLUTELY LOVED DOOM 3!!!! It was the first fps scarefest that I ever played so it personally has a special place in my heart...the cardiac arrest place. Old skool now but back then, the lighting and sudden scares were way above it's time. I even had a grudge against RAGE because ID Software put DOOM 4 on hold to make it....and now there is no more ID Software or DOOM 4 in the making :/  Rating: 8/10 (I would give it a 10 back when it first came out)",
            "review_score": "1"
        },
        {
            "review_text": "It's Doom. The Father of the FPS genre. Doom 1, 2 and 3 you don't get much better than that. 11/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Rematch 2004? I quess HL2 was first to get a VR port, but it doesn't work anymore and/or sucks, and this game is in vogue now because of the mod.   People going bananas over it. B-a-n-a-n-a-s, bananas.  ",
            "review_score": "1"
        },
        {
            "review_text": "Doom 3 can be best summed up as being a game with tons of replaybility, excellent lighting and a very good story line. I actually own several different copies of this game. The one I have on Steam, and several others on other platforms. I have not had the pleasure to play with the Occulus yet, but I hear that is a very enthralling experience. This game is very encompassing. I recommend you play this in the dark. ",
            "review_score": "1"
        },
        {
            "review_text": "It's fairly fun, It's got a fairly good story, but if you're looking for DOOM Doom, you're better off going way oldschool or getting the brand spanking new one. THIS Doom plays more like a horror graphic novel than a genuine Doom game. Bit disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "does not like my pc. no help to fix the problem. avoid this game it does not work.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the ♥♥♥♥, you guys. You should play it. *Touches nose, nods conspirationally*  You know. You know.",
            "review_score": "1"
        },
        {
            "review_text": "It's quite linear and has some cool scares, a grean improovement over the original with the shoulder lamp and the chance of playing the originals makes this a great retrospective and nostalgic package. I would recomend it easy and lightly to any Doom Fan.",
            "review_score": "1"
        },
        {
            "review_text": "vr mod rocks don't miss it!! playable with supersampling x2 and everything maxed out with a gtx 1080, some async timewarp here and there btw, install beta steam vr!",
            "review_score": "1"
        },
        {
            "review_text": "Still better than a lot of crap out now :)",
            "review_score": "1"
        },
        {
            "review_text": "Looses the horror charm of the original Doom 3. I never startled or jumped like I did in the dark with the original. I just run ran through the linear levels, pumping lead into unaffected monsters until their death animation started. Guns feel artificial, architecture is repetitive boring.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this game.  In Delta Labs Lobby, there's a button for the elevators. If you push that button before the power is turned on, the button is permanently stuck and you cannot advance. ID ♥♥♥♥ING KNOWS ABOUT THIS AND DID NOT CHANGE IT FOR THE BFG EDITION.  There is no autosave before you enter this room.",
            "review_score": "-1"
        },
        {
            "review_text": "Everything you remember about Doom 1, 2, and 3, but worse. Buying the original version of every one of these games is a better use of your money.",
            "review_score": "-1"
        },
        {
            "review_text": "PLEASE NEVER BUY THIS!  If you like doom at all, hell even if you don't, never buy this ever.  60 fov as standard, the only sound option is volume, you can't skip any cutscenes, there is no original flashlight, the characters look worse with the 'new' lighting, they changed the pda layout? (whyyyy??) armour mounted flashlight kills the pacing and gameplay design completely, on the hardest it's a cakewalk when you can see everything. Ever wonder why imps hold their fireballs so long? it's so you can see them in the ♥♥♥♥ing dark, because ID thought of everything. When you have a mounted flashlight it just doesn't matter. They had them seperate for a reason! so you have to choose between sight or might, but no. Just ruin the entire experience, thanks! The graphics are actually worse too, you can't see the shadow your flashlight casts and on a whole it just looks like ♥♥♥♥!  Doom 1&amp;2 have less options then their 1992 counterparts. Lets just let that sink in. LESS options. than the original version from 1992!!! because I don't see a way to change the controls. and at least the 1992 had a setup exe where you could change all kinds of ♥♥♥♥. You can't get rid of the statusbar. The worst part? You can't skip the ending credits. I went back and checked, you can in the 1992 version. Why in the hell would they change that??? WHY?!?!  This is absolutely terrible in every way.  Bethesda once again puts their stink all over something.",
            "review_score": "-1"
        },
        {
            "review_text": "I love doom the game is amazing so i purchased it on steam during a sale under the assumption i could play it and have a great time. after downloading i started it up and what did i see not doom no what i saw was a pop up box with blue coding text that i was unable to understand. After hours of reading forums and looking for help on the internet i discovered this glitch happened frequently to many people and bethesda still has yet to release a steam patch for it so i decided ♥♥♥♥ it i will get this on a console and not put up with this coding ♥♥♥♥♥♥♥t. If you buy it the game is amazing i know since i played on my 360 but keep in mind the steam version needs adept PC knowledge in order to get working so make sure you're prepared for that",
            "review_score": "-1"
        },
        {
            "review_text": "This game doesnt work",
            "review_score": "-1"
        },
        {
            "review_text": "The sound mixer is all wrong. Ambience is far too high, the already weak weapon and sound effects are -far- too low and every noise is kept on one central slider. You have no control over individual sounds. Basically, the sounds are broken and there's no way to fix it. Virtually none of the changes made were for the better and most are unnecessary to begin with. Also the classic Dooms are cencored and missing levels. All aspects of the Doom series covered in this package are only worsened by it. There is nothing difinitive about this version.",
            "review_score": "-1"
        },
        {
            "review_text": "WTF BEX error. I got bex error at my two PCs. google, steam forum, nobody can't solve this god damn error. Don't buy this ♥♥♥♥, when BEX error appears, 1 of 2 can't solve it. And bethesda and Id don't solve it too. Even Battlefield 4 can launch, but this?Launch failed by bex error everytime. 2 PCs are both Win7 64bit and dx11, well 1 can launch and the other launch BEX. DOOM 3 BEX EDITION. Fxxk the doom, I'll play half life.",
            "review_score": "-1"
        },
        {
            "review_text": "I LOVE Doom 3 and all of its editions including the BFG edition. Few games come close to the 'play in the dark' suspensefulness I've experienced while playing this series.   Can't wait for the release of Doom 4. I hope that its multiplayer will allow marines to faceoff against demoms",
            "review_score": "1"
        },
        {
            "review_text": "DOOM sure is a game never loose the touch with time , this awesome pack with 2 original and classic dooms with 3rd one you should give it a try if you are like me who is saving for doom 4 really love the achivements i wish it could have some more for the old dooms like the 3rd one nevertheless this kick ♥♥♥ pretty fair price for all it give you",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant, brilliant, brilliant.  Actually bought and played through Doom 3 in advance of starting the new one. Was pleasantly surprised - the flashlight mechanic and survival horror elements make it in some ways feel more modern than Doom 2016. Not better, mind you, but more modern.  An extremely creepy, atmospheric gorefest. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "An olie but goodie! you can't go wrong with this one.",
            "review_score": "1"
        },
        {
            "review_text": "I've heard some things about the BFG edition, but DOOM I and II are still fun to this day.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic bundle whitch includes the remastered version of DOOM 3 and the bonus levels, Resurrection of evil and the Lost Mission. The Frame rate is uncapped so you will get the highest frame rate your PC can handle, also has improved resolutions that are far superior to the original DOOM 3. They have moved the flashlight onto your shoulder that has a battery now, where the original you actually had a flashlight that you held, must admit it's great not having to fight monsters in the dark, but it was a horror feature that DOOM 3 was supposed to have. Overall, the graphical improvement to DOOM 3 is great and i think they did a really good job.   The bundle also includes the original DOOM and DOOM II: Hell on earth as well as all the extra episodes whitch is terrific, for some reason they capped the Frame rate of the original DOOMS at 35 fps, I am unsure why they have done this, possibly to capture the original DOOMs better i suppose. Also includes achievements for the game whitch adds a little more replayability to the game.  Overall, this is a fantastic bundle, and a great way to relive the legenary DOOM experience.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing shooter game. For those who likes doom 1 and doom 2, Doom 3 is a 'MUST HAVE' game !!",
            "review_score": "1"
        },
        {
            "review_text": "Not as scary as I was when I was 8, but it still gives you a good scare!",
            "review_score": "1"
        },
        {
            "review_text": "It comes with the first and second Dooms. They're the best games. If you disagree, you're stupid.",
            "review_score": "1"
        },
        {
            "review_text": "This game is sick played thru it multiple times and each time wanting to play thru it again buy it play it win awesome graphics sweet gameplay and brand new feel.",
            "review_score": "1"
        },
        {
            "review_text": "If you hated having to use a flashlight and the lack of ammo and speed, this is the DOOM 3 Version for You!",
            "review_score": "1"
        },
        {
            "review_text": "Playing doom 3 and Ultimate doom with that framerate is so satisfying",
            "review_score": "1"
        },
        {
            "review_text": "The best new feature of this game has to be the mounted flashlight on your weapons. Gone is having to switch back and forth between exploring and fighting, but I will admit that this somewhat takes a good amount of the suspense away.Other then that you get the same story with same set of enemies but with better lighting and shadows.The game also has the expansion pack along with a brand new mission.It also features Doom and Doom 2 so if you're a fan then this is certainly worth the time and effort.",
            "review_score": "1"
        },
        {
            "review_text": "Doom; the ultimate horror gaming franchise. I've been playing Doom games ever since I could understand how to use a mouse and keyboard.   Doom 3: BFG Edition gives you Doom, Doom II, a slightly retextured Doom 3, Doom 3: Resurrection of Evil and the previously unreleased Doom 3: The Lost Mission. All of which are oustanding titles worth playing.   Doom 3 and it's expansions are a personal favorite of mine. They bring the perfect mix of what FPS games should be: Good content, immersive lore, boss fights and just enough horror to make you second guess which hallway you want to go down.   I recommend any lover of FPS or horror games purchase Doom 3: BFG Edition. It will leave you more than satisfied and you'll find it difficult to peel yourself away from the computer.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game But hard for disabled people",
            "review_score": "1"
        },
        {
            "review_text": "It's a really good game and it also comes bundled with Doom and Doom 2.Personally I consider it a must buy if you enjoy old school shooters.",
            "review_score": "1"
        },
        {
            "review_text": "Doom BFG is not remake game but it is a big patch for Doom series, If your love large arsenal, fast gameplay, solid gunplay and ID Soft style you will love it.  Caution : Obsolete graphic, Old school gameplay and Problem with AMD graphic card.",
            "review_score": "1"
        },
        {
            "review_text": "Just a fantastic game all around,and probably one of my personal favorite FPS!!Doom 3: BFG Edition is cool because it contains the first two doom games plus the Resurrection of Evil expansion that adds 8 new levels to the game.The Resurrection of evil expansion really gives you a lot of extra game time(Almost as much as the base game)Plus it's got achievements.So you really are getting a lot of bang for your buck!  I loved the first two Dooms, and had planned on purchasing them until i noticed they were included in this pack.That makes this def worth picking up.If you can get it on a sale then hey even better!The plot is pretty decent,and the voice acting is for the most part well done.You play as a transfer to the Union Aerospace Corporation located on Mars.The UAC has been doing research on artifacts that were recently discovered in an archeological dig.Dr. Betruger the director of research at the Union Aerospace Corporation research facility on Mars has used these artifacts to open a doorway to hell.Turning everyone into evil possesed asshats ,and unleashing legions of hells demons.Soon after your arrival at the UAC things start to go south ,and it's up to you to fight the evil and save humanity.  Now I've seen a lot of people complaining about a few of the graphical changes ,and honestly i really didn't notice that much of a change.That being said It has been many years since I've played this so i guess it wouldn't matter much unless you recently played or have a great memory!Then there's those who say it's unmoddable....well i hate going around downloading crap ,and messing with files so with me it's fine!Also that this version is super easy with health and ammo laying around everywhere.Well there is but there was in the original if i recall.Also there's difficulty settings so just play it on hard if you find the game a little to easy.As far as atmosphere is concerned this game has tons of it!It's visually appealing and it's opressive,dark,creepy ,and definitely leaves you feeling like your alone in space fighting legions of demons.Nice level design,and the bosses are all great!Do yourself a favor,and pick it up already!!!",
            "review_score": "1"
        },
        {
            "review_text": "I actually liked more the DOOM 1 and 2 remakes that come with it. DOOM 3 is just OK.",
            "review_score": "1"
        },
        {
            "review_text": "The ultimate collection of the best game ever this is my number 1 favorite game of all time all the best dooms in one these are my favorite I have played Doom64, Final Doom, along with the old school doom missions pack this is a great mix of arcade horror gamplay and features some of the coolest demons to shoot, the demons range from small to huge and same goes for the guns to you can blast away a Imp with a shotgun or whip out the BFG 9000 and blow away a Hell Knight the one thing in this game when you first play it is that you never know whats around the corner I have played the old Dooms since they were all on the oldest consoles and on the old computers this game is amazing and after you play the crap out of this game and beat it play it in all the difficultys for max enjoyment I can not stress this enough you must buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "the only good thing about this game is the fact that doom 1 &amp; 2 come with it and they are a lot cheaper than 30$  the game is ugly, not only because of its age but its weak aesthetic  bad sound design  lacks the fun exploration and run and gunning fron the original  dont buy unless on sale",
            "review_score": "-1"
        },
        {
            "review_text": "The motion blur makes me motion sick",
            "review_score": "1"
        },
        {
            "review_text": "This collection includes the original DOOM I, II, 3, Resurrection of Evil and The Lost Mission.  That's why it is simply the ultimate DOOM collection! I played the original back then and I play it now with the same excitement and enjoyment.  The Remastered graphics of the third game really stands out compared to the original ones - back in 2004 when DOOM 3 was originally released! (Can you imagine that was 10 years ago...) HIGHLY RECOMMENDED to any horror shooter fan!  IT IS SICK!  IT IS BRUTAL!  I T ` S D O O M ! ! !",
            "review_score": "1"
        },
        {
            "review_text": "Its Doom 3 for console.  The gam itself it relatively unchanged, but modding support is crippled. Many features from the standard version (Graphical options, sound options) are gone.   Fairly good value on it's own, but considering the standard version is still available I really can't recommend this one in it's present state.",
            "review_score": "-1"
        },
        {
            "review_text": "I am not recommend this bundle. All games in it is good, but this bundle isnt.  1. It is not support SteamCloud for some reason, but all games in it separately does.  2. Classic Doom are censored. 3. Classic Doom are miss some functionality. 4. All games made more easy.  Only good point that classic Doom work fine on modern PC without using a DosBox. But there is tons of guides how to make DosBox to work fine on any PC.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't play it. More than likely my fault. It will start and then bail. It seems my graphic card doesn't support the needed GL drivers. I thought I had checked this out, but I missed it. Since it was my bad, that's where I am. (As a side note...I brought the original Doom 3 disk on Amazon. Installed it and updated it and it runs great. It's just not the BFG edition. ) That's a nice game but it gets just a bit to dark for me. If I ever get this up and running, I might have more to say......   Update: 12/16/14: Well, I see some work has been done on this. I'm at least able to start the game now but it goes to a blank black screen after the station report. I still can't really reccomend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I have BFG and the original, I HIGHLY recommend to get the original instead although both are decent. The only reason you should consider BFG is for the 3D and occulus support if thats your thing. Read this before you decide on purchasing BFG edition. TL;DR In BFG you should expect  Pros -possibly more populous multiplayer? -3D support -Native Controller support Cons -Worse graphics -reduced difficulty -worse shadows/largely increased brightness -removal of most horror aspects -less mods/compatibility with current mods  --------Long form reasons for Original over BFG--------  - Gameplay mechanic changes. One of the controversial changes in BFG was the addition of the built in flashlight and removal of the flashlight weapon/item. It sounds silly to fuss over but you really need to experience the original masterpiece the way it was made to be played before bashing people for complaining about it. The game had many key scenes that were structured around that game mechanic. They pull off genuinely spooky scenes where the lights would go out and they time appearances or jump scares perfectly with how long it takes to pull out your flashlight. The flashlight mechanic was like a double edged sword, while equiped you were ready to proceed with full knowledge of your surroundings but limited on what you can do about them while gun equiped in a dark hall you might pass by a hidden foe ready to give you a surprise attack from behind! -BFG is awefully bright in comparision to the Original, like horribly bright. Maybe it had something to do with making it for occulus rift? Perhaps 3D doesn't look good with pitch black corners so they filled all dark spaces with a light gray? Whatever the reason you probably wont even end up using the new flashlight mechanic on BFG with how visible everything is. This added to the flashlight mechanic you should expect BFG to be more of a run n gun shoot em up style game whereas Original Doom 3 will be leaning much more towards the sci fi horror. The amazing shading and shadows in original doom 3 are vastly reduced with the brightness in BFG thinning the line between 'that looks amazing' and 'those textures look 11 years old..' which brings me to my next point.. - There have been many custom mods created for original Doom 3 that are not compatible with BFG and make the game look better than even the latest and greatest titles out there. There are some good pre-compiled mod packs with multiple mods mixed in you can find with simple instructions with a quick google search. I recommend Sikkmod 1.2, Monoxead high-res texture pack, and Trent Reznor's sound pack. I have a 6 core CPU and AMD 6970 and some of the settings with shadows and shaders Sikkmod offers can really make a modern PC struggle, play around with it and find what works for your rig.",
            "review_score": "1"
        },
        {
            "review_text": "Running around Mars City naked with a Chainsaw huh? Why not ^^",
            "review_score": "1"
        },
        {
            "review_text": "This is a much smoother version of both Doom 3 and Resurrection of Evil, with bunch of little tweaks to enhance what was already a great game. The Lost Mission is fun, if slightly simplified and a lot shorter than the main game.   Basically, if you're already a fan of Doom 3, you should get this edition.",
            "review_score": "1"
        },
        {
            "review_text": "I own both orginal doom 3, and the bfg edition. If you already on doom 3 there are mods/texturepacks, that are simple to install that will make doom 3 shine like never before. That said if you have a 3d tv and xbox 360 controller the bfg edition has some cool features, I enjoy playing in 3d on 51 inch 3d tv, with 360 controller in hand. bfg does not support mods at the time I picked it up. If you are the type of gamer who prefers keyboard and mouse at your desk you might as well stick to the orginal, and add sikkmod,wulfen texture packs. If you do own a 3d tv or monitor its worth it. I enjoyed the 3d a lot! hope my reveiw helps.",
            "review_score": "1"
        },
        {
            "review_text": "This is some good ♥♥♥♥ brah",
            "review_score": "1"
        },
        {
            "review_text": "Oh Doom 1 2 and 3 all great game the old Doom is great playing the old doom again is so much fun its a blast with all the sercets and geting the Big ♥♥♥♥ing gun is great 2 is even better it inproved on what 1 did have you run through hell again now 3 i dont see why so many peopel think its suchs a bad game 3 is good it just a newer verison of the frist one its story is good and geting the guns are good but i still have 1 promblem with 3 the shutgun is that worest weapon ever the shotgun was the best gun in 1 and 2 how could you make the shotgun suck balls the BFG might be the best weapon in the game the shotgun is a close second but in 3 i used the chaingun more then the shotgun beside that its story is good and seeing the emeans again are great i wish the imp would look better but they are what they are the other mission are good as well still with the shot gun was good not even the super shot gun was useful i was always full on shotgun ammo becasue i never wanted to use that gun but what can you do this game is still great i love playing the old dooms again",
            "review_score": "1"
        },
        {
            "review_text": "whoo, thanks to my cat, he brings to me a toilet paper, when I playing Doom 3.",
            "review_score": "1"
        },
        {
            "review_text": "Why have I never recommended Doom:BFG Edition yet? Killed things in hell - like a boss! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "There's really no way to over state this, but doom kicks ♥♥♥. It's the quintessential FPS. If you haven't played it, I don't believe you. At all. Seriously, how the hell have you not played Doom? ♥♥♥♥♥♥♥t.  So, you're on steam and you see Doom 3 BFG edition, and you think “oh hey, this could be cool. It's Doom 3 remastered with the Resurrection of Evil, Doom 1, Doom 2, and new levels for Doom 3. For 20 bucks? That sounds like a deal.  Well, it's not all good. It's better than a poke in the eye or an Assault Horizon in your steam inventory, but some of the things that were done to the BFG edition don't make any sense. Because, these days, remastering doesn't translate to updating the visuals but rather ♥♥♥♥ing everything up, there's a lot of bizarre choices made here.  First, let's address Doom and Doom 2 here. They're complete and they work, but neither have any real options for visuals and it runs at 35 FPS constant. So, drop those bad boys into GZDoom and forget about it. You'll run it at 60, have loads of options, and even superior sound quality.  But, if you wanted those games, you'd just get those. You wanted Doom 3 in a higher fidelity. Well, it's Doom 3, so it's not terrible. But, they've really messed about with the game in some weird ways. This opening cutscene is a perfect example of what I mean. Just look at those new facial textures. This really sums up the BFG edition in a concise example. It's still Doom 3, but there are odd things going on. Design changes without rhyme or reasons like Why the ♥♥♥♥ did they change the rates of fire? Why did they ruin the chaingun? Why did they reduce the rates of fire for both the Machine gun and plasma gun? Why? Seriously, the Chaingun is terrible now? The intentional design changes make little sense, if at all. I will give them this though. They attached the flashlight to your armor. That does make a lot more sense than having to literally tote around a flashlight. It never really bothered me, but I seem to be in the minority on that one.  So, let's just begin with the actual remastering work done here. I use the term work loosely. They've really done almost nothing at all in that regard. They've changed a few textures here and there to try and make characters look better, but it really just comes off as putting lipstick on a pitbull. They haven't increased polygon counts, they've barely touched up textures, and they've ♥♥♥♥ed up the FOV. Cutscenes aren't framed as well as the used to be.   So, most prominently, a lot of weapon physics have changed. As I mentioned before, the Chaingun is all but worthless now. It has value against killing cacodemons and that's about it. The Machinegun and plasma rifle also have seen changes. Again, why? I know why. This was some attempt to “balance” things for multiplayer. Because, Doom 3 was really well known for being great in multiplayer, right? From the get go, it was a game focused on a good singleplayer experience, with multiplayer coming secondary. It's very much an old game in that regard. You know, when developers actually put effort into their products? But, you'd think that'd actually make it harder, right? Nah. They've made the game ridiculously easy, now. Check this out: I usually play on Veteran. Let's go through the first level. When you get the shotgun, 8 rounds loaded, 4 in reserve. Now, in BFG edition? 8 by 8. That doesn't seem like much, but it adds up really fast. So, by the time you encounter the first Imp in the regular edition? 8 loaded, 10 reserve. And in the BFG edition? 8 rounds chambered and friggin 41 in reserve. And, by the time you reach Marine HQ? Check your machinegun. Full load. 60 in the mag and 600 rounds reserve. Gone is the deliberate corridor crawl, desperately looking up cabinet codes to get a few more precious rounds. Now, you can just skip over that all together. Sure, both original Doom 3 and Resurrection of Evil are here and intact, but they're made bland by the new less conservative gameplay. On top of that, there's a new campaign called the lost levels. It's a little shorter than Resurrection of Evil and starts out ok. There's even some new levels here, even if they feel less inspired than the other two campaigns. But, they just decided to be ♥♥♥♥ing obnoxious. I like challenge, but for christ's sake there's more Archviles in this single campaign than the original two combined. And the ending is seriously DeviantArt levels of fan-fiction. The story isn't complex: you're helping a scientist, teleporting to hell, fighting literally the Guardian of Hell boss reused from the original, and then escaping. So, you escaped from Mars during the actual ♥♥♥♥♥torm of 2145? But, it says at the beginning of Resurrection of Evil that there was only one survivor. Not going to explain that, game? Why not? Where were you on the evening of April 5th, 2015? Were you the one that took a ♥♥♥♥ on my lawn? Do that again and I'll ♥♥♥♥ing kill you.  So, it's clear that BFG Edition was aimed at improving multiplayer and, frankly, that's like beating MovieBob in a footrace. This, ironically, ends up as its weakest point. Ok, so the competitive multiplayer is.. pretty much dead. But, from what I've toyed around with, it seems actually really cool. But, ♥♥♥♥♥♥♥it, I don't want my microphone on at all times. On PC, we have other alternative Voice-over-IP programs like Teamspeak, just let us ♥♥♥♥ing turn off the ingame mic and use that. I guarantee you that the sound codec in game blows anyways. But, this is all there is to multiplayer. Given that one of the most popular mods for Doom 3 is OpenCoop, I think they might've failed to recognize something that people might want. Seriously, why the ♥♥♥♥ isn't there co-op? The Xbox version had coop, even. Why the ♥♥♥♥ doesn't the latest incarnation have it?  So, Doom 3 BFG Edition, despite its flaws, is still Doom 3. Kind of. It's $20 and that's not an awful price? Oh, wait, yes it is. You can get Doom 3 and its expansion for $13. Just get that. You're really missing nothing in the lost levels other than a fan fiction level story and a fairly forgettable campaign.  And for ♥♥♥♥'s sake, you've played the original Dooms. So, really, just skip on the BFG edition. It ♥♥♥♥♥ on lawns.",
            "review_score": "-1"
        },
        {
            "review_text": "The game feels as the original Doom 3, nothing new in the game but only the improved graphics, widescreen option, 3D vision, you don't have to swicth between weapon and flashlight all the the time, the flashlight is integrated on your armor, and able to play with a Xbox 360 control.  The only good thing is you have three games in one packege.  Kind of bad you can't add mods as the original.  Just good.",
            "review_score": "1"
        },
        {
            "review_text": "It's still awesome after all these years. Looks even better now with it's updated graphics and it includes the expansion and original games. Definitely a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "It's basicly the same as Doom III with a flash light on guns as an 'upgrade'. If you don't like Doom 3, don't bother with this version either.",
            "review_score": "-1"
        },
        {
            "review_text": "The freaking game doesn not support modifications, or mods... How can you make a remake that enhances minimal aspects of a highly estigmatized game like Doom 3 is and make it even worse than it's original release, you can clearly see this was a sloppy attempt to cash in on the franchise adding both Doom and Doom 2 for free and the absurd premise of 'better enhanced modern graphics' it's awful in any way concibable, however one of my biggest complains comes from the waste that this is, it is clear that they were also trying to get people to remember doom and those who are utterly unfamiliar with the franchise can actually fill they're curiosity by playing the three games of the franchise only to then announce the sequel for the next doom coming up as a beta in Wolfenstein: The new order.  If you want to play doom 3 buy the original, it's cheaper it can be moddable in order to get even better graphics that this version and overall it is the true vision of the designer, do not keep supporting the same companies trying to adopt this methods from other companies that in the end only affect the gamer in a negative way. It isn't worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game embodies an experience full of jump scares and scary enemies. Worth a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Hardly Recommended!!! For Shure ;) Best FPS/SHOOTER HORROR GAME EVER!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is an epic ensemble of an amazing series made even better, it DOOM, DOOM II, and DOOM 3, and DOOM 3: Resurrection of Evil both remastered in HD, and also more cut content called The Lost Mission. This is worth the asking price, with ease.",
            "review_score": "1"
        },
        {
            "review_text": "Quick Summary: Doom 3 came out around the same time as Half Life 2, and while Doom’s story isn’t as good as Half Life 2, the graphics really hold up. Don’t be fooled by the crappy opening cut scene graphics, because Doom 3 is one of those games where gameplay visuals are superior to its rendered cutscenes (like Just Cause 2 or Injustice). If you’ve played the Bethesda game RAGE, you should have a decent idea what to expect in terms of graphics. The BFG edition contains not only Doom 3 and both its expansions (Resurrection of Evil and The Lost Mission), but also Doom 1 and Doom 2. Each time you start up the game it asks which Doom you want to play, and all three have Steam achievements associated with them. Keep this in mind if you care about your achievement % and don’t like playing “old” games. You also won’t find too many people playing the Doom 3 multiplayer.  Doom 1 and 2 are straight up shooters and don’t really have much story other than a screen of text that you only see after you beat the game, so Doom 3 is basically a reboot. Contrary to popular belief, Doom is not based on the time Satan borrowed money from Chuck Norris and then wouldn’t pay him back. You play an unnamed marine, newly arrived on the Mars research base when all hell breaks loose, literally. The scientists in the base have uncovered artifacts from an ancient alien civilization that when combined with teleportation technology, open a portal between our universe and a hell dimension. Despite the fact that the Mars base is packed with marines armed with an insane amount of firepower, the demons have quickly overrun the place (along with about half the base being possessed by evil spirits) and it’s up to you to quash the source of the invasion.  Like its predecessors, Doom 3 is a First Person Shooter with a horror atmosphere. You’re trapped in the darkness most of the time, and it seems like monsters are around every corner, as well as occasionally teleporting in behind you. There’s no regenerating health, and some levels require a fair amount of backtracking, so don’t automatically pick up every health and armor you see unless you know you’re about to finish the level. You might come back through the area and need it later. Doom 3’s difficulty setting only affects how damaging the enemy attacks are, not enemy HP or intelligence. This means if you get the timing right for avoiding enemy projectiles, the game won’t be too hard on Veteran mode (especially after you get an artifact later on that makes healing a whole lot easier).  You should get Doom 3 BFG edition if: +You have no intention of modding the game. Most mods were made for the base Doom 3 game, and since BFG edition made changes to the game engine, most of these mods don’t work anymore.  +You want to spend as little money as possible in order to play Doom, Doom II, Doom 3, Doom 3: Resurrection of Evil, and Doom 3: The Lost Mission. The BFG edition includes all of these and adds Steam Achievements (which aren’t available in the base Doom 3 steam game). The Lost Mission cannot be purchased alone from Steam as a DLC for regular Doom 3. +You enjoy horror games, with zombies, demons, big creepy spiders, and tortured souls. You should quick save constantly because those demons really, really love teleporting in behind you or hiding behind false walls.  +You enjoy moderate paced shooting games (slower paced than Serious Sam). You cannot run through commando style unless you really know what you’re doing. There are a lot of health packs lying around, but even the lower tier enemies can tear you apart in seconds.  You should NOT get Doom 3 BFG edition if: -You don’t care to play the older Doom games (or the Doom 3 expansion packs) and are planning to apply game mods, like improved graphics, higher difficulty, new campaigns, etc.  -You hate jump scares or dark game environments. In the original Doom 3, the flashlight was sort of a standalone weapon that you could club people with. You couldn’t have it out along with a gun at the same time. This meant that when engaging an enemy, you would often be fighting in the dark. This has been modified in Doom 3 BFG, and the flashlight is now automatically attached to whatever weapon you have equipped. It drains battery when in use, so you can’t have it on all the time.  -You are getting the game mainly to play multiplayer. The game doesn’t have co-op campaign gameplay, and there don’t seem to be any games going on when I look for online servers. You pretty much have to create a game lobby and invite friends to it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Its Doom...  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I dont know even where to begin. Well, there are constant trobules with achivements. Dont get too excited about Lost Mission campaign, its a short and cheap copy&amp;paste job from original Doom 3 levels. There is no zoom in anymore, cant even change ctrl to crouch, and cant play it with mods. But not everything in this edition is bad. There are a few good things too. Flashlight is now attached to your body armor, BFG edition includes both Doom 1, Doom 2, and thats about all. Anyway I recommend original Doom 3 instead of this. If you already own Doom 3, then DO NOT BUY IT.",
            "review_score": "-1"
        },
        {
            "review_text": "The voices! What do they mean?! They tell me to kill i must obey.",
            "review_score": "1"
        },
        {
            "review_text": "Got stuck in a pipe, had to enable console and noclip. Closed game, disabled console. 'Achievements have been disabled on this save due to use of console this game'. Thanks Bethesda!",
            "review_score": "-1"
        },
        {
            "review_text": "Reminds me of childhood :)",
            "review_score": "1"
        },
        {
            "review_text": "The Doom 3 BFG Edition is the ultimate collection of Doom games. This edition contains Doom 3, the expansion pack Resurrection of Evil, a new expansion called The Lost Mission, Ultimate Doom, Doom 2, and the Doom 2 expansion No Rest For the Living. All of these games have full Steam integration which includes achievements, leaderboards, and multiplayer support (which is dead by now because Doom 3 multiplayer always sucked ♥♥♥♥).   Doom 3 and its expansions are remastered in new HD graphics (I personally don’t see much of a difference). In fact I’ve noticed that the environments are a lot brighter in Doom 3 which really kills the atmosphere that originally made the game so scary. The textures are noticeably enhanced, but not enough to really warrant paying the retail price.   The Lost Mission is short and uneventful. Essentially just a few more recycled corridors from Doom 3 with nothing new or special. I was expecting a significant expansion like Resurrection of Evil, but it was far from it. I’m happy to be playing the original Doom games though. They run perfect on Windows 7 with great controls and even have achievements. For the first time ever, I’m actually going to finish Doom 1 and 2. It’s fun to play games that defined a genre and the Doom 3 BFG Edition allows just that.   On the whole, it’s a nice edition, but the drawbacks from Doom 3 and the disappointing Lost Mission expansion really let me down. Although they aren’t terrible, they’re still enough to put off fans of the series.  ",
            "review_score": "1"
        },
        {
            "review_text": "Beat all 3 campaigns on nightmare. The game involved a lot spamming F5 and loading than playing but when things were going well it was fun.",
            "review_score": "1"
        },
        {
            "review_text": "*shuts off lights, cranks up sound* 'Ah, time for some DOOM3.'  *first imp jumps out*  'F*** this! Carebears with the lights on!'",
            "review_score": "1"
        },
        {
            "review_text": "Doom 1 -thumbs up- Doom 2 -thumbs up- -thumbs up- Doom 3 -thumbs down- -thumbs down- -thumbs down-",
            "review_score": "1"
        },
        {
            "review_text": "I really do not understand how people don't like this game 10/10 classic first person shooter classic",
            "review_score": "1"
        },
        {
            "review_text": "Doom 3: BFG Edition is a compilation of famous FPS titles. It came out in 2012 for PC, Xbox 360 and PS3. It comes with very slightly modified Ultimate Doom, Doom 2 with No Rest For The Living episode from XBLA version and much more heavily changed Doom 3, Resurrection of Evil expansion pack and Lost Mission episode that is exclusive to BFG Edition. It doesn't include Final Doom and Master Levels of Doom 2. You can get Master Levels on Steam only by purchasing Doom 2.  These versions don't support mods.  There are few problems that I experienced on my not-so-modern laptop. Logo movie freezes here and there. Not that I care. Then there was performance troubles for D3BFG on my laptop. There were parts where it would start to stumble and lag, hiccuping heavily. Not to say that original D3 was better. At least this one doesn't lag everytime the door is opened and shadows don't start to glitch around when entering next level.  Critical: It's possible to get stuck on Delta Labs 1 in Doom 3 and Phobos Labs 2 in Resurrection of Evil. Buttons to get elevator and lift moving will not work sometimes. Make a manual save at the beggining of those levels!  Multiplayer is like in D3 Resurrection of Evil, having only competetive modes like Deathmatch and Capture the Flag. And probably isn't much interestesting. And community is dead too. The only big gameplay-wise change from BFG edition is that you can have flashlight with other weapons, so turning off lights on Power Out map doesn't make much difference.   Ultimate Doom is fairly accurate to original version. It's awesome old-school FPS games. You explore a maze, while running around at high speed and avoid projectiles, while conserving and scavenging ammo, shooting at tons of baddies out of weapons that you find, with each weapons being useful against various ranges and enemy types.  What I liked is that while there are many source ports out there that change graphics and features of a game in various ways, developers of BFG edition only increased resolution and made it work on modern system. This way the game is more or less feels like original was intented to be. Instead of playing standart MIDI music, it uses instrument similar to Gravis sound card. They did something to sounds, as it feels that they play with randomized pitch.  Now you heard probably heard scary word 'censored'. Before you grab your pitchfork, here is what censored in Doom 1: Red Cross on medkits was changed to pill. I have no idea what kind of person would rage over this one. Nightmare difficulty, which was so cheap that even developer of original warned you that it's unfair one, was made more sane. Skill gap between UV and Nightmare was way too huge. Original had respawning and agressive enemies with speeded up movement for enemies and projectiles. BFG doesn't have increased speeds. But I would have prefered if it didn't had respawning instead, so I still don't care, as it forces speedrunning playstyle.   Doom 2 felt more like expansion pack to original game, with new monsters and one overpowerful weapon that is Super-Shotgun. It focused on uglier design, bigger crowds and on even more strangely puzzling mazes. More on latter though.  Same thing about graphics and sounds. Super Shotgun reload sound is different. Same nightmare and medkits changes. But the secret levels, easter egg references to Wolf3D levels, were censored up. Nazi textures were removed, gameplay was changed a bit as Nazi soldiers were changed to weaker zombies. And they removed the awesome music. Which also impacts the ending of Doom 2. It still works as reference to Wolf3D with levels layouts, but it's not as fun.  But unless Hitler portrait is definition of D2 for you, it shouldn't be a big thing.  And it also comes with new 9 level episode, No Rest For The Living, by Nerve. It was exclusive to Xbox Live Arcade for some time, and now that it's included in BFG, it means that PC gamers get to play it too. No new enemies, weapons or textures, but it's really well-designed episode. It playes like something out of Doom 1, but with modern level design. Where you have very little puzzling maze exploration, just getting ambushed, conserving ammo and killing things. It was enjoyable to find secrets and even have a few big secrets for big weapons.   Now, Doom 3. It's a game that tried to be more of survival horror, with monster closets who jump at you, linear base corridors, having to listen to audiolog to find codes for supplies. With darkness and shadows giving tension, as you either used flashlight or weapon. But not anymore.  When D3 was released, most hardcore Doom fans who would call it 'all graphics, no soul'.  'Too dark! Not enough ammo, have to read PDA for codes for supplies! Walk is too slow! Monster closets and 1-2 monster encounters!'  At first id Software would show unhappyness over mods that allow user to use flashlight with any guns. After a while developers, under players pressure, started to agree that those were bad ideas. Like John Carmack saying that Doom 3 could be better if you actually could see things. And so after many years, developers of D3 finally got to do what they wanted: to fix most of those complaints. They even put 'flashlight anytime' as feature.  But 8 years passed since then and a new generation of gamers grew up. Mostly those who played D3 in childhood. And people are more accepting to old games. And so out of 'heretics who ruined Doom franchise' developers became 'heretics who ruined Doom 3'. That's gaming community for you.  But personally I prefer original Doom 3, since changes that gamers wanted don't fit game. - Flashlight is now mounted to armor instead of separate weapon. And levels were brightened up too. It removes darkness part of gameplay that made D3 more unique. First half of game feels shallow without it, since it's just 1-2 weak monsters encoutners. - Ammo count is increased extremely. And I thought that original had too much. Sure, players don't have to feel left out without reading PDA info for codes. But now Plasma Gun is your primary weapon. - They tried to make game less annoying. Slight changes to stats of weapons and enemies. Some remixing of monster placement. And they increased movement speed slightly. I didn't feel as if I was almost slipping when platforming, so it works!  BUT I know a friend who is Doom fan and couldn't get into Doom 3. Only with Doom 3 BFG he finally beat it and said that it's fine game with those changes. Success story!  It also includes Resurrection of Evil expansion pack. BFG benefits from it, since it's more action-oriented. RoE itself doesn't benefit from BFG, since it got many cuts! Maybe developers found those unfun, but they cut memoriable scenes. - No air limit or effect of wearing suit in toxic sewer tunnel. - Unique minigame machines swapped to Turkey from D3. - No phasing to hell version and out in Delta Labs. Was great effect, didn't interrupt gameplay. - Cut big fight in Hell! - I don't think they brightened levels themselves. Nice. - Boss fights are better. Third boss has no saferoom below room into which I always fell accidently. Final boss doesn't summon Lost Souls.  It also includes Lost Mission, with 8 levels. And it has cool Hell levels. Apparently, those are cut levels, probably heavily edited for BFG edition. No wonders that they were cut, base setting was overstaying in Doom 3. No new monsters or weapons, but it playes nicely and fits to more actionish style of BFG.   It's not the best pack. But it starts to make sense when you find out that it was primary for consoles, where it's the best version. And if they didn't port this version players on PC wouldn't officially get LM for D3 and NRFTL for D2. And seeing how DooM 4 turned out to be action instead of horror, this pack fits as appetizer to it, with D3 changes making sense this way.",
            "review_score": "1"
        },
        {
            "review_text": "steam needs a meh betton",
            "review_score": "1"
        },
        {
            "review_text": "I got this game pretty much exlusively for easy doom 1+2 coop only to find out it doesn't exist. very frusterating.",
            "review_score": "-1"
        },
        {
            "review_text": "Comes with doom 1 and doom 2, doom 3 with some dlc. I really like this version of doom 3. Looks clearer and smoother. Also you can see better because it's less dark. Fun game on LAN also!",
            "review_score": "1"
        },
        {
            "review_text": "DOOM 3, SCARY AS ♥♥♥♥. 10/10. ok d3 isnt that scary i mean ya thiers some jumpscares and all but ive played worse. the originals are the best and d3 is a close 2nd next to quake 2. i still want to play d4 or in other words DOOM.",
            "review_score": "1"
        },
        {
            "review_text": "Terrible optimization, rivaled only by the developer's technical support.",
            "review_score": "-1"
        },
        {
            "review_text": "An amazing game for any huge doom fan like my self, been a huge fan of doom since I was a boy and I just love this graphicly improved version of Doom 3 (Not that the previous version was bad &gt;w&gt;) 5 outa 5 for this one, strongly reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "Its so much fun, it reminds me a little bit of half-life and black-messa, i was shaking all the time! 1 and 2 are too realy fun",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game and immediately returned it after only 1 hour of gameplay. The ports of Doom 1 and 2 where just fine but Doom 3 was a disapointment to me. As someone who had never played Doom 3 and knew very little about it, I was devastated to find out it was literally nothing like Doom 1 and 2 gameplay wise. In fact it played more like a slower Half Life title straight down to scripted pieces of the set falling seconds before you walk over them or seeing scientists in danger in very scripted and dull sequences that you have already seen if you have played HL1 at least one time. Basically Doom 3 was boring, I had very little fun playing it, while it may not have been long, it was long enough for me. I would not recommend this game to anyone unless you only want the Doom 1 and 2 copies but even then I have read that they are the censored versions and are not moddable on top of that. Overall it was quite disappointing for a fan of Doom 1 and 2.",
            "review_score": "-1"
        },
        {
            "review_text": "  Excellent, this version it is just perfect for nowaday PC (enhanced graphics, wide resolution, you can even adjust the FOV) and there is other changes like the torch which is combined with the armure and not a handy torch etc.. Anyway I like this game so much mean the campaign, that I already play it once and half (on different level) anyway If you know Doom, Quake, Hexen, Heretic etc ... I have nothing to say : 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Doom 3 BFG Edition is very fantastic and its alot better than the Original Doom 3! You want me to tell you why? This game is really smooth, High Definition, and they have an extra Maps called 'Lost Mission'!",
            "review_score": "1"
        },
        {
            "review_text": "Doom 1 and 2 working pretty well on Win 7 x64, excellent games. And Doom 3! Great game, extremely underated! It is a game focused on atmosphere, yes it is diferent from the other Dooms, because it's not fast like them, doesn't have music (but great ambient sounds, again amosphere bro!) and the story is really good. It shows the beggining of the nightmare happening. Graphics Ok and good sounds effects. For me the game aged well, it's not revolutionary, but definitive good.  If you like scary F.P.S. like Dead Space, Aliens games, even stuff like Amnesia and F.E.A.R. pick up this game. If it is on sale even better you get 3 games in One  Note: 8.5 for Doom 3",
            "review_score": "1"
        },
        {
            "review_text": "Easily recommend this.  The original Doom games, plus Doom 3 and its expansion.  If you're a fan of the series. there's no reason to pass this up.",
            "review_score": "1"
        },
        {
            "review_text": "Ultimately, I am not a real fan of DOOM 3, mainly because they didn't really bring the ideal concept of what DOOM was suppose to be. They turned it from a simple FPS to a FPS with missions and less gore than expected.   About the only worth while quality this game has is the following...  1.) I got it for $10 in a bargain bin 2.) It includes DOOM 1 &amp; 2 3.) 3 games for 1 price  Although I don't like DOOM 3, I am a big fan of DOOM 1 &amp; 2, so I was happy I got a triple feature. I enjoyed this game back when it first came out as a 4 floppy disk version, and I am even happier that it's in HD.  So, my real point is this...  1.) If you liked DOOM 3, go for it 2.) If you liked DOOM 1 &amp; 2, definitely get it 3.) If you can get this for $9.99, it's worth the buy since it is 3 games in 1  I only recommend it because there's 3 games, that's about it.",
            "review_score": "1"
        },
        {
            "review_text": "Chainsawed a fat guy and shotgunned a flying baby in the face. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia at it's finest..",
            "review_score": "1"
        },
        {
            "review_text": "If you haven't played doom, don't call yourself a gamer...",
            "review_score": "1"
        },
        {
            "review_text": "Just shut up and buy the game, if you've come this far there is no turning back. Grab your nuts and your shotgun and go forth 10/10 would punch cyberdemon again",
            "review_score": "1"
        },
        {
            "review_text": "racecar with a shotgun game",
            "review_score": "1"
        },
        {
            "review_text": "the bfg stands for Bthe Foriginal Gdoom3isalotbetterbecauseithascoopsupportandisntacompletemess",
            "review_score": "-1"
        },
        {
            "review_text": "Just ♥♥♥♥ing stupid annoying intro which can't be skippable, Like 90% players who played Original Doom 3 knows that we can skip intro/cutscene but on this 'remake'(can't call it a remake) developpers says no, I bought this, started and have waited for Bethesda Logo or other ♥♥♥♥, went to the option because it was set all to low, key bindings because of course everyone still uses LEFT ARROW RIGHT ARROW ..........................................................................................., Now i was so eager to start but the cutscene at the start killed it so i just alt-tab-detele and forcequit this game because it ♥♥♥♥♥♥ me off and of course does it worth that much money because they ♥♥♥♥ing added Doom I and Doom II? Definitely no. Okay the only good point on this edition is the new single player maps, but that's all but ♥♥♥♥ i wasted so much time for downloading and ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Throw a bunch of blurry textures, bright lights, and random different colors into Doom 3 and what do you get? Doom 3 Bad ♥♥♥♥ing Game Edition. There's a clear amount of down-scaling of texture resolutions, an increase in light-sources which screws over the engine of the game and removes the dramatic lighting, they simplify the gameplay by adding a flash-light to your armor, so it constantly illuminates the left side of the screen instead of the middle, and the huge amount of ammo means you will rarely ever be challenged. Only reason I would recommend buying this would be for the completely new Doom 2 campaign they made just for this game, but seeing as this is Doom 3, and not Doom 2, I wouldn't recommend it at all.   Save your money and just buy the original Doom 3 since it's still on steam. It's a much better experience, runs a lot better, and isn't simplified and down-scaled to run on a wider-variety of computers (how would you not be able to run Doom 3 at max settings in this day and age? What could cause them to downscale ANYTHING in this game?)",
            "review_score": "-1"
        },
        {
            "review_text": "Buy the Doom 3 Pack that contains the better version of Doom 3 and its expansion. This version is sadly really watered down.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game speicifically for DOOM3, boy was that a mistake. This game is just meant to be on a console, on PC, I already have DOSbox and ZDOOM. Don't bother with this, get the original doom3.",
            "review_score": "-1"
        },
        {
            "review_text": "great bundle, recommend it to anyone who likes doom, and would want a refined sersion of it.",
            "review_score": "1"
        },
        {
            "review_text": "The BFG edition of this game plays slightly better than the old one, and eliminates the awful handheld flashlight, while adding a bunch of extra ammo in the two original campaigns. The lost mission campaign is awesome and fun, and the game also includes Doom (including the 'Ultimate' fourth chapter) And Doom 2 (Including the never before available on PC; no rest for the living) they play way better than the individual games do on steam if you have them, but not as good as they play on modern source ports. The Game has some irritating problems though. You have a rather limited amount of save slots, cutscenes can't be skipped, The wolfenstein secret levels in Doom 2 have been neutered to remove all nazi stuff, including the ss officer monster, And a handful of things are missing from resurrection of evil, most notably the room in hell where you fight the army of hell knights and mancubus just prior to the boss. I would recomend this game to fans of old school doom, its improvements and the sheer amount of content more than compensate for the flaws.",
            "review_score": "1"
        },
        {
            "review_text": "The BFG package does not allow for modding and is, overall, literally worse than Hitler. Do not buy the BFG edition.",
            "review_score": "-1"
        },
        {
            "review_text": "when are those punks from the skate park gonna come over and ramp off my errection and do sum sik trix??",
            "review_score": "1"
        },
        {
            "review_text": "Playing Doom 3 again actually made me appreciate finishing Duke Nukem Forever. Just save yourself the money and buy Doom 1, Doom 2 and Doom 2016 and pretend this travesty never existed.",
            "review_score": "-1"
        },
        {
            "review_text": "No Co op Campaign",
            "review_score": "-1"
        },
        {
            "review_text": "Not impressed. I guess the HUD stretches in the original but otherwise no improvements except for a torso mounted flashlight that seems redundant because of how much they've toned down the darkness and might bother the purists. There's no option to siwtch back to the old flashlight either and it doesn't look even 1% better than the original especially because of how the lighting looks now. You are better off with the original and a texture pack as there aren't a lot of video options compared to the original either. The lack of Steamworkshop support is also a shame.",
            "review_score": "-1"
        },
        {
            "review_text": "While this game has been improved slightly most of these 'improvments' eather brake the game or make it bad. 1. Modding has been removed Modding is a big thing with ID, Valve and PC games in general, games like Counter-Strike and Killing Floor wouldent exist without modding 2. The game was built arround a controller. Yes i know, a PC company designs a PC game arround a controller while it is still fairly playable with a keyboard and mouse they changed the in-game touch screens and the PDA menu to work better with a controller, while it isn't a bad thing they should of kept the old cursor and PDA menu for us PC gamers who play the game the way it's ment to be played. 3. The shoulder mounted torch. I persenally liked that the torch was a weapon that had to be pulled out for it to work, i mean it can be useful but this isn't AvP2 or Half-Life. 4. No multiplayer in the classics. While this does let you play the classics you can't play multiplayer or co-op and like the 'main' game (i say main but i really mean DooM 3 since this is DooM 3 and the classics are just an optional extra the devs wanted to give you) the classics in DooM 3 BFG aren't moddable and it's impossible to get No Rest For the Living in normal DooM so you can play it through a source port like ZDooM or DooMsday. 5. We get normal DooM 1 not Ultimate DooM, yup thats right, this version doesn't come with the forth episode like in the console port. There are a few more problems with this game that i've seen like making the game a little too easy for the console kiddies and casual PC gamers. Although there are a few good improvements like Multiplayer now works through Steam now and there is a Capture The Flag gamemode in normal DooM 3. In general i'd say get the normal DooM 3 and it's expansion as quickly as you can because Zenimax will probably remove all the classic DooMs from Steam so people buy ID's new games.",
            "review_score": "-1"
        },
        {
            "review_text": "Doom 3 is about 10x better than the new 2016 Doom. The game has the classic dodge and shoot feel of the original DOOM, while somehow managing to bring you into a world where you are terrified, at the edge of your seat, and excited for the storyline to continue all at the same time.   The game was way ahead of its time, polished very well and does what many games fail to do; balance skill based mechanics vs luck based ♥♥♥♥♥♥♥t very well in order to provide a very enjoyable experience.  The game is well polished with very intriguing PDA data logs, videos, and sound clips that will keep you begging for more. In my humble opinion, it is the pinnacle of the DOOM franchise. Even when compared to todays games, it is sure to inspire and keep you interested.   9.5/10 - One of the best games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Doom 3 is terrible. It is pretty much Rage, with old graphics and a flashlight. The gunplay and enemy scripting is frustrating, and for me, just ruins the game. The ambiance and tense nature of the game could have made it amazing, but the core gunplay/fighting mechanism just doesn't work for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Recommened even if (like me) you have the original D3 on CD-ROM, although I would wait for a sale which they always seem to have on this title. At $10 or under the 'Lost Missions' alone are worth it, and IMO if the original D3 would have been more like the lost missions, it would have been much better received. I'm not sure who they had working on the lost mission expansion, but they did an outstanding job. Maybe not as long or as much of a story as RoE but without a doubt the lost mission felt the most like 'Doom'. Also included the original Doom and Doom II, if you're so inclined.  Basically I haven't played this game since launch and I wanted to go back and do it all with every graphics option enabled and then some. Runs much better on a 290X than it did my 9800 Pro. :) I had fun with this title and definatley worth the $5 or so I paid on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I liked Doom 1 &amp; Doom 2, which you get with this version of Doom 3. I also like Doom 3 and surely the Resurection of Evil and Lost Missions!",
            "review_score": "1"
        },
        {
            "review_text": "Doom the best game to ever be made...nothing needed to say",
            "review_score": "1"
        },
        {
            "review_text": "Truely one of the best games of its time, release of the BFG edition was the perfect way to get people back into the classic game. definitely more could of been done but all round it is sure worth a 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Classic Carnage. The Wolfenenstein/Doom games started the FPS era. This is a great game to go back to when you are feeling nostalgiac.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game. It also surprised how much play time is in it.",
            "review_score": "1"
        },
        {
            "review_text": "what cant u say about it. ur a single guy with his hands and a pistol and u pick up a shotgun and chaingun and mow down things stronger than any other of the worlds army could, and ur only 1 man. i bought it for 10 dollars, was on sale at EB.",
            "review_score": "1"
        },
        {
            "review_text": "A sweet return to the doom days. Includes all Doom titles and a few graphical tweaks on Doom 3. Only complaint is how they have completely removed the need for a flashlight, this really helped to add fear, do you have light, or a gun? Now it's just a shoulder mounted flashlight that was taken from a previous mod made by someone else.",
            "review_score": "1"
        },
        {
            "review_text": "It's Doom 3 again, only this time more console-y! So, after finishing Doom 3, RoE, and the Lost Mission, I have to say that this version of Doom 3 is not as scary as before. The added tactical flashlight really kills the darkness (also the lighting engine is different). Unlike the originals, you have a limited number of saves (like 20, I think).  Those things aside, the game is great! 'The Lost Mission' was actually decent in length (maybe an extra 4-5 hours of content) AND you get the original Doom 1 and 2 in widescreen and with native mouse controls.  I really think this is a good version of Doom 3 if you don't already own them on steam.. If you do, I'd say this is most likely a pass (unless you own an Oculus Rift).  A+",
            "review_score": "1"
        },
        {
            "review_text": "Anyone who claims they are an expeirnced fpser and hasnt played doom or quake, ♥♥♥♥♥ please.",
            "review_score": "1"
        },
        {
            "review_text": "Classic. The second oldest FPS franchise. Doom 3 still scares the hell out of me. Love it.",
            "review_score": "1"
        },
        {
            "review_text": ":D 10/10 :D I just wish it also had Final Doom :DDD and Steam Cloud Support :DDD",
            "review_score": "1"
        },
        {
            "review_text": "This is a classic! I have beat it several times and still love to play it!",
            "review_score": "1"
        },
        {
            "review_text": "this game has stopped working on my main desktop computer and my laptop computer which both are more than capable of running doom and dishonored both of which no longer function atall just an error message something like VC redist package error code 51 ,not happy waste of money stung like a gooden dont buy steam stuff !",
            "review_score": "-1"
        },
        {
            "review_text": "The Doom and Doom II iterations that are included are awesome. Worth the price alone.",
            "review_score": "1"
        },
        {
            "review_text": "Going through Hell and back. The story is great but the graphics nothing to be proud of the Gameplay is quite the wonder while it is not that scary but it has Unlimited jumpscares throught the entire game. Worth it",
            "review_score": "1"
        },
        {
            "review_text": "great all-in-one Doom package that eliminates the need for Doom and Doom II source prorts, while adding native widescreen support and a convenient checkpoint system to Doom 3",
            "review_score": "1"
        },
        {
            "review_text": "Is it wrong if I'm having more fun playing Doom/Doom2 than Doom 3?",
            "review_score": "1"
        },
        {
            "review_text": "11 years is a long time to keep the DOOM 3 franchise going with a re-release/remaster. Can't say it's a super improved version, in fact it's not very mod friendly as most of the DOOM 3 mods won't work with the BFG edition. However, it's definately the whole package. They've added Doom 1 and 2 to boot, which is nice!  I'll show my appreciation for this game however by saying that waaaaay back before Doom 3 was released, I managed to get my hands on an Alpha version, were talking about 2002-2003 anyways. I couldn't believe how incredible the graphics looked. When the game was finally released I was still dumbstruck by how good the game looked, played and felt to play. To this day I'm still impressed with what ID managed to do, I still have that same appreciation for Doom 3 as I did back 11 years ago. Even with it's minor flaws, this is still a great game.",
            "review_score": "1"
        },
        {
            "review_text": "I've been following DOOM ever since I started with DOOM II back around 2002... I was eleven years old when my uncle decided to invite me to play on an LAN with his buddies. I died so many times untill I learned the ways of the game. In 2006 I was able to get DOOM I &amp; II. By that time I had only been able to play DOOM 3 at a friends house.  This series got me started with FPS games, and now that I have DOOM 3 BFG Edition I can say that my collection is complete... For now.  Not even Halo or Call of Duty can match my love for DOOM. People who diss these games normally end up meeting my fist. Best FPS games ever. I hope to see more from id someday. 10 out of 10? Nope. I give it a 100 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "These evil monsters scared me in my children days, now they are just some pixeled ♥♥♥♥♥♥s xD",
            "review_score": "1"
        },
        {
            "review_text": "Too bad that it doesn't have subtitles.",
            "review_score": "1"
        },
        {
            "review_text": "Slightly above average gun sizes.",
            "review_score": "1"
        },
        {
            "review_text": "While I am waiting for the new Doom come, I can enjoy the nostalgic Doon collection. :)",
            "review_score": "1"
        },
        {
            "review_text": "I definitely recommend Doom 3: BFG Edition! This Game comes with Doom 1, 2, and a HD version of Doom 3. If you have never played Doom before you are missing out on some great games... BTW Doom 1 and 2 running with the Brutal Mod is Amazing!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's DOOM 3. Its cool",
            "review_score": "1"
        },
        {
            "review_text": "The King of all FPS in one shiny package!  Seriously, I grew up on these games, and actually played DOOM II before I even played DOOM I, so when this turned up on Steam with all the expansion packs, it was a no brainer. I've finally revisited DOOM I and DOOM II and they're every bit amazing as I remember. If you're into the FPS genre, and you haven't played these games then do yourself a favour and buy it. They set the benchmark for which all should be judged.  ",
            "review_score": "1"
        },
        {
            "review_text": "An apples to Apples comparison between Doom 3 BFG Edition and old Doom 3.  1. Doom 3 had poorer audio quality and I had issues determining the direction of the enemies in the shadows. Doom 3 BFG makes me a one man army in that regard with rich audio on my Sennheiser headphones and Asus Xonar DX.  2. Doom 3 had poor shadowmapping. Doom 3 BFG has very accurate mapping and HDR.  3. Doom 3 had a very wide and clear FOV on 17'' BenQ flatscreen back in the day. Doom 3 BFG has a very narrow FOV even on a huge monitor and needs constant attention. I believe it has been done to support the idea of feeling more terrified cause I can like see less? Doesnt really work like that.  4. Doom 3 clean polygonal shading and DAMN looks good for that GEN. Doom 3 BFG, muddier watered down textured with just the texture size increased. Pretty sure it uses megatexture now. For the last time id - Megatexture is a way of breaking games. It doesnt work like its supposed to on 80% of the setups. I dont see any pop-ins on Doom3 BFG though.   5. Doesnt breakdown in Windows 7 64bit and Windows 8.1 64 bit like Doom 3 does.  6. Doom 3 had a patch to fix alt tabbing from the game. Doom 3 BFG doesnt let me alt tab. The hell?  7. The cinematics in Doom 3 BFG seem to be flowing FASTER like they changed it from 30fps - 60fps in the cinematics section too. Its like watching hobbit at 1.25x speed. One can definitely tell the difference even after this many years.  8. A very necessary port to keep it playable on new OS and setups but for the price - I would want a better GAME.",
            "review_score": "1"
        },
        {
            "review_text": "It was extremely difficult to decide whether or not indicate Doom 3. This package is Doom 1 and 2 and both are excellent. The problem for me was that I played Doom 3 after dead space (which is great), so some problems are apparent.  The story is cool, but told in a way totally dull or excitement. The graphics were great for the time (2004) and even hj not bother. The controls and in particular the fighting is where we have problems, the game is very slow and when we damage were 'dizzy' one time too grid, making the impossible many times against attack.  The DLCs are very unnecessary, not acrecentam very thing. Plus point is that hell is much better spent on them, and the campaign goes almost blank. I To 100% in 12 hours.  Pros: ambiance, fun  Cons: Controls, combat   Foi extremamente dificil decidir se indico ou não doom 3. Esse pacote tem o doom 1 e 2 e ambos são excelentes. O problema, para mim, foi que joguei o Doom 3 logo após dead space (que é ótimo), logo alguns problemas ficam aparente.  O historia é legal, mas contada de uma maneira totalmente sem graça ou empolgação. Os graficos eram ótimo para época (2004) e até hj não incomodam. Os controles e em especial os combates são onde temos problemas, o jogo é muito lento e quando tomamos dano ficamos 'tonto' um tempo grade demais, tornando o contra ataque impossivel varias vezes.  As dlcs são bem desnecessarias, não acrecentam muito coisa. Ponto positivo é que o inferno é muito melhor aproveitado nelas, sendo que na campanha passa quase em branco. Eu Para fazer 100% em 12 horas.  prós: ambientação, diversão  contras: controles, combate",
            "review_score": "-1"
        },
        {
            "review_text": "this version was my chance to finish DOOM³ without getting a heart attack and sleep at night. thanks Bethesda.",
            "review_score": "1"
        },
        {
            "review_text": "do not buy at game stop it will not work it will just keep freezing if you try to play it",
            "review_score": "1"
        },
        {
            "review_text": "Well what can I say, it's DOOM, it's going to be awesome. This brought back so many memories. The native widescreen support and higher FPS cap was a nice addition. Having all the games in one place is convenient. For some reason you can't change the graphical settings in the game, which might be an issue for people with lower end systems. I've read some other reviews that mentioned, some of the levels of DOOM I &amp; II is missing, so if you want the complete package, better to pick those up separately. Also, there is no mod support for the BFG edition, which is a shame. All in all, this made me ready for the new DOOM, can't wait!",
            "review_score": "1"
        },
        {
            "review_text": "i didn't realise this came with both dooms until after i purchased it.",
            "review_score": "1"
        },
        {
            "review_text": "first time playing doom ever and i thought it's really fun, can't wait for the new DOOM",
            "review_score": "1"
        },
        {
            "review_text": "Good game but som times it is giving me really bad FPS just because of the dust effects... If you have a good PC go for it have fun if not then don't because your computer will melt even on low settings. ",
            "review_score": "1"
        },
        {
            "review_text": "All three are great games, while all in one package.",
            "review_score": "1"
        },
        {
            "review_text": "The Doom series has always had its rightful place in the anals of the FPS genre. It's good to know that the BFG Edition features the bulk of the franchise, which basically makes it a digital museum of sorts. It's not the same without the manual flashlight toggle, though. Still, it's a solid package.  P.S. It's an oddly satisfying and hypnotizing thing, punching that pixelated chicken in the mini-game.",
            "review_score": "1"
        },
        {
            "review_text": "A combination of PC gaming history and the visceral feel of what First person shooters can be. If you need an opportunity to see what Doom is, then this is a highly recommended buy.",
            "review_score": "1"
        },
        {
            "review_text": "Doom3 is quite old by now, but it's a classic from ID Software. I purchased Doom3 in 2004 as a boxed version, also got RoE in a box. But it's getting old installing games from CD's / DVD's . So when i saw the BFG editin on Steam, I bought it to make it more convenient installing it. It's also great to get RoE included. The fact that they included Doom &amp; Doom2 was great. I have not played them for a while. I miss the ability to skip scripted sequences, as you can in the original Doom3. Specially when you have seen them several times before. I read an article on  fabiensanglard.net , that explaines improvements done in the game engine, that was an interesting read....I suggest you take a look at that web page. Overall I was quite pleased with the BFG edition.",
            "review_score": "1"
        },
        {
            "review_text": "Classic, awesome - where is Doom 4?",
            "review_score": "1"
        },
        {
            "review_text": "i can go in depth but i'l keep it short, if you just want to play doom, buy this, if you want to mod, buy everything vanilla.",
            "review_score": "1"
        },
        {
            "review_text": "If you just like killing the crap out of monsters then you cant go wrong with Doom 3 BFG. For your buck you get 3 (including dlcs although not called that) along with Doom 1 and 2 which is cool if you were to young to play them at the time. Yes in 1 and 2 the graphics are dated but whats to see or care about when your sole aim is to destroy anything that stands between you and next doorway.  If your looking for the dead space im all alone horror feel then forget it but dont let this put you off as the morphing will catch you off guard from time to time not to mention the odd very dark scene here and their.  Again cheaper in GAME but nomatter how you come across this game, im sure for a fiver,even a tenner, it will provide you with an able past time of budget mass slaughter.",
            "review_score": "1"
        },
        {
            "review_text": "It's Doom 3. You either dig it or you don't. Looks good, but the textures and animation are definitely dated. The lighting and atmosphere, though, is still fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Hell yes....love it",
            "review_score": "1"
        },
        {
            "review_text": "I'm a little hesitant to recommend this one. Doom 3 BFG Edition ties all three of the classic id Doom games together, with a dash of new content. Doom 1 is unchanged from The Ultimate Doom, and still comes with Thy Flesh Consumed. Doom 2 on the other hand includes a new campaign, the formerly XBox 360 exclusive 'No Rest For the Living.' However, the .WAD file has been slightly altered, making it incompatible with certain source ports. The classic games don't run as smooth as a source port like GZDoom would, though you're free to take the .WADs and play them with your preferred Source Port if you so choose.  Doom 3 comes with the original Resurrection of Evil expansion, along with a new 8 level 'Lost Mission' campaign, but has lost all mod support the original release had. In addition to that, Doom 3 is rather taxing on your rig, even though the graphics haven't changed much. The most you can do to tone this down is change the motion blur; pretty much all other settings are locked in place. The whole game also refuses to work on certain GPUs without some fiddling as well, and if you use f12 as your screenshot key, the game thinks you're cheating and disables achievments.  All in all, this is a decent package for anyone new to the franchise and looking to get in, but weathered Doom veterans would be better off buying the original releases for the increased mod support. You might want to consider getting this on your XBox or PS3 as well, since the PC port is a little unstable.",
            "review_score": "1"
        },
        {
            "review_text": "Old school and I am enjoying the hell out of this game.",
            "review_score": "1"
        },
        {
            "review_text": "You cant go wrong with this package! absolutely great however, if your using an amd card, you may need to fix some settings. if thats too much for you, start a privat mach in multiplayer in doom 3, and after the game starts up exit multiplayer and go to doom 3's campaign. without this process the single player wouldnt work for some reason but its alll worth it in the end. Note: this only applies to those using amd software for graphics cards. and you will need to do this every time you start up the game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Game Collections you can buy. Doom 1, Doom 2 and Doom 3 + ALL (!) Expansions.  Definetly Awesome!",
            "review_score": "1"
        },
        {
            "review_text": "old school is the best school.",
            "review_score": "1"
        },
        {
            "review_text": "blinded by the light",
            "review_score": "1"
        },
        {
            "review_text": "One of the best fps ever made with two of it's children DOOM 2 and DOOM 3.",
            "review_score": "1"
        },
        {
            "review_text": "thought id give it a try and was surprised by the immersive atmosphere",
            "review_score": "1"
        },
        {
            "review_text": "You should get this game it fun and scary to but i wish you chould play doom 1 and 2 on multplayer   ya get it is fun and lot of replay in it :D",
            "review_score": "1"
        },
        {
            "review_text": "A classic old horror game. Its amazing. I really like the effect this game got. The zombies/monsters/demons are scary as s***. The graphic are good (If you think about its release year). I remember being younger and i played this with my friend and we was scared so much that we sweared that we never would play this again. Well here i am. But about the game higly recommended from my side. You cant complete this game without getting scared once. xD",
            "review_score": "1"
        },
        {
            "review_text": "*review for classic doom games that are included*   you shoot a lot of deamons on mars. 'nuff said",
            "review_score": "1"
        },
        {
            "review_text": "Not worth the money. You are unable to use any mods &amp; the game does not have co-op enabled for pc. Waste of money, do not purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "definitely a classic that every idSoftware fan needs to have in their collection",
            "review_score": "1"
        },
        {
            "review_text": "All i have to say is thank you.",
            "review_score": "1"
        },
        {
            "review_text": "all three games are fantastic, but do NOT mess with the settings ( 3D enabling, resolution, ect.) unless you are sure it is what you want. i changed one thing by accident and the only way i could fix it was uninstalling and reinstalling the game, losing all progress.",
            "review_score": "1"
        },
        {
            "review_text": "The dark atmosphere and the intense violence of all three DOOM games say it all about this package. It's a blast to play. I remember playing the first DOOM game when I was only 5 years old in 1995.  Totally recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "The only way to play DOOM. DOOM 1 and 2 play silky smooth in Windows 8, even better than running native, the controls feel tight, the interface is 100% original with the added extra to return to the game selection menu. Doom 3 looks absolutely amazing, it's like playing a whole new game.  Doom 3: BFG Edition is a must buy for all fans of the DOOM series. I reccomend it with no hesitation.",
            "review_score": "1"
        },
        {
            "review_text": "Good straightforward shooter exactly what you would expect from a classic.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic value for money... Contains DOOM, DOOM II and DOOM 3 with expansions (Co-op is not present mind!). I picked this gem up in 2014 sale so I was very pleased. The ultimate game for any DOOM fan. The beefed visuals are very nice too!",
            "review_score": "1"
        },
        {
            "review_text": "This game is possibly the best purchase I have ever made on steam. Including almost everything doom, the possibilities are nearly endless. The multiplayer for doom 3 is very fun and fast paced, and incredibly simple to set up. Doom 1 and 2 have VS mode and co-op options for multiplayer which i have spent countless hours playing with friends. The multiplayer for doom 1 and 2 is pretty confusing to set up, but if you know computers pretty well it can be done with ease. Doom 1 and 2 also have mod support, which leads this game bundle to be almost infinite, as the doom series has one of the largest amounts of mods ever. Over all near perfect bundle. The only downside i have is no co-op in doom 3, but that game is scarier by yourself anyways so singleplayer does just fine. 10 out of 10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Runs super smooth. Its a great way to enjoy the Doom franchise in one simple package.",
            "review_score": "1"
        },
        {
            "review_text": "This Version of the game has its ups and trade-off compare to the non-BFG edition. On this version you get widescreen support, support for 120hz monitor, Doom 1 and 2. which both are a good games and i highly recommend playing first if your new to the Doom franchiese and play with a keyboard instead of a controller.   The only downside of those two games are if your into story and having the game tell you why you are there nd why they are attacking you. as you will be disappointed as there is none. Doom 3 trys to throw in the story to exsplain why (mostly through PDA which hides the code to unlock storage containers and some doors).  Resurrection of Evil contenue where Doom 3 left off, and introdues new enemys and weapon from Doom 3. you play as a different character (though you will still be called marine for your un-named character you play as). and have to destory an artifact before the demons get it.  The Lost Mission is levels that where cut from the orginal doom 3 and got brought back on the BFG edition. You play as one of the last remaining survivers from the bravo team and without revealing too much of the story in this review.  The draw back is no mod support and if mods your thing, then this isn't for you. the other downside (or upside depend on how you look at it) is compare to the non BFG edition. your flashlight is strap on to you instead being part of your weapon list and it recharges so you never run out (which is also funny how the Duct tape mod for the orginal is one of most popular mods and it does the same thing minus the recharge).   now does this game worth $20? not really, i would wait till it goes on sell as you are playing a 10+ year old game that been re-re-ported from console (from pc to console as BFG edtion and back to pc as BFG edtion). But if you never played doom or own any previous doom games then get this one as you save $2 compare to buying the games that are included in this edition seprately.",
            "review_score": "1"
        },
        {
            "review_text": "An unnamed man fighting demons on mars. Hilarious. Its a blast to blast through. I know people say it's scary but as a horror and sci-fi fan I found it just hilarious; and I mean that in a good way. Standard FPS controls/guns/enemies. But it's demons....and Satin....on Mars.",
            "review_score": "1"
        },
        {
            "review_text": "Has Ultimate doom and doom 2 included! Buy it just for that!",
            "review_score": "1"
        },
        {
            "review_text": "hey doom 3 BFG edition wont launch on my computer, i have Windows 8.1. The screen turns black and a samll box pops up saying that it has stopped working. Any help would be much appreciated.",
            "review_score": "1"
        },
        {
            "review_text": "Its Doom! What else is there to say?",
            "review_score": "1"
        },
        {
            "review_text": "it's a pretty good game I would say .",
            "review_score": "1"
        },
        {
            "review_text": "epic game awesomely scarey at times as well",
            "review_score": "1"
        },
        {
            "review_text": "Just look at my name, it says enough.",
            "review_score": "1"
        },
        {
            "review_text": "Some nice upgrades to a game that I've been in love with since it's release!!",
            "review_score": "1"
        },
        {
            "review_text": "It has its moments this game, where it can get you on the edge of your seat. I really like how they make the levels make you want to get the ♥♥♥♥ out of there and speed toward the finish, maybe on account of the former. It just feels like a horror game in that respect. I like how it doesn't lead on the answers to the story as you play through, kinda keeps you guessing wtf is going on. On the super hard mode you will appreciate your life and ammo a lot more. Recommended as a good run and gunner :) Looking forward to the 2016 release!",
            "review_score": "1"
        },
        {
            "review_text": "All really good games. just wish more people played multiplayer..",
            "review_score": "1"
        },
        {
            "review_text": "doom 3 is amazing. The plot is amazing. the graphics are nice and smooth and its so fun killing demon spawns. So much work was put into this game. BFG was amazing after the normal doom i was drooling for more demon-slaying. And playing ressurection of evil, lost mission and doom 1 n 2 which satisfiyed me until the day doom 4 is at the stores.",
            "review_score": "1"
        },
        {
            "review_text": "Well well well, look where I am. Back here, with ye' olde Doom 3. I should mention that when I was younger, I played the- [Insert joke here] -out of DOOM. Of course, then came Doom 3 and well. I loved it.  Sure, the third game is alot different from the others, but I like this game. This is the best horror and First Person Shooter (Arguably) I've ever played. Then came the bells for the BFG edition. Well, I had buyed it because my original disk broke. And I do love this game, even with it's changes.  Some people argue, 'You can just get mods for the regular DOOM 3 and it will look even better.' and yeah, you can't mod this one. But I still seem to love it anyway. Mainly because it comes with the first 2 DOOMS and lost levels, and the expansion pack, RoE.   I do recommend you get this game if you have not already. It is enjoyable in so many different ways.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people don't like that this release isn't as terrifying as the original. Personally, I don't mind it all. As someone who never really had much of a strong feeling towards horror games, my statement might be a bit biased. Anyway. This game is more of action than tension compared to Doom 3 itself with more lighting and having a flashlight on your suit so you don't need to change weapons to see. I will gladly admit that it still got me a few times and still does even when I know something is about to happen. Scares aside, this is a great game to pick up for wanting to blast demons in the face. And even better? Free DLC missions (Ressurection of Evil and The Lost Mission) and even Doom 1 and 2 to go along with it. Tons of content and action bundled together for $20. Easily worth your money. Now it's the wait for Doom 4 to come out.",
            "review_score": "1"
        },
        {
            "review_text": "The complete doom saga. Worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "For maximum enjoyment, play DooM III as if it were loosely influenced by Lovecraftian themes.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended if you have Nvidia 3D vision (Use Quad Buffer for 3D) and get RBdoom3BFG and the HD mods. otherwise if you already own Doom 3 $30USD is a bit steep for one short expansion.  If only steam offered a discount to those with Doom 3 + ROE already in their library.",
            "review_score": "1"
        },
        {
            "review_text": "At the time I thought it was mediocre, but i have played Call Of Battlefield Zone 5 since and have a new respect for its charms.",
            "review_score": "1"
        },
        {
            "review_text": "It´s a great game!",
            "review_score": "1"
        },
        {
            "review_text": "Mixed views on this game love every game in one but some games can be bad for lack of stuff and thats this a lack of modding",
            "review_score": "1"
        },
        {
            "review_text": "Not scary. Enemies spawn in out of nowhere. It gets old after a while. But it's an okay game. Nothing amazing though.",
            "review_score": "1"
        },
        {
            "review_text": "Yay! Its the doom games love or hate them can't complain to much about that!, What i can and will complain about is the shocking port my beloved steam have got for this game!!! be prepared to do a lot of fixes and faf if you want it to just launch this game i (so far) can only get it to play in windowed mode after going in to its launch files and chaning its fullscreen= file to =0, not what you expect from a company that sells games... a game that doesent work upon perchase...  Doom games are great even more so if you were playing them as a youngster back in the day and if steam could fix the patch/launch problems would get thumbs up from me!  As it stands i can't shake being sold a game that wont work unless your computer is full of outdated hardware    Im not angry Steam just disapointed",
            "review_score": "-1"
        },
        {
            "review_text": "It's DOOM, WTF you have to like it. If you don't Vinnie will give you cement shoes capisce?!",
            "review_score": "1"
        },
        {
            "review_text": "I have never been more scared in my life.  10/10 would ♥♥♥♥ my pants again.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game, not a big fan of censorship though.",
            "review_score": "1"
        },
        {
            "review_text": "Bought the game to play Classic Doom in 2k, doesn't scale to 16:9 natively. Still latest platform for Doom Classic.",
            "review_score": "1"
        },
        {
            "review_text": "Did I really care that the red crosses were replaced with pills on the healthpacks? No. Doom, Doom II, and Doom 3 with expansion pack and extra levels, logical use of the flashlight, and silky-smooth frame rates, all in a convenient, ready-to-play package. 5/5 bfgs.",
            "review_score": "1"
        },
        {
            "review_text": "It's thanksgiving at your mother's house and all your relatives are interrogating you about what you're doing with your life. Only your relatives are demons and interrogating is trying to kill. Nope. Just like thanksgiving.",
            "review_score": "1"
        },
        {
            "review_text": "Doom 3: bfg edition has doom 1, and 2 for 7 dollars... I havent actually played much of doom 3 yet and I can already say its well worth the money.  Doom 1 is a quick, action packed, fps game that has some problems such as stupid enemy placement, low ammo despite the game being funnest when you have loads of ammo to fling at the enemy, underwhelming bosses, however despite these problems they're  nothing  compared to all of the good things.  Doom 2 is pretty much the same as doom 1 but it has more ammo, some new enimies, better enemy placement, some new places that look more like cities which I really liked because it added some variety to the labrynth like levels. I got lost quite a bit and the game was Really, Really, Really, BORING  when that happend.  Overall i'd say that doom 2 is better than doom 1, but eiter way their both great and you can get both with this game. EDIT: 7 dollars depending on where you buy it.",
            "review_score": "1"
        },
        {
            "review_text": "This game traumatized me when I was 13. and it still has the magic",
            "review_score": "1"
        },
        {
            "review_text": "Played the full game prior to getting it on Steam years later. If you have the rig, the sound system, and a quiet dark area to play it, YOU WILL BE SCARED. Outside of that it is a generic shooter, but it does well at what it does. If you have fond memories of the original Doom, you will find this to be an actual sequel done right for once,   4.4/5",
            "review_score": "1"
        },
        {
            "review_text": "It's not as fun as it was back when the original Doom 3 was released and the BFG edition is definitely better optimized, but the lack of ability to mod the game makes it feel kinda stale. Though if you've never played the original, this is a must for any Doom fan.",
            "review_score": "1"
        },
        {
            "review_text": "Running through corridors, reloading my shotgun, getting jump scares out the whazoo...10/10 would crap my pants again.",
            "review_score": "1"
        },
        {
            "review_text": "If you want achievements then get the BFG Edition. You can mod Doom 1 and 2. Not sure if you can mod Doom 3 on this version.  I never played this when it originally came out and just kept putting it off. Honestly some of the cutscenes are laughable and chessy, but this game does a good job with jump scares and has an interesting story.",
            "review_score": "1"
        },
        {
            "review_text": "Everything starts off fine when its time to began a meesage comes up that the game has stopped, Is there something I can try to fix this problem ",
            "review_score": "-1"
        },
        {
            "review_text": "HAd to play this game when i was younger.But still_ma pants got a bit browny.!! Very good game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, awesome collection to buy. Celebrates the best of the doom franchise. Highly recommend buying and downloading. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I got this on sale. Mainly got this for access to Doom 1 and Doom 2 havent played 3 yet but doom 1 &amp;2 are great!!",
            "review_score": "1"
        },
        {
            "review_text": "The Doom 3 BFG Edition is a must have for picky collectors who want something offering more in the line of nostalgia than gameplay and enjoyment. Still, creeping around claustrophobic corridors infested with hell knows what is fun for a good few hours. As far as multiplayer goes, all of the Doom games (except for 4) are dead. Perhaps you could find some obscure live games but you’d have to dig around. The installment comes with Doom 1, 2 and a shiny high-rez edition of the third one. The fun thing about the first two is that you actually find yourself getting small frights from the sudden appearance of a square mess of pixels representing what used to be a convincing demon. As far as the third installment goes, play it with headphones on, in the dark and by your self. Its age hasn’t lessened its horror value.",
            "review_score": "1"
        },
        {
            "review_text": "I only bought this for Doom 1 &amp; 2. I guess I could pretend that Doom 3 is good...  I can't! It's too hard to do so! Want to know why Doom 3 sucks? I'll tell you why! - ♥♥♥♥♥♥ copy/paste Half-Life story - ♥♥♥♥♥♥ enemy designs that look NOTHING like the originals - ♥♥♥♥♥♥ lighting (changeable, but by default it's ♥♥♥♥) - ♥♥♥♥♥♥ level design (90% of the game is on Mars and you only go to hell near the end of the game) - ♥♥♥♥♥♥ dialougue - ♥♥♥♥♥♥ how un-Doom it is - Why is a torch a seperate item? - ♥♥♥♥♥♥ ♥♥♥♥♥iness - ♥♥♥♥♥♥ menus - ♥♥♥♥♥♥ lack of secrets - ♥♥♥♥♥♥ lack of good weapon design. - It's Doom 3  You know what, it would be better if you just bought Ultimate Doom and Doom II seperatly. Atleast if you do that, there won't be a tumor stuck to them.",
            "review_score": "-1"
        },
        {
            "review_text": "Doom 1 &amp; 2 are still awesome games, work great. Doom 3 I cannot get to work, it starts off ok then when it is going to mars city it will stop and go to a white screen and say there is a problem, that really sucks cause i was looking forward to that game. not sure what to do.",
            "review_score": "1"
        },
        {
            "review_text": "Really recommending this to everyone who loves Doom series , it includes Doom and Doom II as you can probably tell sadly no co-op mode but totally #worth it! no need for DOSBox or whatever you may need to run the .wads for originals!!!",
            "review_score": "1"
        },
        {
            "review_text": "please make super turkey turbo puncher 3: BFG edition  k thx",
            "review_score": "1"
        },
        {
            "review_text": "yeah yeah i know that the new doom just came out and that one is one hell of a game... but you have to admit this one is good aswell not as fast paced but from a horror perspektiv its really great! there are even mods that make the game even more slow paced and spooky",
            "review_score": "1"
        },
        {
            "review_text": "A collection of the most ambitious series of the 90's and early 2000's. Doom 1 may look outdated and boring by today's standards, but back in the day, having a first person shooter with the ability to turn smoothly, and not in a prerendered grid was really amazing. The first game had advanced lighting and effects that surpassed what anyone had seen before, all thanks to one brilliant programmer. The second game was essentially the same, but Doom 3 (which is the main focus of this collection), was and still is a great game. At the time, its graphics were simply unmatched by other games, and it had great atmosphere.  This edition supports widescreen and 120fps. Aside from that, the graphics are a bit better, but nothing to write home about by today's standards.   So, this collection is a really good way to relive all 3 games, especially with the updated graphics of Doom 3. Big fans won't be disappointed, and other people can appreciate how ambitious the games were for their time.",
            "review_score": "1"
        },
        {
            "review_text": "Doom 3, the first game I ever played that made me nervous to go down a dark corridor. Not out of fear, for the dark nor the monsters, but simply due to the fact that I KNEW there was going to be an 'oh, ♥♥♥♥!' moment just around the corner. To this day, the gameplay still feels solid, the atmosphere memorable and immersive, the dark corners still demanding the attention they deserve, the bfg still feels too good to be true.  Also, the first crying person I ever ran into in a video game (Played well before steam release, btw) might still haunt my dreams sometimes. Maybe.",
            "review_score": "1"
        },
        {
            "review_text": "Doom (1993) (id Software):  10/10!  The Ultimate Doom - Episode 4 - Thy Flesh Consumed (1995) (id Software - GT Interactive): 10/6.  Doom II: Hell on Earth (1994) (id Software - GT Interactive):  10/10!  No Rest for the Living (2010) (Nerve Software):  10/8.  Doom 3 (2004) (id Software - Activision):  10/9.  Resurrection of Evil (2005) (Nerve Software - id Software):  10/8.  The Lost Mission (2012) (id Software - Bethesda Softworks):  10/7.",
            "review_score": "1"
        },
        {
            "review_text": "love this game so much. There should be more horror action games like this around  ",
            "review_score": "1"
        },
        {
            "review_text": "it is gud",
            "review_score": "1"
        }
    ]
}