{
    "app_id": 208400,
    "name": "Avernum: Escape From the Pit",
    "release_date": "2012-04-11",
    "developer": [
        "Spiderweb Software"
    ],
    "publisher": [
        "Spiderweb Software"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud",
        "Stats"
    ],
    "genres": [
        "Strategy",
        "RPG",
        "Indie"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Isometric"
    ],
    "achievements": 35,
    "positive_ratings": 658,
    "negative_ratings": 55,
    "price": 6.99,
    "description": "Avernum is a land underground, a subterranean nation full of rogues, misfits, and brigands, struggling for survival in the monster-infested darkness.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/208400/header.jpg?t=1447355484",
    "minimum_requirements": "OS: Windows XP                Processor: 1.6 GHz                Memory: 256 MB RAM, 512 MB Recommended                Hard Disk Space: 300 MB                                Video Card: 3D accelerated graphics card, Open GL compliant",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I recommend this game for true fans of Role Play. If however your take on a RPG is Diablo or Torchlight, forget it.  There is probably more storyline in this small download than in the entire Skyrim. There are many long hours of play ahead. I did a restart about 2/3 of the way through as my party was not strong enough and I had not distributed t6he party stats well, combined I have nearly spent as many hours now on this game as I did with DragonAge inquisition. Despite the old school graphics there is quite variety of terrain to explore.  The character development is good and straddles the boundary between too simple or too complex well. I suggest you pay attention to creating a balanced party, which is also an area that I feel could be improved. It is too easy to create parties that will simply not work. Having a bow user sounds great, but the game is heavily weighted to swords. Another area which could be improved is the character conversation scripts. Old storylines do not disappear and too often you get into a dialogue that you have already been through a million times before with the NPC – it is almost as if the same people that wrote the NPC scripting for Divinity Original Sin did this one too.  ",
            "review_score": "1"
        },
        {
            "review_text": "Play this game! It has a wonderful grip on the world and a fantastic sense of exploration. You never really know what you'll find when you set off into the caves, and the combat system is robust enough to stay interesting. I cannot recommend it highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "This is prehaps the best Dungeon Crawler/RPG (outside Legend of Grimrock, Dungeons of Dredmore) that Steam has to offer. It is easy to get into and hard to put down. What makes it so enjoyable is the non-linear progression of it all. You have a choice over everything, from doing quests to killing things. Your charators can be speced to your choosing. Want a warrior that hits like a truck and can shoot fireballs? You can do that! You want a rouge that can't be hit and is a master lockpick? You can!   All in all, this game is well worth the price, even more on sale (if the Summer Sale is going while viewing this review)  You won't regret. I've spent 135 hours on this game. Take it from me. It won't let you down!",
            "review_score": "1"
        },
        {
            "review_text": "Okay so I'm pretty much hoping that my point gets across through my increasingly copious amounts of game time, considering I've had it for all of a week. If not, here's the gist of it.   Spiderweb Software is an amazing company, and I originally discovered them through their Geneforge games. Now, I was skeptical when I first began playing Avernum because in my opinion it had a lot to live up to. I think I can now safely say that this is my favorite of all their games thus far. It is a remake of Avernum 1, which came out over a decade ago, and all it did was improve. Currently there is a gap in the story, because Avernum 3 has not yet been remade (though I assume you could go play the original) and so unless you're fine with skipping right over to 4, you'll just have to wait with bated breath.  I know a few people who tend to ignore their games due to the admittedly strange graphics (how long can that man hold his arms like that, christ). While their portraiture and icons are very nicely done, they do skimp a bit in the 3D area, though I presume not for lack of trying. Having played a bit TOO many RPGs in days past I believe it to be somewhat nostalgic.  In short, the story is amazing, the art 'antique', and the replayability significant. If only we could port our endings to the next games. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "First of all I must say I am a big fan of role play games, that I started back at the date with Eye of Beholder: I consider the top of the genre Baldur's Gate (the first one), and this is the first time I play an Avernum game; I was therefore completely new to the lore, mechanics and rules used in the game. From the beginning Avernum: Escape from the pit looks intriguing and catchy: from text to text and fight to fight, I found myself playing for 3-4 hours straight after installation without realizing it. The art and the drawing are inspiring, there is a lot of text that really make us feel the story and the lore, dialogs are brilliant; character creation and advancement, fightings, divine and arcane spellcasting: everything it is intuitive and somehow innovative, taking clear inspiration from old paper rpgs and fusing it with 'modern' skill trees. Longevity also seems to be a strong point of this title: I played 4 hours and visited 3 cities, and I could understand from the world map how insignificant is the portion of underworld I explored so far. The only negative feedback some people might point out is graphics, and on this I completely disagree: it is a simple retro 2d graphic but is not bad at all: on the contrary it is clear and fluent, does not disturb the eye and does not require big machines to run. Also the music is fitting, with its epic tones: it is just a pity that there is not a bigger variety of tunes. All in all, I would recommend this game to all rpg fans and to all retro gamers, giving it a solid 8.5 out of 10. There are not many better roleplaying experiences than this one out there :)",
            "review_score": "1"
        },
        {
            "review_text": "Played this game when it was called Exile - when I was just a small boy.  The graphics and gameplay are now a bit dated. But this is still one of the strongest and deep RPGs I have ever played. Spiderweb did a great thing putting Exile on a PC shareware disc, because it has made me a lifelong fan of their games.  It is a dream of mine to see this game get made into a Skyrim-esque style (graphics/UI) engine with the Avernum story all intact  Absolutely recommend",
            "review_score": "1"
        },
        {
            "review_text": "Big fan of the Spiderweb games. Still have the original game back when it was called Exile. And then they upgraded it to something else i can't remember, but i didn't like it as much, now, Avernum is well suited for the PC. This (Actually the original 'Exile') was the first RPG game I had played prior to Final Fantasy game, back when Larry the Lounge Lizard was Froody as Zaphod's second head drinking a Pan Galatic Gargle Blaster... enough of Nostalgia! Overall of this game (upgraded) is refreshing, has a lot of old but alot of new features. Easy to play and not clunky.  Good simple sounds (not annoying) Graphics simple, and one can play at ones leasure being Turned based.  The story of all the Spiderweb games are good and worthwhile, but since i still have the originals, going to wait for the rest of them to go on special",
            "review_score": "1"
        },
        {
            "review_text": "This game just isn't for everyone.  I'm sure it hits the right chord for some with gameplay harkening back to early PC dungeon diving, it didn't for me. The dated graphics leave something to be desired, the story is one that doesn't stand out and the gameplay is simplistic to a fault.  I picked it up on the cheap during a sale just because it had a 'very positive' rating on Steam so it was no big lost. There are just better titles out there I'd rather spend my few available gaming hours playing.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game so much. I love the story of the game the characters, But the archer and other melee character are lacking of skills and boring. but over all I like it, lots of secret places and story to uncover.",
            "review_score": "1"
        },
        {
            "review_text": "Who needs a girlfriend when Avernum is there to tuck you in at night? certainly not me!   3 thumbs way up",
            "review_score": "1"
        },
        {
            "review_text": "I'm having a lot of fun with this game, already 30 hours into it (probably a little high, as I sometimes multitask)  If you've never played a game like this before, the learning curve is probably a little steep, but I would recommend looking around on the web for some character templates to follow until you understand character building.   The gameplay is fun, especially if you like tactical, turn-based battles. Be sure to save often, however, as it is very easy to wander into fights that you can't win yet. That's part of its charm, in my opinion, as you can feel powerful one minute and then have to reload the next! Better yet, I've had plenty of battles that required quite a bit of time as I was evenly matched.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games from the 90's has been remade into one of my favorite contemporary role playing games. This game is incredible! The story is amazingly immersive, and the gameplay is well executed. If you like turn-based RPGs, you really must get this game.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this on the strength of the reviews, despite some apprehension about the graphics. Other role-players were right; this is a really engaging RPG with a great campaign setting, free roaming environment, good mechanics and addictive battles. I was also able to overide the character portraits in the directory with some fantasy art I liked to make the characters I wanted. I'm playing on hard difficultly which feels about right. Anyway got to get back to my campaign to bring justice to Avernum...!",
            "review_score": "1"
        },
        {
            "review_text": "An old/dated game in 2015, but still engrossing enough to keep me occupied for the 2 weeks it took me to complete. If you like RPGs you'll enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people have gone through the mechanics of the game better than I would. Everything in the game is mechanically sound and allows for ample strategy. You should absolutely buy it and support a great indie developer.  The only thing I would comment on is the writing. A lot of people have gushed over the writing saying it's wonderful. Well, it  is  good, but have the right expectations: the writing is less the next Lord of the Rings in video game form and more having the best DM you could possibly imagine creating adventures for you.  Definitely should get this game!  EDIT: So I wanted to just add a final thought to my review. after putting almost 30 hours into the game, I've pretty much abandoned it. After thinking about it, I've realized the game lacks player agency. This means that there are no real choices in the game - there are dozens of quests to partake in, but there is no consequence if you don't do them. They are also almost all linear. The greatest choice present in most of them is whether you  actually  give a discovered quest item to the patron the commissioned the quest. Again, if you don't, the only consequence is not receiving the quest reward (which may or may not be better than the legendary item you're handing over).   Games can overcome this if they have an immersive narrative or compelling aethetics and atmosphere. Unfortunately, this game lacks both. The narrative is ok and the world is unique, but it isn't enough to keep me going after 2 dozen hours.   Now, some of Spiderweb's other offerings do give the player more agency. So again, I recommend the game, it's fun, but I just thought some may want to know.",
            "review_score": "1"
        },
        {
            "review_text": "A remake but I never played the original. Truly enjoyed it, as always",
            "review_score": "1"
        },
        {
            "review_text": "Great, fun game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great older game with content that just goes on and on pulling you into a deep and immersive story. Seriously, give this game a try",
            "review_score": "1"
        },
        {
            "review_text": "Singe player turn based isometric party based cRPG.  Great remake of a remake of the original, all of which made by the same guy. There is a lot to do with a very intretsing and rather unique game setting. I do wish the game world was 2-3 times the size of what it currently is with more loations. But you can easily milk 1-200 hours from the this title. The difficulty settings range form 'I'm never gonna die' to 'OMFG why can I not kill anything... its just a freakin 1 foot tall little person and a bat!!!'  You will wanna make a party with dedicated roles over having everyone be able to do a bit of everything. A very fun and very enjoyable experince :) an easy 4/5 for a fantatsic development team.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game with rich story and depth.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite RPGs!  Avernum: Escape from the Pit is actually a remake of the original Avernum, which is in turn a remake of the older Exile: Escape from the Pit. This remake uses a modified version of the engine from Avadon: The Black Fortress, and not only has better compatibility with newer computers, but also is improved in the way of graphics and usability.   I'm not going to talk much about the graphics. Since this is a SpiderWeb Software game, there isn't going to be much in the way of spectacular graphical effects. Everything is in 2D, but the art has a charm to it that lends itself to the genre.   The lore and story of Avernum is what makes the game great. The game takes place in an unnamed fantasy world ruled by 'The Empire', led by the ruthless Emperor Hathorn. Hathorn crushes any resistance by banishing unlucky souls into an expansive unground cavern system known only as Avernum. Crimes as petty as vocalized discontent is enough to earn a one way trip to Avernum. The enterance is a one way portal underground, and there is no way out (?).   You take control of a band of 4 adventurers, each guilty of unspecified crimes against the crown. Upon arrival in Avernum, you learn that despite the harsh conditions of the realm, Avernum has developed its own society, with its own towns, culture, and government. All is not well, however, as the underground Kingdom is locked in a constant state of warfare with the other races that inhabit the caves. The lizardlike Slitherazki, the catlike Nepharim, and the rebels and bandits who disassociate themselves with King Micah's state all try to break down the fragile thread that holds Avernum together.  Once allowed to roam Avernum, your adventurers might find themselves without direction. The world is open, with few prohibitive roadblocks to stop any exploration of the caves you might find yourself wanting to do. The dangers of the southern and western caves will keep you away until you've gained more experience living in the caves. There are three ways to 'win' the game, each of which will reveal itself to you as you gain fame with the people of the cities.  1) Banish the demon lord Grah-Hoth 2) Exterminate the Emperor Hathorn 3) FInd a way to escape the tunnels  These are all lofty goals, and completing smaller tasks to gain strength is a must.  ",
            "review_score": "1"
        },
        {
            "review_text": "As an avid worshipper of Spiderweb Software, I was hooked to this game in a matter of minutes. Much like the Geneforge games, I've realized that my choices will only REALLY start to effect the gameplay later in the game. I dread the day where I will have to turn against my companions for what I view as the greater good. I may have to kill the Avernites, leaving nothing before me. Or maybe I'll become the new king, I honestly don't know. Right now, I'm content with delivering wine to the miners of Fort Draco. This is definitely one of Spiderweb Software's best. As much as I adore the Geneforge saga, this game takes the title of 'Best Spiderweb Software Game.' Or at least my personal favorite.",
            "review_score": "1"
        },
        {
            "review_text": "I've basically loved everything Spiderweb Software has ever done. Avernum is no exception, especially now that they've updated it with this version. No, it doesn't look much different, but the interface is worlds better, so that you actually know what all of the numbers mean. You don't need graphics to tell a good story, but you need a good story that sinks it's hooks in right from the start, and Avernum is one of those. I'm really looking forward to Avernum 2.  Probably the only real downside with Avernum is how god-like your characters get toward the end. After a certain point, there really isn't much left in the game that's a challenge to defeat, the baddies just take longer to kill.",
            "review_score": "1"
        },
        {
            "review_text": "Ah, Spiderweb Software. My first recollection of this fine company comes from the early ninties shareware disk compilations you'd buy for $10, chock full of shareware/freeware to enjoy. And there was Exile, in all it's wonderous glory, what would eventually be remade as the Avernum series. They haven't lost their creativity and knack for story-telling in all these years, and I'm glad to see them come to Steam at last. I do miss those books you could find on bookshelves and read in Exile. One of them was rather raunchy, and involved a buxom maiden running from a deranged, sex-crazed mutant squirrel. Needless to say they've become more family friendly since those early shareware days, but the game is still as great as ever. A+",
            "review_score": "1"
        },
        {
            "review_text": "I have always loved the Avernum series, and IMHO, the best RPG ever made. We can either follow the storyline or just go exploring , picking up one quest after another until we forget what's the main quest, which by the way can be easily traced back within our own pace since there is no pressure of time.  The use of keyboard is somewhat frustrating, but you'll get used to it given a certain amount of time.",
            "review_score": "1"
        },
        {
            "review_text": "Avernum is a great RPG with depth, varied gameplay, and plenty of surprises. I get bored by other games lately that are too easy or just don't have much to them. Avernum is a classic RPG where you can explore, steal, battle, and tweak your characters to your desires. However, it doesn't make character development confusing or strange; you know exactly what you are doing to your characters. There are lots of little 'secrets' to find everywhere, whether it be a hidden spell tome you still need enough knowledge to read, a strange quest NPC behind a false wall, or a pile of gems in the wilderness. I suppose the interface might dissuade someone who is used to modern games that basically play themselves, but iI feel it just does its own thing and works fine. Any way you look at it, this is a great game for any RPG fan.  I recently made it to an ending and it was damn hard...but that's actually okay because of the depth of content in the game and the ability to become strong enough.",
            "review_score": "1"
        },
        {
            "review_text": "Super cool throwback. Does what it does quite well. You'll dig this if you played basically any pc rpg in 1995.",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Can't wait for episodes 2-6 (Mostly 3)",
            "review_score": "1"
        },
        {
            "review_text": "If you are an rpg-fan and graphics are not very important to you and you don't mind reading (well written) text in a game, this might be worth a look. I had many hours fun now, and I am far from the conclusion I think.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable game, a throwback to when RPGs were close to their tabletop counter part. It wins on the content and experience of the game and not the graphics, which might require an adjustment period. I acheived all the endings which brings me to my only complaint, it was a bit too long. Lots of side quests if your aiming to do them all, which you will if you want the most difficult ending.",
            "review_score": "1"
        },
        {
            "review_text": "If you love classic RPG's then Avernum is well worth checking out. A great storyline and main quest push you forward into a world that is full danager but its own lore, and legends. There are pleny of side quests here for the completionist as well as varous achevements and some fun game play.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't really get into it; the combat felt really repetitive and boring (coming from someone who regularly plays RPGs), not to mention the story was pretty bare. I could've gotten past all of it though if the game would literally even let me name my characters and pick a sprite for them. I mean, it's not like the dialogue EVER refers to them in any kind of individual sense. I get the feeling that there's an RPG someone would love hidden in here, but if you're at all like me this game's specific imperfections will leave you feeling perpetually unsatisfied.",
            "review_score": "-1"
        },
        {
            "review_text": "I barely played this. It looks like it could be a really fun and engaging RPG, but the interface really turned me off.   It's not because the graphics are simple, it's because they're ineffective. Even when the game specifically tells you about something (like in the tutorial) it's difficult to spot items on the ground.   There's no way in hell I'm going to go through the entire game pressing G (to Get items) every few steps, and I don't want to just 'forget about it' and miss countless opportunities.",
            "review_score": "-1"
        },
        {
            "review_text": "This isn't a review about the game, but the service I have received in trying to play the game. It loads, plays for about 5-7 seconds and then the screen goes black. I can still hear music, and a greyish box will come up when I move my mouse over what I believe is an options box, but I don't know for sure. I have uninstalled and reinstalled the game several times and nothing. After that, I wrote the developers, and they have sent nothing back to me in over a week. Very frustraiting because the game looks great.",
            "review_score": "-1"
        },
        {
            "review_text": "Avernum is sick! Old school and in depth. Indie for the win!",
            "review_score": "1"
        },
        {
            "review_text": "I paid $3.50 for this game and even at full price of $10 it is a steal. This game is a throwback to the glory days of RPG's and I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "ok this revew will be for those why are fans of spiderweg software games because a lot of the other revews cover the aspect of the game from a perspectave of takeing like any other oldschool r.p.g however as i am here now, the game is the best and you should at least give it a try , now this next part is for those of us that have been with spiderweb for a LONG LONG time (speaking of witch this game takes a long time to finish, in a good way) now... if your like me you will rember how the skills worked in geneforge and the orignal avernum's it was good because it was better than other r.p.gs there was no skill tree, no level cap but the skills ent up in cost as you put more points into them, this gave the game a vary strange charcter progretion that not onley encurged giveing your heros a wide range of skills but it made it so you have a less cramped leveling zone an more  choice as to how you build your heros and to top it all of (as far as i know) ONLEY spierweb used this leveling style Escape from the pit has............your normal boreing skill tree now im not telling you this is bad it still has all the rest of that spiderweb flair meaning oped worlds multiple endings and so much more makeing it a must have 9/10 BUT SPIDERWEB I BEG OF YOU GO BACK TO YOUR OLD LEVELING I LOVED THAT THING AND IT GAVE SO MUCH YOUR YOUR GAME MAKEING EVEN THE LEVELING OF YOUR HEROS COMPLEX AND FUN thats all",
            "review_score": "1"
        },
        {
            "review_text": "This game for me was a HUGE surprise. Altought the graphics are bad, the story and gameplay are top notch. It really plays like the Baldurs Gate, Icewind Dale series. It is a lot fo fun, ton of quest and many hours of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "A strategy game where the best tactic is to run in with half your team as dual wielding berserkers and the other half as mage/healer buff-♥♥♥♥♥.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game came recommended to me through a friend. I have to say I really have enjoyed it. The story line is interesting and the game play is fun.",
            "review_score": "1"
        },
        {
            "review_text": "Feels like a classic.",
            "review_score": "1"
        },
        {
            "review_text": "A fine RPG styled like the games back in the DOS days. Not much handholding here, which takes some getting used to if you've grown accustomed to that. It has a sizeable world that's depressive, but still full of flavor. The game's not easy, it requires patience and cunning to get through its dungeons, castles and ruins. There are even hidden bosses that you might not want to trigger until you've grown a bit stronger. And there's often more than one way to approach a problem, or enter an area. In short, the game demands patience and tactical thinking, and offers a great experience in return.",
            "review_score": "1"
        },
        {
            "review_text": "I'm an old-school gamer from the time when characters on the screen were represented by simple symbols and squiggly lines. To draw people in to play the games back then the games had to be either utterly fun or have a great story. Games like Ultima IV were like that, utterly horrible looking but so deep you could play through it ten times and still not find eveything the game had to offer.  'Avernum: Escape from the Pit' [AEftP] is just like that... Except that the graphics are actually fairly good.   This is a HUGE roleplaying game with so much ground to cover that you at first don't know what to do or where to go. As you start the game you're free to explore everything and everywhere, even places that will get you killed instantly. The game relies heavily descriptions and dialogue, so if you're afraid of reading this game might not be for you. However, if you DO like to read you'll find a game with great storytelling, a good combat system, and more content than you can burn through in a month.",
            "review_score": "1"
        },
        {
            "review_text": "The badass gameplay we'd expect from Spiderweb, plus a pretty cool setting and a little bit of humour here and there. Control and AI pathfinding can be a little finicky sometimes, but this is still a great game if you like old-school-style RPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Avernum was one of the staples of my childhood. While I admit that games like this are almost exclusively niche appeal, Avernum has a deep enthralling world that was the first of the RPG genre to really bring me in. There's lore everywhere, and in a game where the top down setting would get in the way of that, it actually shines here. The world feels real despite not being first or third person, couple that with cool battles, spells, enemies, skills, and of course, sweet loot, makes Avernum quite a good series.   If you've never liked RPGs or games of this top down turn based genre before, however, this will not change your mind.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good overall. It's a little like Skyrim - large world and generally short quest lines. It's also graphically archaic, with a lot of the flavour being supplied by text descriptions, and the interface is a bit clunky. There's no steam demo but there is a fairly extensive demo on the Spiderweb website.",
            "review_score": "1"
        },
        {
            "review_text": "One for fans of classic indie RPGs. Don't just look at the graphics and think it's cheap and ♥♥♥♥♥♥ - the developer Jeff Vogel has been building this world for years, creating a detailed fantasy setting and deep plot. You have a lot of freedom in character choice and progression, though this potentially lets you cripple your party by ignoring balance and picking all sorcerers. (Don't pick all sorcerers. That's hardmode.)  My favourite part of this game is not being told how tough an enemy encounter is going to be. You might wipe the floor with those giant lizards using a single Call the Storm spell. Or you might get dazed, ensnared, and burned to a crisp by exploding slimes. The fun part is picking up from your most recent autosave, assessing where you went wrong, trying something different, and coming out on top with another strategy. (Tip: trigger fights and then retreat to a bottleneck, if possible. Don't underestimate upgraded spells, either.)  The clumsiest part of the game is the interface, which harks back to more than a decade ago, and has some annoying quirks. Can't alt-tab on Mac? Pathfinding range is limited and automatically enters dungeons if they're in the way? Isometric layout makes it difficult to click enemies in the square above you? Some of this stuff seems so obvious that it makes me think Jeff's decided it would take too much time to chip off all the rough edges, but you have to admire his dedication to making games *for a living* which means *to a budget*.  (Edit: it doesn't look like I have many hours in this game, but that's because I mostly play offline on my laptop while commuting. I estimate I've spent at least twenty on it at this point - and dozens more in Jeff's earlier 'Exile' series during the mid 90s.)",
            "review_score": "1"
        },
        {
            "review_text": "Keeping this one short: AVERNUM: ESCAPE FROM THE PIT is a great tactical RPG with an interesting setting,complex leveling system, exciting story, and fun and simple tactical RPG gameplay. Get this game if you want a fun classic RPG. I highly recommend this game for your IPad, if you don't have one get it on your PC.",
            "review_score": "1"
        },
        {
            "review_text": "it's a nice game",
            "review_score": "1"
        },
        {
            "review_text": "Having played Exile in the 90's this faithful rendition takes you back to a brilliant RPG with a deep storyline and world which you can just sink into.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game.  But equiped itens don't seem to change de character figure :/ miss it in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Wow!! One of the best turn based rpg games I've ever played, highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Took a little while to get into, but story and feel well worth it. A real classic, despite being 'new'.   Also, one of the few RPGs were the end game really felt tense and worth it, emotionally and fight-wise.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics aside, of course, this is pretty amazing, especially for the price.",
            "review_score": "1"
        }
    ]
}