{
    "app_id": 208580,
    "name": "STAR WARS™ Knights of the Old Republic™ II - The Sith Lords™",
    "release_date": "2012-08-23",
    "developer": [
        "Obsidian Entertainment",
        "Aspyr (Mac, Linux, & Windows Update)"
    ],
    "publisher": [
        "LucasArts",
        "Disney Interactive",
        "Lucasfilm",
        "Aspyr (Mac, Linux)"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Workshop",
        "Steam Cloud"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Star Wars",
        "Story Rich"
    ],
    "achievements": 57,
    "positive_ratings": 8047,
    "negative_ratings": 978,
    "price": 7.19,
    "description": "5 years after the events of the award winning original, the Sith are on the verge of crushing the Old Republic. As a lone Jedi, will you follow the light side or succumb to the dark?",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/208580/header.jpg?t=1545238520",
    "minimum_requirements": "OS: Windows 7 or newer Processor:  Intel Core i3 (2 Cores), AMD A10         CPU Speed: 2.2 GHz         Memory: 4GB RAM Hard Disk Space: 10 GB Video Card (ATI): Radeon HD 5450 Video Card (NVidia): GeForce 260 Video Card (Intel): HD 4400         Video Memory (VRam): 256MB         Controller Support: Microsoft® Xbox® 360 Controller for Windows® (Wired), Microsoft® Xbox® 360 Games for Windows® Wireless Controller with Adapter, Microsoft® Xbox® One Controller (Wired), Razor Sabertooth – Gaming Controller for Xbox 360, Thrustmaster GPX, Logitech Gamepad F310, Logitech Wireless Gamepad F710 Important Note: For users that prefer the original version of the game or for users on old hardware that can no longer run KOTOR II in its updated form, we have created a &quot;legacy branch&quot; that will allow users to access the original released content.  Click on the support link and our team will walk you through the process.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Ten years old and still better than anything EA will fart out from their corporate butt hole.",
            "review_score": "1"
        },
        {
            "review_text": "This is Star Wars free from George Lucas. He created the saga, and Obsidian show how to continue it, creating more stuff thats even better.   I have played this game over 500 hours, I bought it on Steam just to have an easy way to install it. 4 cd to install it is a little annoying today.  I can write long novels why I love this game, why I play it more than I play Kotor 1. But I will try to make this short. The Sith Lords has: - great characters with deep personalities - dark stories and setting - a deep lore thanks to Kotor 1 and Tales of the Jedi-comic - fantastic dialog with complex possibilities - an improved crafting-system (6 parts-lightsaber anyone?) - Influence-system with your compainons - make your own jedi or sith-team. Even good guys can be turned to the dark side. - Be a jedi, or turn to the dark side and be a Sith Lord. It really change alot  Playing through the game once? You have missed much, I promise you, I still learned new stuff on my fourth playthrough.  Is the game perfect? No, its not. Its a slow start, it really is, and it was a rushed game, so bugs, it had alot of bugs on release, but nearly all is fixed today, and some things was left out, and not really a good ending, . But the way there, is so gooood. So much improved from Kotor 1, and so much content. Its a 30+ hour game.  From me, a die hard Star Wars fan, and not too experienced with rpg, its a 10/10 points.",
            "review_score": "1"
        },
        {
            "review_text": "Let me tell you the story.  Once upon a time, there was a Boy. That Boy had a dream. He dreamed about the galaxy far-far away. There were no limits for his imagination. So he created the world where rebels fight with Evil Empire. He decided to add some weeaboo stuff too, so there were Space Samurais called Jedi, and Evil Space Samurai called Sith. So they were fighting epic battles, ya-da, ya-da. And people liked it, and praised the Boy.  But then this universe got popular, and the boy sold out. He didn't care about his creation anymore, because he lost his dream, and his imagination ran out. So he sold out everything and began to pander to child audience, selling merchandise for ♥♥♥♥ tons of money. He also blessed various of talentless hacks (like Bioware) on creating tasteless and pandering copycats to get some cash.  You probably know that Boy by the name George Lucas.  But there was Another Boy. He was a writer. But not just writer, he was a videogame writer. And pretty successful one. He liked videogames. He liked to write for them. He went through tough ♥♥♥♥, however. But in the end he gathered the greatest team of RPG developers of his time.  But there was a thing that Another Boy hated. It was the universe George Lucas created and then butchered. Another Boy hated how childish this universe was. And the overpowered Jedi demigods, i mean WTF? Who the ♥♥♥♥ wouldn't kill himself instead of fighting them. Because Jedis and Siths secretly manipulated regular folk, oppressed them and did whatever they want with them. Another Boy didn't liked it. It was ♥♥♥♥.  So what Another Boy did? He created The Game. The Game without childish stuff, but set in this very universe. He deconstructed the whole thing, and then made it smart and quite philosophical too.   His name was Chris Avellone, and his brothers were Obsidian Entertainment.  And together they made the best Star Wars game ever existed.  Knights of the Old Republic 2.",
            "review_score": "1"
        },
        {
            "review_text": "Nominate this for the 'Test of Time' steam award because it is still the greatest rpg ever made",
            "review_score": "1"
        },
        {
            "review_text": "So damn good, Bioware's writers had to retcon it because they'd never be able to follow up to it.  Apathy is death.",
            "review_score": "1"
        },
        {
            "review_text": "- I don't know who you are. But, you picked the wrong room to break into. - Yeah? Well, you picked the wrong room to die in.  10/10 would break-in again.  Apart from that, the recent support that Aspyr gave to this game, revitalized it to a point that it's truly amazing. Even more that it was before. Also, now Steam Workshop is available and the TSLRCM is as simple as just clicking in 'Subscribe'. For a true and beautiful experience with this game, it's highly recommended to download it. This is the game (Counting the first one too, of course) that every true Star Wars fan needs to play.",
            "review_score": "1"
        },
        {
            "review_text": "Let me tell you a story.  I installed the restored content mod, booted up the game, made a Consular and went into the options to crank up the difficulty to the max before I started. I consider myself pretty good at games built off Bioware systems, and I played KOTOR I on the hardest difficulty without issue.  Fine, all was dandy. Played the game going full sith. Corrupted all my companions, which was a very memorable experience. Downloaded it on my laptop and kept playing from there. The first 35 hours of the game was absolutely amazing, and I was rejoicing in my EEVIL.  However, around the 30 hour point I noticed how easy the game seemed to be getting. Being the stereotypical arrogant gamer, I thought that was down to my epic skills and great build. I got lazy, thought the game was so easy, I only bothered to level up 3 characters, and the others were left in the dirt.  How wrong I was.  See, the first 35 hours or so are epic, but the ending of the game is unfinished. There are a lot of endless rooms with the same trash mobs. The restored content mod is a mixed blessing, because it brings back a lot of extra levels which feel very empty, as the devs only half-finished them and didn't put them in the game. By the 50 hour point, I was getting fed up. Just wanted it to be over.  Then came the HK factory. Oh boy. The ♥♥♥♥♥♥♥ HK factory is one of the half-finished levels put in by the restored content mod. It's in the ending sequence, so you can't back out once you've got there without losing hours of progress. Would usually be fine, but it turns out the HK factory is a solo mission. A solo mission for one of the characters I'd never bought gear for or levelled up. So I was stuck there. With a character with default starting armor, no weapons and no accessories. He has level 3 stuff, against endless level 23 trash mobs of EXACTLY the same enemy.   Let me get this straight, there are at least 100 enemy droids in the HK factory. Every single one of them was capable of oneshotting my character. He did like 10 damage to their health pools of 200+ HP with every shot. Whatever, I thought, I'll turn down the dificulty.  To my horror, when I opened up the options menu, I realised that when I transferred the game over to my laptop the difficulty settings had not transferred. I'd been playing the entire game on easy. This was as easy as it got. Oneshots and 10 damage per shot. It seemed impossible.  At this point, usually I would just laugh at myself and watch a let's play of the game's end. But for some reason I was determined to finish this game. It played me! I would get my revenge at any cost!  So I scraped together all the health potions I had and RAN through the HK factory level. If I got hit more than once, I'd have to start over again. It was absolute agony. I died so many times, as many rooms had 5+ enemies which could jump me at once. So I had to learn, gradually, the exact patterns I could run so that I could avoid taking the damage. It was the most pathetic I've felt playing a game. It took quite a few hours, and I was so close to giving up. But in the end, I did it. I suffered, but I did it. Upped and ran past every single enemy in that large level. And after doing that, I felt more satisfaction that I can ever remember feeling from playing a game - even after defeating Dark Souls bosses or something like that. I was rewarded by the game's real ending sequence (which is awesome).  I felt a warm glow of pride from being able to successfully run away from trash mobs on easy difficulty. 10/10 game is an emotional rollercoaster, would recommend the suffering to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Statement: I am happy to serve you meatba- I mean, master.",
            "review_score": "1"
        },
        {
            "review_text": "If I hear any more bad news I'm going to get violent.  Edit: Good news has come through. Obsidian gave it 4k and controller support. Woot!",
            "review_score": "1"
        },
        {
            "review_text": "Basically, it's the best Starwars game.",
            "review_score": "1"
        },
        {
            "review_text": "Forget what people have said, with the Restored Content Mod, this is not a broken game.  Even ignoring that excellent mod(which you shouldn't), this game manages to having the best writing in all of the Star Wars fiction. The characters, their motives and personalities, along with an excellent plot make this the most enjoyable part of the Star Wars universe.  All the other games, comics, shows, movies, etc. all assume that The Force is unquestionably the way to live your life. KOTOR2 dares to challenge this idea, and ask if The Force should even continue to exist at all.   The characters all represent the lengths to how far we are willing to go to get what we want, good or bad. They also show how people cope with tragic events.  If you even remotely like Star Wars, you should play this game.",
            "review_score": "1"
        },
        {
            "review_text": "KOTOR 2 uses the d20 system in the Star Wars universe. If you're a d&amp;d nerd and a Star Wars nerd, that should be all you need to hear.   If you need any more convincing, then the dialogue was done by Obsidian; if you don't find the phrase 'Welcome to Mar Shaddaa, watch your step or you'll fall for hours' to be hilarious, then you're looking at the wrong game.   The characters range from charming to annoying, and the dialogue is pretty entertaining, especially when HK is involved.   The game does have its share of bugs since it was rushed for a holiday release oh so long ago, but the Restored Content Mod brings back a fair share of stuff and fixes some scripting bugs.   Other than the engine being kinda old and clunky, I have no complaints about this game, and only the highest praise.   For those interested in gameplay time: oneone playthrough will take about 35-50 hours (probably closer to 35), and it'll take you two or three plays to get the full experience (light side and dark side, plus gray if you want to).",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: YES! Years later has been updated, and given even more replayability. We have 4K and 5K resolution support, Steam Workshop and controller support. Slice mercenaries and crush Jedi or Sith alike in new, glorious 4K resolution; using your xbox controller in a completely restored game.   'Apathy is death.' 'Explanation: Statiscally, overplanning the assassination of a Jedi seems to backfire.' This game will not give you black or white options. It will play with morality, and you will question Force ethics. Explore a simple, interesting and active storyline, hunted by Sith and memories of your exile, forge your path protecting the Jedi teachings, or eliminate the Jedi remnants, and become the greatest Sith in the universe.   Download the restored content mod for full fantasic incredible experience !",
            "review_score": "1"
        },
        {
            "review_text": "Favorite game of all time!!",
            "review_score": "1"
        },
        {
            "review_text": "restored my faith in video games",
            "review_score": "1"
        },
        {
            "review_text": "Exactly like the first one, hours of fun with mods to make your gameplay the best.  The story is also perfect, when you finish this you will dont stop thinking what the heck happened to Revan when he went to Unknown Regions? he really met the true sith empire something like that? is he dead? is the exile going to find him? i had these questions in 2006 ~ 2007 when i played my first time  well if you have the answers it's because you already played Star Wars: The Old Republic.  10/10 !",
            "review_score": "1"
        },
        {
            "review_text": "  Star Wars: KotOR II - The Sith Lords",
            "review_score": "1"
        },
        {
            "review_text": "Not as good at KOTOR 1 story-wise. The ending falls apart like right at the very end since loose ends aren't really tied up all that well.  It's still a great Star Wars game though and I really wish they made a KOTOR 3 instead of stupid SWTOR.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 A++ (I run El Capitan on Mac) I've been pulled back in the Star Wars franchise by the new movie, and recently played through both KOTOR games for the first time. After throughly enjoying KOTOR, I honestly doubted if KOTOR II could live up to the first game, and hearing how it was rushed and incomplete-ish, I wasn't expecting that much out of it. Boy was I wrong!!   Gameplay wise, there were a lot of small things that were improvements upon the first game (e.g. when you find a datapad it pops up right then so you can read it instead of having to search through all your belongings for it; your health points heal slowly when you're not in battle even without having to use a medpac, footlocked/corpse say whether they are empty if you've already looted them, no more really difficult to beat turret battles that you have to get through to continue the game!!!)  The storyline and characters are wonderful. There are so many well-nuanced, non-traditional-trope-following characters. Kreia and the Exile are awesome. Darth Nihilus is one of the best-designed scariest-looking Sith from the Star Wars Universe ever.   The storyline (to me at least) felt rich and complete up until the final planet/boss showdown. Even with the Restored Content Mod (which is essential, by the way), the last level did feel rushed, empty, and incomplete-ish. However, to me it still was a fairly-satisfying conclusion to the game.   I had a few small problems with bugs (namely on Nar Shaddaa and one at the beginning of Telos, so I recommend saving often and having save files available).   All-in-all, I really enjoyed this game and overall found it just as good if not better than the first KOTOR game.",
            "review_score": "1"
        },
        {
            "review_text": "The best RPG",
            "review_score": "1"
        },
        {
            "review_text": "Honestly one of my all-time favorite games. There's a reason why Obsidian is a fan-favorite company, and game like KOTOR 2 and Fallout New Vegas are prime examples of it.",
            "review_score": "1"
        },
        {
            "review_text": "I wiped out anybody that posed a threat to me along with my assasin droid and my Sith girlfriend, but i chose the 'correct' answers in my dialogues. I'm the Jedi Order's pride now, with maximum light side points!  10/10  (Seriously now, it's a fantastic RPG, get it and don't forget Restored Content Mod ;) )",
            "review_score": "1"
        },
        {
            "review_text": "An incredible follow up to KOTOR. While the early game is a slog, the mid-game is the biggest chunk and it is incredible. So much to do, new powers and stances to work with, and an intriguing story. The end game is somewhat disjointed, but anyone who knows about the checkered history of this game knows the reasoning for that, and should not be deterred. Just download the Restored Content Mod, and all is well :).",
            "review_score": "1"
        },
        {
            "review_text": "Graphics: For an 05 game, it looks pretty damn good (if you have a good graphics card, that is). Keep in mind though that it 'is' a 2005 game, so don't expect anything incredible. 8/10  Story: Here is where TSL shines. I have quite honestly never played a Star wars game with such in depth writing. From the deep and well thought out exploration of the moral grey areas between the Light and Dark sides of the Force to the deviously intricate, and VERY well written main quest, KOTOR II's writing is nothing short of incredible. 10/10  Characterization: This of course ties in with the aforementioned excellent writing. The characters in this game feel more like living, breathing people, and less like the one dimensional caricatures of KOTOR 1. The addition of a good influence character influence system (you can't just give characters gifts to 'make' them like you ala Dragon age: Origins) that prevents you from pleasing everyone increses my score from what would have been a 9.5/10 to an outright 10/10  Combat: Combat is greatly improved over KOTOR I's rather basic system. As you improve your combat feats, they don't just become more effective: they change visably as well, becoming more graceful, powerful, and masterful-looking all the time. 9.5/10  General overview: I probably should rate the game's overall sound quality, but i'm not very good at distinguishing good game audio from bad due to hearing issues. Sorry about that. Overall, i would rate this game a 9.5/10. Besides Battlefronts 1 and 2 and Star Wars Galaxies, KOTOR II is one of the best Star Wars experiences you will ever have (BE SURE to download the Restored Content mod, as it will unlock much of the content that Obsidian was forced to cut out due to LucasArts' unreasonably short Christmas Deadline).",
            "review_score": "1"
        },
        {
            "review_text": "In some ways, it is stronger than the first game. The influence system is terrific as well as the storyline. HOWEVER: It is only stronger if you mod the hell out of it. You'll at least want TSR, if nothing else. Downloading some other attended content ones is suggested, as well as ones to make it look better.  Your gameplay is about the same as KOTOR, with some added force powers. YAY FORCE POWERS. There's two romances for the females and two for the males, unlike the one you were locked too without cheats in the first one. *cough*Juhaniromancemods*cough*. I also suggest using KSE because some places are a total ♥♥♥♥♥ and a half to get through.  All in all, it's a good game and well worth it. KOTOR is still in my top 5 games of all time and this one isn't, but it's worthwihle.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, played this game again after YEARS and it's still so damn good. If you're a true gamer, you'll value the quality of a game over its' graphics and this game...wow.  10/10 game, and if you've finished this once in vanilla, you should replay it with the restored content mod, it makes it even a better game.  Overall, an amazing sequel to Knights of the Old Republic (also a good game) and deserves all the love it currently has.    Also, the game was recently updated, so it should work with your setup. Buy Kotor2 and give yourself a fun time :D",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing,  KOTOR II The Sith Lords has finally gotten the update it so richly deserves. Now if only KOTOR I would get the same update I would be a happy camper. A must buy for any Star Wars fan.",
            "review_score": "1"
        },
        {
            "review_text": "After all these years. It still got an update. Thank you Aspyr for ruining my life for the moment.",
            "review_score": "1"
        },
        {
            "review_text": "I recently had the pleasure of replaying Knights of the Old Republic II with the Restored Content mod. Taken as-is, KotOR II is a fantastic, if unfinished, successor to the first KotOR. The fanmade Restored Content mod works to add in and finished content that didn't quite make it into the retail release while also stomping out the many bugs that plague the game. It is an absolute must-have for the game.  The game's main draw is its rather ambitious story, weaving a tale of shades of grey in the otherwise bipolar Star Wars universe. Thematically, the game might even have less in common with Star Wars and be more of a cousin to the classic Planescape: Torment (a personal favorite), which is probably why I enjoy KotOR II even more than its outstanding predecessor.  If you enjoyed the gameplay of Knights of the Old Republic and/or Obsidian's singular style of storytelling, give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing complement to the first game. Whereas the first game has a very 'New Hope' kind of feel to it; a very classic Star Wars type heroic tale of galatic grandeur, this game delves into the more personal and darker elements of the Star Wars universe. Character development is extremely thorough and integral to the story, along with the tremendous focus on party member relations. Improves on all fronts. Easily a top five pick for me. Worth $10, but sometimes it goes on sale for as low as $5 or $2.50. At that rate, there's no reason not to put it on your wishlist.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. I wasn't that interested in RPG's before playing the first game, but that game cured that. This one got me interested in making mods and after just playing that kept me entertained for a very long time.  Pro's - Star Wars, lightsabers etc. - Great story telling &amp; story-related choices - High replay value because of character choices &amp; mods - Great updates by Aspyr for this Steam version to make things run better with today's computers - For modders: lots of modding tools, modding tutorials, mod sites etc. were made over the years  Con's - Rushed content, especially at the end of the game - What you can do with Steam mods is limited, it could really use some kind of mod manager to combine mods",
            "review_score": "1"
        },
        {
            "review_text": "This is the somewhat disappointing lead-up to the amazing first Kotor. It bears all the strengths of the first game. However, everything is kind of diluted and unfinished. The writing is great, but the plot less engaging; the characters are nice, but the dialogue is annoyingly open-ended; there are more powers and items, but the game mechanics are extremely broken; the game is longer, but there are idiotic gaps and missing content.  You can talk through the same stuff over and over again with the NPCs. You can go light side weapon master and still spam force storm a hundred times in a fight. You can get in serious trouble by going to Nar Shaddaa as your first planet. Or by playing even one of the side characters in the wrong way. You can miss important bits of information if you don't choose the exactly right dialogue options. And so forth.  I would still say it's worth playing through at least two times. Despite all its flaws and being in the shadow of its predecessor, it's still a great Star Wars RPG. It's not like we have that many of those around.",
            "review_score": "1"
        },
        {
            "review_text": "Finished the game twice 10 years ago, but it still feels like an epic game today.  Going through the story again, and the latest patch, combined with the various mods you can find on the web make it one of the greatest RPG game ever. You can count on at least 15-20 hours of gameplay if you want to finish the game on 1 side of the force, while doing all the side quests.  Nice story, more complex than the 1st one, and for any Star wars fan, it's a must have!  Graphically, while not being impressive, it's still nice to play, but you don't play a Kotor for its graphics. Musics are nice and fit well in the universe.  The only point I would have loved to see improved are the fighting animations, too few in my opinion.   Definetely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "SW:KOTOR 2 is an RPG game Developed by Obsidian Entertainment. The game takes place a few years after the events of KOTOR 1 after Revan defeated Malak and saved the galaxy. But now after departed deep into the outer rim of the galaxy, a bunch of Sith Lords, have appeared and have almost completly destoryed the Jedi order and the remaining Jedi Masters are into hiding. You play as a male or female Jedi Exile which you learn later into the game about why you were exiled from the Jedi Order. After escaping a Mine Fuel facuilty (Either by blowing it up and evading a sith ship) you head to a orbiting facilty above a planet called Telos. After being imprisoned and captured by them you find out the ship you traveled in, the Ebon Hawk has been stolen. After helping a light or dark side corporation and meeting a soldier that knows your character, you travel to many places into the planet until you get your ship back after finding out a Jedi Master lives in a acdemy in a polar region of the planet. After a companion gets the data base at the academy you find out why, your charcter was exiled and leaves you between two roads: Do you gather up the rest of the Masters to help you fight the sith, or do you join the sith and hunt down and kill the Jedi Masters?  The companions you meet are all cool and deep. They all have secrets behind them which you have to get them to trust you to find out. Some of them you may not enjoy (like a stupid robot that is a jerk), but alot of them are fun to talk too, a few of them were in KOTOR 1 that make a return like T3-M4 and HK-47.  One of the highlights of this game is the Light and Dark side paths. Through multiple parts of the game you sometimes given a choice such as kill an innocent by raiding his house then kill him as he returns (Dark Side) or saving someone from mercneary thugs (Light Side).  The gameplay is a turn base or real time action (Can be chosen through menu) game. The game has powers that are ran by a 1d20 system. I'm stupid so I don't know much about the system but if you know stuff from Dungeons &amp; Dragons you might understand it. The level cap is to belive is 30 but that doesnt mean its easy and should be taken lightly. Like how Fallout 3 and NV take a while so does this. This also means you want to spend Attributes when making a character very carefully as messing up might make it harder to clear the game. For example: putting alot of points into Constitution and Intelligence might give alot of VP and skill points to use, but at the cost of FP (force points) which might make it harder for you to use force powers.  OVerall KOTOR 2 is a fun game, with it just getting workshop, people can get the restored content mod and get the true and perhaps best parts of the game. Problem is sometimes that game can be difficult with what planets you decide to visit and there are some annoying puzzles. I find the 10$ to be worth it but if you would like try to get it during a sale...  This game gets a 9/10 - A fun and amazing game but with some minors problems.",
            "review_score": "1"
        },
        {
            "review_text": "Huge fan of the first game when it came out and I've completed it more times than I can remember. I got this game in January 2015 hoping it to be as good as the original.  I was not disappointed.  Its fantastic game that you can repeat over and over again and it doesn't get boring. Each time you play you discover a new challenge, extra interactions with characters, new possibilities and new gear. Whether you start as a grey jedi, dark or jedi the possibilities are endless.  If you enjoy RPGs and strategy games then this is perfect for you- the best thing is, is that you don't need to know much if anything about the first game or Star Wars in general to play.  Great game!",
            "review_score": "1"
        },
        {
            "review_text": "8/10  Obsidian, the king of sequels! Known not only for the sequel to KotOR, but also the sequels to Fallout 3, and Neverwinter Nights, and also making the 3rd Dungeon Siege game. One thing we can learn from these guys track record is that while they will sometimes make a decent engine seem a lot more buggy, they have a good ability to craft an even better story than their predecessors (most of the time). And that is no different in KotOR 2.   Taking the ball that Bioware handed off, and running full force with it, Obsidian brings players back to the world of the old Republic, and puts them back in the role of a Jedi, and his or her team as they battle the evil forces of the dark side, or ultimately succumb to it. More so in this game than its predecessor, you actually feel the changes in your choices having an impact on your entire team, and people you meet. You can be the good jedi, following the righteous path and helping those in need. You can go straight evil, and fell those who get in your way despite being good natured. You can be sneaky and devious, neutral, or whatever you wish. Most dialogue paths have a good number of options to change the outcomes. Ultimately though, it either leads to a gain in light or dark side points, or nothing at all. So play it how you want!  KotOR 2 is a team based RPG adventure game, with 3D visuals, and battles happening in real time, with a mix of turn based elements that use the age old 'dice rules' method for any moves you may choose to dish out to your foes in the heat of battle. You see enemies, you choose your moves. You can also switch between one of the 3 currently chosen party characters at will at any time, during and out of battle to strategize. And over the course of the game, you will find a number of teammates to accompany you on your adventure. Some required for the adventure, and some can tag along based on choices you make. Like in most RPGs, you can gain new skills and abilities by leveling up. Speaking of which, the level cap from KotOR 1 has not been rasied, but rather, removed!  Rather than taking place on 1 world, like in most RPGs, KotOR 2 will have you venturing across many different planets on your journey. Aside from a lengthy first few areas, the game opens up into something grand and open ended after about the 3 or 4 hour mark, with several planets to explore. You will travel from planet to planet on your ship, the Ebon Hawk, which is also where can converse with your entire team. Once on a planets surface, feel free to explore the locals. Shop, talk to people. Do side quests. And more! There are a few mini games even to be found in the game, including a card game, and a sort of pod racing mini game.   While there is a lot to be said positvely about KotOR 2, it is not without its faults. The game is still a bit buggy, but not as much as when it first came out. Animations can be a little off when interacting with objects. Characters can get still get stuck. Sometimes characters will stand in odd places when conversing, and more. Also, there is little adjusting for graphical settings. You will pretty much need to mod the game if you want to play it at your monitors resolution. It can be a hassle, but it is easily done with the right tools, and very much worth it. Modded, KotOR 2 looks a helluva lot better than what I remembered playing many years ago.   Bottom line, if you are a Star Wars, or an RPG fan, you owe it to yourself to pick up one of the games that helped pave the way for games like Mass Effect. Buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "It's buggy, it's broken, and unless you get third party mods or have a great computer, you won't be able to watch the cutscenes, but I still love it all the same. Gaming history here.",
            "review_score": "1"
        },
        {
            "review_text": "If you are going to get this make sure to get TSLCRM - The Sith Lords Content Restored Mod. It restores a bunch of content that was cut from the game and makes it much more complete.",
            "review_score": "1"
        },
        {
            "review_text": "Played with the restored content mod in Windows 10. I had to turn on compatibility mode and then everything went fine.  The game itself.. still feels incomplete, even with the restored content. It's also very easy, I can think of only one difficult encounter in the whole game and even that one could happen only for certain kind of character builds. The story itself has a few interesting twists, but the pacing of the storytelling is flawed and unpolished.  I remember playing the first game many years ago and it awekened my interest for videogames after I hadn't clicked any kind of 'new game' for many years. This one feels like a dungeon crawler with huge and empty corridors and a few brilliant ideas thrown in every so often.  Still, it kept me playing for a few days. I even considered of giving the Old Republic MMORPG a try because of the potential expressed in this game, so... thumb-up, 3/5.",
            "review_score": "1"
        },
        {
            "review_text": "Great game when used in conjunction with mods to complete this game. The devs rushed it a bit.",
            "review_score": "1"
        },
        {
            "review_text": "For someone that has more than 200 hours on this game on PC, and probably 500 on xbox, this new update is amazing. I've used mods at filefront before like the restoration content mod but this.... this is just. THANK YOU VALVE I LOVE YOU. If you get this game, I highly reccomend you get the restoration mod in the steam workshop. It fills in the holes that LucasArts was too mean to let them finish.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game",
            "review_score": "1"
        },
        {
            "review_text": "I am about halfway through the game right now, playing through for the first time and wow wow wow. I am a huge fan of the first game, and this takes it to a whole new level. Basically the same software as the first game, same graphics and menus and all, but the gameplay has been expanded so much, and there is so much more you can do and NEED to pay attention to.    -The updated crafting system, which involves salvaging items and creating weapons, armor, and modifications for both, is really addicting and much more deep than KotOR 1.    - The dialogue options and personal connections you can achieve with the characters is amazing, including the Lore, the relationships possible, the twists (most of which I have yet to experience I'm sure) are, again, very deep and enjoyable to explore.  - The locations and planets you visit are large and worth of the Obsidian/Bioware partnership. These dev's are well known for the deep content they are able to produce, and the large worlds they can create.   George Lucas would ♥♥♥♥ his pants if he played this game. There are things about Star Wars in this that he probably doesn't even know. If you like Star Wars and RPG's, MUST BUY",
            "review_score": "1"
        },
        {
            "review_text": "I played SW:TOR II before I played the first on Xbox, so I may be a little biased. I just loved the characters in this one. Plus the replayability in this game is crazy good. I wish I knew how many hours I put into it on Xbox haha. One of the best RPG series out there, if not the best Star Wars game.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, first of all, as an owner of both KOTOR and KOTOR 2, this game is ♥♥♥♥ing fantastic. There is alot to explore, dig into, and play in this game. Without mods alone, there is alot to experience here in the last edition of Knight's of the Old Republic (sad, i know). Please, with my heart's content, give this game a chance, you will not be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "Immersive sci-fi RPG goodness.   Story A+  Extension mod comes highly reccomended.",
            "review_score": "1"
        },
        {
            "review_text": "There has never been a better bunch of ragtag heroes to save the galaxy. Whether they are likeable, evil or a little psychotic there is no better company to shoot up thugs with a couple of blasters and a lightsaber. Honestly this is the only game i consider not skipping every sentence a Companion or NPC has to say.   This remains one of the very few Star Wars RPGs out there and is definetly worth a play (especially if you are new to the story). Choices actually matter, the companions are useful and interesting, and to top it off the story is strong and has depth. The ending for KOTOR fans can be a little disapointing, but it doesn't change the fact star wars fans SHOULD 100% buy this game.   (Probably should pick up KOTOR 1 as well whilst you're at it, probably has the stronger story - companions can be more one dimensional at times though)",
            "review_score": "1"
        },
        {
            "review_text": "This is a great sequel to the first game and lots of Star Wars fun for people who grew up on good Star Wars movies.",
            "review_score": "1"
        },
        {
            "review_text": "Started playing this game when it first came out many years ago! Still play it today.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game on the original Xbox and always found it lacking vs KOTOR 1. I purchased this game reluctantly knowing that. Nostalgia feels are amazing so I wanted to add it to my steam collection. I also had no idea how many bugs this port had and how it would preform on Windows 10 and 1440p display. I was suprised when I found it was steam community workshop. I tried the mod 'The Sith Lords Restored Content Modification (TSLRCM)' and not only am I staisfied with the game, I am exicited to play this game multiple times again. Game does not run perfect but its one of the best ports I have ever played. Runs great on Windows 10, 1440p resoultion capped at 60 FPS. I would highly recommend this game EVEN if you played it before without the restored content mod.",
            "review_score": "1"
        },
        {
            "review_text": "People always talk about how KOTOR II is crap compared to the first, but I beg to differ. This game is a lot less glitchy than the first KOTOR and there is less lag to it as well. The storyline is well down and it still has all the good features that KOTOR had. I highly reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of any type of RPG - Star Wars or not - I guarantee that you'll love Knights of the Old Republic 2. It's execution is very simple yet very effective, something games tend to miss these days; being too complex for the sake of complexity.   The storyline (while a little cliche) is extremely well written and thought out, revealing itself slowly to the character as they make their own choices through the game. Characters like Atton Rand and especially Kreia have very deep and rich backstories that not only add to the fantastic story and atmosphere to the game, but will also change depending on what you do in the game. Depending on the choices you make, some characters will favor you while others will not. For example, if you decide to execute a criminal, one character might applaud you for such an action while another will disapprove. All these choices affect how much information you can gather from them during your playtime.  The combat is simple, and if you've played the original Knights of the Old Republic, you know exactly what to expect. This is not a bad thing, however. If you enjoy pause/point-and-click combat, then you have nothing to worry about.  Keep in mind, this game was released in 2005, so the graphics aren't going to be hyper-realistic and since the game was rushed during development constrictions, content WAS cut from the final release. That being said, there was a fan-made mod that actually restored all the lost content - You can find it with a simple google search: 'KOTOR 2 TSLRCM'  Had this game been given the time it deserved for development, it would have been WIDELY recognized as one of the best RPG's ever made. Nonetheless, Obsidian Entertainment did a fantastic job taking the reigns from Bioware, and formed a story that was ten-times more interesting and engaging than the first game, introducing rich characters - both fearsome and loving - and bringing moral choices that sculpt your very adventure.   Do NOT miss this game - It's worth your time.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Good Game follwing up after the events of the First Old Republic. Very moral and deep pshycological motivations of Jedi/Sith within the journey you will choose and unfold.   Mold the character you play to be evil,good mixtue through actions and decisions.   RPG framework so level up, skill trees etc.  Supported with steam workship and achievments.  Lightsabers.     ",
            "review_score": "1"
        },
        {
            "review_text": "After all these years with this update its not just playable again, but even better. Modded it right away, got the Restored Content Mod:  Not that it wouldnt be fun to rush along it but im not really a fan of the Peragus levels so i skipped that as always (mod also), I planned to be as evil as possible from the beginning but I recieved so many good old feelings from the companions that i couldnt do it, even more with the restored content, The ending really focused on the companions finally, which always got left out from the original version. I have to say, thank you! Play it!",
            "review_score": "1"
        },
        {
            "review_text": "KotOR 2 and KotOR 1 are the greatest video games ever made. I really hope they do make a KotOR 3.﻿",
            "review_score": "1"
        },
        {
            "review_text": "Great game. recomend getting the restored content mod to get some fun stuff, if you played the old version before. achievements are really really glitchy, got the danceing achievement for making a character.  10/10 would nostalgia again",
            "review_score": "1"
        },
        {
            "review_text": "Loved the game on the disc so decided why not buy it on Steam, saves me having to fork out more and more cash incase I accidentally sell this masterpiece.  So the story goes as this, you are the Jedi Exile also known as Meetra Surik (Female Canon Name), you've been exiled from the Jedi Council because you followed Revan to the Mandalorian Wars and took both Jedi and Mandalorian Lives. You awake in the Peragus Facility after an astromech droid by the name of T3 saves you from near death, you awake, without most memories but with your wits intact.  You open the morgue and look for a Plasma Torch, overlooking a female corpse who turns out to be alive, her name is Kreia   Or Darth Traya if you know her backstory   , she tells you that you are her rescuer and she is your rescuer and that there was no time to discuss anything since the whole facility was under attack, you leave Kreia to meditate and venture forth to find a ship to leave Peragus II, but end up finding a pilot named Atton   Secretly, a Dark Jedi or a Jedi Killer   , you end up freeing him whilst you search for a way into the Mines to get a ship and leave, possibly with or without your companions but the entry is blocked since Emergency Shutdown was initiated.  T3 is called up to get the Shutdown reverted and he does, sacrificing himself for his team, ending up stunned and thrown in the fuel line, but you manage to make it through to the Turbolifts where the shutdown was reverted to find the Captain killed and a HK Droid standing there. You progress through space and come inside the Dormitories, find your way back to the team and try to run to the ship thats just docked when oh no, that HK Droid wants the bounty on the Exiles head. You beat HK and his floating mines and end up on the Harbinger, a Republic Ship now controlled by Darth Sion and his crew of Sith Assassins.  Not going to spoil any more, just enjoy playing the game yourself.",
            "review_score": "1"
        },
        {
            "review_text": "IMO one of the best games ever made. the first game is very good too.",
            "review_score": "1"
        },
        {
            "review_text": "great game and good story, was excellent for it's time if it wasn't so buggy back then. get the mod to fix it if you buy this game 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": " Pros:  -Immersive star wars role playing experience -Morality is more intricate than just light side/dark side this time -Wide range of character customization -Well developed companions -Weapon customization (you can have whatever lightsaber color you want!) -Large amount of content -Relatively high replayability -Nonlinear gameplay; player can choose to do the plots in whatever order they desire -HK-47 and all his quotes   Cons:  -Cut content; Obsidian had to rush this game into retail, and had to cut a lot of content. Thus, the plot has some noticeable gaps and seems choppy -Mild bugginess, but nothing game breaking   Overall:  First, it's worth mentioning that there is a Restored Content Mod that Obsidian took part in allowing. This mod adds a lot of cut content, including an entire plot arc with HK-47, back into the game. If you buy this, you should absolutely install that mod as well.  That said, Obsidian took up the reins and did the series justice. It's unfortunate that they had to rush the game near the end, because the plot is fantastic and really deserved to have its day. But the gameplay is still fun, immersive, and captivating, and the amount of customiztaion for your character has only increased from the first game. It's a pleasure to play, and rarely does the game become tedious. Instead it's just a fun ride from start to finish.   Bottom Line:  Absolutely recommend",
            "review_score": "1"
        },
        {
            "review_text": "Great game (even better than KOTOR).  Still fun even 10 years after its release. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you're a fan of Star Wars and RPG's. Some might find issues with the graphics which do show their age, and the combat mechanics however. But if you can look past that, then you will find a game with a good engrossing storyline, and great chracter interactions and development.   Great sequel to the original, although it does suffer from a lot more bugs. Which is why I'd also recommend anyone who ends up purchasing it to install the The Sith Lords Restored Content Mod, which you can find on here through the Steam Workshop, it's an easy install.",
            "review_score": "1"
        },
        {
            "review_text": "This is a deeply brilliant game, but it's flaws are real and present.   the original release was brutally cut for financial reasons and released early, full of bugs and plot holes. it's derivative of the original and suffers a muddier plot, disjointed and abandoned story threads and muddled antagonists that don't drive the narrative.   But there was clearly something here, and it was based on one of the best RPGs to date. Every game system is a refinement and extension of the first game; but more elegantly implemented and more polished. The events and world of this story are natural outgrowths of the back-story or events of the first game; but where the first game barely sketched the universe with stock characters, this game renders the fine details of the darkest days of the old republic with complex and compelling characters.  This is a game that tells the aftermath of the hero's journey. Depicted is a galaxy limping off and winding down after the great blows struck by the Mandalorian wars (in the back-story to the first game) and the Jedi civil war (the last half of which are the events of the first game).   The more complicated plot hides multiple interlocking stories, telling many tragedies. the characters are all richly developed, but there are no simple heroes or outright villains. the heroes are all tragic, with deep character flaws that drive them more then the events. There are no clear villains because even the villains are tragedies in their own right, deftly interwoven with the larger narrative, and each a demonstration of their failures and a warning of the danger of their paths.   Years of work by the community have restored the cut content and revealed the ambitious pattern of story threads lost to budget and time. Community fixes have corrected bugs and fixed issues, even to the point of hex editing and reverse engineering. Even the developers have gotten into the act, releasing a patch 10 years after publication (and subsequent commercial failure) adding support for high resolution wide screen monitors, steam achievements, and workshop mods.  Now we have a game that approaches realization of the ambition of the developers, and delivers on that narrative with competence, provided you're willing to take the time and spend the effort to breath with it. Taken on it's own, it's fractious and oppressive world is a cautionary tale of hubris, but when combined with the original, it's a dark counterbalance to that bright tale, putting both into sharp relief. This truly is the “Empire” to the original KotOR's “New Hope”.   This is a deeply flawed game, but there is a genius beneath it's surface.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun. One of the best Star Wars there are. Make sure to play with the KOTOR II Complete Mod though.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely reccomended for people who like suspense and action. I've played it long ago, and playing it over again doesn't take away my experiences for the first time. the game can be played in many different styles, with TONS of side quests for those who like to leave no stone unturned. It is very much worth what I spent on it.",
            "review_score": "1"
        },
        {
            "review_text": "Its a good game 2 thumbs up!",
            "review_score": "1"
        },
        {
            "review_text": "I love being evil in this game.  &gt; Atris: You have returned, why? &gt; xXx Sith BroShep xXx: I want my property - my slaves and my ship - returned. &gt; xXx Sith BroShep xXx: Give me my ship or I'll murder everyone here. &gt; Sith BroShep wins. &gt; gg  10/10 Would enslave crew again. Would be edgy Sith edgelord again.",
            "review_score": "1"
        },
        {
            "review_text": "A million times more interesting than the first game, which was already a really good game. For the first time the concept of morality is applied to Star Wars.  Kreia is the best character I've ever seen. Chris Avellone is a god among us mere mortals.  Everyone play this game (but with the caveat of the restored content mod).",
            "review_score": "1"
        },
        {
            "review_text": "KOTOR II has some of the most compelling character development in an RPG. Though the game is notoriously buggy (save frequently! look up known bugs so you're prepared!) there is an excellent restored content patch available that makes the game more stable and restores content the developers were forced to cut from the game due to time constraints. Do yourself a favor, and play this game.",
            "review_score": "1"
        },
        {
            "review_text": "I think its a better story than the 1st... just make sure you play it with the restored content mod",
            "review_score": "1"
        },
        {
            "review_text": "Generally very good and very similar to the first one. Kreia is extremely poor and annoying character in my opinion and the ending was not satisfying in my opinion. Actually it was quite confused to get what is going on. I could talk more about flaws as it did not impress me as much as the first one. Then why I recommend it? Simply as it is a great copy of the first game, that will give you a lot of pleasurable hours with Star Wars. Great RPG made whne BioWare was at the top. Or simply maybe I just did not get that game... Solid 7/10",
            "review_score": "1"
        },
        {
            "review_text": "When I gave away my old PC games I kept few of them, being KOTOR 1 and 2 amongst them. I finished both once when they went out and I was thinking on playing them again but was a bit lazy about it... until recently.  If you are a Star Wars fan, play KOTOR 1, then KOTOR 2... these are the games you are looking for.  I'm not a hardcore gamer, nor a good reviewer, but I definitely feel like reviewing this game. I'm playing it with the Restored Content mod and I played this game first 10 years ago, so I don't really remember which parts are new.  I'll start with the cons, not very important to me, and then get to the real point: - Just few choices on character aspect.  - The controls are a bit weird. - Sometimes your character gets stuck. - You felt you had a lot of moving freedom back when the game came out but, for today's standards, you don't really have that freedom in terms of where to go. - Even in places supposed to be crowded, there's not many 'people'. - Sometimes the game becomes incredibly hard and forces you into a combat you're not ready to win, but you can't avoid and you HAVE to win... that forces you to:  a) runaway in circles while healing yourself and/or recover force power (which is boring and you feel like cheating).  b) cheat directly and avoid wasting time doing a)   I've seem some reviews complaining about some of your companions being useless/weak or not interesting... that could be true, but the game allows you to show them you think that, so it's not a con to me. Plus, there are situations and dialogues that change depending on which companions you go with.  For me, the rest is great... Great story, great characters, great dialogues, attention to details... I think that you can even have an idea of what happens in KOTOR 1 just asking questions (but play KOTOR 1). Oh! and lightsabers!!  In my opinion you can face the game in two ways: thinking ahead what do you want to do and choose your dialogues and actions according to that, or don't think about it and just let yourself go. I strongly recommend the second option. The great writing and dialogues (and choices) allows you to do it. If you take your time to read and answer you will have a lot of information and it will help you to get into the story; once there, you will have an opinion of what happened and what to do next that will 'guide' your path. This second part is not black and white and there are many options from clearly white to clearly black passing from not so clear ones. You can even be white sometimes and black others. I'm not going to make spoilers here but, although I remember very little from my first gameplay, I remember ending up halfway into the dark side using two red lighsabers. This time I'm full light side and I'm using a single blue one.   I said you don't have a lot of freedom in movement, but you have that freedom on mostly everything else. You choose your weapons, your armour, Oh! and lightsabers!! You decide to help ones or others, or both, or none... You will stop many times thinking what choice do you want and measuring the consequences...   (I confess I spend a lot of time pressing X just to do those lightsabers movement).  My final thought is... KOTOR 3, please! How cool would it be a similar game with the roaming freedom of GTA or Elder Scrolls?  And works great in Linux!!!  Final words: get this game. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: Beautifully made game, deep story. Fixes below. You're all meatbags. All hail the Gizka's.  Absolutely one of my most favorite games of all time (and I play many games). This game is a gem of both RPG's and the star wars universe because of the amazing depth in storytelling and the way it engages me and allows me to make my own choices, something I've found lacking in games recently. Originally I owned both KOTORs on xbox (and shamelessly logged   hundreds   of hours into each) and rebought them on steam for the third time (original disk broke) just to play it again.  ---What you need to know--- Yes, the game is buggy. This was made for much earlier versions of windows and you're likely to suffer the odd glitch every now and then. HOWEVER there is, of course, a fix! A few of the catch-all fixes that I've used and have worked for the PC versions are as follows;    The   swconfig   file which can be found in your game folder installation directory. Open this and check 1) Enable Hardware Mouse and 2) Disable Movies. You miss a little disabling movies and so you may want to go back and uncheck it and see whether it works for you. Last resort you can watch them through the main menu or through the magic of the internet.    Editing the 'swkotor2' configuration file, found in the same directory. Should fullscreen not work out for you as it didnt for me then paste the following line below [Graphics Options] --&gt; AllowWindowedMode=1 Then change the 'Fullscreen=1' to 'Fullscreen=0' and you'll be playing in windowed mode.    Enabling compatability mode. Not difficult to do, which compatability you use depends on your system.  The internet is your friend! By no means is this a comprehensive list, just the major ones that I've confirmed to work for myself or others.  Truly this is a fantastic game and easily worth its price. Also look out for the Restored Content mod, which flushes out the story to its true potential and adds so much great stuff to the game! Now quit sitting around and buy the game already meatbags.",
            "review_score": "1"
        },
        {
            "review_text": "If you like RPGs this is one game you just have to play (likewise for the first one). The first game was amazing, but the second one polishes and improves on many things the first game introduced. I played this game about 2 dozen times, each time with a different combination of classes, spells and companions. While some of the stuff 'stays the same' there's a lot of things that are different each time. Your experience can vary wildly from game to game. I last played this game this year, and i had just as much fun now as i did when it was released.",
            "review_score": "1"
        },
        {
            "review_text": "The Sequel to the Bioware masterpiece, Star Wars Knights of the Old Republic II - The Sith Lords, is another incredible gaming experience and an important addition to the Star Wars universe. This game has a much darker undertone than its predecessor and although the plot arc isn't quite as rewarding as the first game, it still manages to stay faithful to it with an interesting plot twist. The gameplay is enhanced from the original with more feats, powers, weapons, customization options, and levels available, as well as new Jedi and sith prestige classes. The squad you recruit changes depending on your gender, and your alignment with the force, and some can be trained to use the force and become Jedi. Squad members remain interesting characters and now change based on the player's interactions with them. Several characters from the first game return (though not all are playable characters) and the Ebon Hawk is still your personal starship. Your journey takes you to a handful of worlds in the Star Wars Universe, some are new and some you may remember visiting or hearing about from the first game.  For a more enjoyable and complete experience I would recommend all players download the TSL: RCM from the workshop or internet. The Sith Lords Restored Content Modification add in many things that the original game lacked due to time constraints in development. A community project which took many years to perfect, this mod adds a whole slew of new content to the game which big or small, makes the overall experience twice as enjoyable. For those who have only played the Xbox version of the game, or did not previously have the mod installed, you will find that this mod makes it a whole new experience.  The recent update that adds achievements and workshop support is the best thing to happen to this game in the last decade. Now that everyone can add mods to this game AND earn some achievements, this game has new life breathed into it. I give it a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "If you like RPGs this is one game you just have to play (likewise for the first one). The first game was amazing, but the second one polishes and improves on many things the first game introduced. I played this game about 2 dozen times, each time with a different combination of classes, spells and companions. While some of the stuff 'stays the same' there's a lot of things that are different each time. Your experience can vary wildly from game to game. I last played this game this year, and i had just as much fun now as i did when it was released.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games I have ever played. I love how I can play this game so many times and have a different experience each time. I have completed this game over a dozen times and know there are still things I could do differently to change my experience with it. The characters are al unique and fun to try to get to know and influence. And it has a great story, continuing after the events of the first Knights of the Old Republic game. While I find this game great as it is, if you play it with the restored content mod it's an even greater experience, with far more possibilites and details to the story.",
            "review_score": "1"
        },
        {
            "review_text": "You can deflect blaster shots with kung-fu. 'Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Star Wars Knights of the Old Republic II is a very special game to me. It has a well written storyline with plenty of side quests. It has really solid gameplay especially for its age. Being able to take the turn based combat into real time freely while preparing the next few actions you want to take in combat is a brilliant mechanic. The story aside from towards the end where it just felt rushed, was actually better compared to Knights of the Old Republic I.   Gameplay was heavily improved over the original game and the companions you have felt just as well developed. The tag story rich is no understatement. This in my opinion is one of the best RPG's of all time. A lot of people find you towards the end of the game are a bit strong at least within my circle of friends who have played the game. Which I find in certain parts is true but Kotor II really does bring a moderate challenge in its gameplay. I felt many of the boss battles were a pretty entertaining.   Towards the end i'm not ashamed to say I abused Force Lightning Storm and some kiting strategies to deal with a lot the enemies that i'd be fighting in groups of 5 or more. The game's lightside darkside system as always is just so well designed. My favorite part of my playthrough was me trying to perspective how i'd interact with these characters thrown into the scenario of the Jedi Exile and acting on my opinion and not a light side or dark side choice.  The crafting system is really well done I loved the lightsaber crafting options and skill system requirements for crafting. The skill tree for combat was amazing a lot of diversity and freedom. Getting to the force skill tree it's in my opinion one of the best skill tree's i've ever had in a game really one of my favorite parts of the whole game is the amazing force abilities and the progression they make. I only wish there was more because it was so much fun achieving these force powers.   Kotor II is the dream sequel to Kotor I honestly all it makes me want is for another one. We all pray for Kotor III because of how amazing these gems of the past are. There are still a few flaws obviously in the game glitches mostly. The biggest issue the game has is its age. Not because of graphics but more because of modern optimization.  To start with the issues is how often it crashes. If it crashes at the loading screen for you or something i'm sorry never seen that issue happen to me once fix its resolution in its files. I found the game crashes from being full screen in very specific cutscenes often in world transitions. Hitting alt enter in the loading screen windowed modes the game. This fixed all of my crash issues i'd often just save before a cutscene since in most games they're obviously coming and alt enter if it crashed so I could enjoy my full screen glory. (When it didn't crash happened like 5 times throughout the game no mods installed)  The inventory system itself is very poorly sorted wish I had a search bar to find items or certain stat types not even a big issue though. Abusable medpack tricks like activating one during your healing round inside your inventory while casting heal. Albeit I like this trick since it helped me in a situations where I failed to pay attention to gameplay and got chunked down. The AI for companions is pretty bad they like to run into fights repeatedly forcing my to loop between characters to continuously get them away from enemies as they'd run back in on 10% health and no force points. Good times with that I can say that much.  Lightsaber on lightsaber combat damage is a little bit too high. For boss battles and even regular lightsaber combat I could say even having half damage on lightsaber damage. Maybe by having a special melee defense perk to reduce the damage would be nice since my Master Flurry Shreds boss HP. While bosses shred my HP way to quick kind of reducing the excitement of drawn out boss battle. This is the biggest fault of the combat system in the entire game and it's still not even that bad. I don't know if there is a mod for this but my final complaint is these older games often have no map markers which helps exploration but is more irritating when you have no idea where to go and the journal isn't helping much. I found this an occasional issue that can be extremely annoying. My last real issue besides the rushed ending is the slow start definitely wish I could skip that start.  Also not enough Sith using force lightning abilities that ♥♥♥♥♥ top tier. (Fighting the Sith was really cool in all seriousness)  Summing up review in a Tldr;  Pro's: -Good RPG gameplay -Amazing Real time turn combat -One of the best written Star Wars stories ever made -Pretty Lightsabers -Strongly developed characters including the player character -Brilliant Force Powers -Decently Challenging -Awesome light and dark side choices -Amazing level up skill tree -Diverse gameplay options even though most of us go with jedi for the sake of our childhood -(Apathy is death) -Great Crafting system  Cons: -(Forgot to add this) Getting a lightsaber takes a bit which kind of sucks but some might find this to be a good thing -Slow start (First 4 Hours) -Rushed ending (Last 2 Hours) -Inventory system is in need of a search bar you get a lot of garbage and have a lot of inventory space I think infinite -Cutscenes crash issues which for me were cured by windowed mode in certain cutscenes (Biggest issue in the whole game) -Lightsaber combat damage is really quick the damage to saber users have is too fast I personally just wanted longer fights because how epic they were. -Small abusable glitches nothing special -Not the brightest AI but not even near broken   (Sorry if this isn't written that well i'm far from an English major)  Overall Kotor II is the best Star Wars game I have ever played hands down and one of the best RPG games I have ever played it's one of my top 5 favorite games and if you get into it you'll understand why.  9.5/10  Try to get the original first if you can and playthrough it but if not this game can stand alone easily because of how good it is. ",
            "review_score": "1"
        },
        {
            "review_text": "Just like the first one, this is a classic and a must play. The Sith Lords is much darker and ambiguous than the first, and it makes you think a lot more about your actions and motives and the consequences of said actions. It is a harder to tell what is right and wrong-your choices aren't cut and dry light or dark-and with many choices, you will have party members chipping in on what you should have done. Also, your choices really matter as they can even affect what your party members think about you. It is just as immersive and interesting as the first, and the characters are even better and more complex, with some appearances from characters from the previous game and references to it. Overall, this is a masterpiece and easily one of the greatest games to grace the world with its presence.",
            "review_score": "1"
        },
        {
            "review_text": "If you loved Knights of the Old Republic and you're into philosophy, morals, and wide, somewhat cynical worldviews, you will love The Sith Lords. (However, it is almost essential that you play it with the Restored Content Mod.) Where the films and the first game treat good and evil as if they were black and white, this game paints every decision past and present as various greys. This is Star Wars Noir - difficult to digest and somewhat bitter.  Like the previous game, it is slow in parts, but this is one of the deepest and profound stories I've experienced. Heck, it's even somewhat meta. The first game is bombastic and grand - quintessential Star Wars. This one is subdued and brooding and it shows in the colour palate, the music, and the mood of your companions.  May the Force be with you? Must it? Is the Force even worth it if it just seems to cause suffering to ripple outwards from well-meaning Jedi?",
            "review_score": "1"
        },
        {
            "review_text": "This Is A Great Game. Super long story. it took me around 50 hours to just finish one playthrough! dude like common. 10 dollars for 50 hours of fun!? SIGN ME UP!  P.S.    I freaking knew it   ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun. played it back on the xbox when i was a kid loved even more on the pc.",
            "review_score": "1"
        },
        {
            "review_text": "I have bought this game three times in my life. Enough said?",
            "review_score": "1"
        },
        {
            "review_text": "Obsidian: the only game developers that officially endorse a restoration mod to fix a game they were too lazy to finish. My spirit animal, really",
            "review_score": "1"
        },
        {
            "review_text": "Sweyg Approved!",
            "review_score": "1"
        },
        {
            "review_text": "Very deep and cerebral RPG. Explores the moral ramifcations of having the force in a way that no other Star Wars medium has. Worth playing for the story alone.  Gameplay is enjoyable if you can really figure it out, it's based on D+D and the combat is turn based, but it still feels pretty visceral. Being able to properly level your character and knowing where to properly spend points to get the character build you want is very important and very rewarding.  The recent update is great, it runs at modern resolutions excellently and the controller support is actually quite pleasant to use. It could be better though, there's no dedicated inventory, stealth or weapon switch buttons despite how important those features are and combat can be a bit finnicky, as the left and right d-pad buttons control both the usable items menu and the combat menu. It would probably benefit from a seperate, controller focused UI, but the controller support is otherwise rather good - there's nothing you can't do with the controller.   Due to the nature of the game, there is no benefit to using keyboard and mouse over a controller, or vice versa. It's all personal preference, and since I've played through this game about 10 times using keyboard and mouse, I found it quite nice to be able to relax and play with controller.  Performance is a bit dodgy, I'd recommend turning off Frame Buffer Effects to maintain a solid 60fps. This removes some of the effects though, like the stealth effect, so bear that in mind. I found that I got about 25-30fps with the buffer effects on and 200fps+ with them off, so it's quite a difference. This is with an I5-3570k and two GTX 780s as well, so it's a bit ridiculous that I have to turn off any effects.  The game is a bit buggy, but far less buggy than it was prior to the recent update. The bugs I had before the update included suddenly being unable to move, which required quicksaving and then re-loading, and dialogue randomly skipping. The random dialogue skipping pretty much ruined the ending of the game for me, as it just skipped all the important dialogue and I didn't realise what was happening. This was prior to the update though, so I'm keen to know if that bug has been fixed. I'll update the review if I experience that bug again.  So yeah, if you enjoy Star Wars, enjoy RPG games and enjoy being immersed in lore and thinking about things, this game is worth picking up. Try and play the original game first though, this game is a direct sequel to the original KoTOR.",
            "review_score": "1"
        },
        {
            "review_text": "A seriously great game.",
            "review_score": "1"
        },
        {
            "review_text": "I never get tired of coming back to this game. I've beaten it countless times but it never fails to be amazing every single time.",
            "review_score": "1"
        },
        {
            "review_text": "This is one for the record books. The star wars franchize is always butchered when it comes to their games. Out of hundreds of starwars games, KOTOR 2 sits at the very top amung a select few (maybe 4) good star wars games. dont be put down with the pay wall steaming pile of crap that is the MMO 'STAR WARS: THE OLD REPUBLIC' with bioware at the helm and obsidian making major tweeks to the original, you get pure gold. Bioware shines again as the do what only bioware can do and write some impressive story telling and dialoge. You dont know the starwars universe if u have not played this. Curentlly this is messuring bar i hold all star wars games up to. NONE have suceeded.",
            "review_score": "1"
        },
        {
            "review_text": "Simply put.....This game changed my childhood and made it better. buy the game now.",
            "review_score": "1"
        },
        {
            "review_text": "Never played this first time round but so far seems as good as KOTOR 1",
            "review_score": "1"
        },
        {
            "review_text": "A rather sharp critque of the Star Wars prequels if you pay attention. And it's also got brilliant writing in general, intelligent gameplay, non-linearity, and it is so, so, much better than the original in every way possible. Be forewarned, you should download the Restored Content Mod and M4-78 to get the full experience, though.   Oh, and it's best to pretend The Old Republic doesn't exist if you want to enjoy the story.",
            "review_score": "1"
        },
        {
            "review_text": "Bioware passes the torch to Obsidian Entertainment where Star Wars: Knights of the Old Republic II - The Sith Lords is born (TSL). During the initial release, Obsidian faced criticism over the game's abrupt ending which was later blamed on LucasArts's unwavering timeline for a holiday release. Fortunately for fans--from fans!--there is an essential modification to download to restore most of the cut content named, The Sith Lords Restored Content Mod (TSLRCM). The game itself features a much darker atmosphere and expands on everything that made the original game great so this sequel is a must for fans.",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap.  I loved this game as a kid, and I've replayed it many times. It was a day one, full-price purchase for me when the retail build was released on Steam, and I thought it was worth that price. After today's surprise update, it is definitely worth full price, let alone sale prices. Huge thanks to Aspyr for a fantastic upgrade, with slightly better graphics, widescreen, I expected those, but I was absolutely blown away by the addition of achievements, Steam Cloud, and especially workshop. This is awesome, and I really hope Aspyr gives KotOR and the Jedi Knight series the same treatment.  So yes, if you like great RPGs with good stories that will make you question your moral compass and perception of right and wrong, get this game, on sale, off sale, I don't care, buy it, play it, play the original, nag Bioware or Obsidian for a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Star Wars: Knights of the Old Republic was a good roleplaying game developed by Bioware. KOTOR 2, the sequel, was developed by Obsidian. The core differences here is that Obsidian still legitimately cares about making a good stat based RPG and not a shooter with romance options. I think I'm projecting modern Bioware shortcomings here but KOTOR 2 took everything that was wrong with the original and tried very hard to fix it. The game is by no means perfect, and you WILL need to download one of the Restoration Project mods to fix bugs and add content that was cut but as a role-playing game KOTOR 2 is still absolutely great.   Your choices matter, the whole game is seeing how the consequences of your choices play out. This whole game is about choice. The characters are excellent, the writing is everything you would expect of an Obsidian title. The game almost starts out as a satire of Bioware cliches but quickly becomes its own animal, allowing you to explore a deeper aspect of the morality of the Star Wars universe that a lot of games never do.  While this game certainly is not perfect, I find it better than the original in nearly every way. That said, I do recommend playing the original before you ever get started on this, the original game is still a good title and deserves the respect its earned. There are better RPG's out there, but you won't find a lot of them on Steam yet. For what it is this game is great and I love playing it.   8/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Get it. If it doesn't work on your computer for some reason, troubleshoot it. I don't care if it doesn't work, find a way to get it to work. You will be missing out on such a beautiful game, and especially with the Restored Content.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a prime example as to why Obsidian is my favorite developer, no other story that I have ever read, watched, or played has ever satisfied me the way this game does. The dialogue, the characters, the atmosphere, and the teaching of neutrality is all executed perfectly. I have played this game once a year since it was released and I see no signs of me ever stopping, you owe it to yourself to buy this game and enjoy the ride. Download the restored content mod and look past some of the issues with the game just to experience The tale of The Exile.  Also my grammar is terrible.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Especially with the Content Mod.  Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Well, about 60 hours and I finally comleted the game. Just like a good book I'm sad that it's over. I played it with the 1.8.3 Restored Content Mod. I would definitey suggest giving it a whirl if you are going to try this game out. Personally, I think this game held up really well over the years.",
            "review_score": "1"
        },
        {
            "review_text": "I love it.  The story's so good. I feel light side is more potetional. (As the background shows) Anyway darkside is enough good too.",
            "review_score": "1"
        },
        {
            "review_text": "It'll make you wish for easily installed mods that fix the films too.",
            "review_score": "1"
        },
        {
            "review_text": "Played the game from a disk version in the past and it was fun, hated the ending but thats just my opinion. Now with it on steam and my new discovery of all this workshop content I can download I can now go at it with a whole new view and theres fixes and new content added and GOD I'LL PLAY IT NOW",
            "review_score": "1"
        },
        {
            "review_text": "very good game loved it when i first played it on xbox and still have original kotor xbox discs but no xbox to play it on   but i do keep bumping into a chatting to npc glitch where it just skips the chat ",
            "review_score": "1"
        },
        {
            "review_text": "I like the first game a lot more, primarily because it did not rely on the restored content patch to be so great. That said, I liked this one a lot. For the most part the game is the same as the first with returning characters, powers, and combat system.  Pros (+) Highly immersive for new Star Wars fans and old. (+) Lots of quests, characters, and activities that can suck you in for well over 100 hours. (+) Great customization even for its time it still holds up today. (+) Powerful force abilities like Death Field and Force Lightning. (+) Neutral Options for ‘that guy’ who doesn’t want to play full good or evil.  No Opinion (/) Combat system is flawed but forgivable. Your character will sometimes charge when you order them to heal. (/) Ranged combat will never be as effective as close combat, sadly. (/) You’ll use certain characters more than others. (Sorry, pretty much anyone without a lightsaber) (/) Invisible walls galore.  (/) No real reason to speeder race like in the first game.   Cons (-) BUGS. Crashes, freezes, not loading, broken characters, glitches. Console or PC this game will bug out at least once. (-) No fast travel like in first game but that might have been console only. I don’t remember. (-) Some traits and feats mean little, bosses will still hit you and hurt you. (-) Relies on restored content to be better than just the regular game. (-) Kreia. Just Kreia. ",
            "review_score": "1"
        },
        {
            "review_text": ":3",
            "review_score": "1"
        },
        {
            "review_text": "'Plays First Game' 'Excited For Starting To Play The Second One' 'Plays' 'Doe'nt Play For 6 Months' 'Plays Again' 'Horribly Addicted' 'Finishes Game' 'Horribly Derpessed Cause Of The Ending'",
            "review_score": "1"
        },
        {
            "review_text": "Made by a different company and not as good as the first (mostly due to it being rushed into release), but still a good game. Play with a restored content mod for best results. Story is alright but the game is more character driven, characters are memorable but the returning favorites from the first game are still the best (HK-47, Canderous).",
            "review_score": "1"
        },
        {
            "review_text": "A really good game KOTOR 2 is fun with a very good story any many things to do as you progress furthur in the game, just got it a day ago and i'm hooked. can't wait to get my lightsaber later on aside from the screen issue which can easily be fixed and some odd glitches, i still stronglly recommend this game especially after the enhanced support update",
            "review_score": "1"
        },
        {
            "review_text": "I beat this game in 31 hours. Overall I played for four days. 2 of those days i stayed up till 6 am playing it. So ya, I kinda like it. The only thing I did not like was all the bugs with speech. It would literally skip dialogue. Other than that if you liked the first one you'll definitely like this one. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I can't believe it's not Bioware!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome RPG and great follow-up to KOTOR1. The game is very prone to crashing though, so save often (or at least it was for me).",
            "review_score": "1"
        },
        {
            "review_text": "it works once you fix some things would tottaly reccomend it so everyone buy it",
            "review_score": "1"
        },
        {
            "review_text": "it good.",
            "review_score": "1"
        },
        {
            "review_text": "1st kotor better story but this one has more options to play with your character. Kotor 2 still has a good story just not better than 1st.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing experience that has stood the test of time to remain one of the best Star Wars games ever made. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A classic. Must buy/play",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS EASILY ONE OF THE GREATEST STAR WARS GAMES EVER:  Star wars knights of the old republic is, in my opinion, the best in the series and has a wonderfull storyline, but these are not the only reasons I love this game so much, yes, I said LOVE. I, truly love this game because of all of the memories I have playing it, this game has always brought me comfort if I was feeling sad and it will continue to do so. But the reason I love it so much is because of my best friend and the best 5 years of my life. It all started on Christmas day 2008, I was an excited kid ready to open his gift, and guess what it was, an actual never-before opened copy of Star Wars Knights Of the Old Republic II. I was allowed to play the game afterwards and at first I found it quite confusing, but now it's like a third language to me. But now let's get into why this game is really special. Every weekend, if I was lucky, my best friend and I would have a sleep over at each others house. Every weekend we would play star wars knights of the old republic, we would always take turns, playing with our own and each others characters. but then in 2010 our dog rummaged through my games, and decided to destroy my copy of this game. It's needless to say that I was furious. But the thing is, that only cd3 and 4 broke, the other two were completely damaged. This meant that I could only play this at my friend's house, but we didn't mind. Me and my friend played it untill our very last year together, before I moved.  I rate this game, and the memories that come with it 999999999999/10  Live long Hornik Hayne",
            "review_score": "1"
        },
        {
            "review_text": "I played this years ago back on the original xbox and I have to admit I enjoyed this game far more than the first KOTOR. Personally I think the sith lords is heavily underrrated compared to the first game in the series.  The gameplay is pretty much the same as the first games with a couple of tweaks but not much but needless to say it plays well for it's time.  What really got to me was the story, it was downright dark and bleak compared to KOTOR 1's plot and that was something I loved about this. The story spared no punches and even parts of it's themes dissected the star wars universe and mythos allowing us to see it in new ways and ask some questions about it. The story was pretty deep and had some unique characters which is why the expanded universe retcon was such a heavy blow for fans like myself(but we have the clone wars etc we're good LOL111)  But snark aside this is a good game. If you enjoyed the first one then you will most likely enjoy this but I would say it's worth getting the lost content mod because it restores a lot of meat to the game. theres also a couple of other mods worth hunting down to polish things and add a few extras if that floats your boat.",
            "review_score": "1"
        },
        {
            "review_text": "Best RPG I've ever played. (with Restored Content Mod that is.)  Rating: If this game was a meme it would be a good meme.",
            "review_score": "1"
        },
        {
            "review_text": "So first my hours via Steam Client for Star Wars:Knights of the Old Republic II isn't neccessarly correct to my actual hours playing this with my psyhical copy that i own. This and Morrowind should belong in any true Pc gamer's collection. It's an instant classic. I would rate this port for Steam 9/10 from the original's rating i would give (10/10) because it took me about 5-10 minutes of research to get it to play on newer OS systems. Which to get it to run wasn't to much of a hassel (honestly a couple clicks of a button thanks to help from two other Steam clients) The game seems to run like it's CD counter part and i haven't experienced any glitches yet, which in all respect no game is perfect. There's always flaws and exspecially with and older game expect many fun and heart breaking glitches. This game should be for any RPG gamer or Star Wars fan. Which i am of both. The graphics maybe a bit out dated but they're tolerable,and if you're like me you actually prefer the older graphics ( i know i'm weird) but older graphics don't seem to bother me. BUT if you're the type of gamer who can't stand old,out dated graphics then i'm sure somewheres you can find a mod for this game because any PC gamer needs to and should play this. Willl update review when more hours get put into this game but for now this is my Review via 4 hours into it. 'May the force be with you'",
            "review_score": "1"
        },
        {
            "review_text": "Takes the story from KOTOR1 and turns it into something far more intelligent and mind ♥♥♥♥ingly amazing. It has its problems likes the dev's had to rush it out so bar downloading mods the game is only 60% complete of what it was meant to be but a must have for any KOTOR fan. Gameplay in KOTOR was good before, this expansion makes it even better than that by a long shot! Well worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "After 10 years we finally got an update. The game is better than kotor 1 gameplay wise but doesn't have nearly as good of a story. Just based on the gameplay, kotor 2 is amazingNow since there was an update, you can have the Restored Content Mod therefore making the plot much better. Although still having a lot of plot holes and character development that is outright insane, this game is still enjoyable.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "It's been awhile since I finished the first one but this game felt like more of the same both good and bad.  It's funny that this ui would be acceptable not so long ago, maybe it would have been better with a controller, but cycling through all the powers was grating on me towards the end.  I did play on pc with both The Sith Lords Restored Content Mod and M4-78, no bugs, maybe still more difficult to get it to run than it should be but not the same kinds of difficult problems I had with KotOR.  I liked the story, but the characters were not as good as the first game. going back to some of the areas from KotOR was a highlight, I wish they had more cameos or returning characters from the first.  Jedi are really overpowered, to the point I couldn't get much done without one in my party. The game was appropriately difficult, there were some spots I died, but I didn't have any screaming ♥♥♥♥ moments like some of the bosses from the first game.  Good villains, good adventure, a great companion to those that enjoyed the first game.",
            "review_score": "1"
        },
        {
            "review_text": "Great sequel, better fight and skills. Graphics have some problems but not all. Story is great, battle of good and evil! Only villans in this game are not perfect, Malak in the first KOTOR is the best. Buy it!!!",
            "review_score": "1"
        },
        {
            "review_text": "Old... but gold",
            "review_score": "1"
        },
        {
            "review_text": "Game is amazing, a tense story and the great gameplay people know from KotoR. Finished the game within one week, which pretty much ruined that week for me.. But in a good way.  Definitely recommended to every roleplaying game lover.",
            "review_score": "1"
        },
        {
            "review_text": "Tag: worst ending of all time",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, the gameplay is really good and the story is interesting",
            "review_score": "1"
        },
        {
            "review_text": "One of Obsidian's crowning achievements. Highly recommended, but definitely play it with restored content and bugfix mods.",
            "review_score": "1"
        },
        {
            "review_text": "Good story which peters out toward the end, but overall would have been superior to the first KotOR if not for this and the bugs which were never fixed.",
            "review_score": "1"
        },
        {
            "review_text": "Just stop playing when you reach shadowmoon valley",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely no disrespect to KOTOR 1, but just as obsidian made a better fallout game, so too they made a better KOTOR game. I didn't think it was possible, because I loved KOTOR 1. However! I have not actually finished this one to the end because the first time I played it, it was on disk and we lost the disk. On steam, I didn't finish it because of a bug. So be warned! Bugs are a part of this game. Get the Restored Content Mod, I hear it helps make the end feel less unfinished.",
            "review_score": "1"
        },
        {
            "review_text": "The sequel to one of the greatest Star War games ever! If your a Star Wars and RPG fan that is!",
            "review_score": "1"
        },
        {
            "review_text": "The game was already great, but with the new update adding HD/Widescreen support and controller support, as well as linking it to the Workshop, this game just got reinvigorated in a way no game ever has.",
            "review_score": "1"
        },
        {
            "review_text": "Classic from the get go, following up Star Wars Knights of The Old Republic in true class, both will go down in history as two of the greatest RPGs to date. Must own for any Star Wars fan or RPG fan-alike, whilst it may not be mandatory it is strongly suggested to get The Sith Lords Restored Content Mod (TSLRCM) highly rich in story telling, gameplay and mechanics almost perfect 9/10",
            "review_score": "1"
        },
        {
            "review_text": "what are you looking at? [force persuade] give me all your credits and jump off that rail makes sense fastest way to the ground that way",
            "review_score": "1"
        },
        {
            "review_text": "Canon says you should play as a light side female?  HA.  In Kotor 2, you play as Jedi Jesus, the Star Wars equivalent of Yugoslavia's Arkan, a grizzled galactic war veteran. Severed from the force, and with nothing to lose, you trek across the galaxy for the 'Centennial Jedi Master Round-up-and-♥♥♥♥' as you decide the fate of a select few middle aged men in bathrobes.  Marvel at the intricately made, and unfinished, story. Swoon at the deep, and overly-complex, characters. Gasp at the twists and often nonsensical turns in this roller coaster of a game!  No but seriously, get the Restored Content Mod.  Without TSLRCM; 7/10  With TSLRCM: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Disembowel me, if you please, but I still think this one is better than the first KOTOR.",
            "review_score": "1"
        },
        {
            "review_text": "Classical RPG with D&amp;D like gameplay. Great Star Wars story and lots of chances and possibilites as you progress that will affect the world. I'd say it's like good old Neverwinter Nights saga with lightsabers and droids!",
            "review_score": "1"
        },
        {
            "review_text": "best game ever buy now",
            "review_score": "1"
        },
        {
            "review_text": "The rushed sequel to KotOR is actually my favorite to play. I know. Shocking right?  Being a straight follow up to Knights 1, The Sith Lords continues 4 years later. Your character has been exiled from the Force and you must reconnect through the wonderous art of adventure.  The gameplay remains more or less the same as the first game, but it's a lot more streamlined. The locations in the game I feel are bit better designed (at least in my opinion), and are far less tedious to play than Knights 1 areas are. (Everyone hates Mannan).  Although the game is almost the same as Knights 1, the game has some techincal downsides. The first is lack of widescreen support. Knights 1 has this issue too, but it can be patched in if you use the original disc version of the .exe file. You can find a widescreen patcher via google. The downside to this though, is that the original bugs in the game that are patched in the Steam version, will be back in full force if you implement that fix. Although they are still rather rare to come across.  You should also save scum the ♥♥♥♥ out of this game. Rushed development has caused bugs, and one of the most noted is the save corruption glitch. Although much more prevelant in the Xbox version of the game, there have been instances of it happening on the PC version, although it hasn't happened to me yet.  Secondly, a lot of the game's quests are actually simple fetch quests glorified around the fact that you go to not only Point A and B, but also Point C and even D. Various loop and grind quests are here where as Knights 1 had a bit more variation.  All things aside though, Knights 2 is my favorite game. The characters you meet in your party are memorable in my opinion. The scoundral Atton Rand remains one of my favorite characters from this game series, and there is so much you can do with your party. Your actions and how you treat them will decide how they react to you. Being a ♥♥♥♥ and doing dark side things will make them fall to the dark side, but being courageous, kind hearted, and nice to them will shift them to the light side.  All this drastically changes their dialogue trees, and some party members might even just flat out stop responding to you if you do the wrong thing.  Knights 2 is I'm pretty sure as long, if not longer than Knights 1. It's not a game you are going to be picking up and finishing in one day. This game requires your dedication to time to play and enjoy. The hours shown on my play counter don't lie, it really is a game that will need devotion of time to enjoy.  If you enjoyed the first game, you'll love the second. All of the main Star Wars games that remain in my disc collection to this day are availible via Steam, and this is one you should grab. Even if you aren't a Star Wars fan, this game is still a master class in RPG game archeo-types, and it really deserves to be in your library.",
            "review_score": "1"
        },
        {
            "review_text": "Ignore my time, I've played this for well over a hundred hours on the original discs. Yes, discs, plural.   While not nessicarily as good as the original, KotoR 2 is still fantastic. This is actually one of the games that transfered me from console to PC, so it holds a special place in my heart. Without a doubt get the restored content mod, it adds most of the content that was cut from the final product, which just makes the game more amazing than it already was. If you like good stories with good characters, you'll like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Simply put the greatest RPG I have ever played. Some of the Pros -Takes the Stars Wars universe and flips it on its head  -Kreia is the greatest NPC in gaming.  -Your actions truly have an effect.  -You can make your crew sith or jedi. No one is incoruptible. -HK-47 -Great companions with interesting stories -Interesting planets to explore -A wide array of force powers -The best story ever told in the Star Wars universe  Cons -Don't play without the restored content mod. Just don't do it.  All in all far better in my opinion than the first game. Obsidian shows us how its done.  10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 great Star Wars experiance! ",
            "review_score": "1"
        },
        {
            "review_text": "Mad Catz Xbox 360 controller doesn't work.",
            "review_score": "1"
        },
        {
            "review_text": "it does a great a job at manly 2 things showing the star wars uinverse from a exiled path you are hunted with out a light saber and you are half naked? any way it shows strong shings for an old game",
            "review_score": "1"
        },
        {
            "review_text": "The whole goal of this game isn't to defeat the sith it's to build that godamn HK unit in the Ebon Hawk",
            "review_score": "1"
        },
        {
            "review_text": "This series is one of my favorite of all-time. I loved the this one and played the hell out of it on xbox. The characters are great, the story is great, the planets are great. It deserves an actual sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Contains the phrase 'glorious banter'",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Star Wars games out there. KotOR 1 was my first RPG which hooked me for the genre. This sequel is even better than the original, with the restored content mod this goes to my top 10 games ever easily. Be sure to pick this gem up, you'll get your moneys worth guaranteed.",
            "review_score": "1"
        },
        {
            "review_text": "Old school RPG beauty. Just replayed it and still as addictive as ever",
            "review_score": "1"
        },
        {
            "review_text": "this game is great. i had it when i was younger on the original xbox. i loved it so much. i played through the campaign for the first one several times and this one even more. even 10 years later i remember everything about this game. this is one of the best rpg turn based games out there.",
            "review_score": "1"
        },
        {
            "review_text": "Better than most games out today",
            "review_score": "1"
        },
        {
            "review_text": "  This is one of the finest RPG's ever made. its Story is complicated, it's Chracters are interesting and has a dark edgy feel that the rest of the star wars Franchise doesn't have that gives a tasteful look and armor piercing questions about the franchise that the rest of the star wars media isn't telling. easily a 10/10 in my book.",
            "review_score": "1"
        },
        {
            "review_text": "By far my favourite Star Wars game to date.",
            "review_score": "1"
        },
        {
            "review_text": "I'd say it was better than Lucas' work but then you would probably think I was talking about running headfirst into a wall...  It is amazing, just make sue you get the restored content mod from the Steam community which fixes the bugs and adds missing content as it was hindered at release by the publisher.  Shwoom, shwoom shwoom!",
            "review_score": "1"
        },
        {
            "review_text": "Game is better than sex",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I've played more time than is showed, but my Wifi was out. and this game can be incredibly diffuclt and may require a lot of strategy, Also, some segments shouldn't be skipped unless your game crashed and you know the jist of what was said. Also, the choices are sometimes very diffuclt, but you can't please every follower or character. Also, you must be wise in choosing wether or not to be dark or light side, what followers, what armor that you use, because each has benefits. Also, I forgot to get the first game, but the events of the first game are explained in the game. Rating 9/10",
            "review_score": "1"
        },
        {
            "review_text": "a good stars wars game, but its an rpg and im a lot dumb not smart! cool though :O",
            "review_score": "1"
        },
        {
            "review_text": "Classic game, while not up to the par of it's predecessor, still pretty solid. Just an FYI, there is no update to this. You will get the classic selection of screen sizes with the max being 1280 x 1040 75 fps. Also, peripherals may be a bit wonky",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game with 'Humble Bundle: Star Wars' and I was looking forward to play this game after hearing MANY positive things about this. I opened it, crashed EVERYTIME after creating a new character. But now, they updated it for the first time in 10 YEARS (Up to 5k resolution option, many bug fixes, steam achievements/workshop/cloud, ANY controller is now compatible) it is now fulfilling its destiny. (I said fulfiling because I've only played 2 hours of it, but I'm certain I'm gonna play much more and when that happens, I'll update this review). Review bit shall go there after I play 20 hours ________________________________________________________________",
            "review_score": "1"
        },
        {
            "review_text": "Amazing sequel to an amzing game. Star Wars games usually... don't do very well... But this! This is amazing!!!@!@!@!@!!!",
            "review_score": "1"
        },
        {
            "review_text": "a bioware game, but with good writing -- finally got an update 10 years after release :) pro-tip: Ask HK-47 what love is.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game but it needs more lightsabers. About seven more lightsabers.",
            "review_score": "1"
        },
        {
            "review_text": "Ahhh how much i love this game! Played the first one on the Xbox and loved it and this just continues the legacy.",
            "review_score": "1"
        },
        {
            "review_text": "Best game i played in my life. 20\\10",
            "review_score": "1"
        },
        {
            "review_text": "its like lego star wars on the gamecube except theres no legos and its not a gamecube.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot like when you mastrabate     if you could you would do it all day       kids should join in on the fun       it's better that George Lucas isn't involved   ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game",
            "review_score": "1"
        },
        {
            "review_text": "fight a war that you didn't start 2/10!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Install the restored content mod and this is better than the original.",
            "review_score": "1"
        },
        {
            "review_text": "this was a dark turn in the KOTOR series. Obsidian done a decent job but i still feel they could have taken more time with the game and the story.  in Darth Nihilus they had potentially the coolest Sith Lord, but he didnt get as big a part as Darth Sion.  I do hear there is a mod to add the extra story that was originally cut from the game. worth a check.  81/100",
            "review_score": "1"
        },
        {
            "review_text": "I really don't know how to put this, Knights of the Old Republic II is...a bit strange compared to its predecessor. In the first game, the story seemed linear but was very interesting and overall pretty great. The combat and enviorment and everything was great, and KOTOR was amazing.  Knights of the Old Republic II is a step in a very interesting directions. The story is a bit of an exaggeration when it comes to clarity. I didn't understand the story's total capacity and I really didn't get all the story. Without spoiling the game, the story was good, but it really seemed to end strong.  The Combat is virtually the same, and I've played the first game around accouple hundred hours. Newer powers and some neat crafting items is really a refreshing step in the game. I love upgrading newer parts for my lightsaber and I thought some unique parts in the game were a lot more flushed out.  Overall, KOTOR II fell back in the story aspect. I really enjoyed the game though. I only wish the conclusion and story outcome was a little better devolped. (Yes, I know there's multiple endings, light and dark sides.) I wish though that you were'nt seperated from your party as much. It falls slightly short of the first, but I would say it's a must own for Star Wars fans alike. My Final Score- 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A Must have for any KOTOR fan!",
            "review_score": "1"
        },
        {
            "review_text": "Ok this game is amazing i would recommend this game to anyone. if you do get the game i would recommend getting the TSRCM mod it restores the content that was left out of the game. But even without the TSRCM mod it is still an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "I have and always will recommend this game. An atypical SW narrative, KOTOR2 plays like a true fantasy game should, with interesting and investing characters, with well fleshed out back stories, and a deeper and more rounded sense of lore. The Force and its magnitude is explained in greater detail, as well as the socio-political status of the galaxy at large during the time of the Old Republic.   The villains are far more deserving of praise than the one track Malak from KOTOR and the companions of this game actually seem to have character archs, stories, and meaningful interaction, unlike those of KOTOR.  The game does feel a bit devoid of content, however. I recommend the Restored Content Mod. It will put that icing on the already delicious cake.",
            "review_score": "1"
        },
        {
            "review_text": "Highly indepth storyline no matter you go lightside or darkside a classic rpg though not as good as the first",
            "review_score": "1"
        },
        {
            "review_text": "Highly indepth storyline no matter you go lightside or darkside a classic rpg though not as good as the first",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually really ♥♥♥♥ing trash",
            "review_score": "-1"
        },
        {
            "review_text": "This game does not work on windows 10, i hope steam can fix this problem.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me start of by saying this game is amazing, very fun and well thought out. However my experience with technical issues and bugs completely ruined the gameplay and left me feeling robbed. Let me start of by listing all of the bugs and problems that drove me away from what would have otherwise been a spectacular game.  1. Cutscenes- they didnt work at all, the opening of a cutscene would close my game window and leave the screen black until I reopened it. It was a minor problem, I got used to, but it was annoying as hell.  2. Looting bodies- Another minor issue (also super annoying) was 99% of the time bodies couldnt be looted right away, I had to walk away for 30 secs and come back until the game gave me the option to loot. (sometimes I got the option immediately, but that was rare.)  3. Unable to reach or open certain containers or bodies- After killing certain npc's or encountering lockers or containers the game seemed to register them in areas that cannot be reached. For example I would kill a group of soldiers and a few bodies would die behind a barrel or in a patch of grass and i wouldn't be able to loot them because they got stuck behind some barrier in the environment. Same thing with the containers, for ex I would walk up to a plasteel container and try to open it, but my character couldn't reach it to loot.  4. Issues with quest objectives- Here comes my major problem that made me unable to play the game. On many quests required cutscenes are supposed to appear that trigger the end of a level or create certain conditions that allow the character to continue a playthrough. Unfortunately over and over I encountered bugs where these scenes or situations didn't appear, which forced me to reload saves and restart entire quests and levels. This was bearable too, until one level where all the doors became locked and I was unable to leave because the cutscene didn't appear. I tried reloading saves, retrying levels and even resorted to modding but nothing worked, This forced me to terminate the game prematurely and leave me salty enough to write this long-♥♥♥ review.   TL;DR  Too many bugs and some are gamebreaking.",
            "review_score": "-1"
        },
        {
            "review_text": "Even to this day is broken, Intro is way to long, then on the first planet (after the mining one) I was unable to progress because a glitch had dissabled a diolog option after I had already saved. Forcing me to restart.",
            "review_score": "-1"
        },
        {
            "review_text": "Epic game. Get the mods for it tho - if you liked the original trilogy, you will like this game.",
            "review_score": "1"
        },
        {
            "review_text": "Never, in all my life, have i been more disatisfied by an ending of a video game.  If you have not played the original KOTOR, stop reading this, and buy that instead. I would give it five stars.  I would give KOTOR2 two stars at best.   the late game was obviously rushed and unfinished, and leaves so many questions unswered. the design is incredibly clever, great mechanics, and a good early to mid story, but the ending sucks. as i understand there was a 'knights of the old republic III' scheduled but it was canceled. so, imagine the watching the empire stikes back, but having no return of the jedi following it. (also imagine Empire took you 30+ hours to watch)  the gameplay was great, and you get really stong late game (as a Jedi master/Sith lord sould be) and i was loving it right up untill the last 6 hours. the ending ruined the whole game for me, and i probobly wont play it again.  If you enjoyed the original game for the gameplay rather than the story than KOTOR2 is a great sequel. If you Enjoyed the Original game for the story and Characters, is a terrible Sequel.",
            "review_score": "-1"
        },
        {
            "review_text": "I can see why everyone would love this game, but the trashy rng and the dialogue bugs in this game incredibly destroy the pros of playing this game. It takes 15 minutes to kill a group of normal mercernaries. I just sit there clicking the same button over and over waiting for them to die. After timing it, it took me 4 minutes to have a sword fight with a standard enemy. In any rpg you will ever play it will not take a minute in the most. Completely ruined my experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong. I love this game, but the Steam Version constantly crashes even though you have a computer that exceed the system requirments. I ran it though sevral compatibility trouble shoots, service packages and even switched my computers performance to high. After all of that, could not even get to the Main Menue. A game from ten years ago, I can't play. But if you want to play this game, go to a Half Price bookstore and try to find it. You'd be saving yourself a lot of hassle than dealing with the Steam refund process.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't bring myself to recommend this game, even though parts of it were enjoyable. KOTOR 1 by Bioware far, far outshines this game and credit for the enjoyable bits has to go (mostly) to Bioware. It's been many years since I've played the first game, but it's one of the most memorable RPG experiences I've had.   The only reason I picked up a copy was because it was on sale. I'm glad I never bought the original at full price, for after my first playthrough, I'm pretty sure I'm just going to delete this game.   First of all, everyone should know that this is a turn-based game-although screenshots might lead you to believe otherwise. The gameplay, game mechanics and combat is as deep and rich as you'd expect to be from a turn-based RPG.   My problem though is that Obsidian seems to have done very little in terms of improving or updating KOTOR 1, whether that's the game mechanics, characters, story, or even graphics.Somehow it always feels like an expansion pack to the first game, and one that has been poorly put-together at that. Yeah, it runs fine and the quests and story progression are fine, but it somehow lacks the savoriness of the first game.   While I can't say that the story's 'bad', it didn't exactly enthrall me like the first game did. I did like the characters and their individual back-stories, and the voice acting is top-notch. But on several occasions there'd be a cutscene and I'd be like 'WTF is going on!? Who the hell is that, the hell are they on about?'  Personally, I thought several cutscenes were either unnecessary or left me with a 'Whatever' kind of feeling. I found some to be downright irritating.   The villains and antagonists also leave much to be desired. One of them is described as this huge bad-♥♥♥ by every game character, and he literally features twice in the game. Then you easily dispatch him and it's on to the next bit of the story. What gives?   The worst bit, I thought, was the end. I mean there's this big fight as expected, but then the moment you're done it just cuts away to you flying off into the sunset. Like, BAM end of story, thanks for playing. Roll credits. Ugh.   Anyway, I don't know if I'm being excessively harsh. If this were an independent game that had nothing to do with a much better predecessor, I might have recommended it. But as it stands, save some money and get KOTOR 1 instead.   Skip this one and pick up Mass Effect.   Pros:  1. Good voice acting 2. LIght Sabres. Whee! 3. Deep and rich turn-based RPG  Cons:  1. Poorly written script. Nowhere close to the 'Whoa!' moments that Bioware makes you experience. 2. Really abrupt ending.  3. The cutscenes are downright WEIRD. Poorly directed, and often jarring. 4. The story really leaves a lot to be desired. It was hard to be emotionally invested in my character. 5. More like KOTOR 1: expansion pack by new developer! than KOTOR 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game, however this version constantly crashes and freezes. It's infuriating. It gets stuck in cutscene loops, and crashes for no reason.",
            "review_score": "-1"
        },
        {
            "review_text": "The glitches are devastating. The game was great until it started irreversibly damaging my campaign",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: + Space ninjas + Laser swords  Cons: - A little dated (not a problem for me) - Did not live up to the same level of polish as KotOR 1",
            "review_score": "1"
        },
        {
            "review_text": "Worth skipping the first one",
            "review_score": "1"
        },
        {
            "review_text": "Cannot get the game to run, tried multiple fixes and running on compatibility mode (I have a windows 8.1) for 7, XP, and Vista. Nothing has helped so far. I recieved an incomplete ini file which I fixed according to posts here on steam and the game still wont load. Unless you have a computer you know it will work on, I cannot recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not compatible with modern systems and the so called 'fix' still does not work on many machines. That fact steam is selling this game as is give it's inability to make it past character creation without crashing is insane. I feel like I have been robbed.",
            "review_score": "-1"
        },
        {
            "review_text": "couldn't even play the @@@@ game it crash trying load it up. I like the idea for achevments, and update,",
            "review_score": "-1"
        },
        {
            "review_text": "Would I recommend this game over the first Knight of the old Republic? No. Is it still a decent game to play? Absolutely.   If KOTOR was The Matrix, then KOTOR 2 would be Matrix: Reloaded. Still a decent movie, if you want more of the SW universe that Bioware created. But it definitely doesn't hold up.   The ending just doesn't leave as great an impact as the first one, and the gameplay is pretty much the same. Seeing as this game was rushed out, it certainly could've done a lot worse.   Sadly the story got progressively worse throughout the game, especially in its execution. Which is why I will not recommend this rushed game.",
            "review_score": "-1"
        },
        {
            "review_text": "The game does not work whatsoever. After the developer's logo appears the game crashes. I've now spent one hour on trying to run this game with different approaches, but nothing works. Randomly I could suddenly play it, but only until after character creation, then the game crashed on me again and I couldn't rerun it with the same stettings. Don't waste your money programers that don't bother making their games function.",
            "review_score": "-1"
        },
        {
            "review_text": "It's the most dissapointed star wars game for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Says i played it for an hour and yet ihavent even been able to start it up... DON'T BUY THIS IF YOU USE WINDOWS 7 OR XP. (unless willing to find and download files to fix it)  And I'm using a Windows XP... I really wanted to play it to.  Please update to fix.",
            "review_score": "-1"
        },
        {
            "review_text": "I love the game. I hate what Steam has done to the default download of it.  My computer is 3 years old. This game is eleven years old. Steam developers have 'fixed' the game so that I can't run the game with my 'ancient' hardware. I'd love to play it, but I can't sift through all of the snark and derision in the support threads to find a solution to my problem. I've wasted hours trying to work it out. I anticipated playing an old favorite, intead I got a headache and a distaste for this community. I should note that I've played ES 3, 4, &amp; 5 on this rig with no problems, and ES5(Skyrim) running a dozen mods. KotoR2 won't even load.   Don't buy this decade+ old game unless you have a fancy rig.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is, 2 clunky, the options menu is a big mess, and with mouse and keyboard the game is not playable, maybe with a controler it could function, but i doubt it. i do not recomend to pick up this game unless, u are a fan of the starwars franchise which i am not. some games are just better forgoten, unless you are willing to bomb the game with allot of mods to actually make it playble, the good thing is it has workshop so after enough moding im sure it could be playable, but i wouldn't get my hopes up, my final verdic is a 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great but I'm getting major frame rate issues!!! I have an AMD A8 5550M Quad Core APU 2.1Ghz, 8550G + 8670m 2gb dual graphics, 2x4 1600mhz RAM, Windows 8.1 64bit. I'm getting major frame rate issues!!! I tried having the lowest graphics settngs for this game but still I had major frame rate issues!!! I believe the problem is with the game itself. Steam Please Help ASAP!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Keeps scrolling down on main menu.",
            "review_score": "-1"
        },
        {
            "review_text": "the game doesnt even work just freezes and crashes i want my money back!!!",
            "review_score": "-1"
        },
        {
            "review_text": "installed on windows 7 doesnt work wont make it past developer intro at the start. running an alienware i7 2GB ddr5",
            "review_score": "-1"
        },
        {
            "review_text": "NOTE: this review was written with the latest Restored Content Mod installed, with no other Mods to introduce new flaws into the system.   KOTOR II is yet another one of those games where trying to evaluate the merits and flaws of its story and gameplay seems like a futile exercise; namely, the sort of game so ♥♥♥♥ing bug-riddled that you can't enjoy the story or the gameplay for any length of time before it crashes on you. If nothing else, it provides a variety of game-breaking bugs to match the variety of (enjoyable, so long as the game remains functional) characters- inability to accept mouse input, inexplicable minimized window, outright freezing after transitions between game areas, and many others I haven't yet had the privilege of personally experiencing (look up the forums if you're curious). The upshot being that you have an uncertain number of hours to actually play before something brings your enjoyment to a screeching halt.   (Reviewer gazes off into middle distance, hazily remembers far-off past when game software performed as advertised right out of the box, returns to present feeling old and suspecting rose-tinted nostalgia at work.)  So, yeah, Sith Lords would have been a Chris Avellone classic had it been released complete and reliable in the first place and/or been properly supported by the publisher when it was released at Steam. Blame the suits at LucasArts. I do.  Addendum: apparently LucasArts no longer publishes, as of being absorbed by Disney in 2013",
            "review_score": "-1"
        },
        {
            "review_text": "Playing Kotor2 felt less about playing through an epic space-opera with you as the protagonist, and more a case of counting down how long until the next bug crashes my game to desktop with no prior warning, explination or error message. At the time of writing I have 60 hours played on the game, and not once have I managed to finish the thing due game breaking-crashes, all of which happened at different times strangely.  The Restored Content Mod for this is almost as well known as the game itself, but felt to not improve my experience at all: getting rid of some old points of crashing to desktop, but at the same time adding NEW points to crash to desktop.  For the times when you're actually playing the game, it's a lot of fun: combat is better than Kotor1, but still feels a bit like a numbers game...if you don't know what kind of build is best for a character in the beginning, you're going to have some difficulty with the multiple sections where you are forced to play a character that isn't the protagonist.  Kotor2 is a great game; if you can get the dam thing to work, which I could not. If you do decide to buy it; all the best in trying to get it functional.",
            "review_score": "-1"
        },
        {
            "review_text": "2.3/10 +/- ok story -boring gameplay -terrible combat system -lazy character creation desing  ",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get me wrong, this game is really fun and I had a blast (mostly) for the time I played it - until I got into a bug game breaking enough for me not to be able to continue the game. This wasn't even the first one, but for every one I managed to find a fix or patch that eventually solved my issue. This added unecessary and extremely boring work and wasted time to what should've been fun game time and when I finally got to a point where the option was starting over completely or not play any more, I threw in the towel.  Here are the two biggest bugs I encountered, because all the smaller ones I can't remember:  - Choosing the 'wrong' dialogue option when talking to a certain character made it so that another character didn't spawn: Had to reload an old save and replay 30 min to choose the right option. - Event not initiating, but getting stuck mid cut-scene with the characters just staring at me. At this point I didn't know if restarting the game would even fix the issue and didn't want to risk several hours of gameplay into nothing again, so I stopped playing.  This game should never have been released the way it is and asking for money for it is just wrong. I tried mods and just about anything people on the internets said would make the game better, but I shouldn't have to do that just to get the game to work! I was so disappointed because I really liked this game and I definitely wanted to be able to finish it. Maybe I was just very unlucky, but from my experiences I can not recommend this game the way it is.",
            "review_score": "-1"
        },
        {
            "review_text": "As long as you have a computer from 2004 you might want to avoid this game",
            "review_score": "-1"
        },
        {
            "review_text": "I probably have played this game on Xbox for over 300 hours back in the day. Now with the mod support and the fact it is on Steam makes it even greater. That must tell you something about the game!",
            "review_score": "1"
        },
        {
            "review_text": "I have to say, this is one of the WORST movies I have ever seen.  If you like Star Trek, this spin off will make you make you mad.  I'll start by saying the character development is horrible. It feels as if I was watching someone play World of War craft. It is slow, dull, and nothing happens. The characters are bland and forgetable, the enviroment has tons of errors relating to the old Star Trek series. Also, this show is really bad as the Vulcans show emotion. This is a stain to the legacy that Gene Roddenberry created.  Don't bother with this hellish thing. It is not worth your time, rather go and play Star Trek: Battlefront II. That game has a better storyline, better character development then this movie.'   EDIT: I know it says I have only watched a bit of it, but I have seen it all on a different account",
            "review_score": "-1"
        },
        {
            "review_text": "This game is unplayable.  No controller support, the store page says otherwise, it lies.  M+K controls are horrible.  Sound is awful, worst sound in a game I have ever experienced.  Waste of time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately, I made the mistake of playing the Mass Effect trilogy before getting to KOTOR 2, making its flaws and shortcomings twice as noticeable.  The Bad: The main problem I have with the game is its difficulty. It's all over the place. It goes from being too easy to borderline impossible in a heartbeat, not surprising coming from Obsidian (Pillars of Eternity). The game forces you to play as different characters and takes control away from the player constantly, which completely screws up its pacing. Structurally, most missions are completely unninspired, having you go from point A to point B, clear out a few rooms and that's pretty much it. Same goes for the 'puzzles' in the game, which are incredibly shallow and predictible.  The Good: The characters are well written and the dialogue options are interesting and varied. The writing overall is superb. I didn't get to the end of the game, but the plot was intriguing and quite frankly was the only thing that kept me going. Also, the game recently received a MASSIVE patch, adding 4K, Windows 10 and Controller support, which is always a plus in my book.  All in all, there are better RPG's out there. I'd personally Recommend the Mass Effect Trilogy, Dragon Age Origins and Dragon Age Inquisition.",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable. Tried every fix I could find. None of them work. Game constantly minimizes with no way to bring it back up, mouse stops working (needed to play), movies skip, game freezes.",
            "review_score": "-1"
        },
        {
            "review_text": "30 minutes in and 4 crashes later I decided that this is not something that I could recommend. I didn't get into any real game play so very hard to explain anything other than buggy, real buggy.",
            "review_score": "-1"
        },
        {
            "review_text": "When Mrs. Tawny Huxton opened her son Timmy's bedroom door, she was shocked to see his innocent white hiney nestled into the new 7ft Jar Jar Binks doll she had bought him for his birthday. Lately, many Americans have suffered similar incidents. Young children are being seduced by the character of George Lucas' latest Star Wars Movie. Jar Jar's soothing voice, and timid childlike manners, seem to lure young teens into a world of lustful abandon. Unsuspecting parents purchase the popular life-size doll, only to find out later that it is being used by the child as a masturbation toy. Under the guise of family entertainment, Lucas' 'Star Wars' prequel has contaminated America's youth with subliminal sexual innuendo. Pastor Deacon Fred of the Landover Baptist Church commented, 'The demonic characteristics of the Jar Jar binks creature become obvious when one pays close attention. His forked tongue, his lapping, his malignant features, are all too noticeable to the Christ centered man.' Experts who have examined the life-sized doll that has become the favorite 'toy' of 12-14 year old children, say that the evidence is overwhelming. The doll was created for the sole purpose of masturbation. It has four openings, and three extrusions, making it compatible for male or female pleasure. Members of The Landover Baptist Church are outraged at the Satanic subtlety in which marketing geniuses have moved this horrific abomination into the homes of America's youth. 'One Mother was concerned that her young daughter was not interested in boys,' a Pastor noted, 'she asked her little girl, 'why don't you talk about the cute boys at school?' Her daughter replied, 'oh momma, nobody I know is cuter than Jar Jar Binks.' The mother was horrified.' Landover Baptist Church finds that the only way to resolve this problem is to ban not only life sized Jar Jar Binks dolls from American homes, but to ban any life sized doll. 'Any child that has seen this movie is finding that their natural attraction to members of the opposite sex is being replaced with an attraction to a 7ft devil with elephant feet, a 25 inch tongue, polka dot skin, a fish snout, and two phallic eyes that jut out like hard erotic pokers. For the Love of God! If you've got this devil in your house, remove it as soon as possible!",
            "review_score": "1"
        },
        {
            "review_text": "Okay... I own a ton of steam games and I never review them. That being said, I decided to break my motis operandi and write a quick review of this game. I played it years ago before the mods and also before the most recent patch. I suffered through all the game crashes and the terrible ending but still enjoyed the game but not at much as KOTOR 1.  Well, I just tried to play through again and guess what? I must be getting old because I pretty much threw in the towel due to all the crashes when flying to different planets, the audio skips and other various bugs I encountered. I must not have the fortitude I once had to put up with forced to publish games that I once had.. which says a lot given that I've been gaming since the DOS era and still wake up screaming at night due to nightmares of hardware driver conflicts from back then.  Anyway, if you can fight through constantly reloading or pulling up task manager to kill the game when it locks, you may enjoy the game. I, on the otherhand, have better things to do such as checking out new games I snagged on sale or... er... well other stuff.  In the end, I can recommend this game because its still a bit of a buggy mess and life is better spent playing less buggy messes. Just my opinion",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks, I loved the first one, played it several times through. This game has so many plot holes, bugs and dialog that seems to drone on and on.",
            "review_score": "-1"
        },
        {
            "review_text": "Disappointment - 2 logos at the start and after that, crash.  I tried restarting my computer, re-installing the game and many other things. I have nothing from the workshop. And the first time i launched it, it worked just fine. (Before crashing in the character creation, of course XD)  I have all the system requirements, and stuff but nothing gives! WHATS WRONG?! pls help  I feel like somebody stole 7 € from me.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring. It's also hard to control. But there is also a good story, but its not my style of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Everytime i try to play the game it crashes after i finish making my character.",
            "review_score": "-1"
        },
        {
            "review_text": "i found a game breaking bug at the argue with atris were after atton and the rest of your crew are broken and rendered unbeatable so to me waste of my $10. :(",
            "review_score": "-1"
        },
        {
            "review_text": "Broken as hell. Made me take my old Xbox out of storage so I could enjoy the game without stuttering frames, freezing, crashing and the use of a controller.",
            "review_score": "-1"
        },
        {
            "review_text": "the starting place is extremely long and boring but i already spent 2 hours on this so i can't refund fml",
            "review_score": "-1"
        },
        {
            "review_text": "it's a goo game that hinges on youtube parts and then fetch quest then youtube",
            "review_score": "1"
        },
        {
            "review_text": "It is a realy good game, if you can make it to work. The game is at an age, where it is not competible with most computers. there are some fix out there, but i cant make them to work. So unless you want to spend tons of times to get it to work, then avoid it.",
            "review_score": "-1"
        },
        {
            "review_text": "this game literally broke 3/4ths of the way in and the main quest would not advance no matter what. i even tried a save game editor and it steadfastly refused to work.   quality game.",
            "review_score": "-1"
        },
        {
            "review_text": "Man, you cant jump. If you press space it pauses the game. u have to chose your attacks and worst of all, everything is sooooooo slow. Like the fighting parts i dont even know if my character are about to throw a punch or totally gave up.",
            "review_score": "-1"
        },
        {
            "review_text": "Do NOT buy this game EVER... Crashes unless you go into its files and set it to windowed mode, even then all it does is give you an extra 40ish mins befor it randomly crashes ANYWAY. Wasn't even built for PC, it is an X-box game, so the controles are horrible to work with, the gameplay is exactly the same to SWKotOR 1, just a slightly different story, i think. A true waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "The user interface is poor, your party ai is terrible, the unskippable cutscene of people walking slowly is annoying. The fact that this is the same as the previous game with no improvements is not good.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is not at all like SWTOR...dont think anyone writing reviews has ever played SWTOR.... u cannot jump...theres a crappy targeting system...list goes on and on...not bad for 8 bucks...but would not pay top price for this",
            "review_score": "-1"
        },
        {
            "review_text": "This game is too old to be playable in my opinion",
            "review_score": "-1"
        },
        {
            "review_text": "its a great game worth buying but would buy swkotor1 first",
            "review_score": "1"
        },
        {
            "review_text": "an amazing game with tons of quests and content rich with lore and variety of different areas makes this game truly standout",
            "review_score": "1"
        },
        {
            "review_text": "KOTOR II is as amazing as the previous game. This time you already start being capable of using Force powers, what is great. The plot is astonishing, as always. The mechanics and the looks are as great as before (not much different, actually – they are neither worst nor better). Your interaction with your companions can now be better noticed, as you know when your connection is being increased or decreased. Fully recommended.",
            "review_score": "1"
        },
        {
            "review_text": "There is a fix to play it without save issues.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games",
            "review_score": "1"
        },
        {
            "review_text": "If you download the cut content and bug fixes, this turns into one of the greatest RPG's to come out in the past ten years.",
            "review_score": "1"
        },
        {
            "review_text": "Another great game, story wise not quite as good as number 1 but thats because the game was rushed and never properly finished. Enough new features to make this game worth playing and very cool party members.",
            "review_score": "1"
        },
        {
            "review_text": "Wow what an amazing game loved the story",
            "review_score": "1"
        },
        {
            "review_text": "Ahh... brings back memories of the old original Xbox days.   Also, don't alt+tab, you'll crash the game, save first! :)  Another thing, I may only have around 30 hours here on steam, but back on the Xbox, I have over 500 hours.",
            "review_score": "1"
        },
        {
            "review_text": "After the success of the first one, we all knew the sequal was coming back in 2004. KOTOR 2 deffinatly has its good points. The ability to influence your party members, I think, is great, plus to watch em change appearace as they gain dark side points, even better! It's got a pretty solid story, although its not as epic as the 'you are actually Darth Revan' plot twist. You get a few cameos from KOTOR, (SPOILER) the biggest is Mandalore who, if you pay close enough attention too, is Canderous, i thought that was cool. Haing the actual Jedi robes is awesome too, lol. All in all, i suggest you play this, if you havent already.",
            "review_score": "1"
        },
        {
            "review_text": "obsidian has a talent for making me fall in love with amazing stories and characters wrapped up inside buggy as ♥♥♥♥ games that will never have satisfying endings.  thank god there's an active modding community that fixed a lot of the ♥♥♥♥ that held this game back from being truly awesome.  p.s. atton rand &gt;&gt;&gt;&gt;&gt; all your favs",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game, then download the restored content mod. Fixes the ever so present Obsidian flaws.  I do mean 'buy this game,' it is a great RPG that stands up today, even with dated graphics if you are an actual RPG fan. Which is to say -- if you care more about story and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This is my youth. Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game, Played it about 10 times when I was younger so great replay value. Peragus is a ♥♥♥♥♥ tho",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Nice graphics. Plays pretty good, though there is a bit of lag when changing scenes. All in all very entertaining if you like the SW worlds.",
            "review_score": "1"
        },
        {
            "review_text": "I loved it, its better with the tslrcm",
            "review_score": "1"
        },
        {
            "review_text": "The great sequel to an already great game, Knights of the Old Republic 2: The Sith Lords takes what you loved about the first game, and improves upon it in various ways. Some blame Obsidian for the fact that alot was cut out of the game, but it was LucasArts, and their haste to get it out by Christmas. But, all that can be solved for when you download the Restored Content mod, which adds EVERYTHING that was cut from the final game, and then some. You seriously need to play this series.",
            "review_score": "1"
        },
        {
            "review_text": "Great game up until the endgame. Then it's just sad for what could have been. Prime example of a producer rushing the developers to finish the project by a particular date.  Could have been my favorite game of all time and one of the best RPGs out there... but it's hurt too much by what could have been and what was left out...",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, worth every penny. Brings back a lot of good childhood memories.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended for anyone who enjoys RPGs and Star wars. Good story, plenty of good voice acting with options during conversations for slight RP element of the main character.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games, have the orignal xbox version and PC versions.",
            "review_score": "1"
        },
        {
            "review_text": "This game is less buggy than the first, but I crash more than the first one. Arg 7/10...first one is better.",
            "review_score": "1"
        },
        {
            "review_text": "If you played KOTOR 1, then you know what you are up to: a great game, with great mechanics, storyline, and soundtrack. Plus, it's Star Wars.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Not much different than the first game but the cut content mod brings back the replay value in it. Characters are pretty well developed and fun to interact with while playing the game. Quests are same old find this or kill that but other than that the game itself is fun to explore around the Star Wars universe in.",
            "review_score": "1"
        },
        {
            "review_text": "A bit dated and glitchy for Windows 7 + machines, but still a pretty fun game. Combat and story line were both excellent, I enjoyed just about every minute playing.",
            "review_score": "1"
        },
        {
            "review_text": "''Love' is making a shot to the knees of a target 120 kilometers away using an Aratech sniper rifle with a tri-light scope.'",
            "review_score": "1"
        },
        {
            "review_text": "A classic. While I preferred KOTOR 1, KOTOR 2: TSL is still a great game. With the various patches and most importantly, TSL restored content mod, this game is solid. If you've never played it, you must. If you have, it deserves another playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best",
            "review_score": "1"
        },
        {
            "review_text": "Good game but there are a few crashes if they are due to the workshop mods or not i dont know but I hope it turns out alright ",
            "review_score": "1"
        },
        {
            "review_text": "Lot of bugs, but it can be forgiven because of the story",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10 loving being able to play as a bad guy",
            "review_score": "1"
        },
        {
            "review_text": "The 36.2 hours is really just since I got the steam version. I've probably suck well over 500+ hours into this game between non steam PC versions and my Xbox Versions.   KOTOR II had its issues when it came out with incomplete conetent, and a few broken things, but it more than makes up for it. It has it faults like every game, but it also has its great moments. The combat is much more refined, the expanded powers, feats, and items make this game an improvment on KOTOR.  If you are going to get this, getting the Restored Content Mod is recommended AFTER you play through it the first time. That way you can really experience how this great and awesome game would have been even better.  This game is one you will play again and again if you love RPGs, espeically western ones. It is good, bad, and everything in between, like everything. Despite being 10+ years old, it is still strong and shows the basics of RPGs and then expands it. Despite the somewhat broken story, you can still live a great story, rich characters, planets with intrigue, and customize your party, weapons, and everything inbetween.",
            "review_score": "1"
        },
        {
            "review_text": "Don't like Peragus? Spawn lightsabers. Beat early game in one hour.  11/10",
            "review_score": "1"
        },
        {
            "review_text": "KOTOR 2 had the ability to be a great game. If you were a fan of the first Kotor 2 is a definite buy but things feel a bit rushed at times. There are noticeable spots throughout the game where you will feel like something is missing. That is due to the game being rushed during production and many cutscenes and areas were removed.  3/5  HOWERVER Mods exist. Notably The Sith Lords Restored Content Mod. This mod adds back a huge portion of the cut content in the game. God bless that team.  5/5  Side note: Have not played with the M4-78 mod.",
            "review_score": "1"
        },
        {
            "review_text": "Revisation: A mod known as TSLRCM has fixed most problems. One may now buy this entertainment, and have the meatbag function knnown as 'Fun', with the mod installed. (HK-47 gives it the thumbs)",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpiece, this game's storyline really makes you feel like you were in a darker time of the star wars universe, it gives you a feeling of isolation as you play through the beginning portion, as you start off on the peragus mining facillity there is a very eerie feeling, later on as you play through the game you are hunted by countless enemies trying to slay 'the last jedi', I absolutley love this storyline. Gameplay wise it feels very rushed as many portions of the game were never added and left un-finished. I do like the ability to have a large crew and level their skills as you wish to make them taylor to your specific needs. Over all I highly recommend this game if you are a fan of starwars or Rpg's.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game, it's fun got a lot of stuff to do - many choices to make that change the course of the story.   It's not without problems, and the biggest one is the cutscenes. Many are missing or have no sound, and I have no idea what is actually going on (I pieced it together but not til the end). People say you need a mod to fix this, but this just brings me back to one of the things I hate about steam - incomplete and broken games being sold. I think that is pure bull ♥♥♥♥ and in all honesty, I'm getting sick of it.   The fact that you need to mod this game to get the full experience makes the price tag, no matter what it is, feel like a joke. Steam needs to address this with so many games and this, unfortunately, is another. It puts me off buying games here because I'm uncertain of the quality I'm going to get. It's turning into a flea market... ",
            "review_score": "1"
        },
        {
            "review_text": "This the first Game I bought on Steam; But I first bought this game on the Orginal XBox. I loved it; the StarWars Lore, the Good/Evil line, the exploration, becoming a Jedi and building a Lightsaber, the level-up system to learn new feats and force ablities, Influencing my companions, and sometimes making them Jedi. This was definetly, one of my Favourite games.",
            "review_score": "1"
        },
        {
            "review_text": "It's predecessor, in my opinion, was the best game ever made. The sequel, while improving on many facets of the mechanics and gameplay, doesn't live up story-wise to the first one. However it's redeeming qualities outweigh it's shortcomings by a wide margin. It's single most distressing quality though, is the incredibly rushed, unfinished state the game was released in. Not only did it have a few minor bugs, but whole chunks of content were completley missing. If you can tell that a portion of a level or plotline should have been there and just did not lead anywhere or was eluded to through in-game conversation or similar plot devices, and ended up not existing, the game is not ready to be released, unless you remove all mention of those features, levels, or plotlines. I won't give spoilers here, but they actually removed an entire planet, because they didn't have time to finish it. If you don't mind modding however, there are some fan-made content restoration packs that really make the game how it should have been when it was released, so if you get this game, make sure you get the 'finished version'. That having been said, it still is one of my favorite games, just falling short of KOTOR 1, so if you liked the first game, give this one a try too.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game ever since it came out on xbox, so good in fact that I am STILL WAITING FOR KOTOR 3 !!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome classic, awesome story. Overall awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the most awesome games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "This game (even though it was never finished) is still amazing to play almost ten years later.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing consoles games too long. I don't know how to use the keyboard mouse combo well enough for an action game. :( I am recommending this due to the fact i'm probably the only person with this problem.",
            "review_score": "1"
        },
        {
            "review_text": "I LIKED it, now it not has innovative has it was when I first played it.",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing, too bad there wont be a KOTOR 3 10/10 Best Star Wars game out atm",
            "review_score": "1"
        },
        {
            "review_text": "Can anyone get this game to work? I meet the system requirements, and have tried everything I can think of and everything everyone else can think of, but it won't even start up.",
            "review_score": "-1"
        },
        {
            "review_text": "Cant believe ive found a way to play again!",
            "review_score": "1"
        },
        {
            "review_text": "So much fun when you max out your character at the beginning on the game and make him/her evil AF.  Mercenary(s): Oh look, a jedi.. Don't worry, your death will be quick and painless! Sith Lord Jeffrey: I Can't say the same for you guys..   Instant kills everyone with force lightning 11/10  IGN Be like: Wait..This isn't Call of Duty! 3/10    ",
            "review_score": "1"
        },
        {
            "review_text": "Well the thing is, this game is great if you love TOR, but it was definitely not as good as the first one. The story and the game in general felt really rushed. Use the so-called The Sith Lords Restored Content Mod to enjoy the game as it was meant to be.",
            "review_score": "1"
        },
        {
            "review_text": "Still great......just buy it........buy it.......buy it.......enjoy",
            "review_score": "1"
        },
        {
            "review_text": "If you played the first one, and liked the first one, you'll like this.  Don't forget to get the Restored Content mod (available on the steam workshop) because it adds a lot of content that was originally cut.",
            "review_score": "1"
        },
        {
            "review_text": "While my playtime doesn't refelct my actual playtime in this game i can promise you i've put over 100 hours into this game. on the original xbox, and on a non steam version of the game. This game is from 2005 so the graphics, and the overll cohesion of the game is not going to be over average. This game is just full of awesome characters and challenging combat, its just an amazing game. buy it",
            "review_score": "1"
        },
        {
            "review_text": "A sequel to one of the best Star Wars RPG's, KOTOR. KOTOR II is the same gameplay wise and the story is bound to give you lots of hours. Replay value also high since you can do multiple playthroughs with different views. A MUST HAVE !",
            "review_score": "1"
        },
        {
            "review_text": "Recommended,  Deep, enjoyable, great story.  It is fine as it is, but great with the restoration mod content.  Nice add the new improved version.",
            "review_score": "1"
        },
        {
            "review_text": "Classic D&amp;D gametype set in the Star War Universe, both games are amazing standalone",
            "review_score": "1"
        },
        {
            "review_text": "Classic style RPG with a twist! Turn based battle and DnD esqe saves and counter saves make this game as much about logic as it is about the choices you make or the quests you do. It will keep you smiling for hours on end. A fantastic sequel to KOTOR. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Come for the nostalgia, stay for the mods! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Without a doubt one of the best RPGs of all time. Great story and very decent gameplay for its age.",
            "review_score": "1"
        },
        {
            "review_text": "Back when the game first came out, a friend of mine told me about all the amazing things this game had but I could not play it unfortunately. That is now done ! I played the game about 40 hours but it offers great replayability as you may play as a Jedi or as a Sith Lord depending on the choices you make during the game. I found the game was very immersive and for a while I only played Star Wars: KOTOR II. Technically speaking the graphics still look a bit outdated but I don't really mind as far as I am concerned. The game ran smoothly under Windows 8.1, with a couple of crashes here and there but nothing serious really. I haven't tried it under Windows 10. All in all a great game to play !",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, this is the time to buy it now that it has been updated after 10 years with Steam support, widescreen, controller support, etc. Be sure to install TSLCM from the Steam Workshop....I wouldn't even play this without it.  Works great in OS X.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game i played it for the third time a few months ago. I really don't understand why they discomimued the series. Honestly that was the best game based on a film i ever played. But also one of they very best games i ever played.   It is a quite open RPG with some amazing characters quite a lot of pew pew to be exciting but also atmospheric and pleasent in the quiet times. I will say that Mass Effect mechanics are completely based on Kotor.   Graphics are obsolete for 2015 but it still sucks you in ... and i am a 4K AAA graphics person. Ok loads of people might actully find that frustrating but i think Kotor is better than the film. IF they do a Kotor 3 (not a horrendous MMO ) with the todays graphic capabilites it will be the biggest blockbuster ever.",
            "review_score": "1"
        },
        {
            "review_text": "For a game that was made in 2003 it is the best. The combat is satisfying and the graphics are ok. Sometimes the characters look the same but that is forgiven because its just way to amazing. My tip is always use sith lightning and force crush. It recks face!!! 10/10 is you love star wars. BEST GAME EVER!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a game you should pick up, great storyline, wonderful randomness that reminds you that not one playthrough is going to be new and exciting, i haven't played it in a long time yet i highly recomend this game. 9/10 because sometimes the game gets extremely buggy.",
            "review_score": "1"
        },
        {
            "review_text": "Controls from hell. Sad after the good first part. If you can handle feeling like you are controlling something that hates everything you do and tries to do something else, go ahead and get this otherwise good game.",
            "review_score": "-1"
        },
        {
            "review_text": "Stuck with this game for over 12 hours and I really feel like I have gone nowhere and have done nothing. None of my party members seem interesting so far and the game just seems boring compared to the first one. Granted, the interface is much better in this compared to the last one. Overall, if you had to pick between Kotor 1 or 2, go with 1 and enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "The game i would like to play but unfortunately steam sells faulty copies so dont by as it is the downloads are corrupted. The game is almost impossible to run. It will repeatedly crash and wont run on most equipment. Dont by from steam, if you want the game to actually work buy elseware.",
            "review_score": "-1"
        },
        {
            "review_text": "Personally one of my favorite RPGs. It has a great story, great gameplay, also you can mod the game as well. I would wait when this game is on sale. Add this game to your wishlist!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, amazing time consumer, I give it a perfect score of 5/7",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would sneak, hack, and space-wizard through the galaxy again",
            "review_score": "1"
        },
        {
            "review_text": "Bought this as part of a Star Wars bundle and only to discover that the reputation for poorly ported Star Wars games is well deserved. The game crashed so much it was like it was designed to do it but eventually I got it working.  Its an older game but its still fantastic, I would however reccomend playing it with the restored content mod.",
            "review_score": "1"
        },
        {
            "review_text": "the best star wars RPG. thats all that needs to ne said",
            "review_score": "1"
        },
        {
            "review_text": "I have clocked well over 500+ hours on my Original Xbox. The replay value of this game is extremely large. So much to do an with Workshop added to steam with it, the gameplay is endless!   214071983595782/10",
            "review_score": "1"
        },
        {
            "review_text": "I've clocked hundreds of hours on this. ( Non- Steam version) but when i found out that it was workshop supported on Steam i rushed to buy it. The community is still strong and the mods are great, even though it's a bit old its highly enjoyable for Star Wars fans and even non- star wars fans will get a kick out of this amazing game. Although i do reccomend getting the The Sith Lords Restored Content Mod (TSLRCM).  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Not entirely up to the standard of the first game but still enjoyable. I only played it with the restored content mod installed, without that mod the game is said to be a significantly worse experience.",
            "review_score": "1"
        },
        {
            "review_text": "Been meaning to write some Steam reviews for ages but never got around to it. Then I got this game and it provided the motivation I needed. :) I played this game on Xbox way back in the day, and heard about friends playing with all their awesome mods on the PC. I wanted high res, but just couldnt' stand playing KOTOR without a controller.   Flash-forward to now, and the game finally got controller support. Yay! I bought it for just about nothing on the Steam end of year sale and installed it. I wondered if it really would work with my modern computer and 360 wired controller. I've had some nightmares lately with games starting off the screen and not letting me adjust graphics or run full-screen.  I ran this game, and it IMMEDIATELY recognized 720p resolution and went full-screen with beautiful high-res. Controller took a little adjusting to work the way I wanted it to in the game's options menu (camera rotation with right stick to feel right), but once I had that working the game worked beautiuflly with the controller.   The load times from the 360 are reduced to pretty much nothing, the game runs much smoother than the Xbox, and with none of the horrible sound glitching I was getting on the 360. The cherry on the sundae is that you can install additional content, fixes, and upgrades thorugh the easy Steam mod system. Awesome, awesome, awesome!  Oh and for anyone who thinks this game is inferior to the first KOTOR, I found this game to be much better personally. While the beginning level and final level aren't that great, there's plenty of bugs, and the game has serious pacing issues, but in my opinion the best dialog of any video game I've ever played is in KOTOR II. The world needs more games this good.",
            "review_score": "1"
        },
        {
            "review_text": "Doesn't have Gungans, though it still manages to be a decent game without. Be-aware that the combat system is turn based (though certainly still fun) as the game focusses more on story, involving uncovering mysteries and making decisions.",
            "review_score": "1"
        },
        {
            "review_text": "For new players and Star Wars fans alike, Knights of the Old Republic 2 is a great game. I played this before the original, and was hooked. Very good replayability options, different characters, alignments. Become the new Jedi Master or Dark Lord of the Sith, your choice. Brilliant Game.",
            "review_score": "1"
        },
        {
            "review_text": "Knights of the Old Republic II is, even though sadly unfinished, a decent game with a wonderful story.  A decent game because, well, the combat sucks. It sucked in the original Knights and it sucks on this sequel (though the new greatly unbalanced abilities make it go faster most of time.) It basically amounts to selecting Force Storm, clicking on it four times and watching the movie that is combat. To add to this, levels are very small (Its pretty graphics, at the time, did not allow for big levels in the Xbox). But yeah, that doesn't really matter.  What matters is its story and characters. The story is a deconstruction of the Star Wars setting. While Knights 1 had a very black and white morality, same as the Star Wars movies, the sequel is shades of grey in that regard. It regards the fighting between Jedi and Sith as useless, since the balance of the Force must be kept. Your character is a wound in the Force, a former Jedi who has had their connection competely severed with it, and only know, about 5 years later, is it coming back.  Your master (and one of my favourite characters in gaming), Kreia, has unique views of the Force, borne from her writer's (Chris Avellone) views on the Star Wars setting, and every conversation with her is interesting. Should you follow what she teaches you, you will find yourself at the beginning veering towards the Dark Side of the Force, only then to be criticized by her for being evil just for the sake of being evil. The game offers a satisfying Dark Side route unlike the first game's 'being a psycho just because'. The other characters are also great.  Unfortunately, Obsidian got rushed (as always) to put the game out on Christmas, and the ending doesn't provide a very good conclusion. Even with the restoration mod, it still feels unfinished.  Even if you don't like Star Wars, I'd recommend this game. Unless you really hate lightsabers.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best Star Wars game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Playing again for the first time in a long time. Absolutely awesome gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Clearly a rushed release but still fantastic. Restored content mod is a must.",
            "review_score": "1"
        },
        {
            "review_text": "Ive spent so much time playing this game on xbox i cant wait to spend so much more here. This is realy a fantastic game if you like RPGs, keep in mind that it is old so the visuals arnt updated and its nont quite open world, but it still has so much to see and the story is quite interesting.",
            "review_score": "1"
        },
        {
            "review_text": "This game explores the Star Wars universe on a depth of which no other game or movie could display. After 10 years, it is still a masterpiece and remains one of the most phenomenal games of all time. While development was cut short, and it could have blossomed into something more beautiful, even part of the 10-hour long game is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Works Great. Not as good a the first one but it had its moments",
            "review_score": "1"
        },
        {
            "review_text": "5/5",
            "review_score": "1"
        },
        {
            "review_text": "probably the best star wars game ever made (with the cut content mod). If you just watched episode VII and were like 'what the ♥♥♥♥ is this story' (like me) play this ♥♥♥♥ right ♥♥♥♥ing now it's amazing",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game of all time. A must buy for any star wars or even a simple rpg fan. Though you must play with the restored content mod and the hk mod installed, as they return the game to its origional state before everything was cut from the game.",
            "review_score": "1"
        },
        {
            "review_text": "Makes you think critically about your choices throughout the game. Not a mindless rpg. The conversations with other characters can get long, The game challenges you to think. It is not always easy to know what is right and wrong to get the outcome that you want. Fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best Star Wars game out there, almost passing the original KOTOR when the Restored Content mod is installed. Great story, characters, locations, combat... Just an amazing game overall. Thanks EA for killing the series with SWTOR :(",
            "review_score": "1"
        },
        {
            "review_text": "A must play. You must play this with the Restored Content Modification.   This game is seriously one of the best ever made and should be a must play for anyone that likes Star Wars.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games which i know.",
            "review_score": "1"
        },
        {
            "review_text": "either made or published by obsidian, either way great game worth the 10$",
            "review_score": "1"
        },
        {
            "review_text": "i love this game. just each time i tried to start a new game the game would go through to the character creation screen the nfreeze and say that there was an error in the playback function",
            "review_score": "1"
        },
        {
            "review_text": "Honestly if you haven't played this yet, then what are you waiting for? I recommend playing the first one first though.",
            "review_score": "1"
        },
        {
            "review_text": "awesom game its my favorite :3 ",
            "review_score": "1"
        },
        {
            "review_text": "sequel to the second best game ever made",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Pretty much Star Wars version of Mass Effect. Great story elements, fun combat, challenging puzzles, amazing customization and great characters.",
            "review_score": "1"
        },
        {
            "review_text": "this rpg properly explores game morality in player choices  it starts tugging at a thread and proceeds to unravel the entirety of Star Wars   two thumbs up rip extended universe, you will be missed",
            "review_score": "1"
        },
        {
            "review_text": "Play this game if you are a RPG or Starwars fan in any way, shape or form.",
            "review_score": "1"
        },
        {
            "review_text": "Even better than the 1st one",
            "review_score": "1"
        },
        {
            "review_text": "A true masterpiece which will last throughout the ages. The epitome of Obsidian's writing and storytelling.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best things Obsidian ever created. If there will be the 3rd game my life will be complete (which is not likely).",
            "review_score": "1"
        },
        {
            "review_text": "KOTOR 1 and 2... My childhood... It was a damn good childhood, and I'm really grateful to my dad for showing me the game, when he did.... I was a 7 year old clueless newbie... I was a kid back then, with no idea what a computer was, and what it could do, I played the game and used a computer for the first time. I was amazed that I can build my own character in the world of Star Wars. It was such an epic journey for me back then. It was everything I needed back then, at that age, because I was and I still am a huge Star Wars fan. No need to explain why :)... Nowadays I still have the same feeling. This game started everything for me.  Once I saw it on Steam, it was a big relief for me and I bought it right away.  -I started playing Kotor 1. -Finished it. -Watched the movies. -Got more hyped. -Started KOTOR 2. -Played the ♥♥♥♥ out of it. -Finished it. -I was then a complete Star Wars nerd... The best Star Wars game series Lucasarts have ever done, and I'm really glad they did.  After 10 years, the game got an update... :   • 37 achievements to be earned through gameplay  • Steam Cloud saves  • Native widescreen resolution support  • Resolution support up to 4K and 5K  • Support for controllers, including Xbox 360, Xbox One, Playstation  3, and Playstation 4, along with several others (check the system requirements for details)  • Steam Workshop support! We proudly worked with the Restored Content Mod Team to have their famous TSLRCM up on launch day   Well... Considering 10 years, its not bad. These things were needed, and its good that they still remember this game and its not abandoned. :-) I'll be a Star Wars nerd for life.   Thank you George Lucas, Obsidian Entertainment, and Lucasarts :').",
            "review_score": "1"
        },
        {
            "review_text": "this game was just another unlucky unfinished masterpiece. Had it have more time, I'm sure that the developers could have given us a great product that could stand out for decades.  But dont let that keep you out from buying this game, it is a great game nonetheless. A must have for rpg lovers and a cool bonus for star wars fans.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best-written RPG's ever made (and possibly the best-written Star Wars game ever made), and the mechanics are solid, if a little unbalanced in places. (If you've ever played D&amp;D 3.5, you know over half of the mechanics already.) For a game with a binary morality system, there are many discussions and scenarios throughout the game about the more subjective natures of morality.  I highly recommend playing this with the Restored Content Mod (RCM), which repairs some of the content that Obsidian couldn't quite finish in time for the game's rushed release. With the mod, my only criticism of the game is that the game doesn't open up and let you explore until easily 1/4th of the way in, so you will have to survive a while through two extended tutorial levels. (That being said, even those levels are pretty good; just not great.)  Even without the mod, if you like an intricate story with fleshed-out characters and the Star Wars universe seen through different eyes, I can't reccommend this enough.",
            "review_score": "1"
        },
        {
            "review_text": "This game, 100/10 its just a good solid game for it's time, add 2-3 mods and its even better",
            "review_score": "1"
        },
        {
            "review_text": "Every bit as much fun as it was when I played it way back on the origina XBox, even if I had to get used to a new control scheme. The Workshop for it, while small, is definitely a plus.  10/10 would blow up Peragus again.",
            "review_score": "1"
        },
        {
            "review_text": "A great game despite being rushed out before it was done.",
            "review_score": "1"
        },
        {
            "review_text": "very pycological but needs restored content mod",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i've ever played. With an amazing story and one of the best characters i have ever seen (Kreia), KoTOR 2 is an amazing deconstruction of the SW universe, questioning the aspects of both Sith and Jedi and their binary moralities. I highly recommended this game for everyone, even if time constraints led up to a uncompleted game. If you want to play it, i'd highly recommend the TSL Restored Content mod, as it restores some of the cut content that Obsidian was not able to implement. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "The most philosophical star wars game to date. It breaks down the current perspective on good and evil in star wars and flips it on its head.   The game also has so much detail, and every time I play it, there is something more to be learned, explored, or discovered.",
            "review_score": "1"
        },
        {
            "review_text": "One of the darkest games I've ever played, and one of the best. Avoid it if you get bored by long conversations in games and just like action but otherwise, download yourself the restored content mod and play it! Also probably play the original first.",
            "review_score": "1"
        },
        {
            "review_text": "Best Star Wars games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly one of the best star wars games to exist. This game is filled with many twists and turns, rights and wrongs, lefts and rights, and light/dark/grey; but all circles around one word... malachor. That name will be ingrained into your mind from start to finish with this amazing game. To not buy this game would be apathy, and apathy is death.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best RPGs to date.",
            "review_score": "1"
        },
        {
            "review_text": "Obsidians first Fallout New Vegas.",
            "review_score": "1"
        },
        {
            "review_text": "By far the most profound videogame story ever told.",
            "review_score": "1"
        },
        {
            "review_text": "Great Storyline. Especialy after restored content mod update",
            "review_score": "1"
        },
        {
            "review_text": "This game. The words to describe it are lost to me. This RPG introduced me to the genre. It is a precursor to games that have choices, such as Mass Effect. The story was ahead of its time and the gameplay is tremendously awesome. This game is one of the best games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "HK .. What more can I say",
            "review_score": "1"
        },
        {
            "review_text": "Better sequel than 'THE OLD REPUBLIC'. Reason: no requirement to use that god awful Origin Service.",
            "review_score": "1"
        },
        {
            "review_text": "AHHH Kinghts of the old republic we meet again, such a good game made from an amzing series, one of the best star wars games around these days",
            "review_score": "1"
        },
        {
            "review_text": "Unique story, watch the galaxy shape itself to the choices you make as you embark to save the galaxy from one of the greatest enemies the starwars franchise has ever seen. If you like rpg with good indepth story such as mass effect and dragonage this is a game you will most certainly enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "I have to play windowed for some reason but it's fun. I wish I didn't have to play windowed but if this is how I must live my life, then so be it.",
            "review_score": "1"
        },
        {
            "review_text": "Bioware makes great RPG's, and Obsidian makes them better. This is a game where what you choose to say to someone, and how you develop your character, are as important as the combat. The Force is strong with this game.",
            "review_score": "1"
        },
        {
            "review_text": "'The Sith Lords'? Okay. Okay. By the way, everybody, I have a book coming out next month! Keep an eye to your bookstore shelves for, 'Hercules Goodpuncher vs. The Bad Guys'! Will Mr. Goodpuncher punch the bad guys good, or GREAT? Does that sexy, seductive bad guy actually want to join Hercules on his quest, or is it all a pliant plot? (hint: no. she is still a bad guy.)  This game IS really good, but the obvious placeholder title displays that they had little time to refine their work from something good into something transcendental.",
            "review_score": "1"
        },
        {
            "review_text": "This game is freakin amazing!! Get it!",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best games ever made, enjoyable even for non star wars fans. beautiful piece of work.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are dated now, but this is probably one of the best Star Wars Games ever. Fun story line and the ability to use the force and a light saber.",
            "review_score": "1"
        },
        {
            "review_text": "Classic, will always enjoy playing this excellent game!",
            "review_score": "1"
        },
        {
            "review_text": "Classic RPG! And a must play",
            "review_score": "1"
        },
        {
            "review_text": "A gripping story and vast degrees of character/equipment/playstyle customization is marred only slightly by the presence of bugs. The game starts off slow, however, and takes a certain degree of patience. Someone who is willing to lockpick(or in my case, lightsaber open) every door and read every datapad will gain a very rich experience in the backstory of Star Wars. If, however, you simply want to engage in lightsaber duels as an action game without regard for pace or story, this may not be the game for you. If you value a well-paced story with some darker tones and a myriad of ways to play with your character/party, play this game. Just do with with the Restored Content Mod(google TSLRCM, you'll find it), it makes the game much richer.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those flawed masterpieces that you have to try.",
            "review_score": "1"
        },
        {
            "review_text": "its oka xD love playing old games xD",
            "review_score": "1"
        },
        {
            "review_text": "Amazing RPG, get restored content mod for free, 2 hours extra gameplay!!!",
            "review_score": "1"
        },
        {
            "review_text": "So many magical places to play and be sith :)",
            "review_score": "1"
        },
        {
            "review_text": "Download the TSLCRM (the mod that restores content) and completely reenjoy this game. simply put - its awesome. like a totally different game almost. Also...make sure you get 1080p working (or bad)  10/10 will play again.  darkside or gtfo",
            "review_score": "1"
        },
        {
            "review_text": "Become a Jedi Master or a Sith Lord. Be the worlds greatest hero or villain. This is your game. And shiiiitt fo 9.99 ♥♥♥♥♥ what a steal.",
            "review_score": "1"
        },
        {
            "review_text": "probebly the best rpg ive played... meh just about ever when it comes to dialog and immersive story.",
            "review_score": "1"
        },
        {
            "review_text": "Can't stop playing.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Story rich, same as the first one, with a slightly weaker story. As a full on magic user, this was much better. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, if you love star wars and RPGs with the party mechanics like mass effect and Dragon Age you have to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "A great game overall and true SW Experience. Go to DeadlyStream to get the Restored Content mod, the restored Droid Planet AND a load of other mods and fixes which will make the game even more enjoyable.  Too bad Obsidian has not made it more moddable.",
            "review_score": "1"
        },
        {
            "review_text": "just wanted to warn you guys about the new mmo from black isle entertainment. tbh i have seen better graphics in a an terrible game lol. the worst thing everybody don't even want to trade or join my group., if you want to play add me to friends my name on there is Raith Nothel and im a counsellor",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as KOTOR, bot still worth a playthough",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game I had to get the truth out: KotOR 2 is not a bad game, but it is not a shining example of gaming greatness either. However, the game is a diamond in the rough - if you have the patience to read through the incoming wall of text, then I'll explain why. Skip to the end for pros and cons if you want.  The gamemakers were pressured into releasing the game before the planned release date and therefore the game is truncated in a most horrible fashion. The ending is very anticlimactic due to its overreliance on a few dialogue options, which serve to give some conclusion to the story. The AI is dumber than a sack of rocks - enemies do not buff themselves or utilise certain mechanics that forces the player to be smart/flexible. Melee enemies will charge you in an uncoordinated manner and ranged enemies will just have a slugging match with you until they die. And the story tries to have several concurrent plotlines at a point, where you switch from companion to companion, which harms the climactic sequences and that feeling of dramatic tension.  I played as a Light SIde Jedi Consular with the awesome power to KILL EVERY NORMAL ENEMY IN A ROOM WITH 2 ACTIONS on the normal difficulty. All I did was throw Dark Side Lightning everywhere, which was fun for a while in the beginning, although it got boring fast. Then I just decided to do another cool and overpowered thing, which I did in KotOR 1 with my scout+sentinel: I got so many attacks in each round that I could end anyone in a round even without stasis'ing my way to victory. In KotOR 2, I used an aggressive lightsaber form (Juyo) with Master Force Speed, which results in a double-1h jedi throwing 5-7 attacks in one turn with Master Flurry. Vulnerabilities were chased away with the Stasis Field power, since they can't hit you when they are all frozen.  Okay, fine. Combat has improved from KotOR 1 with the addition of lightsaber/force forms and more feats/powers - the game just suffers from a BAD AI and heavy truncation.  I was spared the worst of the truncation, since I installed a mod, which restores a great deal of content. That does not excuse the huge negatives of the game, but it did allow me to experience an introspective quest of self-defense, which was very evident throughout the dialogue with your teacher (Kreia) and your interactions with the force-sensitive companions you gather. The many companions have varying degrees of depth, but Kreia takes the cake with her motives and perspective.  Kreia has (HEAVY SPOILERS INCOMING)    an intense hate for the force (which is a poison in her eyes - to be used until she discovers how to KILL it) and her dialogue reveals a depth to her observations. She reveals the way everything is connected, not just as regards to the Force, but also as it regards to causuality. She tries to teach you the art of manipulation as she manipulates you. She believes that she is working for the best and she reacts harshly to the whole Sith(DS) vs Jedi(LS) worldview, which is so very black and white. She is a dark shade of grey and she sees teaching you as her greatest chance to influence the world. Machiavellian political philosophy is very much about doing small evils to do a great good and she really shows you how easy it is to trip over Dark Side dialogue options, as you find that her voice of reason is very much about the greater good in a world where every action affects your force alignment. Separation from the Force makes the ones separated stronger in her eyes, as the overreliance on the Force turns people into philosophical and ethical cripples, which makes her love you for CUTTING OFF YOUR CONNECTION WITH THE FORCE VOLUNTARILY.    The dialogue with her also reveals some problems between the Force (fate) and free will, with Kreia as a proponent for free will, which explains her actions. (I am also reminded of Nietszche, when it comes to her grayness in the whole LS vs DS debacle.)   Pros: PC mods help (some are easy to install) - combat CAN be fun - dialogue is influential (as it was in the first KotOR) - engaging characters - you get to be as reasonable/psychotic/goody-two-shoes as you want to be - Kreia - if you can immerse yourself then you get a great experience  Cons: truncated game - combat is USUALLY not engaging, especially in the long run - game is a bit drawn out - ending is anticlimactic - game is easy on normal - game is a guilty pleasure - immersion can be hard to gain and maintain - certain powers and tactics are almost gamebreaking in the environment offered by the game  tl;dr game is just alright if you can live with its failures - if not, then it is not for you",
            "review_score": "1"
        },
        {
            "review_text": "How RPGs should be done. Simply great game. Not every day the 2nd of a series is better than the first.",
            "review_score": "1"
        },
        {
            "review_text": "Been waiting a long time to play this, remember playing the first one and that was awesome. Totally excited!",
            "review_score": "1"
        },
        {
            "review_text": "Even after playing this again 10 or so years later, the locations could have been designed better. But the story, characters and dialogue are still good. Even better with the fan patch that restores all exlcuded content + widescreen. Still worth playing however because the combat system has very much improved over its precursor at least.",
            "review_score": "1"
        },
        {
            "review_text": "Imperfect, but still a worthy successor to KOTOR. There are unfortunate points where you really feel the absence of content cut in the rush to release, but it's a classic all the same. A greta plot, fantastic characters, and it even manages some twists that approach the brilliance of the original.",
            "review_score": "1"
        },
        {
            "review_text": "as soon as it starts up it boots me out ",
            "review_score": "1"
        },
        {
            "review_text": "This may be my favorite Star Wars story, ever. Unfortunately the ending is quite a disaster, but up until the last part of the game it makes for a fantastic story.",
            "review_score": "1"
        },
        {
            "review_text": "A great game spawned from a great franchise. I give this game 8/10 as-is; however, with the addition of Steam-compatible The Sith Lords Restored Content Mod (TSLRCM) available for FREE, this game is easily a 9/10 - 9.5/10. There's great gameplay, great story, interesting and fun side-quests, many different combinations for classes, advanced classes, character build and tactics, dark vs. light side bonuses, and more. If you're interested in full completion, this game will keep you absorbed for days on end. If you're a type that plays through once, this game will keep you interested for 20-30 hours and leave you with fond gameplay memories.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Old but gold",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Game. Not quite as complete as the first one. But a top quality RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, poor port. You will need to download some fixes from the internet to make work on windows 7 and it won't run from the game library without removing and re-adding the shortcut after the fix has been installed correctly.",
            "review_score": "1"
        },
        {
            "review_text": "ohh yeah. Kotor: 2. if you have ever played kotor 1 then you will know what i mean by this. ok kotor 1 was awesome. but this is better. in kotor 1 you find out your Darth Revan, and then kill darth malgus in the end. but in this one its different and a whole new storyline. dont want to spoil so play it to find out!",
            "review_score": "1"
        },
        {
            "review_text": "kicks all the ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "The best game ever made. Just make sure you install the Restored Content Mod, and play the first one, and get ready for the best story ever told by a video game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is 100% pure and perfect. In order for it to work properly you have to download the mod update in order to advance past the secret jedi academy on telos. for some reason it is glitched without the update. so i recommend the mod, it should be on the hub. but this game is amazing. the mod update makes it even more intense with more weapons and armor and characters that you meet on the way. i believe it allows you to go to the HK factory too. i havent beat it yet because i am wanting to do all the side missions.",
            "review_score": "1"
        },
        {
            "review_text": "What the ♥♥♥♥? Fun game, like the first one, but seriously disappointed by the loose ends in the story. That's really what I play these games for and it was awful how obviously unfinished this game is. No closure at all. It hurts all the worse because of how close it was to being great.",
            "review_score": "1"
        },
        {
            "review_text": "The first one got me hooked, but this one keeps me coming back for more. It's easily my favorite star wars game ever created. The gameplay is tuned up from the original, there are a lot of extra feats and powers, and the story is just as good, even if it doesn't have that big 'WTF?!' moment in the first game. Its a great game to dump a lot of hours into, and the replay value is high. I highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "God damn this game is glitchy! I loved the first one, so I thought I'd give this one a shot. It takes a long time just for you to get your light saber and that causes this game to get frustrating. Most of the missions you are given are short but also very time consuming, without objective points this game forces players to actually explore the maps. I had fun with the RPG elements but occassionally the conversation was skipable. It does a good job of expanding the lore of Star Wars and I enjoy that, but wish this game was a little better. However, I got my money's worth. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Eh, I dislike the fact that you dont get your lightsaber for a while but overall its a good game. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Classic game, and there's that sense of closure from the added content (Installed separately)",
            "review_score": "1"
        },
        {
            "review_text": "It was a good game, a great game for back story into what led to the star wars we know from the movies and books, as well as cannon for the Old Republic MMO if you're into that.  But the keyword is WAS in my synapsis. The game has aged like milk and its not held up well over the years. One of the major flaws are the story based glitches, missions and dialogue choices disappearing if the right questions aren't asked or response's given. My biggest examples being the Telo's Fuel bug and the Atri's 'Lower Weapons' Bug, both of which break the flow of game or even completely halt progression. And these simple bugs would easily be fixed if lucas arts were still a thing. Even with how simple they are normal programmers could fix them, but since the game is so old, all the old fixes that were available online are now dead end links and no one else wants to touch this relic.  So play it knowing you're going to get some good nostalgia... but then land flat on your face from bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "best kind of rpg star wars game long story a beutiful battle concept and alot of enemies to fight changing characters and a difficult boss fight with thefinal boss ",
            "review_score": "1"
        },
        {
            "review_text": "This game got alot of stick back when it 1st cameout, now that the restored content mod is at 1.8.3 i'd highly recommend people give this a play through, so much has been put back in &amp; the loot that was so stingy in the vanilla game has been boosted, having got a bit jaded with swtor i returned to kotor 1 &amp; 2 for a star wars fix, and i have played this way more than the 1st 1 over the last few months.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game if a little buggy ",
            "review_score": "1"
        },
        {
            "review_text": "Good Game honestly, if you love the series get it. However it does lack compared to the first one, just not quite as catching in the story. But SWKOTOR II is awesome in its own sense if it isnt compared to its predecessor",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Better than the first game? Yes and no. In terms of gameplay, this one takes the old combat engine and gives it a huge upgrade. Storywise, though, it is lackluster. While the original was simple and to the point, but with many twists and lots of character development, this one falls short. It had some enjoyable characters, but others were boring and received little development. Some were introduced so late in the game (depending on what order you play it in) that I didn't get to see if they had any development. The hands-on and easy to do character development of the original is replaced by a strange system that is difficult to use. However,some of the character interactions were interesting and immersive. The overall plot is interesting and raises good qeustions, but there were many points where I was unsure what was happening or why. At the end of the game, I was left very confused as to why certain things had happened. On a more positive note, the gameplay is excellent. While sometimes many characters seem as though they couldn't hit the side of the barn, the overall fluidity is great. The leveling system is great, and can be very immersive. All in all, if you can over look a few problems with the story, you have an excellent, entertaining, and immersive game that will give you hours of gameplay.The other big problem is the glitches. They are intolerable at some points. They vary, from skipping through entire important conversations to simply crashing ffor no reason at all. This game is very unfinished. From what I've heard, this is due to the developers being rushed by ther sponsors. These glitches aren't really deal breakers, especially sense there are many mods that essentially finish the game. The sad fact is that this game could have been even better then the original-quite a feat-but it is left in it's shadow because of this lack of polish.  Overall this game is worth getting, especially sense it is only ten dollars, but if you want a more finished game, you'll have to download mods on your own time. 7/10 for the Vanilla.",
            "review_score": "1"
        },
        {
            "review_text": "To me, this was an spectacular, and epic sequel to one of my favorite games of all time. This is definently an improvement from the first K.O.T.O.R game from Bioware, since they are new features to the game that I enjoyed but others might not enjoy. Like, the higher cost of dark side force powers if you use more light side force powers and more. In my opinion, the difficulty of the game is better and makes it more challenging at times against certain enemies that you encounter in the game.",
            "review_score": "1"
        },
        {
            "review_text": "I was all like woooooooshhhhh wooooooooshhhhhhh. Then the sith were like zap zap, and the droids were like beep boop.  10/10 would wooooooooshhh again",
            "review_score": "1"
        },
        {
            "review_text": "Game is amazing. It is an experience, not just a game. Massive replay value. Also, download the TSLRCM.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best RPGs ever made.",
            "review_score": "1"
        },
        {
            "review_text": "I will start off by saying this: I am not really a Star Wars fan. Now let me tell you that this game almost single handedly changed that. That's it. That's my review. This game is great go buy it! Just be sure to install the restored content mod to fix all the bugs.",
            "review_score": "1"
        },
        {
            "review_text": "I was able to finish this despite a few glitches I encountered. I was somewhat disappointed that this game had any glitches as the orinal did not. These glitches aside I still enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "Pro: One of the best adventure series for a jedi story. You get to choose light side or dark, save the galaxy or reward yourself with a new title in the sith. Then again you could follow the clues left behind by Reven. Double light sabers, staff, single hilt, master the force. Each party member has their own interaction with the main character, your able to debate what you did or explain what you did. Good or bad.  Con: There are some glitches, but the walkthroughs and blogs help.   Make sure you save often, before and after autosave.  Make sure v-sync is on.",
            "review_score": "1"
        },
        {
            "review_text": "Finished both Kotor and Kotor 2 in a 2 day binge and i literally dont know what to do with my life now, guess i'd better go to uni or shower or some ♥♥♥♥. i dunno. I dont know if it was exhaustion and lack of food or the excellent story but the whole revan/bastilla story has just made me incredibly sad. Jesus these games are good, i think im just gonna ignore what the mmo says happened to revan after kotor and make up my own happier ending... if anyone needs me ill be over here in my fantasy world crying like the little b1tch i now am...",
            "review_score": "1"
        },
        {
            "review_text": "Almost as good as the first SW:KOTOR!",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game. I love how you can pick the side of the force you want to be on and it just doesn't affect only you but your allies as well. and the ability to use two lightsabers was an awesome idea",
            "review_score": "1"
        },
        {
            "review_text": "probably the second best Star Wars game ever conceived in my opinion shame about the incomplete build BUT with the glory of the workshop you can turn this incomplete masterpiece into a glorious game.",
            "review_score": "1"
        },
        {
            "review_text": "As excited as I was to hear this game got modern support (I've never played it before) I'm going to go ahead and say wait to get it until it's fixed, Their controller support completely broke my game. When I use anything to control it (Mouse and keyboard work, and XB1, nope) The camera just keeps spinning to the left. I've been searching for days for a fix. NOTHING. as of right now, don't get it. I'm sure it's a great game, but I can't allow people to walk in blind and pay for a broken piece of software. If it gets fixed, totally get it. but I haven't seen a fix so far. Let's hope the guys who made the update are still looking around for problems.  EDIT: Okay, I'm pretty sure I've found a fix, if you run this game in the legacypc beta version, It works... :D I'm having fun so far",
            "review_score": "1"
        },
        {
            "review_text": "WHAT CAN CHANGE THE NATURE OF A MAN?   whoops ♥♥♥♥ wrong game :(",
            "review_score": "1"
        },
        {
            "review_text": "Game released in 2005 recieves an incredible update in 2015... One of the best Star Wars games ever released. I would highly recommend picking up KOTOR and KOTOR 2 if you have not played these games. If you are a bargain gamer you can just wait for the next steam sale as these games are always $2.50 -$5.00 when steam sales roll around.",
            "review_score": "1"
        },
        {
            "review_text": "Let's get the obvious out of the way: yes, the graphics and animations are hilariously dated. Yes, some of the voice actors should probably have pursued other lines of work. Yes, it's still got glitches and bugs out the wazoo, even with the excellent Restored Content Mod. But, you know what? This is still one of the best Star Wars games, and one of the better RPGs ever made, period. If you're a Star Wars fan who hasn't played KOTOR yet, buy them both and play them through in order. You won't regret it.   Pros  The Force powers, influence, and alignment system Companions are varied, interesting, and most of them can be trained as Jedi Fine addition to the Star Wars mythos (not that it matters now that Disney's continuity-bombed the EU, but still) Steam has the Restored Content Mod, which patches in a lot of the content that was altered or cut by Obsidian so they could meet their draconian release timeframe  Cons  Janky animations Dialogue doesn't always flow naturally Still buggy as all get-out, even with the RCM Dat ending still kinda sucks  Overall, I definitely recommend this game, especially for only ten bucks. And, seriously, get the Restored Content Mod. I can't applaud those guys enough for their work.",
            "review_score": "1"
        },
        {
            "review_text": "For those of you having crashes after character creation like i was, iv been able to finish the tutorial but havent tested the rest of the game yet by downloading the game, running it, downloading the restored content mod, running it setting resolution to the biggest non-fullscreen one i can, turning off soft shadows and frame buffer effects. Hope this helps anyone raging from not being able to play an amazing rpg.",
            "review_score": "1"
        },
        {
            "review_text": "At the time of this review i havent even finished the game. This game is dark and distinctly different from the first but is still a masterpeice, especialy with the new achievments and the expansion that has been added through the steam workshop. This game is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely recommended, this game is fantastic, first got it for the Xbox because the cover is ♥♥♥♥ing radical.  Well written, different take on the Star Wars universe, with a more grey look at the Force and Jedi Order than anything else you can find in the Star Wars EU. The villains are your typical edgelords you can expect from the Sith, but have their own niches that make them more intimidating and deeper characters than the mouthbreather in the first game. Gameplay is old-school, but is fairly simple, if you figure it out, it's not hard to become OP. Despite what the game may tell you, Consular is the easiest route to go, and a Dark Side Sith Lord makes the entire late game a complete joke, final bosses included. Also, play as Jedi Jesus or the Smug Black Man, this is coming from the queermosexual who normally plays as cute girls in vidya games, you get a better companion as a man. Seriously, Disciple is ♥♥♥, Bao-Dur's droid is more interesting and is probably more complete too. Speaking of complete, the game definitely is, but the restoration mod mostly alleviates this issue. The droid planet however, was cut for a reason, ♥♥♥♥ that nonsense, don't even download it to try it, almost anyone will tell you it's bad and the only way to enjoy it is if you enjoy strapping on your gimp suit and gag-ball while you play it, because that's the experience you will get out of it.  Apathy is Death, Pure Pazaak, Mucha shaka paka, wound in the force, HILFALA PEEFALA, etc, etc...",
            "review_score": "1"
        },
        {
            "review_text": "A patch out of nowhere! This is tremendous! More superlatives!  I haven't played it since it launched on the Xbox but I'm all in on this. And steamworkshop support for mods! This is the best unexpected surprise of the year.",
            "review_score": "1"
        },
        {
            "review_text": "Even if I'm not a big fan of Star Wars universe, that adventure was really good. And now it's time to play once again, on the Dark Side. I heard they have cookies!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games of all time. 1000/1000",
            "review_score": "1"
        },
        {
            "review_text": "they need to take this off steam, ive tried to download the restoration mod and i made less progress than when i played the game without it",
            "review_score": "-1"
        },
        {
            "review_text": "Just finished it two days ago with TSLRCM installed and the game is updated with TSLRCM available in the workshop. What a coincidience ! I need my achievements !   One of my favourite features on this game is the influence system on your crew mates and the ability to turn some of them into jedis.   This game is nearly perfect with TSLRCM and much better than the first KOTOR from my point of view. It is one of the best RPG I have ever played in life.",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly impressed with the revamped game. Resolution at 1920x1080 looks great for a game of this age. Wasn't expecting achievement support, and haven't had a crash yet in Windows 7. The workshop adds something to look forward too.",
            "review_score": "1"
        },
        {
            "review_text": "appreciate the updates! now i can play an hour into the game and have it FREEZE! in the exact same spot every time maybe try again? but i do enjoy that 1 hour =)",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game if you enjoy the first game of SWKOTOR. I think it better with the Restoration project because it fix alot of bugs and add alot of stuff that was missing. There another mod that is apart of the Restoration mod it called M4-78 EP and it add the droid planet with more hours onto the game and more story.",
            "review_score": "1"
        },
        {
            "review_text": "Great story",
            "review_score": "1"
        },
        {
            "review_text": "HOLY ♥♥♥♥-IN NERF-HERDERS I LOVE THIS GAME!!! and its linux compatable &lt;3 GOOOOODBYE LIFE! helllllllo sweet steamy embrace :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i've ever played. It's soo good that even with the bugs that makes you ctrl, alt, del every few hours I still play it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the greatest RPGs ever made. Paired with the Restored Content Mod, you get an absolutely amazing experience combined with some of the best writing and characters the genre has to offer. The graphics are a bit dated, but do little to detract from the overall greatness of the game.",
            "review_score": "1"
        },
        {
            "review_text": "best star wars game",
            "review_score": "1"
        },
        {
            "review_text": "Classic.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe the gigantic 'STAR WARS' and 'II' will serve as competent warnings for those of you not into the Lucas giant, I'm going to give you an additional warning: Knights of the Old Republic II (KOTOR II) is not worth it for anyone unwilling to journey to the dingy depths of a storied and scarred franchise. If you are brave enough to put up with the absurdity, then continue with the review.  KOTOR II was released as a severely unpolished and unfinished game following the release/success of KOTOR I. The sequel lacked a coherent ending, many of the quest lines vanished into bleak nothingness, and the game was riddled with technical mishaps. The story it told, however, was one of the most mature and horrifying side stories ever told in the Star Wars universe. Whereas everything post-prequels in Star Wars attempted to paint the universe as bright, full of raging emotion, and cataclysmic battles, KOTOR II provided the dead hulk of a galaxy that lacked any of that vibrancy. KOTOR I was a radiant beacon of hope compared to how sordid the affairs of KOTOR II are, and it's so valuable as a result.   Here is a product that tells exactly how dirty a civilization can get; how terrified a people can be; and more to the point, it presents a beloved franchise as a vulnerable, almost derelict enterprise. A few quick google searches can net you the proper mod scene to install some of the unfinished content, but even viewing the game in its naked, broken state will get you the proper experience.",
            "review_score": "1"
        },
        {
            "review_text": "You call that an ending? WTF!?! I mean come on. I spent all that time investing in my companions learning about who they are and for what? I love both kotor games but this left me with the same feeling as mass effect 3. Ok not quite that but it felt like they just stopped with the story. Did a resolution occur cause it ended so abruptly I couldn't even tell.",
            "review_score": "-1"
        },
        {
            "review_text": "The best story ever told in the Star Wars universe. Star Wars is at its best when its story is dark. It expands on the gameplay of the first Knights of the Old Republic and scrutinizes the simplistic morality of the Force. The characters are more compelling and the story is much more nuanced, it evokes the same kind of feelings as The Empire Strikes Back but with a more self contained plot. Unfortunately the game was rushed out before it was completed so it has some rough edges and a large amount of character driven elements were never fully implimented. I recommend you play it with the Kotor II restoration mod - a fan made mod that adds back in a large amount of material that didn't make it to release. Create your Jedi exile and build their abilities and detailed personality along the course of a grand adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent storyline and gameplay. The faction modifier for lightside and darkside makes this game replayable several times. The graphics and sound effects are above and beyond for the Star Wars sensation. I felt like an actual Jedi on lightside run through. I will replay as a darkside character and am looking forward to being a menace in the game. Character development is good from the standpoint of modifying your faction as you play but the initial development is a little dry. I would have enjoyed more flexibility with the appearance of the character but for the year it was released I think it is well within the expectations. Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Says I have 44 hours recorded into this game, Closer to 440. had it on disc and it broke so re-bought it on steam, and I would buy it again. Can be buggy and if you dont prep for certain situations you can get caught in a loop of dying, reloading and dying in exactly the same place but that is half the fun. This is my favourite game ever. If you love the Star Wars films and need to see the Star Wars universe in a different light play this game along with the original KOTOR. Quality.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but needs restored content mod.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the greatest video games ever made. If you like a good story, play it. If you like Star Wars, play it. Just make sure to download the restoration mod.",
            "review_score": "1"
        },
        {
            "review_text": "Peragus a lil glitchy but other then that is good",
            "review_score": "1"
        },
        {
            "review_text": "Best Star Wars game.  Yeah, there are some bugs but downloading a patch to fix them isn't rocket science. I rarely see bugs anymore. If your game is too buggy you should probably stop spamming every single mod on the steam workshop. If you already did just remove the game (make sure you remove the folder from the steamapps map and reinstall.",
            "review_score": "1"
        },
        {
            "review_text": "If you have not tried this game it is a must try. One of my all time favorites, made even better by the TSLRCM Mod and M4-78. This game is a classic for all Star Wars fans, if you haven't tried it, you're missing out.",
            "review_score": "1"
        },
        {
            "review_text": "FINALLY THIS ♥♥♥♥♥♥♥ GAME IS ON STEAM SO IT WILL RUN ON WINDOWS [XP OR LATER]!!!  Okay. Now that's out of my system: onto the actual game review.  First, the bad. The story is just okay. It's not bad, but it's not exactly rivetting, and it's downright boring the second time through. The inventory system is still held-over from Baldur's Gate and KOTOR 1. It's completely unmanageable without a notepad. If you're following the chronology of Bioware games, this won't be fixed until Mass Effect 2, and it gets worse before it gets better. The fact that you can make any character a Jedi is cool, but it makes any levels taken before that absolutely worthless. Once you can use a lightsaber, even owning anything else is just stupid.  Now the good. The story is pretty okay. It doesn't have great re-watchability, but I did find myself caring about it the first time through. For the second playthrough, it's a serious chore to skip through all the extensive dialog. The fact that you can make any character a Jedi is really cool. Gameplay-wise, it's a little hokey, but story-wise it's really neat. And let's face it, lightsabers kick ♥♥♥.  This is a pretty good execution of the Dungeons &amp; Dragons/Star Wars d20 system. It's far more playable than Baldur's Gate 2 (in my opinion), and much more fun than Neverwinter Nights (again, that's just imho).  The AI. Hmm. What can I say? Like much of this game, it's okay. You can absolutely just keep track of one character and let the rest do what they want, and you'll be okay. But if you pause every round and issue specific orders to each character, you'll be done with battles a lot faster and probably live longer.  Overall, I like KOTOR 2 better than the first. I prefer the characters, I like that the interactions with your party members affects the game, and I like that any character can be apprenticed as a Jedi. It's also great that you choose an actual Jedi class right off the bat, rather than choosing a non-Jedi class initially, then having to essentially start a new character once you become a Jedi. But the story is very simplistic, the inventory system is still a mess and the graphics were mediocre even when the game was released.  So I give KOTOR 2 a B-. Objectively, I suppose it should be a little lower, but this is one of the Star Wars games from the golden age of Lucasarts, so I'm a bit biased.",
            "review_score": "1"
        },
        {
            "review_text": "Played this through for the second time. This is one of the quintessential Star Wars experiences. It's questioning of morality, challenging enemies, and outstanding RPG elements make it one of the best games ever made.   I especially like the writing of the character Kreia, her motives that drive the narrative are fresh and enthralling.  Love this game. Definitely worth any time you have.",
            "review_score": "1"
        },
        {
            "review_text": "You have not lived a good gamer life if you havent played these games. Amazing to me still now, played countless times. During my time these games were golden gems of the gaming world, the tip of the rog iceberg. If you love star wars, love choos8ng your path, love striking down your enemies with lightning, lasers, thermal detenators etc. you will love this game. No complaints from graphics. Oh qnd get this, these games can very very difficult and challenging, playing on highest difficulty and planning out an elaborate assault on my enemy is the best.",
            "review_score": "1"
        },
        {
            "review_text": "When I first played this game when it came out I already fell in love with it. The storyline is simply amazing, it keeps you on the edge of your seat. Back then the graphics where great and blew me away. The choices, the sides you can pick. If you love games like Mass Effect and Dragon Age, this is the same. Only with the force!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "More than 10 years later and this game is still the most interesting portrayal of the Star Wars universe, adding a much needed depth to the overall philosophy of the Jedi and Sith. Had this game been given more time to be fully developed it could have easily earned the distinction of being the greatest Star Wars game ever made. As it is, it's a flawed gem, even with the restored content mod.  The most enticing aspect of the game is the possibility to train your companions as Jedi. This proves to be crucial later on in the game as there are times when you'll be forced to split your group into two teams, each with their own leader. If you've dedicated time and care training the others, equipping them and leveling them properly, these sections will reward your efforts. Another improvement would be the addition of the Influence system. While in KotOR 1, building your relationship with your companions would only unlock new pieces of information about their past and perhaps a quest, in this game you can also manipulate them into adopting your worldview and principles, even turning them to the dark side.  Graphically, the game takes a couple of steps backwards compared to KotOR 1. The textures are shockingly low-res, which is especially baffling since several places (like Dantooine and Korriban) have been effectively copied and pasted from the previous game. Why couldn't they keep the original textures? I know Dantooine went through a bombardment, thus the new gray, lifeless look of the surroundings, but surely they could have done much better. Luckily this is another aspect that can be rectified with mods, though it does prove that the game was just not ready for release.  The writing is probably the best this franchise will ever get (unless Amy Hennig proves me wrong with Visceral's Star Wars, next year). Characters are multifaceted and are not quick to trust you with vital information, even in dire circumstances. I've mentioned how manipulation can be used to great effect and nowhere is this more apparent than in your interaction with Kreia, your character's mentor and arguably the best character of the now defunct EU. If you play your cards right (and I don't mean Pazaak) your back and forth with her can result in truly fascinating pieces of conversation.  Verdict: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "So, I love KOTOR I. I played it long long ago when it first came out at blockbuster, i played the hell out of it for the week that i had it. And never got a chance to finish it, so when the steam sale came out, i bought up the two and played them like hell. That's it for my credentials. (i'll do my best to not spoil anything from the first KOTOR or the second.)   As for KOTOR II, I have yet to finish the game, i'm about 10 hours in so far and its in my opinion a downgrade from the first. Yes there are a few new mechanics, however the majority of the game seems unnecissary, like 'why make this building so damn big with a ♥♥♥♥ load of different rooms, if in each room i get a single medpack or a part in each room'.   Also the plot line is a bit confusing, at the beginning you get told that you were once a jedi or something and that you're the last jedi in the galaxy. And it led me to believe 'oh ♥♥♥♥ so i'm the same character as the last game', however, after a few frustrating hours getting off pandarus and getting past the most ANNOYING HK dorid i've ever met and at least 20 walkthroughs, you realize that youre initial assumptions aren't exactly true.   This frustrates the hell out of me becasue it seems like they go out of their way to be mysterious and not let you know everything all at once, however, the mystery is a bit un needed. The beauty of the first KOTOR was the ending and how the ENTIRE plot got flipped, turnt upside down, without having to be too mysterious or not letting the player be out of the loop on what the hell was going on. Now it seems that the plot to KOTOR II is based on figuring out Just what the hell is going on with my own guy.   However, I may just have a bias to any sequal to one of my all time favorite games of my childhood. And I may be a pit nit picky when it comes to this game, but it just doesn't feel right to me. The small new mechanics that I assume they thought would make the game better and more intuitive seem to just be annoying to me. For example, when using a medpack you have to first select a medpack and then click on your face or someone elses face to use it, although it makes sense if you only level up one characters 'treat injury' skill, in the middle of a battle i want to just spam click a medpack and not have to pause the game to make two different imputs.   All this is my opinion of course, and i'm not even finished with the game yet. However, I don't know if I even want to finish this one by the way i feel about it already. As frustrating as it is i may have to let this one go and leave my memory of the KOTORs to the first one.   If you read all that, Thanks for reading. If you're not reading this.. then you're probably a smart person who doesn't have time to read someone's opinion on a game no one really plays anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "Obsidian, as always, did a knockout job with KOTOR 2. And with the completion mod fleshing out all the plotholes created by Lucas Arts forcing the game out early, and the Windows 10 support this game is vastly superior to KOTOR 1 on modern machines. A *must* if you are looking for a star wars RPG.",
            "review_score": "1"
        },
        {
            "review_text": "Great RPG and an even better Star Wars game. Altough you need the Restored Content mod (which you can find in the Workshop) because otherwise the game sucks because it was rushed by the developer.  7/10 would be an 9/10 if it wouldn't have such an anticlimatic and unfished story.",
            "review_score": "1"
        },
        {
            "review_text": "The sequel to possibly the greatest RPG (let alone Star Wars game) of all time- Star Wars: Knights of the Old Republic 2 - The Sith Lords. How does it fare?  Amazingly. Thanks to the recent update to the game introducing achievements, steam cloud, and steamOS play, many more people can play (and enjoy) this game.  I guess to start, we should start WITH the start. The graphics. They are the same as KOTOR (1). This can go either way with people. Some dislike them, some don't. I don't have a problem with them. They haven't held up as well as other games from that time, but they are easily passable.  The story - It is great. It is MUCH darker than the original. Delves into MANY different themes. (Possibly a spoiler, be warned) Instead of searching for Star Maps (objects, still cool though), you search for lost Jedi Masters in this game. Much better idea in my opinion.This is also a much more emotional storyline. there was one moment in particular (after traveling to each of the four planets) that left a tear in my eye. Love all the characters (especially the returning ones ...HK-47, Canderous, T3-M4 :D) Love the new Sith lords. My only gripe with the story is that the ending is anti-climactic and feels a little rushed (after all, the game came out a YEAR after KOTOR).   Content - A lot was cut from this game (as most fans know). That doesn't mean there isn't a lot. There is (in my first run) almost the exact playtime of the first run of KOTOR (1). I had about 34 hours into KOTOR 2 first run and I didn't do ALL of the sidequests like last time. I had about 36-37 hours into KOTOR first run. Poyfect.   Music - It's a Star Wars game so ... Tenouttaten  Misc. (Gushfest)-  This game left me with a good feeling when I beat it. The reunion with HK-47 being even MEANER was awesome ... I didn't feel like the Sith lords were as important as they were made out to be since you see them about twice each. Still badasses, though. Is it better than KOTOR? No. Does it get damn close? Yes, Some may argue with that, but it's just my opinion. Also, it is an RPG ... So plan your schedule, haha. Takes a lot outta you when you play through either of these games (in a good way)   Rate - Perhaps I still need the game to sink in a little bit, but either way AS OF TODAY - 8.5-9/10      GET IT      P.S. It is fairly buggy and glitchy, but it's not Sonic '06. Not too bad.",
            "review_score": "1"
        },
        {
            "review_text": "A must-play, classic Star Wars RPG. With recent updates, this game has breathed new life. This is definitely a must-have game for any Star Wars fan.",
            "review_score": "1"
        },
        {
            "review_text": "Both this game, and the first one, are amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Massive technical upgrades from the first game, however the story is pretty choppy and lacks sense unless you install the restored content.  Pros: Fun game, lots of force powers, lots of class customization, light sabers Cons: Chopped up story, annoying companions, obvious plot 'twists', not well written  overall 6/10  with restored content 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Remmmber playing on the orginal xbox amazing game would reccmoned lots pf options and things to do love the unoffical patch too.",
            "review_score": "1"
        },
        {
            "review_text": "A now much older game, KOTOR 2 is a great follow up to the original in the series. The game suffers from some poor pacing but does a fantastic job with the story and character developments if you give it time. It's a shame the game was rushed towards the end of the game though. You can REALLY tell they didn't have time to finish the game, laughably so.  If you don't mind venturing back to an older RPG, I definitely recommend this. Though, you might want to play the original first.",
            "review_score": "1"
        },
        {
            "review_text": "Buggy but not bad for $9.99",
            "review_score": "1"
        },
        {
            "review_text": "If you love the first Kotor then you will love this game but to enjoy it even more download the Restore Content Mod. I restores the cut content that is located in the games code and make the story 10X better. Plus its Star Wars and what more do you need?",
            "review_score": "1"
        },
        {
            "review_text": "This game is great with the restored content mod ,without it it's a buggy and broken mess.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game as a kid on my dads old E machine bought again recently and have already started on my second play through. Def a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best games I've ever played. Funny how much you miss when you do your first playthrough as a 15 year old and come back to it 10 years later.",
            "review_score": "1"
        },
        {
            "review_text": "Best of KOTOR games :)  Need some patch (workshop ) but with the updates... fakking awesome :D",
            "review_score": "1"
        },
        {
            "review_text": "This might be the best poorly-made game ever.  Mechanically and functionally, this game is a piece of ♥♥♥♥ that should never have seen the light of day until it had another six-to-twelve months of development under its belt. It is far worse than the game it is a sequel to in terms of gameplay and functionality, which is frankly kind of pathetic. It got a rushed release, and by god does it show.  But if you can get past that, it is dark, it is clever, and it will surprise you and keep you guessing at every turn. If it's better than the original KotOR is up to your personal judgement, but it leaves you with a hell of a lot more to think about.  I have trouble recommending it, but I do think that it is worthwhile to download the Restored Content Patch off of the Workshop and give this one a go. Just lower your expectations on the polish, because it doesn't have much of any.",
            "review_score": "1"
        },
        {
            "review_text": "I finally finished downloading this game and it wont even load i cant even tell you how ♥♥♥♥♥♥ I am. I just found out about this game I was in love with the first one so i was like ill buy this one too but its just a big dissapointment and Ill make sure to tell my friends not to spend money on this game. If you can fix it then i would change my mind",
            "review_score": "-1"
        },
        {
            "review_text": "This is what the films should have been like.",
            "review_score": "1"
        },
        {
            "review_text": "Hard Controls couldn't figure out the firste level just horrible and i dunno how to refund or if u can!!?!?!???! ",
            "review_score": "-1"
        },
        {
            "review_text": "Best Star Wars game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game as anyone besides Jedi Jesus is completely wrong.  It's taken me 101 ingame hours to accomplish my task and I feel excellent for it.  Seriously no other character makes as much sense as the Jedi Jesus play through.  ",
            "review_score": "1"
        },
        {
            "review_text": "KOTOR2 is what you get when you take the Star Wars IP and give it to the team that made Planescape: Torment. It's Star Wars viewed through a dark fantasy lens, and it's one of the finest CRPGs ever made, with a campaign that gets very meta about basic gaming mechanics and builds on a fundamental contradiction of the franchise's mythos: how can the Jedi and Sith philosophies be so diametrically opposed, and yet both work equally well?  Alas, it wasn't finished. But now, with Steam Workshop integration, adding the missing content (or a decent approximation of the missing content at least) is easier than ever. A must-play for any RPG fan.",
            "review_score": "1"
        },
        {
            "review_text": "A must for every Star Wars fan!",
            "review_score": "1"
        },
        {
            "review_text": "Even when rushed, it's still one of the best RPGs ever made. Never has a game made long periods of dialogue so entertaining. The characters are complex, their agendas are facsinating, plus HK and Atton are pretty hilarious. The villians are badass. The only downside is that the game has some pacing issues, and the ending is a pretty big let down. But as Kreia says herself 'It is not the destination that matters, it is the journey'.  P.S. Play this with the restoration mod install, it adds a lot more to the game and makes it feel much more complete.",
            "review_score": "1"
        },
        {
            "review_text": "Just as amazing as I remember! I really hope both KOTOR games do end up getting rereleased on PS4 and XB1!",
            "review_score": "1"
        },
        {
            "review_text": "The game has horrendous compatibility issues, but once corrected, it is quite fun to play.  You will need to run your game in windowed mode by changing the .ini file to allow it or your game will lose mouse and keyboard functioning after cutscenes.",
            "review_score": "1"
        },
        {
            "review_text": "Very different from the first KOTOR, but a nice shift in perspective. I see the seeds of Mass Effect 2 all over in this game.",
            "review_score": "1"
        },
        {
            "review_text": "best game i love it need more mods and 73/75",
            "review_score": "1"
        },
        {
            "review_text": "Great expirence not much else can be said, If people are complaining about giltchs I just want them to know that I'm running this on a mac and it's fine so it's not the game",
            "review_score": "1"
        },
        {
            "review_text": "honestly this game is fine as a whole, it just starts out slow.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play for an old xbox game.",
            "review_score": "1"
        },
        {
            "review_text": "Im not sure if I prefer this over the original in terms of story, or gameplay which adds upon KOTOR's template, but KOTOR 2 is without a doubt the better PC port and DEFINATELY a good game in its own right.  I remember playing this back on the original Xbox and it being one of my favourite games at the time, now with added Steam Workshop content, specifically the Restored Content mod, it certainly makes for an interesting comparison. Im recommending this game for any fan of Star Wars and people who have played this game previously, but without a decent KOTOR I port im not sure if I can so easily recommend it to new players who havent experienced the first game, its not unplayable on PC but in my experience the bugs distrupted the flow of the game and become annoying quickly (played KOTOR 2 with restored content so not sure how buggy the experience is without, but wasnt bug free with it that said I didnt have any bugs that directly impacted gameplay).  As the game stands now my overall score is: 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is better than eating dorritos and drinking mountain dew.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPGs to date and my favorite IP that vastly expands on the Star Wars Universe",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played, and definitely one of the best story based games I've played. It's best played with the Restored Content mod from the Workshop.",
            "review_score": "1"
        },
        {
            "review_text": "Roughly five years ago, I got my hands on the first Knights of the Old Republic, which also happened to be my first introduction into the RPG genre of gaming. That game gave me such a wonderful experience and didn't think any other game could capture the atmosphere and great story I experienced, considering I was and still am, a huge Star Wars fan. However, at the time, when I looked up Knights of the Old Republic II: The Sith Lords, the overall opinion from the gaming community was to avoid this unfinished, rushed, and bug-ridden game. Years later, I come across an article stating how a dedicated community of modders bravely took on the challenge to restore a great number of content left out of the vanilla game. It is thanks to the people behind the Restored Content Mod (also known as the TSLRCM) that I was able to sink my teeth into this highly anticipated sequel nearly forgotten. Knights of the Old Republic II: The Sith Lords does several things right. For one, the interface feels more intuitive to use and arguably a sharper UI design compared to the first game’s UI. Beyond some minor UI tweaks, however, what truly shines are the companions, and the significance of your main character. I will not spoil anything here, but what I will say is that for the most part, many of your companions have this sense of layered depth. They have flaws, they have hidden and traumatic pasts, they have regrets, they have strengths, humor, and usually comment on what your main character does when applicable. It’s not to say the first KOTOR didn’t have great characters because it certainly did, but KOTOR II definitely has the leg up with the introduction of the Influence System.  The Influence System adds an additional layer to the game by allowing you to experience consequences whenever you interact with your companions when it comes to the dialogue you choose as well the decisions you make. This gameplay element makes multiple playthroughs quite appealing, as you choose which companions(s) to focus more over the others, as it’s difficult to cater to all your companions on one playthrough, not to mention the obvious Light and Darkside paths to explore.  It should be of note that KOTOR II offers a less thrilling Star Wars experience, and instead offers a more personal and critical view on the Force, the Jedi, Sith, and on your actual character as well. Personally, as a Star Wars fan, I found this change of atmosphere completely engaging. Chris Avellone, the lead writer/developer, wasn’t initially blinded by personal attachment to Star Wars; an outsider’s take on the franchise we know and love, gave us fans an unique and fresh perspective rarely explored in the main movies.  I am conflicted how to properly review this game without mentioning the ending. It does still suffer from being rushed and not fully realized due to limited information and resources about how it should have had ended. Yet, oddly enough, I was not bothered by the way it ended, to a degree. For instance, I personally think the conclusion ends on a somber, yet somewhat satisfying note if I chose the Lightside. I knew what my character was going to do, and basically made more sense story wise. However, on the Darkside, it definitely feels much to be desired and I am not impressed of how it ends. This is overall a difficult subject to review, as it tends to be highly polarizing among gamers, understandably. If nothing else, I still highly recommend this game simply because the actual meat of the game, its characters and fresh take on the Star Wars universe, makes this game stand out and arguably more compelling than its predecessor. It ultimately comes down to what you want out of a Star Wars game; an epic heroic (or villainy) adventure full of badass moments, or do you mind a more personal, character-centric, “all about the journey and not the destination” type of story?",
            "review_score": "1"
        },
        {
            "review_text": "Without the TSLRCM mod I'd give this a 3/10 it's essentially broken without it. I had two campaigns break, it's as buggy as all hell.   With TSLRCM it's an amazing game. Seriosuly surprised by just how good this game is. I never played it back in the day, that was a mistake. I loved the story and characters, the combat is aged but still enjoyable. If you're an RPG fan and haven't played it go buy it. ",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game that doesn't require the play of its predecessor but it's highly recommended you play it. Whatever the asking price it's worth it and will contain many hours that'll make that, assumably, $10 price tag worth it.  For a game that came out in 2004 it runs better on windows 8/10 with less bugs than FO3 or most modern Bethesda games. I may love Beth but I'll be damned if I ever played a game of theirs that wasn't buggier than a D- health rated restaurant. All of the hours I've put into it I have not experienced a single bug, crash, glitch, or what have you.",
            "review_score": "1"
        },
        {
            "review_text": "Say it after me kids: the Bioware MMO isn't canon, the Bioware MMO isn't canon, the Bioware MMO isn't canon  Now that I got that out of the way, I can confidently say that this game (along with it's prequel) is probably one of the best (if not THE best) pieces of EU lore for star wars ever written.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the first, you'll like this one. Just avoid the gamebreaking bugs OR use the Steam workshop to get fixes. The addition of steam workshop adds a lot of value to an already great game. The ending is a bit incomplete, but it's not a cliffhanger or disaster by any measure. This is pretty contemplative by Star Wars standards too. Very strong characters and if you like the concept of the Force you'll love a lot of the dialog. Holds up well in spite of the bugs.",
            "review_score": "1"
        },
        {
            "review_text": "As a sequal to one of the best games ever made, I went into this game with understandably high expectations. The game delivered in an exceptional way, and though a bit buggy, was a lot of fun. The storyline itself is a bit less engaging than the original, but it does have some very interesting connections and it's great to see the general consiquences of your actions from the first game. If you do purchase, I strongly reccommend the Restored Content Mod for bug fixes and an overall enhanced gameplay experience.",
            "review_score": "1"
        },
        {
            "review_text": "*waves hand* This is the game you're looking for  This may be an old game but it's still my favorite.  If you're looking for a game with solid story and don't mind installing a couple of mods to get it the way it should be *cough* (Restored Content Mod) then this is a worthwhile purchase at ten times the price. I really can't put into words just how much I enjoy this game. If you're on the fence for whatever reason, visit /r/kotor on Reddit, and someone more eloquent than I will explain it to you.  If you don't play games for the story... this is the wrong game for you. The combat can be a little clunky, and the graphics are dated (even with the mods to improve them). But seriously. The story it awesome. You should try playing games for the story.",
            "review_score": "1"
        },
        {
            "review_text": "Positives: +good characters +Good variety of villains that are very dark compared to the villains of Kotor 1. +They remastered it to run properly on modern PCs and also added achievment support +Restored content mod puts all of the cut content in the game. If you weren't aware LucasArts forced Kotor 2 to be rushed out the door so Obsidian had to cut a bunch of stuff to meet the deadline. This mod fixes that issue. Negatives: -The villains are so evil to the point where i don't feel tempted to join the dark side. The point of the dark side is that it's supposed to be tempting and that it can influence you. But the dark side is too evil in this game to the point where i don't feel tempted by it. -The Characters aren't as likable or relatable as they were in Kotor 1.  Score 9/10: This game is great and i highly recommend it to anyone into RPGs or Star Wars. Kotor 2 isn't canon anymore but it's still the best Star Wars game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR Knights of the Old Republic 2 (TSL) takes leaps and adds depth to the story that make the story surprisingly fulfilling and interesting. The mod community for this game is strong and takes the game from great to excellent, especially if you don't mind visiting non-Steam sites for more mods and have a bit of know how.  (Full Version) When I played Knights of the Old Republic 1, I found a game with excellent story telling with a classic Star Wars tale with decisions and twists. The combat aesthetically looked like a nice mix of EP:4-6 simplicity and 1-3 finesse along with a variety of styles, force powers, and companions. While KOTOR 1 was very strong, I was just a bit unsatisfied. It was a Star Wars game no doubt, but the story, while strong, didn't take very many risks that I hadn't seen before.  I wondered how KOTOR could be topped, but Obsidian responded in force with KOTOR 2. I'll break down my review into specific sections for comparison.  Story: KOTOR 2 brings a fantastic interpretation of the struggle in the Star Wars Universe with brilliantly intertwining storytelling and companion interactions. It causes the player to ponder the nature of the force itself as they adventure through a galaxy only a few years after KOTOR 1.   The player is an exiled Jedi after the Mandalorian Wars. The game is about 5 years after KOTOR 1, and the galaxy has been affected drastically. The republic is weak and the Jedi are missing. The player must go on a journey to seek out the Jedi before the Sith can get them first.   Story:(cont.) The companions in the game are excellent. I personally enjoy the companions in KOTOR 2 more than 1, since there is no companion I dislike. The influence system adds a new system of depth to dialogue that I feel surpasses the 'kill some people, walk around, now X wants to talk about something' system of 1. Companions react to your choices, or even a stray sentence. The story also causes the player to ponder the nature of the force. What is light and what is dark?  Combat/level system: The combat in KOTOR 2 is nearly identical to it's predecessor in being an animated turn based combat that feels like Real time. However, KOTOR 2 adds more feats, powers, and items than the previous game, adding more choice to how the player builds their combat style. The game also introduces force prestige classes to further add to your choices as a Force Sensitive. This combined with the diverse companions makes for a surprisingly entertaining and aesthetically pleasing combat system.  Graphics: KOTOR 2 has graphics surprisingly good for the Xbox Era. The Jedi Robes in this games are animated unlike KOTOR 1 and have flowing outer robes that flop around based on the player's motions. Some hair strands also move based on the player's head motions. These are surprisingly nice details for a game over a decade old. ALSO, the support for the game in modern times has led to the textures being updated to a higher quality, making the game overall look much more crisp while still maintaining the nostalgic 2005 polygon count. If you are looking for photorealistic, this is the wrong game for you, but graphics aren't everything. The games core art style is more than sufficient to keep my eyes interested as well as my mind.  Controls: The controls are easy enough, most of the game can be done with mouse usage or key usage depending on preference. All keybindings are adjustable in game. The targeting system and player to opponent mapping are sometimes mediocre, but are only minor hitches that are from age and coding rather than shoddy production.  Satisfaction; I'm very pleased with my purchase. KOTOR 2 is a worthy buy for any Star Wars fan, be it a person seeking action or seeking an immersive story. You will likely only dislike this game if you get a significant bug(s), dislike adventure RPGs, or Star Wars. I find the game to be a strong choice, worthy as a successor to KOTOR 1. Unfortunately, it's age and rushed release (thanks Lucasarts) show.  Recommendation: Get involved in the modding community. Mods add so much potential content to this game and answer some of the questions. Some would argue that the TSLRCM is a necessity. It does answer some questions and restores the content to its full status. The game is still enjoyable without it however, and it might even be beneficial to do a playthrough without the restoration to get some context. If you can, TSLRCM will likely improve the experience, and thats just the beginning.  My opinion: 9/10 with no mods. Mods easily up it to a 10/10 experience.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever created. Completed the game over 30 times in my youth on original Xbox.",
            "review_score": "1"
        },
        {
            "review_text": "“Definition: 'Love' is making a shot to the knees of a target 120 kilometres away using an Aratech sniper rifle with a tri-light scope.  Statement: This definition, I am told, is subject to interpretation. Obviously, 'love' is a matter of odds. Not many meatbags could make such a shot, and strangely enough, not many meatbags would derive love from it. Yet for me, love is knowing your target, putting them in your targeting reticle, and together, achieving a singular purpose... against statistically long odds...”  11/10 Would learn how to love again.  ",
            "review_score": "1"
        },
        {
            "review_text": "Once you get past a few gamebreaking bugs it becomes as good as its predecessor, if not even better!",
            "review_score": "1"
        },
        {
            "review_text": "Definately a rushed game, get the the restoration patch from the workshop. Otherwise, the game is largely broken. That said, did you play KOTOR and wish you could have started as a jedi, instead of choosing some other class first? Did you want to stick your lightsaber in more people's businness? Did you want to fantasize about having more force powers and training people to become jedi? Did you want to train with someone, only to find out she'll only train without her armor on?  If you said yes to all of those but the last one, good news! KOTOR 2 exists, and it's great. If you said YES to the last one, you are a sad, creepy loner living in a basement.  My only complaint is that fullsize lightsabers are hard to come by. I ended up having four other jedi on my team, but not enough lightsabers for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Not quite as good as the first one but it is different. First one is more tailored to the Star Wars movie feels while the second one deals more with the galaxy itself. The first is very clearly a battle between good and evil, the growth and rise of a story. The second felt more episodic and while you are a Jedi it feels more like you are the back up smuggler child who deals more with Star Wars Mafia and corrupted politics than the evil Sith.  Still it is enjoyable but certainly did not rope me into caring about every single planet or scene. Despite that it still have very powerful scenes and plot lines that were quite enjoyable. If you're a strong Star Wars fan then I think you will certainly enjoy KOTOR2.",
            "review_score": "1"
        },
        {
            "review_text": "More complex story than the first one, but the whole game was rushed through development so, some bits of it weren't concluded.  Still, it's one of the most played Star Wars RPG's even after 10+ years and I'm still enjoying it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not going to lie, I didn't play the base version of the game, I used the expanded content mod which restores much of what was planned for the game, but wasn't released. So this review is counting the use of that mod.  The game is fantastic, it is harder than the original game, but it has been balanced in a way where there's a lot more chance to improve your character. The story is really interesting, and the weight of being either a jedi or sith is more felt than ever. The world is interesting and filled with great characters. Although the game is old it is designed in such a way that it still looks very pretty.   The only negatives I can find are that it has a few unfair moments (just like the first one) and that the ending of the game pretty much sucked. I it were not for the ending I would have liked it even more than the first one, but as it is I likr it just as much. Two of my favorite games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Love it still in 2016",
            "review_score": "1"
        },
        {
            "review_text": "A good sequel to KOTOR I. A bit different style of RPG's than most on the market today, and some older graphics but I enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "Just. Yes.   Also, mods make the game so much better.",
            "review_score": "1"
        },
        {
            "review_text": "Havent played it. Love star wars.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game for a very long time, beaten it at least 5 times. Everytime was better than the other. This game is only a few I will repetitively play. I recommend this game to all fans of Star Wars, new and old, to play this, and the first KOTOR. It is quite a trip",
            "review_score": "1"
        },
        {
            "review_text": "Apathy is death",
            "review_score": "1"
        },
        {
            "review_text": "I think I have some sort of fetish for unfinished games.",
            "review_score": "1"
        },
        {
            "review_text": "Somehow takes me 17 hours just to get off the first planet.  This is in part,because the first character I made sucked so bad after sinking a few hours into them....Doesn't help that the annoying part of the game (Aka peragus mining facility) takes roughly 2 hours if your looking for all the loot atleast if your like me and search every nook and cranny in rpgs for loot and story.  I feel pretty ashamed,but this game is very much worth the price that it is even for an older game.Because,this is one of the better rpgs imo.",
            "review_score": "1"
        },
        {
            "review_text": "star wars rpg + obsidian = game that can't go wrong.  :)",
            "review_score": "1"
        },
        {
            "review_text": "Cool sequel with the usual quality you'd expect from a Obsidian-Bioware partnership, but I can't help to admit Kotor 1 still has the crown of best SW game ever made.  A Solid 9 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest Star Wars game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Even after all these years its still solid. Sure there are bugs, even game breaking bugs that make you have to go back to previous saves to fix them, but it's still a solid game. If you're looking for a StarWars game thats story rich and feels real satisfying then this is the right choice... But start with the first one though, adds alot more to the story than if you dive right into this one.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorites, without mods a great experience and with mods even better Much better than the original, more interesting places and characters The exile truly becomes your character, not a character premade like in the original with Revan",
            "review_score": "1"
        },
        {
            "review_text": "The game the original Xbox Thompson drive could not handle. It is nice to make a playthrough on my computer without having to wait 5 min for every loading screen while my Xbox makes terrible noises. You should play the first game as well as it adds to the story and you get to see and hear some familiar things. I love the UI improvements they made to this from the first KotOR. The combat is much more challenging once you pass level 30 or so as the enemies scale with you. I love Star Wars games, KotOR 1 and 2 are must haves. Story, gameplay, music, voice acting, and graphics (for the time), are amzing. Trying to go full light-side is too hard as some choices you can not pass up, like beating up the reporter in ME3.   You should buy this game, why? Force lightning...",
            "review_score": "1"
        },
        {
            "review_text": "Best Star wars franchise game ever. Hoping the remake plans work out.",
            "review_score": "1"
        },
        {
            "review_text": "A solid RPG and a solid Star Wars game, which unfortunately cannot be said about most of them that fall into those two categories, KOTOR 2 is a worthy succesor to KOTOR 1, with better graphics and more polished mechanics than its predecesor. The story and characters are rather well fleshed out and I'd recommend this game to any RPG fan, however, not without using the restoration mod and them being aware of that stupid bug which causes the game to crash if you don't untick fullscreen (Which still hasn't been fixed on Steam after all this time.).  P.S.  The Restoration Mod does fix that bug I mentioned up above.",
            "review_score": "1"
        },
        {
            "review_text": "A lot more wordy than the first game, but dives into parts of the Force that no other star wars IP has really ever looked at",
            "review_score": "1"
        },
        {
            "review_text": "I will never forget this game.",
            "review_score": "1"
        },
        {
            "review_text": "For many in the gaming community this game was an example of what could happen to a good game if it is rushed. At release this game was BEYOND BROKEN and at the time of it's release I could not recommend this game do to that. However times have changed. With the new patches this is one of the greatest Star Wars games of our generation.",
            "review_score": "1"
        },
        {
            "review_text": "Totally broken op!",
            "review_score": "1"
        },
        {
            "review_text": "Never gets old. I enjoy playing this game as much now as I did when I installed it the first time!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, and with TSL restored content mod being integrated into the Steam version of the game, this is a must play!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best videogame stories ever told, and one of my favorites of all time.",
            "review_score": "1"
        },
        {
            "review_text": "this game is soooo awesome the only thing i dontt like is the problems of playing it in windows 10",
            "review_score": "1"
        },
        {
            "review_text": "Still awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely one of the best RPGs of all time, and by far the best Star Wars game ever made. Just as good and fun to play today as it was when it was first released.",
            "review_score": "1"
        },
        {
            "review_text": "Not new, but, very good and interesting game. Also, I recommend checking tslrcm project, it significantly extends the game",
            "review_score": "1"
        },
        {
            "review_text": "Unlike swkor 1, this game works really well ony my modern computer. There are none of the numerous bugs noted in the first game, and many of the intial problems have been ironed out. If you like this era of RPGs, then this is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike swkor 1, this game works really well ony my modern computer. There are none of the numerous bugs noted in the first game, and many of the intial problems have been ironed out. If you like this era of RPGs, then this is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Most confused I've ever been playing a Star Wars game.  Solid 9/10 with TSLRCM",
            "review_score": "1"
        },
        {
            "review_text": "TSL has many flaws. Peragus can be long and tedious for a first-time player, the game's difficulty bottoms out the farther you go, playing as your companions can get dicey if you haven't been giving them good gear, by the end of the game you have a surfeit of powerful artifacts and more money than god, but, really, all these are incidental. The gameplay is entertaining enough that it manages to fulfill its primary purpose: smoothly ferrying the player from conversation to conversation, from cutscene to cutscene, allowing one to enjoy the unique, atmospheric setting and complex characters. Welcome to a story situated in the Star Wars universe where the battle of good and evil is divorced from the battle between Jedi and Sith, where the fatalistic viewpoint of the Force is brought into question, and where the overarching plot is subtly driven by the inner conflicts of the main character.  (Get TSLRCM, the restored content mod, or the game will be much worse.)",
            "review_score": "1"
        },
        {
            "review_text": "Better than KOTOR I in every way possible  would recommend to everyone who played the first one",
            "review_score": "1"
        },
        {
            "review_text": "Great game, murder some people, help no one. The true jedi way.",
            "review_score": "1"
        },
        {
            "review_text": "Nominate for the TEST OF TIME award, If you've played this gaem then you understand why I nominate it",
            "review_score": "1"
        },
        {
            "review_text": "Nominate for the TEST OF TIME award, If you've played this gaem then you understand why I nominate it",
            "review_score": "1"
        },
        {
            "review_text": "As many others have probably said, this game is pretty different for a Star Wars game. Instead of treading some of that old ground I would also like to point out the following, from other people's reactions and my impressions of the game:  This is almost like a Star Wars Horror game, the villains are amazing and overwhelming in this cosmic tapestry of darkness. Darth Nihilus is one of the best sith lords I have ever seen, because he is truly terrifying in both concept and design.   If there was to be a Star Wars movie adaptation, aside from an Obi-Wan spin off that everyone wants, this would be the story to go with.   Kotor 2: The Sith Lords, I bought it for under $4, I think the story is absolutely worth more than this, however, the older style of gameplay may be a hurdle for some. If you find the game too hard, please just put it on easy as half of the game is great story choices anyway - the combat system is good for those who like that kind of thing I'm sure, but I am recommending this game for the story as I am very story focused as a player.   Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "EASY choice of the test of time award",
            "review_score": "1"
        },
        {
            "review_text": "One of the best plots in the history of video games",
            "review_score": "1"
        },
        {
            "review_text": "Already played this game 7 times. Best star wars ever.",
            "review_score": "1"
        },
        {
            "review_text": "Great story and engaging play experience. Easily my favorite Star Wars game and near the top opf all the games I have played.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Storyrich Replay-ability  10/11",
            "review_score": "1"
        },
        {
            "review_text": "Just finished Peragus",
            "review_score": "1"
        },
        {
            "review_text": "This is what I call an awesome game. KOTOR and KOTOR II are in the big leagues regarding not only RPGs but all games. Together with Chrono Trigger and FF VI are IMHO some of the best games in history.",
            "review_score": "1"
        },
        {
            "review_text": "The game is even better with the restored content mod. I hope the first KOTOR receives the same support. KOTOR1 and KOTOR2 are the best Star Wars RPG out there! Go try it!",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing through this game twice a year since release.  Why?  Playing this game feels like what it would be like if the force, the Jedi, and the Sith existed. In the movies they portray the Light and Dark so... blandly. These are GOOD guys, these are BAD guys.   This game explores the Force, the Sith and the Jedi on a philosophical level.   It has some of the best character writing you will ever see in a video game. Your companions FEEL real. They have reasons they behave the way they do. They react convincingly to your influence, whether it be gentle probing or cold interrogation.   You will set out on a journey of exploration. Of people. Of PTSD. Of manipulation. Of the Light. Of the Dark. Of the places in between. Of yourself.   I've only touched the surface of why this game is amazing. I could go on for hours. I have. This is the only game I can legitimately say changed me as a person. It made me really think when I was young, and as I got older there was always more to discover. Some nuance I missed, or now see in a new light. I cannot recommend this game enough.  Thank you Obsidian, and thank you Chris Avellone.",
            "review_score": "1"
        },
        {
            "review_text": "It is truly an outstanding game for those great times. During my lovely childhood I've played it so hard, i even lost my count. The choices and possible scenarios are endless, it's almost impossible to beat it 100% clear in one playthrough, everytime you have to abaddon one thing for the sake of another and that fact will make you play it over 9000 times for getting all possible routes, again and again. And yeah, it's worth it.  The plot is vast, it's just like a cool book with tonns of unraveled mysteries that will never end. The characters of the Old Republic (1st and 2nd) by far the best i've ever seen in RPG games. I mean, just look at the date! The game is 'not new', and most of RPG standards were dictated by it long time ago. That game is such a precious thing, you simply cannot ignore. Things will become even more tasty, if you download deleted content from workshop.  Recommend both parts as a big fan of Star Wars universe and RPG lover.  P.S. For more information check Wookiepedia.  P.S.S. Waiting for HD versions of both parts and the 3rd part.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of people disrespect this game for not being as good as KOTOR I.  You know what? It's still a very enjoyable game; yes it is a little incomplete because it was forced out before the developers could finish it, but it's still playable to the end.  Lastly, I have a controversial opinion: I enjoyed the story of this game more than KOTOR 1.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game without any mods or cheats, and for the most part it worked and was a great experience. I did not have issues that some others have reported with broken mechanics or cut scenes. However, what ruined this game completely was the incredibley rushed ending that left too many unanswered questions. It felt like an incomplete game. The story, though not as good as the first game, was engaging enough, but I cannot recommend this game as it stands solely because of the unsatisfying and sloppy ending. All the developers needed to do was put in more time to develop a better way to close things off, but instead they chose the lazy route and cranked out an incomplete game that they never even bothered to patch (although I've read that they actually did patch it fairly recently, a decade after its release). I have no respect for this kind of rush-job and lack of respect for the consumer.",
            "review_score": "-1"
        },
        {
            "review_text": "If your a fan of rpg and amazing stories you wont go wrong with this game.",
            "review_score": "1"
        }
    ]
}