{
    "app_id": 208670,
    "name": "Blades of Time",
    "release_date": "2012-04-20",
    "developer": [
        "Gaijin Entertainment Corporation"
    ],
    "publisher": [
        "Gaijin Entertainment Corporation"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Female Protagonist",
        "Hack and Slash"
    ],
    "achievements": 35,
    "positive_ratings": 1363,
    "negative_ratings": 333,
    "price": 6.99,
    "description": "Ayumi, the gorgeous gun and sword-wielding treasure hunter, sets out on a journey to an ancient island in search of new adventures. While rich in bounty, the island is also filled with the magic of Chaos, being at the same time home to blood thirsty monsters.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/208670/header.jpg?t=1484241788",
    "minimum_requirements": "OS: Windows XP Processor: Intel Pentium 4 2.6GHz or AMD 3500+ Memory: 2 GB RAM Graphics: Ati Radeon x1300 256 MB or nVidia GeForce 7300 GS DirectX®: 9.0c Hard Drive: 3 GB HD space Sound: Direct X-compatible sound card Other Requirements: Broadband Internet connection",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core i5 or AMD Phenom Memory: 2 GB RAM Graphics: ATI Radeon 7750 or nVidia GTX 470 DirectX®: 9.0c Hard Drive: 3 GB HD space Sound: Direct X-compatible sound card Other Requirements: Broadband Internet connection",
    "reviews": [
        {
            "review_text": "In overall, everything about this game is awesome. Controls are smooth, gameplay is fast, decent graphics and sounds, the time-control spell makes this game particular. In my opinion, the story is a bit lame, but I do not really care, I forget it when I swing my swords in every directions :P. Collectibles are very easy to find during your walkthrought because maps are not that large, so no time wasted for that, just make sure to use compass. Great game to smash everything moving.",
            "review_score": "1"
        },
        {
            "review_text": "Fun action adventure that is deeper and more varied than it appears on the surface and has fun use of layered time to amplify combat power and solve problems.  Not sure worth $30 but I got in bundle cheap, worth it if on sale with good discount",
            "review_score": "1"
        },
        {
            "review_text": "Wow!!! Even by 2012 I thought it was impossible to innovate a hack and slash adventure game. I love the genre, but I just like the colors and combo strategy, I thought God of War covered the good stuff. And then I found this. Another lost gem that faded into non-existence because it's not a major AAA developer. Let me explain myself...  The best part about this is the time warp system. This is TOO FREAKING COOL! I'd suggest buying this game JUST to experience this mechanic. It's difficult to be innovative in modern gaming, so it's possible it had been done before and I just missed it, but either way it is incredibly fun. Basically you can reverse time in fairly short increments, but your 'past avatar' will still exist doing what you just did while your 'present avatar' is free to do whatever. You can make several of these avatars at once to fight alongside you or help you solve puzzles. It's a bit confusing at first, but once you get the hang of it you can't wait to use it again.   How it works is say you have a group of 3 enemies. You can take out your gun and blast away for 5 seconds at one of them while they charge you. Reverse 6 seconds. Your past avatar will now be there shooting at that same enemy. So now you have a few choices. You can use your present avatar to keep shooting at the same enemy, reverse time 6ish seconds again, shoot at that enemy, repeat however many times you want, and then suddenly have 5+ people blasting this enemy away in 2 seconds. Or you can use another avatar to shoot a second enemy, making them stumble or holding them back. Now you have 2+ avatars distracting two enemies, so you can charge in with your main avatar using swords and melee on the third. To top it off, after, say, 3 seconds of meleeing that third mob, you can reverse 4ish seconds, and now you'll have both your past and present avatar wailing away at this mob. Repeat however many times you want. You now effectively have 4+ warriors on the battlefield attacking at the same time, and even though the process took place over 20 seconds, once you reverse to the very start of the battle and continue time, all 3 mobs will drop dead in an instant.  It's awesome.  The next best thing are the puzzles. FINALLY I find another game with unique puzzles that actually make you think without being outrageously difficult just for the sake of being difficult. And it's none of the usual 'do this kind of puzzle once then use it a bunch more times.' Instead, they draw elements from previous puzzles but add a twist or two to keep it fresh. I still haven't beaten it, but as of now I've encountered 3 different 'types' of puzzles and each one has been expanded upon later in the 'level' to make it feel new. Well done.  The next best thing is the graphics. Graphics are normally the least of my worries and something I'll glance at, appreciate, and move on. But considering the time period and developer, this game is INCREDIBLE! It absolutely stands up to some of today's games but is beautifully optimized. It baffles me how a game from 2012 can look, and more importantly run, 1000% smoother than a game from 2015.  Third I'll go with the boss fights. Again, FINALLY a game that has unique bosses that, again, require you to think and stay focused. Not every single one, some are the typical slash away without getting hit, but others do require specific strategies. And hey the strategies aren't always necessary either. You CAN slash away at this boss for an incredibly difficult 20 minutes, but if you learn how to exploit weaknesses, you can take them down in a few attack runs.  Next would be the combat. Not the most innovative aspect of the game, but still a tried and true method that is just as fun as it always is. It starts off pretty generic, but once you start unlocking combos it exponentially increases the fun and some are unique enough to make Blades of Time stand out amongst its God of War and Dynasty Warrior peers. And this is where the time warp mechanic comes in. Just like I was saying with the puzzles, it takes an old mechanic and makes it new again. It's also a good balance between simple and difficult. You cannot just stand there and spam left mouse button. You will die. Though you don't necessarily have to be constantly in motion 100% of the time either...in a good way. You CAN be and it makes it that much more fun, but it isn't completely necessary, which I prefer. I like to jump around a bit and get in hits here and there, then wail away at a single enemy, then jump around a bit more.  However I'll finish off with the voice acting and story. To be fair I actually do enjoy the storyline. Maybe it's not pulitzer prize winning, but it is somewhat unique compared to most fantasy games. Unfortunately, as others have noted, the voice acting is horrendous. I actually laugh pretty much any time anyone says anything because it feels so...fake and out of place. You can tell this is where they cut the budget from. If you've ever played an Oblivion or Skyrim mod where the creator did their own voice acting...it's kind of like that. Just awkward with mediocre writing where it's almost difficult to actually pay attention to what they're saying and not how they're saying it.  But overall I recommend this game to anyone who likes action games, and DEFINITELY anyone who loves hack and slash games. I am actually quite stingy with prices, so t's difficult to say if it's worth $25. I almost NEVER spend more than $15 on a game. Though $25 on Steam for a 4 year old game is somewhat of a testament to the game's quality. However if it's on sale under $15 I wouldn't even hesitate to add it to your cart. If that extra $10 isn't a big deal to your wallet, then yeah I'll definitely give the go ahead for $25.  Blades of Steel  8/10a  And if you're wondering, I actually got it in one of those '10 Premium Steam Keys' for $1.12 at a certain third party retailer site. I gotta say I got some pretty good games in those bundles, I'd say it's worth getting 1 or 2 if you're looking for something new to try.",
            "review_score": "1"
        },
        {
            "review_text": "3rd person, action, adventure, hack and slash game.  In this game you play as female warrior - treasure hunter. You are thrown into the game pretty much right after cinematic intro, with not much explanation on what happened before it. Game doesn't have that great of a story, but somewhat compensates with decent, challenging combat and easy on the eyes main heroine.  Visuals are average with not that great texture quality and effects. Voice acting is decent enough. Animation quality is not that great, and there is a lot of clipping, skewing and stretching in the combat animations. Level and environment design is good, though low resolution textures is an issue. Apart from that, game is fun little hack and slash experience, with addition to few magic spells and rewind time abillity.  Character customization available through melee and ranged weapons, costumes and miscellaneous jewelry items, that you get from chests you find. If it's cheap or on discount, get it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game great hack n slash with female player (she is pretty good)  pros +great story +graphic is pretty good +Ayumi (player) is nicely designed +good looking finishers and also its easy to fight  cons -using magic can be tricky and sometime complicated  looking overall game is pretty decent and worth a try (some players will say its not worth full prize but who knows we all got different taste)",
            "review_score": "1"
        },
        {
            "review_text": "i just play this game because of sexy butt thank you .",
            "review_score": "1"
        },
        {
            "review_text": "If you don't mind the many technical issues and the awful voice acting, you will enjoy this game.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "When I first started this game, I hated every character and loved the combat. I thought the story was incredibly stupid and I was kind of surprised a game like this even had a story. It's the kind of game where every female character looks like they just came out of a 14 year old boy's wet dream. Ayumi isn't even the worst offender of this!  Shockingly enough, the characters evolved such that I actually *liked* them- each main character received enough characterization to become real, likeable, *people*, rather than the walking videogame cliches they look like (ridiculously musclebound man, ridiculously over sexualized women). This astounded me; I was not expecting to have anything but contempt for the game's seemingly pathetic attempt at story. The main plot, too, evolves into something worthwhile. The biggest problem this game has is probably the fact that the story and characters are overwhelmingly generic for the first half of the game.... but it does metamorphose into something unique towards the end. Well, the characters do; the story is largely generic still but there are several key plot points that separate it from the rest.  Unfortunately what did not evolve over time was the combat. As far as I know there are no combos to learn besides the very limited set you start out with. One of the combos brings you up into the air as you swing your sword about wildly, *but there are never ever any enemies that will be in the air with you*. What ends up happening is a lengthy animation of you swinging your sword in the air for 5 seconds while all the enemies wait for you to return to the ground. This happens automatically when you jump and attack- so if you need to jump over to an enemy *quickly* and attack him, unless you're very careful you might accidentally start that useless combo and it will prevent you from doing time sensitive things (there is no way to stop once started). I feel like I missed out on a mechanic or two though- you can lock onto enemies and dash at them, but 90% of the time the game bugs out and the dash is in slow motion and you never even reach the enemy. Then I read something about hanging from enemies in midair and hitting them with your sword. Huh. The most I was ever able to do was slide off them like they were covered in motor oil. You gain the ability to use fire, ice and generic projectiles very early on and then (with one exception) from there on out, all upgrades are minor and passive (for example, you might gain the ability to do more damage by using fire on someone who is frozen. No expanded gameplay, just ways to optimize damage). I started out really loving the combat, but it gets very old very fast. And it's very buggy. The entire game is buggy actually. Luckily you can usually fix everything by reloading the last checkpoint, but if your checkpoint is before a particularly challenging battle, that can be frustrating.  Another major problem with this game is there are too many different mechanics. It feels like I'm playing a very long demo of hundreds of different games. Yes, the combat is boring, but constantly changing the rules of the world is not the way to fix that. At one point you gain wings and can fly, and I don't even think it is explained... then you lose your wings shortly after, also unexplained. I found out by jumping off a cliff and falling to my death. At one point you are given a gun which you are required to use; if you kill the enemies without the gun, they keep regenerating indefinitely, and this is *not explained*. It was pretty obvious I had to use the gun to kill them, but I couldn't quite figure out how, and I couldn't proceed by killing them normally. The biggest problem was the stupid jump combo- you had to freeze the enemy with the gun, then drop the gun and hit them before they thawed, except I would always activate that useless combo and never get to them in time. The time rewind itself is also problematic. For example, the ability is not explained at all. You are told that you have it, then you need to figure out how it works, which is a process that will take the rest of the game. But the game arbitrarily changes the way it works and often doesn't even let you use it! How can you learn to use it if it keeps alternating between different rule sets and often isn't even available to use? So far what I *think* happens with the standard set of rules is; any time clones of you will disappear if the main you alters enough variables in the past. So if you go back in time and get an enemy to follow the current you instead of the past you, the past you just disappears. Which is a problem because most of the time the point of time rewind is to distract enemies- but they mostly seem interested in *you*, not your past clones, which makes them all vanish, which makes the game frustrating. OK, so I understand that, I'll try to use it against this boss now that I'm a little better with it. Oh wait, you can't. Why? Because. Time rewind is not available to you for nearly *every single boss*. Then, some of the larger enemies require that you use it, but the way it works is completely different for those enemies. In one case- there's a quick time event which you need to do twice at the same time. Cool right? Not really. You do it once, you rewind time and if you don't press the button *immediately*, you lost your shot at it and you need to spend 5 more minutes weakening the enemy again. To reiterate- you can't just go back in time and wait for the opportunity to use the quick time event going forward in time, you have to hit the quick time event whilst going backwards in time.. because for some reason your clone disappears in this particular context (you can't make time rewind clones). Then, on the giant worm boss, you can make time rewind clones but the moment you do the boss just retreats, changing variables and erasing all your clones immediately. The logistics of this time rewind thing is complicated enough without all the arbitrary exceptions and changes.   I can't decide if I like this game or not. On the one hand, there are unique gameplay and story elements that are definitely worth experiencing; there is nothing else like it. On the other hand, the game doesn't respect itself enough to expand upon the more interesting elements and instead chooses to try 100 different things, which all collapse into one incoherent mess of a game. I suppose I recommend this game only because the length is short enough that you can actually complete it before being fed up with its many issues, and I think it is worth at least $10, so pick it up in the next sale.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting game. Trully Hack and Slash. Amazing graphics, and music and atmosphere. Sometimes even too hard. Prepare to die a lot of times... The only cons I see is that You never know when there is a CHECKPOINT, so it's hard to stop playing and resume the next day. But checkpoints were reasonably set up, so it made this game a little bit easier. I do not agree with someone who said that story is not deep. Story was quite interesting, and I really enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun and is not to be taken seriously. The voice acting is atrocious, full of unintentional comedy. It is a God of War clone with a second string Lara Croft in the lead complete with English accent (or maybe Australian? either way terrible and inconsistent and hilarious.) Story is disjointed and incoherent, but still fun. It's a B-movie in a game with high production standards. Give it a try if you can find it for cheap.",
            "review_score": "1"
        },
        {
            "review_text": "Mindless fun with a hot chick, what more can you ask for? This game is a weird mix between Prince of Persia and Devil May Cry. There's plenty of hack&amp;slash fun to be had but the campaign is repetitive, the story laughable and there's no replay value once you are done with it. Yet the time rewind mechanic is a highlight with enough room for experimentation. Overall this game is worth buying if you find it at a discount.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this game up in a really cheap Humblr Bundle some time back and have been really pleasantly surprised by just how good it is. The hack and slash game play is incredibly fun when slicing down groups of enemies with duel blades and elemental abilities that are gained and upgraded throughout the game, and the graphics make for a really beautiful world with many different areas. The stories nothign special in my opinion and is extremely linear but it's still very enjoying without paying too much attention to it and there are a few moments where the game doesn't properly exdplain what needs doing to get past or to defeat a certain enemy but a quick look at a walk through can get you straight back into hacking and slashing the crap out of everything again in no time!   I personally wouldn't pay full price for this game myself, but if you see it on sale and enjoy fast paced hack and slash games then you should definitely give it a go!",
            "review_score": "1"
        },
        {
            "review_text": "God Of War clone with time rewinding mechanics. That's how I would explain this game to you. The rewinding mechanics allows you to work with your clone(s) to finish off enemies and bosses or solve puzzles. The puzzle aspect doesn't really fit the game, but hey, it works I guess. Think 'standing on switches' and things like that.  Then there's the weapon and ability upgrading which is pretty extensive. The graphics are pretty good; I was actually surprised by how good it looked in motion. Your main character looks great (but forgettable), with the ponytails and all (woohoo, &lt;3 ponytails !). The voice acting, however, is a bit cheesy. Mmyeah, that was to be expected I guess. But since I'm not really into the mindless action these games offer (I do enjoy them from time to time) I stopped before finishing it. No, I'm not ashamed of it. It's just not my cup of tea. In the end Blades Of Time turned out to be a very decent game, so if you're into God Of War(-like games) you might enjoy it.  [Rating: 70/100]",
            "review_score": "1"
        },
        {
            "review_text": "Those too excited with time rewind probably never played Prince of Persia. Just bought it because I like to slash intensively while staring to a nice piece of sterotyped @ss and a satisfying pair of bouncing milkmaid clichê. Any similarity between Sucker Punch and Heavy Metal F.a.k.k. 2 are just mere coincidences.   Yep, just bought because of that.  It was probably made to feel cheesy like that on purpose, and that's why it got a positive from me.",
            "review_score": "1"
        },
        {
            "review_text": "This is a story-heavy linear button masher, just like God of War, except the main character is basically Lara Croft, with smaller breasts, wearing stripper heels. That doesn't really matter though, as it's mostly just mashing button, doing combos and killing lots of enemies.  It's an alright game, though it does have some glitches here and there, and some of the fights can be a bit frustrating because of those problems. Overall, it's a fun game, but it mostly just makes me want to play God of War again and not this.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay was fun. Story was hot garbage.",
            "review_score": "1"
        },
        {
            "review_text": "Nonsensical story but decent gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "The game doesnt have the best controls but is still VERY fun. ",
            "review_score": "1"
        },
        {
            "review_text": "Never play it in english. NEVER.  Japanese or bust.",
            "review_score": "1"
        },
        {
            "review_text": "Blades of time, is a good and challanging game. however im nowarer near to completing it, from my short time of playing it i can say its rather good!",
            "review_score": "1"
        },
        {
            "review_text": "If you're not a picky gamer, like me, you'll enjoy this. Why? Just try it, not because the main character is a hot chick anyway. XD",
            "review_score": "1"
        },
        {
            "review_text": "A definite hidden gem. I had never heard of this game but it looked cool so I picked it up. It is AWESOME! The combat is really fun and satisfying. The enemies are fun to fight. The graphics and art style are great. The voice acting is fantastic and the storyline is pretty good.  I highly recommend this game. It is a ton of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Dat ♥♥♥... oops sorry!  It's not really incredibly decent, but it entertained me for a while, oh and I'm talking about the game.   We can say it's a Prince of Persia without all the stunts and puzzles. The story is not bad, and the gameplay is good overrall, there's find-a-pattern-to-kill bosses, normal weakling insolent mooks and flying Uka Uka's from Crash Bandicoot that shoot purple missiles at you.   Didn't really pay attention to voiceacting and music though.  In the end, if you want to masturbate at high-res textured polygons, you HAVE to get this.",
            "review_score": "1"
        },
        {
            "review_text": "i liked the game, worth it. 8,4156/10,000",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant and fantastic and then brilliant some more. If you can get over the heroine's accent.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone woman has pointy boobs",
            "review_score": "1"
        },
        {
            "review_text": "Blades of Time is a better game than X-Blades, but not by much. The game knows it has a good idea because it abuses the time feature trick a bit too much, and like a kid wanting attention, you’ll just get fed up with it being in your face all the time. I did have fun with the game – there’s something about it that made me enjoy just hacking down some fools with my clones in fancy fashion, even if the rest of the combat is a little flat and basic. In the end though, all the problems pull it down and make Blades of Time a game that can be fun to play at times, but nothing more. If you don’t mind that, you might be one of the people that Ayumi is just looking for, because I can’t see her finding many fans with her latest treasure hunt.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game. If you like hack and slash games like dmc and gow you will enjoy this one.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics, fun and powerful one button combat, pretty good gameplay.  But oh my God you will want to strangle the player character within minutes.  Having a female PC does not mean she has to talk incessantly throughout the entire game pointing out the glaringly obvious with crappy voice acting.  Play it on mute.",
            "review_score": "1"
        },
        {
            "review_text": "It's okay... not worth full price.  The main character is gorgeous.  It's not a game that'd stick with me I guess, but it's not bad either... it's just... eh.  I do recommend it because I only 'don't recommend' games I really dislike and it hasn't been horrible... BUT I'd do some research or wait for a sale... I'm pretty sure porn would be cheaper.",
            "review_score": "1"
        },
        {
            "review_text": "Such an awesomely bad game, in the best way possible. The plot, writing, and voice acting are absolutely terrible. It's kind of like when you watch a bad movie with your friends just to make fun of it the whole time. Pretty much exactly like House of the Dead 1 and 2 in terms of a good bad game.  The actual gameplay is pretty good. Kind of reminds me of the spam of Dynasty Warriors in the setting of Devil May Cry little level arenas. It also has some Prince of Persia style time rewind puzzles. It even has a little FPS stance you can switch to and just headshot all the things, and a cute little reload cancel quick switch to go with it. The visuals aren't too shabby either, pretty nice actually. The graphics do seem a bit dated, and it does feel like this game is years older than it actually it, but it was still a pretty nice bad game. There is an Outbreak mode too, which is basically DoTa style hack and slash, but good luck finding a pug game as multiplayer is basically dead.  Very solid buy for the lulz. Kind of reminds me of Prototype 2 in terms of good gameplay, horrible characters/voices/story. Decent gameplay, somewhat beautiful visuals, and all the terrible plot, writing, and voice acting you can enjoy making fun of the whole way through.",
            "review_score": "1"
        },
        {
            "review_text": "If you dont like Dark souls 1 2 or 3. Then please dont play this you'll die irl. I hope the creators die. ill give it a.....8/8 Oh and this game will make you cry and make you play it for a whole day because thats what it did to me :D",
            "review_score": "1"
        },
        {
            "review_text": "Blade of ***",
            "review_score": "1"
        },
        {
            "review_text": "Take this review as you would with a grain of sand. Click, slash, click, kick, push number, magic. Can't say much more, but do I really want to play more? Recommend cuz it's pretty fun, just not for me.",
            "review_score": "1"
        },
        {
            "review_text": "It started with just the graphics catching My eye, then a short trailer and few screenshots.. but the money and hours spent on playing this game, were one of the best I've used for a Steam game.   The stunning scenery and marvelous graphics and surrounding worlds are beyond anything I could ever ask for in an rpg.  It's worth a shot, the money and definitely all the hours of gameplay :)",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how long it is (playtime at the time of writing this is 80 minutes), but it's a good and fun spectacle fighter with in-combat time rewind mechanics (you need to create clones of yourself to attach some enemies at once) and the worst writing I have seen in a long time. If that doesn't bother you, go and get it on sale (I got it from bundle stars store at 95% discounted ... definitely worth).",
            "review_score": "1"
        },
        {
            "review_text": "What can i say ? One of the best game i ever played. 9.8/10. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "-first thing that hit me - motion blur -second thing - silly run of Ayumi -third - after a while you can win every battle using same tactics and not got hit even once -fourth - the same goes for bosses, pretty boring -fifth - you quickly get all the abilities you want and game gets unrewarding -sixth - chests have boring content -seventh - jumping through the lasers, just meh -eigth - shooting  but it was not all bad:  + some levels (flying one and the desert) were pretty cool + the dragging to the monster system + time rewind, it was cool but it should be restricted a bit more + story was not as bad as I assumed it would be.   After all, I had fun, it was easy, relaxing but boring after a while",
            "review_score": "1"
        },
        {
            "review_text": "Love this game for battle mechanics, time rewind, great art, and of course: Outbreak Mode!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Blades of Time the successor to X-Blades and awful incomplete hack and slash that will amuse you for maybe 3 bosses before you realize how broken and unfinished the game is. Back to BoT, similar to X-Blades it feels like an older game that doesn't exactly hold your hand and thrusts you out into the world of unknown.  You'll quicky catch on that there are no combos just button mashing and learning to dodge and abuse your time rewind ability.In this factor the game gets better as you progress and get amazingly cool abilities to fight off even more challenging monsters.I played on hardmode without realizing you could go to normal mode and didn't repeat a level more than 5 times because of the usually good check points.  The mechanics overall are good and you run into some fun, interesting, and also annoying puzzles. They also have treasure chests throughout the levels that reward loot.Though I've only gotten a total of 2 swords through my entire first play through.One at the very beginning of the game from a chest, the other from the boss before the final boss.Considering there are a large amount of swords in the game it kind of makes you wonder.  This game is definitely not worth the retail price and you shouldn't buy it unless you find it on sale like I did for the ultimate edition($7.50) By the time you start to get some really cool abilities and you figure out how to use your abilities properly you realize you're practically done with the game and that there are some unpatched bugs that make doing the final boss annoying as all hell due to his mechanics.Thankfully there is a work around.  Overall I give it a 5.9/10 for a time waster mainly because some of the mobs don't even have a mechanic other than to make your life a living hell.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game, the story is ok the gameplay is pretty fun the artwork is good though the graphics are a little dated now of course. Basically I had fun playing through this game and thats all there really is to say. If you like a 3rd person action game and are looking for a bit of fun to pass the time this could be what you are looking for.",
            "review_score": "1"
        },
        {
            "review_text": "I found this game to be about average across the board. The combat is decent and the envirioments are pretty for its time and specs. The time mechanic is fun but can be op at times but frustrating at others. Game has some light puzzle elements but is very much a traditional hack n slash. If your a fan of the genre you will find a decent time here just dont expect too much from this game. For non genre players the game may seem a bit flat and too much of a clunky button masher. One important thing though is change the audio language to japanese or one of the others because the english voice acting is god awful and if you do miss the ocasional caption you wont be missing asnything worthwhile as the dialog is abysmal as well.  Main draws: fun time mechanic, bog standard hack n slash fun, decent visuals, decent controls Main gripes: God awful english and dialog, incoherent story, terrible shooting mechanic  Reminds me of: Tomb raider (style/presentation), Devil may cry (mechanics), Prince of Persia (mechanics)  For: People looking for a hack n slash game on the cheap to hold them over in between other games.  Price: Wait till on some super sale below 10 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "Prince of Persia -like hack and slash action game with nice graphics and solid combat. Controls are a little clumsy, but not too bad.",
            "review_score": "1"
        },
        {
            "review_text": "loved the style of the game reminded me alot of an old adventure game from when I was kid but the story was kind short and she could use some more skills but I enjoyed the play through .",
            "review_score": "1"
        },
        {
            "review_text": "it has a few points to work on, such as that the gameplay isn't as fluent as it should be, but it's certainly not a bad game",
            "review_score": "1"
        },
        {
            "review_text": "Crimminaly underrated action game with sick combos , and a unique time travel gimmick that adds a lot of depth to the combat , platforming , and puzzles. Teh combat is rich and rewarding , but the puzzles and platforming can often be frustrating. The story is dreadful , the voice acting is awful , and the graphics are outdated . In short the game is a flawed gem. I'd reccommed the game to anyone who likes a good action game in the same vein is devil may cry or god of war.",
            "review_score": "1"
        },
        {
            "review_text": "Decent Game,  Not a bad game really. Over priced so buy if on sale or even better part of a cheap bundle. Game reminds me of a Tomb Raider and God of War offspring picking up some bad habits of sands of time. Game would be way better if it had full controller support. Only played a couple of hours and got pretty tired of watching the same attack animations over and over.   Probably worth 1 play thru and then moving on.",
            "review_score": "1"
        },
        {
            "review_text": "I like to just spam Time Rewind and watch 50x girls flashing their bodies at my screen.  10/10 would Time Rewind again",
            "review_score": "1"
        },
        {
            "review_text": "You want to play time. Yep? So that game is best for you. Best skills, character animation, and best combo's. That game is a classic. I think that game is better an Prince of Persia. :D",
            "review_score": "1"
        },
        {
            "review_text": "Blades of Time is probably best compared to Darksiders and God of War; hordes of enemies ready to die, simple but smooth combat techniques. It delivers much more.   Although it has two difficulties, the game will adjust in subtle ways after loading from a save game, slowly increasing until it gives you a distinct advantage, however never feeling like it's belittleing you, just that the game is trying to keep the flow going.  It borrows an element from Prince of Persia, allowing you to rewind time, however this creates 'clones' of your actions, with the only limit being how many clones your computer can render until it crashes. There is something deeply satisfying about seeing a boss drop from full health to no health in a second or two thats not found elsewhere that I know of.  One last tidbit. This has to be the only game I've played (at least to memory) where as the female lead gets further into the game her clothes get less revealing, whilst still giving off a sexy vibe.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game when it came out, and it's not changed. Worth a few bob, but you're going to have to gloss over the bad voice acting, the out of sync lips, the fairly comical story, and god of war rip-off but poorly implemented fighting style. It's fun if you can do that.",
            "review_score": "1"
        },
        {
            "review_text": "Great hack and slash gameplay although a bit shallow, some enemies can take ages to kill, amazing boss fights, graphics are nice.  There is a point in this game where all the NPC around you look the same and also a soul system that doesn't work because everything is free so don't bother collecting all the souls. A few of the puzzles are really stupid to the point of you completing them by accident. Main character's nipples could peirce though steel.  Besides those bad points things I'd say this game is worth playing if you can get it for cheap. Also it's a sequal to X blades.",
            "review_score": "1"
        },
        {
            "review_text": "OK, so you're this xena warrior princess who lusts for treasure and glory, so you attack some magician guy and force him to let you into the 'dragonland,' where legendary treasure awaits. The story is, shall we say 'lacking'. The cutscenes and gameplay graphics are fine, but everything in this game feels like it was stretched vertically... like a widescreen film that was squeezed to fit a standard frame. I haven't played the game for long, but combat so far is not very challenging. It was entertaining at first, but the main character narrates her surrounding and the action as it happens. She literally will NOT SHUT UP (I got that JarJar Binks feeling). The environment is quarky too. The game relies on a series of doors and semi-transparent walls to steer you in whatever direction it needs you to go, then back again. I was expecting more from this game, but given the price I paid, I really can't complain. This is a good start to a cool concept, but it still needs a lot of work.",
            "review_score": "1"
        },
        {
            "review_text": "I'll try to keep this short. Im new to this type of gameplay, so take this with a grain of salt. -good length for the price I paid (very cheap on sale) -a little repetitive but you kind of use a different strategy for each fight -the fights also get better b/c awesome power-ups, although you can't level yourself :( -limited weapons and relics etc.... this didnt bother me -Story is decent, 'dragonland' and the voice work is a little lame -8/10 would buy and waste 11+ hours again",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty ok",
            "review_score": "1"
        },
        {
            "review_text": "It combines the action-adventure/hack-and-slash genre with time rewind mechanics to successfully achieve a unique gameplay style. It also has a MOBA-like multiplayer mode.",
            "review_score": "1"
        },
        {
            "review_text": "Blades of Time is an action-adventure hack-and-slash video game.   It is a discount Devil May Cry/God of War but it doesn't mean it's a bad game. The plot is very simple, the voice acting of everyone but the protagonist is pretty good, there are a couple of collectibles, fun times with the Rewind ability. Has several puzzles and interesting boss battles. There's no Guard/Defense button but you may heal quite often so it's ok. Took me 'round 10 hours without DLC. Got it at a Humble Store sale.   Good: +Rewind ability. You can copy yourself multiple times and punish enemies. Some enemies/bosses in fact need you to abuse the Rewind. +The voiceacting from everyone but Ayumis is fairly nice.  +You can choose different weapons and accessories as you progress. They will give you different strengths. +The puzzles are simple yet need timing or some trial and error. +A pair of boss battles are interesting. The rest are blunt and direct.   Bad: -Her voiceacting. Even if she's strong willed and stubborn, I can't stand her voice.  -If you don't try different combos or don't use the Rewind much the combat turns very repetitive. -Sometimes gravity betrays you and you turn heavier than usual, giving you no chance to recover from a fall.  -The plot is simple. Adding a subplot or something would've been nice.  -The ending.   Overall is a decent game. Not worth full price but a good choice for a sale.  ",
            "review_score": "1"
        },
        {
            "review_text": "As many other reviews have already stated, this is a 'beat-em-up' in the vein of Devil May Cry or Bayonetta. Unfortunately, it cannot live up to that legacy. The story is not memorable (borderline terrible), the amount of times you're given the same information over and over becomes ridiculous, and odd pacing make it hard to appreciate any positive aspect of the game.  Graphically, it's decent enough to look at but not something to write home to Mom about. The controls are serviceable, but oftentimes I found myself targeting an enemy and falling to my death, or attempting to hit the button prompt and instead getting beaten to death by the enemy that shouldn't have been able to hit me in the first place.  And man, they really need to work on their character work. Supporting characters would show up with no introduction, yet we as the audience are supposed to understand who they are. None of the characters were intriguing, and the interaction and introduction of the characters was extremely sloppy.  If you can get past all of that, then you have a serviceable beat-em-up. However, if you have any others sitting in your backlog, think twice before picking this one up.  Final verdict: if you enjoy games where every single character is annoying and terribly written, bad guys that spout dialogue that is so muddled in post-processing that you need subtitles to just understand the (threadbare) storyline, and semi-janky controls then this might be up your alley!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really rough around the edges. You could choose to play it, but if you have a favorite replayable game, I'd say keep playing that and not this.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is aweful, controls are confusing, hit boxes are unreliable, objective is not clear, how to defeat mini bosses/bosses is unclear and they have invulnerability and the minibosses/bosses can grapple you from 15 feet away for no good reason, Combat isnt fun and very floaty, forces player to do everything in one way, and the worst part is after every jump and every dash your character just stands there and gets attacked and you cant evade attacks unless you do one of these and then you can dodge the next one. Overall for price it could be better, for the comany it could be a lot better and im not complaining, but do you really need a female character to fight in skimpy leather and way oversized highheels i mean really sexualized much?",
            "review_score": "-1"
        },
        {
            "review_text": "Given the Very Positive rating that this game has, I was hoping for something much better. It's just a third-rate Western third person action game. I only played the game for 24 minutes, but that 24 minutes was so boring and depressing, that I don't know if I'll pick this up again. It looks like every other third person game made with UE 3, and there's almost nothing to its combat.The writing and voice acting are awful. I turned the speech volume all the way down, and that made the game slightly more bearable, not enough to keep me playing though.",
            "review_score": "-1"
        },
        {
            "review_text": "While being a big fan of Hack and Slash games, Blades of Times feels ultimately way too wonky to be able to be recommended in my personal opinion. I say that as someone who enjoyed a lot of wonky games, but Blades of Times simply couldn't grip me at all.  The entire Devil May Cry series is better by about a hundred times.",
            "review_score": "-1"
        },
        {
            "review_text": "Not recommended. Not sure if it's the odd mechanics (jumping all but stops your horizontal acceleration) or the less than stellar writing but I couldn't bring myself to play more than 10 minutes of this game.",
            "review_score": "-1"
        },
        {
            "review_text": "FIrstly, I should state that I got the game for the price of $1 as part of a humble bundle. At that price I would recommend it. Otherwise unfortunately I would advise people to stay away from this hack and slash.  Pros: -Beatiful aesthetics and graphics(considering when it was made) -Combat feels smooth and responsive - Time rewind mechanic is inovative and offers a new element to the typical hack and slash  Cons: - The story is non existent - The voice acting and dialogue are one of the worst I have encountered - Puzzles are annoying and unimaginative (Excluding the desert level which i enjoyed) - The Time rewind mechanic is poorly implemented - Boss fights are poorly made with a few exceptions - Even though there is a good amount of different enemies it feels as if you are fighting the same two generic types each level - The skills and combo system is poorly made in comparison to games like Castlevania, Dante's Inferno, Nier and even Wolverine.  Overall, I would give this game a 5/10 and would thus not recommend it. If you are looking for a decent hack and slash game I can direct your attention towards Castlevania, Metal Gear Rising:Revengance and Prince of Persia: Warrior Within.",
            "review_score": "-1"
        },
        {
            "review_text": "I am very big on games having a proper and inviting beginning. Playing a game should make me want to play more of it. While the intro cinematic was a decent hook for the story and for answering the 'Why should I care about this character?' part, the broken AI trigger forcing me to reload checkpoint and then the incredibly boring and tedious rail-shooter elements for the first 30 minutes = immediate uninstall.  This is 2014. Forcing someone to play the game, without any introduction to the controls, and then forcing them to go through a scripted fighting sequence with allies that are invincible and do 0 damage while there's no obvious objective is just laughable.  Do not play this game, unless you're a masochist.",
            "review_score": "-1"
        },
        {
            "review_text": "Rubbish. Don't buy it. Running plstic dolls simulator.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is garbage, as in 'it don't work'. Most of the characters and some of the objects are just white texture-less shapes. The game runs good on my pc, otherwise, but there is virtually no tech support. I've been trying to fix the issue for a couple of days, and after searching and searching I've found nothing, and no likelihood that the developers care at all about fixing the problem, as most of the questions to them on their own website return with no answers from the devs.  I'd advise anybody considering this to check out the demo first to make sure it works.",
            "review_score": "-1"
        },
        {
            "review_text": "Not enjoyable and the main char is so annoying",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible writing, lowish quality voice acting, fighting is just a spam click fest.... Not really worth hurting my hands over. deleted after a few minutes  oh, and the internal v-sync is broken, causes game stutter - turn it off in game options",
            "review_score": "-1"
        },
        {
            "review_text": "Not very fun anymore",
            "review_score": "-1"
        },
        {
            "review_text": "Stupid game, dont buy it!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "'Blades of Time', a 3rd person hack &amp; slash in the manner of 'Devil May Cry', is a game where nothing feels quote right.  You are a scantily-clad blond treasure hunter named Ayumi (I guess the developers where watching watching/reading too many animes/mangas), who is transported to Dragonland (because magic) where there's untold treasure (because ancient legends), and of course, a warmongering Chaos demon (because ancient prophecy). And you are sort of in the middle of all this, and hack &amp; slash your way through without true reasons.  Extremely crappy story aside, there's much wrong with this title.  First, the visuals. What seems a lush and vibrant world at first glance, is really just a stiff, brightly-colored jungle. Ayumi just clips through the greenery, the leaves and grass are mostly static. Dragonland felt like a colorful dead world. Character animations are stiff, too. What look like detailed models from afar are revealed to be really mediocre ones. But, this is a budget title, so the graphics issues are truly the least concern.  What is a huge issue are the gameplay and the controls.  Ayumi moves too fast. She jumps too high. Controlling her never feels alright. Precision jumping is almost impossible. Even walking narrow ledges is a challenge due to speedy movement. The enemies have no 'meat'. Ayumi's swords just sort of pas through them, and then they eventually fall down. The combo system is poor, and the melee deteriorates into mindless button mashing. The shooting part of combat seems tacked-on and minimally refined.  Add to all this the fact you have to constantly bear with Ayumi's babbling, presented via poor and annoying voice-work...  Ugh, There's much to quit 'Blades of Time', and very little to stick to it.",
            "review_score": "-1"
        },
        {
            "review_text": "Game sucks.  Time warp system sucks.  Action gameplay is so spam and repetitive. Main character is like David's highschool fantasy. Main character talks too much. She is constantly saying something and the dialog is so long that she can't finish her line before next cutscene. You can jump 30m into the air.  Atleast graphics look clear. But it gets dizzy during combat.",
            "review_score": "-1"
        }
    ]
}