{
    "app_id": 209060,
    "name": "Drunken Robot Pornography",
    "release_date": "2014-02-19",
    "developer": [
        "Dejobaan Games, LLC"
    ],
    "publisher": [
        "Dejobaan Games, LLC"
    ],
    "platforms": [
        "windows",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "FPS",
        "Bullet Hell",
        "Indie"
    ],
    "achievements": 11,
    "positive_ratings": 524,
    "negative_ratings": 99,
    "price": 10.99,
    "description": "Bullet-hell, boss-battle, first-person shooter, with giant-robots, martinis and jetpacks. YES. Drink the cocktails. Fight the titans. Make your own Titans. Drink your friend's cocktails.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/209060/header.jpg?t=1447355526",
    "minimum_requirements": "OS: Windows Vista, 7, 8 Processor: 1.7GHz Intel/AMD CPU Memory: 2GB RAM Graphics: 512MB 3D Card, Shader Model 3 DirectX®: 9.0c Hard Drive: 2GB Sound: DirectX Compatible Sound Card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "You fly around with a jetpack shooting robot space hamburgers and collecting alcohol for points and then a giant robot comes out of nowhere and tries to kill you with a bunch of lasers.",
            "review_score": "1"
        },
        {
            "review_text": "Way too much fun. Fast paced, Perfectly challenging, Awsomeness.  This game does so much perfectly:  - Great Platforming.  - The right amount of speed and control in your movements.  - Boss Battles and individual missions are fun as hell to play through.  - Shooting down titans bit by bit is incredably satisfying  - Some moments genuinely made me laugh.  - Cool Music  - Jetpacks.  It's ♥♥♥♥ing awesome. A perfect game if you want a fun and satisfying game.",
            "review_score": "1"
        },
        {
            "review_text": "What a name, and what a game.  Drunken Robot Pornography is an FPS based around taking down giant robots and their little robot minions (not sure what to call them). It feels a little bit like a faster-paced, potentially epilepsy inducing, robot destroying version of Quake. With jetpacks.  I found it relatively short (if you're just going for achievements), but I think with a lot of replayability.",
            "review_score": "1"
        },
        {
            "review_text": "There was was a bot named Tim Who grew tired of serving folks gin So the bar, he burned down And he razed the whole town And he gladly bade the place fin.  ---  It's a really fun game. I alpha tested it and made a bunch of levels, so I don't know if my review really counts because it's like my friend's kid to me.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of Robots who were probably drunk, no Pornography. Unless robots ♥♥♥♥ through lasers, then yeah, lots of pornography.",
            "review_score": "1"
        },
        {
            "review_text": "There was no pornography, I was disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "I like first person shooters. I like shmups. It's like a first person shooter and a shmup hooked up, tried to use plan b but the baby was just not gonna go out like that. And now it wants revenge.",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of a certain 2d indie bullet hell I have to rate this game  HABANERO PEPPER out of Pi  this game mainly focus on YOU:  -doging bullet and charging High-techn weponless robot  -killing A lot of minions before deal with a random shape giant one until you drown it into the stix river . . . piece after another  -colecting powerup cause no one want to fight a Giant full armed robot with a yellow-red armored one's basic gun  -dealing with the floaty controls it's a jet pack IT HAS TO BE FLOATY (even when you are not using it (GAME LOGIC !)) !  -making an high-score and show to your friend how better you are (a younger korean boy will beat you anyway)  -listening your suit saying stuff about your (sexual) technique",
            "review_score": "1"
        },
        {
            "review_text": "Pew pew pew! You shoot thingies, and dey make big explosions, and dere are lazers dat go PEW!   Dis gaem is fun.",
            "review_score": "1"
        },
        {
            "review_text": "  Amazing game   Starts of easy but some really challenging levels towards the end especially if you don't want to take any damage, you can also battle titans made by the community in arenas made by the community which is a really great feature.  I highly recommend this game to anyone that enjoys building and/or destroying giant robots in crazy battles.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  AlphaLegion Review: Drunken Robot Pornography&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I played this because 'Pornography'. I wasn't disappointed or any less turned on",
            "review_score": "1"
        },
        {
            "review_text": "I love starting this game up, then I get a whole bunch of my friends trying to msg me and ask wtf im playing",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun and hilarious. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "The Pacific Rim of video games, just pure fun &amp; adrenaline.  And it's still in alpha!",
            "review_score": "1"
        },
        {
            "review_text": "I got denied sex by my wife and ended up here. It used to be disappointing, it still is, but it used to, too.  *After putting a little time into this game, it's pretty good. It actually gets difficult, but to a point where powering through it would be a headache. Like a lot of games, having a multiplayer mode would be awesome. For now I play it off and on so it keeps that new game scent.",
            "review_score": "1"
        },
        {
            "review_text": "Finally out of early access, this game has added so much in the past month. The feel of old arena shooters with the puzzle quality, this game has the most inventive ideas and should be played by all living organisms. Honestly one of the best games to come out this year and last.",
            "review_score": "1"
        },
        {
            "review_text": "Just got this game, and I MUST OBTAIN A SOUNDTRAK!!!!!!!!!!!!!!!!!!!!!!!!!!! I never want game music, but this is the best game music ever and I am still on the title screen!. Please, oh please buy this game if you are the least bit interested. I will post screen shots soon.",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game. It hasn't got any porn in it.  Seriously though, it's one of the best indie games I've ever played. Even though it is currently on Alpha stage, it's still well worth the money spent on it.",
            "review_score": "1"
        },
        {
            "review_text": "All I ever wanted was a chance to play Inago Rage again.  Thanks Dejobaan.",
            "review_score": "1"
        },
        {
            "review_text": "This game made my day.",
            "review_score": "1"
        },
        {
            "review_text": "Not robot porn, but still pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "A glorious first-person-shooter-jetpack-dancer build-a-boss-battling game that reminds me of Fraxy...",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced, colourful shooting &amp; bullet dodging orgy. Also robots of titanic scale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so stupid that it's awesome! 5 stars!",
            "review_score": "1"
        },
        {
            "review_text": "Its not what it sounds like.",
            "review_score": "1"
        },
        {
            "review_text": "Insanely fun shoot'em up.  Light hearted and adorkable.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty neat    (that main menu though)",
            "review_score": "1"
        },
        {
            "review_text": "I don't usually review games so please forgive me if I miss the point entirely.  I had this game sat in my library for ages, I got it with a discount coupon on my steam that I didn't want to go to waste (Can't even remember how I got it), just left it there for ages, then my Laptop died so I was without games for ages anyway, but when I got it replaced one of the first games I re-installed was this, why? No idea, I didn't touch it for a couple of weeks, until one day I just saw it staring at me from my library and felt the urge to play, and I regret not following that impulse sooner.  Drunken Robot Pornography is by far one of -the- most fun indie games I've purchased, it's fast-paced, somewhat relaxing, intense, nice-looking, great-sounding, quick gameplay and good control layout are just a few things that I liked about this, this game even has a story and some decent voice acting, five minutes in and I found myself interested to know the story, for those of you wondering, the story starts with your bartender burning down your bar and stealing your robots, the rest writes itsself.  All in all I give it a 10/10 if I'm being generous an 8/10 if I'm being fussy. not that I have anything to be fussy about.",
            "review_score": "1"
        },
        {
            "review_text": "I think this will be my go-to game for a quick robot fragging session.",
            "review_score": "1"
        },
        {
            "review_text": "Epic Bullethell-Score-Shooter, with one of the best Menu-song ever :) Just give it a shot :D",
            "review_score": "1"
        },
        {
            "review_text": "During a night fueled by copious amounts of LSD and sexual experimentation, the Tribes series and Portal series invited over every top-down arcade shooter to their place for a passion filled one night stand. This game is the result......and it does not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "Classic Dejobaan writing and design, it's an aesthetic only they can consistently nail.  The gameplay looks great in the trailers and it's great in real life too, but only after you get good.",
            "review_score": "1"
        },
        {
            "review_text": "It might not have pornography, but it has everything else you could possibly want.",
            "review_score": "1"
        },
        {
            "review_text": "Your know this game is awesome when the name of the game is Drunken Robot Pornagraphy. Without seeing the gameplay you will never guess what type of game this is. Ever!  This game believe it or not is a 3d bullet hell game about a a guy who owns a exotic robot stripper bar. He gave his Robot Bartender a modification in his A.I. that made him go berzerk burns down his bar and stole all his exotic robot dancers and it's up to the owner to take down his old friend with a talking jetpack, a lazer rifle and his love for alcohol.  This game it hard. It's not just attacking the enemy till he Goes *poof*m no you have to shoots all his parts off till his core becomes vulnerble so you can kill it! sound's easy right? GOOD LUCK DODGEING ALL THE FLYING DRONES, SNAkeS, LAZErS, TINY PLAnES, LAZERS, DID I MEnTION LAAAAAAAAAAAAAAAAZEEEEEEEEEEEEEEERRRRRRRRRRRRS, but thats ok this game gives you a really good controle over your character. Like really good. I know it's not friken hard to get controles right for Fps style games but let be honest, some of the tripple A tittles still screw it up. this game does it perfect. when you slow down it gives you good controlable balence near ledges of platform and when you need to be fast it delivers! The controles are simple too. Jump move shoot. thats all it is.  As you progress through the game you get an awesome dialogue between your jet pack and your protaganist. all of it are just halarious and just fitting. You will love the humor in this game though you'll never see characters themselves interacting with eachother, the game dialogues give you a good sense of the world.  The music great too.  All and all i have to give it a 5 out of 5. for what it does, it delivers in gameplay, controles, music, story and content. you can even make your own robot boss and levels...HOW FRiKEN COoL IS THAT!",
            "review_score": "1"
        },
        {
            "review_text": "Dejobaan Games always makes really cool stuff. If you've enjoyed any of their other games like AaaaaAAAAaaAa a reckless disregard for gravity, or The Wonderful End of the World then you will most likely enjoy this one too. Their games usually have really good soundtracks and this game is no exception. I ended up downloading the main menu theme because it's funny and catchy. The game itself is very simple in concept. It's basically a first person schmup. You spawn in a stage, a big enemy, or a bunch of small enemies, or both spawn and you have to wipe them out. You get a jetpack and lots of gun powerups that stack to make your gun really powerful. It's got a somewhat of a slow learning curve so you might not actually be really challenged until around level 30. Once you get to that point it can get pretty frustrating. The story is silly in a good way. You get voice mails from people and other robots threatening you and you have a sentient suit that calls itself suit which talks to you occasionally. Overall, it was really entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty neat    (that main menu though)",
            "review_score": "1"
        },
        {
            "review_text": "It might not have pornography, but it has everything else you could possibly want.",
            "review_score": "1"
        },
        {
            "review_text": "A truly amazing fun game.",
            "review_score": "1"
        },
        {
            "review_text": "The campaign is fun comedy bullet hell, and after you're done (or not), you can create titans and arenas in the workshop for others to play against. Solid game, lots of enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "My family questioned my religious convictions when they saw the title.  10/10 would cause doubt again.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of quick fun; fast paced action!  Fighting giant robots is really neat in a bullet hell scenario, the four main powerups combining together just makes you wanna grab every goodie you can find in battle too!   My only gripe is that some levels can be rather difficult to beat, those being the later score challenges as apposed to fighting titans.  I recommend this lots if you like a fun FPS with a different spin put on it!",
            "review_score": "1"
        },
        {
            "review_text": "RRRREUBEN MATSUMOTO YOU PATHETIC EXCUSE FOR A MECHATRONICOLOGIST IT'S KILLFRENZY, THE CURRENT REVIEWER I JUST WANTED YOU TO KNOW, THE RECOMMENDATION ON THIS GAME? THAT WAS ME IT'S QUITE GOOD P.S. I WON AND I EXPLODED ALL THE ROBOTS",
            "review_score": "1"
        },
        {
            "review_text": "not porn  1/10, it was tough, but i managed to fap still",
            "review_score": "1"
        },
        {
            "review_text": "Its not what it sounds like.",
            "review_score": "1"
        },
        {
            "review_text": "3D bullet hell works so much better than expected",
            "review_score": "1"
        },
        {
            "review_text": "I had the expectation that people just gave this game a positive rating because of the title. But surprisingly, it's a pretty cool game.  This game is the kind of game that you would see in a moderate-budget movie so they don't have to deal with purchasing copyright. That's a good thing though, it's simple and easy to jump right on to play.",
            "review_score": "1"
        },
        {
            "review_text": "Crazy fun to be had in jumping around &amp; running with a jet pack, fighting the Titans (huge robots who are bend on killing you with lasers, bombs, missiles), while listening to the awesome soundtrack, perfectly suited for the game..  (Note: No robot genitals or pornographic materials were shown during the process of playing this game..)",
            "review_score": "1"
        },
        {
            "review_text": "It's like Jumping Flash met Geometry Wars and had a amazing baby.   ",
            "review_score": "1"
        },
        {
            "review_text": "I heard about this game a year or two ago, so I was happily surprised when it came out on steam. SIlly name, giant robots, bullet hell, shooty things! What's not to love?  Unfortunately, most of the game.  FIrst off, the controls - my main problem is that they feel too floaty, almost as if the walking is on ice. The jetpack seems like a slight boost to the jump, having to recharge after two seconds of use. The speed seems pretty slow, too.  The gunplay is fairly boring, too. The gun (that's right, there's only one) sounds weak, feels weaker, and you'd barely see what it did to the 'bosses' if it weren't for their parts falling off. The upgrades are just things like DOUBLE SHOT, FAST SHOT, etc, that barely add a perceptible difference.   The 'bosses' take about 10 seconds to kill, even on the hardest difficulty, and they all have the same kind of attack. The only real challenge is from the waves of enemies that continuously spawn. Even then, most levels have a Point system - after a certain amount of points from pickups or robot kills, the level just ends.  There's only a handful of levels, and they all feel mostly empty.   While the graphics are nice, and the music is decent, it feels like Deiobaan kind of focused more on the looks and the name to sell the game, rather than the actual game itself :(  Also, martini pickups don't do anything besides points. Come on! Where's the DRUNK in DRUNKEN ROBOT PORNOGRAPHY !?!?!  ",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this hoping to just sit back, shoot stuff and have a good time. But the low damage gun (even with all powerups), the controls that make you feel like your on ice and the constant crashing made it very hard to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring floaty movement. Boring gun play. Easy as ♥♥♥♥ levels. The 'difficult' levels made by players just spam things at you. Robots fall to pieces before you can even do anything like learn their patterns.  This is NOT a 3D bullet hell, as much as the screenshots make it look like it, bosses die to quickly to make patterns any challenge. Although it isn't the only improvement that could be made for this game (by far) increase the health of the boss parts, at the moment this game is trivial.  Really dissapointed as the premise was great.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is not fun, the first level didn't create any interest for me, but I kept going, thinking it would improve. It did not. The game is ludicrously easy, stupidly repetitive, mind numbingly boring, and just unrewarding. Sometimes easy games can be fun because they're entertaining, this has nothing enjoyable in it.  You would think a game called; Drunken Robot Pornography would have a pretty good soundtrack, no, that too, is boring.",
            "review_score": "-1"
        },
        {
            "review_text": "While an imanginitive, unique and promising title. The game suffers from mechanical errors. The arenas do not provide easy or intuitive movement, and with the the action be restricted to first person, its very much impossible to kill your target and navigate (which the game demands of you). The game tried to do too many things at once, while failing at all of them.  I would highly recomend Dejoban's other games though, despite this dissapointment.",
            "review_score": "-1"
        },
        {
            "review_text": "You might have thought that giant robot bosses would be cool. They are not. They are utterly boring. There's pretty much no thought behind them, and you won't need any real strategy to beat them.  You will kill the first ten bosses in five minutes or so. The first one takes about 8 seconds. No, really. You will be done with it before you even know what happened. Literally.   There is one gun only, and it's not exactly the most satisfying video game gun ever. (That, by the way, was the understatement of the year.) Sure, there are a couple of power ups you can collect, but you will hardly notice them when you have them.  The theme song in the main menu is kind of fun the first time, but that is pretty much it.   Verdict: waste of money, even on sale. Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "I had high expectations for this game but it failed to deliver. One gun for the entire game? Come on!   Get Tower of Guns instead.",
            "review_score": "-1"
        },
        {
            "review_text": "the trailers for this game are cool! the game isn't.  every stage consists of either shooting a stationary boss that shoots very slow very easy to dodge lasers (that you always have to kill by shooting its limbs off) or collecting points by shooting little balls that ever so slowly move towards you and pose little to no threat. that's the entire game. i try not to ask much of smaller devs that just don't have the resources for bigger projects but this is incredibly boring",
            "review_score": "-1"
        }
    ]
}