{
    "app_id": 209190,
    "name": "Stealth Bastard Deluxe",
    "release_date": "2012-11-28",
    "developer": [
        "Curve Studios"
    ],
    "publisher": [
        "Curve Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Stealth",
        "Platformer",
        "Indie"
    ],
    "achievements": 27,
    "positive_ratings": 783,
    "negative_ratings": 93,
    "price": 6.99,
    "description": "Armed with only your wits and a pair of Stealthing Goggles, it’s your job to sneak your way through a deadly facility that’s determined to extinguish your fragile little life.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/209190/header.jpg?t=1535623336",
    "minimum_requirements": "OS:Windows XP SP2 or better, Vista, Win7 Processor:Dual Core 2.5Ghz Memory:2 GB RAM Graphics:DirectX 8.0 compatible DirectX®:8.0 Hard Drive:250 MB HD space",
    "recommended_requirements": "Other Requirements:Broadband Internet connection",
    "reviews": [
        {
            "review_text": "Rating 9/10 Overview: 2D Puzzle Stealth Platformer  The Good:  + The game does a fantastic job of mixing puzzle elements with platforming elements with stealth elements. All of this comes together in a complete package designed to challenge you.   +80 levels across 8 sectors   + Each Sector introduces a new gameplay mechanic that adds to the challenge and fun. As you progress through the levels these mechanics are put to more creative uses.   + Each level contains a collectable, get all the collectables in a sector to unlock a new level.   +After completing a level you are graded based on three factors, time, deaths and number of times being spotted. S -Rank is the highest rank you can achieve. Achieving S Rank in all levels in a sector unlocks a new level. This provides plenty of replay ability to the game.   + Different equipment to experiment with. Some equipment allows you become camouflaged, use a decoy, teleport etc. All of this is strictly optional, in fact to get an S-Rank you have to use no equipment, but it is nice they included these options for anybody who wants to try them out  +Level Editor to make your own levels and share.   +Lots of fan made levels that can easily extend your playtime  + Game provides a cute story that fits nicely with the game  +Great music   +Surprisingly addicting.   The Bad:  -Some minor glitches,   - Getting S-Rank in certain levels requires some luck   - The game can get frustrating at times, especially if you are trying to unlock everything   Conclusion: I really loved this game mainly because I knew so little about it when I started. Though the game is called Stealth ♥♥♥♥♥♥♥, 'stealth' is a bit different than what you normally expect as this game is also about speed and precision platforming. What makes this game so good is how they were able to combine all these different elements together and make a great game. If you are interested in any of these elements than I strongly recommend you check this game out.     ",
            "review_score": "1"
        },
        {
            "review_text": "Worth the money. Even at full price.  Yes, unfortunately the gadgets are only unlocked after finishing the game and therefore mostly reserved for speed runs or acquiring the helix. They would however have made the game too easy the first time around and are there for exactly that: people who want to do speed runs and acquire every helix.  This game gets reviewed as a 'fast platformer' quite a lot. Most of the time you can pause, stand around, contemplate your next move, take a breather, push a block at your own place etc. Then when you are ready to go you need to be quick but shortly afterwards you can relax again. There are however a couple of levels/instances where you have to constantly move or perform a series of fast actions in succesion. Overall however I experienced the game to be more of a contemplative nature.  The community levels are also great.  Worth the money. Even at full price.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most addictively frustrating game I own. You will get tired of being laser shot, leave the game, only to come back to it again and again. It's a great little puzzle game to kill time, and I mean lots of time, 'what happened to the day?' kind of time.",
            "review_score": "1"
        },
        {
            "review_text": "An amusing stealth puzzle platformer. Makes you feel creative and accomplished once you figure things out or get to the exit. Your surroundings can constantly change, so this game rewards being observant -- especially now that there are secrets to be found. And if you're a perfectionist, there are challenge conditions to be met as well.  8 areas with 8 levels each, plus two bonus levels per area. So the base game is 64 levels. Even if you've got no patience to perfect your gameplay, you can still unlock one bonus level per area by getting the hidden item in each level, so that's 72 levels to play. (Challenge conditions unlock the other 8 bonus levels.) And once you complete each level you can use new equipment that gets you more abilities to play with, in that level.  PLUS...several truckloads' worth of community-made levels! If you're ever bored with the main levels, you can always check these out and you never know what you'll find. Or if you're feeling creative, you can make your own!  And that's not even mentioning the humor. It's not just stealth platforming, but stealth platforming with great theming -- an industrial/cyberpunk dystopian espionage feel, seasoned with some quite amusing dark humor. The visuals, music, and other elements -- including the way the many traps in the game are designed -- add perfectly to this. And then there's the writing on the walls...literally...  I first played this game in its freeware version, which is just called 'Stealth ♥♥♥♥♥♥♥'. I liked it enough that when I saw it in a Humble Bundle I picked up this version. And it's just as good.  (Disclosure: I got this game from the Humble Bundle with Android 6.)",
            "review_score": "1"
        },
        {
            "review_text": "A challenge, good game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It's a stealth platform puzzler and it's a gem!",
            "review_score": "1"
        },
        {
            "review_text": "Classic platform puzzles. Reminds me a bit of Donkey Kong for Gameboy.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good stealth puzzle platformer made with Game Maker. Take control of clones as you try to make through several tests of stealth as fast as you can, optionally using some nice equipment too. Many different elements keep the game interesting and challenging while you progress. There’s also a level editor and many community levels are available. Recommended for those who like Gunpoint (also made with Game Maker).",
            "review_score": "1"
        },
        {
            "review_text": "Better than every stealth game ever.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't really a stealth game in the vein of Splinter Cell or Mark of the Ninja, but rather a great puzzle-platformer about navigating small but complex test chambers (ala Portal or Super Meat Boy) where darkness is key to avoiding instant death from turrets or robots. Every level is cleverly designed and checkpointed frequently enough to not be frustrating to puzzle out. After you have finished the level, the grades you get for how well you did and the online leaderboards will make you want to come back and perfect your run. There's also a hidden helix in each level that requires you to think outside the box and experiment in order to locate it. Simply put, this is a fantastic and lengthy game. And that's not even touching upon the incredibly robust level editor and the hundreds of user-created levels available for download without even exiting the game.  Plus the subtitle is 'Tactical Espionage ♥♥♥♥♥♥♥♥.' How can you hate that?",
            "review_score": "1"
        },
        {
            "review_text": "Nice stealth game",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, with a very interesting theme. Definitely worth playing!",
            "review_score": "1"
        },
        {
            "review_text": "Ton of fun",
            "review_score": "1"
        },
        {
            "review_text": "A fun stealth puzzle game, with a good range of difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little puzzle game with some solid challenges.  You can compete for record times against others like Track Mania.  More puzzles than 'stealth'. After completing a level you can repeat with a hologram, temp invisible and other abilities. Also, some user generated levels. Decent replay value.  Can play quick and in short intervals too.",
            "review_score": "1"
        },
        {
            "review_text": "Very challenging but addictive puzzle game. It can get a bit frustrating at times but always has me coming back to it",
            "review_score": "1"
        },
        {
            "review_text": "A 2D stealth game with some cheeky language in it's title.  This game was a bit of fun but I found it unfortunately boring quite quickly.  8/15 - 'Fun for a short time but gets boring.'",
            "review_score": "-1"
        },
        {
            "review_text": "it would be a good game but it lags a lot",
            "review_score": "1"
        },
        {
            "review_text": "I'm getting tired of indie games making their games pixelated. I don't think it's being done for a retro feel anymore but instead it's being done out of laziness. Anyway, I don't judge games based on graphics, I judge them on gameplay and so far this is looking like one fun puzzle platformer.",
            "review_score": "1"
        },
        {
            "review_text": "\\/ .´ ' ' `. \\/",
            "review_score": "1"
        },
        {
            "review_text": "Cracking game!",
            "review_score": "1"
        },
        {
            "review_text": "its an interesting little stealth game. but after completing 4 levels, it kinda got old. still, i recommend this game. pretty well made, good graphics, 0 bugs, nice little secrets. would give a 70.",
            "review_score": "1"
        },
        {
            "review_text": "Neat but who gives a ♥♥♥♥? No purpose in play. No reward. Boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game and i loved it Very Much! Loved the ending ha ha!",
            "review_score": "1"
        },
        {
            "review_text": "A must have for those who like stealth and puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "You'll chuckle more than once while playing (and dying) through this game. The humor and sweet soundtrack alone are worth the purchase, but it's a fun puzzle solver without /quite/ as much death as Super Meat Boy.   But yeah, buy the soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "In a better world, this game would have been plastered all over billboards and TV. Simply excellent.",
            "review_score": "1"
        },
        {
            "review_text": "Great game has amazing puzzles and gameplay and is overall a good concept. Overall is an excellent game Recommend Buying!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game in sales because it was really cheap (only € 0.90), but I can say that after i played, i would purchase without sale, is one of the best games I've played in recent times. There are 8 stages with 8 levels each of pure fun.  Pros: Super fun Fast Pace Level Editor  Cons: In some levels It becomes a little difficult to play without gamepad (recomended) The gadgets are only available after completing an entire stage    Just BUY IT  ",
            "review_score": "1"
        },
        {
            "review_text": "Stealth ♥♥♥♥♥♥♥ is a 2D side scrolling puzzle game. In essence, you are a clone who is in training to become a master stealthsman. You have to sneak past robots and the traps they have set for you. Part of this sneaking around means that you have to stay out of sight and use shadows (the lighting in the game is very simple but well done). Your eyes will glow green if you are invisible, yellow if you are partially visible and red if you are fully visible (and bad things will happen to you if you are fully visible.... LOL). Good experience. 7/10.  Edit: I love the fact that steam edits my review of a game with Ba$tard in the title......",
            "review_score": "1"
        },
        {
            "review_text": "Similar to Abe's Odysee, with a far greater emphasis on solving puzzles. Some of the later levels rely too heavily on split second timing for my liking, though if you're a fan of that sort of thing, I can't think of any reason not to give this one a look.",
            "review_score": "1"
        },
        {
            "review_text": "Decent puzzler. Not a bad purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Infuriatingly fun game! Definitely a good game to dump time into!",
            "review_score": "1"
        },
        {
            "review_text": "I have actually finished this game on my Android phone, but Linux version is quite great as well! The game does not get tedious, introduces new mechanics all the time and sometimes gets quite challenging.  Also, very nice dark humour. Basstards indeed!",
            "review_score": "1"
        },
        {
            "review_text": "one word.. OSM!!! This game is the kind I was looking out for. Ever since i saw Sjin play it in his Sjindie games, I was hooked. And when they had a sale.. well what more reasons to buy it? Challenging, appropriate music creates the right environment, awesome graphics, this is a game to be had. I rate in 10/10",
            "review_score": "1"
        },
        {
            "review_text": "funny, a bit silly(in a good way) kind of stealth game, a good time killer :)",
            "review_score": "1"
        },
        {
            "review_text": "Fun old school stealth game",
            "review_score": "1"
        },
        {
            "review_text": "Let's take two genres and mix them together! Let's see? Oh here we have the Puzzle Plattformer and over there we have the Stealth Game. Yeah lets just take those two.  And who would think that. Those tow genres work together wonderfully. Stealth ♥♥♥♥♥♥♥ Deluxe just is this combination and it rocks! This game is the sequel to the free titel Stealth ♥♥♥♥♥♥♥. The goal of each level is to hack all the computers and run to the exit. Or should I say sneak. ALthough thinking is more envolved than sneaking. Every level is fast paced and the game kinda feels like Super Meat Boy sometimes but with a lot of thinking an sneaking. This game has the best level design in any game I have seen in my whole years of playing video games. And if you beat a level you feel like a genius. It's really rewarding. And if I haven't convinced you yet. Just because of the hilarious ending you should finish the game.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Clever and fun. I just played for an hour and a half by accident. Good stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Wow where did this game come from, stealth puzzle fighter in a side scroller manner, its just a fun and awesome game. More old school but man what a game.",
            "review_score": "1"
        },
        {
            "review_text": "Think stealth games are too slow? Then this game will make you...THINK FAST! Oh no, did you see that thing that just gibbed you? No? Then try harder! This combines fast-paced platformer reflexes and stealth-like elements. Get the Teleporter DLC when you can too!",
            "review_score": "1"
        },
        {
            "review_text": "I gotta admit Im a sucker for some of the interesting Indie Puzzle games which have come out on Steam. Stealth ♥♥♥♥♥♥♥ is one of the better ones.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and enjoyable!!   I could not pull myself away from this game. very interesting and clever puzzles . and theres multiple ways to run the test with different equipment that you can unlock. Anyone who likes a challenge should pick this game up.  ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty entertaining and dynamic puzzle platformer... Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "some levels feel like your beating yourself against a wall.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic puzzle game with awesome pixel art and music, also smart and not frustrating stages. i recommend it to anyone who likes platform-puzzle games!  p.s. AWESOME ending :)",
            "review_score": "1"
        },
        {
            "review_text": "Bought the game played for a while and LOVED IT good games for puzzle lovers and stealth lovers 11/10",
            "review_score": "1"
        },
        {
            "review_text": "A great little game that will drive you mad, tie your brain in knots and make an hour feel like 5 minutes. I would recommend this game to anyone who likes platform games or likes a good puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "Too short for 10 bucks.",
            "review_score": "-1"
        },
        {
            "review_text": "While good in concept, is remarkably slow, which is a shame considering it's a staged game. Everything this game does, Super Meat Boy does better.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a pretty sweet stealth puzzle platformer with crisp visuals and an even better soundtrack.  I couldn't beat it because i got stumped but i do own this on multiple platforms I have gotten the farthest on the VITA version still aint beat it yet though. ",
            "review_score": "1"
        },
        {
            "review_text": "This game likes to mock me. It likes to remind me of my failures. It likes to take a stupid situation in which I die because of my impatience or negligence for the range of enemies and rub it in my face. And I love it for it.  Stealth ♥♥♥♥♥♥♥ Deluxe is the pay version of the previously FTP Stealth ♥♥♥♥♥♥♥, made on the Game Maker engine. While a lot of people complain about Game Maker and its limitations (especially the free version), games like Stealth ♥♥♥♥♥♥♥ are a great reminder that the Game Maker engine can actually perform its job well. With its amazing art style and fun mechanics, this game is like a blast from the past; complete with unlockable levels based on either item acquisition (DNA Helixes) or completing the level by accomplishing certain requirements and recieving S-rank (which is absolutely bloody hard to do). It is a form of gaming that, sadly, has become obselete in today's world by simple nature that selling levels for DLC content is far more popular by game companies because, like electricity, the web, cable tv, and the latest HIV vaccine, it is far easier to make more money by cutting things apart and selling it in pieces; a tactic that is incredibly and obviously stupid, yet we fall for it anyway (yes, shots fired).  The best part about this version to the best of my knowledge is that it also includes a community level editor. I am currently finished with the main vanilla game and fully intend to complete all the extra levels and then play some of the player-made levels. A quick advice to anybody making games in the future; please, please, please, PLEASE make level editors. Your game's lifespan will last infinitely longer if you include player-made content regardless of whether or not your game is good. I mean, look at Kinetic Void and Ace of Spades; those games are terrible and they are still played every now and again due to the ship/level editors.",
            "review_score": "1"
        },
        {
            "review_text": "Great little puzzle game. Plus the title is rather amusing.",
            "review_score": "1"
        },
        {
            "review_text": "This was a good, short game. Loved that the entire game was stealth-focused - you don't get that a lot anymore. Challenging, but not too challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging game but extremely fun. I reccomend to anyone who likes side-scroll puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "Bad game can't use keyboard. Some levels require to use a gamepad.",
            "review_score": "-1"
        },
        {
            "review_text": "Stealth ♥♥♥♥♥♥♥ Deluxe is the title that will first come in my mind when someone will ask me 'is there any good stealth indie games?', and it's not because of the name of this game. Fantastic graphics, great music, level design and STEALTH. Stealth is truly great done. At times you need patience, but sometimes you also need to think quickly so you can survive. And The Teleporter Chambers DLC - it's one of best DLCs made for indie games. Levels included in that DLC are BEST in whole game. That's how you make content that you charge money for. If you are into platformers, like stealth games or just indie games in general - get Stealth ♥♥♥♥♥♥♥ Deluxe with DLC. It's really worth every money.",
            "review_score": "1"
        }
    ]
}