{
    "app_id": 209370,
    "name": "Analogue: A Hate Story",
    "release_date": "2012-04-27",
    "developer": [
        "Love Conquers All Games"
    ],
    "publisher": [
        "Love Conquers All Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Cloud"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Visual Novel",
        "Indie",
        "Anime"
    ],
    "achievements": 14,
    "positive_ratings": 1881,
    "negative_ratings": 128,
    "price": 7.19,
    "description": "A dark visual mystery novel featuring transhumanism, traditional marriage, loneliness, and cosplay. Two pursuable characters. Five endings. Welcome to the future.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/209370/header.jpg?t=1447355559",
    "minimum_requirements": "OS: Windows XP  Processor: 1.66 GHz Memory: 1 GB Hard Disk Space: 80 MB Video Card: DirectX compatible card  DirectX®: 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is ancient history now, but for a while, back around 2005 or so, there was a perception, largely created by a single translation group, that the 'visual novel,' a format of linear text adventure that grew out of the Japanese PC games scene, might actually have something to offer beyond cheap titillation. They chose short, indie works like narcissu, Planetarian or OMGWTFBBQ, melodramatic stories of finding that last emotional connection in the moments before your early and miserable death. And then they pretty much stopped doing it (at least for free), because, hell, translating this stuff is a pain, and that was the end of that.  Analogue feels much like the promise of those earlier works. Written in English by a native speaker and skilled writer, with a great sense for how to use the interactive features of the format to really draw you in, in a way that 'an ordinary book' can't. It's smart, somber, and complicated; it's a well-told story, and not just 'for video games.' And really, I just have a thing for simulated terminal interfaces.",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me a lot of The Handmaid's Tale. If that statement intrigues you, then you can probably safely ignore the rest of what I have to say.  Analogue has a lot more story than most games. It's also more brutal than most game stories are, which makes the cute art and presentation all the more dissonant. This may have been intentional, to contrast with the overt and at times graphic themes of women's rights suppression and child abuse, but it could also be interpreted as a somewhat cynical marketing gesture. For all of the motivation the story gives the player, the player's ability to influence events is extremely limited; you're basically playing a data recovery simulation while answering yes/no questions to abused women. I did not feel empowered by the game to make a palpable difference in the game world, and I can't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Well that was fun.  Quite short, reading all those reviews of people nagging that this game is too long and has just text I was expecting a behemoth of Umineko proportions. But nope. I've played it less than 6 hours and I already 100% it (which requires almost 3 playthroughts) so you can tell it's really short.  Interesting premise that could have been awesome if not for the dating sim/moe waifu/anime tropes galore.   Won it for free so I can't complain either way.  Laughing at all the confused people crying in hopeless despair 'is this feminist?', 'is this an sjw thing?', 'let's talk about the elephant in the room, this game is feminist' in the forums. I'm gonna go to all eroge/anime pages here on steam and start asking 'is this misogynist?', 'is this a dude-bro thing?', 'let's talk about the elephant in the room, this game is woman-hating at it's worst'. What a delightfully silly way to spend one's time.  Laughing even more because this 'review' won me a hater that actually went to all of my reviews in order to vote them down...and also ironicaly vote them as funny. What a way to spend your time. So much fury, yet so little brain. I love y'all!",
            "review_score": "1"
        },
        {
            "review_text": "Years after the Mugunghwa broken down an investigator from earth had come to investigate what happened on board the Mugunghwa. This korean visual novel will entice you with its beautiful art style and very well written story that is broken down into logs and messages sent to one another on the Mugunghwa. The logs cover topics from betrayal to topics of forbidden love. All while having the same undertoned theme of hate hidden in almost every single log that you open from the first log to the last log. The multiple ending will also provide you with hours of gameplay all while being very diverse from one another.",
            "review_score": "1"
        },
        {
            "review_text": "In this game you spend your time reading people's private messages. It is funny because in real life I also like to read the mail of people.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really really nice vn (visual novel). The story is great and you kinda get attached to the characters of which there's two you kinda have access to. Story-wise, I ain't gonna be saying anything much that you don't already know going in the game. Basically, you play the part of an 'investigator' who have radio contact with a ship which was basically lost for thousands of years and suddenly reappeared. There is a lot of reading which makes sense considering this is a vn. You get to learn of the what, how and why things happened as they did.  There's different endings - five to be exact, each giving you an achievement which is kinda nice. Not like you really need much excuse to play and get all the endings. Truth to be told, the first time you get one ending, the story you get feels abridged. There's plenty of loose ends but another play-through with different choices nets you more unveiling of the story. There is a sequel out - Hate Plus, which I hear lets you continue your story from the different endings you have (though you can always start from scratch). I will be giving it a go soon hopefully love it enough to recommend!",
            "review_score": "1"
        },
        {
            "review_text": "I really didn't know what to make of this at first. Mostly I got it because the bundle was in sale and I vaguely recalled hearing an acquaintance mention that they'd played it. I generally enjoy visual novels, though, so I figured I may as well snag it while it was on sale.  Anyway, I'm not sure what I was expecting, but this really wasn't it. The odd and disjointed storytelling was a little off-putting at first, but curiosity about the Mugunghwa and what happened kept reeling me back in. The plot is pretty dark, and some of the log files are a little difficult to read. The resolution of the mystery is honestly pretty heartbreaking, but I couldn't help but keep reading.  Overall, it was super enjoyable, and I definitely recommend getting the soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Good VN game.  Plot and gameplay are pretty simple. You're hired to go investigate a derelict spaceship and find out what happened. You arrive on the ship and use the terminal to activate the ship's AI. You spend the game interacting with the AI and reading the ship logs of various families and people who were on board to find out what happened. Reading logs and interacting with the AI causes her to unlock more ship logs. Log entries are often given to you out of order &amp; out of context but fill in as you discover more, so they will eventually make sense. Some other stuff happens as well.  Couple of cons: 1. Reading some logs can be confusing due to the confusing family names not being particularly memorable. Expect plenty of “Who's this guy/girl again” moments until you read a bit and hopefully remember who that person is. 2. Getting 98% of the logs and finding out the one you're missing is the pronunciation log that you're pretty sure you got before.  Not a lot to say. Enjoyed the plot and stories, enjoyed the characters, liked playing around with the terminal, and enjoyed fussing the AI's. Looking forward to the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Analogue a Hate story is Cyberdyne Waifu simulator. Replace its killer robot army with long boring shiplogs written by medieval space colonists. Spend hours being attacked by their mundane informational content. The waifu's become yandere by trying to quiz you on what you read.  I am boring and enjoyed it. Comes highly recommended for boring people like me. Your probably boring and should buy it. Its boring.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting story, if a bit confusing on the timeline scale of things.  Once you detach from that though, it's a very interesting and drama filled read. And being able to dress up your chosen waifu is fun too.  You can choose your protagonist's gender, which is a plus for me anyway.  Going to play the second game soon.",
            "review_score": "1"
        },
        {
            "review_text": "I got this as part of a bundle and honestly expected nothing at all. At first, I didn't even want to play it. But I'm glad I did. It is strange at first, and gets stranger still as a culture unfolds in the form of ship logs that seem both intriguing and awful at the same time. I ended up playing this before bed and looking forward to it like one might to reading a good book. It's not a long game - I have 7.7 hours logged and have gotten all the achievements, but it's well worth the time.  If you like stories and you don't mind reading, I absolutely recommend getting this.",
            "review_score": "1"
        },
        {
            "review_text": "You know what, screw all the stuff I was going to write, the only part that matters is that there's a psycho AI Korean cosplaying chick that thinks you're cute. If you're an ♥♥♥♥♥♥♥ to her ('cause lets face it, its fun) you literally get a Game Over.  Would su change_outfit again.  (its a visual novel about two AI chicks with serious issues, you already know if you like this game or not don't you)",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game completely and I have to say I am impressed. I love the story. It's pretty dark and mature at times which is never really incorporated into dating sims that I've ever played. Plus, I'm a sucker for sci-fi and asian culture.",
            "review_score": "1"
        },
        {
            "review_text": "A very clever, if short, Visual Novel that tells a tale of a horrible tragedy, the man sent to investigate it, and the two AIs that help him uncover the truth.  The player is sent to investigate a colony ship that has been out of communication for a very long time. You are told to figure out what happened, copy the files, and get out, and that the ships AI, *Mute, would assist you. But when you arrive *Mute is disabled--and instead, you run across an AI called *Hyun-ae. Who is *Hyuan-ae? What happened to the colony ship and the passangers? What about *Mute? To find out the answers to these questions, you must read through the various ship log files (letters, diaries, etc.)--and chat with the AIs.  What you uncover is fascinating and disturbing. If it were told in realtime, it would be a horror novel. But by setting most of the action well in the past, it allows the player to discover a happy--or at least happy-ish--ending.  If you like murder mysteries or period dramas, or crazy little love stories, give this Visual Novel a read.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a good natively English visual novel, this is the second best you'll get (next to Katawa Shoujo). Unfortunately, that says more about the poor state of English visual novels than the game itself.  Being a Visual Novel the game is heavily story driven, but it is not nearly as linear as a normal visual novel. The first time you play this non-linearity is really neat, but replays are quite tedious.  The game's feminist elements are less heavy handed than some of the author's previous works, but sometimes still over-stressed. The AI characters and the story itself are decently written.  I only recommend this in light of few better offers in the English Visual Novel niche: get it on a good sale.  Content: 3/5 (Nothing stand-out, nothing bad) Quality: 5/5 (Slick interface, no noticeable bugs) Combine: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "|RATING: 9/10|  Analogue: A Hate Story is short, but it has been one of the most satisfying visual novels that I have ever played. Considering the game's length, it is easy to pick up and finish in one sitting. You'll be hooked regardless, so there is no need to worry. There is some basic puzzle solving and you most certainly must have the ability to read in order to fully enjoy this game. The themes are rather mature, so I would not recommend that younger audiences play this game. Now with this out of the way, let us delve into it. Let us delve into the past.  You are a simple pilot investigator flying in space when you come across a ship. The ship has no life on it; however, you decide to connect to a computer terminal where you meet an artificial (yet cute) inteligence named *Hyun-ae. She greets you with much respect seeing as she hasn't had contact with anyone for over six-hundred years. The game works as a series of log files that are shown to you by *Hyun-ae, and you simply read them and talk to the artificial inteligence to listen to their responses. The AI will ask you a few questions and you'll have the ability to modify values in the terminal in order to change your story path accordingly. The concept may seem simple and boring; however, it is far more interactive than it seems. What really makes this game special is the content itself, which for emphasis, I will add, is what really takes the cake.  If you're a fan of seeing characters develop, you are most certainly looking in the right place. What really stands out though is this game's reoccuring theme regarding sexism, sexuality, and sex. The game itself portrays these themes in very unique ways, but I would just recommend playing it since there isn't much else I can say about the game's story. The themes displayed in the game are even more than just that, though. The game explains much more and will require your experiences to interpret them. There are multiple endings that allow for the players to experience each theme in a different light and perspective. Analogue: A Hate Story does not disappoint, and I highly recommend that even people who are not fond of visual novels pick up the game.  Honestly, this one is a life changer.",
            "review_score": "1"
        },
        {
            "review_text": "A very atypical game. Totally text-based, but not a text-adventure but also not quite a Visual Novel either. Nothing is too challenging but there are points where logic and reasoning are the keys to success (but barring that the game can literally spell it out for you). It's a game that makes you think, not in a puzzle-solving way but in a social/philosophical way. If that's not your thing, then stay far, far away.  At first, it felt drab, and dull. I was confused and got bored and started skipping through log data, but it didn't take long for the real nature of the game to make itself open to me. I got invested in the data as, suddenly, there's now a point to digging through the copious amounts of data. After that, you're sunk. After digging through data for clues, I found myself reading through the not-so-important cultural stuff just to get a better feeling for the world I was exploring. Even the logs I skipped I went back and re-read. It's all done very cleverly and I definitely reccomend this to anyone seeking an intellectually stimulating fun time.",
            "review_score": "1"
        },
        {
            "review_text": "This has a really good story, with some interesting twists. You really need to play through all of the possible options to get the whole story and understand how and why things happened. It's definitely worth taking the time to explore fully.",
            "review_score": "1"
        },
        {
            "review_text": "This game may be short, but it packs a lot into that amount of time. I think the most amazing part of Analogue is the fact that I spent the entire game willing to believe that I was in fact dealing with a derilict space ship's computer. Everything from the AI interface all the was back down to the cmd prompt style overrider terminal seemed authentic - like a viable interface. Even some of the incongruent behavior of the AI Hyun-ae is explained away, but to go further in would be a spoiler and a disservice to any potential player.  At first I was just trying to dig for the ship's admin password, but before long I wanted to know what happened to the inhabitants of this doomed colony ship - and I'm excited to learn more about the ship's history in the upcoming Hate Plus.  This is one of the better visual novels I've explored (and the most interactive) and by far the most immersive. To anyone seeking a good sci-fi or general lost-history mystery, I must fully recommend Analogue: A Hate Story.",
            "review_score": "1"
        },
        {
            "review_text": "Analogue: A Hate Story made me internalize how horrifying it would be to live in an extremely patriarchal society like I never have before. The personal logs detailing the lives of all these people rarely cast anyone as a straight-up villain. Most people are trying to do what's right, but their society being what it is, no one has the knowledge to want to, or power to, change it, despite the suffering and extreme rigidity of their lives.   The way more logs are unlocked over time as you read through them with the ship AI:s is very compelling and it lends a lot of personality to the logs since the AI:s can expand upon them, or even contradict them.  I'd highly recommend Analogue: A Hate Story because of it's compelling story, intricate characters and cute AI waifus.",
            "review_score": "1"
        },
        {
            "review_text": "For a visual novel that has only 2 characters you can interact with, it surprisingly has a lot of depth and characterization than most other visual novels.  The 2 characters do not even do much to establish themselves, all the information about them comes from the logs other people made. The logs, in my opinion, are both a good and bad design choice. It’s good because it’s up to your imagination to process what is going on. On the other hand, it feels like I’m reading a history book all over again! Maybe it’s all the dates and charts that makes me feel that way, but I think it could have been handled a little better.   The game did not need player choices since the backstory mattered more than the characters, but it was neat that they included that. One player choice in particular had such a good and elaborate setup that I consider it most memorable moral choice in any visual novel I have played so far. I’m not going to spoil what it is, but you’ll know it when you see it.  Overall, I recommend this game to both visual novel fans and people who have not played a visual novel before.  ",
            "review_score": "1"
        },
        {
            "review_text": "Got the best ending yeay!  alright let's move to th review -Gameplay : Like reading a novel but with multiple ending. 7/10 -Graphic : not much to be reviewed. it's ok 6.5/10 -Sound : I hope the girls have voice. but BGM good enough 7,5/10 -Storyline : The most interesting in VN.the plot are very deep shocking and confusing story but i like it. 9/10  Dating Sim? not very much because in this VN you are trying learn the truth.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best game I have played this YEAR! The story is cleverly pieced together in tidbits of diary entries and letters in addition to the dialogue. But what really makes it shien is the deep emotion that goes into every line. You feel the frustration of the magistrate complaining about this and that, and more importantly the frustrations of 'The Pale Bride' a sick girl of 13 who is forced to marry despite being of a modern mindset.",
            "review_score": "1"
        },
        {
            "review_text": "it's not my first time playing visual novels, and i must say, this one is quiet addicting. the story, characters, and ost are great. i highly recommend it to any who might like VNs.   overall score: 10/10.  i enjoyed each second of this game. i had fun, and thats what matters.",
            "review_score": "1"
        },
        {
            "review_text": "Worth reading/playing. Characters that inspires a great deal of empathy, combined with a tragic story (in both the modern and the classical sense). Interesting approach to storytelling (piecing together a narrative by looking through logs and letters). At least two major plot twists are heavily foreshadowed - you can probably guess one 'spoiler' within the first ten minutes - but I think the foreshadowing is done well. Finally, it's a thought-provoking (if not unique) cautionary tale - if humanity does undertake a 'generational' approach to extraplanetary space travel, what could happen if knowledge of the science and technology is lost? (Even today, almost everyone relies on some invention or technology they don't fully understand.)",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game. It has a deeply engrossing story to read that leaves you wanting more. Definitely worth the money, so check it out!",
            "review_score": "1"
        },
        {
            "review_text": "Buy it cheap - it's an interesting little visual novel game, with some good world-building, interesting characters and a really unusual but quite enjoyable way of getting the information to you and letting you interact with the two other characters. However, it's really short with very little replay value other than for the purpose of unlocking Steam achievements or getting a particular save file in place of the purposes of importing into the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Well written, touching, gruesome and important. Comes highly recommended if you like good writing in games or read sci-fi authors like Ursula K. LeGuin.",
            "review_score": "1"
        },
        {
            "review_text": "Developer Christine Love can be counted on to do interesting things with games and storytelling, and both Analogue and its sequel are well worth playing if you want something slow-paced and well-written.",
            "review_score": "1"
        },
        {
            "review_text": "A very good, if text-heavy visual novel style game. The plot unfolds almost entirely through text, so if you do not enjoy having to do alot of reading, you may want to skip this game. Otherwise, it is an enjoyable read, with very good music, and a clever, attractive GUI.  The plot itself is good, but not exceptional; the power of the game is instead in the execution. The plot may be quite simple, and some character interactions are predictable, yet there is so much beauty and sorrow in this earnestness. Analogue is at its core a vulnerable, self-aware tale; one of redemption, repression, and the very human desire for someone to legitimise your beliefs and your actions. If you give it credit, and go into it realizing that it has two faces, you will find a pleasant intelligence in both its seriousness and self-referential humor.  The creator has also consistently delivered solid games, and several of them are free, so if you do enjoy Analogue, definitely try them out.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, I can't NOT recommend this VN anymore. (Visual Novel) Note the term is Visual Novel, meaning the focus is intensely on the story and not gameplay. If you enjoy a good mature read, and/or anime girls in cosplay... (xD) Then you'll easily love this VN. The writing is fantastic, Christine Love is a brlliant writer of Tragedy. Yup, this is a Tragedy as defined by drama. It's rare to find a gameworld that draws me in and engrosses me as much as 'Analogue: A Hate Story' and it's sequal 'Hate Plus' encouraging multiple playthroughs to simply uncover the whole of each story within. Lots of pebbles and a few rocks are thrown at the forth wall without shattering it, it's as much funny tongue in cheek as it is serious 'Trigger.'  WARNING: As said. Trigger. Massive trigger. If you have 'had a tramatizing experience with' or 'deeply rooted values against' the following; homosexuality, ♥♥♥♥, depression, suicide, and overall prejudiced ♥♥♥♥♥♥♥t, then read and enjoy this with a close friend. This game/series can be a massive trigger if it blindsides you with it's content. The subject matter is as mature as it gets and still handles it with tact and feels.  HIghly recommended (For Mature audiences)",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, great story. Short, but that's only a complaint because I liked it so much I wanted more.",
            "review_score": "1"
        },
        {
            "review_text": "Great story, good art, and fun gameplay (the console is so cool!).",
            "review_score": "1"
        },
        {
            "review_text": "Men are honoured, women are debased. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "There are so few worthy VN's on Steam, that I have to give this a mild recommendation if you're interested in the genre. It's short, but the story is interesting and there's some little flickers of creativity.   Just don't buy it at full-price. It's way too short and simple to justify shelling out ten bucks. WAIT UNTIL A SALE!",
            "review_score": "1"
        },
        {
            "review_text": "A visual novel game which is supposed to have a fairly dark theme to it. A ship which vanished thousands of years ago reappears and you are sent to investigate what happened on the ship. You come across the AI of the ship and go through logs to understand what happened.   Play this game as though you have no knowledge of unix commands otherwise you'll just hit an ending in less than 10 minutes like how I did (after some guessing). The terminal is fun to use with it's limited available commands but you should definitely find out the use of the commands as you unfold the game.",
            "review_score": "1"
        },
        {
            "review_text": "this is a game that made me want to destroy all men. i went from a unassuming naive girl to a hard line lesbian feminist plotting to end male life on this planet, all in 3 hours.",
            "review_score": "1"
        },
        {
            "review_text": "Analogue is a visual novel with a few sprinklings of Adventure game added for good measure. That means that the majority of your time playing this game will be spent reading. Having said this, the game is absolutely fantastic. The writing is superb and delivers both interesting characters and a fully-realized world. The anime visuals look great and the fully diegetic layout (coupled with a nice soundtrack) does a great job of really immersing the player.  There are a couple of genuinely shocking moments in the game, but they don't feel gratuitous and actually make for some really emotional moments. I can say without hyperbole that this was one of a very few games that has made me cry.  A word of warning, the game may be inappropriate for younger gamers, but that's for parents to decide, not me (you know your kids). Play it and decide for yourself (it's only a 2-3 hours).  If you like this, check out Digital: a Love story, an excellent (free) game by the same person.",
            "review_score": "1"
        },
        {
            "review_text": "Well - to make it short: This Game is (beside a couple of other examples, like Planetarian for example) one of the prime reasons I like Visual Novels so much. The sortyline is interesting, well written and absolutely intoxicating. The developer always manages it to make you wonder 'How will it go on ? What the heck happened here ?' And - at least in my case - the ending, or the solution to what happened aboard managed it to trigger something like a slight feeling of dismay.  Okay, but what is this game acutally about ? You´re playing as some sort of investigator, checking on a derelict space craft. Or to be specific a generation ship. You´ll manage to get in touch with the ships AI system and start exposing the dark secrets which finally led to the crews downfall.   If you´ve never played a visual novel before - what exactly are those ? Aren´t they these strange japanese porn games ?  Nope. You can imagine it like one of the old choose your own adventure books. Depending on the choices you make during the game, you´ll see one of several endings. Hm ... where have I seen that before ?   Right ! Take one of the Telltale Games, substract most of the animation and replace it with some anime-styled pictures, add the point that most your choices will have an actual impact on the ending et voila - you´ve got a VN.  So, would I reccomend this game ? Hell, yes - i´d even go further: go and buy the sequel 'Hate Plus' as well ... it gives some nice information, what happened before the story you´ll unfold and the story is as good as in the first game.",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of Christine Love's work, I was surprised that I hadn't bought this game sooner. I do not regret my decision though, as I quite enjoyed this Visual Novel. The interface and interactions are unique in a way that makes the game very enjoyable. I can't wait to play the next one.",
            "review_score": "1"
        },
        {
            "review_text": "It's heartwrenching and bittersweet and also you have to shut down a nuclear reactor before it explodes. What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, but prepare to do a lot of reading. The story is quite deep and involving and of course this game has the potential for a romantic relationship with a computer AI; I mean that's great isn't it? There is depth in the characters background and there is more overall game time than most modern action games. It plays well on any computer and it has a sequel too! A game doesn't need fancy 3D graphics and full motion video sequences to be fun.",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding story. It draws you in and forms a connection with you. Many games these days fall short on the story telling aspect. If you enjoy reading and you like anime, you will love this game.",
            "review_score": "1"
        },
        {
            "review_text": "A really interesting way of telling a story, and a great story to boot. If you enjoy visual novels, this one is a must play.",
            "review_score": "1"
        },
        {
            "review_text": "If you're willing to strain your eyes reading from your lcd monitor you'll find an engrossing story with characters able to hit you in your emotional gut",
            "review_score": "1"
        },
        {
            "review_text": "Analogue: A Hate Story is a visual novel and this is my first time playing one and I can honestly say I enjoyed it.  The story without giving much away is that you are sent to recover as much data from this spaceship as possible, as you dig into the data you start to see the political agendas of the residents, their relationships with eachother and how things were on the ship, theres two diffrent AI on the ship that you can interact with, they both have very different personalities and thats all i can say about them without spoiling the story.   The entire game is more a menu that you are in and go through and its a ton of reading so if you dont like reading then stear clear.  This game as most other reviews have pointed out it has feminist themes and thats not entirely a bad thing given the way their society functions and its all that, society, does that make everything they do right? no, but you can understand the way it can be viewed as wrong or right, everyone in this story is/was a product of their education system.   All in all this game is a VERY story driven game that had me caring for the people in it or haiting them with a passion which is what good story telling is supposed to do.  PROS awesome story great characters easy to understand interface   Cons DOS like interface can be hard for someone thats never used it before. awkward scene to read in 'Block2' totally nsfw...or anywhere with people look at your computer for that matter haha.  I give this game a 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Step 1: Google Christine Love Step 2: Insert credit card Step 3: Cry  Christine Love/10",
            "review_score": "1"
        },
        {
            "review_text": "Please let us configure the Z shell!",
            "review_score": "1"
        },
        {
            "review_text": "very fun...i loved it ....but it may be hard for you guys and girls who don't read.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on a whim after playing Gone Home and To The Moon, looking for more narrative experience focused games. Games that use mechanics as a means of enhancing the story in ways that books and movies can't, opposed to the more traditional model in games of 'shoot the dudes' -&gt; 'watch a cutscene' -&gt; repeat.  I got way more than I expected.  For one thing, I got way more text than I expected. No one should take it's 'visual novel' tag lightly. You will be reading a LOT in this game.  But what I really didn't expect is to love this game as much as I do. It has, hands down, some of the best writing I have ever experienced in a video game. It drew me in, got me more and more engaged as time went on and had me in tears at the conclusion. It delves into topics like AI and transhumanism, societal norms and women's rights, and it does it so, so well.  I went in not knowing what to expect and came out being able to label this as one of my favorite games of all time, and an overall sense of hope for the future of video games as an art form.  Also the soundtrack is awesome. And there's a simulated terminal interface.  Play this game.",
            "review_score": "1"
        },
        {
            "review_text": "More of an old-school text adventure than a VN in my opinion. Btw, this is DARK. REALLY dark.   Worth it for the $10 they're asking for. The replay value is limited (outside of getting the alternate endings) but the story itself mixed in with the interface really makes you feel like an investigator working on a derelict ship.  I recommend this wholeheartedly.",
            "review_score": "1"
        },
        {
            "review_text": "Cool story, likeable characters and an interisting interface. A bit confusing at first but well worth it. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Let me start by saying this is not something everyone can like due to its Anime Date Sim style. However if you're here than probably this doesn't affect you.  This is a very nice game, except it gives off the vibe as if there was something more they wanted to do. In the end you have a huge loads of mechanics but you never truly go in-depth on them:  - Calendar and special events are few; - A Terminal element which only really gets focused thrice.  The plot was somewhat interesting but at the same time it felt lacking, however back when I played I did not know if there was any sequel in development (which is now available).  Without spoiling much this is drama story between two noble families living on a space ship following the traditional old values. Wish I could tell more, but I rather not risk spoiling it :)",
            "review_score": "1"
        },
        {
            "review_text": "There is a lack of asinine behavior and propane, but the girls are cute I tell you h'what.",
            "review_score": "1"
        },
        {
            "review_text": "MOAR. VISUAL. NOVEL. Pretty please?",
            "review_score": "1"
        },
        {
            "review_text": "A Hate story? No.   A Sad story.   A story that worth your money, and time.",
            "review_score": "1"
        },
        {
            "review_text": "perfect  buy it now  but beware this is truely a hate story",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly good.",
            "review_score": "1"
        },
        {
            "review_text": "This game touched me deeply. Anyone with harsh parents would understand.",
            "review_score": "1"
        },
        {
            "review_text": "FEMINIST ALERT.  The game is written with the author's ideological agenda at the forefront. If you don't agree with it, which you get the option to do like once because the game is 95% reading, the game just ends. So play this only if you don't mind huge factual distortions and bias.  The author doesn't pay much attention to the facts of Joseon Korea on which its society claims to be based. It is breathtakingly bigoted to simplify 500 years of Joseon Korean culture, society, history and upheaval into TYRANNICAL PATRIARCHY. Essentially, this Hate Story is a feminist diatribe against a society which the author knows sweet dang all about. You get the privilege of paying to read it.  That said, if you can get past the head-bashing insistence with which the author cries THESE GIRLS ARE SOOOO OPPRESSED, the game holds up as a functional sci-fi flick with some Korean elements. If that's quirky enough to get your attention, give it a try by all means, but please take what it says about Joseon society with a huge portion of salt.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros :- You can have two waifu in this games...  - Ummm, you can say it has a gameplay on its way... It's Unique, never seen this kind of VN before.. Cons : The main gameplay of this game is opening Log Files, very much it is... Scrolling scrolling, next - scrolling scrolling next... Aannd it kinda hurt my hand a bit....   Last but not least, The most value of this game has is, You can have two waifu in this game.... That's it...",
            "review_score": "-1"
        },
        {
            "review_text": "I found a friendly a.i. then met another who instantly hit on me. I stopped a reactor meltdown, played dress up with *Hyun-ae, discovered the horrible truth, fell in love, got a new waifu, escaped with waifu, put hand on screen in love, then cried when I remembered it was a game... 11/10. ",
            "review_score": "1"
        },
        {
            "review_text": "I didn't know what to expect going into this, but what I got was a visual novel with an engaging story with strong feminist tones. Great for fans of the visual novel/dating game scene, and with some terminal and detective work to do, and a few ending to see, it is worth a few hours of gaming.",
            "review_score": "1"
        },
        {
            "review_text": "If you like visual novels, you'll probably like this game. If you don't then I doubt this will be THE ONE to change your mind. It's definately worth playing through through.  No happy ending though, this is a hate story.",
            "review_score": "1"
        },
        {
            "review_text": "Linux: The Game has some interesting sci-fi stuff, lots of dialogue to read, and hot-♥♥♥ AI. Don't be fooled though: this is an SJW game in disguise. Not that much of a disguise though, since it's so blatently obvious. Only recommend to those who are very insecure around any male. Decent ♥♥♥♥♥♥♥ability, though.",
            "review_score": "-1"
        },
        {
            "review_text": "Okay. I'm gonna be honest here. This is not your typical game. In fact, I'm not sure if I can call it a game. For starters, it is a visual novel, which is at best an atypical kind of game. Second, you will not have fun playing it. In fact, you will be appalled, /horrified/ by this software at times. As more and more information is revealed to you, you are told a story about thoroughly contrasting values, misogyny and arranged marriages in a society where people are ignorant of the very environment around them and women are treated like things, not like people. With all this said, though, it's worth going through it, because it invites you to think about how society can regress into archaism when it doesn't find a way to progress and, apart of the misogyny and arranged marriage dilemma, it also offers a question: When computers become advanced enough, what makes them different from humans? If you're a visual novel enthusiast and like things that make you think, you should have this.",
            "review_score": "1"
        },
        {
            "review_text": "And That's how i got into japanese porn",
            "review_score": "1"
        },
        {
            "review_text": "Probably the visually blandest visual novel I've played so far.",
            "review_score": "-1"
        },
        {
            "review_text": "Please, no more weeb trash on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "A lot of words in this game, but none of them start with 'g' and end with 'oblet.' I'm disappointed as I had heard good things. How can you write so many words without even mentioning goblets?",
            "review_score": "-1"
        },
        {
            "review_text": "I REGRET EVER INSTALLING THIS",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game through a trade and I feel more ripped off by the contents of this game than the trader who gave me this steaming pile of ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't played many visual novels, only two in fact, but I really enjoyed this one. Looking past its very typical anime presentation, there is a really intriguing story and compelling mechanics. There are a couple of cringey fan service moments, and there is a bit of silly romance in there with the AI you spend a lot of the game interacting with, but for the most part you will be trawling through archives of diaries and letters on an abandoned space station, filled with family fueds and intrigue, and you will eventually learn what happened to the station and the people on it. Because you're reading through people's very personal writings, you get a very intimate perspective on the whole story that works wonderfully to make the long dead characters come to life again.   If you're interested in playing games with good stories, I would recommend trying this out, and it's very accessible for people who haven't played visual novels before.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a fan of visual novels and this was a very unique one. This is not your average Visual Novel. In this visual novel you investigate the mystery behind the disappearance of a generation ship by reading through the message logs of the dead crew of the ship. There are two female AI's who will help you in the task, and those are the two pursuable characters. There are two routes and five endings.",
            "review_score": "1"
        },
        {
            "review_text": "I thought this was a sequal to Digital but apparently not.  It's a visual novel with only a couple of backgrounds and a slew of confusing names to remember. The story is broken up into data entries which are not unlocked chronologically so it can be confusing to line up all dates and characters.  I enjoyed the first play through and I sped through a second time to get the achievements.  If you like VNs get it, otherwise don't. It's nothing exceptional but it got me to buy the sequal.",
            "review_score": "1"
        },
        {
            "review_text": "First things first: it's a visual novel. If that's not your thing, this game offers no significantly different mechanics to win you over.  That said, it is one of the best games I've ever played. As an impartial observer of the past, you try to understand an entirely different people who lost their history and culture while isolated from the rest of humanity. You know they all died suddenly and it doesn't take long to figure out how. It's the 'why' that drives you to complete this games gut-wrenching story, knowing all the while that it will be a horrific conclusion.   There is nothing happy about this game. It's the kind of story with characters that make you feel physically ill and events that make you shudder or at times angry. At any point in time, you can interact with two characters: one who disapproves of the world you're exploring and one who defends it.   In the end, it's a brilliantly written morality play where any good, justice or kindness are hard to find.",
            "review_score": "1"
        },
        {
            "review_text": "The art style is very pleasing, has a very interesting plot, and is very well made with an amazing soundtrack. It's very addicting and even if you don't enjoy many visual novels, this one is different from most visual novels in general.",
            "review_score": "1"
        },
        {
            "review_text": "A visual novel that will make you fall in love with an AI (or not).  Enjoyed the parts where you use a terminal (although they can be repetitive in the end) and the fact that Mugunghwa's society is based on the Joseon dinasty.",
            "review_score": "1"
        },
        {
            "review_text": "I have spent nearly the past 6 hours straight just playing this game, and I cannont get over how well done it is! This is a fantastic game, from character development to plot, it may have a ton of reading to it, but as long as you don't mind that, this game is really fantastic!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and dark story in a far-future setting. With 70+ different logs to uncover and five possible endings, you have reason to play with your AI companions more than once. The right mix of humor, mystery, and tragedy. What made this visual novel stand out for me was the fact that it was really only as deep as you wanted it to be. You can 'beat' it very quickly, but to really learn about the truth, and uncover the most interesting logs, you owe it to yourself to stick around. The command prompt feature ensures you'll not find a VU quite like this one.",
            "review_score": "1"
        },
        {
            "review_text": "It's about as subtle as a brick to the face but I think the message was well executed. Also does some interesting things with the format of the visual novel, mostly in the form of explaining how that form of interaction could actually make sense. One section in particular really stands out as a great meeting of mechanics and story. Worth playing as a curiosity, but be warned. It doesn't play nice.",
            "review_score": "1"
        },
        {
            "review_text": "This is incredibly depressing, but amazing.",
            "review_score": "1"
        },
        {
            "review_text": "At best, I am slightly positive about this game. At worst, I am ambivalent.  The game at its core is a visual novel based on Korean comics (made by Americans and/or some westerners as far as I can tell).  2.50$ for 6 hours was an acceptable bargain; I've heard there will be some DLCs but it is unlikely I would pay more than 5$ for if the duration will be short.  What I hope for is for Valve to actually go into the Asian market and negotiate with some developers there (Softstar, Eushully, Aqua-leaf, etc.) and introduce some games from overseas.  Well, I can only hope so.",
            "review_score": "1"
        },
        {
            "review_text": "Christine Love is a really, really good writer, one capable of astonishing deftness in her work. Love’s pet themes have been concepts related to voyeurism and technology; gay and straight relationships; cultural boundaries; women’s rights and issues. If you can appreciate fearless writing and a payoff that requires some investiture from you, then yeah, Analogue: A Hate Story is worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "This game demands your time. This game wants you to read a lot of text and dress up cute anime girls in dresses. IT also has multiple endings and interesting subject matter. If you liked Digital: A Love Story, you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Lord Vader gave me this game as a gift for failing to protect the Death Star. I was looking for ♥♥♥♥ and hentai like in most VNs. Instead, I found a sad story about a ship (most likely a rebel ship) going nuts in space. Hyun-ae and Mute pulled at my heart strings in different ways. Still planning on going back to check out all the logs and ♥♥♥♥. As a gamer and a Sith, I find this to be one of the greatest 'games' I have ever played, and it still leaves me thinking when I'm alone. Hate Plus is also good, check that one out too.  I cannot give a score to this, but I would kill more space monks for more games like this. Good job guys.",
            "review_score": "1"
        },
        {
            "review_text": "So, this game has two entry barriers:  1) You should be willing to spend most of the time playing this game reading walls of text. 2) You should feel comfortable typing commands into a unix-ish kind of interface.  If these two things aren't instant turnoffs for you, you might like this game.  I don't really like games that are really 'in-your-face' when dealing with certain topics. But, despite the lack of subtlety, this game really gets you thinking about its center topic (sexism) a lot, so I gave it a pass.  When it comes to mechanics, this game really knows how to create an immersive experience. Most of the things you see on the screen are diegetic so you might as well turn off the lights, put some headphones and pretend you are in the vicinity of a derelict spaceship, trying to learn its secrets through a computer terminal on a ship of your own.  The only thing that really bothered me, was that while using the terminal, I found myself pushing tab or the arrow keys the way as someone using UNIX or Linux would and though there's no real reason for the game to behave exactly as these systems it's kind of nice to have it respond to you the way you'd expect. It makes it for an easier and more comfortable interface.   Anyway, this game was a very interesting approach to visual novels and I really enjoyed playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game somewhat, but I'm guessing that the majority of people would get bored with it, find it confusing, or something. Not recommended unless you know what you're getting.",
            "review_score": "-1"
        },
        {
            "review_text": "Thinking outside the box of visual novels. Not simply tugging on emotions, but delving deeply into the morality of humanity.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant but unorthodox VN. It can be difficult to remember some of the Korean names but the story makes it well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended. What I liked was that the game doesn't take very long to complete, even with the branching storyline, and it's a well written story. There's only one traditional 'adventure game'-type puzzle, which is the nuclear reactor, but it's easy to solve. The real puzzle is trying to see all of the log files and getting all the endings, to try to get the best picture you can of what happened to the spaceship and its inhabitants. Normally, in any one playthrough, you would not be able to see everything, but in a metanarrative sort of way, since you can go back and start over, you can combine your knowledge from different playthroughs to put everything together. Another game which does this is 'Nine Hours, Nine Persons, Nine Doors.'   Most of the game is spent reading. Once you've played through once, you can skip reading the log entries that you've already done, and you can skip any dialog with the AIs, making it easier to get to the other branches. This game is a visual novel, but instead of showing text in a small 4-line box like most Japanese VNs, this game uses the full screen to show text, which I liked.   As for the story, I liked it. The inhabitants of the spaceship, in the years covered by the logs, live in a society based on a historical period of Korea. There's a real struggle for the main character, who is really like a time traveler from today's world, to be understood and to try to live in this society. The only thing I wish is that there were more written about what happened on the spaceship. You only get a glimpse of the lives of a few characters, momentary fragments in time in the form of letters, diary entries, or other notes.   Overall, an excellent game.",
            "review_score": "1"
        },
        {
            "review_text": "A unique visual novel where you get to read the emails of dead people and have fun with anime AI waifus.",
            "review_score": "1"
        },
        {
            "review_text": "do you want to learn about feudalistic korean politics in space with waifu AIs that hate each other? heck yes you do  also: lesbian erotica",
            "review_score": "1"
        },
        {
            "review_text": "A lot better than I expected it to be.  The soundtrack is nice, and the story is not in any way what I was expecting from an anime styled visual novel. Very brutal.  Be prepared to read a lot. It's a solid 4 hours of interesting material.",
            "review_score": "1"
        },
        {
            "review_text": "read about the sex life of a bisexual  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed this game. If you enjoy story-based reading, with a bit of a twist, then give this game a try.",
            "review_score": "1"
        },
        {
            "review_text": "Analogue is amazing! I love it so much! I can play it over and over again! Also, Hyun-ae is basically my new waifu...",
            "review_score": "1"
        },
        {
            "review_text": "If a story doesn't make me want to stare at a wall for hours having been mentally shattered by the conclusion, I'm not satisfied. I'm not to the conclusion yet, but so far it's decent. Nothing that makes me want to cry in a corner, though.  It's not the best thing in the world, but it's worth getting when it's on sale. If you're a fan of visual novels, it's worth getting even when not on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This has to be the best visual novel/game I have ever played. It's relatively short, even with all the different endings. It took me about 3 hours for my first playthrough and I know that each playthrough afterwards will show me very little in terms of new logs and dialogue. Honestly, this is the first game to every maybe almost kinda make me cry. I'm not crying. ;_; The story is extremely emotional, and after the first hour it'll have you hooked. If you enjoy VNs or books, I would highly recommend this. This is a game that even with only 3-5 hours of gameplay, meant more to me than any other of my steam games. The creator has opened me up to the residents of the Mugunghwa and left me craving for more.  TL;DR: I cried. *Hyun-ae&lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Well-written, interesting story and some suprising moments. I would say I loved the 'down with the patriarchy' theme, except for how oddly it contrasts with the whole waifu thing... to me, the endings take away from the believability of the characters. Great visual novel if you don't have a lot of time on your hands/would like to learn some korean history",
            "review_score": "1"
        },
        {
            "review_text": "Loved this, interesting world, interesting story, will replay to unlock the bits I missed out.",
            "review_score": "1"
        },
        {
            "review_text": "The moste elegant gameplay I've ever experienced in a visual novel. Very engaging, amazing writing.",
            "review_score": "1"
        },
        {
            "review_text": "Read it, think about it, read it again and found a great Story.",
            "review_score": "1"
        },
        {
            "review_text": "I was a bit leery of the whole 'visual novel' aspect of the game, but after receiving it as part of an indie bundle, I decided to try it out. While rather short - about five hours - I thoroughly enjoyed it. It gets rather emotional, and even more so if you allow yourself to be immersed into the setting. It took me a while to make sense of everything - probably about half an hour - but once you understand who all of the major players are, and start to grasp the setting, things really get awesome.  Sadly, the emotional impact was diminished quite a bit whilst trying to achieve the alternate endings. Going over documents I had already read just wasn't quite as stimulating as the first time, although ocassionally I'd stumble over new content that would make me laugh (or cry, as it were).   Anyway, if you like the concept of video games as art, I think you'll absolutely love this game. If you expect any sort of action, then look elsewhere. This game is very slow-paced (as it should be).",
            "review_score": "1"
        },
        {
            "review_text": "Firstly: This is a visual novel. There isn't any fancy gameplay, or pretty graphics, or high interactivity to be found here.  But there is a story, and nice-looking anime girls, and multiple endings. More than enough for a VN enthusiast. Bonus points for social commentary and breaking the fourth wall.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game. It took some time getting used to and you can finish it within three hours (after several screwups) So yea! i recommend it its really fun and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best interactive story games I have ever played!  ",
            "review_score": "1"
        },
        {
            "review_text": "I don’t usually enjoy these types of games, but I liked this one. It’s sort of like an interactive mystery novel with pictures (be prepared fod for a lot of reading). The reason I liked it is because the story is, shockingly, pretty interesting. It also introduces enough game elements to prevent it from being nothing more than a pure text adventure and the length is just right.  You play the part of a salvager who is trying to uncover what happened on a derelict generation ship, which is one of the theorized ways humans might be able to explore the galaxy. The way this story goes is how I think such an attempt would end in real life, too (I’ll stop here before revealing any spoilers).  There are different levels of depth to be discovered to the story as well as multiple endings. What you uncover depends on what questions you ask and how deep you dig. The game is also timed, in a way, so that after a certain point certain endings become impossible depending on what you’ve done so far. Thankfully, the game’s length is paced excellently so right around the time you are getting tired of reading the text, you’ll find yourself near the end. You’re also able to speed through much of the text on subsequent playthroughs to see different endings, which is nice.  I liked the music a lot, too. It sets a very appropriate mood throughout the story. I played this with headphones on and I’d recommend that. It greatly increases the immersive feel as this game is best enjoyed with a couple of hours blocked out and no distractions to take you away from it, not unlike reading a book.  Is it worth $10, though? That’s a tough call and will depend on just how much you like this sort of thing. It will only take you 2-3 hours to get through this and considerably less to view the alternate endings, if you even care about doing that. And once you beat it, there is little reason to play through it again. I bought it during a Steam sale, though, and am content with what I paid for it.  I will say that the music and writing are above average and the artwork is well done. This is essentially an adventure game that removes all of the pointing &amp; clicking and walking around aimlessly through the same maps. To me, that is a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "So, going into this, I wasn't expecting much. Just another VN maybe.  But honestly, this is one of the most amazing stories I have ever had the pleasure of moving through.  Get this game. Play it. Read. Enjoy. Cry.",
            "review_score": "1"
        },
        {
            "review_text": "Deep story, loved the game! And the second one is really good too!",
            "review_score": "1"
        },
        {
            "review_text": "This game... Got it through the Valentine's day sale, and am I happy that I did. Interesting mechanics, lovable AI, and a compelling stary make this a must-play.   I'm gonna go cry now...",
            "review_score": "1"
        },
        {
            "review_text": "I have to say I really enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "At first when I started playing this game, I was very dissapointed with the way the game progress by just reading message after message. I thought it would be like Japanese Visual Novel. Nevertheless, I gave this game a chance, and start interacting with the AI and read the message on and on.   And guess what, I got sucked in so deep to the story it unfolded--the way these message presented its novel, it just makes me hunger to find out the truth. Different AI provided different point of view and revealing different story and scandal. I must take it all back that I feel dissaponted with this game.   This game is really good, with highly addictive story in the form of message and interactive AI. Yes, it is different from the normal Japanese Visual Novel, but different doesn't mean this game is not enjoyable.   If you love a good story filled with emotional torrents, and two cute AI to interact with, then give this game a chance. Trying playing its demo first if you must. And in the end, I guaranteed you that you will get addicted to the story that you cannot stop playing... it's like you need to keep on going for the desires of finding out the truth of what really happened on that spaceship.",
            "review_score": "1"
        },
        {
            "review_text": "$10 is a bit steep, especialy when you get about 75% of the game in the demo, but for people who love to emerse yourselves and truly believe you are a part of the story, pick it up. I'm not dissapointed in the least.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a visual novel. If you have no idea what a visual novel is, it is essentially a Japanese-style porn game without the porn. What you have left is a heaping supply of writing, well-translated from Korean, and a mystery that you can uncover by reading it all.  There's some game elements to it in that what you read can be shown to your AI companion to unlock more things to read. Plus a pseudo terminal in which you type in commands that will help you unlock more things to read.  There's not much game here and you're better off with the far more fascinating predecessor which is free on the Internet. The predecessor is called Digital: A Love Story (and it will remind you why dialing into BBS systems was a ♥♥♥♥♥).  Ultimately, there's not much here, but it can be an interesting distraction for those who like art games like Dear Esther or Home. This game is not like either of them.",
            "review_score": "1"
        },
        {
            "review_text": "Analogue : A Hate Story and its sequel Hate Plus are both excellent. If you like to read good stories, this one is complex and far from being manichean.  The whole scenario is really good and your choices (and how you define yourself as the main character) will have some serious consequences.   If you prefer action packed games and/or do not like dramatic or tragic stories, go your way...",
            "review_score": "1"
        },
        {
            "review_text": "I took a look at Christine Love's Google+ stream, in which she says that the *first draft* of the game had some 57000 words. So yes, there's a lot to read. I have now found two of the endings (one being the premature one) and I have, apparently, read altogether about 87% of all the entries in the game, so there's still things for me to do. So far, I've spent 3.1 hours on the game.  Adventure games are often 'disposable' - play through it once and you're done. Sure, you won't be playing this as much as a multiplayer FPS, but I'd expect the second playthrough being far more interesting than it was in, say, Syberia.  Of course, if you're the type to throw 'tl;dr' around like rice at a wedding, you're not going to like this. If not, well, I suggest you give the demo a shot. It took me 40 minutes to clear, and I think the demo was quite indicative of what the rest of the game would be like.",
            "review_score": "1"
        },
        {
            "review_text": "While this isn't Love's most captivating work, it definitely was worth the read.  The gameplay consists of reading documents, or Log Files, from the ship Mugunghwa, and well, read the overview for that sort of information. This game most definitely is different from your usual Visual Novel in gameplay styles, not to mention Love's storytelling style that always amazes.  If you're even in the least interested in this game: buy it. There's little reason to not purchase this.",
            "review_score": "1"
        },
        {
            "review_text": "Before you go any further, a primer: This is a game that is designed to be finished like a book. It is not one where you pit your -supposed- skills against computer- or human-controlled opponents. It offers a fairly refreshing twist to the way stories are normally told.  First off, let me say upfront that if action is all that matters to you (and/or you're not a fan of visual novels), don't even bother looking at this game - you're entirely incompatible with it and simply won't think much of it, so save yourself time and don't bother with the demo (or reading the rest of this review). In fact, the screenshots on the game's page are all you will ever see in the game, the rest is up to your imagination. You won't see the  Mugunghwa  or its interior, nor your own ship's. There is no voice acting, and all you will ever interact with are two AI individuals, and an override terminal through which you can switch between the two and perform some other tasks.  However, if you are willing to look beyond that, the storyline is actually pretty interesting. It's really hard to explain it without spoiling anything, and I think the description on the game's page does a fairly good job of explaining the context. I recommend giving the demo a go, it's well worth your time if you're willing to look deeper than the seemingly simple first impression - I was already captivated by the storyline in the demo, and so much so that it successfully persuaded me to get the full game.  Unfortunately, if you're still unfamiliar with the names, the questions the AI occasionally asks of your opinion will sometimes catch you off guard as you struggle to recall who they're talking about, and the inability to refer to the family tree at that juncture only serves to compound the problem.  At some point in the game, the override terminal will temporarily become an integral part of  your  story, so don't forget how to use it (although it should be easy to figure out how). It would be nice if it supported tabbed commands (i.e. pressing tab to autocomplete partially entered commands) and command history (i.e. using the up and down cursor keys to speed up entry of repeated commands) just like its real life counterparts, since at the abovementioned point in the game, you'll find yourself typing largely the same commands over and over.  All in all, a piece well worthy of your time.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game and the music, the console typing is awesome, feels like a real dos computer. Props to the music creator. The story about how everyone who lived in a space ship died and two AIs with two different views help you. A must for people who enjoy reading and like fan fiction.",
            "review_score": "1"
        },
        {
            "review_text": "Like Christine Love's earlier game Digital: a Love Story, Analogue feels like a detective story while still conveying a very compelling message about society and human relationships. The game's simulated computer interface gives the player a sense of both power and isolation, but the limited flow of information leaves you wanting more of the story, even after reading a novel's worth of log entries.",
            "review_score": "1"
        },
        {
            "review_text": "Visual novels are often hit-or-miss with audiences, and Analogue:A Hate Story is no different. The game is filled with text and offers only a few variations and decisions leading to one of only a handful of endings. Although not particularly challenging or difficult, Analogue shines with its complex storytelling and helps the player immerse themselves into a story that grips at emotions.",
            "review_score": "1"
        },
        {
            "review_text": "Don't start playing this if you have an exam the next day- this story grips you. Short and bittersweet, if you are looking for something to move you, give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Lite (very lite) on the game play, heavy on the story. The perfect game if you want a rich story with lots of intrigue, an engulfing story with lots of twists and turns. BEWARE THOUGH.... if you want a game with lite on story and heavy on game play that isn't reading a bunch of text, don't pick this up. You will hate it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is more like detective game mixed in a with chose your own adventure novel but is affected more so by what you choose to find out and how. Do mind you, there is a lot of reading in this game, but it's not without some memorable characters as well as AI personalities that change their behavior as well as what they reveal to you depending on your research/reading and answers.  The game is set in the future and played through a pseudo command console/user inference with human-like AI personalities that react to what logs/mini-stories you show them as well as how you respond to their questions.   Advice for enjoying this game: look for a character you care about and dedicate yourself to finding out more about them. Or...if you find yourself unimpressed by the people you're reading about, try digging up dirt on the AI's that are trying to assist you, there's some bizarre twists for all of them.",
            "review_score": "1"
        },
        {
            "review_text": "For what it's worth, this is a very good Visual Novel that has a few problems that arise from being a game. The story is excellent, but definitely on the depressing side. It's wonderfully done and the A.I's that accompany you on the journey were excellently written. The issue arises with the override terminal that's in the game. If you don't have some idea on how to already use a computer terminal in this way, you definitely will have issues, like I did, especially in the later stages of the game where you must use the thing in order to advance in the game with a time limit. It's frustrating and annoying and something that definitely didn't need to be there. If this game was more along the lines of it's sequel, Hate Plus, it would have been alot better. But the fact that there's an element to give it more of a game feel ironically makes it a worse game than it should have been. Still a good game and worth the 10 dollars I spent on it. But that terminal did not need to be there at all.",
            "review_score": "1"
        },
        {
            "review_text": "The story was great and almost painful to read at times. Very raw. Very real. I recommend this for people who like to read. :)",
            "review_score": "1"
        },
        {
            "review_text": "Analogue is a stunningly moving, funny, and disturbing game whose medium is perfectly tuned to its content. The thought of replaying the game to pick less kind dialogue options with *Hyun-ae makes me upset and scared.",
            "review_score": "1"
        },
        {
            "review_text": "First off -- it's a visual novel, so that'll prolly be the biggest factor in whether or not to buy.  As for the 'game' in the game, let's call it some detective work, it isn't too terribly complex. The detective work happened in the background of my mind during all that time you spend reading and by the time any decisions came up it was easy to sort out -- EXCEPT, that is, for how to get one of the three endings, which you may need a guide to find out the key first step.   However, it's a visual novel -- what matters is ambiance, quality of writing, the plot itself (which in this case is interesting, as most of it takes place in the story's own past) and, above-all, character design. All of these points, the game has plenty to offer to.  Further than that? Nothing to say without spoilers -- though quite a lot to be said as a whole.  I think of this game as a movie, one with a couple alternate endings -- for 10 bucks it was a great deal.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little visual novel to play. Lots of reading, but it weaves an enchanting story. A bit short though, but it seems like there's more than one ending available. It got very depressing right at the end, though. That's one of the very few crticisims I have; A Hate Story is almost too melodramatic and depressing for its own good. Still, the story is execllent- it almost made me tear up slightly.",
            "review_score": "1"
        },
        {
            "review_text": "Seeing as it's more of an interactive novel than a game, it's not everyone's cup of tea, but you're into games/stories that make you genuinely care about their characters, this is HIGHLY recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Wow... what an experience. It's engaging, mysterious, surreal, and enchanting all at the same time, and it made an amazing experience out of an otherwise lonely day. It's a visual novel more than anything, which means the game mostly consists of reading. Might I say it's one of the best reads I've had in a while though. And the ending a got put a huge smile on my face.",
            "review_score": "1"
        },
        {
            "review_text": "A visual novel presented in a most certainly unique format, especially with interaction and advancement, the former of which lends itself to a sense of immersion. Really splendidly done, that one. The music fine and I will spoil nothing of the story, but its just a delight. Get it if you get the chance.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game but its hard! The interface and everything is fine, it can get a bit confusing to understand everything.",
            "review_score": "1"
        },
        {
            "review_text": "By no means is this actually a game. It's a Visual Novel with text based directives, and holds a prfound story no matter your choices (minus downloading everything from the getgo or killing yourself). The story is extremely dark with only the 2 interactable and loveable characters to lighten the mood that this burdens the reader with. It's a harsh and realitsic story of how ♥♥♥♥ goes wrong. It's not for the faint of heart or of the younger age as this gets very explicit at the end (very graphic mention of lesbian ♥♥♥♥♥♥♥♥♥♥s and intercourse). In general its a great story, an excellent food for thought and how we take what have for granted. Also you may enjoy copius amounts of 'cosplay' or all the potienally laughable gender-confusion related 'deres'. I highly reccomend it for anyone looking for a good story that mixes harsh darkness with a cast that you can freely choose on whether to love or hate, as you may find something to hate in everyone. Also keep an eye for its to (or if the 19th already out) its sequel which will utilize the choices you made in this to continue the story. 'Let the Hateful Days Begin~'",
            "review_score": "1"
        },
        {
            "review_text": "In a world thousands of years into the future, you're tasked to access the system of Mugunghwa, an abandoned space ship, in order to retrieve the data onboard. Due to some unknown reason, Mugunghwa failed in it's primary mission to set up colony in deep space. As you set out to complete the task given to you, you'll start to discover the truth behind the collapse of the colony and perhaps even decide the fate of the two AI on board of the ship. Will you be able to find out the hidden truth?",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely incredible game. Love's writing is fantastic, both gripping and depressing. You really have to experience it for yourself in order to see why it's so good. Buy this, and then buy another for your friend!",
            "review_score": "1"
        },
        {
            "review_text": "This was an interesting, thought provoking story. I enjoyed the historical references to Korea, and the unique take on how to display it. Fun, witty, and a little bit flirty, the story is a good mystery, and you're there to solve it.",
            "review_score": "1"
        },
        {
            "review_text": "I know visual novel games aren't for everyone, but this is a really engaging sci-fi story with some interesting twists. Lots of interesting reading to do and fun characters to interact with!",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable graphical interactive fiction, with an interesting theme. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Visual novels? in MY steam? It's more likely than you think! A wonderful little gem about the ugly side of human nature and a girl who just wanted to go home.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this game surprised me. Now I feel bad for letting it sit in my library so long. Despite having a limited interface and only two characters, the writing alone was enough to keep me hooked the whole way through. There's also a very clever bit where you have to figure out some console commands in-game. I got a definite feeling of accomplishment in completing that section.  If you don't like reading, this game isn't for you. I'd also question why you read this review. If you do like reading, though, then I definitely recommend Analogue: A Hate Story.  P.S. The harem ending is canon. Don't let anyone tell you otherwise.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, This game suprised me, it went beyond my expectations.Although I usaualy ignore and make fun of visual novels, this one just changed everything. Eventhough I started this as a joke run through, I eventually got hooked and started reading the logs. Its characters and visual appeal is great, everything about this game is great. Although I know nothing of visual novels one thing I do know is that this game was worth the buy. I highly recomend this game expecially when its on sale. I highly encourage you even if you've never played a Visual Novel, to buy this game",
            "review_score": "1"
        },
        {
            "review_text": "An engaging interactive story. Plot is reminiscent of Taiwanese/Korean period dramas.  Characterisation of the main roles are almost immaculately conceived as with their individual motivations; the ending moments being quite hard-hitting. Note that the tale does include somewhat explicit/graphic descriptions at certain points.   A successful playthrough should last around 2-3 hours and much of the gameplay primarily involves heavy reading. The title also involves understanding of a pseudo command prompt that is not particularly too obtuse to grasp for most players.  Be sure to also download and try out a free copy of the developer's previous work, Digital: A Love Story.",
            "review_score": "1"
        },
        {
            "review_text": "If you like visual novels, compelling narratives, Korean history, well presented feminist viewpoints, full immersion, or dressing up idols, this game is for you.  If you don't? Play it anyway.   Seriously, if you were at all interested in the visual novel genre, this is a shining example of what these kinds of games can be at their very best. The difference between a good visual novel and a great one is whether you come away from it having enjoyed a few hours of distraction to move onto something else or if you take the time to truly process your experience like youjust read a good book, gaining new insight with each replay. Analogue falls strictly in the latter category. Love it or hate it, you will have an opinion on it you'll want to really share and discuss with others. That's a mark of not only a good game, but also a true work of art.",
            "review_score": "1"
        },
        {
            "review_text": "Since I was always a big fan of visual novels, that game certainly caught my attention. Here's my opinion about it: Well, it probabaly has an interesting story but even when I tried hard to pay attention to some specific details that are mentioned throughout the game, I'd only yawn in boredom. Yes, it's obvious that reading texts is the core of the premise of that kind of game but the complexity of the story definitely didn't captivated me. Anyway, when you put the multiple elements apart and pay exclusive attention to the objective part of the novel, it's certainly unique in a sort of way, so in my opinion, this game deserves a thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "The game is very, very good - a compelling visual novel, with a nice story and engaging characters. Liked it very much :)",
            "review_score": "1"
        },
        {
            "review_text": "I dont know how its possible to fit so much emotion into such a short game. I highly recommend this to anyone who loves great storytelling or who wants to be left an empty shell of their former self after playing a game.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting. Love the way the story develops with moral ambiguity.",
            "review_score": "1"
        },
        {
            "review_text": "A well written VN, set in the future. Not much more to say without spoiling it, just give it a shot!",
            "review_score": "1"
        },
        {
            "review_text": "It's a visual novel with misleading front artwork but it is fun I liked it  it was fun Buy it NOW IN SALE AND SEE FOR YOURSELF",
            "review_score": "1"
        },
        {
            "review_text": "I played this game not on Steam and got all the endings. And then later I bought it on Steam just to have it in my collection. So that's why I have five minutes on record, I just started it so it would let me post a review.  Everything about this game is fantastic. The story and writing are top-notch-- reading a summary of this game, you might not think it sounds interesting at all, but it's gripping. The character graphics are really beautiful, and so is the AI. Finally, the music is great.  If you like reading, then you should get this game.",
            "review_score": "1"
        },
        {
            "review_text": "While this may not have as many decisions as your typical visual novel, the story more than makes up for it. There is a lot of reading involved, but I found it enjoyable the whole way through.",
            "review_score": "1"
        },
        {
            "review_text": " A Paladin's Steam Review: Analogue: A Hate Story. A Dark But Great Anime Visual Novel.",
            "review_score": "1"
        },
        {
            "review_text": "I have very limited experience with visual novels - basically they're something cute that occasionally turn up in humble bundles that i buy. so i've played hatoful boyfriend, long live the queen, and now Analogue: A Hate Story.   Personally, I loved it. I was really sold on the main character, and deeply moved by the history that unfolded. YMMV as always but this game really made me feel the desperate sadness it was aiming for.   Analogue has a delightfully minimalist intro and u/i that really rewards effort on the player's part to discover the context for the story, so I would not recommend looking up any of the lore before you play - if you don't want to spend some time piecing it together for yourself then you won't enjoy the game anyways!",
            "review_score": "1"
        },
        {
            "review_text": "Tells an interesting story with developed characters told in a different way to other visual novels. It’s an interesting style which feels like you’re solving the mystery.  Would recommend to people who enjoy a good mystery. ",
            "review_score": "1"
        },
        {
            "review_text": "I've owned this game for a long time now and just today I accidentally clicked on it while trying to click on Amnesia. So I though, 'What the hell' and gave it ago. I remember buying it because I am a fan of Sci-fi, Horror, and Transhumanism which is something that the company really pushed with this games advertisement.  The story was above average when compared to the high quality stories from World End Economica or Fault Milestone but it really kept me entertained. Having to piece together all the political aspects and the motivations of all the characters by reading the logs was very different from everything else. Interacting with the Mute and Hyun ae was solid and really helped to flesh out their characters and their beliefs. This story takes itself seriously and really doesn't go in the direction I and most likely anyone who has played this game thought it would. The game as a whole can be very unnerving and will cause you to pause as you read certain sections, making you feel for the characters and even though fictional, calling into question what your belief systems are and making you wonder just how far would you go if ever crippling hatred caused you to break.  So far i've only gotten endings 2 with 87% completion on my first try and ending 4 with 63% completion but I am definitely going to look up a guide to getting all the endings.   So I guess it all comes down to this.....Do I recommend it?  Well....yes, yes I do.   The game as a whole when it comes to visual novels has a rating of 8/10 from me. That is hard to achieve in my book and I don't rate all games at that level. If it had been easier navigate which notes could spark a conversation with the two female characters in the game it would have gotten an 8.5 from me.   I just realized I have the second game in my library as well. Looks like i'll be playing that after completing this game 100%",
            "review_score": "1"
        },
        {
            "review_text": "Genocide has never been this moe.",
            "review_score": "1"
        },
        {
            "review_text": "I love the atmosphere, characterization, and the Korean cultural interpersonal dynamics of the setting.  However, I'm not sure this is for everyone. If you want atmosphere and characterization, with very little direct interaction with the story? Go for it. I loved it. However, some people won't like this game because there's only two characters (and one at a time, at that) that you can interact with - everything else is accessing logs and uncovering a mystery via reading, reading, and reading.  I happen to love reading. Just be aware of what you're getting, but it's an extremely enjoyable and evocative ride.",
            "review_score": "1"
        },
        {
            "review_text": "Cute visual novel with a suprisingly dark backstory.",
            "review_score": "1"
        },
        {
            "review_text": "Overall an interesting first time diving into a visual novel. The novelty of being able to interact with the characters and interface as though I was in that universe sitting at the keyboard as opposed to my home and the keyboard was an interesting link.",
            "review_score": "1"
        },
        {
            "review_text": "I'm definitely going to play through to discover the other endings. No spoilers for or from me. 10/10  This is my first time venturing into the visual novel genre. I mistakenly assumed that all these 'games' that featured cute anime girls would all end up being weird dating sims, cheesy at best and porny at worst.   NOT SO. This is an incredibly sad story that really sucks you in. It really hits hard too. The format of the game is really interesting, I've never experienced anything like it. It was simple, but not boring. Minimalistic, but had great depth. The writing is top notch, I think.  You know so little to begin with and piece together this awful tragedy that occured on a ship lost in space from many generations ago. Despite all the awesome reviews, I wasn't really prepared for all this.   I've already bought and started in on the sequel, and I see myself enjoying a whole new genre that I wasn't even aware existed.",
            "review_score": "1"
        },
        {
            "review_text": "I've got 3 words for you: Play the ♥♥♥♥ing Game",
            "review_score": "1"
        },
        {
            "review_text": "An interesting little gem of a game. An engaging story that's long enough to get you engaged, but short enough that it doesn't overstay it's welcome. It's not for everyone, but if you don't mind a lot of reading and are looking for a story about ambigious morals, human sexuality, and transhumanism this is worth a look. If you see it on sale definately pick it up.",
            "review_score": "1"
        }
    ]
}