{
    "app_id": 209730,
    "name": "R.A.W. Realms of Ancient War",
    "release_date": "2012-10-11",
    "developer": [
        "Wizarbox"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Hack and Slash"
    ],
    "achievements": 12,
    "positive_ratings": 288,
    "negative_ratings": 312,
    "price": 11.99,
    "description": "Do you have what it takes to survive the Realms of Ancient War?Take control of a fearsome Warrior, a powerful Wizard or a Rogue, and plunge into a grand quest full of action!Key Features:The explosive Hack’n’Slash (action/role-playing game) R.A.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/209730/header.jpg?t=1447355594",
    "minimum_requirements": "OS: WINDOWS XP SP3/WINDOWS VISTA SP2/WINDOWS 7 Processor: AMD/INTEL DUAL-CORE 2.5 GHZ Memory: 1024 MB (XP)/2048 MB (VISTA/7) Graphics: 512 MB 100% DIRECTX 9 AND SHADERS 4.0 COMPATIBLE.  ATI RADEON HD 3850/NVIDIA GEFORCE 8800 GT/INTEL HD 2000 OR HIGHER DirectX®: 9 Hard Drive: 2 GB Sound: DIRECTX 9 COMPATIBLE Internet: INTERNET CONNECTION REQUIRED FOR THE GAME ACTIVATION",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Hold left mouse button to move, hold left mouse button to attack.  You're encouraged to make ranged attacks but due to the zoom level most times you can't see what's coming until it's htting you.  99% of the loot is useless &amp; sold for gold which is also useless. You'll pick up some good armour, level-upgrade some basic active &amp; passive abilities, and be set for the rest of the game. You also get enough XP to unlock almost every skill upgrade so you don't have to choose wisely, and if you die you're resurrected instantly to carry on.  The whole thing is so bland &amp; so generic, the story is bog standard fare &amp; the ending is equally unengrossing. Enemies are mostly the same throughout despite 4 seasonal flavours to the map, and there's only a couple of places where you think 'oh that looks nice'.  If this game were on an ECG it would be close to flatline. Just a few hours of holding the left mouse button,  Not worth the time or the money, buy something else. If you already own it, play something else. Anything else.",
            "review_score": "-1"
        },
        {
            "review_text": "Enter the Gauntlet   Overview: RAW is a Gauntlet game. It is NOT a diablo-style action RPG. It is a (generally very linear) mob-fueled beatem-up (probably best with some friends) with fast action and a few hit and miss ideas. Not a bad game. Not the best either, but not by any means awful.  Pros: Fun skills (Although it could have used more per class and more classes). Great art A variety of places and enemies A loot system that generally works really well.  Cons: It is pretty short (around 6-7 hours). Only 3 classes. They are also the most cliche classes ever. Every once in a while I had framerate issues. Not frequent, but it was odd. Pretty easy. Played on normal. I would recommend the hardest difficulty probably if you are playing with more than 1 person. Some 'posess enemies' sections that while interesting could have been implemented better.",
            "review_score": "1"
        },
        {
            "review_text": "Fun simple hack and slash game that does not overwhelm with complicated item and skill builds.",
            "review_score": "1"
        },
        {
            "review_text": "This game is not worth more than the humble bundle I received it in. It is the definition of a backlog game. You know, one of those games in your steam list that you never get around to playing. The only reason I even played it is because it's a mindless, linear slashfest to hack away at while skyping with friends.  It is essentially a stripped down Diablo clone. You play as one of the three generic classes, and then walk through some of the most linear level design you will ever experience (except for the first level, which is for some weird reason a maze). You just grab some gear, level up some skill points, and go forward. That's it; nothing else to it. Perhaps it would have been even the tiniest bit better if you could do co-op, but it's LAN only. Yeah, a game from 2012 on the PC is LAN only.  If you managed to get this game for a dollar or something, maybe it's worth trying it out for an hour to see what you think of it. But your time would be better spent on any of the other Diablo-ish games out there, like Path of Exile, Van Helsing, or, you know, Diablo. But otherwise, don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "First off, I'd like to say that I had a mildly enjoyable time playing this game in the first couple of hours. It's not all bad, but I wouldn't recommend it to anyone looking for a good game.  RAW is a game that doesn't do anything very well. It's mostly generic, with no inovation whatsoever, and then with a subpar combat due to being designed for consoles.  Combat and Controls. The most important thing in a game like this should be the combat. I've finished the game with the Mage class, and it feels very 'spammy', since you click to launch a fireball, and that's your main attack. The Skill Trees are simple enough, having 3 tiers from which you can level up abilities and get some new ones. The bad thing here is that half of them are useless, and the upgrades are very straightforward, none of them being out of ordinary. Another big problem with it is that you only have 2 mouse button, plus 1-4 for abilities, 3 and 4 being necessarily your potion slots. You can hit TAB to switch to an alternative 1-4 set of abilities, but it's just a pain in the ♥♥♥ to do so in the middle of combat. Seriously, why the ♥♥♥♥ would you port a game to a PC and not change that? How hard can it be?! It just demonstrates laziness from the developers, imo.   The Difficulty is also too easy. Far too easy. I've played this game in Heroic Mode and I've barely died. And when I died, it was because I was very much distracted (Yes, since the combat is mostly pressing LMB, you lose focus pretty easily). Also, the 'difficulty' only comes from swarming you with enemies that appear out of nowhere, and their attacks can stun you for a second. On the other hand, they also died very easily, providing no challenge. The big mobs, Bosses, if you will... are the easiest. They're big and slow, make it very easy to dodge their attacks and just knock them back as soon as they get close to you.  Enemy variety is close to non-existent. There are like 2 melee units, one faster than the other, then there is a ranged unit, and then there are spiders. Lots of those. Every enemy is essentially a reskin of the mentioned. Mini Bosses are pretty much larger versions of those enemies, far slower and with more HP. None of them has any noteworthy ability, it's just dodging projectiles, and killing enemies from afar.  Graphics. This game looks okay. Nothing that blew me away, but it looks pretty good nonetheless, even if rough around the edges. For the first half of the game, you're traveling through different places which gives a good variety to the levels. On the second part of the game, you're going through the same kind of places, which gets a bit tedious, close to the end. An important issue I had with the graphics, is that the enemies are always the same color as the background. Why the ♥♥♥♥...?! How could they not see that? In every level, you can't even see most enemies very well due to all the colors being very similar. This is just bad design and I have no explanation for why they'd do it. In regards to effects, they're generally good enough, with the exception of the Fireball, which looks pretty bland. Animation quality is service-able, it's not bad, but it's not stellar either.  Sound. Sound effects were also pretty bland, nothing noteworthy here. The music fits the setting, but, again, nothing to write home about. This feels more of an arcade game rather than an ARPG.  Level Design. Despite their visual variety in the first half of the game, there's nothing unforgettable here. Levels are quite short, and have nothing interesting. Nothing to tell the world's story, other than 'everything is mad at you and will attack you'. Except for vendors, who are not attack.. for some reason.  Later in the game, there are a couple of different levels, more of an arena and labyrinths, but they're like 2 or 3 levels. Out of the 26 available. There was room for much more here... Side quests are very uninteresting as well, and require almost no sidetracking. Mostly 'Get this random package to this point ahead in the level', or 'Kill this bad guy'. ALSO, no map! Seriously? Why? This makes no sense. It's not that one would get lost all that much, but it would be helpful to keep track of where the player is, and what's left to explore. AND, at one point, part of the main quest is to slay monsters in West, SouthWest and NorthWest. Fair enough. The problem is, there are no ♥♥♥♥ing directions. No map, no compass, no direction indicator. And South isn't just down. West was Down and to the Right. There's no ♥♥♥♥ing reason for that to be west. And that kind of ♥♥♥♥♥♥ me off. That just makes no sense, and was a piece of very bad design in my opinion.  Achievements.  Uh. Why would one review achievements? Well, I believe that achievements can help the player try out new things, explore a bit more and discover interesting things in the mechanics or the world. Well, not here. Achievement are very generic as well, so... yeah. They might as well not be here.   Conclusion. Unfortunately, this game doesn't really do anything very well. It does some things pretty badly. But it's not something I'm mad that it exists. I wouldn't recommend it to anyone, unless you really like this type of games. I took some enjoyment out of it, it's not all bad, but there's sooooo much that need to be reworked here... Well, maybe the next game will be better. And please, do not make it all console-like again if you're porting it to the PC. That might have been the cause of most of its problems.  Cheers. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's not the best game ever and towards the end you become inevitably overpowered. That being said, it's really fun if you play with a friend (couch coop). Definitely worth its sale price. You will get many hours of enjoyment out of it, although you probably won't be playing it more than once.",
            "review_score": "1"
        },
        {
            "review_text": "It's an alright game. I snagged it when it was released for Humble Bundle and gave it a whirl this weekend. Not a bad game, but nothing really to write home about.  The Good: +Gameplay: The mechanics of the game are really, really simple. Click, shoot, kill. Much like diablo. Easy abilities, common sense tree, not too many glitches, you move fast, etc. +Feel: It's a very easy game to just get into. Doesn't really require a tutorial, but it gives you a quick and dirty one right at the beginning.  +Voice Acting: It isn't amazing, but it isn't that bad. The voice actors are about average and makes the game a bit more enjoyable. Although, the premise of the game has been done to death.  The Bad: -Dumb-dumb AI: This game, on normal at least, is stupid easy. They run at you in a straight line, no matter where they are. If you're behind a wall, they will run into the wall at you. So, killing them is boring. If you're a rogue, set down a trap, slow them, shoot in a straight line until they're all dead. Really basic, nothing special, all of the enemies are like this. Even the bosses. -Kinda Dumb Premise: So, I don't really see a reason to finish this game. Nothing special, I don't expect a rewarding ending and the premise is standard. Four nations, must go to all four, unlock stuff, fight bosses, get loot, no explanation as to why you're the chosen one, etc. Same BS, different game. Not worth finishing.  Overall: If you really sit down and just burn through this game you can finish it in a day or a weekend. It's not hard, and its not really that fun. I mean, its alright game to burn some time. It's not horrible and if you're just looking for a time waster, play it. It's enjoyable in that regard. But, if you're looking for a Diablo clone, go download Path of Exile (F2P) and just play that.",
            "review_score": "-1"
        },
        {
            "review_text": "Better alternatives out there...everywhere",
            "review_score": "-1"
        },
        {
            "review_text": "Literally all you do is click If you want the mind numbingly simplest form Diablo/Torchlight game ever made, feel free to play this  ",
            "review_score": "1"
        },
        {
            "review_text": "yet another lousy console conversion: game does not allow one to save, when one likes to. when did this idiotic practice get common for pc's?",
            "review_score": "-1"
        },
        {
            "review_text": "Bland and repetitive. I got this game only as part of a package that other games came in. Otherwise, I wouldn't pay more than a couple bucks for it.  I played on the top difficulty setting, and it really doesn't make the game 'difficult'. The beginning is annoying because you get swarmed by immense amounts of enemies before you get crowd control abilities, but once you do, it's a piece of cake (even though they literally pop out of thin air which is a stupid spawn mechanic).  The possession ability is keyed to wheel-click which is stupid. A lot of mice don't even have good wheel clicking.   Focus skills don't seem to work.   Leveling up is basically capped to one character level per game level. You still gain experience, but it's not at the same pace as the first level you gain.   Story is dry and typical. Game length is short.  Outrightly plagarizes from other series such as Lord of the Rings with Legolas and Ents, and Baldur's Gate.  All and all... meh out of 10.",
            "review_score": "-1"
        },
        {
            "review_text": "Haven't played for very long, i'll get around to playing it more, but not too bad atm. It would be better if they added like dungeons you can do in Co-Op, based around weekly, every week they'd change for excluse gear? And maybe you could do PvP? Just some suggestions to make this game better!",
            "review_score": "1"
        },
        {
            "review_text": "If you want to play a hack and slash this isn't for you.  This isn't for you, period.  Go elsewhere.  ",
            "review_score": "-1"
        },
        {
            "review_text": "The story is awful, its quite generic rpg and the port is bad..",
            "review_score": "-1"
        },
        {
            "review_text": "the game was pretty exciting and took a bit to beat, the only issue with it is serious lack of replayability....once you beat it, thats it, its beaten",
            "review_score": "1"
        },
        {
            "review_text": "Realms of Ancient War is an action/role-playing game with a strong affinity for hack ’n’ slash, developed by Wizarbox. At the beginning of the story, you must choose whether you are going to spend the game hurling fireballs and deadly spells at numerous foes as a Wizard, slowly ploughing your way through armies of enemies as a powerful Warrior, or utilise your endless skills of survival striking from the shadows as a Rogue. You are then presented with a quick run-through of recent events of the last few decades or so, and then are thrown head-first right into the action, slowly turning your character into an unstoppable whirlwind of fury, complete with a power pretty unique to Realms of Ancient War that allows you to take control of your enemy’s strongest units and turn them on their own.  In the first impressions, Realms of Ancient War has obviously had a lot of time and energy invested into it for its graphics, which really shine through at points. The loading screens are actually some of the most pleasing to the eye and the scenery in the game tends to be very well-put-together. The magic spells especially, although only visible for a short time, look great and the scenery, again, is overall of a very high standard. The title has also managed to ensure that the dead bodies of your former opponents stay on the battlefield instead of evaporating as they tend to do in most other titles, which allows for an enhanced sense of satisfaction as you look around caves that are now marked with your handiwork. In contrast, the actual character design, which looks stunning in all of the artwork, is disappointing. You will certainly notice the main things about your character as they change throughout the game and you equip them with different coloured armor and weaponry, but on the most part all of the little details have seemingly been quickly brushed over, leading to an overall effect which just isn’t quite satisfactory, especially at higher levels where you look almost identical to how you did at the start.  The combat in Realms of War almost certainly delivers on its promise of being a hack ’n’ slash as you work your way through innumerable enemies of different varieties, depending on where you are along the storyline. You will find yourself being ambushed by large amounts of enemies that don’t tend to have that much life at all. You can breeze through most of the game as long as you are careful as to where you run to so you don’t get blocked in, because once you are blocked in you will almost certainly be cut down by the horde which has beelined straight for you – a design you will very quickly be able to use to your advantage. Throw down a poison trap and walk backwards a few steps and it is guaranteed that whatever is running at you will completely disregard the danger and run straight into it. Running away is your number one and only form of defence, seeing as there is not a control for blocking or dodging at all.  Wizard and Rogue classes allow you to use ranged attacks before you go charging in, and although they tend to look great and give you the upper hand in small skirmishes, more often than not you will find that any distance between you and your target has been closed down before you can manage more than a few shots. Luckily, as you grind through enemies you also grind up the levels and you will be given skill points to assign to different characteristics, such as increased ranged damage or an increased mana pool, which make these ranged moments a little more useful; but in the most part, the skill points you assign tend to actually do very little.  Combat-wise, you will also come to grips with the soul gems. During each level, you are only assigned a certain amount, which are used to revive. Running out of soul gems means you are sent back to the start of the level, and it is not until late in the game where you will be given the opportunity to avoid using one. However, it definitely adds a twist to the game, which notches up the difficulty a little and makes the game a little tenser as your supply begins to dwindle.  In addition, Realms of Ancient War has a less-than-gripping storyline, and you will rarely feel the compulsion to carry on playing like you do with other games of the same genre. The lore is vague, and the opening sequence of events that explains the recent history gives you very little idea into this world of warcraft and wizardry and the relationships between the four different sections of the continent, and you don’t really cover much more of this as you work your way through the game. Furthermore, the levels can be a little confusing to navigate at points, due to a strange choice of deciding not to include a map or mini-map; as well, directional arrows tend to point as the crow flies, but if you have some experience with these types of games then there should not be too much problem with finding your way around. The way the dead bodies remain on the floor will almost certainly signal to you that you have been there before.  Finally, although the game lacks multiplayer, you can engage in a co-op campaign by connecting a few wireless controllers. This makes the game a lot more playable and does reduce the chances of your character getting mobbed by the throngs of creatures out for your heads. However, it is a little bit disheartening to find you cannot team up with somebody over the Internet, which would have made the game a lot more appealing in an era where almost every game has some form of online capability.  In conclusion, Realms of War is a title that is on the lower side of average in the genre it exists in. Although the graphics are great from the menu screens and scenery, the characters just never seem to look that detailed or magnificent as you would want them to, and it contrasts greatly with the artwork displayed throughout. The combat system is very basic as it lacks a mini-map, blocking, and dodging; and you tend to spend your time in the middle of a sea of monsters. But to give credit where credit is due, it is still very enjoyable to hack your way through such a large opposition and come out the other end, and the brief moments of rampage as you take charge of some of the stronger units are definitely great fun. In terms of length, the game will take up a large chunk of time if you decide to play through all three campaigns, but it does lead to the question whether you will truly enjoy the game for that long.    Slightly Recommended ",
            "review_score": "1"
        },
        {
            "review_text": "Not bad so far - good battles. Sometimes the auto target is off.",
            "review_score": "1"
        },
        {
            "review_text": "great game, i got it on a deal. bought it because it reminded me of diablo.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game I suppose, a little basic but decnt enough to pass the time.",
            "review_score": "1"
        },
        {
            "review_text": "In the start it looks alright but after a while it get annoying and really bad, you have to cut down a s*it load of enemies and try to stay alive and combat feels fast repetive very fast. AVOID THIS GAME:",
            "review_score": "-1"
        },
        {
            "review_text": "Very boring gameplay. It is an 'A button' masher game. Also to much forced dirction in game",
            "review_score": "-1"
        },
        {
            "review_text": "Copyinh games like the Diablo franchise or Torchlight, Realms of Ancient War is an old school hack and slash dungeon crawler with very limited depth and breadth that is hard to overlook even tough it isn't a triple-A title. The story in the game is not the worst we've seen so far, in all honesty it's fairly interesting and one of the stronger points of the game. The game starts years after the so called Ancient War which divided the land to 4 territories (East, West, South and North...duh, imagination at it's best). The Northern King proposed truce so he invited the remaining kings to the Hero's Garden. Something went wrong because the Northern King was never to be seen again and the rest of the kings became soulless zombies. Yes, clichés after clichés, but it's not all that bad. The game contains some witty dialogues and turns.  We can pick from 3 unnamed characters: wizard, warrior and rogue. Each have different styles but they aren't that different that any would change the gameplay significantly. Each class has it's own skill tree, where you can level up your attacks. There are 1 level and 3 level skills. Skills open up gradually. The first group right after the beginning of the game, the second after you reach lvl 10, the last after lvl 20. However, there are two problems related to your skill management. First, in every stage you can gain exactly one level. No matter how much you fight or how many side quest (there aren't that many) you complete. You can only get 1 skill point in each stage. That makes the whole level grinding procedure useless and dropping all the challenge. You will get your skill point no matter what.   The second problem comes with the use of your skills. You have only 4 skills at your use at a given time. Two of them are to be activated with the mouse and two with keystrokes on the keyboard. You can program these skills to the aforementioned buttons. If you want to use other skills you have to use the alternative set. Essentially you have 2 sets of skills, which can be changed at any time with a button push. Easy enough, in theory at least. Practice is a different beast. Remembering which skill you have assigned to which button in which set is pointless, painful and horrible. When a dozens of foes are attacking you there is no way this system can be use properly. Using this method is understandable on consoles where there are limited buttons to use, but on a PC it's unacceptable. This is where you realize that 4 skills/attacks are well enough to complete the game.   At least the fighting and hack'n slashing is exciting. You are continuously attacked by tens of enemies, making the game challenging and intense. Sometimes it is hard to hit smaller enemies, like spiders which live everywhere, rain forests or volcanoes it doesn't matter for them. Graphically the game doesn't excel, but it's not bad either. For an XBLA title it's passable. Not are the audio tracks though. Audio effects are horrible and repeating. Listening to the same 3 grindings throughout 8-10 hours when you hit enemies is annoying. The music is on par with the rest of the audio. You get one passable song which plays when you start the game, the rest of the music tracks during gameplay are just pointless burrs.  R.A.W. is a below average hack and slash game that tries to build upon it's great predecessors of the genre but fails in every possible way. It's chaotic, mediocre and boring. A game that is hard to recommend when you can get a dozen of it's kind cheaper (or even for free). If you can finish it once there is no point starting the game ever again. ",
            "review_score": "-1"
        },
        {
            "review_text": "Fun RPG somewhat similar to the Diablo fomat.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this up in a sale and while it is pretty straightforward (A to B and kill anything that moves) the rpg elements raise help to keep you interested.I haven't tried co-op yet but it could be quite fun especially when there's 2 different classes playing.If you want this game wait till its on offer because £12 is a little pricey to be honest but overall i was not disappointed with it",
            "review_score": "1"
        },
        {
            "review_text": "Oh i dont like this game  Gameplay: 3/10 Story: 3/10 Graph: 4.5/10 Control: 3/10  overall : Not Fun Game",
            "review_score": "-1"
        },
        {
            "review_text": "Very disappointing. Rushed &amp; Unpolished. Potential for being a great game but fell short by a long way. Don't Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Not sure if really bad attempt at diablo clone or if I'm just triggered by the fact that Diablo 1 is a better game.",
            "review_score": "-1"
        }
    ]
}