{
    "app_id": 209830,
    "name": "Lone Survivor: The Director's Cut",
    "release_date": "2012-04-23",
    "developer": [
        "Jasper Byrne"
    ],
    "publisher": [
        "Superflat Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Horror",
        "Indie",
        "Survival Horror"
    ],
    "achievements": 0,
    "positive_ratings": 1019,
    "negative_ratings": 153,
    "price": 11.39,
    "description": "In this original and adult psychological survival horror, the masked protagonist must escape from a city ravaged by disease, by any means necessary.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/209830/header.jpg?t=1454353141",
    "minimum_requirements": "OS: Windows XP Processor: Core2Duo Memory: 2 GB RAM Graphics: Any with hardware 3D acceleration DirectX®: DirectX 7.0 Hard Drive: 250 MB HD space Sound: Soundblaster / equivalent",
    "recommended_requirements": "OS: Windows 7 Processor: Core2Duo or above Memory: 4 GB RAM Graphics: Nvidia 7900 / equivalent DirectX®: DirectX 7.0 Hard Drive: 300 MB HD space Sound: Soundblaster / equivalent",
    "reviews": [
        {
            "review_text": "Lone Survivor is a 2D psychological survival-horror game that pulls a lot from David Lynch and the Silent Hill series. I originally played it back when it came out from the developer's website, and have played through it a few times since also on Steam and on the PS3.  You play as a nameless character who is stationed in an apartment in a ruined city. Each day is a struggle, with limited supplies and draining willpower. Our character decides that he doesn't want to die alone, and sets off to find someone else to give meaning to his minimal existence. As he ventures out, he does meet other characters, but they all seem rather odd. Are they real, or a figment of his imagination? Is everything as it seems, or just an illusion?  The game has atmosphere in spades. While the graphics are low-res and pixely, the game has a fundamental understanding of the effect minimalism can have on games; like the original Silent Hill or Resident Evil, your mind fills in the blanks of details. Everything is just detailed enough to make out what everything is, but minimalistic enough that your imagination fills in the blanks. The game also utilizes some nice lighting and fog effects to help add to the atmosphere.  The audio is fantastic, with moody and stylistic music, wonderful sound design, and while unsettling, adds so much to the experience.  The game doesn't have jump-scares, but rather mood to unsettle and oppress you. Some will find this decision to make the game ultimately not very scary, but it remains tense and unnerving through tough obstacles and strange moments.  The game is a bit cryptic, which might turn some off from the title. Something that most may not see coming is that our character has human needs for things like sleep, food, and rest of mind. If you don't take good care of your character, it effects him. And to take good care of him means to search around for things that may help, such as gas for his stove to cook things or a game system and batteries to use to play it with. You collect food and supplies from the environment, and from utilizing these elements you can help tend to your characters needs. Or you can not, and just do the minimum effort to get by.  But choice in gameplay matters here. The game has about six different endings (one of them is a slight alteration of another ending though), with four available on the fist playthrough. Which ending you head towards is not determined by simple A or B choices, but by how you play the game. And most everything effects it. How often do you eat? How often do you sleep? Do you use the transfer mirrors to return home? Do you indulge in side-quest? Do fun but meaningless things to help your sanity? Do you help or hurt this guy? Do you kill or avoid enemies? All these choices add to an unseen score (that they finally show you after the credits) which determine which ending path you're going on. Well, that is except one ending, where you need to do a secret side-quest to obtain it.  There are a few points the game drags on a bit, particularly of note in the basement segment where your map is near useless and maneuvering can become rather confusing. After completing the game for the first time, you'll probably have more questions than answers. To really get the full experience of Lone Survivor means to play the game more than once, in fact certain areas, side-quests, and endings aren't even available until the second playthrough. This kind of commitment will turn some off from the game. And for some the survival element will feel superficial, as the game essentially will give you anything you need if you don't mind gaining 'ending points' to go on a certain bad ending path.  But it's also probably one of the truest Silent Hill games to release since Silent Hill stopped really being SH, and is one of the best 2D horror games to exist. To really dig into the game requires hard work to keep your sanity up and your spirits high, and rewards those that dig into the game's systems and figure it all out.  Lone Survivor is atmospheric, and in my opinion, one of the best 2D horror games in terms of atmosphere, and one of my personal favorites. It has sim-like mechanics not all will care to manage, but those that delve into it will be rewarded with interesting story twists, revelations, and new areas. It needs to be replayed to be fully experienced, but likely will attract a niche audience with its surrealism and mysterious storyline. For those less interested in the strange, there is a pretty solid old-school styled survival-horror game here. It may not have all the bells and whistles, but it's an ominous adventure while it lasts.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure I can stress how important this game is. It's pretty damn significant. This game is one of the best games you will ever play, though you may not understand until you finish it. It was emotionally impacting, and made me think for a long while. I still think about this game, to this day. If you have the cash to get it, please please please buy it. You will not regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Lone survivor is an atmospheric pixely horror adventure, where you find yourself trying to survive in a sort of post apocalyptic world. There are foul creatures lurking in every corner, your sanity is elusive, your resources are scarce, and the only other people you meet have questionable intentions. The way you choose to play and conduct yourself -being openly violent or stealthy for example- can set you toward a different ending path. Having played this outside of steam and even adding it on my account here, I cannot do otherwise but recommend this game.   + Creepy atmosphere (silent hill nostalgia) + Amazing soundtrack + Multiple endings + Map teleporting system helps you avoid needless walking  - Pixely graphics make text a little hard to read - Some backtracking might be needed",
            "review_score": "1"
        },
        {
            "review_text": "This was the game that introduced me to the 2D survival horror genre. And while the idea of a lone guy in an apocalyptic world with zombie-like-monsters is seen too many times already, I would like to point out that that is not the highlight of the game. The highlight of the game is the sanity of our character, and thereby your sanity. The things that is going down in this game is illogical (even by psychological game standards), and it hints at the story outside of our characters head. You will find yourself questioning most of what happens in this game like: Is there really an apocalypse? Is the characters you stumble across people from our protagonist's life or just reflections of his own mind? And what is up with that ending? (No matter what ending you get, this one counts).  To top that off I think that the art style is wonderful, the controls is nice and the soundtrack is plain up amazing. I will say that your hunger and sleep meter could have been presented better than just the game spamming you with messages, but all in all I love this game. It is definitely one of my favorite survival horror games, if not my favorite.",
            "review_score": "1"
        },
        {
            "review_text": "My only complaint about this game I WISH I could use my controller. Nice story, cool enemies it was alot of fun. :)",
            "review_score": "1"
        },
        {
            "review_text": "Don't underestimate, it's scary as hell :D",
            "review_score": "1"
        },
        {
            "review_text": "This is a perfectly crafted gem of a survival horror game where you are a survivor of some mysterious plauge Your goal is simple, escape from the city to find safety. This game will keep you busy with not only monsters you can choose to fight or hide and run from, hunger and thirst which you can go out to find yourself a proper meal ot keep yourself going through drug assitance, doing what little you can to keep your mind sane or jump into the madness..all up to you as you navagate the 2-D world as you would in the first 4 silent hill games. I can assure you, especally if your a fan of the Genre it is worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely creepy indie game. Check it out if it's on sale for cheap. Fun, fresh, and unique, but the gameplay style leaves something to be desired. Pick it up if you can for &lt;5$  Pros:  Creep factor Story  Cons:  Gameplay Controls  Creepy game, pick it up for yourself around Halloween and play with the lights off. B",
            "review_score": "1"
        },
        {
            "review_text": "Tank like combat and movement, suspense by dark corridors, and a story that is vague to a dangerous degree to my sanity and sleep. This really is a scary game as it there is the the biggest real-life threat at all time, the unknown. Crafting is satisfying when found out, enemies send fear by their pressence, and puzzles make you appreciate resources to every battery.  10/10 Would drop my last flare to stun two baddies to use my last bullets to kill their bro to get through the door just to escape only to have to save without bullet to make my final stand for a jar of pickles in the morning... again.",
            "review_score": "1"
        },
        {
            "review_text": "You decide your playable character's mental health. If it weren't for some big mental health boosts, my character would've gone insane.",
            "review_score": "1"
        },
        {
            "review_text": "scary as ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "A quirky little survival horror story. Simply styled yet still manages to creep and scare. Also, cooking seems to be strangely emphasized.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic music, eerie atmosphere, and solid gameplay. A great survival hooror game indeed.",
            "review_score": "1"
        },
        {
            "review_text": "A quirky little survival horror story. Simply styled yet still manages to creep and scare. Also, cooking seems to be strangely emphasized.",
            "review_score": "1"
        },
        {
            "review_text": "From the guy who made brilliant demake of Silent Hill 2. This game is truly creepy, and the lo-fi pixel art style combined with the item scavenging, alternative ends, optional sidequests and moody soundtrack makes this one of my favourite indie titles.",
            "review_score": "1"
        },
        {
            "review_text": "A 2D survival-horror game? Surely you jest. No, I'm dead serious, and Lone Survivor is an amazing game. It captures the feel of retro survival-horro games perfectly and is, at times, genuinely scary. As I say in many reviews, this is not a game for all tastes, but I do offer this my highest recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "Creepy and scary game. Everything from the gun mechanics to the world WILL scare you ♥♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "You wake up in the small side apartment on the second floor. The radio talks nonsense, there’s no food and all your neighbors are now scary pixelated monsters. It’s hard to tell if they have become zombies or some other ♥♥♥♥ has happened to them. The game isn’t heavy with going on the specifics of what is actually happening. This is an abstract story of a nameless protagonist, swallowing pills that change his dreams and exploring the building and its nearest surroundings.  Going outside is dangerous and challenging. Monsters can kill you easily; avoiding them is the preferred course of action. Ammunition is scarce. Rooms and corridors are dark. Batteries for the flashlight don’t last long. On top of that the character has to eat and sleep. And take those pills before having psychedelic dreams in which he talks with a man wearing a box for the hat.  A deconstructed version of classic survival horrors, Lone Survivor keeps only the most core features of them. 3D world is among them. This is a rare for 2D metroidvanias, most of them use a door for nothing more than a couple of completely separate rooms. Lone Survivor makes use of its scene. Corridors go around the floor, intersect with each other and make a dense maze that you have to study. Two sections of hiding in the shadows, turn to the left, then to the right, enter the gaping fleshy hole in the wall, find the new key, some canned fruit salad or even another survivor. So, no, you’re not really lone. But at least you’re survivor. You’ve got that gas can for the stove. There were a few very scary zombies in that dark corner where you’ve found this can, but you’ve managed to pass them unnoticed. Tonight you’ll eat some cooked ham. Who knows if you’ll be that lucky tomorrow?  Packing a lot of action on such relatively small map makes the game tense. The best compliment for a survival horror. The requirement of enough variety and challenge forces most metroidvanias with the flat world map to resort to some kind of red herring like gigantic elevators in Metroid. It’s a neat way of separating the parts of the world and still preserving the integrity of it. Extravagant ride on the carriage with undead horses in Bloodborne is essentially the same thing. Of course it’s more noticeable this way. You can now separate the “main” part of the world from this one. What you didn’t notice yet though is that “main” parts consists of such “separate” ones. Their connections are more believable. They could be one level from a technical standpoint, they could be separate ones — it doesn’t matter. You can still percept them as a whole. Lone Survivor is very careful with its level design. Architecture may make no sense when put in the actual 3D perspective, but the protagonist seems to be delusional anyway.  A small geographical anomaly is easy to overlook when you try to precisely target a zombie slowly coming at you. Perhaps, even easier than the supposedly unexpected subplot-which-was-the-actual-plot-you-fool. The game rather mimics the melancholic tone of Twin Peaks than its mystery; to the point that it manages to end anticlimactically. Those green, red and blue ending sequences are still better than their counterparts in Mass Effect 3, but they too are nowhere near the legitimately scary journey through post-apocalyptic nightmare that has preceded them.",
            "review_score": "1"
        },
        {
            "review_text": "I was really impressed by this game. Considering how many recent survival horror titles try to involve different, more 'realistic' mechanics and graphics to immerse the player, 'Lone Survivor' takes a step back, to an older, seamingly more simple style, 2D pixel graphics and a set of few, but crucial mechanics.  It may seem too simple at first: No big story, it's the end of the world and you have to survive, only a few objectives to look after, get food, consider how to defend yourself, don't waste to much bullets, run, hide if you must, scavange food, don't forget to rest and maybe try to find out, what is going on in the first place. But, if you try to commit to the game and it's setting, the simplicity itself may be the key, to what really makes this game so exciting: Your mind! You start to wonder, 'what is actually going on here?', start to think about the few decisions you have to make 'shoot, run, hide? should i eat the last scraps i got now, or should i wait a little longer?' and you realise how the atmosphere of the game is changing, shifting according to the state the character is in, if you don't eat or sleep, the screen starts to become blurry, it may show things which might or might not be there and all the rest is up to what your fantasy is constructing around the frame the game is providing you with.  And then, after a few hours, the game is over. If you just didn't like the style, maybe you'll shrug it off as not very interesting. But if you liked it, this short game will still stick to you for a while longer, as it should be the case with good games. Maybe you'll want to play it again in a few years, the graphics are 'old' already anways, or show it to someone else, because it doesn't take much to get through anyways.  However, i think it's a small, but very exciting gem of a game and definetly worth the time and money invested.",
            "review_score": "1"
        },
        {
            "review_text": "Play Length: One complete playthrough.  Positives: A great indie horror game, which takes a lot of influence from Silent Hill 2 and David Lynch. Putting those influences through a retro filter creates a pretty unique and interesting horror experience.  Let's talk about the graphics. The retro style can certainly work for a game like this, and I think it's a decent style. It's heavy pixellated, even more so than most retro inspired games. It's a bit of a peculiar look, but the abstraction works pretty well to create atmosphere. The music is uncommonly good for an indie game... I would go as far as to say that this is the best soundtrack in any indie horror game, excepting maybe Corpse Party. This is important, because a good soundtrack is vital to creating atmosphere, and Lone Survivor is much better at creating atmosphere than just about any other indie horror game.  The gameplay is very good for this style of game. It has combat and stealth elements, both of which is very simple, while at the same time always presenting the player with choices. A lot of the game is just exploration, monsters aren't all that common. There's also some fun survival mechanics, as you have to collect food and manage your hunger and sleep levels. There's a huge amount of food, all of which has different effects, and you can also cook meals if you can find cooking implements. There's also drugs you can take, with various effects. I like that these various systems add depth to this game without feeling out of place, or distracting from the atmosphere.  The story is very much in the mold of David Lynch / Silent Hill. It works pretty well, and there's some pretty good set pieces and imagery. You're never quite sure exactly what is going on, but you know enough to stay involved.  Negatives: While the graphical style is decent and works for the game, I think it could have been done better. Sometimes the game's art can border on amateurish. This is obscured by the heavily pixelated graphics, but I still noticed. While I like the gameplay in general, one thing I felt that was a little lacking was the monster variety. There could have easily been a greater variety of monsters, and it would have added more depth to exploration as well as keeping more surprises for the player.  About my rating system: I have two things I rate on. The first is the overall score, and the second is soundtrack. The reason why is because I feel like soundtrack is tremendously undervalued; to me, it's a tremendously important factor in whether I like a game. For the score, I grade on a scale of 1-10, and I try to grade in such a way that each number has a meaning and each has equal importance. The numbers have the following meanings:  0: Garbage, 1: Awful, 2: Poor, 3: Underwhelming, 4: Mediocre, 5: Decent, 6: Good, 7: Great, 8: Excellent, 9: Phenomenal, 10: Masterpiece  Lone Survivor's score:  Game Rating: 8 (Excellent) Soundtrack Rating: 8 (Excellent)",
            "review_score": "1"
        },
        {
            "review_text": "Lone Survivor is a 2D site scrolling survival horror game. It's feels like silent hill in 2d :D The story is quite unique and deep...the lone survivor will encounter many weird events and the interpretations is up to the players.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite version of Silent Hill 2.",
            "review_score": "1"
        },
        {
            "review_text": "When I bought this game I was thinking 'nahh I cant get scared from a 2d pixel game...' ohhhh how I was wrong.. oh so wrong. This game took me to the point of questioning my own sanity, not knowing if what I just saw was in my head or in my characters head... Seriously a great perspective on a whole monster like apocalypse, instead of going for the 'Lets shoot everything until the world is saved!' approach this game takes ot from another angle, the one of a 'Lone Survivor'. Having to sit sweating trying to sneak past a monster or feeling proud of myself for using various bait traps to lure them elsewhere, this game just has everything a horror game needs. To top everything off the graphics and sound work together so well to give this game that edge that is needed.",
            "review_score": "1"
        },
        {
            "review_text": "too creepy.",
            "review_score": "1"
        },
        {
            "review_text": "lone survivor is a one of a kind game that has a little of silent hill and other to it. The music i have to give credits for setting the mood in the area that the player was in, the monster nosies gave me chills running down my spine as i heard them come closer and closer. the sence were dark and creepy that make you think before walking any farther down the corridor. this game is a one of a kind  ",
            "review_score": "1"
        },
        {
            "review_text": "Two Dark-Creepy-Pixelated-Thumbs Up!!",
            "review_score": "1"
        },
        {
            "review_text": "Two Dark-Creepy-Pixelated-Thumbs Up!!",
            "review_score": "1"
        },
        {
            "review_text": "Survived for about an hour then died from gone off cheese. The zombies couldn't get me but my fussy taste in food could.",
            "review_score": "1"
        },
        {
            "review_text": "A really sweet game about a young nice boy who loves a pretty plush cat, and an evil girl who tried to take it away.   10/10 soundtrack  666/666 gameplay.   Ia Ia Cthulhu Ftagn.",
            "review_score": "1"
        },
        {
            "review_text": "Great gameplay and story, just wish the main character would quit whining",
            "review_score": "1"
        },
        {
            "review_text": "Combination of 8-Bit ,Survival Horror and Twin Peaks.  Brilliant!",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Would hallucinate again.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite things about this game isn't the atmosphere or the choices you can make (which is done very effectively and requires some thought). But the characters themselves. A cross between all in the main character's head and generally nice or partially helpful characters litter the game which liven up the dank depressing mood.  In fact, since I played the game on a pacifist run I found that underneath the depressing 'dog-eat-dog' atmosphere, there's some genuine hope and optimism. It gives you such a warm fuzzy feeling to pick up a can of beans and know that it will be a delicious treat tomorrow along with your morning coffee. The main character's reaction is not only the icing, but the cake itself. Treating mental disorders has never felt so nice.  That said, the difficulty flucuates from easy to hard and back to easy around the midpoint and the game requires a lot of guessing to figure out (drinking milk to get the milk bottles for bottles of water).",
            "review_score": "1"
        },
        {
            "review_text": "This game captures the feeling of isolation unlike any other survival horror game I've yet to play. Haunting soundtrack by creator Jasper Byrne. The flashlight/food/bullets get a bit tedious to maintain, but the pills are an interesting and creative effort to help the player through any dry spells.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game. It is kind of creepy, but that makes it better. I recommend this game for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Creepy as 16-bit will get.",
            "review_score": "1"
        },
        {
            "review_text": "A claustrophobic &amp; atmospheric side scroller with obvious Silent Hill inspiration.",
            "review_score": "1"
        },
        {
            "review_text": "Man trippin' balls all day!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game, reminds me of Silent Hill. The atmosphere is really nice.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't mind your sense of sanity being messed with this is probably the best 2D side scrolling survival horror game you will ever find. Would get the dnorms seal of excellence if there was such a thing.",
            "review_score": "1"
        },
        {
            "review_text": "Scary at times and has abit of psychological horror, I dont have much to say about LS except that it tried but dident quite hit all of the marks I wanted it too and failed to deliver. Needs to be longer and needs to have my psychological horror in it. I wish I could give it a neutral review but thats not possible.",
            "review_score": "1"
        },
        {
            "review_text": "A survival horror adventure told in a blur of low res pixels and with a haunting score. Functionally it is a good game, but using gameplay to put the player in a position to explore human nature, trauma and mental illness lifts this to something far more poignant that will stick with you long after your (unique) journey has ended. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "It's kind of like a silent hills in 2d. You are alone, no idea what is happening and what to do, every weapon is limited and hard to get and you mostly need to use your brain instead of your trigger-happy fingers. Good game, nice ambient and music and it really gets you sucked right into it since the beginning.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Unique minimalist psychological horror. It's one of they rare games that doesn't scare you per se, but makes you feel genuinely nervous and on edge. Cool narrative as well, although I haven't finished it yet.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic survival game. Grab it while it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "Just try not to look at a mirror...thats how i got as crazy as Jack Sparrow with a jar of dirt.",
            "review_score": "1"
        },
        {
            "review_text": "Silent Hill meets Super Nintendo. Your method of survival will decide your ending. The atmosphere and ambience create an awesome gameplay experience.",
            "review_score": "1"
        },
        {
            "review_text": "Pseudo-Lynchian in an endearing fashion.",
            "review_score": "1"
        },
        {
            "review_text": "Dude's mask makes him looks like he has a massive perpetual grin on his face which really detracts from the game's mood.",
            "review_score": "1"
        },
        {
            "review_text": "Wow what a badass game!",
            "review_score": "1"
        },
        {
            "review_text": "I'd give this game a 65 because of the outstanding gameplay and because i am a great teacher who gives fair grades",
            "review_score": "1"
        },
        {
            "review_text": "Despite the look, it's a very well-made and creepy Silent Hill-ish game. Hugely recommended. Just try the demo or watch a video.",
            "review_score": "1"
        },
        {
            "review_text": "Silent Hill nostalgia with a twist of project zomboid wrapped up with some amnesia mechanics. FUN!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely creepy and atmospheric--plus, it has the advantage of not being still another zombie game, with the psychological subtext.",
            "review_score": "1"
        },
        {
            "review_text": "The best Silent Hill-like since Konami's golden years on PlayStation (yes, even 'The Room' has its place and was genuinely good, shut up). Hardly reinvents the wheel, because it's a carbon copy of Team Silent's efforts down to the confirm prompt sound. As far as 2D-demake/homages go, it's the only one of its kind and offers some new things to the formula. With an emphasis on the actual survival part of horror, you'll be foraging for foodstuffs and making recipes to keep your health and sanity up. Then there's the way your actions (aggression vs stealth, consuming different meds, etc) affect the possible endings. As you would expect, these systems are a bit obscure, but the game drops hints throughout if you pay close attention. There are no puzzles to speak of, but there can be some frustrating trial and error sections to the game. Jasper Byrne is no Yamaoka, but the game feels built around the soundtrack - it's quite good.  A note about the control scheme: it can't be rebound, so, oops.  Everything else is solid if unremarkable; this is real survival horror in bite-sized pill form.",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding game, ashamed it took me so long to get around to playing it as im a big horror game fan. This has old school Silent Hill within it and it still holds its own as something original. couldnt recommend more",
            "review_score": "1"
        },
        {
            "review_text": "This is the greatest 2D version of Amnesia of All Time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really nice, if you play games not only for scores and self-developing. Here you will really have to survive. The problem is not only in monsters and no one else around. But in things, which happen behind your back, just like there is some one, who is just playing with your mind right now, who is staring at you and laughing silently. Play this as SeriousRP, never do, what you wouldn't do in reall life.  And please do not mock of your character. He is already very bad. Without your help, he will die...",
            "review_score": "1"
        },
        {
            "review_text": "I love retro-style horror games. Games like Silent Hill and Resident Evil and of course the beautiful scarefest that is Amnesia depend on extraordinary graphics in order to get the scares across. In Lone Survivor the creators relied on classic pixelization, and it somehow works. The music is paranoia-inducing and the alarming change in environment when a monster sees you is reminiscent of the Silent Hill 'monster warning system' of radio static, and of Amnesia's blaring horn/string frenzy of 'Oh ♥♥♥♥! Oh ♥♥♥♥! Oh ♥♥♥♥! They see me!!'. And much like Silent Hill there are quite a few monsters to navigate around and it is not expected that you outright battle them head-on, as well as many doors and openings that are not always open and, as far as you know, may never be.   Your character claims to be the only survivor in the apartment complex that he is currently a tenant of, residing in his own cozy little room of 206. Of course, you need to go out and fetch supplies and try to find survivors. Along the way you are shaken up by bizarre visions that may be a result of something alien and supernatural--I mean seriously, that's all that could explain the existence of those THINGS--or possibly your character's insanity slowly grabbing at his mind. Despite being dumb as a rock when it comes to logical 'one thing leads to another' set ups that this game surely is, I managed to find my way around the place and just as I was thinking 'Okay it's time to stop for today' I found something else to explore and just kept going. This is a great mashup of pixel, adventure, psychological, thriller, and horror.   ",
            "review_score": "1"
        },
        {
            "review_text": "If Silent Hill or even just the horror genre is your thing you should definitely give this game a go. Cool and twisting story, multiple endings depending on the littlest thing you've done during the playthrough and great soundtrack to boot. That packed together with some really good visuals and style.  datcatson",
            "review_score": "1"
        },
        {
            "review_text": "I love retro-style horror games. Games like Silent Hill and Resident Evil and of course the beautiful scarefest that is Amnesia depend on extraordinary graphics in order to get the scares across. In Lone Survivor the creators relied on classic pixelization, and it somehow works. The music is paranoia-inducing and the alarming change in environment when a monster sees you is reminiscent of the Silent Hill 'monster warning system' of radio static, and of Amnesia's blaring horn/string frenzy of 'Oh ♥♥♥♥! Oh ♥♥♥♥! Oh ♥♥♥♥! They see me!!'. And much like Silent Hill there are quite a few monsters to navigate around and it is not expected that you outright battle them head-on, as well as many doors and openings that are not always open and, as far as you know, may never be.   Your character claims to be the only survivor in the apartment complex that he is currently a tenant of, residing in his own cozy little room of 206. Of course, you need to go out and fetch supplies and try to find survivors. Along the way you are shaken up by bizarre visions that may be a result of something alien and supernatural--I mean seriously, that's all that could explain the existence of those THINGS--or possibly your character's insanity slowly grabbing at his mind. Despite being dumb as a rock when it comes to logical 'one thing leads to another' set ups that this game surely is, I managed to find my way around the place and just as I was thinking 'Okay it's time to stop for today' I found something else to explore and just kept going. This is a great mashup of pixel, adventure, psychological, thriller, and horror.   ",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly tense, immersive game that will change your perspective on what actually makes a game scary. Hint: It isn't the monsters.",
            "review_score": "1"
        },
        {
            "review_text": "If you get a chance to play it, you should. I now question my own existance.",
            "review_score": "1"
        },
        {
            "review_text": "It's got a sorta Silent Hill feel,just with the acception of 16 bit graphics? I dunno 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Definitely creepy and atmospheric--plus, it has the advantage of not being still another zombie game, with the psychological subtext.",
            "review_score": "1"
        },
        {
            "review_text": "2D 'Silent Hill'. It's very good 2D Survival Horror. Not many survival horror in 2D and this one is AWESOME.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game with a lame, abrupt ending.",
            "review_score": "1"
        },
        {
            "review_text": "i didn't know a 32-bit game could be so terrifyingly suspenseful  i think this is a worthy addition to anyone who enjoys survival horror  this game isn't that hard though imo, as whenever i've ran out of food/ammo, people would give me more in my dreams. i haven't managed to die yet, although i have gotten stuck on some parts because the game gives you a vague direction and leaves you to figure out how to get there  either way, the closest thing i could possibly relate this to is a 2D silent hill game (a good silent hill game, not like SH4)  if you're looking for retro survival horror, this is it",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. It has the same effect Amnesia and the Penumbra Series had on me. I can barely play it without being nervous the entire time. The immersion is really well done, I haven't advanced that much tho, but for the looks of it...really amazing game. And I completely love the graphics!",
            "review_score": "1"
        },
        {
            "review_text": "An endearingly crafted story about the situation everyone dreams of but no one is ready for. It's you, and you alone, against the hoard of monsters that have either killed everyone or left their spirits crushed and broken. This is the apocalypse, and few games capture the desperation and everyday struggles of living as a dying race so thought-provokingly.  The gameplay is all about planning, exploration, and resourcefulness. The story itself is provocative and timeless, as we go into the mind of a man forced to reconcile the past so he can survive the present. Twists and turns abound in this indie title, so get ready for a brainbender. The graphics evoke a simpler time, and it's a shame this game was never officially on the SNES.   If you are looking for a psychological journey with a dark premise, desperate situations, and retro graphics, then this is the place. Lone survivor delivers exactly what it promises and then some.",
            "review_score": "1"
        },
        {
            "review_text": "Silent Hill developed by a DJ, producer, creative extraordinaire... a one man show. Brilliant work of art.",
            "review_score": "1"
        },
        {
            "review_text": "ran in, died, over and over again",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic survival game. Grab it while it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "One of the creepiest ♥♥♥♥ing things ive EVER played.  ♥♥♥♥.  Seriously though, if you like horror, this is your game. Very interesting design.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, with an excelent soundtrack that fits perfectly the environment.",
            "review_score": "1"
        },
        {
            "review_text": "This game was good from start to finish. The character has quite a realistic feel to him, like he could really be somewhere. As you progress through the game, you do really get attached to the character. Its best to keep his mental health at a high, for a decent ending (There are 5 endings.) And even though i got the worst possible end, I feel like playing it again, and not just to get a higher level. Eat well, sleep well, and dont kill monsters. Those are some things that will keep your mental state high. Be considerate of others, even those that arent humans. My rating is a 9.5/10 (Almost rated it 10/10.) I reccomend this game to everyone, but more highly to those who like survival or thriller games.",
            "review_score": "1"
        },
        {
            "review_text": "LONE SURVIVOR is like a bit-sized 2D Silent Hill with a very David Lynch style (Twin Peaks, Eraserhead, Blue Velvet) twist to it. If you're into horror games like Silent Hill, Alan Wake, Deadly Premonition, or the horror RPG classic Sweet Home, or just weird, bizarre, freaky, psychological stuff, definitely check this out. It's one of my favorites of 2012, and I was really glad when I saw it as part of the Humble Indie Bundle.  There are multiple endings (Red, Green, Blue) depending on which pill you take, and your action choices throughout the game. Let's see which one you get.. In the meantime, I'll be looking forward to Jasper Byrne's next game which is called NEW GAME+.  // Roth Sothy",
            "review_score": "1"
        },
        {
            "review_text": "Think Silent Hill as a 2D sidescroller and you get Lone survivor. Add in a bit of hell from the game Chzo Mythos and this looks like a good deal in a game!",
            "review_score": "1"
        },
        {
            "review_text": "Having so much fun with my girlfriend, she got so stress from playing this game..",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic 2D horror game. Not wildly scary, but bizarre, eerie, and intriguing nonetheless. This is one of those classic indies from the 'Braid' era and I recommend it to anyone who likes that 'retro' vibe reimagined.",
            "review_score": "1"
        },
        {
            "review_text": "The closest thing I've played to SH2 since, well, SH2.",
            "review_score": "1"
        },
        {
            "review_text": "Having never played through Silent Hill 2 (It never sucked me in, sorry), I played Lone Survivor and enjoyed my time with it. The atmosphere was dark and foreboding, pretty much making me summon courage every time I had to take a step foward. The monsters, while nothing to look at, did creep me out and want to stay away, but they got kind of boring after a while. Things did eventually get repetitious, but what kept me going was the music, the atmosphere and helping the main character survive. It is short, however, and I wished it could have gone on just a bit longer, but I enjoyed my playthrough. The ending I got kind of sucked, but that's what I get for killing everything. I heard the Red ending sucked more, so I think it's at least worth looking at if you like a creepy atmosphere and excellent music.",
            "review_score": "1"
        },
        {
            "review_text": "Lone Survivor, it's a fitting title for this amazing 2D, sidescrolling horror. You play the life of a single survivor dealing with the now known virus spreading upon the humans of his city. He has to find a way out of his appartment complex in the chance of survival. It's the only way to be gone from these deadly beings. This game tests your mind in perception. By that I mean you have to think once or another to actually succeed. 9.5/10 :D",
            "review_score": "1"
        },
        {
            "review_text": "A really enjoyable game that taps into your emotions and you can actually connect and feel for the character that you're behind. It's not a long game, but it's interesting to see how your character evolves and the fact that this game was made by one person also makes me smile to think about the possibility of indy devs in the future!",
            "review_score": "1"
        },
        {
            "review_text": "Much more survival than horror. Neither the protagonist, nor the 'storyline' (if you can call it that???), really grab you and give you the motiviation or interest to push through this basic game, a game where you're fighting with the weird control choices they made more than you're fighting anything else. I really wanted to like it, too... :(",
            "review_score": "-1"
        },
        {
            "review_text": "I really tried to like this, but just found it completely uninteresting and in no way compelling enough to bother. Glad I got it in the sales.",
            "review_score": "-1"
        },
        {
            "review_text": "If, like me, you are not a big fan of survival horror games, this game may not convince you to become one. I enjoyed the atmosphere invoked by the graphical and audio design, but the gameplay and plot often took me out of the experience. I kept asking questions that I'm not sure the game wanted me to ask. Why is this man selling items in this back room? Why am I given so many unexplained, unnecessary items? Why is backtracking more boring than tense?  It's very likely that this game requires players to be more willing to experiment, fail, and try again, but I never felt rewarded for the experimentation I did. ('Oh look, I just wasted something I didn't know I needed. Better reload an old save.') If I had been more invested in the early exploration, I might have been able to forgive some of the less-optimal moments later in the game.  This game wasn't for me, and if you can identify with my gaming preferences, maybe you should stay away, too.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks, IMO. I have given it a few tries but quit out of boredom. I generally like games that are seen by others as 'boring' but not this one. I like the retro-style look and the creepy places. The game severely lacks in interesting gameplay mechanics (placing food to lure zombies is quite cool but gets old fast). For a game that heavily relies on story, the story is below mediocre in my opinion. i didn't enjoy it. Others appear to have somehow enjoyed it though.",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't care for this game because it didn't play well on my larger television. The pixels were grainy to the point of not being able to make much out. It definitely fits the mold of survival horror, but the constant need for backtracking to sleep and save seemed like being on a constant timer, also serving to pad the game's length. Play it if you're a huge fan of both indie games and survival horror.",
            "review_score": "-1"
        },
        {
            "review_text": "BUG WARNING: The game kept forcing me into expert mode (no map usage) every time I reopened the game to resume play and you can't change out of expert mode.  I enjoyed what I managed to play. I initially went straight to expert mode, not realising it meant I couldn't use the map when I wanted to, which is insane for a 2d scroller like this in an environment with so many doors and tunnels in every direction.  Also, the hunger mechanic is pretty annoying, I can easily see it negatively impacting a play through for someone who prefers to take their time in a game like this.",
            "review_score": "-1"
        },
        {
            "review_text": "I love survival horror games, Resident Evil, Silent Hill, Fatal Frame, Rule of Rose, you name it, I'm no newbie to the genre. I just couldn't get into this game though. I think part of is that you can't really run away from enemies later on, the rest is I guess I just wasn't feeling it at all. I can't really recommend this game because of it, its just real boring.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not worth it it is SO BORING just don't buy it please don't buy it",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ you this game is boring as hell.  The turd I just took is scarier than this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The mock-retro aesthetic detracts from visuals and controls. Artistic or not, it frustrates. 8/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "A pixellated 2D copy of Silent Hill with terrible interface. Way overrated.",
            "review_score": "-1"
        },
        {
            "review_text": "Got bored with this game. The music and feel are spot on for Silent Hill fans like myself, but some of it's design choices are quite questionable. The map is a pain to use and gunplay is a little bit too complicated for it's own good. Also, the whole thing with upkeeping your character's mental and physical health is a little too needy for my tastes. Not a bad game, just has some glaring flaws that I couldn't get over to enjoy this games rather interesting atmosphere and story.",
            "review_score": "-1"
        }
    ]
}