{
    "app_id": 210770,
    "name": "Sanctum 2",
    "release_date": "2013-05-15",
    "developer": [
        "Coffee Stain Studios"
    ],
    "publisher": [
        "Coffee Stain Publishing"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Tower Defense",
        "FPS",
        "Co-op"
    ],
    "achievements": 50,
    "positive_ratings": 11629,
    "negative_ratings": 1273,
    "price": 11.39,
    "description": "Sanctum 2 is the sequel to the world’s first Tower Defense/FPS hybrid game. Pick from four unique character classes and embark on a mission to protect the oxygen-producing Cores from hordes of deadly aliens who are threatened by their existence.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/210770/header.jpg?t=1501885527",
    "minimum_requirements": "OS: Windows XP (SP3) Processor: 1.6 GHz Dual Core Processor Memory: 2 GB RAM Graphics: Shader Model 3.0, 256 MB VRAM DirectX®: 9.0c Hard Drive: 4 GB Free Space Sound: DirectX 9.0c-compatible, 16-bit",
    "recommended_requirements": "OS: Windows Vista, 7 or 8 Processor: 2.0 GHz Quad Core Processor Memory: 2 GB RAM Graphics: Shader Model 3.0, 512 MB VRAM  DirectX®: 9.0c Hard Drive: 4 GB Free Space Sound: DirectX 9.0c-compatible, 16-bit",
    "reviews": [
        {
            "review_text": "This game is ridiculously hard. It's by far one of the hardest games I've played. The challenge is nice for a change.  The game is multiplayer-centric and co-op is set to 'public' by default. It was a bit of a shock the first time someone randomly entered my game, but he was very helpful and we won. The community is very sporting, not a lot of finger pointing when a game is lost. Having a different team each time you play keeps it interesting.  In Sanctum 1, the FPS element served to supplement the TD element and it was often possible to win without firing a shot. In Sanctum 2, both elements are vital and you must be good at both to survive. The separation between tower bases and towers means your options for pathing are much more limited in the beginning than in S1. Moreover, the FPS has been made much harder than it was as the enemies now fight back and your character can be killed (knocked out for ten seconds).  Overall, Sanctum 2 is one of the best games of the century.",
            "review_score": "1"
        },
        {
            "review_text": "Best Weakspots Ever. No longer do we have to go around blasting off boring old heads, in this game AIM FOR THEIR ♥♥♥!!! Glowing orange butts that you get damage bonuses for penetrating with your powerful arsenal.  10/10 Would penetrate again.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2: A Review  You might be wondering, why am I reviewing it now, why not 6 months ago, or even when it came out? The simple truth is this. Sanctum 2 has been out for a little more than a year now and in that time the game itself has gone though many changes. So much so that it is hardly the game it was whence it first arrived on the market. Sure it's always been a FPS/tower defence, but in such a different way than when it was first released that a whopping 3 whole days after it's release, the Devs released a patch that set in motion the game you see before you today.  Now, your time is precious, and I understand that, so for those looking for just the short answer to the question: 'Should I buy this game?' That answer is, unequivocally, and without a doubt in my mind, wholeheartedly, seriously why haven't you just pushed the add to cart button and checked out already?!?!  For those of you who are of the more discerning...Steam...Steam-inites? Steam-ies? What suffix do we use to classify the people of our wonderful Steam Community? Hmm I wonder... In any case, for those of you wanting to be convinced, there are several reasons why this is the game for you, your mother, your brother's dog, and that pen-pal Geoffrey who you wrote to and exchanged letters with in primary school from Uzbeki-beki-stan-stan, that always said he was going to come visit, but never really had the means to do so; still it was nice to see someone from the other side of the planet and who had just as many gramatical and spelling errors in their writings as third grade you did back in the day. Yeah, remember Geoffrey? Well even though he wont be visiting 'Amerika', he probably now plays this game and if you play this game too, the both of you have the option of text to speech chat! Ah yes, you heard me correctly, TEXT. TO. SPEECH. In an almost Stephen Hawking like manner (until you select your character that is), you can wow the masses with literal pronunciations of the written English language which is always good for a laugh, but terrible for poor old Geoffrey who's been desperately trying to learn how to pronounce words that he couldn't learn from his Speak&amp;Spell.   'Ok, so what's so great about that', you ask as you feel so very smug in your smug chair, wearing your smug bathrobe, listening to smug jazz, sipping your imported smugness coffee/tea/caffinated beverage, and occasionally adjusting your monocle...smuggly. Listen here Smuggy, have you ever heard Stephen Hawking sing the theme to the A-Team? No, you haven't? WELL I HAVE. And this game has let me do that, it sounded much like I thought it would if Stephen Hawking were part of the A-Team. 'Big deal', you say? Well a little known fact about Stephen Hawking is that he has relatives, that's right, relatives! And whether they're actually related or not there's a player here in our very own Steam Community who goes by the very similar name of Tiger Hawkins. *(Flashback)* Long ago, in a galaxy far far away... he very bravely (and without the use of right pinky) fought off hordes of Lumes (the game's monsters) in a Survival challenge set forth by the Developers in Sanctum 1 with the promise of everlasting fame, fortune, and imortalization within their games. Alone on the battle field his war raged on, until finally, he cleared the threshold of damage being able to be dealt and beat the Devs at their own game! (Actually he just survived the most waves out of anyone...ever) He was imortalized in both games just as the Devs had promised, and he lived happily ever after. *(End Flashback)*  Feel like the game has been out far too long for you to bandwagon onto? Not a chance! With every new Steam sale, a horde of eager beavers, not unlike yourself, flood through the gates of Elysion One Core Guardian training grounds and look like a bunch of fools until someone with a little more knowhow plays a map with you and corrects the error of your ways. To which you feel a little butt-hurt about it and you go off and play single player for a while until you realize that 'HOLY CRAP, THIS ISN'T LIKE OTHER FPS GAMES IN WHICH THE ONLINE COMMUNITY IS JUST FULL OF RUDE ASSHATS AND TROLLS, AND THEY WERE JUST TRYING TO HELP ME LEARN!!!!' (*cough* sorry, accidental capslock and whatnot) Seriously, the co-op community in Sanctum 2 is very quick to come to the defense of someone who is 1.) New. 2.) Under Attack. or 3.) Being yelled by someone who they themselves aren't pulling their own weight.  Want to be UBER L33T 360 NOSCOPE 420BLAZE-IT and go charging in head first, not a care in the world, complete disregard for your own safety for the sake of your own team mates? Go right ahead, so long as you have the right perks equiped. 'Wait a minute, there's perks too?' Yes, there are. There are TONS of them, and you get to pick a few per map to help customize your own play style. Don't feel as though you need to be the guy mentioned above as you would rather spend your time building a map so that your towers do all the hard work? Sure, that's possible too! Find that you're at neither extreme and would like to join the rest of us under the Bell-curve? Great, see you there! *high five*  Character skins, DLC maps, guns, perks, DEATH, Sanctum two has it all! But wait, order now in the next immediate time frame and CoffeeStain studios will supersize your order by throwing in their trademark easter eggs! Ever wanted to occupy your character with some rad-arcade-gaming action while you wait for your online friends to decide whether to upgrade this tower over here, or that one over there? BOOM! Wish granted! There are game stations that you can find in game maps that will allow you to play games within the game! Game-ception! (Except that I really hate this trend of adding 'ception' to anything that happens within itself. Yes the movie started it all, but the title when way over your heads. Inception, was what it was called because of the plot point of planting the seed of an idea, not because they needed to go 12 billion layers deep! Whatever, Game-ception!)  If that last point hasn't convinced you then there's not so much more I can do to convince you other than letting you know that this game has a super chill soundtrack, significant amounts of replay-ability, and you get to shoot things in the face/back/butt/weakspot, causes you to think and then punishes you for making bad decisions, and when you finally manage to beat it, you enable the Feats of Strength, and relearn every single mechanic the game has with expert precision, timing, and bragging rights per wave when the MVP status is awarded. Buy the game. Buy the DLC. And maybe, just maybe, this wonderful game will reunite you with Geoffrey.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't ever played in the Tower Defense genre, but the idea of a FPS hybrid made me curious.  For sure, it was different then I had imagined when originally checking out the game, but in a good way.  Alien environments with a nice combination of FPS and Tower Defense gameplay, as advertised.  I don't know if it is something I would ever go at alone, but with friends it was amazing.  If you like games that rely heavily on team coordination and want something you can co-op with your friends, then this game is worth checking out.  The overall concept is really great, in my opinion, and the visuals are nice on the eyes compared to the urban environments I usually find myself in.",
            "review_score": "1"
        },
        {
            "review_text": "  If you play Team Fortress 2 or any Strategy games, this game is for you. ",
            "review_score": "1"
        },
        {
            "review_text": "strategy + shooter = best game ever  game genre: bugs in ♥♥♥ shooting simulator",
            "review_score": "1"
        },
        {
            "review_text": "In short, Sanctum 2 is what happens when tower defense meets first person. Imagine playing Starcraft sunken D with Jim Raynor randomly standing around somewhere, except you're dead smack in Raynor's shoes looking through his visor.   Besides being physically appealing, Sanctum 2 delivers, to say the least, some diverse and varied game play thanks to it's FPS incarnation. The primary objective in the maps is to keep enemies away from destroying your power core. Enemies come in varied shapes, forms, sizes, and abilities. The most annoying enemies are the flying ones that seem to ignore tower/brick placements. Other enemies can be small and quick or large and slow. The big enemies all have a certain sweet spot you need to shoot in order to take them down accordingly. The characters within the game (4 all together) all have differing abilities but are more or less the same in strength. I personally chose the girl with the double jump ability because you can't beat jumping in mid air and defying gravity. Their weapons also differ and special. The more shots my character successfully lands on an enemy means the more damage the subsequent bullet will deal.   Besides normal rate of firing, the character also has a secondary firing system for their weapons which can be triggered by pressing RB. Alternatively, players can swap between two weapons as seen in Halo series. The secondary weapon also has the ability for alternative fire. Tower bases can be placed in certain locations (as seen on the HUD mini map), and actual gun towers cannot be placed freely. Bases guide enemies and only a certain amount is given every wave. Gun and base combinations are possible but only if bases are available. Unlike starcraft multi player defense games, not every base can host a tower. Tower's cost a pretty penny by themselves, the player also has to take into consideration whether to install a new tower or to upgrade an old one. Some of the tower types include a gunner, a shock proximity sort of machine, a tower that slows enemies down (very handy), gatling gun, and not limited to rockets.   Graphics are pretty spot on and resemble a cross between Cloudbuilt, Borderlands and Call of Juarez. Sounds do immerse one into the game and gun fire sounds somewhat futuristic and accurate. The towers make different noises depending which one you install and the enemies all sound like their a bat out of hell. I should mention the heads-up display (HUD) has been done with great care. It is hard to keep track of towers and which way enemies will go, there is a minimap provided to show you the route in which enemies take, which also shows where your blocks/towers are and at what level your towers are at. This is insanely handy.  Overall a good game with a decent price. I would highly recommend the purchase on sale. I personally like it for taking a step in a daring direction. It isn't easy to mix a tower defense and FPS concept together.   RATING : 7.25/10        Gameplay   B     Story / Campaign   B     Visuals / User Interface   B-     Sounds / Music   B-     Replay-ability   C+     Overall    B-      ScreenShots :",
            "review_score": "1"
        },
        {
            "review_text": "Pros: +Not your usual Tower Defense game. +A large amount of maps, at least half of them with unique layouts that require differen strategies to beat. +A fair amount of different enemies, some with unique traits or weakspots, especially on the DLCs. +Choice of perks and weapons can really make the play experience of each map different. +Fair amount of playtime, around 30-40 hours if you include the DLCs (which fortunately ain't very expensive), more if you are going for the Feats achievements. +Text to voice chat which can be quite amusing during group play. +A sorta decent story with cool comic-like presentation. Not the best thing ever but it works fine. +Perhaps not something meaningful for other people, but being a Coop game where you actually have to work together with your allies rather than shoot them on the face as any FPS is a big pro for me.  Cons -Some turrets can be... well, entirely useless, while others become more or less a must have for most of the maps (ex: Violator), ruining in some way the porpuse of having a wide variety of turrets. -When playing with others, if you have a lvl 30+ player join with new players or low level ones, the player with high level can make many of the first half of maps trivial or way too easy.  Veredict: While it is not the perfect game or one to call 'game of the year!' or similar, it is a fun game to play if you have nothing better to, even more if you have friends to play it with and its not an expensive one at that (and it often goes on sale here on Steam).",
            "review_score": "1"
        },
        {
            "review_text": "I was a bit skeptical about this game. At first, it appeared to be a simple tower defense game, where you can fight in as well. But I have to say, I'm pleasantly surprised.  The tower defense bit I can be simple about: It's your basic tower defense. Machine guns, high damage guns, slowdown turrets, those kinda weapons are available, and all upgradable. You can buy them with credits you earn through gameplay. You place these guns on blocks, that you can use to lay out the path for the enemy to follow.  For the ingame fighting, you can choose from 4a5 characters to play, which basically determines your main weapon: Shotgun, sniper, machinegun. By leveling you get access to more weapons and other stuff. Although the weapons are not upgradable, you can use perks to increase their damage.  But it's the versatility of the in-game combat that give it that little bit extra that makes it interesting. You can engage some enemies, so they attack you and can be lured away from the path. Some enemies have higher damage points on their bodies, for extra damage, if you can hit it. Some perks can really help in killing off those enemies. In short, it's not just simple shooting that has been added, it gives it that little extra that makes you wanna play the game some more, just to try out those little extra perks or weapons, to see if you can get further.  There is 4 player coop, where all resources can be shared freely.  And graphically, it's ok. I do like how they added the little men to fight with you. They suck at combat, but it's a little extra that gives the game a 'face'.  Basically, if you like tower defense and FPS, you'll like this.  ",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to talk/rap in Stephen Hawkings voice? Now you can.   While the first Sanctum focused more on the Tower defense part the first person shooter aspect suffered/ was barely there. enemies didnt react to the play, Sanctum 2 focuses this time around on the first person shooter aspect which shines not only compared to the first Sanctum but is great itself, because of the variety when it comes to enemies and their ablities and your weaponry to actually counter these. Enemies are going to have Shields, heavy armor, long range, long range aoe, stun towers around them, revive themselves and many more.   Ofcourse there are many towers to counter these specific enemy types aswell, for example:  -Drones are able to pierce through any armor but the deploy rate is pretty low,  -The gatling tower has an incredible fire rate and is actually devastating to enemies that take more damage over time and smaller foes but doesnt even scratch enemies with armor,  -The cannon starts of as a tower with decent damage and range and by upgrading it the firerate decreases for a huge attack and range boost which allows the tower to pierce through specific armor.    Your abilities are also quite game changing, these vary from skills that allow you to either pick from passive abilities like core heal to abilities which increase your fire rate up to 200% (you can choose up to three perks which change the way you play drastically, either changing the role you play completely or further supporting it). You are also able to choose between four characters which all come with their own unique abilities, strenghts and weaknesses:  -Setting enemies on fire and dealing damage over time depending on the damage you dealt while also gaining the ability to make moves such as strafing easier to perform (crowd controle-much harder to do critical hits/to take down enemies with specific armor)  -Increased health and increased damage in close quarters (kiting/heavy foe killer-not as useful against enemies with specific armor),  -The ability to double jump and deal more damage with each shot (allround character-depending on your weaponry and skills)  -Besides gaining more critical hit damage you also do more damage if you hit critical hits in a row while the spray pattern´s accuracy for all weapons is increased greatly (heavy foe killer, best at taking down enemies with specific types of armor-gets overun quite easily)    Combine that with absolutely beautiful looking maps which let you play the way you want to (in terms of deploying your maze which enemies have to go through and also depending on enemy type and the tower themselves) and you have this game. but seriously if i could choose one game which i would play for the rest of my life, it would be this one.",
            "review_score": "1"
        },
        {
            "review_text": "Oh shoot! I gotta write a review to express my love for this game.  Guys... I FREAKIN' LOVE THIS GAME. YO. If you lookin for a tower Defense game.... Look no further! It is here! &gt;;D BUY IT.   It's PVE... No Pvp at all. If you struggle in PVP like I do! This is the game for you! I use the assault rifle and SMG alot from the character Skye.   Highly recommend, getting that awesome Drone Launcher in the DLC 'The Pursuit.' it's worth it cause you get to see tiny drones attacking the Aliens + it's cause I'MA LAZY BUM. :3",
            "review_score": "1"
        },
        {
            "review_text": "i love this game. its really fun and memorable especially with friends where you go into sand box and blast away at them and invent challenges for games i can already see myself having fun with me and my friends ",
            "review_score": "1"
        },
        {
            "review_text": "It is a good mix between FPS and Tower Defense games. The game focus is the co-op, so you should expect a more difficult gameplay when going solo, but still a very entertaining game.",
            "review_score": "1"
        },
        {
            "review_text": "I have over 100 hours on record, have beat the game with (almost) all feats of strength, (was) on the leaderboard for several survival records, have all DLC, and am the top level you can get, and I still have fun with this game. Sanctum 2 never gets old, and it is a great game with many different strategies that can be tested, and you will find that one strategy one player uses doesn't work for another. It's up to you to find your own strategy, and you will find singleplayer is a heck of a lot different than multiplayer. This game is a challenge, yet a fun one. I enjoy this sequel even more than the original Sanctum. Sanctum 2 has a whole lot of content available that all lead to more awesome. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Is it weird that i like sanctum one more. They did improve some stuff, but for the most part I don’t like the changes. Cant lvl up your guns anymore, you get a few building blocks every turn, that you can put stuff on top or make a maze, if you fall off the map you cant re-spawn until the end of wave, that has cost me a game. Go try the original sanctum",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games i played",
            "review_score": "1"
        },
        {
            "review_text": "Tower Defense+FPS describes it. Difficult, challenging, great to play with full party.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very cool game. A mix of tower defence and FPS. extremly fun especialy if your friends join you with the 4 person co-op function. I love playing this game just to relax and have a good time.",
            "review_score": "1"
        },
        {
            "review_text": "You gotta try this.",
            "review_score": "1"
        },
        {
            "review_text": "If you've played the first game and liked it then you will more then likely enjoy this game.  If you haven't played the first game or didn't like it. Well this is for you. This game is all the good ideas of the 1st game, all the cool towers, and guns. Along with this they added in a character selection which lets you have a variable strategy. They also simplified upgrades, now you don't have too worry about upgrading towers and guns. Tower Bases are not these huge things you need elevators too get on top of. Everything looks better, I mean just better. The story the art, this game is a simple gem and amazing fun",
            "review_score": "1"
        },
        {
            "review_text": "Great game, only issue is it gets stupid hard if you're playing alone, so it requires some pals.  The DLC is good, but not worth the full price, but it IS worth it if it is on sale.  My score for this game is a 8.9/10, because its the 2nd of its kind, and it pulls the elements from FPS and Tower Defense games that I loved the most, along with pulling an element from games like TF2 or L4D: TEAMWORK!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! It is a lot of fun to play with friends, it has a nice little backstory with well drawn comics before every level, and it is quite a challenge with hard modes turned on. I haven't played much of it single player, as I don't find that as fun. But for co-op this is fantastic.  Core guardians! &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Liked the first Sanctum? I did so I recommend that too but boy oh boy! This tops the amazing game spectrum with an whopping 12/10! It has aliens, action, sci-fi and a truck load of traps, towers, guns and aliens. Don't miss out on this fun so go ahead and get the game! You won't regret it.  Stellar graphics are also involved in this game with its' killer concepts and artistic values.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best tower defense I've ever played so far, 9001/9000 will turret here turret there again",
            "review_score": "1"
        },
        {
            "review_text": "A great game overall.  Build a maze and place defensive towers in the building phase. Then just click enter and start shooting the enemy creatures with your own guns.  That's a great mechanics and it didn't change since the first game. But there are some drastic changes which fans of the first Sanctum didn't enjoy: now the player is vulnerable to attacks, so mosters can kick your ♥♥♥ if your are a slowpoke. Moreover, some monsters are now aggressive and start chasing the player if he gets in range of their attack. Even more than that: blocks on top of which you place towers are now significantly lower than in the first game, so even if you are standing on top of a block, the monsters can still punch you right in the face! And one more thing: the number of blocks and towers that can be placed on a level is limited. Compared to the first game, this one has different characters to play, lots of perks and a leveling system providing a great versatility for playing and making completing the game fun (both solo-mode and 2-4-player mode) If you have played the first Sanctum, then you can already decide whether you want this game or not. If you haven't... well just TRY IT! It's a lot of fun! :D",
            "review_score": "1"
        },
        {
            "review_text": "Best Tower Defence! And can make your hands sweaty at some moments:D",
            "review_score": "1"
        },
        {
            "review_text": " Tower here, Tower there...    Sanctum 2 is a First-Person Tower Defense game that is amazing, and needs to be purchased and added to your library right away. The game is beautiful, I sometimes just run around taking screenshots its so pretty, I love the map designs and character designs especially. Multiplayer with someone you know is to be prefered, I personally can't enjoy a game when I'm lonely. The various towers and weapons given to you are fun and enjoyable to use, and every item has a purpose. Being a defender of the core, and building your own death maze to   murder   the invasive monsters, as your robot companion ask for coffee, is a very fun filled endeavor.   By far the best feature is the robot voice that speaks when you type to communicate to your team.   Combat has a sci-fi feel, and there is a very satisfying sound that emits from your rocket launcher as you squelch your enemies and are thrown by knockback. The easter eggs hidden in the game are a fun surprise to hunt for, and I loved the references I saw.   Overall, if you enjoy a strategic multiplayer game to play with your mates, pick up Sanctum 2 and place those tower bases.  ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 I can put mines on my head and wear them like hats.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game! This is combination of TD (tower defence) in FPS gameplay style, very addictive game. You would not believe how time flies because it is interesting, leveling and become stronger and stronger, unlocking stronger and stronger weapons. Each character has unique abilities and weapons. Also very interesting to play with friends in multiplayer.  Great game you will not regret!",
            "review_score": "1"
        },
        {
            "review_text": "A great hybrid between a FPS and a Tower-Defense game. You can play Co-op with 4 friends or even 4 random online people. 4 character classes, lots of towers, perks, and not a whole-lot of guns.   If you're looking for some fun Co-op, play this. If you're looking for some hard tower-defense, just turn on all 'Feats of Strength'.",
            "review_score": "1"
        },
        {
            "review_text": "this game should never be dissed becuase it is a good mix of the two elements that are in the tags (fps and tower defence) i highly recommened this game becuasee it is really addicting and it is also fun to see everything it offers you with.the guns are amzing the characters are all unique in skills and the dlc really stands out i mean have you ever seen a skin pack dlc in a game that isnt minecraft xbox 360.also the best character i think is the dlc one who i cant remember the name of.because they have the strongest starter gun which is a ballista (crossbow). back to the point of the game.anyway.GET THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "If you like Tower Defense games like in good ol'Wacraft, and if you like Big guns with a hell lot of Bullets like in Bordaerlands. AND if you are looking for a game that combines these two things: you should look for Word of Borderwarsm, but till that game is developed: this is the best Tower Defense First Person Shooter i've ever played. well, its the best Tower Defense since Warcraft 3 so stop reading and Buy it for you and your friends!",
            "review_score": "1"
        },
        {
            "review_text": "A success in mixing FPS and Tower Defense Together. Both elements work well,it has 4 Player COOP,4 diff. Charackters with diff. abbilites,new unlockable weapons,towers and perks and different Difficult Increase Modifiers which gives more Rewards,good for strong Coop groups,they can make their Enemys faster,stronger and so on. At the Moment the Game is 14,99 and for this Price i definately recommend it. You dont realy have to like Tower Defense to enjoy this Game im sure",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game. Take a tower defense game and mix it with a first person shooter and this is what you get. This one is much better then the first one because there is a level system. As you level up, you get better towers, perks, and guns. The DLC is also pretty great. If you buy the season pass you get 16 more levels and even an extra playable character. There isn't much story, but there is a pretty cool comic before each level. For 15 dollars you can't go wrong with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing strategy tower defence game which unashamedly throws mobs into your path for your pleasure",
            "review_score": "1"
        },
        {
            "review_text": "This game is a perfect combination of the FPS and the Tower Defense genres. Theres a lot of customizability, both in the TD aspect and the FPS aspect. This game is fun in single player, but the co-op makes it a whole lot more exciting.",
            "review_score": "1"
        },
        {
            "review_text": "You play this game only with focus.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, got it on a whim turned out to be a good decision.",
            "review_score": "1"
        },
        {
            "review_text": "Difficulty not to be taken lightly, this is a very fun and enjoyable tower defense and first person shooter. Genres blended fantastically. Gives you the strategy high of TD and visceral fun of an FPS. Waves get intense very quickly",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent faster paced follow up to the first sanctum where you can play as one of four characters fighting the lumes to protect your oxygen producing cores that threaten the lumes. You can use a multitude of weapons and towers along with your characters unique skills and perks to maze the enemies and keep the cores and yourself safe.",
            "review_score": "1"
        },
        {
            "review_text": "Fun exciting tower-defense goodness. Enjoyable and challenging solo or in a group!",
            "review_score": "1"
        },
        {
            "review_text": "Huehuehue.  FPS Tower Defense concept. Not really worth it to buy, buy if you like TD and have money, why not?",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a really fun and challenging game where you will often need the help of your friends or the rest of the community to complete the maps.  The game takes place in a futuristic world where you take the role of one of four core guardians. Your task is to protect the cores from advancing waves of alien monsters called lumes. The storyline is very nice and well worth following to learn more about the cores and the lumes so I won't spoil it for you. To your help you have a wide array of different towers, weapons and perks and every level you unlock new goodies to use!  The game has 4 available DLCs and I recommend them all as well as they all add new lumes, weapons, towers and perks. All 4 DLCs combined provide as much content as the original game!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun game if you pick it up for $3 you will NOT regret it",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS FUN AND COOL AND HELPS YOU WITH THE LADIES 10/10 WOULD BUY AGAIN",
            "review_score": "1"
        },
        {
            "review_text": "Really good fun, easy to get into, and challenging at the higher levels",
            "review_score": "1"
        },
        {
            "review_text": "I have played so many tower defenses games, whether on PC, consoles, or even iOS. But I have NEVER once played such a well-centered technological hybird FPS tower defense game.  I would highly recommend anyone that is interested in whether tower defenses games like Clash of Clans or technological games like BulletStorm to play this game. The game is quite simple and casual, not too much confusion for beginners. By 1-3 days of playing Sanctum 2, you could possibly understand fully all the functions in-game.  TaurusBrothers Creations Score: 73/100 0-20: Fed up 21-40: Bad 41-50: Alot of improvement opportunities 51-60: Neutral 61-70: Not bad 71-85: Above average, Good 86-100: Very good, excellent",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is the single best TD/Shooter game ever made. It is marvelous in all aspects, from level design, gameplay mechanics to ingame music. One of video game gems, if you don't have it and are thinking of buying it, you should stop thinking anymore and just get it. You will not regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Build walls to protect your balls! Buy Scrotum 2 today and keep those nasty lice away!",
            "review_score": "1"
        },
        {
            "review_text": "The game I've been dreaming off, Tower Defense / FPS - Hybrid with perfect balanced weapons/towers/enemys/abilitys.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. One of the best TD ever I played.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, especially for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Tower defense where you can pick up a rifle and help out your towers? Yes.",
            "review_score": "1"
        },
        {
            "review_text": "This game took me by surprise! It's a classic tower defense game that takes great advantage of the Unreal engine. You move around like its Unreal Tournament...which means double jumps and more. It also has a rich level system with loads of unlocks and specializations.   What's more, is that its geared towards multiplayer. I regularly have randoms jump into my games and its always good fun. That being said, a legit group with friends is always best.   Finally, the DLC is well worth it...as it adds more characters, weapons, towers, perks, etc. All-in-all, I spent &lt;$3 on this game and I expect it'll rank up there with L4D2 as my go-to multiplayer FPS.",
            "review_score": "1"
        },
        {
            "review_text": "The sequel is much better than the first. It's once again a first person tower defense. It has coop which is pretty fun. There are many improvements. Finally you can reload your weapons. Not all the enemies are shown by the first two levels. You can sell towers and not lose money. You can inspect towers to see their stats and you can partially upgrade them if you have leftover money. The levels are much prettier but you won't spend time looking at them since you are defending against the swarm of enemies. I liked it 7/10",
            "review_score": "1"
        },
        {
            "review_text": "the sequel is brilliant",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, a near-perfect mixture of tower defence and FPS, with nice controls, stunning graphics and a wide variety of difficulty options and settings for the newest to the eldest of FPS gamers. This game is definately worth a try. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "10/10  Bighead mode.",
            "review_score": "1"
        },
        {
            "review_text": "Very good for CO-OP playing. I enjoyed it very much",
            "review_score": "1"
        },
        {
            "review_text": "this ♥♥♥♥ is kawaii as hell ~Angel",
            "review_score": "1"
        },
        {
            "review_text": "Tower Defense + FPS  What is there not to like?",
            "review_score": "1"
        },
        {
            "review_text": "I got a lot of enjoyment out of sanctum 2, most of it was solo but the few times I was able to play with friends were the best. I was surprised(good surprise) at the ammount of customization you can have, the different characters, weapon choices, perk system, almost made it feel rpg like...almost, I supposed the closest comparison I can think of is bioshock, sanctum 2 obviously doesnt have the indepth story but you can make a good number of effective and interesting builds to play as. if you liked bioshock's combat and are interested in tower defense, give it a try.   I did enjoy the soundtrack but that will be highly subjective from person to person.",
            "review_score": "1"
        },
        {
            "review_text": "A bit of a challege for some, great textures, lots of easter eggs for those gamers that like to look for that sort of stuff.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on a super good sale, I've had so much fun with it. I would probably pay full price, just for the experience with friends. The best mixture of FPS and Tower defense. I wish there were more games like this out there, here's hoping they make a third game! You won't reget getting this.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. The Levels are a little unscaled (The Levels in an area might be easy, easy, really hard, easy), but it is not a problem, because of the great co-op, you can have a friend join you, or get help from a random stranger! Over all great game and I highly recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "This game.... Well, it's a fairly decent mixed tower D. You'll find that one combo that just always works as in every tower D. Infuriating part is the last level. Spent 6 hours or better attempting to beat it. Only conclusion, from watching youtube, is it's exceptionally easier in single player to beat it. The enemy scaling is just ridiculous with 4 players on the last map.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "An excellent faster paced follow up to the first sanctum where you can play as one of four characters fighting the lumes to protect your oxygen producing cores that threaten the lumes. You can use a multitude of weapons and towers along with your characters unique skills and perks to maze the enemies and keep the cores and yourself safe.",
            "review_score": "1"
        },
        {
            "review_text": "ultimate tower game, ol style gfx, but great gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "a fantastic hybrid of tower defense and FPS. Do not play singleplayer.. multiplayer is where it's at. Working together and using your wits and skills to survive is a blast...a bit of a steep learning curve due to the limited amount of weapon towers, timed build rounds, and ability to build diagonal walls. Howver once the learning curve is passed it's great. I'm not sure if 15$ is the best price. 10 bucks seems better. big problem is this is a game you NEED to play with friends to enjoy, but you can jump into random groups. Game rating: 8/10. Great Pricing: slightly too much. Wait till on a minor sale. Recomended: hell yes.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game to play with your friends. towers, cool, shoot stuff, cool, play with my friends who moved far away due to life and get to have good laughs over a few beers. AMAZING",
            "review_score": "1"
        },
        {
            "review_text": "The single player is good, unique but not amazing. The multiplayer is where this game realy shines.",
            "review_score": "1"
        },
        {
            "review_text": "It's an anime-like tower defense game with a FPS view as you contruct towers to destroy on-coming waves of enemies, while reinforcing your defenses with your guns. You can play as four different character, each with thier strengths and weaknesses, but only once you unlock them (it happens quickly).",
            "review_score": "1"
        },
        {
            "review_text": "Lots Of Strategy Involved In This First Person Shooter / Tower Defense Game. Take Out The Bosses First Though! They Can Do A Number On Your Defenses.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! If you like tower defense and FPS this is a must have.  Great to co-op with friends. Sorry to the friends I accidentally dropped a towerbase on.",
            "review_score": "1"
        },
        {
            "review_text": "much wow Gr8 game  very defense of tower   shooter of first person done well",
            "review_score": "1"
        },
        {
            "review_text": "A fun FPS and tower defence game at the same time. 9.121515243/10.4845453654",
            "review_score": "1"
        },
        {
            "review_text": "FPS+tower defense+fun+good gameplay+good story=Sanctum 2",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is my favorite most niche game of all time. The fact that it's such an underrated and unpopular game probably contributes to some sort of stockholm syndrome I have for it as the game is best played with 3-4 people and, due to its popularity, this is a rarity for someone like myself. The progressive wave based structure and leveling give sanctum 2 all the replayability it needs for me, i just wish they would release another sequel so I can try and convince my friends to get it ;_;  It also has the waifu-material 'Sweet Autumn', designed and named like a 13 year old's Deviant art OC, she will always be both my waifu and laifu.",
            "review_score": "1"
        },
        {
            "review_text": "i bought this game as the complete pack when it was on sale and i also bought it for my brother as well so we could play together and boy was it worth it ! We play it at every chance we get, not only does it have a sense of strategy it also brings more involvement as well with the 1st person shooter aspect   10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2, Tower Defense at its best. Combining strategic thinking, cooperative gameplay and the urgent need for fast reflexes I fell in love with this one at the very first sight. Increasing waves of diffrent enemies within a 3D environment demand a lot of planning and foresight thus you have to choose carefully which character, towers, skills and weapons you let come to use. Sanctum 2 proves, that lovely but simple browsergame genres like tower defense games are absolutely capable of evolving to the next level of gameplay and long term motivation.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "In this game combined two genre: first person shooter and tower defense. Average graphics, limited stuff and it's too old and never get updates.   6/10 Good strategy-shooter but too old and after some hours of playing you will get bored probably!",
            "review_score": "1"
        },
        {
            "review_text": "I'm a survivalist and a survivor.",
            "review_score": "1"
        },
        {
            "review_text": "Best Tower defence ever!  it's too bad i don't have any friends to play along with me, I'm trying to convince some friends to buy this game lol",
            "review_score": "1"
        },
        {
            "review_text": "It's been like 5 years or so since i played a game based on the Unreal Engine, basically, been playing turn-based games like Civ V, Heroes of M &amp; M V, or DOTA2 at most, which is kind of cantradictory given that i was born as a pc gamer under the fps DOOM decades ago.  Sanctum 2 has been a refresher for the fps experience i wanted:  -Lets you cool down at the tactical phase, but you get such an adrenaline rush at the rush phase.  -At first, i didnt understand the tower limit, until i played the sandbox mode, made me understand that the limit puts the right amount of challenge in the campaign and survival modes. -Liked that you can 'somehow' mod your towers behaviour ( 'use' tower during tactical phase) and that really makes a difference between Sanctum 2 and whatever other tower defense game. Maybe game designers/developers would deepen that functionality to get hardcore-die-hard Sanctum 2 fans. -The comic style to tell you the story. As an old school gamer, really liked it. -Re-playability. Remember i mentioned Civilisation, and Heroes of M &amp; M? Those are re-playable as hell, and everytime you get satisfaction having wasted time on them. Sanctum 2 brings the same feeling. -It is on current Humble Bundle. Come on, you know its a great way to get steam games. I can't wait for my friends to get it, so we can defeat that Feats-of-Strentg Campaign Mode together. Which leads to: -Very satisfying multiplayer experience, even after played with some steam-mushkin-power-gamer random punks, i can say that you get the satisfaction of watching your efforts helping the team. As well as your feats.  But to be fair, here come the things i think should be polished: -The guards. How come you got no feasible way of saving them? Why cant i send them all to the core or some secure position? Maybe in campaign if you are fanatical enough about their safety can save them, but definitively, not on survival. Believe me, every gamer dad/mom that play this game want to save the guards. The player should have the option anyways. Such a rant for those useless guards, huh? Anyways, thats just mho and doesnt affect the game development.",
            "review_score": "1"
        },
        {
            "review_text": "It is a FPS and a TD at the same time!",
            "review_score": "1"
        },
        {
            "review_text": "This is way better than the first one.",
            "review_score": "1"
        },
        {
            "review_text": "It is impossible to deny that Coffee Stain Studios took just about everything good in Sanctum and amped it up tenfold for Sanctum 2.  Enhancing the coop mode by adding three new player characters alongside the original protagonist, each specializing in one of four weapon categories (Assault Rifles, Snipers, Shotguns and a big happy rocket launcher that blinds the entire right side of your screen). Like the previous title, Sanctum 2 is a fast-paced FPS tower defense game that requires a heavy load of brainpower to keep the waves of alien enemies away from your core. In Sanctum 2 the challenge level is increased, giving the player less resources after each wave and removing the ability to upgrade weapons with resources, forcing the player to focus less on weapon damage and instead on carefully placed towers, walls and turrets to keep the enemy waves back, as well as the addition of a timer to mix things up and make the waves more chaotic.  With an immersive campaign mode playable in both single player or coop, Sanctum 2 offers mind-blowing gameplay complimented with a level-up system that rewards the player with unlockable towers, weapons and perks as well as a digital comic that offers insight into Sanctum's world which reveals a page or two before every stage.  Sanctum 2 is a direct upgrade to Sanctum, and is well worth the time for any fans of the original.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game in the style of Orcs Must Die 2. A little awkward, but well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "If you like TD maps on warcraft frozen throne then you gonna love this game :D",
            "review_score": "1"
        },
        {
            "review_text": "Great..",
            "review_score": "1"
        },
        {
            "review_text": "Amazing combination of FPS and TD.",
            "review_score": "1"
        },
        {
            "review_text": "They finally get it right. This game is very fun, with many enemy types, more than one character to choose from and allows for many different player strategies. The 4 player co-op is very good too.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, we finished it and all the DLC. It's really worth a play!",
            "review_score": "1"
        },
        {
            "review_text": "+",
            "review_score": "1"
        },
        {
            "review_text": "my craptop can run it on max",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Decent sized campaign, but the ability to co-op and play with feats of strength keep it challenging and fun. Tower defense as a FPS, brilliant! Highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "very fun first person shooter and tower defense game, it gets a little tough on single player when the maps get bigger but the about of unlockable weapons and perks makes it a really fun game   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Coffee Stain (them ♥♥♥♥ers responsible for Goat Megalelz Simulatorz) finally released the actual game. Sanctum 1 plays like an alpha test compared to this. Un-broken as ♥♥♥♥ at last.",
            "review_score": "1"
        },
        {
            "review_text": "9/10  The art design is great, the Enemys are fun and the soundtrack makes the fell of the game.  Though it does not hit the 10/10 I would have givin the first Sanctum.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game to play with FRIENDS",
            "review_score": "1"
        },
        {
            "review_text": "fun game to play with your friends, co-op",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 remains a refreshing hybrid of two genres, tower defense and FPS. The result is a unique game experience.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, espssially for co-op/",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the coolest games I've ever played. I mean, I dug the first one, yo. But this one. Booooy, oh boy, it sure steps it up a few notches. Bloody awesome characters, some of the most sweetass graphics I've ever seen and absolutely incredible gameplay. Easily one of my top 10 games~",
            "review_score": "1"
        },
        {
            "review_text": "What could be better than herding alien bugs into a maze of death traps? Shoving a futuristic pump action shotgun up their @$$ as you herd them through it.  It doesn't matter what your cup of tea is in gaming. This isnt @#$ing tea and you're gonna love every bit of it.",
            "review_score": "1"
        },
        {
            "review_text": "A great game for a decent price. this game offers some of the best Co-Op around with a speciality of its own. the storys actaully good, the level desighn is beautiful! a must buy if your new to steam cause the communty is full of good guys, the games kids freindly and its not too hard to learn. aslo teaches FPS if your new to the genre.  youll have fun with this for hours! i know iv only played a little but i have so many other things to play. i widsh i could play more of this. msg me for a game but ;)  the graphics are a marvel in themselves withy stuctures that are just awsome and cartoon feel that hits the sweet spot ofi want to kill and love. everythings clean but intresting an a few times iv found myself just looking at the map.  a tower defence game is what this is but not directly and thats great because it brings, FPS players, new gamers, and stratedgy gamers all to one amazing game. as i said before the communty for this game is alive and happy!  the class system. this is what lets the game down a bit but its still well done. classes are rather basic but at least they have them and getting new character levels can be a true grind but thats not the main game so its ok. at least its there and makes you want to keep playing.  overall verdict, 7/10 -1 for grinding levels -1 forcan be boring after a long time -1 because the game simply idoesnt have alot of levels (dont worry youll still stack up 50 hours of this easy)",
            "review_score": "1"
        },
        {
            "review_text": "I recomend this game to someone who likes tower defenses. It is a amazing game and I want to see more people playing this amazing game",
            "review_score": "1"
        },
        {
            "review_text": "a huge improvement to the previous game, but kinda unstable. if I wasn't so worried about the stability of my computer, I would keep playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum is an awesome futuristic tower defense-first person shooter hybrid which invloves strategical tactis. Unlike ohter FPS game, this ain't just blind shooting. U gotta use ya brains.",
            "review_score": "1"
        },
        {
            "review_text": "Great soundtrack. A well done game.",
            "review_score": "1"
        },
        {
            "review_text": "A very unique and amazing game",
            "review_score": "1"
        },
        {
            "review_text": "I higly reccomend this game, it is an anmazing combination between first person shooters and tower defense games, in short PURE GENIUS. The levels are beautifully designed, with unlockables, character advancement, and many dlcs. In short I would rate this game a 9.5.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is good. I'm not gonna spoil anything about the gameplay so the people reading this can judge for themselves. On a side-note: This game can have mayor performance problems, if you have a low-end PC, don't get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Just a sweet tower defense and shoot 'em up game :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game! like the FPS and the Tower Defence Action!!",
            "review_score": "1"
        },
        {
            "review_text": "get this game. get it now. its ♥♥♥♥ing amazing",
            "review_score": "1"
        },
        {
            "review_text": "A very unique and amazing game",
            "review_score": "1"
        },
        {
            "review_text": "Annoying friends simulator 2013. Oh, and the Tower defense part is fun, too.",
            "review_score": "1"
        },
        {
            "review_text": "A brilliant fusion of both FPS and Tower Defence. Though you would think the feel of Tower Defence is slightly lost through the FPS style, the objective still remains clear - the combination is a fine one. A very original game and in my opinion well worth the buy. There are many unlockables and ranks to be progressed through, plus the DLC adds a whole load more to that, making it a very rewarding game in its own respect. This is also great fun in co-operative/online play.",
            "review_score": "1"
        },
        {
            "review_text": "Hard but good. I can't reccomend playing this alone though.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a great follow-up to Sanctum 1. It's a tower defense, FPS, action, strategy Co-op game, based on defending the core from lumes, alien invaders trying to destroy the planet.  Sanctum 2 is, yes, a online game. You can make your world online, so that other players can join, or private, so that it is just you. There are 4 worlds, not counting the DLC worlds. There is a campaign to the game, but I don't really know how to explain it. The game is great for playing with friends, and I really enjoy this game. The DLC for the game, uncover the rest of the story, since the end of the game left players at a cliff hanger. Some of the achivements in the game can only be unlocked by getting AND playing them. The main strategy is to maze the level, and place down as many 'attack towers' down as possible.  Overall, this is a fantasic game. I really like it, and it was one of the first games, (besides Borderlands 2), on Steam that I ever played. I recommend this game to everyone. ",
            "review_score": "1"
        },
        {
            "review_text": "Game of the year 2013",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defense, what I've seen. Ever!  More DLC and stuff! 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "beatfulll and cherming ! fun to play solo or co-op",
            "review_score": "1"
        },
        {
            "review_text": "This game, despite what all the fuss is about it surely an ideal game for fun. It won't blow you away but it does become addicive. Playing with friends is a must and makes this game better, overall a good prices. Don't expect anything that will blow your mind though",
            "review_score": "1"
        },
        {
            "review_text": "I'm review number 9001 :3",
            "review_score": "1"
        },
        {
            "review_text": "A fun game that is even better in co-op. What makes this game even better is that it has text-to-speech like Moonbase Alpha. So if you get bored waiting for a friend you can goof of with it. So if you like a co-op strategy game with the best part of Moonbase Alpha in it, then you will love this game.",
            "review_score": "1"
        },
        {
            "review_text": "GET IT",
            "review_score": "1"
        },
        {
            "review_text": "Not just a defense tower game: build the best maze you can, place your towers and begin jumping and shooting like hell. A really fun game for solo and coop.",
            "review_score": "1"
        },
        {
            "review_text": "At first this game isn't too special, the maps are very simple and getting new towers/abilities/weapons takes a while. But once you've hit the lv20ish range, chances are you'll have made your way to the more interesting maps and have plenty of stuff in your arsenal. The DLC also provides quite a few good maps that I liked better than the originals, along with two new towers in most of them.  Aside from the relatively slow leveling curve, there isn't really anything to complain about. Obviously it's better to play with others but luckily usually someone else who's made their way into at least the mid-teens knows what's going on and will recognize a good setup, so arguments over tower placement aren't an issue or at least haven't been much of one for me. Aside from some pair of two year-olds that muted me and wouldn't dare let me touch their sacred wall segments where they hadn't even placed turrets. Every game has some ♥♥♥♥♥♥s playing it, I suppose.  If you think whatever resources you're given after each wave are 'yours' then either drop the greedy mentality or don't even bother playing this game with anyone but yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Half First-Person Shooter, Half Tower Defense Game, you build towers and puzzles and shoot aliens, atleast that's what i learned before the game crashed and stopped working forever. This game is fun i should say even though i haven't really played it, it makes no attempt to introduce itself to a new gamer, no voice lines of any characters other than your own. 8.5 / 10 Maybe worth buying?",
            "review_score": "1"
        },
        {
            "review_text": "I really like when people do something interesting with tower defense. This is one of those interesting things. People have tried doing 'hybrids' of these before but they've always felt either forced or biased towards either the shooting part or the tower part. Here they did a pretty good job, and the level design (which is important) for this kind of thing is great. Not only do the levels offer good options for setting up towers but they are  pretty . That's something people skimp on when doing this kind of game design because often people are looking at terrain formation to figure out their towers rather than the aesthetic, but not here. There is so much to look at on these levels and it really works well with that signature Unreal-engine-shiny look. This seems like one of those times where people chose the engine based on the game design rather than the other way around, because unreal works  very  well for those sterile-futuristic-glowy arrangements. Some friends and I have an ongoing series of highlight clips of our sessions  here . (first video is me doing it solo)",
            "review_score": "1"
        },
        {
            "review_text": "Good so far. Thanks Mitch!",
            "review_score": "1"
        },
        {
            "review_text": "Things that make Sanctum 2 better than dungeon defenders: - no item grinding - Many different Enemies with different abilities (e.g. armored ones that needs to be hittet in weak spots, so you need to kill them) -need of intelligent Tower placement, no all-around tower. -Mazing",
            "review_score": "1"
        },
        {
            "review_text": "Really amazing game its really fun with multiplayer more then single player.",
            "review_score": "1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "A mix up of tower defence and fps genres, very fun!",
            "review_score": "1"
        },
        {
            "review_text": "A mix up of tower defence and fps genres, very fun!",
            "review_score": "1"
        },
        {
            "review_text": "i did not buy this game it was a new for you. then, i had to buy it, but it was AWSOME.",
            "review_score": "1"
        },
        {
            "review_text": "this is a epic game for to to play it i really like this game sooooooo much this game is quite addicting for me :D XD :3",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, fun and interactive, has a blend of FPS and Tower Defense gameplay that standout from other games with a, fun and well created game",
            "review_score": "1"
        },
        {
            "review_text": "The Text To Speech can sometimes be more fun than the game.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun, great, and all that you expected",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Decent shell, combines strategy and FPS fairly well. could use more asthetic options but other than that, very fun!",
            "review_score": "1"
        },
        {
            "review_text": "Love the game's intensity. There's always action around the corners and stopping isn't a good idea.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Play this game with my friends a lot. You get a little FPS with your strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Very creative.",
            "review_score": "1"
        },
        {
            "review_text": "Really good tower defense with a twist.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 = Crack",
            "review_score": "1"
        },
        {
            "review_text": "  its was relly fun even on your own",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Co-op game. Takes all the best of the original and spices it up a bit.",
            "review_score": "1"
        },
        {
            "review_text": "If you like first person shooters and tower defense games, this may intrigue you",
            "review_score": "1"
        },
        {
            "review_text": "Like tf2 with guns",
            "review_score": "1"
        },
        {
            "review_text": "This is a must play if you like killing aliens!",
            "review_score": "1"
        },
        {
            "review_text": "its a great game with its nice graphics physics and first person shooter but once you get deep into the game it gets boring due to no fresh maps or content and very few updates",
            "review_score": "1"
        },
        {
            "review_text": "guys honestly don't own this game yet but the demo everytime was really good. this is really something differnt!. single, co-op, or a full group. this game just got better and better. and asap really wanna get this game! does take a bit of pre-planning.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Great game all around  Cons: -The character's faces look like mutant dog ♥♥♥♥ (not in the comic strips, though).",
            "review_score": "1"
        },
        {
            "review_text": "I don't even like tower defense and this game is AMAZING... Seriously why are you still reading this review... Just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "level 1 simulator 10/10 would fail at first level again",
            "review_score": "1"
        },
        {
            "review_text": "Unique concept, nice graphics and tons of fun playing with friends! If you have some friends that owns this and wish to play the game it is a great experience in multiplayer.  It isn't just a Tower Defense game, it's a FPS/Tower Defense hybrid game! The enemies have weak points, you have perks, you can upgrade your turrets ( and infinitely boost them ).  My only CON was just the game felt a bit repetitive, nonetheless it was a fun experience!",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, sadly let down by steams twitchy server dropping people out mid game,",
            "review_score": "1"
        },
        {
            "review_text": "Get it cheap. A fun tower defense game where you get to charge into the carnage! Great idea.",
            "review_score": "1"
        },
        {
            "review_text": "Its alright",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Fun, clever ,excellent flow. A definite purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defence ive played, +dlc is very good and worth the cost",
            "review_score": "1"
        },
        {
            "review_text": "Really good tower defense with a twist.",
            "review_score": "1"
        },
        {
            "review_text": "Very awesome game I was never really into TD games but now I may have to reconsider I mean this game is like well,okay I can't make a comparison but all I can say is that wIthout a doubt this is an A-FRICKEN-MAZING game",
            "review_score": "1"
        },
        {
            "review_text": "It's awesome...I really enjoy this game and i totally recommend it for fun",
            "review_score": "1"
        },
        {
            "review_text": "SANCTUM 2 has arrived.  An absolutely must-have for fans of this kind of gameplay.  Sanctum 2 is a reliable successor of Sanctum. A lot of additions, a highly potential and improvements in general has been included. Sanctum 2 has its awesome ambient-like soundtracks again. Enjoy them, so the gameplay.  New maps with more complex strategies, towers, walls, weapons and enemies are going to meet you after purchasing Sanctum 2. It has got an amazing improvement compared to its predecessor.  Get this game within its Season Pass for a few bucks now. Sanctum 2 will replace its predecessor for sure. I didn't think it was THAT great. The developers of Sanctum and Sanctum 2 have reached a next milestone.  Appreciated and Highly Recommended!  Best Regards N3",
            "review_score": "1"
        },
        {
            "review_text": "Better than overwatch",
            "review_score": "1"
        },
        {
            "review_text": "Never have i played a game souly for its lobby chat.    10/10 would eat babies again",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 has good elements comparing to Sanctum 1. But Sanctum 1 had better combat system and stuff.  ",
            "review_score": "1"
        },
        {
            "review_text": "This game is freaking amazing if you want a first person tower defence game. I believe its worth 4 times the price it is now.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "itssss awesome 100% should buy (●´ω｀●)",
            "review_score": "1"
        },
        {
            "review_text": "  good i love it for a low price ",
            "review_score": "1"
        },
        {
            "review_text": "strategy tower defence game in FPS",
            "review_score": "1"
        },
        {
            "review_text": "A FANTASTIC SEQUEL to Sanctum. Feels way more like a AAA game and far less indy game. So many improvements and a developer that fixed my only complaint with the game within 36 hours of release. So glad I picked this up, so glad I didn't listen to the haters on the forums. A trully fun game with your mates, team work isn't essential, but still needed. LOVE IT&gt;",
            "review_score": "1"
        },
        {
            "review_text": "RPG Level: non existant RPG Style: Linear 100% This is a tower defense game with varying levels of user selected difficulty. understanding the intricacies of the different units and towers and fps weapons make for a fun challenge.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a game that I really recommend because: - is a method to banish boredom - it has strategy - this game stimulate your competitive part - it has the co-op mode - it has action - have trading cards - is a truly tower defense game and... why you don't try?  Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best Bloons Tower Defense adaption I've ever seen. Great graphics, but the bloons weren't bloons but aliens instead, which confused me, and I can safely assume the rest of the Bloons fanbase felt the same way.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very nice, tower defence game, but with a first-person perspective. You do need at least two competent people, as trying to complete levels on your own is hard.  Graphics are nice. Music is limited, but not really needed. Weapons are fine.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is ok for a game in my opinion, though how it combines first person with tower defense is pretty ingenious considering you don't see many games like that. It's good for a while, but doesn't have that atmosphereic feeling to me to bring me back to it. But hey it's worth a shot to try.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun after you get used to not having a top down view of your towers. Being able to participate in the actual combat is a nice and innovative idea. Also must mention the amazing visiuals and designs from the monsters, to futuristic landscapes and the architecture.   I would love to experience this world they created in a different type of game an rpg or fps perhaps since the only thing missing in my opinion is involvement with the game world and story.  Recommended =)",
            "review_score": "1"
        },
        {
            "review_text": "I feel guilty for not writing a review about this in the past. Its a wonderful sci-fi tower defense / fps shooter in the BEST way. Up to 4 player co-op, but even enjoyable solo. You can be flexible with your strategy but will still be required to do a lot of shooting yourself.   Extremely satisfying gameplay. Make this game part of your library.  Coffee Stain Studios knocks another ball out of the park.  StickyHamster of  twitch.tv/stickyhamster   p.s. Yes it IS better than Sanctum, and you should buy that as well.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe time for a cup of coffee!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, very fun. Might get old after a while? Only started play an hour ago, but loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, a really fresh breath of hair.",
            "review_score": "1"
        },
        {
            "review_text": "A quite enjoyable game for hours on no end. Being able to smash through mobs of giant monsters and creating havoc with giant weapons and turrets and the great strategy aspect of this game, makes it worth your while.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a great addition to the series. Weather you like to simply gun the enemy down or build your maze it will be sure to satisfy. 16 levals that have great replaybility and a complex levaling system to increase your power and many classes make the levals a completely new challange every time.",
            "review_score": "1"
        },
        {
            "review_text": "This game is something i have been searching for my entire LIFE!!!! So amazing!! 10/10!!",
            "review_score": "1"
        },
        {
            "review_text": "Just great.",
            "review_score": "1"
        },
        {
            "review_text": "FPS Co-Op Tower Defense. What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "Game takes the best and funnest parts of FPS games and tower defense and smashes them together into 1 awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Good game and play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Was a rollercoaster... in a bad way.  The gameplay and matchmaking are both done very well, made me do an all-nighter which I usually don't when I first try out a game. But I don't know, over 20 hours of gameplayy I'm already kind of losing my excitment when I see Sanctum 2.  Becomes very repetitive after part 2 or 3, just don't see much replay value. If the creators were to revamp some stuff, like maybe adding game modes or funny multiplayer minigames or something entirely new, would definitely make me interested.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game. Very addicting, tower defence mixed in with FPS really comes together smoothly. My internet is trash, so I lag occasionally, but the game is always a pleasure!  Make sure to play with friends! It's more fun that way! ;D",
            "review_score": "1"
        },
        {
            "review_text": "'Nice game, like the first, but better. Less tower clutter, meaning less demands on system requirements and smoother running. Feels more like the towers are assisting the player now, rather than the player assisting the towers in the first game. Gameplay is more user friendly on the whole with lower base structures giving better player manouverability across the maps and more pace. Good challenging play with higher difficulties. Artwork for characters,weaponry, towers and enemies is an extension from the first game and, overall improved, and quite unique. Cool music and sfx, suitable for the games style. Good job from the team at Coffee Stain Studios.'",
            "review_score": "1"
        },
        {
            "review_text": "FPS TD. different gameplay. love tis!",
            "review_score": "1"
        },
        {
            "review_text": "This version is better than the original.",
            "review_score": "1"
        },
        {
            "review_text": "BUY IT BUY IT BUY IT           HEY     WHY HAVEN'T YOU BOUGHT IT YET?",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME GAME TD + lots of bugs to shoot what moar can i ask for !",
            "review_score": "1"
        },
        {
            "review_text": "Have not really played this but this game is a lot of fun when played online and with friends and it is sometimes fun to play by yourself but believe me get this game. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "First off, if you want this game, I HIGHLY recommend you buy all the DLC's with it as well.  I do not want to get into ultra detail as I try to keep this short and sweet. If I dont mention it, then I probably don't have any problems with it.  + = Positive - = Negative  Quality:  +You would never expect a small little company such as Coffee Stain Studio to make such high quality visuals like these. The world is extremely well done and dynamic as you can see buildings crumbling in the background and other cool events unfolding as you fight off the 'lumes'. I do have to admit that for me, I cant play for too long as it does give me a sense of motion sickness, even with motion blur off. I would also like a quick note that voice acting and inaminate object sounds are very realistic and doesnt seem to be bothersome.  Gameplay:  +A nice twist on tower defence + FPS. with a variety of weapons and perks, there are many customization to your character, (a choice from 4 characters) that you choose every level. There could be more customization, maybe in sanctum 3 ( If they plan on it :p) they could add armor customization and equipment upgrades.  +The towers also vary quite a bit as there are towers for utility like slowing enemies or mind controlling them. And there are towers for your everyday mowing as they turret down targets using lasers or rockets. I think it's also neat that there are flying and ground monsters (called lumes) that are affected only by certain towers as well as armored and metal lumes that have weakspots, and for the metal lumes, places where they cant take any damage.  +Oh, and did I mention all the lumes have weakspots? Yes, every lume has a weakspot, that indicats that if you hit that targetted spot, you will get bonus damage on them, also indicated by the red damage indicators flying off of them.  +The campaign will be the main thing you play as you are following a storyline and a neat little comic as you progress through the game. There are many difficulties you can choose from, like adding the difficulty for monsters to have more health or the difficulty to only have one life and or maybe all of them together. Which will give you more experience when playing, but makes it a lot harder to beat.  -The level up system is alright I can say. There's a max that's not terribly hard to reach as you unlock weapons, towers, or perks with every level. What makes it alright is that when you reach the max level, there's really no point in playing the harder difficulties for more xp, just for bragging rights. And survival on the other hand, also turns into just bragging rights, but you can get onto a scoreboard if you're smart enough.  +A little bit on the tower-defence part of the gameplay is that you place blocks to re-route the monster, you're basically creating a obstacle course for these monsters to run ( fly over, or destroy as certain things can do that). With the obstacles being the towers you place on the blocks. With a max of 10-15 towers on the level, and the ability to upgrade after every wave is done.  My main issue:   -One problem you might find is in surival. The campaign can be played with your character cleaning house and towers to back you up as you choose the perks that suit player strength and not tower. But when in survival, your character will never get strong enough to last forever, because there are no character upgrades. So you will have the first couple of waves actually doing something. But in the later stages, will find that towers are the only hope, as they can be upgraded (Over charged). So this once towerdefence+shooter, turns into a towerdefence+tickler, as you will take the most minuscule health off these lumes, like you're just tickling them.  -Soo... That leaves you with campaign mainly, which will keep you occupied, but is rather frustrating as it can be difficult to beat certain levels on the highest difficulty, even with your friends.   Conclusion:  +Still a very solid game if you are into shooters and have a knack for some strategic gameplay. It's definitely a very unique experience and would definitely recommend you give it a try for yourself.  PS: +The ingame chat is hilarious as there is a robot voice saying everything you and others type. Good luck raging to others, haha.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games where ratings don’t mater. if you’ve enjoyed tower defense games, and first person shooters you’ll enjoy this. There is a mixture of different towers, different guns, different characters, character specialties, and power mods. I love it. It gets challenging, and where there are enough people it gets beatable. There are even different difficulty’s, and mod difficulties like in halo.",
            "review_score": "1"
        },
        {
            "review_text": "Being able to jump into a perfectly stategised tower arrangement is amazing along with the arsenal of weapons and perks that are both gamechangingly overpowered.",
            "review_score": "1"
        },
        {
            "review_text": "There are few games that manage to accomplish more than just mindless shooting at spawning enemies, but Sanctum 2 offers an immense strategic depth to its gameplay. Playing on a higher difficulty with friends will truly illuminate how well executed this game is, and trying to beat levels on their hardest setting provides a stress inducing and heartpounding experience that will surely give this game great replay value. The best thing Sanctum 2 brings to the shooting genre, and it is something the game does abosolutely right, is the infusion of a tower defense style gameplay. You can craft defensive mazes in levels that force enemies into a route of certain death. The feeling of a perfectly executed strategic victory in this game will give the gamer a reason to actually use their brains in obtaining victory. Beating a level without firing a single bullet is what you should try and challenge yourself to do in Sanctum 2. Perks and different characters also add to the games already great depth.  I love playing through Sanctum 2! It is a great game to play cooperatively with friends, simultaneously providing the gamer with an experience that you will not find in any other shooter. I only wish that the game allowed you to improve gun statistics as you leveled up your actual character, but this is a minor complaint. Get Sanctum 2! It's a no brainer! 9.0/10",
            "review_score": "1"
        },
        {
            "review_text": "I, unlike my friends, was a pretty big fan of the first game. It was a fun mix of FPS and tower defense. i'm happy to see they took the first game and improved upon it.",
            "review_score": "1"
        },
        {
            "review_text": "Tis a good game, great with freinds, and has the moonbase alpha text to speach chat. What more can I say?",
            "review_score": "1"
        },
        {
            "review_text": "A first person tower defense describs this game, but it is more than that, you can play with friends or others while relying on each other. Example, another player can build the best turret in the game but does not have the resources, you can share with him to help.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVED Sanctum (the first one) I was really REALLY looking forward to the second one. It is fun, and I think it added SOME cool new features, but, I have to say I am disappointed in some major ways, and I'd like to elaborate on them. So let me explain how and why Sanctum 1 is better than Sanctum 2.  In Sanctum one you could spend your resources on building blocks, to put towers on, except in this case I'm specifically talking about using them to shape your enemies path, made it the longest, most efficient path. In Sanctum 2, you and your teammates get a certain amount of blocks, and sometimes one person gets more, or all of them. Sure you can transfer them to eachother, but only if your friends are willing. How does this negatively affect the game? I played the other day, looked at the map, planned out how I wanted to shape it, and spent the entire game, every wave, building blocks, and never getting enough to fully build the path I wanted to. In the first game, that never happened.   Sanctum 2 is also, IMO, dumbed down and made more noob friendly.   In Sanctum 1, you could upgrade your towers AND your gun with your resource points. This made choices more complex, especially with friends, deciding who would do what. In Sanctum 2, you CAN'T spend points on your weapons. You use perks instead for that. To me, the way they changed the perk/level up system, it plays less like an FPS/TD, and more like a TD/RPG, and not in a good way.  In Sanctum one, if you build something and didn't like it, didn't like the placement, wished you had some something else, or wish you had upgraded something else, it's too bad. Live and learn. If you wanted to take it down, you'd get SOME resources back, but not all. In Sanctum 2, you can build something, upgrade it, and then take it down later and get a full refund of your resources. This just makes the game noob friendly, and less challenging. You know those RPG's where you can't change your stats, so if you want that really badass class, you have to work at it? And then there's the ones where you use the easiest stats to level up, then when you're max level, go change your stats again? Doesn't that kind of take away all the fun and challenge, and prestige of having that class? Well, now you can enjoy that noob strategy in the noobed down sequel to a much better game.  OK, now, having ranted all that, I will still say Sanctum 2 is a good/fun game, but having played the first game, I know what's missing. If Sanctum 2 was actually the first game I'd say 'wow, this game is really fun/awesome, I love it!' Then if Sanctum 1 came out next I would say 'OMG I can't believe how much better this game is! They took everything bad about the other one and removed it/made everything better.'",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Needs a trilogy.  Should be able to swim in water. Should not die when entering it. Ruins the vibe.   By the way, the artwork is beautiful - as well as the music. However, I wish the music reflected the already trancy raver aesthetic of the characters.  Regardless, this is a great game for both FPS and TDS lovers and enthusiasts.   text-to-speech is awesome. needs in game text saves.",
            "review_score": "1"
        },
        {
            "review_text": "Awe he looks so cuddly, gimme a hug fella! AAAAAAAHHHHHHH OH GOD! HE'S CHEWING OUT MY EYES!!!!!!!!!! GET HIM OFF ME!!!!! GET HIM OOOOOOOOOFFFFFFFF MMMKMMMMMMMMMMEEEEEEEEEE!!!!!!!!!!!!!!!!!!!!! WWWWWWHHHHHHYYYYY?!?!?!?! OH GOD WHY?!?!?!  10/10 Would go blind again",
            "review_score": "1"
        },
        {
            "review_text": "Guns. Towers. Weird looking aliens. Explosions. Funtimes",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes when i dont have internet i like too play this game, but its also fun to play with other players, 100% worth to buy on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed it the little time I played :)",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics, music, and co-op play.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a fun mix of 2 genres of games, put together very well. It also uses the full potential of the Unreal engine, and I hope for a third one. It wouldn't need any new characters just maps, and if they wanted graphics. 78/100 Graphics 80/100 Sound 95/100 Fun 70/100 Replay Value 95/100 Customization Not too easy not too difficult fun mix of Tower defence and FPS! (funny story I bought Orcs must Die 2 because I couldn;t remember this games name, its also a very good game, and if you enjoy this, maybe look at it for another tkae on these 2 styles of game mixed together!",
            "review_score": "1"
        },
        {
            "review_text": "This is an oddity but a singular pleasure in tower defense multiplayer gaming. You're not going to find this experience anywhere else, and it really is worth every minute, but its greatest success is the multiplayer element. Unfortunately difficulty balance and graphics seem inconsistent, but nothing a good team and efficient tower placement can't solve.  While you're enjoying the main game content, consider the DLC, especially if you're hankering for more of the same as each DLC includes unique new towers to be used at any time. Perhaps a Santum 3 could bring out the best elements of this title.",
            "review_score": "1"
        },
        {
            "review_text": "is it playable? I think yes! is it good? yes! is it AMAZING? YES! is it enough of a challange? YES! are you still listening? NO! I mean YES!  Do you recomend this game? YES! YES! YES!",
            "review_score": "1"
        },
        {
            "review_text": "It's worth more than 4 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "Good Hybrid game it is blanced for both shooters And tower defence players both having rewards for both",
            "review_score": "1"
        },
        {
            "review_text": "A fun take on the usual tower defense genre. You have an actual impact on the battle besides just building turrets",
            "review_score": "1"
        },
        {
            "review_text": "i love the game but think it needs a tdm mode (team death match)  otherwise, its an epic game",
            "review_score": "1"
        },
        {
            "review_text": "It is one of two games really. One, It is a first person shooter with an actual strategy element outside of go here and shoot this, and then go over some other place and shoot this other thing. Or two! It is a tower defence game that allows you to have a MOVING TURRET at the start ( to spell it out, the player) plus I find myself not looking at other things while the rounds run after I have all my turrets built.  In short, It is either a shooter with the first signs of real strategy or it is a tower defence game that is actually interesting all the time.  It does have its faults, but overall I think it is worth both your time and attention, and possibly your money.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the most enjoyable game I have played in a long, long time. Definitely worth the money, and, in my opinion, better than the first. Buy the complete pack because I need someone to play the DLCs with.",
            "review_score": "1"
        },
        {
            "review_text": "would i reccomend this game, you say?! why yes i would its frantic and strategic all at the same time! so if you like a mix of fps and tower defense, look no further than this? why yes i belive i do mean this! :P",
            "review_score": "1"
        },
        {
            "review_text": "its a ok game but you only get to place 15 towers max which can get annoying and also the resources are abit hard since you can only get to build 1 or 2 towers per wave. if there was a way to increase tower cap and more resources this game would be worth it.",
            "review_score": "1"
        },
        {
            "review_text": "The best alien FPS, tower defense game I've ever played! It's so cool!",
            "review_score": "1"
        },
        {
            "review_text": "This is quite a fun game. It's a good combination of strategic planning and frantic shooting and jumping. At lower levels, when not many towers are unlocked, the game relies most heavily on the shooter, and the towers don't seem very effective. Still, it feels good to shoot down a whole wave of enemies who are charging at your core.",
            "review_score": "1"
        },
        {
            "review_text": "I purchased this game when it was a part of a humble bundle, but if I knew it was this fun, I would have gladly dropped ~$15 on this game. Sanctum 2 is definitely one of the better developed tower defense games. They managed to mix tower defense and FPS perfectly. There are plenty of maps with crazy layouts, plenty of enemies and bosses, and great multiplayer. 8/10, recommend.",
            "review_score": "1"
        },
        {
            "review_text": "awesom you should buy it so worth it ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, really addictive, already played it in xbox 360, moved to steam because of the DLC's.",
            "review_score": "1"
        },
        {
            "review_text": "Fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "Good times had for all.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game that mixes classic tower defence with first person shooter and RPG elements. Not every gun feels as good and the game is more enjoyable when you're playing with friends - but overall it's a great great game.",
            "review_score": "1"
        },
        {
            "review_text": "Unique experience blending the best parts of tower defense and coop fps. If you're looking for a game to play with 3 of your friends, this one is well worth the price",
            "review_score": "1"
        },
        {
            "review_text": "very fun with friends ",
            "review_score": "1"
        },
        {
            "review_text": "It's much like the first, but you've got fewer weapons and slots for towers, so it's much more tactical; but it stays true to the spirit and is very worth the cash for it!  Plays well on a not-top-of-the-line laptop while still looking good.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the best tower defense fps multiplayer game :D But the thing is .-. you do want to be sure you don't partner up with the morons who don't even know how to make a maze xD ... and it's a game where you don't have to stress out too much xD because there are other players in here too that are willing to help :3 the graphics are insane tho :o it's like.. holy ♥♥♥♥ this is beautiful ... so get the game and have fun with it when you still can :D ( and when there are a lot more players )",
            "review_score": "1"
        },
        {
            "review_text": "Awesome TOWER DEFENSE-FPS Shooting game.  Basically a building phase then a shooting phase.  And if you can't shoot well, let your towers do the job.  Path and maze, hide and seek, shoot and run.  Great weekend game.",
            "review_score": "1"
        },
        {
            "review_text": "Its like the entire tower defence genre had a baby with starship troopers then grew up and decided to hack into borderlands and steal their multiplayer system!!",
            "review_score": "1"
        },
        {
            "review_text": "Its fun for pass-time",
            "review_score": "1"
        },
        {
            "review_text": "This is very cool game, you can play with friedns &amp; randoms. There is too many maps and this is cool, too. Lots of guns and good turrets,power up's . The graphics are very,very cool and this is one of the best TowerDefence games :) .",
            "review_score": "1"
        },
        {
            "review_text": "the best game",
            "review_score": "1"
        },
        {
            "review_text": "SO FUN YOU NEED TO GET IT",
            "review_score": "1"
        },
        {
            "review_text": "nice, FPS tower defense games",
            "review_score": "1"
        },
        {
            "review_text": "just awsome pure BADASS   pros  the ability to make a path for your enemy  no in game money everything is unlock by leveling up  the ability to share resources  cons  the ability to destroy your friends turret and stuff(have fun with teamates who dont know english or trolls)",
            "review_score": "1"
        },
        {
            "review_text": "game is great and adds the complexity that the first did not. sweet new features and you get more then on character. stongly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome and fun although a bit glichy",
            "review_score": "1"
        },
        {
            "review_text": "Good game, better than the first one in my opinion.  Is it just me or do the characters remind anyone of Timespiltters 2?   ",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "sooner or later people who cant afford the game will start to say 'Hey, can you make this gane Free 2 Play?' or people will watch other people wanting this game badly....",
            "review_score": "1"
        },
        {
            "review_text": "Combining tower defense strategy and fps action is just amazing. Just a shame that the number of weapons and perks is quite limited but still a very good game.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a Fantastic Blend of FPS and Tower defense. It can be very challenging and fun in any strategic way imaginable. No matter the level, it can always be beaten in a different way or with different setups. Lots of replayability and fun with friends. Not to mention a hilarious Text -to- Speach AI included as well. Love the game.",
            "review_score": "1"
        },
        {
            "review_text": "FUN co-op only game, about surviving waves upon waves of monsters, with a compelling and fun storyline, with fun characters! It's a Tower-Defense with FPS, and if they ever make a third game for this, I would be more than happy to buy it.",
            "review_score": "1"
        },
        {
            "review_text": "IF you want a first person shooter and a tower defence game this is your game it is amzaing and it really fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "TowerDefense and Shooter in ONE Game? - Unbelievable !!!!",
            "review_score": "1"
        },
        {
            "review_text": "This was a nice game better then sanctum 1.Sanctum 2 have 3D animation,becautiful,storyline.And its fun.I strongly suggest you guy buy it.Make sure you buy it with DLC.",
            "review_score": "1"
        },
        {
            "review_text": "The game is a very fun defence fps never played anything like it, and had a good lasting effect. ",
            "review_score": "1"
        },
        {
            "review_text": "Just a good game, recommend",
            "review_score": "1"
        },
        {
            "review_text": "FPS + Tower D, played the first few levels solo, would love to try 4 player co-op.",
            "review_score": "1"
        },
        {
            "review_text": "i got the achievements",
            "review_score": "1"
        },
        {
            "review_text": "A decent enough tower defense game with some average FPS mechanics. Nice graphics, solid design. Didn't feel particularly engaged while playing it - Orcs Must Die 2 was a lot better, more frantic and had a smile on my face.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a Tower Defense game but I can shoot things with guns which is rad",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. If you are into the FPS type of games then try this out!",
            "review_score": "1"
        },
        {
            "review_text": "This game....its so addicting.  In case you don't know what sanctum is..... You are a team of four people that defend cores from......stuff And you can build wall and TOWERS.  Basically its Halo but Tower Defence (still FPS, don't think it isn't)  Just play it, its only 9999999 bucks! (jk it's $14.99) You WILL like it. (unless you don't like shooting things)  trust me",
            "review_score": "1"
        },
        {
            "review_text": "the- Best 3D tower defense game with first person shooter feature. Love it",
            "review_score": "1"
        },
        {
            "review_text": "Super awesome game! The concept is both super original and extremely well executed. The environments and story are also top notch. What's nice about this game is that you don't need to be good at both tower defence and FPS. Being good a tone will get you through... until the maps get so hard you need friends to play with!",
            "review_score": "1"
        },
        {
            "review_text": "Great meld of FPS and Tower Deffense.",
            "review_score": "1"
        },
        {
            "review_text": "You like aliens? you like Big a$$ gun? well this is a game for you!!!  You like huges robotic arms? you like tower defence? well this is a game for you!!!  you like getting squashed by a tower base and dont die with just 1 health??  WELLL THIS IS A GAME FOR YOU!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's meh. Dunno why, its actually fun to play, looks great and has sweet music.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game with Really good concept. I love this game. Would by on Sale.  10/10   Buy Now",
            "review_score": "1"
        },
        {
            "review_text": "build some laser turrets and then shoot rockets at aliens, what more do you want?",
            "review_score": "1"
        },
        {
            "review_text": "This game is exactly what it say's. If I could buy this game again for the first time I would do so one hundred times. Especially on sale!",
            "review_score": "1"
        },
        {
            "review_text": "Hours of amazing fun. FPS + TD = Amazing fun for up to 4 players.",
            "review_score": "1"
        },
        {
            "review_text": "First of all , TD fans have played bloons td , Gemcraft , Kingdom rush and many other tower defence games. i played Counter strike alot , and then i tried this game .What am i playing ? well if you like FPS games and Tower defence games , then this is a fun game to play... Reasons : Many towers to pick , many perks to pick , and you can have 2 guns to carry , and there are 4 charecters to play (they all have a special skill) . This game gives you many choices. You can have dmg booster and a slowgo(towers that dont give dmg , but help other towers). The build of the game itself: the Graphics are good, you can give others resources , and make them build , but there is maybe one thing that is a problem , you cant build as many towers as you want. Limits are 15 i think in all of the maps . But i can understand that in one way ,the game would be to simple. You can also have Feild of strength , wich is 5 missions or boosters for the creeps , that is always a 20% of a different challenge . You can take campaign and Survival and 2 more modes . This game gives you many choices. if you just like td games , then i recommend you to buy Kingdom rush,Sol survivor,Defence Grid: The Awkening or Anomaly Warzone earth. ill give this game 83/100",
            "review_score": "1"
        },
        {
            "review_text": "This game is really worth it. The core gameplay is stunningly fun and challenging. Coffee Stain Studios are MASTERS in creating futuristic games and the weapons in this games are all so unique, different and amazing and they're probably the thing I enjoy the most. You can add layers of difficulty to spice it up, play with friends or solo and there are gamemodes like sandbox and others.   The map design is truly enchanting. The skybox is beautiful. The whole feeling of the world is greatly immersive and feels alive. Maps can vary from spore infected labs to forests and bogs, bizarre caves and even mountains.  The characters all have distinct personalities and fighting styles and all look badass. The enemies are also very abundant in type and species.   II think the universe of Sanctum 2 (Loek III in particular) stand to be the setting of a great open-world mmo/rpg game. I strongly recommend buying this game and if you ever need help, I'm always happy to help a fellow Core Guardian. Welcome to the team.",
            "review_score": "1"
        },
        {
            "review_text": "Love strategy games + FPS? So this is must have game!",
            "review_score": "1"
        },
        {
            "review_text": "just yes, every thing is yes about this game.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a surprisingly well made TD/FPS hybrid and surprisingly fun to play. In Sanctum2 you are to prevent alien forces from reaching your 'Core' by steering them into long maze-like roads filled with towers and keeping them under constant fire from your own weapons.  It is a TD game so towers are essential for your sucess, but its also a FPS so, as mush as u depend on your towers, they depend on you and your weapons/perks, so both aspects of this game are very important, from tactical planing to sharpshooting. Speaking of towers, weapons and perks, there is quite the selection to choose from and you can pretty much build any type of character that suits your play style. In addition, every towers behaviour can be programmed manually to shoot exactly what you want him to, giving you much more controll over the course of action.  Enemies in this game are well thought, well designed and they come in all kinds of different shapes and sizes, and will require you to use all of your arsenal. You will be fighting anything from small, foot sized rat like monsters that will just charge you and explode, to a hard and heavy, tank sized armored bugs that wont even bother with you and will head straight for your core soaking up all the tower damage and providing cover for the rest of the enemies.  Levels are pretty much like enemies. They vary a lot, so anything from a small sqare to a huge maze like levels with many paths, alien spawns and even multiple Cores will happen. These levels are reall well made and even the smallest of them dont hold your hand and tell you how or where to build your defenses, tho, some levels will have quite a lot of unbuildable terrain(note the blue outline in fist screenshot, everything outside it is unbuildable terrain) but will still provide you with countless options and superb replayability. Also, i wanna point out that these levels are visually appealig and very beautifull, and that they often have many cool things you can find and discover within them if you feel like it.  Progression system is fun and the game will reward you based on your action, so, for example, staying alive for the whole wave will earn you some extra XP which will give you access to more towers, weapons and perks. Eventually, when you feel strong enough, you can start playing with 'Feats of Strength' which will make enemies either stronger, faster, more durable, regenerate their lost HP, make death permanent, refund you less when selling your towers, or all of the above at the same time. These make the game super challenging, much more replayable and incomparably more fun, they will count towards your overall completion and will reward you with +20% to total XP count, per feat enabled, when you finish the level, if you can finish it that is :)  Last thing i wanna go over is the multiplayer. First off, i just wanna say that i never played this game solo and that i think that any game that has a co-op campaing option should probably never be played solo in the first place and i higly recommend playing this in co-op and co-op only! So the multiplayer is awesome! You can bring up to 3 friends to play with you, each with their own towers, weapons and perks, and with the good character customization that this game has, none of you have to be even similar to each other. Also note that for every friend that you play with, aliens will be tougher, and im not rly sure how the equation goes, i never gave it a thought to be honest, but it all seems to be balanced and challenging no matter how many of you are playing together. You all have your own resources to build with and each player is awarded its own resources after a wave is finished but you can also choose to share them between yourselves without any penalty as much as u like. Speaking of MP, and playing with friends, i have to mention the one and only flaw i encountered while playing this game and that would be communication. As much as an optional text-to-speech bot is giving its best to pronounce the words you type in, this game is just too fast paced to type during a defense and you should by all means stick to voice chat. However, in-game voice chat is really bad, it cuts off and lags quite a bit even when there is no lag at all. Fortunately enough for all of you who dont speak much, there is a 'ping' option that lets u summon a beacon of light to a targeted location that is sure to get other players attention for you in a heat of battle. So, if you wanna have a good team play, use Skype, Steam Voice Call, Teamspeak or whatever you prefer, just dont rely on in-game voice chat.  With all above being said, i rly have no reason not to like this game, and not to recommend it to all of you TD and even FPS lovers. Dont be fooled by this games frequent huge discounts, Sanctum2 is a blast and for what it offers, well worth even at the full price. So if you like TD games even a little, you will love Sanctum2; if you like FPS games, theres plenty of that in here too, and if you suck at base building you can always let your friends build for you :P  Honestly, since the one and only flaw i can think of(and trust me, i thought a lot!) is that easy to workaround, and there so many good sides of this game, 10/10   Edit: My opinion on the game hasn't really changed even though my writing did significantly. The only reason I'm editing this review is because of the Steam's 2016 Autumn sale tasks ;) ",
            "review_score": "1"
        },
        {
            "review_text": "Good game.Great 4 indie title. A unique blend of tower defense &amp; FPS with Co-op mode. Good value if you buy whilst in the sale.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game very much... No glitches, so far. I have never been a huge Tower Defence player, but I like the concept and I like this FPS type much more then the rts stategy type for some reason. Reminds me of an old dream\\cast fps called Outtrigger which is in my opinion one of the best games ever... Definetly worth the money.,, More people = More fun... hope t see you out there. -Desperado",
            "review_score": "1"
        },
        {
            "review_text": "one og th best indie games i have played in a very long time! Spend most of my steam hours on this game  +1",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING GAME. The concept is great. What was good about Sanctum 1 is made even better by Sanctum 2. Graphics, Monsters, feels more like an FPS and still has the tower elements. I can't say enough good things about this. Easily a $40 game.",
            "review_score": "1"
        },
        {
            "review_text": "this is a suitable gam for those people who likes to level up their stuff every round. The game is a bit repetitive (well obviously it is a tower-defense game) but it also gets challenging every single time. the good thing about this is that it's basically what you expect it to be and also it's an FPS game which most people like. 7/10 would recommend :)",
            "review_score": "1"
        },
        {
            "review_text": "The combination of FPS, tower defense, and leveling up is super addictive!",
            "review_score": "1"
        },
        {
            "review_text": "It's good! Very, very, very good! All that was great from Sanctum 1 is still here, and some new great stuff was added. Hats down to a brilliant sequal. I can see many hours of enjoyment ahead.",
            "review_score": "1"
        },
        {
            "review_text": "OH MY GOSH I've only played 1 hour of this and i just cant get enough, it is probably on of the best games i have ever played   8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Slick, solid and sexy- this game delivers solid action (especially in coop) with a sci-fi/anime style. Totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "build towers but watch out for the patriarch!!",
            "review_score": "1"
        },
        {
            "review_text": "cool game if u have some friends to play with :D",
            "review_score": "1"
        },
        {
            "review_text": "this game is absoulutly amazeing and it has multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome 4 player coop, tons of strategy required. Great game with friends, though not so much alone...  I will play this whenever anyone wants. I might even have a copy or three to gift if you ask politely!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, great looks, great gameplay, just great all around. If you like TD's and Fps then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing TD game. Involves the role of your towers defending the core, but also you can participate in the fight too. Controlling 1 of 4 (or 5 if you have Road to Elyson DLC) you can use their special talents to build the best defence to fight the Loom threat and finish your mission. It is quite an amazing TD FPS clash.",
            "review_score": "1"
        },
        {
            "review_text": "I am usually not a fan of Tower Defense genre games, but this one has changed it for me. The controls aren't what I'm used to in FPS's but I can manage. The building system is easy and fun plus the characters this game has to offer are amazing! Try it!",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you like tower defense type games and first person shooters.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good game. If you like shooters and tower defense, it is awesome. Even though some levels are hard, playing with a friend would help if you can't do a mission. Playing this online is still fine, but is better with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a good strategy defense game and still has players playing for long,0 but I do not get is that 'The End' is a continous spawn.",
            "review_score": "1"
        },
        {
            "review_text": "Great first person shooter with elements of tower defense.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is really fun! it has an interesting style of gameplay, alot like dungeon defenders but its still worth the cost!",
            "review_score": "1"
        },
        {
            "review_text": "Dose not compasint for sigle player, but very fun with mates",
            "review_score": "1"
        },
        {
            "review_text": "Great Price, Great story, Graphically Pleasing, Lots of DLC which makes the replay value so much higher and an absolute blast to play with friends and alone.   This game gets a 10/10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "This game is BEAUTIFULLY made. The characters all provide new gameplay opportunities, and while it is single player capable, it's designed for multiplayer co-op and it shines when you manage to pull teammates in for a game. The matchmaking is simple and reliable, with little lag issues, and the overall interface is intuitive and simple, keeping you from having difficulties but also providing you plenty of options with the ability to match out your arsenal, perks, and towers, swapping money, designing mazes, and killing creeps. The variety of enemy types and level designs lead to various challenges, but you inevitably learn to adapt and overcome them, reaching a fun level of challenge without being overwhelmed as some tower defense games seem to cause. All in all, a definite recommendation, especially if you have friends who are interested.",
            "review_score": "1"
        },
        {
            "review_text": "beautiful game, great mechanics, very balanced, 10/10 for me",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, that challenges your thinking. Also funs with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Highly addictive, and relaxing first person shooter.",
            "review_score": "1"
        },
        {
            "review_text": "[6.5/10]  A combination FPS and tower defense, it confuses me very much. You really need teammates to do well, so I suggest getting some friends to enjoy it with you. All in all, plays pretty smoothly and is enjoyable-ish.",
            "review_score": "1"
        },
        {
            "review_text": "This a very good game except for when someone pauses the whole game. Instead that person could go into spectator mode. Also add a fullscreen option, and sometimes when i'm playing this on my Mac, it glitches out, so please fix it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fantastic take between a FPS and a Tower Defense, there's lots of perks, towers, and guns to choose from, plenty of levels, and ways to vary the difficulties. I can't imagine a company mixing these 2 game styles together any better then what was done for this. The only thing I'd like to see is more levels, and if possible the ability to customize guns, but that's just coming from someone spoiled in so many other games. Either way, fantastic game, a definite must buy.",
            "review_score": "1"
        },
        {
            "review_text": "good fun game but does get boring if you play this own your own or with strangers, the level up system is a good idea but, for me atleast, seems a little tacked on. other than that they made a lot of improvements since the first game to make it smoother to play, servers were vastly improved since the first one(virtually unplayable in multiplayer before). at the end of the day though, hats off to the guys at coffee stain studios, they have a good game here.",
            "review_score": "1"
        },
        {
            "review_text": "Towerdefense and FPS, who can go wrong?",
            "review_score": "1"
        },
        {
            "review_text": "This game is the ♥♥♥♥, yo.",
            "review_score": "1"
        },
        {
            "review_text": "No other game like it, one of the best co-op experiences ive ever had. If you want a new, fun way to experience Shooters, by all means play this game.",
            "review_score": "1"
        },
        {
            "review_text": "You won't regret getting this game. Get it with friends though cause it's not as fun by yourself. Definitely a top notch game.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously good fun, get it now if you like tower defence style games (including Orcs Must Die! 1&amp;2 which are very similar to this game)",
            "review_score": "1"
        },
        {
            "review_text": "Very fun to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "AMAZING one of the best games I've ever played ",
            "review_score": "1"
        },
        {
            "review_text": "Awsome and amazing game, best played with co-op and need people to cooperate to even thinking of winning. So much great stuff that is added in this game like the story, gameplay, and it mechanics. I would recommend to everyone who buying the game, buy it with all the DLC to see the true potential of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best tower defence game i have ever played since 1999.  Need more games like this. something that is actually fun, not just a brainwash",
            "review_score": "1"
        },
        {
            "review_text": "Good game to play with your friends, so i recomend if you have at least two more friend to play with you buy it, however if you don't have, it's funny play alone with randon people",
            "review_score": "1"
        },
        {
            "review_text": "pretty good game, you should get it ",
            "review_score": "1"
        },
        {
            "review_text": "lightuing the wepon the gatling the lighting cannon is the best thing ever ",
            "review_score": "1"
        },
        {
            "review_text": "Best Tower Defense game ever played! Overall 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a mashup of two of my favorite genres, and it does it exceedingly well. The graphics are about what you expect from the unreal engine (that is to say: quite attractive), and the pre-level loading/cutscenes are nice in their comic book style. The shooting elements are nice, with infinite ammo (it IS the future, you know) and convenient reloads that continue whether or not the reloading weapon is drawn. The tower types are numerous enough, and add another layer of strategy. The biggest part of the strategy is using the base wall pieces to construct the path YOU want the enemies to take. You will want to think a good bit about where you place them.  I absolutely love the concept, and the execution is nigh-flawless. Strong recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "I personally really enjoy the way they have created a first person exprience of a tower defence which allow hours of enjoyable gaming.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing :D :D :D deffinatley one of my favorites.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good game. If you like shooters and tower defense, it is awesome. Even though some levels are hard, playing with a friend would help if you can't do a mission. Playing this online is still fine, but is better with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Great tower defence game, reccomend to play with atleast 1 friend at a time.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, though my only complaint is that it doesn't have a steady rise in difficulty; One level will be nearly impossible to beat, while the one after it is a a cakewalk.",
            "review_score": "1"
        },
        {
            "review_text": "I have gotten this game for free. Don't know how, or why, but when I downloaded for free in the free demo, I got the whole thing for free. Not complaining, just saying wait for another free weekend until you buy:)",
            "review_score": "1"
        },
        {
            "review_text": "I know at least half of my friends would love this game, yet I don't think any of you are playing it. So damn good, and no one for me to enjoy it with.  Get on it! Tower Defense FPSRTS super-hybrid of pure frickin' co-op awsomeness.  Seriously.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "prety awsome, but very small community, theres like 10 ppl playng",
            "review_score": "1"
        },
        {
            "review_text": "Overall it is a good game, and is difficult at times. The level layout is simple, the tower defense itself is alright, and the customization you acquire throughout the game keeps you coming back for the next perk, tower, or weapon. The DLC that they have released has been worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Alien ? hoho i block you with my gun",
            "review_score": "1"
        },
        {
            "review_text": "I PLAYED IT ON A FREE WEEKAND AND IT WAS ALLRIGHT BUT I STILL RECOMEND IT (BTW I REALIZE THAT CAPSLOCK IS ON.)",
            "review_score": "1"
        },
        {
            "review_text": "just awsome pure BADASS   pros  the ability to make a path for your enemy  no in game money everything is unlock by leveling up  the ability to share resources  cons  the ability to destroy your friends turret and stuff(have fun with teamates who dont know english or trolls)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Funny controls, though.",
            "review_score": "1"
        },
        {
            "review_text": "lots of fun you should get :DDDDDD",
            "review_score": "1"
        },
        {
            "review_text": "What a blast, literally! Sanctum 2 balances the tower defense and FPS elements quite well, and never removes you from the first person view (aside from that whole respawn delay thing if you manage to die). Support towers allow you to pick up and place generated items (like slow fields and mines) even where towers wouldn't be allowed. Up to 4 players in a cooperative match also adds to the experience, and the difficulty scales (or at least it seems to). If the game is too easy, or if you're looking for more end-game experience, you get credit for each 'Feat of Strength' earned by completing a level with the option turned on; the Feats are 5 options for increasing the game difficulty, and can be used in any combination.",
            "review_score": "1"
        },
        {
            "review_text": "Great terain strategy/tower mixed with fast pased FPS",
            "review_score": "1"
        },
        {
            "review_text": "if it's free why not let it be free????",
            "review_score": "1"
        },
        {
            "review_text": "Great Toewr Defense game. Very fun to play with other players. Only downside of this game is that DLCs make the game easier. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, you can play as a robot which has a derpy simle ahah, but another thing about this game is that is kind of a puzzule games so you can injoy it with you friends ",
            "review_score": "1"
        },
        {
            "review_text": "This game like so leet. You be trippin not to buy. Sucks that you missed the 85% off deal though. $3.79 my dawgs. Shame, for shame. Get the game game game. Lame. Not the game, but the shame, is... lame.  Weeeeeellll, then... Yeah, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay is great, the enemy is different. I have not gotten bored of killing them yet. The graphics is not the best but then again it is on a unreal engine which old but it still looks pretty good. The graphics is about the same as Half Life 2 but a bit better with max all settings. There is a lot of customizing once you level up a bit. You can get new guns and turrents, perks. It is not hard to level up even if you are playing alone. Better to play with people than yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Good game to play with your friends in co-op. The mix between tower defense and fps is very great. If you want to then you can play matches with other people online, but chat isnt that well made (very small), minimap isnt that good either (hard to find teammate in it). You get knockback from friendly fire, so if you got troll in team he can shoot you around all the map and you cant do a single thing.  You unclock various perks in the game so you can change your tactics time to time. Of course you unlock all kind of towers to which help you finish maps.",
            "review_score": "1"
        },
        {
            "review_text": "Great concept, nice gameplay, terrible replay value. It's a strain to finish the game..",
            "review_score": "1"
        },
        {
            "review_text": "fun and cheap",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game!",
            "review_score": "1"
        },
        {
            "review_text": "First off, I NEED to mention this game's ingenius inclusion of the text-to-speech system. Any game, no matter how poor, is instantly made fun for a good ten minutes by text-to-speech chatting with friends.  That aside, the game combines tower defense with FPS quite well. While there are some odd quirks (a personal annoyance I have is a slider with only two settings - I mean, why a slider?), the game is totally worth it in the end.",
            "review_score": "1"
        },
        {
            "review_text": "Fun first person shooter tower defense game.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game when I got it as a gift from a friend, it's not as fun playing alone. but playing with others? It's so much fun. I love it. Would recommend it to anyone that plays it with their friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic! Best indie game I've ever played! Only issue is not many people have it so not as much multiplayer.  Gameplay- 10/10 Graphics- 9/10 Characters/Story- 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Very Interesting take on Tower Defence. Works well. Recommended. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Its a good strats game with the DLCs is awesoem and a fun game to test stuff in. Friends and I play with it a lot its a good team bilding game and requires a lot of team work. If not with friends still its awesome sandbox is fun to. xD ",
            "review_score": "1"
        },
        {
            "review_text": "awsome! love it! best tower defence/ fps ever!",
            "review_score": "1"
        },
        {
            "review_text": "EXTREMELY entertaining game. After looking at Sanctum 2 for some time before purchasing it, I finally decided to give it a chance. I was suprised to find how simply perfect this game turned out to be. The elegent combination of Tower Defence and FPS is very simplistic in its nature, yet is executed in such a way that draws you in and just absorbes you completely. Adding a friend or two to the mix adds even more enjoyment to the experience. The only regret I have about this game is not picking it up much sooner.  I stongly recommend Sanctum 2 - You will not be sorry.",
            "review_score": "1"
        },
        {
            "review_text": "Good, fun game. Easy to understand. Leveling is quite fast. However one thing to take note would be that one should not play alone. Although there is scaling when there are more players, I personally find it harder alone. First person shooter/ Tower defence, what more can you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "Well, this is my favorite tower defense game with sci-fi style.",
            "review_score": "1"
        },
        {
            "review_text": "This is game soooo worth it! You should get it, as it is the sequel to the World's First Tower Defense/FPS game!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game to play and own i loved the first one but this one has so much more things like online gaming better graphics i would deff buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "if you love tower defends, this is for you and be careful you wont stop playing after trying it",
            "review_score": "1"
        },
        {
            "review_text": "A great hybrid of FPS and tower defense. Enjoyable playing solo but even more fun in co-op, of course. Each player is limited to 4 choosable towers at a time, so when adding players you can increase the possible build-out to 8, 12, or 16. The dificulty scales as well when playing co-op so it adds to the challenge.",
            "review_score": "1"
        },
        {
            "review_text": "GreaT!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, excelent TD game, Epic graphics with Best unreal engine,wonderful design. Could be best-known and have more game mods, but still a great game!! my note 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game to play, especially with friends. I highly recommend telling your friends about this game if you buy it and have fun with it. Adding new characters, weapons and a perk system, Sanctum 2 improves upon all the great aspects of the original game. The DLC to this game is absolutely fantastic and is reasonably priced. Not to mention the superb gameplay. Balanced and diverse enemies, unique weapons, tight controls, and a beautiful world to play in give great aspects to this fantastic FPS and Tower Defense blend.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike it's predecessor Sanctum 2 is a fantastic TD / FPS hybrid that takes the great concepts of the original and irons out all the problems, with a lot of polish and an appealing art style, possibly a bit pricy at regular price but well worth it if on sale.",
            "review_score": "1"
        },
        {
            "review_text": "this game combinesthe skills of good tower defences and well placed towers along with first person shooting. team up with 3 of your friends and discover secrets in the maps linked to the story. truly endless fun with wave after wave action.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game very much espacialy the uniq way that it blends fps with tower defence",
            "review_score": "1"
        },
        {
            "review_text": "i recently downloaded this game and now its saying i have to re buy it?!?! its a ggod game but seriously Steam!?!",
            "review_score": "1"
        },
        {
            "review_text": "great game Wow!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game recieved I recieved through humble bundle sale. The DLC is well worth the purchase adding hours of new maps a a load of other content.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, it's a mix between a FPS and Tower defence. If you have friends and like tower defences, or just co-op gameplay this might be for you.  It's very similar in a way to Orcs Must Die! series, so if you liked them give this one a try!",
            "review_score": "1"
        },
        {
            "review_text": "I was pleasantly surprised uopn playing this game. To be quite honest I wasn't expecting a ton from it, but hours later I find myself still playing and still entertained. I would highly recommend this game to anyone who enjoys strategy alongside a typical, yet somehow refreshing FPS.",
            "review_score": "1"
        },
        {
            "review_text": "It is fun.",
            "review_score": "1"
        },
        {
            "review_text": "Solid tower-defence with FPS elements. It goes between the two rather well. However this is not for those looking for a straight tower-defence game. The player's DPS is required to pass through each wave, otherwise the tower's damage is not enough on their own.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum combines a tower defence with a FPS game to create a wonderfully crafted, enjoyable game. Apart from the Gameplay one of my favorite features is the stunning level design you can walk away from the core and explore sometimes find hidden mines and areas.",
            "review_score": "1"
        },
        {
            "review_text": "This game is underated, it combines the fast pace action of a fps with the stragety of a tower defence. The game blends these two together beautfuly, not only that but it ads the leveling of an MMO not so hard that you have to grind but so as you play you get better. From the boses to the type in voice chat (one of the best parts) or the stragety of this fps. Sanctum 2 is a very good game and deserves more fame. 8/10 amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "The idea of a fps tower defense game might seem weird to most and you might ask weather or not you should get the first one. To be honest the two can be played seperatly but i do recomend trying the first as well. However as far as good games go I highly recomend this one.",
            "review_score": "1"
        },
        {
            "review_text": "IT IS AWESOME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Better with a group of friends, or at least another buddy. Solo is great and the game is pretty. a basket of crumbled kleenexes / 10",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun, especially in co-op!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to play. Does not keep my interest for more than 40 minutes though.",
            "review_score": "1"
        },
        {
            "review_text": "if you love tower defends, this is for you and be careful you wont stop playing after trying it",
            "review_score": "1"
        },
        {
            "review_text": "I'd like to say this game is absolutely awesome. Mixing tower defense and fps style together is a brilliant idea.",
            "review_score": "1"
        },
        {
            "review_text": "so awesome i love it",
            "review_score": "1"
        },
        {
            "review_text": "i happened to find this game in free weekend when i was looking for a gmae similar to starcraft2 and warcraft3 i played nad after 4 hours bought it is so catchy and the balacne between FPS and TD is perfect is worth buying and also his expansions 9/10",
            "review_score": "1"
        },
        {
            "review_text": "it is fantastic, simple and the difficulty makes it intresting by always stepping up as the game goes on. while there are some errors, such as weird turret commands that dont function like i want them too, it doesnt take away from the fun and still leaves a very entertaining and worth while experience. This is a must play if you love tower based game experiences!",
            "review_score": "1"
        },
        {
            "review_text": "so far I really like this game over the original game adding some more balanced feel for the shooter aspects of the game and more range in stratagy by changing the targeting peramators or how you use the towers themselves.   for someone who doesn't lay alot of tower defnese but enjoys them. this game does scale to your skills with an easy mode or feats of strengths to add challenge. the maps are varied and themed as you progress. and the multiplayer does work well but you can play the game on yoru own and expect to beat it as well.   so check it out even if you didn't like the origninal that much.",
            "review_score": "1"
        },
        {
            "review_text": "Cheap and awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Must buy. Solid tower defence game wth fantastic FPS mechanics. 7 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "This game looks awsesome but im not sure if it is awesome because it always freezes when i try to start it,and when i mean freeze i mean not respond to when i press enter to start the game pls fix this problem. :(",
            "review_score": "1"
        },
        {
            "review_text": "First person tower defense. Nough said.",
            "review_score": "1"
        },
        {
            "review_text": "it's a good game if you like TD and actions games.",
            "review_score": "1"
        },
        {
            "review_text": "First Impression: A first-person shooter mixed with the great elements of tower defense at a stunning 1080p resolution. The images, gameplay and alien action is beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "this is great!",
            "review_score": "1"
        },
        {
            "review_text": "this is an awesome mix of fps and tower defence ",
            "review_score": "1"
        },
        {
            "review_text": "Fan-freaking-tastic game. FPS and TD blended together with just the right amount of broken-ness to keep you hooked. Easily my favorite budget friendly game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game that is almost always on sale",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is as good as orcs must die 2 (if you prefer modern styled games it is better, but if you prefer medival styed games orcs must die (2) is better)   the one thing better than orcs must die 2 is that sanctum 2 has 4 player co-op  a downside is that the upgradeablity of towers and weapons is more limited",
            "review_score": "1"
        },
        {
            "review_text": "No matter what the other people say this is brilliant, incredable graphics,you can shoose between 4 classes and hopefully theres a dlc coming out for more classes skye autumn is the best 10/10! Really spend your money on this!",
            "review_score": "1"
        },
        {
            "review_text": "Lot of fun, wish it worked on the mac but alot of fun nonetheless",
            "review_score": "1"
        },
        {
            "review_text": "Epic first person shooter tower defence! 5/5",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply Awesome, it's simple to use, you learn it quickly and it is Fun. This game is worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Fun co-op tower defense game. The game really shines when played with others.",
            "review_score": "1"
        },
        {
            "review_text": "This game is streat up badass its kicking ♥♥♥ for me!",
            "review_score": "1"
        },
        {
            "review_text": "great game awsome if you like tower defense i like how it add fps to it really fun",
            "review_score": "1"
        },
        {
            "review_text": "fun with friends ",
            "review_score": "1"
        },
        {
            "review_text": "great game!",
            "review_score": "1"
        },
        {
            "review_text": "Weapon upgrades are taken out in this game. Not cool!!",
            "review_score": "1"
        },
        {
            "review_text": "i am a professional   reviewer   please listen to my   opinion   this game is ♥♥♥♥ing   cooooool  ",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a tower defence fps. Being the second instilation of the Sanctum series the developers continued with the uniqueness of the series and added more twists and curves bringing in 4 now 5 characters with certain abilities to choose from, perks, and new weapons and towers, along with original weapons and towers in the first game.  In short, this game is a fantastic co-op game however, a con about the game is that it can't be played singleplayer. However for the sale price of 15 dollars its deffintly worth it with all the unique and brain twisting maps and fun gameplay. This is a brief and choppy summary to describe the key features of the game if you have any quuestions leave a comment below and I'll answer it for you until i rewrite this review after more extensive testing.",
            "review_score": "1"
        },
        {
            "review_text": "Better than the first one",
            "review_score": "1"
        },
        {
            "review_text": "FPS tower defence  what more can i say, it's brilliant and annoying",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, gameplay and graphics wise. It's fun solo but more fun with other players. The text to chat is so funny 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "very fun and adictive game",
            "review_score": "1"
        },
        {
            "review_text": "I went into this game with a pre-determined opinion about this game. Glad to see that I was wrong. This game is Mass Effect meets Plants vs. Zombies. One of the best games of the 'Tower Defense' genre. The graphics are a bit dated, but otherwise a very good game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. Wonderful combination of FPS and Tower Defense. All the enemies are quite varied, and you will have to use all of your shooter skills to defeat them. Each enemy has a weakspot in a different part of them, so if you can pick this out, you will be getting good damage on them. Multiple characters and a great level up system mean that you can always try new tactics. Game also has great multiplayer system, making it easy to find people to play with.  Highly Recommend!",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE IT! Well I got it almost for free, but hey It's still great game. I recommed it mainly to you people who love tower defense games, or well just strategy. I love it so much because it is First Person shooter game where you shoot things (well, duh!) and additionaly you have towers to help you out!   justbuyitalready♥♥♥♥♥♥♥it",
            "review_score": "1"
        },
        {
            "review_text": "The game that makes me rage.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The greatest ♥♥♥♥♥♥♥ mix of wave-based, tower defense, and first-person shooter you'll find. Absolutely phenomonal co-op game play, and considerably a must-buy game when the event of a sale occurs. Great for those tight-knit, group-of-four type gamers that enjoy a good LAN party with friends.  Campaign and storyline /could be better./ But hell, how much story do you expect to get out of a Tower Defense?  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun co-op, tower defence/first person shooter hybrid.",
            "review_score": "1"
        },
        {
            "review_text": "fun game made improvements to the first one some enemy will get you flying like they were playing golf with you",
            "review_score": "1"
        },
        {
            "review_text": "I like this game and you should like it too because then we can both like it together and the world will be a better place when people like the same things, don't you agree?",
            "review_score": "1"
        },
        {
            "review_text": "love this game rate 10/10",
            "review_score": "1"
        },
        {
            "review_text": "everything that was good about the first one except now its better!!!! there's just so much more building and shooting and then building other towers that shoot other things. if u like first person shooters then u should def buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "I had a lot of fun playing this game, although I struggled a bit in the end of the game the levels are fun and being able to do somthing in between levels other that watching your towers shoot things adds a whole new level of fun. I just wish there were more towers.",
            "review_score": "1"
        },
        {
            "review_text": "A nice take on the tower defense game. Typically I do not like to play tower defense games, but this one is a neat FPS/TD hybrid, and with it's 4 player coop, it has a lot of replayability, and is really fun. Definately worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Essentially it's a sci-fi version of Dungeon Defenders, but with guns/explosives instead of magic and swords. If you like the new breed of tower defense with first person shooter elements, you'll like this one too. There's nothing new here, but its very fun and worth while if you like the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Fun as hell, great game to run around and shoot things. If you love fast paced FPS's this game is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Like Dungeon Defenders but more high tech really cool, really fun",
            "review_score": "1"
        },
        {
            "review_text": "take one part indie company, add another part well done sequel, garnish with responsive patches based on CUSTOMER feedback, cook at 350 for 1 hour. final product: well worth the wiat, well worth the money, and well worth my time. i can not give a high enough recommendation for you to GET THIS GAME! so yeah, buy it, BUY IT OR YOUR LIFE IS MEANINGLESS.....you wont regret it, EVA!",
            "review_score": "1"
        },
        {
            "review_text": "a combination of Tower Defense and FPS genre and you get sanctum 2. actually i bought this game on sale, just for fun, but i was amazed by it, his game have depth, many hero with unique ability, a lots off weapon and tower to choose, and last but not least, strategy, you can have many diffferent strategy on a single map. great replayable specially when you on multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, curves the difficulty if you have more players when playing multiplayer, even on lan, after the first 5-6 rounds the game got super laggy almost to the point where it was unplayable... If it didn’t have network issues i would give it a 9/10 because it’s not only fun but tactical  My overall rating: 8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Fun shooter/tower defense game. Overall improvement over the original, and they keep adding content at the time of this recommendation. If you're a junky for tower defense style games, and want some co-op action, get this.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Warcraft 3 meets Call of Duty!",
            "review_score": "1"
        },
        {
            "review_text": "It's addictive and looks great. DLC doubles the size of the game as well.",
            "review_score": "1"
        },
        {
            "review_text": "Tower Defense in first person,puzzing and fun!  Scores: 81/100",
            "review_score": "1"
        },
        {
            "review_text": "Insanely fast paced FPS once a wave kicks in. there is plenty of strategy in having to choose weapons, perks, and which minions you are best against depending on your class and build, and the towers are actually nice. They dont get in the way provided you build correctly, and even then a quick jump can get you on and off walls. Bosses are huge and everything requires you to be on your toes.",
            "review_score": "1"
        },
        {
            "review_text": "im not really much in to tower defense games but i really love the sanctum series. the soundtrack is awesome and i was even willing to pay for the season pass and enjoyed the new enemies, weapons and levels that were included. even when i payed full price at that time, getting it all now for 85% off is a must grab if you generally like FPS games and or tower defense.  also having the sandbox mode which allows you how you want to play the maps gives you additional time to play.  ",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME GAME TD + lots of bugs to shoot what moar can i ask for !",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game if you enjoy fps games with strategy. Great tower defense attibutes and an overall great game. ",
            "review_score": "1"
        },
        {
            "review_text": "wow definatly one of the best games ive ever played. tower defence is one thing, but being a tower is a whole new expereiance.!",
            "review_score": "1"
        },
        {
            "review_text": "Its fun and never get tired of it",
            "review_score": "1"
        },
        {
            "review_text": "Such a good strategy game and coop makes it really fun to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't expect such a nice game when I bought it. It's, to my mind, the best mix of Tower Defense and FPS :)",
            "review_score": "1"
        },
        {
            "review_text": "A fun tower defense that is definitely a great play. It is more enjoyable when playing with others and can get boring alone.",
            "review_score": "1"
        },
        {
            "review_text": "Coffee Stain is responsiable for goat simulator. 10/10  (review made before game has been played)",
            "review_score": "1"
        },
        {
            "review_text": "A really fun twist on the tower defense genre. I was pleased to find that there are several different load-outs you can choose from, and you unlock more powerful weapons and defense systems as you level up.   There is a great variety of enemies, so I never felt like I was getting bored killing the same beasties over and over again. I was surprised by the high quality graphics--the world looked so fantastic that I wanted to go out and explore it, not just be stuck defending things. I haven't tried the multiplayer yet, but so far the game content is well worth the price you pay for it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is no fun, for a decent mapbuild you'll also need the resources of other players. Barely anyone plays this game. Second to that, even if you have found a full party online, the other players build maps where you'd need an IQ below the 90.",
            "review_score": "1"
        },
        {
            "review_text": "Fun first person shooter tower defense game.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 best tower defense of the year",
            "review_score": "1"
        },
        {
            "review_text": "Great game :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is unreal. Graphics are amazing and gameplay is like FPS plus Tower Defense. So awesome. Definitely get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Me and Mike really liked it.",
            "review_score": "1"
        },
        {
            "review_text": "Worth buying; it's the best game to play with your buddies from school.  Note: Please consider using 'Instant Respawn'.",
            "review_score": "1"
        },
        {
            "review_text": "A near perfect blend of Tower defense and FPS shooter hoard mode. A fantastic game 2 thumbs up 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game, since it is a tower defense and FPS combo it has definitely some unique characteristics about the over gameplay. I loved making my own little maze of death and destruction. The perks are very nice gives everybody something to contribute whether it be dmg boosts or defense boosts to defending the core. Highly reccomend this game to anyone who likes tower defense stradegy or FPS(s). The only downside that I dont really like about this game is that the weak spots are easy to find but sometimes hard to hit depending on who you play as and it can be frustrating if you play the campaign by yourself, definitely more enjoyable to play with friends or strangers. Overall I would score the game 7.9/10.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good futuristic shooter game",
            "review_score": "1"
        },
        {
            "review_text": "This game is not exactly my style but I found it to be a fun Quake Style of game play. A combination of tactics and twitch skills is required to pass each level by using defensive structures and location to aid you in defending your position. I think the use of the defensive structures makes the game interesting as well as the leveling that opens up equipment options. Kids would enjoy this game as it offers multiplayer games via the internet.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable and somehow manages to be varied and not incredibly repetitive.There is no single strategy you must follow to win, experimentation is something you enjoy testing rather than being a tedious chore. Playing with friends or smart random players online makes it that much better.  It is not for all gamers, more so for the strategic FPS player. One who thinks ahead.",
            "review_score": "1"
        },
        {
            "review_text": "this is fun!",
            "review_score": "1"
        },
        {
            "review_text": "It's a good hybrid of tower defense and FPS, but really simplistic. If you're a big fan of tower defense and this goes on sale for under $5, add it to your collection. Defense Grid and its DLC would be a better buy if you want something with strategic depth and a charming storyline.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game!!! The entire idea of a tower defense shooter is awesome. But there is a bug. Whenever i complete the first wave of park the game crashes. please fix. GREAT GAME!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly Entertaining",
            "review_score": "1"
        },
        {
            "review_text": "Ehhhhhhh... it's... alright.... I guess... :\\",
            "review_score": "1"
        },
        {
            "review_text": "truthfully one of the best first person tower defense games out there gamplay is fun and immersive, the level up system makes it a much more fun experience but at times it just feels repetitive. still a great game to buy especially when its on sale",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of THE BEST I've ever played, try out this game now! Play it for free today or buy today! (No batterties needed don't worry!) Are you tired of the old origanal tower defence games? Then play Sanctum 2! If you love tower defence &amp; first person shooter! play this game. P.S. It's Tower Defence + First person Shooter! I Love This GAMEEEEE!!!!! 5 Stars :3",
            "review_score": "1"
        },
        {
            "review_text": "I've only started playing Sanctum 2, but so far I like it. The idea of making a tower defense game into a fps is really awesome.",
            "review_score": "1"
        },
        {
            "review_text": "game is great and adds the complexity that the first did not. sweet new features and you get more then on character. stongly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Are you telling me I can mix FPS and tower defense? Yes please. The action is great, enough customization without being overwhelming, and characters with various personalities and classes that differ greatly from one another. Grand scenery, as well. Very likely my favorite game on this fairly new Steam Account.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I find the FPS aspect of it is quite wonderful, especally exploring little hidden places (theres not loads but they are such fun to find!). As a tower defense game its alot of fun, as a fps it still plays okay, there are alot of ways to mix perks to make some epic combos with your weapons. 10/10 :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with a group of people. Really enjoyed it. I was happy with what I got and I paid full price. My mates paid less than $4 for it on sale and they got an absolute bargain.",
            "review_score": "1"
        },
        {
            "review_text": "Most epic Tactic RPG I've ever seen! Grab your friends and let's own :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is a good game. If you like shooters and tower defense, it is awesome. Even though some levels are hard, playing with a friend would help if you can't do a mission. Playing this online is still fine, but is better with friends.",
            "review_score": "1"
        },
        {
            "review_text": "As someone with a deep love for tower defense games, this game 'just changed ma lyf dawg, ya feel?' Seriously though. This revolutionized my view on tower D games... I would've paid 30$ for it lol. instead i got it for the great price of $3.   sales op",
            "review_score": "1"
        },
        {
            "review_text": "oh hell yes do i recomend this game. love it well worth a play if you like tower defence games",
            "review_score": "1"
        },
        {
            "review_text": "A fun mix of tower defense and FPS. Interesting social mechanics... I like the invitation system.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, simply fantastic. I especially like how they combined the Tower Defense element with the first person shooter.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game, It combines tower defence with a first person shooter. When i was younger i would spend a lot of time on canyon defence :D so when i was recommended this game i couldnt wait to try it out. Now i have played it i would recommend it to anyone with a small budget looking for an awsome game. This game is great to play with your freinds, for fun and for some serious gaming.",
            "review_score": "1"
        },
        {
            "review_text": "how do i get the free version",
            "review_score": "1"
        },
        {
            "review_text": "This game is the perfect combination of FPS and Tower Defense and will appeal to fans of both. You can specialize with a weapon/loadout style of your choice, and the game rewards you with more powerful weapons and upgrades along the way. Seems to be tuned just right - not too easy, not too hard. I haven't tried multiplayer yet but the solo game is great. Multi is probably even better. Works great on Windows 7 64 bit. I haven't seen any bugs and it feels very polished.",
            "review_score": "1"
        },
        {
            "review_text": "A fun mix of strategy and action. Both factors come into play in surviving a level. The organic co-op is a very nice feature, and some levels definitely require a mix of good players to survive especially on higher difficulties. The basic mechanic here is that each player gets a set amount of resources and the enemies scale linearly, so four players get four times the resources as one, meaning they can build towers much more quickly, which is essential for survival on certain maps.  One of the downsides is that sometimes you get paired with people who really aren't very good and don't come close to carrying their weight. That's no fun. Playing with friends is recommended.",
            "review_score": "1"
        },
        {
            "review_text": "As Tower Defense games lover:  Tower Defense/FPS hybrid game? That must be stupid  - me before playing this game.  Tower Defense/FPS hybrid game? How stupid of me for not playing this earlier!  - me after playing this game.  It is a great game. Probably every Tower Defense games fan will love this one.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant Game.",
            "review_score": "1"
        },
        {
            "review_text": "There are no goats, but it's still a good game.",
            "review_score": "1"
        },
        {
            "review_text": "i cant concentrate on what im supposed to be doing because everyones too sexy",
            "review_score": "1"
        },
        {
            "review_text": "I really recommend this game, i have lot of fun with it, in coop mode and even playing alone. Lots of maps, different weapons and characters, you level up and get passive bonuses, and new towers.  Its a really good game, with a lot of difficulty levels, you can play it super easy, and you can increase the difficulty by a lot if you want.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't able to really get into it, but this game is pretty cool. Fun to have a balanced tower defense game that doubles as a first person shooter.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. really like the colour palette used. Easy to drop into, even if you haven't played and FPS/turret defensed hybrid before. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Hoping for sanctum 3, instead of goat simulator dlc",
            "review_score": "1"
        },
        {
            "review_text": "Really fun addictive game for friends and family to play defensive types :)",
            "review_score": "1"
        },
        {
            "review_text": "I like this game so much it puts other games at the bottom of my list. I spent over 25 hours playing this game :). If you are debating about buying this game i reccomendet. (pard my spelling)",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, loads of fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of those games which I'm unable to finish. Not because of bugs, but of failing the last Mission. The game is at the beginning easy and gets harder with every Mission.  - Well designed Graphics - Ecellent designed Maps/Missions - MANY Secrets - good balancing - good Story - cheaper than other games - Multiplayer also very good balanced. - Sometimes rare bugs occure in which the Player only can Suizide or use explosive weapons to get out.  DL-Contents (DLCs): - Contain more chapters (normally 1 per DLC) - Contain more USEFUL Towers - Extending the Story - cheaper than other Games's DLCs",
            "review_score": "1"
        },
        {
            "review_text": "it gets boring after a day needs more content for its price for it's boring playing the same level over and over and over and over and over and over and over and over and over and over and over and over and over and over and over",
            "review_score": "1"
        },
        {
            "review_text": "A great deal of fun, with friends, by yourself it's very VERY hard.",
            "review_score": "1"
        },
        {
            "review_text": "best of both with this tower defence meets first person shooter hence the hybrid game is born play it solo or what sold me was the co-op mode.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a very good game that mixes in first-person shooter and tower defense. I like it, but sometimes the game can get laggy. I tried to fix it in the settings, but it was still laggy. It's probably just my computer. Anyways, the graphics are amazing, and so is the music. It has this other-worldy tone, and it sets the mood just right. I would obviously recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's addictive and looks great. DLC doubles the size of the game as well.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 was a bit dissapointing at launch. However, first DLC is already awesome and there are more to follow. Also, note this is multiplayer game and fun doubles when you play fith friends. Now you can try very different strategies and work as a team, which is just so much better (and easier) than playing solo.",
            "review_score": "1"
        },
        {
            "review_text": "bruh this game made me feel so g00000oOoooOOd.",
            "review_score": "1"
        },
        {
            "review_text": "Only played a few minutes so far and I already love it. I love tower defense games. I love FPS games. This is actually the best of both. The only thing I'd like is to mod the towers mid wave like you can with most tower defense games, but you're frankly too busy blasting aliens to do anything but trust your towers to do what they're supposed to do. Looking forward to the rest of the game.",
            "review_score": "1"
        },
        {
            "review_text": "very good and benifital gameplay that, it give the player a large room for customisation of ones class and towers",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a tower defence where you help the towers!",
            "review_score": "1"
        },
        {
            "review_text": "Good but CASUAL game...",
            "review_score": "1"
        },
        {
            "review_text": "great game for the pice",
            "review_score": "1"
        },
        {
            "review_text": "It wasn't really my game, but it has the stuff that many people would like. If you look at the pictures and you're interested, give it a shot. You most likely will like it.",
            "review_score": "1"
        },
        {
            "review_text": "I love Tower Defence and I love FPS games. They are both combined in this game. Awesome much! :D",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a very fun game ! Playing with friend and thinking of layout for the mobs to go through, it is different everytime !!!",
            "review_score": "1"
        },
        {
            "review_text": "The game is a very fun defence fps never played anything like it, and had a good lasting effect. ",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a fantastic Tower Defense game. I've played a lot of TD games, and after a while they start to just get repetitive. Sanctum 2 keeps the gameplay fresh by upping the difficulty, offering huge amounts of customization, and by placing you directly in the path of your enemies. There are many weapons to equip and switch between, each offering their own strengths and weaknesses. The characters themselves are different, each focusing in different play styles. Some characters are good at crowd control, others excel at sniping enemies. You get many different types of towers to equip before you start playing the game, and these towers, in combination with others, can drastically help you on the battlefield or blow some enemies away. The game lets you play how you want, and I love it for that. Each map is different, and requires you to think before you place blocks and towers to alter the path enemies will take. The level-up system offers new perks and weapons with each level, and the levels come easily, depending on the difficulty you play at.  Overall, it's a great game that lets you be you and really brings out your inner gamer. Every time I lose I want to go back in with a new setup and see how I can make it work that time. I highly recommend this to fans of Tower Defenses or First Person Shooters in general.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! By far the most enjoyable first person tower defence I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "from the people who bought you goat simulator, yes that game, comes a fast paced fps tower defense game that is amazing fun to do solo or in a group, new monsters pose new threats and figuring out the best way to deal with them will be a challange for even experienced game players.  highly recommend this game if you are into games that test all of your gamer skills.  though when it comes frames i remember having some issues with drops in fps due to to many monsters on the field at some points on my old rig so do make sure u have atleast the recommend system specs",
            "review_score": "1"
        },
        {
            "review_text": "It´s excellent up until the last level; the final boss you have to destroy is a Super Heavy. Extremely anti-climactic. Good replayability and fun gameplay, though.",
            "review_score": "1"
        },
        {
            "review_text": "awsome game, really adicting, its a mad mix of the FPS and TDS genre,plus its great fun singleplayer and multiplayer, it well worth you moeny, but you may need a decent PC as the graphics are insanly good!  have fun! (if you buy this game of course)   :D  EDIT:sorry for the typos, i was half asleep while writing this review :P",
            "review_score": "1"
        },
        {
            "review_text": "i think this game is really fun, i'd recommend getting the four pack and playing it with friends or it feels a little lonely :)",
            "review_score": "1"
        },
        {
            "review_text": "An enjoyable game that is slightly more difficult than the first. This sequal does include a lot more customization for the character and a few new towers allowing for more replay value.   The campaign style progression is a nice addition which helps give a backstory to the hordes of aliens who need to be mowed down.  Overall a 7/10 and would recommend to friends.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, spent loads of hours on this game. Great single and multi player.  Careful when playing, you're time will disappear.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. The combination of Tower Defence and FPS is really well done. The game is really difficult, when you want it to be. 'Must play' with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting combination between strategy and shooter.",
            "review_score": "1"
        },
        {
            "review_text": "oh come on we WANT Sanctum 3! Cant wait!",
            "review_score": "1"
        },
        {
            "review_text": "I like this game very much, but I am somewhat saddened, they took a more ♥♥♥♥♥♥♥♥, goat-like route...",
            "review_score": "1"
        },
        {
            "review_text": "Pow Pow Bang Bang its a good fun game ^^",
            "review_score": "1"
        },
        {
            "review_text": "Great game i just need better internet to play with others",
            "review_score": "1"
        },
        {
            "review_text": "really fun to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "very good tower defence game with lots of diffent game play elements from towers to perks",
            "review_score": "1"
        },
        {
            "review_text": "Check my hours, good game. Best played with friends.",
            "review_score": "1"
        },
        {
            "review_text": "  Probably one of forgoten but awesome games ever found on Steam.  This was the starting point for Coffe Stain Studios, creators behind Goat simulator, which deserves a title for 'Most Innovative Game Ever' with its unique 'First-person shooter' and 'Tower defense' combination. It has a lot of Easter eggs (like    Hal denying explorer concript's access to the room    at introduction) and lots of enemies.  overall, i think it's a great game to play single-player and co-op multi-player. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "A great game with both tower defence and first person shooter elements. Great for both strategy and FPS fans.",
            "review_score": "1"
        },
        {
            "review_text": "Great sequel to a fun idea. A couple weapon improvements helps broaden the strengths that this concept brings to the table. Really fun if you have a couple people to play with. Some levels are really tough and takes a bit of planning and teamwork to get through but the challenge is worth it.  Definitely pick this up for you and your friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a fantastic hybrid of Tower Defense games, and first person shooter mechanics. It does nearly everything well, and is thoroughly enjoyable from start to end. Great soundtrack, good visuals (for a semi-indie title), and a fair amount of replayability. While you can play this game in single player, you should really play this in Co-op.  Note that the DLC content does significantly extend the game, (going from 16 levels to 32) and is very much worth getting. It does, however, make the game significantly easier (the new towers and weapons are far more effective than what's available in the base game) and effectively makes the 16 levels from the base game trivial, even at maximum difficulty settings. I strongly recommend limiting yourself to the stock weapons and towers while clearing the initial 16 levels. (with feats of strength) They were designed to be played that way. The extra difficulty will also go a long way towards extending the length of the game, before you run out of content.",
            "review_score": "1"
        },
        {
            "review_text": "gr8 game top keks would reconmmend if u want to play something to pass the time etc really cheap in sales or on ♥♥♥ i suggest picking 4 pack up and play with friends gr8 game hope for another juan",
            "review_score": "1"
        },
        {
            "review_text": "it's a fun little game to do when your bored. runs good looks good. not much of a story. i wouldn't recomend it at it's full price but if you can get it on a sale below 8 bucks i'd snach it up.",
            "review_score": "1"
        },
        {
            "review_text": "Easiest game to play as I eat my cheerios. 5/5 or 100/100 or whatever the rating system tends to be these days",
            "review_score": "1"
        },
        {
            "review_text": "Interesting merge of FPS and Tower Defense.",
            "review_score": "1"
        },
        {
            "review_text": "aliens cant jump simply jump over these short towers      10/10",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "Great combo of genres. Steep learning curve towards the DLC levels. No matter what level you sre you can always find a fair match, it's great. Excluding the bronies it also has a great community.",
            "review_score": "1"
        },
        {
            "review_text": "Game isn't bad. It has nice coop and combination of tower defence and shooting is nice. But in my oppinion i enjoy mor fun with orcs must die",
            "review_score": "1"
        },
        {
            "review_text": "A Tower Defense &amp; FPS game, recommended for who enjoy playing these type of game. It's awesome ;)",
            "review_score": "1"
        },
        {
            "review_text": "It's a really wonderful game! i've played it for a while and while i will still play it as it has amazing gamemplay, incredible graphics and awesome co-op fun, it has a big issue on Linux platforms, tried on Lubuntu and Debian, with a GT 610 and a GTX 750TI: the game randomly crashes!!!! so far i've seen it has been a problem that has been around for a good while and albeit the community itself have gathered info about it there is no official patch for this issue, If you're gonna play on Windows or Mac buy it! if you're gonna play it on linux and you don't mind getting randomly disconnected, losing the exp you'd get online, or needing to play the same level like 5 times until you can pass it AND the game didn't crash, do it, if in the future a patch is released where this issue is addressed i'll change my vote to positive as i really love this game, but until then i'll keep it negative as a WARNING FOR EVERY LINUX PLAYER OUT THERE.  ***EDITED***  Now after a few updates the game doesn't crash I'm changing this review to positive, awesome game :D",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! Play alone or with friends and either way it's still a ton of fun. My only complaint would be (SPOILER ALERT) the giant at the end... I wish you could fight it instead of just watching it walk. The last level is kind of full of suspense watching it wake up only to have the credits roll.",
            "review_score": "1"
        },
        {
            "review_text": "A mind-blowing long time ago, there was this dude, Sisyphus, who pi$$ed off Zeus and ended up being cursed to push a gigantic boulder up a hill, only to have it roll back down again, just to have to push it up a hill again, and so on, and so forth, forever and ever.  So, you must be thinking 'What a torture! And don't even wanna know how it feels like to be stuck in such a stressful, repetitive and pointless existence!'  But what if it was just for a few days? I mean... Think about it. Sisyphus must have had a little fun on the beginning, right? Pushing a freaking boulder up a hill, feeling so strong, showing his guns to the ladies, telling everyone that this was how he trained to stay fit and that later he would be doing some planet-lifting with his buddy Atlas. I bet he even got Apollo (the John Williams of the Greek gods) to play a musical theme like 'Raiders of the Lost Ark' when Sisy was running downhill being chased by the boulder.  But I digress... My point is that Sanctum 2 might get old too fast for you and you may find the XP progression too slow (I cleared the campaign mode without being able to unlock half of the possibly cool things) but the game is quite cheap.  After a while it becomes torture. But keep it in mind that it is cheap torture.",
            "review_score": "1"
        },
        {
            "review_text": "A solid B-tier game that doesn't try to be more than it is. Quite enjoyable to play through once or maybe twice.  If you're going to buy the game, grab the complete pack when it goes on sale, as the DLC isn't just cosmetics or multiplayer maps - it's actually additional single player campaigns required to get a resolution for the main storyline.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is quite an original game with putting fps and tower defence into one and does it quite successfully. It is a very enjoyable game with decent graphics and good control. If you are into fps or tower defence or both I would highly recomend this game! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced creative game. Its quite annoying that enemies moves a bit sluggish and turn arround instantly (pain for sniper aiming for weakpoints). Overaly very fun game to play once in a while for several hours, but its not a title to play for too long non stop.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to enjoy yourself in a good game, shooting some ♥♥♥♥♥es while tower defensing (with your own strategy), this is the game. You can spend some hours (alone or with friends) in it and dont even notice. Even if you're not a fan of fps/td you can still have a great time. I recommend for everyone. :)",
            "review_score": "1"
        },
        {
            "review_text": "  FREE WEEKEND EXPERIENCE: I spammed my friends with text to speech in the chat and won. 10/10 will imitate stephen hawking again.",
            "review_score": "1"
        },
        {
            "review_text": "good when solo, even better with friends",
            "review_score": "1"
        },
        {
            "review_text": "PROS +Fast, fun, strategic gameplay. +Alright graphics. +Amazing with friends. +Constant unlocks keep it interesting. +Variety of perks, towers, and weapons allow for various styles for each character. +Cheap price.  CONS -Not much in the way of story. -Singleplayer is hell. -Stale memes.  Get Sanctum 2, my dudes.",
            "review_score": "1"
        },
        {
            "review_text": "Text to Speech. Definitely worth $16.99",
            "review_score": "1"
        },
        {
            "review_text": "The Fitnessgram™ Pacer Test is a multistage aerobic capacity test that progressively gets more difficult as it continues. The 20 meter pacer test will begin in 30 seconds. Line up at the start. The running speed starts slowly but gets faster each minute after you hear this signal (bodeboop). A sing lap should be completed every time you hear this sound. (ding) Remember to run in a straight line and run as long as possible. The second time you fail to complete a lap before the sound, your test is over. The test will begin on the word start. On your mark. Get ready!… Start (ding)",
            "review_score": "1"
        },
        {
            "review_text": "I would first like to say if there was a neutral option down the middle i would have picked it.  Great game if you have friends other wise... not so much  Tbh i loved the game when i had friends playing but then they got bored and i very soon got bored as well. Good FPS and tower defence but soon gets repetative and boring.  ",
            "review_score": "1"
        },
        {
            "review_text": "One of the most immersive games I have played, from the flora - to the hostile flora, to the soundtrack and the environment. And this game also has BFGs.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a surprisingly well made TD/FPS hybrid and surprisingly fun to play. In Sanctum2 you are to prevent alien forces from reaching your 'Core' by steering them into long maze-like roads filled with towers and keeping them under constant fire from your own weapons.  It is a TD game so towers are essential for your sucess, but its also a FPS so, as mush as u depend on your towers, they depend on you and your weapons/perks, so both aspects of this game are very important, from tactical planing to sharpshooting. Speaking of towers, weapons and perks, there is quite the selection to choose from and you can pretty much build any type of character that suits your play style. In addition, every towers behaviour can be programmed manually to shoot exactly what you want him to, giving you much more controll over the course of action.  Enemies in this game are well thought, well designed and they come in all kinds of different shapes and sizes, and will require you to use all of your arsenal. You will be fighting anything from small, foot sized rat like monsters that will just charge you and explode, to a hard and heavy, tank sized armored bugs that wont even bother with you and will head straight for your core soaking up all the tower damage and providing cover for the rest of the enemies.  Levels are pretty much like enemies. They vary a lot, so anything from a small sqare to a huge maze like levels with many paths, alien spawns and even multiple Cores will happen. These levels are reall well made and even the smallest of them dont hold your hand and tell you how or where to build your defenses, tho, some levels will have quite a lot of unbuildable terrain(note the blue outline in fist screenshot, everything outside it is unbuildable terrain) but will still provide you with countless options and superb replayability. Also, i wanna point out that these levels are visually appealig and very beautifull, and that they often have many cool things you can find and discover within them if you feel like it.  Progression system is fun and the game will reward you based on your action, so, for example, staying alive for the whole wave will earn you some extra XP which will give you access to more towers, weapons and perks. Eventually, when you feel strong enough, you can start playing with 'Feats of Strength' which will make enemies either stronger, faster, more durable, regenerate their lost HP, make death permanent, refund you less when selling your towers, or all of the above at the same time. These make the game super challenging, much more replayable and incomparably more fun, they will count towards your overall completion and will reward you with +20% to total XP count, per feat enabled, when you finish the level, if you can finish it that is :)  Last thing i wanna go over is the multiplayer. First off, i just wanna say that i never played this game solo and that i think that any game that has a co-op campaing option should probably never be played solo in the first place and i higly recommend playing this in co-op and co-op only! So the multiplayer is awesome! You can bring up to 3 friends to play with you, each with their own towers, weapons and perks, and with the good character customization that this game has, none of you have to be even similar to each other. Also note that for every friend that you play with, aliens will be tougher, and im not rly sure how the equation goes, i never gave it a thought to be honest, but it all seems to be balanced and challenging no matter how many of you are playing together. You all have your own resources to build with and each player is awarded its own resources after a wave is finished but you can also choose to share them between yourselves without any penalty as much as u like. Speaking of MP, and playing with friends, i have to mention the one and only flaw i encountered while playing this game and that would be communication. As much as an optional text-to-speech bot is giving its best to pronounce the words you type in, this game is just too fast paced to type during a defense and you should by all means stick to voice chat. However, in-game voice chat is really bad, it cuts off and lags quite a bit even when there is no lag at all. Fortunately enough for all of you who dont speak much, there is a 'ping' option that lets u summon a beacon of light to a targeted location that is sure to get other players attention for you in a heat of battle. So, if you wanna have a good team play, use Skype, Steam Voice Call, Teamspeak or whatever you prefer, just dont rely on in-game voice chat.  With all above being said, i rly have no reason not to like this game, and not to recommend it to all of you TD and even FPS lovers. Dont be fooled by this games frequent huge discounts, Sanctum2 is a blast and for what it offers, well worth even at the full price. So if you like TD games even a little, you will love Sanctum2; if you like FPS games, theres plenty of that in here too, and if you suck at base building you can always let your friends build for you :P  Honestly, since the one and only flaw i can think of(and trust me, i thought a lot!) is that easy to workaround, and there so many good sides of this game, 10/10   Edit: My opinion on the game hasn't really changed even though my writing did significantly. The only reason I'm editing this review is because of the Steam's 2016 Autumn sale tasks ;) ",
            "review_score": "1"
        },
        {
            "review_text": "Very good co-op game.",
            "review_score": "1"
        },
        {
            "review_text": "Sanctum 2 is a fun experience.  I knew nothing about Sanctum, only played the demo of Sanctum 1, and I was surprised about what a solid title this is. The description basically says it all: 'Sanctum 2 is the sequel to the world’s first Tower Defense/FPS hybrid game'. You build walls and towers to change the route and attack the aliens.  You get a few walls to place and materials to build/upgrade your towers after each round. But once you have covered the entire map with walls to make the route as long as possible, walls become useless, and materials are all you need.   Pros:",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game with some fantastic music. Best Title Screen Ever.",
            "review_score": "1"
        },
        {
            "review_text": "FPS + Tower Defense. Futuristic theme.   I LOVE the game. However not much people know about this game apparently.  More friends = more fun.",
            "review_score": "1"
        },
        {
            "review_text": "reat game design mixing rts, strategy and fps together. leveling up is so slow.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun if you have enough friends for a full coop party, but I can't imagine this game would be great alone. Buy on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I dislike this game as a tower defense game because it isn't. A few maps are heavily dependent upon towers at easier difficulties but you quickly discover that the right combination of character and weapon can do more damage than all your towers combined, and hard mode is designed with this in mind. There are some levels where you can do 90% of the total damage done and still lose the round. And then the designers start trying to achieve greater difficulty by throwing in enemies that are 100% immune to towers, and then gimmicky enemies that towers stop targetting and then they return to 100% health if you don't kill them by yourself fast enough.  The worst part is that they have all the elements for perfection. Their map design is really creative but then they only give you a few walls and towers to work with, leaving you feeling like a kid drooling at the lego box for the Millenium Falcon but then looking down at your hand and realizing you only have a dozen blocks to work with. When you only have 2 towers going into round four and maybe 5 or 6 towers going into the final round, there's not much stategy. The game would be more more fun if you were given far more walls and towers and the outcome were determined more by your maze building and tower placement skills, rather than picking the right weapons and perks and then showing off on youtube by killing all the enemies without even bothering to build your token towers.   I thought this would be less of a problem in survival mode but there is no true survival mode. Survival is just normal mode with the normal waves but it repeats after the last wave and just boosts the health, speed, and regen of enemies by a LOT. So rather than being a mode where you can try to build the perfect setup and then see how many waves of every increasing monsters you can last through, you're instead just left with another form of hard mode that lasts maybe two or three times as long as normal.  I've never seen a game be SO close to perfection and then just ruin it with poor design choices. But if you like PVE FPS then I do still recommend this game for you. Just don't expect much tower strategy in hard mode or you'll be disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "So the game itself is actually pretty good. The dealbreaker is that the support team has utterly abandoned it with some massive bugs that range from mildly annoying to crash-to-desktop. This issue is even more pronounced on the Linux version and while these bugs have been known since mid 2014, they were simply forgotten. People continue to ask for support, but they're basically talking to a wall.  Like I said, the game is really solid in terms of fun and mechanics, but that all goes away when it suddenly breaks without warning. Really disappointing!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is good but it doesn't feel like Sanctum. The old Sanctum was a bit silly with enemies wearing hats and dancing around when you lost or that upbeat happy music you got with the big victory screen as your character danced around with the ai.Everything was unlocked from the start so you could play everything your own style instead of waiting for the towers to be unlocked. you know what problem that creates? grinding! grinding for levels, something that doesnt belong in Sanctum or any tower defense. comparing to sanctum 1 it is a lot less polished i'd say. i cant easily scroll to change weapons i have to press e. and i cant make my maze the first round i have to wait until get more bases rather than use resources. u just lost alot of ocd customers. these are more minor complaints but why was the bases changed form blocks to little round disks. In sanctum 2 bases can be placed diagonally but unlike the towers in sanctum 1, they are small and can be easily jumped over which feels unrealistc. the 'Lumes' could easily jump over Sanctum 2's towers. Sanctum 1 had massive blocks that trapped them inside and it felt like they couldnt escape and they needed to follow the path. the actuall gameplay is the same to sanctum1 but with more flashes and pazzaz! for an indie developer it is supprising the graphics make any AAA game look grey and smudgy.  Conclusion-  Sanctum1- more charm bigger maps no grinding more polish greater sense of accomplishment Sanctum2- more serious story smaller maps grinding for towers and weapons better graphics better gunplay(slightly)  get sanctum 1 it is a better game in my opinion and you still support the same guys who made this game so get it get it get it! ",
            "review_score": "-1"
        },
        {
            "review_text": "Unplayable. There's a black box of darkness surrounding me in every direction that goes for ten or fifteen feet. Whenever things get close I can no longer see them because it hides them. So I have to do everything from really far away, which makes building and shooting almost impossible.  Game's broken, can't recommened buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "boring in my opinion",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing like the demo video. Building doesn't make sense.   I have no idea why you are killing all this stuff.   Wish I could get a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Crap. Don't waste money.",
            "review_score": "-1"
        },
        {
            "review_text": "A tower defense game that isn't actually about tower defense, but rather about grinding (because all the good stuff is locked behind 50 hours of grinding). There are also only one or two winning strategies, the rest will only last you in the first few levels. Good luck figuring out which specific combination of the 50 sub-par towers will actually win you a level!  There's also a huge emphasis on the players, rather than the towers. Not what you expect in a tower defense game.  Overall, it's a pretty good game, but not a good tower defense game. Forced grinding is not fun.  If you want a fun Tower Defense FPS hybrid, get the first game instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Screen Tearing/Screen Buring right at the beginning due to low graphics.. Wouldn't recommend if you have a low end pc, or this would happen. BUT, if you do have a mid end or high end, the game works great. Tower Defences can and should be fun, but this one lacks its replayablities in my book. Not my cup of Tea. :D",
            "review_score": "-1"
        },
        {
            "review_text": "Trully I don't know why i bought this game. I was looking for a good tower defence game and I see an FPS with some elements of tower defence. Its a pitty.",
            "review_score": "-1"
        },
        {
            "review_text": "Let's be clear, this is a FPS with some TD elements. You can place towers, but your selection and tower count is very, very tightly limited. You can build mazes, but monsters can destroy them.  Maybe it wasn't designed to be played with 1 or 2 players, but it's a big step downwards for me from it's predecessor.",
            "review_score": "-1"
        },
        {
            "review_text": "Like always, a game that wants to push you to play with friends and, for that, makes solo play bothersome... There's simply no balance if you want to play on your own. As a matter of fact, the game won't even PAUSE when you're playing alone. Wat? A real shame, I like the FPS/tower defense mix very much, but I ain't buying it because nobody else plays it and the imposing 'Play multiplayer OR ELSE' environment.",
            "review_score": "-1"
        },
        {
            "review_text": "Played this game on one of its free days, pretty fun, but can get boring, theres something lacking from the game, not really sure how to describe it.",
            "review_score": "-1"
        },
        {
            "review_text": "For $15 ????? Why",
            "review_score": "-1"
        },
        {
            "review_text": "It's free so i installed and played about 10min before uninstall :)",
            "review_score": "-1"
        },
        {
            "review_text": "Don't waste your time this game is dull and boring I was sick of it after less than five minutes",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "I can't recommend Sanctum 2 to anyone. Being a fan of Tower Defense and shooter games, I really thought I would like it. But the boring maps, enemies, towers and even classes made my friends and I give it up after merely 3 hours of gameplay.  Having bought the Complete Pack I honestly regret spending money on this.  I'll tell you why  Classes: The classes presented in Sanctum 2 is poorly designed, if not a complete uneccesary addition to the game. You don't lvl up the individual classes, so you can switch in-between maps without being punished for choosing something you disliked. But the only thing the different classes offers is a main weapon type (Sniper, Assualt Rifle, Shotgun etc) and a bonus like double jump or extra health. Unlocked perks can be used by all classes. The are NO customization, except a cheeky DLC that makes your character get a new skin.  Enemies: Bring nothing new to the Tower Defense genre. Enemies are dull and the AI is stupid. Many of the mobs can easily be tricked to run back and forth by the player simply jumping between walls.  Maps: Extremely stupid layout of maps makes me wonder what the developers what the hell they were thinking. Most times you're only able to build on half on the map. Useless friendly AI that dies of tower is placed near them, not that it matters because they die by the sight of an enemy.  Towers: The Towers in Sanctum 2 is nothing you haven't seen before in ANY other Tower Defense. Most of them is rather useless and is not even worth building, since you're only able to have 15 towers in total on a map. Rest is just maze building. The towers can be upgraded to lvl 3, and after that you can 'Overcharge' it. Giving it extra stats, but these stats are determined by the game. You can't choose which stat to boost, the game allready decided that for you. Which in my oppinion just takes away alot of game customization (yet again).   Conclusion: Sanctum 2 is a highly overrated game that offers nothing new to the Tower Defense genre. The amount of uneccesary stuff and stupid decisions made by the developers makes me want to ask for a refund after merely 3 hours of gameplay. Even playing it with 3 other friends couldn't keep me or my friends playing with the horrible AI, map, tower and class design. If you're in to the whole Tower Defense + running around with a builder. I can highly recommend Dungeon Defenders, but NOT Sanctum 2.  EDIT: Also, having the weapon you're holding take half of your screen isn't pleasing in the slightest maner.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring and casual with a hint of unbalanced gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Hurts my eyes",
            "review_score": "-1"
        },
        {
            "review_text": "Have only played a few levels and this is a very fun game with great graphics. The only thing I don't like so far is the character art of the characters you play as. They are very ugly, they look like anorexic meth addicts. No reason for them to look like this as you only see them a few times. Not saying they need to look like supermodels but meth addicts? Seriously ? Update and change please. Its almost bad enough I don't really feel like recomending this game as I don't want other people to have thier eyes bleed too lol",
            "review_score": "-1"
        },
        {
            "review_text": "This game in my honest opinion was a downgrade from the original Santum. If you are a fan of the first game though it is a good game to get and try out for yourself. In all honesty i just needed to write a review $:  Best option, Get This game when its on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "complete garbage compared to the orginal. i had day 1 buyers remorse",
            "review_score": "-1"
        },
        {
            "review_text": "just next copy of warcraft angel arena ho wer made in game as warcraft and starcraft 1 but then born lol dota and rest of this joks this not new typ of game its old typ of game mad from player to player two teams fight mobs tower angel arena and rest we did build years back in warcraft 2 :P",
            "review_score": "-1"
        },
        {
            "review_text": "What killed this game for me is the scaling of enemies when playing co-op with friend. It felt like I was punished for playing multiplayer. Levels were a lot easier to solo. Every single enemy takes over a clip to kill (except the speacial weak enemies). I do understand the point is to work with your towers but it still makes you feel really underpowered and pretty useless.  Also in some levels it was annoying to constantly fly off the map, when there were random holes on the ground.  Other than that it was fun to play until the point where I got overwhelmingly fed up with the enemy scaling.",
            "review_score": "-1"
        },
        {
            "review_text": "Sanctum 2 has terrible Linux support. Not only does it run much less smoothly than its Windows counterpart, it frequently crashes. On some levels (such as 'Canopy') it will crash 100% of the time. Changing the MPAA graphic setting also reliably causes a crash. Sometimes the game will freeze, making you forcefully close it, or X server must be restarted, or the OS must be restarted entirely. No combination of GPU drivers, GPU settings or game graphics settings resolves this.  Sanctum 2 is brought to you by the same developers as Goat Simulator, the game that's so buggy users have decided (as you will see from MetaCritic reviews) that they must have developed it buggy &gt;&gt;on purpose&lt;&lt; as a joke. But the joke is on us, the consumers, for paying for such shoddy software as this developer puts out and refuses to fix.",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful graphics and levels. Its nice to see a tower defense game from the first person point of view rather than the top-down.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is ♥♥♥♥, dont buy it, dont waste your money for this ♥♥♥♥ of a game !",
            "review_score": "-1"
        },
        {
            "review_text": "Its like when your cousin has a second kid everyone pretends they care when in general its nothing special",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "it is very repetitave and its quit boring after a while",
            "review_score": "-1"
        },
        {
            "review_text": "The original is much better than this. This game is simply BORING. As you start the game, you are FORCED to play the super boring singleplayer prologue before you can play the multiplayer, being that it's a multiplayer co-op focused game that you are supposed to play with your friends, I don't know what they were thinking.  Shooting is much less fun, weapons feel worse than in the first game.  In short screw this game, I regret buying it for when it was full price, because I was such a fan of the original. I rather play the original than this game.",
            "review_score": "-1"
        },
        {
            "review_text": "one reason to hate this game: honey badger dont care achievement",
            "review_score": "-1"
        },
        {
            "review_text": "Towers suck, gatta grind heavily to unlock towers/weapons/perks. Fine multiplayer game, terrible single player game.",
            "review_score": "-1"
        },
        {
            "review_text": "I only played it just to type in chat and hear it go 'eheheheheheheheheheheheheheheh' But if that's what you're looking for then it's right for you!",
            "review_score": "-1"
        },
        {
            "review_text": "Not really",
            "review_score": "-1"
        },
        {
            "review_text": "Terribly Optimised.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really worth it. If you like Tower Defense games this is a good one but it wont make you love tower defense if you are indiffrent to it.",
            "review_score": "-1"
        },
        {
            "review_text": "honestly it sucked ",
            "review_score": "-1"
        },
        {
            "review_text": "Really just a first person Tower defence game. Sure it looks pretty but the gameplay is boring and slow. Not worth your money when you can play hundreds of tower defences games for free on flash game sites.",
            "review_score": "-1"
        },
        {
            "review_text": "Gets boring and REALLY BORING after 1 hour, just go to main menu enjoy the theme and drop the cards then delete the game and go play somethign else. at start it looks like it is a good game but it gets really boring and repetetive after that every mission is same thing except with a few more attack waves.  and by the way, you do not even have privacy in this game... you wanna play alone but someone randomly can joins your 'single player' game and troll you around because it is pretty normal here as it seems",
            "review_score": "-1"
        },
        {
            "review_text": "Overall not a bad tower defense but its missing something, the environment is a little too sterile and you just sort of jump into a tower defense that is a little too focused on the shoot em up aspect. Which wouldnt be bad if your character didnt fee so underwhelming and the variety of towers wasnt so narrow",
            "review_score": "-1"
        },
        {
            "review_text": "its nice, but not for me ",
            "review_score": "-1"
        },
        {
            "review_text": "**FOR MAC*** * I have this game on PS3 for many many months a i love Sanctum 2. But, Sanctum 2 on MacBook? THE WORST THING EVER. It'll crash and load FOR A LONG ♥♥♥ TIME. Don't buy this gane if you're planning to us it on a MacBook But buy it for Windows and PS3.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall, I didn't hate the game, I just felt disappointed. It promised unique blend of FPS and Tower defence, but all I got was a game where you line things up and mow them down in single file, one after another. There was little to no stratagy involved. The only stratagy that worked was to make as long a path for the little buggers as i could and then slop a few guns down on the place. Then again, that's how I play ALL tower defence games. The FPS part was also a big let-down. I found myself sticking with the robot-sniper-thing because 1) A high power weapon with INFINATE AMMO could mow down hundreds of the buggers 2) Reloading was non-existant so i could switch from one high-power weapon to another so the other could 'cooldown' 3) It was the only Playable Character with a personality I could cope with (everyone else was just a carbon copy of the other). Given some time and improvements, this could become worthy enough to stand up to the rest of the unique FPS sub-genres/hybrids, but as of late it's just another game to add to the pile of big let-downs. (excuse any gramatical errors as i wrote this at 1:30 AM and am super tired)",
            "review_score": "-1"
        },
        {
            "review_text": "30 waves survival - few hours wasted, as 'server lost connection'. With no exp. Awesome The game is quite booring. Such a big maze isnt fun to build. Different towers are much 'different'. Shot the creeps get used after 3-4 mission of campaign.  2-3 hours is enought for the game.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is horrible do not buy it",
            "review_score": "-1"
        },
        {
            "review_text": "Sanctum two is a First-person shooter with tower defense elements, making it an interesting mesh of styles, but at the same time is still a shooter at heart. Unlike the first installment of the series do not expect to be able to hold off enemies with towers alone.   While the game itself is fun it is more limited in some ways. Each character can only hold a certain number of weapons, these cannot be upgraded and depend on character 'perks'. All in all its a shooter with TD elements, whereas the first one was a TD with shooter elements ( By comparison of course, the first one is still heavy on the shooting, but not as much).  If this is what you are looking for enjoy!   I do recoommend playing a Demo first though (I got tired of this one pretty fast, that is why i tagged it as not recommended).   ",
            "review_score": "-1"
        },
        {
            "review_text": "I loved the first Sanctum and thought for sure the second edition to the game would only be better. Unfortunately the game designers minimized the tower defense aspect of Sanctum 2 to the point where I'd rather just go play a first person shooter. Buy the first game instead of this one.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really boring an eye-searing fps/tower defense game. Go get Orcs Must Die! 2 instead and enjoy a game with a hell of a lot more polish and personality.",
            "review_score": "-1"
        },
        {
            "review_text": "Do NOT buy Sanctum 2 if you are playing on a mac! I own a Macbook Pro (Core i7, GeForce 750M) aaand the whole game actually is about graphic bugs and game crashes, but NOTHING else. It took more than ONE hour to play ONE match, because the game crashed about 10 times, and Steam crashed as well. Beyond that, the game shows beautiful lags and some major game breaking bugs (such as one is not able to spend money anymore, for no reason). I guess the game is a good one, a fun one, but NOT ON A MAC. Developers, please do some QA before publishing on new platforms. Actually there are not THAT much mac/macbook configurations to be tested, so please test them and patch this game. Sorry, but I simply can not recommend a game, that is just about bugs and crashes - btw my ingame graphics are PINK since the second start of the game. And NO, my macbook is not broken or something. The game is. Sorry. No recommendation.",
            "review_score": "-1"
        },
        {
            "review_text": "Console specific design choices and technical problems make the game a chore to play on PC.",
            "review_score": "-1"
        },
        {
            "review_text": "I like everything about this game except for the fact that changing the graphics settings 'may have unforseen consequences' aka make the game UNPLAYABLE.",
            "review_score": "-1"
        },
        {
            "review_text": "I hated it.",
            "review_score": "-1"
        },
        {
            "review_text": "I and my friends loved sanctum1 and for us, this game seemed like a no brainer purchase. Over a year later I come back to see if they fixed any of the grievances people had on launch and it looks like they haven't really done much since on day one, one of the devs was flaming people and telling them 'Just go play Sanctum 1 then.' This game isn't horrible, but compared to what it could have been it is just a big disappointment. The dev team fell victim to a common mistake in gaming where they get rid of old (good) features and add some new ones instead. IMO they could've had both. Whereas the first game could easily be given an 8/10 by me, this one sits at a 7/10. So why the negative? Because the developers made it clear on day one that they'd rather you go play Santcum 1 than spend your money on this second-rate sequel.",
            "review_score": "-1"
        },
        {
            "review_text": "Lots of fun and replayability, but crashes way too often. At least in Linux, this game crashes too often to be playable. Multi-player is an especially huge letdown because you will randomly crash out while leaving your buddies to fend without you. This seems like the most common issue on the forum, and may not even be confined to just Linux.   If it weren't for the crashes, I would recommend it heartily.",
            "review_score": "-1"
        },
        {
            "review_text": "Single player was fun. The idea behind the game is great... Tower defense AND FPS? Sign me up!  Multiplayer ruined it for me. More time was spent trying to fix people's destroying what I set up than fighting stuff. Someone steals my tower? Wait until the countdown for the next wave, steal a crucial piece of the defensive blocks and then leave the lobby (or stick around to watch the chaos).",
            "review_score": "-1"
        },
        {
            "review_text": "It's a fun game. But it doesn't remain fun for long.  After a while, it feels like it's just the same thing over and over. No character advancement or anything. Similar enemies, similar strategies.  Wait for a discount!",
            "review_score": "-1"
        }
    ]
}