{
    "app_id": 21100,
    "name": "F.E.A.R. 3",
    "release_date": "2011-06-21",
    "developer": [
        "Day 1 Studios"
    ],
    "publisher": [
        "Warner Bros. Interactive Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Horror",
        "Co-op"
    ],
    "achievements": 50,
    "positive_ratings": 5349,
    "negative_ratings": 2030,
    "price": 12.99,
    "description": "F.E.A.R. 3 delivers all the hallmarks that define the F.E.A.R. brand: terrifying paranormal experience, frenetic combat and a dramatic storyline.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/21100/header.jpg?t=1461103386",
    "minimum_requirements": "OS: Windows XP Processor: Intel Core 2 Duo 2.4Ghz, AMD Athlon X2 4800+ Drive Space: 4.4GB RAM: 2GB Video Card: NVIDIA 8800 GT 512MB RAM, ATI 3850HD 512Mb RAM or better DirectX®: 9.0c",
    "recommended_requirements": "OS: Windows 7 Processor: Intel Core 2 Duo 2.93Ghz+, Intel quad core 2.66Ghz+, AMD Phenom II X2 550, 3.1Ghz+ Drive Space: 10.0GB RAM: 4GB Video Card: NVIDIA 9800 GTX+ 512MB RAM, ATI 5750HD 512Mb RAM or better DirectX®: 11",
    "reviews": [
        {
            "review_text": "FEAR 3 represents what is wrong with many 'modernization' processes of games. It takes everything that people liked about the first few games in the series and just replaces or modifies them to work with current trends, such as in this case regenerating health, co-op, perks... However, I would also argue FEAR 3 is not a bad game. If you're looking for a game akin to FEAR 1 or 2, this unfortunately is not it. It also is pretty lacking in the horror department. It's not scary, or even really atmospheric, though it attempts to be. What it is though, is a pretty fun multiplayer experience.  The story will probably ♥♥♥♥-off long-time fans. Without going too deep into spoilers, the story basically focuses mostly on Fettel, the antagonist from the first game. The story's already kind of in a mess from the get-go, as we have things from psychic powers, clones, the fact our two main characters are the sons of the series main antagonist Alma, and just other plot elements that just scream they're so bad. But it's not badly written to be fair, and if you kind of turn off your brain it's kind of stupid entertainment. But you really shouldn't be playing this game for the story.  The campaign should last for about 5-7 hours, with some highs and lows, but that in no way compares to the previous two games. The co-op helps make it a bit more fun, for better or worse. The two brothers play completely differently though, with Pointman basically being your typical action hero with the guns and the slide-kicks, and Fettel being actually surprisingly rather fresh, being a psychic man who can levitate enemies, possess them, shoot energy blasts, and more. Honestly, both are pretty fun, but I have to hand it to Fettel as for a game with very little inspiration behind it, his gameplay is actually rather original for this sort of game and fun.  But it's not the campaign you should be buying FEAR 3 for, as weird as that might sound. I find most people never delve into the multiplayer modes in this game. And it's sensible, as the campaign is disappointing and usually multiplayer modes are tagged on without much thought or effort, so it's probably nothing special, right?  Well, that's wrong, as it turns out the multiplayer modes in this game are actually the best part of the game.  I can't even count how many friends who got FEAR 3 that ended up loving the multiplayer modes and hating the campaign. Let me explain; The campaign lacks tension, and often is a bit repetitive, on-top of the fact it just feels rather uninspired most of the time, its horror elements fail, and its action sequences aren't particularly great. But something FEAR 3 does surprisingly well is understand the fun elements of multiplayer shooters. Hell, some of the multiplayer modes are even far more tense and more horror-like than anything in the campaign.  Multiplayer is split into four modes, and all four are pretty fun for up to four-players either locally or online. Each mode has different maps. One mode has you all as ghost phantoms who possess bodies and try to kill other enemies and your friends to collect souls, most souls at the end of a wave wins the round, and at the end of all waves, person with the most rounds won wins. Another mode has you in an open arena with multiple areas to station yourself in as you and friends fight hordes of enemies that come in waves, boarding up windows and between waves going out to collect supplies. It's a sort of rip-off of Zombie mode from CoD, but it has some interesting twists, such as Alma, who you should not look at as she'll cause randomized effects against you, ranging from just downing you to making you see your friends as enemies, making the screen go black, or teleporting you to another random point on the map. Or a fog, that gets thicker and thicker as the waves go on, and an unseen red-light monster lurks in the deeper parts of the fog... And in yet another mode, you and up to three friends run away from a giant wall of death. Really challenging, frantic, tense, panic-worthy, but a lot of fun as a lot of enemies get tossed your way and you only get small breathers to quickly recollect supplies before the wall is out it again. A race from death and survival that is both primal but also strategic and fun.  The game also looks pretty good, and the PC port is well-done. Music works, but nothing outside of the credits song sticks as being particularly memorable.  FEAR 3 is against most everything the FEAR series stands for, but if you can look over that and a disappointing campaign, I guarantee you there's some multiplayer fun here that may be worth experiencing.",
            "review_score": "1"
        },
        {
            "review_text": "Remember F.E.A.R. when it first came out and you wanted to play it even though your system couldn't even handle it? Perhaps, that was not the case for you, but it was for me. Eventually, I was able to run it with decent hardware and I never looked back.  F.E.A.R. stepped into the seen in slow-mo and then it took the first-person shooter genre by storm, tailored to shooter and survival-horror fans. F.E.A.R. 3, while the weaker follow-up to the F.E.A.R. series still holds up as an atmospheric game with solid gunplay and an interestingly shocking ending like its predecessor. Some may complain that the formula is becoming boring and stale, but it is still a perfectly decent addition to the franchise.  As a fan of the Dead Space series, I found F.E.A.R. 3 to have a commanding presence when it comes to atmosphere. I would argue that F.E.A.R. 3 nails the atmosphere and overall eerie-filled environments better than Dead Space 3. The attentional to detail is more adequate in some areas than others, but it has enough going in that department to earn a ribbon.   The gunplay is rock-solid, which makes gameplay worthwhile. Along with the cover system that lets you peek while in cover, quickly lean to the opposite side and aim, it nails the cover-system just right. For those that are looking for a more conventional F.E.A.R. 3 tactic and approach to gameplay, it is still all there and nothing much has changed if you want to use slow-mo and the run-and-gun variety.   Even on the easiest difficulty, F.E.A.R. 3 can present some difficulty spikes. A franchise that basically expects a player to run-and-gun using the slow-mo function, you could be taken down quickly on normal difficulty. It asks you to be tactical while using slow-mo. It is slightly different from F.E.A.R. 1 in that you are not only running into singular rooms, using slow-mo, and unloading. There are plenty of cover usage so you will need to run from one cover to another while using slow-mo. Think of it as a Chinese action film with lots of gun-fighting. It can be quite satisifying at times, but the variation comes in with using cover to get to where you need to go without dying outright. I hear it is a common complaint among the series' fans, but I did not find a major issue with it.  F.E.A.R. 3 is far from great and it is worth noting that it is not spectacular as the original F.E.A.R. Either way, it manages to be a perfectly decent addition to the series without presenting any major quams. It is successful at being a solid first-person shooter with the well-known F.E.A.R. elements. While I cannot comment on the co-operative play because I have no experience in it, F.E.A.R. 3 offers enough there to warrant a purchase on a decent sale.   I paid $5 for it and I thought that it was worth it. I cannot say for sure if it would have been worth $10 though.   It's a rock-solid game to the series. Just do not expect another F.E.A.R. 1 and you will enjoy it for what it offers.   Game on, Elann  Rating: 7 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Summary:  If you are looking for a FPS, buy this.  If you are looking for a F.E.A.R game, don't buy this.   Positive:  -The gameplay mechanics are fluid and crisp.  -Enjoyable combat. -Graphics are amiable for a modern day game. -Cheesy lines from enemies. (I like it). -Will catch you up on the story if you havn't played the first 2 installments (Extraction Point and Perseus Mandate excluded).  Negative:  -The graphics seem a backward step from F.E.A.R 2. -The story is contradictory and dissapointing.  -It tries to be scary and falls short unlike previous installments. -Much easier than past 2 installments by taking on a generic health system (I'M LOOKING AT YOU COD), you recover health instead of trying to scavenge it and armour. -I don't know who thought it would be a good idea to introduce a point based challenge system in order to 'level up'. -'A lot' of reiteration of previous F.E.A.R story points. -Do not understand the Replicas' 'deal' this game. -Alma?",
            "review_score": "-1"
        },
        {
            "review_text": "Even for an avid fan of the series, this was hard to get through. The duck-and-cover nature of the engine is poorly suited to the type of game F.E.A.R. is and the execution was good, but it just didn't fit. Shuffling game studios hurt the franchise more than helped it, and I would much rather play the first game over the second or third. The story becomes a bit farfetched at this point--even by F.E.A.R. standards--and the map design made chokepoints predictable and the levels tedious to get through. The alternate play style of Paxton Fettel didn't add much to the game, and definitely not enough to redeem it.",
            "review_score": "-1"
        },
        {
            "review_text": "F.E.A.R 3 can be considered the worst game in the series and that's something i can agree. This game might be fun playing co-op with a friend but otherwise you will hate the new gameplay style (If you compare to the other games) The story can be good but it's totally ♥♥♥♥ed up in my opinion and i can agree that F.E.A.R 2 was 1000x times better than this. Anyways i hope we can have a another F.E.A.R game that is not bad as this one.",
            "review_score": "-1"
        },
        {
            "review_text": "As an FPS, it's decent. As a F.E.A.R. game, it's garbage. The atmospheric tension and spookiness of the first game is completely gone, favoring more traditional jump and grotesque scares. The long and short of it? The game isn't scary in the slightest. If you're looking for a co-op FPS at a decent price, I'm sure you could get something out of this. If you're a fan of the FEAR series and you're looking for more of what made the first game great, you will be disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "And I thought F.E.A.R. 2 was a good game, this one is even better.  After finishing and enjoying F.E.A.R. 2 I got started on playing F.3.A.R. pretty much straightaway and I was at first not as impressed with the game compared to the previous one. Just a couple of silly things like how they changed the combat and removed health packs and armour but I soon got used to using the radial red/blood onscreen to know when to hide and when to push forward into combat. The story with this one was really, really good and the cutscenes were superbly done. I would've said this game was about as good as 2 but no better, that was until I completed the game as Pointman and unlocked Fettel. Oh boy. Playing as Fettel elevated this game above F.E.A.R. 2 instantly. I played it through to completion again with Fettel and it didn't feel stale in any way because Fettel is just the most ridiculous fun you can have in a game. I can't use any more superlatives and you should probably buy this series of games and enjoy them.  I recommend this game more than I recommended 2 in my review for that. Massive fun on both play throughs but the Fettel one is best. Get this game!",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R. 3 is a First Person Horror Shooter.  It continues the story line of F.E.A.R. 1 and 2 but here you are again the protagonist from the first game. The Point Man, one of Almas childs. And actually you can play 2 characters, the other one being Paxton Fettel, the other son of Alma, but only when you have finished the game once. There are 2 different endings. The first, which is probably the 'real' ending is the good one of the Point Man and the other one is the Evil end of Paxton Fettel.  The Story itself is easy explained. You have to reach Alma because she is giving birth to her new child. But this is a hard and stony way especially because you have to escape from a prison first but because both brothers working together it works. Working together more or less. But beside you are hunted by your bad memories of your childhood which feature Harlan Wade, the 'father' of Alma. Saying father is this case is an insult because he is a real ****, well you know what I mean. You have to forget your memories of Harlan Wade.  On your way you pass many levels and especially different ones! No level looks the same and this is actually what was really amazing! Never saw so much variety and nice design in the levels. Pretty much the best from all F.E.A.R. games but this is probably the only aspect thats better compared to other games, sadly. The game implemented a new Health system what I like to call CoD illness. Really annoying and I missed the Medipacks and armor. It wasnt that bad after all but seriously, why did you have to add this feature to a F.E.A.R. game? There is also a new level system which I like to call CoD level illness. You get XP for getting Kill rewards or collecting things. Never liked it but to be honest its not that bad implemented here. With 'ranking' up you also get new Skills or upgrades. While playing this game I noticed that this game is pretty much build up for Multiplayer or Coop. Annoyed me a bit to be honest, I hate games where Singleplayer campaigns doesnt feel like Singleplayer campaigns. For me this game was a little bit difficult sometimes, I played on Normal difficulty. But this difficulty was more because of the damn bloodscreen. I hate this and it makes the game hectic. The scare level is a little bit less I have to say but there were still some nice level parts which scared me. Not as many as before though. You are not hunted by Alma in this game anyway. Alma got nearly friendly, I really like how the developers changed Alma. For me she was never that evil anyway, I even liked her. She had just a bad history.  [SPOILER!] (I try to let them out but in this case I have to say it because its a bad thing for me about the game) But what really made me sad is the fact that Alma dies in the end anyway, why letting the main character die like this? If you play the game you know what I mean. A really stupid and wasted death for Alma. I hope her child can offer us a similar experience in F.E.A.R. 4, if it will be ever released. Cant tell actually. Maybe this was the final game. Also Becket dies in a poor and questionable way... WHY? This didnt even make any sense. Especially how they made Becket. I mean the 1-2 minutes he actually appears in a cutscene. Yeah, the character was silent in F.E.A.R. 2 but here they just made him like a poor ♥♥♥♥♥♥♥ which wants to end his miserable life. Couldnt they make something more interesting like he teamed up with Alma or something? Its his child after all... Bad decision. They could have made the story so much better.  The graphics of the game are ok but nothing special. Similar to F.E.A.R. 2s graphics.  It has to be said that this game was developed by another studio, not Monolith. Monolith just provided some help. The main developer was Day 1 Studios. Noticeable concerning the changes but wasnt that bad for a indie sort of developer.  I had time to play the campaign in coop with my girlfriend. It was actually a little bit more enjoyable in coop, especially playing with Fettel. First time I played with him and it was a completely different gameplay. You can actually move into enemies bodies and control them. This is only for a limited time though. But you can extend it with collecting their souls after they die. When you are not inside of an enemy you can shoot some sort of projectiles from your hand. You can also grab your enemies from far away. I actually had quite some fun playing in Coop. In the end there is a comparison of the statistics of both players and who actually wins the playthrough. This characters ending is played then. I personally felt like Fettel was more powerful than the Pointman. Unbalanced maybe, no clue. This is where the game actually proper shines in my opinion. And this is actually the only reason for me to replay it sometimes... Never the less, Singleplayer is just mediocre.  Postitive: - Nice variety of environments in levels - Solid shooter gameplay, little bit similar to F.E.A.R. 2s. - Some scares, not as many as before - Good Coop - Fettel is a interesting gameplay character  Negative: - Too... Much... CoD... - Levels/Ranks useless beside of Coop - Questionable story decisions - Singleplayer is kinda boring, made for Coop... - 5 Hour campaign - Graphics outdated (2011) - Soundtrack is different and worse - Probably the last F.E.A.R. ever... F.E.A.R. Online just made it worse.  Replayability: Only for Coop  Well, thats everything that needs to be said I think. F.E.A.R. 3 was a good game for me but with a little bitter taste, especially at the end. It didnt feel like a proper F.E.A.R. anymore. Only replayable for Coop. The story is actually kind of disappointing. The devs totally wasted a lot of potencial here. Why did Monolith give this game away to another developer? Seriously? Actually I feel like they killed the franchise with this action. Or maybe it was WB who wanted to milk the franchise to death? I hope you take responsibility for this Monolith or WB. This is how you NOT do it. Well, the devs of F.E.A.R. 3 still did somewhat a solid job, even if the end product is far away from the quality of the first 2 F.E.A.R.s.  My rating would be 6.5/10 points. The other games, except the addons/dlcs got always better ratings. I think this is a fair score and I cant give more without feeling to overrate it.",
            "review_score": "1"
        },
        {
            "review_text": "I think this is a very bad game. It is very repetitive, the story is lame, the graphics are mediocre, and the gameplay is just really bad in comparison to the first F.E.A.R. game. It was hardly even fun in coop. I would not recommend this game to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "This game showed me true horror - because someone incompetent inheriting a great franchise and turning it into... THIS, now that's what I call terror.  Nothing to do with F.E.A.R. series. It's a budget-tier mix of CoD and Painkiller. No atmosphere, no suspense, 2 weapons limit, so corridor-ish it's not even funny. Shooting itself was always a strong point of F.E.A.R., here it feels bland and unsatisfying. There's the autoregen instead of hitpoints, which I could tolerate if this wasn't supposed to be a horror game. Also someone thought it needs some Cool&amp;Hip (tm) pseudo RPG elements, so you gain points for stuff like picking up ammo and recieve bonuses, i.e. a bigger ammo limit.  I really warn you against this game, there are indie shooters much better than this 'blockbuster'.",
            "review_score": "-1"
        },
        {
            "review_text": "Initially I was severly disappointed. Now that I have finished the game I find that I enjoyed it but it could have been so much more. This should have been an awesome trilogy ending game. Instead it was an average FPS with a little paranormal thrown in riding on the coat tails of past titles of the same series.",
            "review_score": "1"
        },
        {
            "review_text": "So after having played every fear game back to back I have to say that this game is an exterme let down. The story is disjointed, sloppy, and unintresting compared to the other fear games while also lacking the atmosphere that the previous games had. The only positive thing about this game is that it looks decent and the controls aren't bad other than that it's a generic FPS with nothing going for it.",
            "review_score": "-1"
        },
        {
            "review_text": "I have played the F.E.A.R. trilogy on the Xbox 360, as well as the PC. (However I have yet to finish this one yet on the PC). So here is how I feel about this game.  As a shooters, is a fun game. The gun mechanics feel nice. The guns themselves feel nice. Hell, if you have a good PC running this at max settings, they look gorgeous. And I like the co-op-slash-competitive mode this game does. Whoever gets the highest score, becomes the 'favorite' son to Alma. And you also level up in this game which increase stuff like ammo capacity, slo-mo, and whatever else.  However, as a F.E.A.R. game, it is terrible. And that's why I don't recommend this for F.E.A.R. fans. F.E.A.R. 3 is the weakest installment of the series, lacking everything that made the first two great. Even F.E.A.R. 2, however others feel about it, was still faithful to the first one than this. The developers have essentionally made this as Call of Duty: Psychic Warfare.  First, you are now relying on auto regen for your, now apparently low health bar. You used to be tough in previous installments, and need to find health kits to restore your health. Which was one of the things I have liked about this series. Now you can't even step out of cover without needing to GET BACK INTO cover after getting hit with a few bullets. (I'm exaggerating here, but the point is, they have basically nerfed your HP.)  (Edit: I want to add really quick that I am playing this on normal difficutly. In case you're wondering if I was playing it in hard mode.)  Secondly, the fear isn't there anymore. The game used to get you spooked with it's atmosphere. As supposed to the cheap jump scares studios typically do. (Which, there are some in previous installments, but they weren't heavily reliant.) Oh yeah, speaking of which, this one doesn't even have that. The atmosphere is gone. Now is just another generic first person shooter.  Now, in case you're thinking, 'But what about the slo-mo? F.E.A.R. is known for that?' So were Max Payne and True Crime. Doesn't mean anything if the game itself is still bad, does it? Yeah, it's there, but it's not like it saved this game.  So overall, this is a disappointing installment. And this is after I said that it's a fun game. Perhaps if this was a different game, like say, a sequel to Blacklight, (Not counting Blacklight: Retribution) I could have given this a more positive review. Because it is a fun shooter. Generic or otherwise.  If you're still thinking about buying this to see for yourself, I say wait for a steam sale, or, if you still have an Xbox 360 or PS3, see if you can find a copy for cheap. They should be around $10 or less by now.",
            "review_score": "-1"
        },
        {
            "review_text": "I Fall in Love With This Game &lt;3 &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "At first you think this game is an all-round progression from FEAR 2. Everything seems mechanically better, graphics and realism have both stepped up a notch. It soon becomes apparent, though, that the story really is getting old - it just lacks mystery and suspense.   To make matters worse, the game seems to have completely missed the mark on the horror side. It tries to scare, but just doesn't. Towards the end of the game you start to get tired of boring story sequences interrupting the action!   So what are you left with? Well, a good urban warfare shooter, albeit a little short. It still comes highly recommended, but I'm afraid that if you have expectations for this game being a 'horror', you will feel let down. It's still one of the few true coop games around, and the coop is a great deal of fun, so it deserves recommendation on that fact alone. Just don't pay too much for it!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly not a bad game at all, had loads of fun playing it.  Thanks to the slow down time shotting aim thingy.",
            "review_score": "1"
        },
        {
            "review_text": "Coop is fun. ~Short But fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very, great fear game! like ok it may not be as scary as the 2 other games or it may not be as long as the two other games. But, it still is great and the story is very great too and the gameplay is very fun too! and the challenges in the game make. The, game look fun too! like I really enjoy this game and also I really hope there will be a fear 4!",
            "review_score": "1"
        },
        {
            "review_text": "It's allways disappointing when the sequel to a good game with good potentials get only worse per sequel. FEAR is one of those games. Stick to the memory of the first, and maybe even the second, but stay away from this thirth game",
            "review_score": "-1"
        },
        {
            "review_text": "an awfull ending of a great series",
            "review_score": "-1"
        },
        {
            "review_text": "The mysteria in the Almaverse comes to epic conclusions, will the pointman and fettel reach alma before the company lackeys do?, will the world end in a blistering nightmare of epic terror?, will you jump out of the chair? Alma is behind you! F.3.A.R the end  ...or? ",
            "review_score": "1"
        },
        {
            "review_text": "COD with more gore and an intrusive arcade style scoring system.  Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "Real fun in Co-op. Action's good, plot not really memorable. Challenge system is fun. Not a real horror game. If you are a fan of F.E.A.R. and want closure, you might get disappointed. If you want to have fun with a buddy with two some-what unique characters, I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Definately a Fear game with a twist. Think of Previous Fear releases, then think power, think betrayal, think revenge, think Oh am I whats Scary now. Listen anyone on my list likes what I like and or has similar Beefs with games on the line. Buy this because I said so. You won't be betrayed. Strong online Co-Op up to challlenge to!!",
            "review_score": "1"
        },
        {
            "review_text": "id give this game a 3.5/5 it was a fun game to play",
            "review_score": "1"
        },
        {
            "review_text": "Compared with previous titles, FEAR 3 goes totally off the rails with the supernatural aspects of the story, and that's saying something considering the literal ghost ♥♥♥♥ that occurs in FEAR 2.  Pretty fun game to co-op, but I wouldn't recommend it if you're going in alone.",
            "review_score": "1"
        },
        {
            "review_text": "nice game recommended !",
            "review_score": "1"
        },
        {
            "review_text": "The game is so focusing too much on action and dosen't scary at all.",
            "review_score": "-1"
        },
        {
            "review_text": "And alas we come full circle with the F.E.A.R series with F.E.A.R 3 or F.3.A.R if you're a fan of bad names. F.E.A.R 3 contructs its campaign to be a co-op based afair compared to the other games in the series, so it's best you play it with a buddy as I did. Gameplay remains much the same if you play as Pointman complete with slo-mo gunfighting and all. Fettell on the other hand is the more interesting character to play as he has some neat abilities like possession and suspending enemies. Story is pretty bare bones even for a F.E.A.R game with no really interesting character interactions except the dialogue between the brothers occasionally. The biggest flaw however is that the game is criminally short, like 4 hours total to beat all 8 intervals. Also the horror has taken a further backseat with the introduction of co-op. Overall whilst F.E.A.R 3 isn't a bad game, it's actually a fun co-op game to play with a friend, it's a bad F.E.A.R game compared to the others in the series.",
            "review_score": "1"
        },
        {
            "review_text": "Here's the deal, F.E.A.R. 3 is nothing like the other two entires. Remotely. It is a Call-of-Dutified entry to the series which has its fair share of 'F.E.A.R. moments', though at a caveat, being delivered with a horribly inconsistent difficulty and a tedious combat system. As far as its story goes, it is passable, with none of the bells and whistles of the original two games with their expansive 'voicemail messages' (F.E.A.R.) and 'intel documents' (F.E.A.R. 2). Ending = crap. Also to be noted is the increasingly nauseating gore-factor, which is not for the weak of heart (or stomach). The graphics are pretty average, the sound effects atmospheric, though interrupted consistently by the in-game achievements (terribly, terribly integrated). That's right, the constantly popping achievements (in-game, not Steam) are one of my greatest gripes, as it really draws from the experience, as you could imagine, though thankfuly, this is not too much of an experience to be missed.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "It may be a mediocre entry to the series, but it has enough to make it stand out from your typical First-Person Shooters of today. I personally liked it and if you're in the mood of something different, you should keep this on your radar.",
            "review_score": "1"
        },
        {
            "review_text": "There's a good first person shooter to be had, but it lacks the fire and innovation of the predecessor.",
            "review_score": "1"
        },
        {
            "review_text": "Best Horror Shooter Game! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "FEAR 3 seems to get a rough review from PC players as opposed to the generally positive reviews from the press, which is sometimes the case. I personally enjoy FEAR 3 and love the series.   Yes this game is very different from FEAR 1, no med packs, armor... you have regen health and so on. I was not a fan of the cover system in this game, nor holding 'e' to open items and such. This said those issues are minor complaints for this game. The graphics, granted are not state of the art but I loved the atmosphere and style. It is bloody for sure, not a whole lot of scares but some good scenery and interesting locales. The sound and music were awesome, I really enjoyed the soundtrack for this game.   FEAR 3 brings to the table co-op and mutiplayer. I have played several rounds of the off line multiplayer mode which is similar to wave style format and though it was clever and well done. There are different modes to the multiplayer which mix it up. FEAR 3 was a fantastic purchase at $5 back in the summer I have no regrets. ...Did I mention you get to play as Fettel - how cool is that?, you unlock him after each interval is cleared with 'Point Man'. ✓Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I hate big robot. 8/10 will throw the keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "Good coop. not as spoggy as the first 2 and the controls are call of duty. other than that it's good.",
            "review_score": "1"
        },
        {
            "review_text": "Why the ♥♥♥♥ is this garbage even part of the FEAR franchise? 0/10 wow really bad.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a shame FEAR 3 didn't sell. But I understand why. I'm a huge fan of the original FEAR developed by Monolith Productions, but its expansion packs developed by Timegate were not very good. Then FEAR 2 was lackluster, and Monolith made that one themselves! When FEAR 3 was announced as a Day One Studios title, we all sort of wrote it off. But it's the best pure FPS of 2011.  Part 1 opted for J-Horror stylings. FEAR 3 doesn't attempt to be scary and fail. It just doesn't attempt. This is fine, because the thing I like about FEAR was its gunplay. The guns, the quite competent enemy squad AI, the slow motion effects. FEAR 3 brings this all back to form (2 felt a bit too 'console-y') with two additions. The cover system is thankfully quite non-intrusive and doesn't reduce the game to 'whack-a-mole' a la Gears of War. Co-op play is where it's at. In fact, the game is built for it. Don't play any other way or you may find it impossible. Note: the 2nd player has slightly superior powers.",
            "review_score": "1"
        },
        {
            "review_text": "at the end when you play as bad guy he eats placenta. is that like a fetish?  10/10",
            "review_score": "1"
        },
        {
            "review_text": "nice recomended game for sure. normal graphics but it is not for good, expensive computers",
            "review_score": "1"
        },
        {
            "review_text": "On the whole Fear 3 single player mode is about 7/10. But Co-op in this game was suprisingly enjoyable. The powers available between the 2 characters make for a diffrent gameplay experience, which adds a unique flavor to the fps genre. There is also a simple but satifying acheivement based level up system. This is one game that does achievments and hidden items damn near perfectly, mostly 'cause it always give you points towards increasing your chracters abilities. Add in interesting if convluted story (Fear 2:( ), great atmosphere and a minor competetive element and this is one of the best coop experiences of the year. Grab a friend and play 9/10 (co-op)",
            "review_score": "1"
        },
        {
            "review_text": "Nice story.. not scary so that's a - ;(   It's a ok game but i woundnt both it if it wasn't on Sale",
            "review_score": "-1"
        },
        {
            "review_text": "Call of Duty with another name.",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game very much because it's a horror game and you can play with your friend in campaign.The multiplayer it's very nice! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I screamed and slapped my keyboard when I played this game, what will you do?",
            "review_score": "1"
        },
        {
            "review_text": "♥ Diverse levels.  I'm not one to mind repeating levels/maps in games however it's clear that they put effort into the design of Fear's world. I quite liked how each chapter was a change from the last...you explore a variety of buildings and are put into a number of situations, instead of facing the same boss over and over again, or being forced into a series of mazes.   Diversity in its design is a strong virtue of Fear 3.   ♥ Made me jump.  Though Fear 3 isn't nearly as scary as the past titles, it did have several spooky moments in it. Granted I'm a total scaredy cat yet who wouldn't jump at an angry little girl leaping at them while they're climbing up a ladder? ; _ ;   ♥ Enjoyable co-op.  Whenever someone has wanted to play a co-op game with me, I used to always suggest playing Fear 3 together. Why? For one the co-op is balanced, a fact that I appreciate. Unlike other games it has both players doing equal amount of work and requires teamwork without going overboard.  For another, I liked how the average time to beat the game, at least for my friends and I, was around 8 to 12 hours. I liked having a game to invest time into without having to play it week after week with someone. I understand others have found the main story lacking time wise yet this was never a problem for me.  In case you're bored or finish the main storyline, there are four, multiplayer, mini games to play. Very fun!   ✘ The story IS lacking.   I can understand people who value games by looking at all aspects - the sound, the story, the graphics, etc. I can also understand people who have the view of looking for one thing, excellent graphics, beautiful music, and the like above all else. For me what matters most is the story of a game.   Compared to the other Fear titles, I agree that Fear 3 is lacking in its story. They could have taken it so much farther than they did - I found the relationship between the two main characters was filled with possibility that they seemed to purposely shove aside. I don't believe we need to be pirvy to every aspect of a character, however they made them seem like cardboard cut outs, instead of real...Humans, ghosts, aliens, there was no difference for they all acted flat and emotionally frigid.   Not once when I've replayed Fear 3 have I ever felt a connection to any of them nor have I felt pulled in by the story. As scary as I found the first Fear to be, it DID pull me into the story and the world of Alma. The dev team had so much they could have worked with backstory wise, relationships between characters, etc. and used none of it. I'll stick to fanfiction to get an emotional high... ' - '   ✘ Very hard to play with motion sickness.  As my motion sickness has gotten worse, I've had to give up playing many games, Fear 3 among them. Despite its flaws, I have always enjoyed the game, and would replay it every few months. If anyone suffering from motion sickness is thinking about buying it, I would strongly advice you to think twice, for the game isn't kind to those who suffer from it!   ✘ I think the main reason people are let down with Fear 3 is when they buy it thinking it's going to be a horror game. Does it have jump scares? Yes. Is it spooky? To me it is. However unlike the others in the series, I consider Fear 3 a shooter/survival game more than anything. It's wonderful if you're looking for a co-op game, no fault there, but as a horror game? Not so much. Still it might give you a spook or two!  Overall if you're looking for a co-op game, Fear 3 would make a wonderful choice. If you're considering it from the aspect of loving the Fear series, I'd skip it.   ",
            "review_score": "1"
        },
        {
            "review_text": "Short as hell. Intense as hell. Bloody as hell. Little dead  japanese  hellish girl. 2 playable characters with different playstyle. What else do you need for a few evenings?",
            "review_score": "1"
        },
        {
            "review_text": "An absolute joke of a horror game, and that's coming from me.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game!",
            "review_score": "1"
        },
        {
            "review_text": "Sure they messed up the whole storyline, but it's a good game I gotta admin.",
            "review_score": "1"
        },
        {
            "review_text": "demon girl make a baby out vagooga",
            "review_score": "1"
        },
        {
            "review_text": "Actually, this game sucks in a lot of ways, but I had a blast playing co-op with my friend :D",
            "review_score": "1"
        },
        {
            "review_text": "I bought it years ago and never got very far in it.  The only thing it has in common with previous FEAR titles....is the title and characters.  Just terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been meaning to complete the FEAR anthology for some time now having played the original FEAR some years ago, so when they came on sale for the anthology I couldn't resist. I'll admit I've played (approximately) half of the original FEAR, and completed FEAR 3, so I will only reveal story information without ending spoilers pertaining to FEAR 3.  You start out nine months after the ending of the first two games, captured protagonist known as the point man held in south america works to escape with the assistance of Paxton Fettel after interrogation. Brothers in arms Point Man who is the Wolverine-like protagonist and Paxton a spectre. During their escape, they discover that they are being hunted along with their mother, Alma. The creature seeking to kill the family was created based on the evil memories of the mother, and this evil has formed a strange paranoia over Fairport. In order to restore the balance, the brothers set out to destroy any memories associated to the past to weaken the monster hunting them.  The game sets a good base story and introduces a very cool horror element. There was some supernatural element introduced that didn't really fit but the actual horror side of the supernatural was a perfect buttery fit and it got a couple of good jumps from me. The story is particularly hard to follow until you get three quarters in but once you get there the story and gameplay make much more sense and the game goes from being somewhat random to making sense.  After completing all but the last few chapters, the game really picks up and becomes a lot more fun. The horror elements in the last chapter were the highlight as the story became very clear in this chapter and it really felt like an action horror where as the rest of the game was scattered between action and horror but never the two. The game is short, sweet, but it's also lacking in story and fun comparring to its original - of which I recall having a lot of fun in my youth. I have heard from a lot of people complaining that this game fell short of its original, I can agree and understand, but there's no denying you'll have fun in this game because you will.  I feel it more of a casual game due to the points system, it feels like it was created for its points system and not its story. Yje lack of story in the beginning, the point system and its linearity all contribute to the downgrade of this games reception to me. It does become repetitive when all you need to do is shoot until everybody is dead, move into next section and repeat the entire game. I have an issue with that, but there's no real interaction or immersive features.  It's a solid game and it runs well on old technology. Getting a jump or two makes you smile, and the whole composure results in a great story and a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I played FEAR 1 and 2 several times, but have not completed this one even once. Graphcs and controls are ok, the game is just not a lot of fun otherwise.",
            "review_score": "-1"
        },
        {
            "review_text": "F.E.A.R 3 is one of those games that takes an old classic game and tries to transform it into a new Battlefield or Call of Duty. I would sum what happens in F.E.A.R 3, but the story is so forgettable that I can't remember what happened in it, and I beat it twice. Apparently the two brothers have to go and stop Alma's baby from being born, but the game throws in a multiple ending that rewards whoever was the 'best brother.' That means A. you need to beat the story mode twice to get all endings or B. Play the whole 6 HOUR story mode in co op.   Gameplay is dumbed down from the last 2 F.E.A.R games. There is a ♥♥♥♥♥♥ cover system, you can only carry 2 guns, health regenerates, and F.E.A.R's top of the line AI has been reduced to standard FPS AI.  The worst part is that the game isn't scary. F.E.A.R 2 wasn't all that scary, but it had great gameplay to make up for it. F.E.A.R 3 has nothing going for it besides a co-op that, once again, doesn't make it scary. I don't know what went through WB's head to get rid of Monolith [Creators of F.E.A.R] and replace them with some unknown studio that never heard of F.E.A.R.   If you really love the F.E.A.R games like me, just make up in your head what happens in the story, it would probably be better than what they came up with.  Also F.3.A.R... really guys?   ",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game i ever played in my life. Horrible single player , bad co-op , horrible storyline, awful atmosphere ( not even scary , everthing is just so annoying ). Never buy this game , unless you love copro. In russian i can say that я ебал мамку создателя этой игры.",
            "review_score": "-1"
        },
        {
            "review_text": "this is a awesome shooter.great story graphics are pretty good game runs flawless.a real challenge.tons of action,solid game 8 out of 10.you know how some games try to freak you out.fear games dont try they do, over and over.8 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Mostly garbage. Playing as Fettel with Uriah as Point Man was entertaining for $4.00, though. His poledancing has really improved.",
            "review_score": "1"
        },
        {
            "review_text": "this game is ansom",
            "review_score": "1"
        },
        {
            "review_text": "It certainly was a game",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing terror-story games. I played F.E.A.R. when I was a child. When i saw all the F.E.A.R games on sale I just bought it for all the memories I have . Then I decided to play it and,no words can describe how I felt when I end this amazing trilogy.  Although the first two games don't have such nice graphics, the story is fantastic! You are always hoping to know what is going to happen but when you play the campaign and you read all those notes ,all those voice messages is the time you realise you know nothing. In addition , in F.3.A.R. there's a cooperative mode too!! and you can play as both brothers in the campaign.  Just like I 've told you before,AMAZING games!!!! If you see these games on sale,BUY THEM!!. On the whole, amazing story, characters and frights. 9.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Gave up. This is what I think many think Half Life 3 would have been, and why many didn't want it(HL3). No love has gone into this. The backgrounds are almost incomplete - hastily drawn, and repetition is rife. The gameplay is also repetitive, waves of enemies, and with the usual controlled linearity and lack of exploration opportunities. Pity.",
            "review_score": "-1"
        },
        {
            "review_text": "Hey this is my review!  The game isn't that scary to be honest. i think the older versions were alot more scarier. You have to fight more against marines/soldiers then scary stuff. There is blood, dead bodies, scary area's but it's not like 'waaa, i need a break from the game'  i only were playing this game in midnight aswell. and not during the day. there are challenges and different weapons, MULTIPLE Hidden collectables and the thing what annoys me too much is this. That you can't travel back to some locations, and sometimes it is very difficult to know if u have to move on to this area or this is a dead end.  What i do like, is that the enemy says to their team mate, where and which object u are hiding at. If you buy this game for horror, you will not expect much or get scared much, unless this will be ur first horror game ever.   Fear 1 is still the best one. Fear 2 is meh. just wtf robots? really? fear 3 is ok.  you do can play this with xbox controller.   ill give this 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I just finished F.E.A.R. 2 a couple of days ago and I have seen a remarkable difference between that one to F.E.A.R. 3.  The developer changed from Monolith (who made the first and the second one) to Day 1 Studios.  They cramped the strategic fast paced action from the last ones, changing thing to a mediocre concept.  I played until the 4th stage, always giving a chance to things get better. They didn't. Skip this one and stick with F.E.A.R. 1 and 2 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Different from the rest of the series, this game is short and really fun co-op. Don't buy if you want something like FEAR 2 or 3, but definitely buy if you want something to play with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "Ugh. See my FEAR and FEAR2 reviews for necessary context, but the pros are few and far between here:  1) Even better graphics, but lackluster, repetitive and at times confusing level design.  2) Genuinely bad AI. It also seemed like there was some fairly cheesy enemy spawning going on, and while it was sometimes hard to tell, there is no doubt that the scary-good AI of the original game is gone for good.  3) Gunplay is definitely a serious regression from FEAR and FEAR2. Everything has a very arcadey feel to it now, which is only compounded by the braindead AI and level layouts. Plus, you can only carry two weapons and a small number of grenades, and your health now regenerates. I play games like this INSTEAD of Call of Duty and the like, since they reduce the difficulty and tension pretty drastically for me. Walked into an ambush and are on the verge of death? No problem! Just crouch behind a box for a few seconds, emerge from cover in slow-mo, and faceroll the AI.  4) Achievements. Why are there achievements unlocking in-game, in real time, as I play a story-driven horror FPS? Immersion is critical in games like this, and fewer things take me out of that more than random unlocks for 'X slow-mo kills' or the like popping up on my screen during firefights or scare moments. Too much of this felt like priming players to jump into MP, rather than to enjoy the SP mode.  5) Not at all scary. There are definitely some disturbing and interesting revelations, but many of the plot developments are spoon-fed to the player, rather than being discovered and experienced organically. Even the things that do come about more naturally still felt forced on some level and certainly weren't frightening.  6) The game's final act is a huge disappointment story-wise. Again, I don't want to spoil it verbatim here, but I did not feel that the Point Man's 'good ending'--which I view as the game's intended ending--really made that much sense. We never really understand the mind-state of Alma, and nor is her resolution or the implications of the child ever really made clear. Fettel's 'bad' ending certainly followed more logically, so perhaps its more apocalyptic and nihilistic tenor is truer to the nature of the series overall.  Sadly, this game largely self-destructed where it counts, leading to a rather unenjoyable and ignoble end to what could and should have been a great series. Take a pass and go play the original FEAR again instead.",
            "review_score": "-1"
        },
        {
            "review_text": "The main reason I'm saying go for this game (preferably on sale) is because it gives closure to the story started back in the first F.E.A.R. I remember seeing the commercials on TV for this game and apparently had a misconception about how having Fettel as a secondary character would be. Day 1 did some neat things with the game differently from Monolith, but ultimately I think they fell short of realizing the true potential of the game.   I will say that I did not play the co-op portion at all...mostly because I had no one to play with. That being said, I did complete the single-player mode, and unlocked Fettel on all missions to replay through again. I did start this, but quickly lost interest, as the dialogue and almost everything about the game seemed quite repetitive, except you see cut scenes from Fettel's point of view. I think the game itsefl could have had some awesome variety, as well as some extra gameplay time added for first play-through if the story involved using both characters and switching back and forth depending on the mission or circumstances.  The graphics I thought were much better, the control scheme vastly different, but I got used to it. I do feel the realism factor increased in fighting by using the reddening screen and then letting the Point Man recover (I'm assuming part of his meta/super-humaness involved an accelerated healing factor). Sometimes it gets old searching for health packs.  I can't say I was super happy with the ending, but I wasn't disappointed either. The story seemed to be building up to some amazing climax, but in the end just left me feeling sorry for Alma and wondering if she just wanted someone to be kind to her all along. The cultish aspect of some of the later levels was a little disturbing, but that seemed to be more of where Fettel's character was going as well. There's definitely plenty of blood. Blood on the walls, blood flying from gunshots, knife kills, dripping from bodies and oozing from everyone you meet practically.   I was startled a couple of times....never overly scared...  The variety of antagonists in the game was definitely a little more varied than in F.E.A.R. 2, but I'm guessing because Alma's power was at a max and everyone and everything was being affected more drastically. Some of the goons you fight were more annoying than anything, and I started to get bored with fighting Replica Commanders very quickly.  If it's on sale, then definitely pick it up, but I wouldn't pay $20 for it.",
            "review_score": "1"
        },
        {
            "review_text": "Horrible. Gameplay is rather sluggish, graphics arent too good, and the matchmaking just doesn't want to work like it should do.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like this game I don't understand why people don't like it they just have a bad taste in games I guess",
            "review_score": "1"
        },
        {
            "review_text": "It's a ♥♥♥♥ port of a ♥♥♥♥ game where you bleed out of your eyes after getting shot in the torso  Final score: Bloody screen! So real!/10   buy F.E.A.R. 1 and 2 instead",
            "review_score": "-1"
        },
        {
            "review_text": "★☆☆☆☆  Far far far away from the F.E.A.R. we used to know. Not convincing at all. Not scary at any moment. Very arcade-ish. Fortunately, it's fairly possible to have some 'fun' with friend, playing co-op.",
            "review_score": "-1"
        },
        {
            "review_text": "Frustrating, boring shooter with nothing interesting going for it whatsover.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a bad shooter that barely belongs in the F.E.A.R. storyline. The second game was tolerable and even good at points but this one makes you wonder why you're not just doing anything else instead. The second mission felt like a bad rip-off of the favela fights in a much better FPS game, and the constant pop-ups for minor achievements are incredibly irritating. For what should theoretically be a relatively slow-paced shooter with bouts of action this one misses the mark completely, and it even throws in regenerating health to hammer the point home. It's like the difference between the Pripyat levels in STALKER and in Modern Warfare - despite having similar themes the feel of them is completely different. This feels barely like the second game and nothing at all like the original. After the favela mission I looked at the 'Challenge board' and the 'target time' of the mission and decided that it wasn't worth continuing. If I hadn't gotten the game as part of a cheap bundle I wouldn't have even bothered getting that far. I feel sorry for anyone who paid full price for this.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ game, would probably not play again.",
            "review_score": "-1"
        },
        {
            "review_text": "Despite all the hype, FEAR 3 is your typical first person shooter. It has a good story, but not something I would go back and play often.",
            "review_score": "1"
        },
        {
            "review_text": "Terrible game. Multiplayer is completely broken with frequent disconnects and you are unable to host as paxton fettel, which is just absurd.",
            "review_score": "-1"
        },
        {
            "review_text": "lovely game and good for recommend",
            "review_score": "1"
        },
        {
            "review_text": "lovely game and good for recommend",
            "review_score": "1"
        },
        {
            "review_text": "biggest piece of crap i ever layed my eyes on. no horror, no story deepness (like in the first instalment of the series) and the gameplay is purely aweful.",
            "review_score": "-1"
        },
        {
            "review_text": "Buy the first F.E.A.R. By far the best in series and the expansion packs are worth it as well. A.I. is very impressive. Though F.E.A.R 3 has detoured from it's origins, attempting to go for a Call of Duty feel... It is horrible.",
            "review_score": "-1"
        },
        {
            "review_text": "worth the money :')",
            "review_score": "1"
        },
        {
            "review_text": "the only good thing about this game is the weapon aesthetics, and maybe for the fact it ties up a few lose ends and gives an ending to the series. sadly, this had to be the end of the series. everything in this atrocity is ♥♥♥♥ by ♥♥♥♥ standards. anything you loved about the original F.E.A.R. games, forget it, it isnt in this game. there is not a single scary or even remotely tense moment in this game, just look at the screenshots above. that is about as good as it gets with scare and atmosphere.  the AI is as bland and mediocre as they get, even the Replica forces (who are now somehow allied with ATC???) are easily dispatched and only challenging by the fact they carry weapons that do a good bit of damage, and take a little bit more to kill. all of the genius, god-tier AI from the original game is nonexistent, even F.E.A.R. 2 had better AI.  Paxton's voice, though done by the same actor, is somehow just terrible to listen to in this game, but that may just be me, it sounds like he is trying way too hard to sound bad and it ruins everything. no immersion whatsoever, no health bar, just that ♥♥♥♥♥♥♥♥ regenerating health system which only makes this game EVEN MORE like CoD. thats what this game is. its a very bloody CoD clone. playing as Paxton is actually quite dumb and doesnt make any sense at all. how can he die if he is already dead? hes a ghost and still takes damage and can be killed, and all he does is tickle enemies with a stupid little red ball for 'range' or he can possess enemies for a brief time. not worth it. another crime this game does is it completely ignores the canon that was previously set by the first F.E.A.R. expansions, Extraction Point and Perseus Mandate, meaning that the entirety of the events in those games never happened.  just dont buy this game unless you actually want to see just how bad it is. youtube the cutscenes or something and be happy with that.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is bad, really... I mean, certain headshots do not kill instantly, the game is heavy (the mechanism are so slow, shooting, moving, aiming), it's supposed to be thirilly and scary but is annoying and comic, the effects look like they are made by a kid that learned how to use animations and effects. Really bad",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely awful. They made F.E.A.R. into a co-op cover based regenerating health point scoring ♥♥♥♥fest. Such a quality drop even from 2, which was by no means a passable sequel. Do yourself a favour and just play the first one. Make up your own conclusion to the story, because I'll be willing to bet it won't be as ♥♥♥♥♥♥♥♥ as this one.",
            "review_score": "-1"
        },
        {
            "review_text": "I have it. It's a good horror game , good graphics , fantastic story , but needs more players in multiplayer. You have to choice from two characters: - POINT MAN  - FETTEL  5 STARS FROM 5.",
            "review_score": "1"
        },
        {
            "review_text": "its boring, multiplayer's boring, all boring  i dont feel any fear when i played this game... hope they're not making the same game like this",
            "review_score": "-1"
        },
        {
            "review_text": "Yes, this game is old, but its still totally awesome! You shoot ♥♥♥♥, slow time, have a mentally linked dead brother who saves you from falling buildings! Awesome! Would recommend playing on hard for the most intence gameplay. Would reccomend for any caliber of gamer. Great Buy!",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly competent shooter. However the game is casualized to death by slapping on-screen goal messages with Alma's face, saying I camped for 200 seconds. Multiplayer is dead and as far as co-op go, I haven't really tried it. You can also play as Point Man's psychic brother after you cleared a mission, so there's some replay value. Story was okay, but convoluted like any other 'horror' game. Speaking of horror, the game has no scary moments. Creepy moments, yes, but the game tries too hard at attempting to scare the player. In the end, the game is okay, but is inferior to FEAR 1 and FEAR 2.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "420/69 would play again",
            "review_score": "1"
        },
        {
            "review_text": "I honestly think this game is kind of underrated. The story is pretty complete, the gameplay is varied, with all the different modes.   I suggest playing the story in Co-op your first time, and then playing it again on Insane (The fourth difficulty after you beat the game) reversing roles between Point-Man and Fettel, depending on which one you played your first time, and have a different experience, even though the Then you can play F*cking Run and Contractions, the other Coop modes. And even after THAT you can play Soul King and Soul Survivor, which are the competitive ones.  One thing that does suck, are the graphics, some levels just look generic, in the beginning there's one that looks like you're in Brazil's favelas, but the textures just suck, you can notice it in (for example) some enemies that behave like zombies with melee weapons in their hands.  I'd say it deserves an 8.3 (Yeah, that specific)",
            "review_score": "1"
        },
        {
            "review_text": "It's almost cute how the F.E.A.R. 3 series pretends it's a horror game. Still, pretty fun as a shooter.",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R. represents everything that's great about shooters. While the sequels offer nothing new, they made no mistakes either.",
            "review_score": "1"
        },
        {
            "review_text": "FEAR3 isn't meant to be played Solo. If you have a friend you can CO-OP with this is a brilliant game. I played as Fetal on my play through and the different tactics opened up to me made a very good impression on me.   The Campaign is not long which kind of works as a CO-OP game I think at one stage we will swap over and I'll play Point Man and will be a differen't experience. Between the mechs and the horror mechanics I think this is a solid co-op game but I imagine it would not of been as fun single player.  As Fetal I was able to capture and hold enemies for Point Man to kill, Possess Snipers at the other end of the killzone and then between us take out everyone in the middle. Being bound to Pointman was limmiting but that mechanic made it more interesting like I had to be within range of him to exist.",
            "review_score": "1"
        },
        {
            "review_text": "Still easily one of the best horror shooters ever made. If you love the genre you can't miss this classic (and all the others in the series).",
            "review_score": "1"
        },
        {
            "review_text": "Not too amazing 9/15",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game cause it was in a bundle... If I could sell my ownership on this title for a quarter I'ld be charging too much.",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage. Co op not working and I don't think it ever worked. Terrible fov, no fov slider ingame(you have to change it in game files), but for some reason there are options for controller if you are ♥♥♥♥♥♥♥♥ and want to play with that thing..",
            "review_score": "-1"
        },
        {
            "review_text": "This game is one of the coolest I have played in a long time. High octane action mixed with a horror setting, great multiplayer and co-operative gameplay modes, and of course the awesome weapons and moves we have come to expect from F.E.A.R. Without a doubt the best game in the series yet. A must have for Horror fans, FPS nuts, and returning veterans of the F.E.A.R. franchise.",
            "review_score": "1"
        },
        {
            "review_text": "I wish somebody would take this game away from me",
            "review_score": "-1"
        },
        {
            "review_text": "Great game to play with friends. Though it feels like they pushed the amount of enemies way too quickly. You cant get past 20 minutes of g ameplay without being experienced.",
            "review_score": "1"
        },
        {
            "review_text": "I have a new favourite game! There are games that are good, and then there are games that are better. F.E.A.R. 3 is a quality experience unlike any other and is testament to the series. Tops F.E.A.R. 2, but it can never beat F.E.A.R. 1 ^^ None the less I recommend this game for several reasons, 2 of which are the shear size of the game (multiplayer, co-op, and single player), and the quality of the game. A lot of work was put into this and it shows. If you remotely have any interest in first person shooters then this is money well spent =)",
            "review_score": "1"
        },
        {
            "review_text": "It's mediocre at best. The FEAR story has always been kinda lame in my opinion and this is a snorefest. None of the games have been scary is this is even more so true in FEAR 3. I have yet to play co-op so that might be a little more fun, but after completing it with both brothers, I can say I really only played it because I'm stuck somewhere where I don't have much to do and my good computer isn't with me. If I was home, I'd have probably given up halfway through out of boredom and because there's so many other games to play. If you absolutely must add to your FEAR collection, then don't pay more than 5 bucks for this.",
            "review_score": "-1"
        },
        {
            "review_text": "This is going to sound strange. I'd say this is a decent $10 game that had some serviceable shooting and activatable bullet time, but the atmosphere in some sequences doesn't make up for the usually creepiness and horror that used to be as present. Again I don't think this should be at the top of your list, but this is a decent game to get for $10 and listen to some podcasts alongside.  *Note that I have no experience with the coop. I just played it single player since I needed something to do while listening to my giant list of podcasts.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome!!!",
            "review_score": "1"
        },
        {
            "review_text": "None of the fun of FEAR 1, but with more convulted plot ♥♥♥♥♥♥♥t you do not care about.",
            "review_score": "-1"
        },
        {
            "review_text": "What a piece of ♥♥♥♥. I got this game for free and I still have buyer's remorse. I wish this travesty was off my library... Permanently.",
            "review_score": "-1"
        },
        {
            "review_text": "F.E.A.R. 3? More like Call Of Duty: Ghosts!............ get it?",
            "review_score": "1"
        },
        {
            "review_text": "its a cool game ",
            "review_score": "1"
        },
        {
            "review_text": "It starts well but after the first hour or so it gets incredibly boring. I had to turn off the hammering music which kept playing wild tunes even after i cleared out every enemy in an area and was pain-stakingly looking for the exit. Many good ideas but it really doesn't get close to the first game or the second. It's just a sad ending for a decent game series.  By all means, just play the first game and don't touch this garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "If you liked the first 2 games you probably won't like this one. However if you have a terrible taste in videogames then you would like it.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun little game to play through with a friend. Not too great, but an okay experience nonetheless. It sacrifices all horror elements for the Co-op, so don't expect to be scared a lot.",
            "review_score": "1"
        },
        {
            "review_text": "It's console trash. It looks like garbage. What little story there is is frustrating to acquire. The levels are incredibly linear, and most of the time you are forced into a small room with a bunch of guys just pouring in.  I did not enjoy the time I spent with it, and I'm glad I got to play it from Family Sharing because I would NEVER want to buy this game even on a sale. Complete and total console trash.",
            "review_score": "-1"
        },
        {
            "review_text": "Good Game only downside is only few people play multiplayer",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Fear and Fear 2 I highly dont recommend this game. Yes it has a connection with last 2 Fear games but it basicly a copy of call of duty when it comes to being in action. Plus it too ♥♥♥♥ing short. If you want to get this game be prepared to start ♥♥♥♥♥ing at the makers of this game.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ed up in every ways imaginable, health regen with no medkits, The gameplay is totally different, is more call of duty than fear, cover  system...why?  Consoles have to ruin everything once again",
            "review_score": "-1"
        },
        {
            "review_text": "The storyline in this game dosen't make a whole lot of sense in context with fear 1 and 2. The reveal that Alma is pointman's mother in fear 3 seems to cheapen the scares in fear 1 since you now know she is your mother and dosent want to hurt her own son. It also makes no sense that spooky pants cannibal Paxton Fettel would help pointman all of a sudden after being killed by him in Extraction Point. For the first time ever in a fear game you can only carrry two weapons.. In fear 1 you could carry 3 weapons and in fear 2 you could carry 4. Why regress back to two weapons? You miss out on all the fun guns since the ammo for them is so rare they arnt worth picking up. There are no longer any competitive multiplayer modes like deathmatch or capture the flag, however i'll admit the co-op is a lot of fun. F.3.A.R. isn't a bad game, it's just a bad F.E.A.R. game. Hopefully one day we will get Fear 4 and possibly play as Alma's new baby or another original character.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "How is this scary this is just a Modern Warfare 2m clone",
            "review_score": "-1"
        },
        {
            "review_text": "Perfect Game :)",
            "review_score": "1"
        },
        {
            "review_text": "Fettel wins, scoring sysyem is bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Will write later :)",
            "review_score": "-1"
        },
        {
            "review_text": "it's pretty good",
            "review_score": "1"
        },
        {
            "review_text": "I kid you not: The best part of this game was the end credits song. 'Mother' by Danzig. That's it.",
            "review_score": "-1"
        },
        {
            "review_text": "scared the poop out of me. Just kidding, this game is a shameful sequel to a once sort of good horror series. It's a fun fps with horror elements and a worse story than black ops. Also the multiplayer is underated, albeit limited in variety",
            "review_score": "1"
        },
        {
            "review_text": "It was fun. I enjoyed it. Graphic is good but it is so different from those that we are used to these days. You might find this very awkward but you'll get used to it in no time. The graphic looks kind of like DOS games' graphic back in the 90s but enhanced. Scary episodes are handled very well. They are creepy. This game isn't just about fighting against paranormals but also with high-tech forces which I consider variety. I especially liked the drama. The ending along with accomplishment you'll achieve is very memorable. It is really memorable.   +) Easy Aiming  +) Dramatic story  +) Thrilling battles  +) Handy Map   -) Graphic awkwardness, which in time you'll get used to.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a single-player gem, really good FPS mechanics, great opposition AI, a somewhat incoherent but frightening story. Really quite unsettling and a decent challenge, thoroughly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R. 3 I enjoyed playing the game to a point. The storyline didn’t grab me and draw me back in for more playing time. This game is good for those who are pure shooters and linear players. F.E.A.R. 3 doesn’t ask you to think or plan your stragity and it’s a run/hide and gun game.  Likes: Graphics and game play run well Enough ammo to complete levels. The game does what it advertises Challenging Steam game  Dislikes: Run and gun (that’s just not my thing) Mindless playing Limited weapon choices (nothing new to keep me interested in playing at beginning levels) Same game as before with nothing I see to say WOW&lt; that’s awesome&gt;  Conclusion: The game plays as advertise and runs well. That is really the true review points.  If you like spraying millions of ammo, this games for you. The tactical side is limited so your game style becomes limited to what is allowed. I'm recommending the game for those who like this game play.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty silly and unsubtle but I played it with my wife and it's actually a very good co-op game. You can play the whole main campaign with a friend and each character has unique abilities that compliment each other, encouraging strategic collaboration and communication between partners. Of course it's impossible to have an impactful horror atmosphere when you're spending time with a buddy but if you adjust your expectations accordingly it's a good shooter and action game.  I played the first game but didn't spend significant time with the second, but this was enough to help me appreciate where the story was coming from. That being said, you don't really have to play the previous games and can jump right into this one.  I can't speak to the solo game but I imagine it's not as enjoyable as co-op. Get this and play with a friend for maximum enjoyment. It's one of the better co-op shooters you will find.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! Co-op and Multi-player both very good!",
            "review_score": "1"
        },
        {
            "review_text": "Not scary at all the only thing to 'FEAR' is another ♥♥♥♥♥♥ sequel.",
            "review_score": "-1"
        },
        {
            "review_text": "Pooped my pants. So far pretty dope.",
            "review_score": "1"
        },
        {
            "review_text": "5555 ",
            "review_score": "1"
        },
        {
            "review_text": "Scary but very nice gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome co-op bloody sauce",
            "review_score": "1"
        },
        {
            "review_text": "Game is fun especially with the addition of coop to the F.E.A.R. series, however it is a VERY short game that could be beaten in a single setting assuming you have 3 or 4 hours of free time. The ending which is determined by who has more points at the end of the game whether you played as Point Man or Fettel (assuming you aren't playing single player) is another nice addition turning the friendly coop into a competition. The game dives back into the origin of Alma's two sons and explains what they went through while growing up in a ward and how their abilities were acquired. The multiplayer aspect is subpar but really where this game shines is with the coop. I bought it on sale for $8 and honestly I wouldn't pay more than that for this game. Not saying the game is bad, just saying that for $20, there are better choices to spend your money on.",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R. 3 is a game with an identity crisis. The gunplay is fun, the score attack system is actually pretty engaging, and the asymmetrical co-op is interesting, but it's just not very scary.  It tries to be, doing little spooky bits where Alma just shows up, but there's not too much there. Granted, I'm glad they didn't go 'Jump Scare!' constantly, but there never was a feeling of dread when I was going around like a walking armory.   The campaign itself is laughably short. Which is sad because, again, the feel of the guns are fantastic. Fettel's mode of body-hopping kind of calls for a run-and-gun style that is pretty enjoyable. I didn't check multiplayer, but I tried the horde mode on my own. It's fun since it boils it down to strictly the gunplay, but it would sorely require a friend or two.  Comparing to the original FEAR, it's kind of strange. Once again, you're not too worried about ghosts since you're armed to the teeth, but the use of a fantastic lighting engine and robust AI makes this game look really dull.   I don't know if I'd recommend this to fans of the original, or newcomers to the franchise. After every praise I think of for this game, it follows, 'but it's just not scary.' Certainly don't check this out to get spooked. At the very least I would say if you're looking for an interesting Cooperative game you could do far worse. Otherwise, just go play the first FEAR.",
            "review_score": "-1"
        },
        {
            "review_text": "Removes some of the essential features from previous F.E.A.R. games in favour of contemporary FPS conventions. Amazing visual effects at times, but without a doubt the weakest in the series.",
            "review_score": "-1"
        },
        {
            "review_text": "This one is kinda hard to rate as its both the worst and best of the FEAR games. The first two games suffered from bland locations, it was always boring allways and werehouses but this game has some quite intresting locations like a hardware store and south america style village. But with adding co op to the campain it loses all atmosphere, I know that I moaned about FEAR 2 losing alot of the scares from the first one but number 3 as pretty much no scarey bits at all (apart from one moment on a ladder) The score sytem braeks the immersion as well, but its around 6 to 7 hours long and it does have some replay value so its worth the money if you find it for cheap in a steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth it, but if you played the previous ones, this will sum up the story in a bit unexpected, yet still good way. If you're not that interested in fear, DEFINETLY get it with a friend, because the co-op is bamf. Singleplayer is also good( combat is alot more evolved and awesome in this than the previous ones), but overall not as good as the first two imo.  Recommend with the details above.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awful. Avoid it. The first two were quite good and had good shooting mechanics, nothing is right with this one, it is just like a cash-in console version, as if it has nothing whatsoever to do with the first two, apart from the odd visual motifs. Textures are crappy as well, it's one of the worst games I've ever played. After twenty minutes I was regretting buying it even at the offer price. It has absolutely nothing going for it. It's like people who hated their jobs were given the task of making the third game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is bad in an endearing way.",
            "review_score": "1"
        },
        {
            "review_text": "Not much actual 'FEAR' in this game, but if you like first person shooters at all, you absolutely can't go wrong with FEAR 3. One of my favorites on STEAM right now.",
            "review_score": "1"
        },
        {
            "review_text": "Despite all the hate coming from people, F3AR is enjoyable in its own right. Granted, gameplay was streamlined too much compared to the sequels that it feels too much like Cowadoodee (but not completely).  For one, medkits are gone and regenerating health is the new heals BUT unlike COD, regenerating health can bite you in the ♥♥♥ also as enemies do like to punish you hard (as in if they're not understrength, they WILL push towards you while trying to regen health). So no medkit abuse to get out of a fight where you're guaranteed dead.  Gunplay is a bit generic, but still enjoyable. You do have a destructible cover system that allows you to shoot from side to side, allowing for limited tactical gameplay. Its not original, but workable enough. The martial arts that the first game had and the second game downplayed, are now gone, however, which is a huge damn shame, because ♥♥♥♥ knives, I wanna punch and kick every person I can find like John Woo from hell.  There's also a unique feature in F3AR in that you can play as the pointman's sociopathic brother: Paxton Fettel. On his own, he can only throw out telekinetic bolts and levitate thiungs and can't use guns. He can, however, posses certain enemy troops for a limited amount of time, allowing you to have your meat puppet wreak havoc on the enemy lines before doing it again. He can also make people's heads explode like in Scanners. If you can find a friend to play Co-Op with, the prospect is quite good.  The atmosphere (after the first level) has to be one of the best features of the game. You do feel like in an apocalyptic wasteland after a psychic/nuclear disaster. It's not 'depressingly beautiful' or 'adrenalin-pumping beautiful' but just creepy. The more you progress, the more you see how horrifying Fairport has gone down under. People are crazy. Cannibalistic crazy. And the locations you venture through will reveal how high the level of crazy went into this place.  As for difficulty, F3AR does have it. ATC Black Ops and the Replica troops are tough that they usually take a few hits to take down, have a kiiiinda decent set of tactics. Though, the AI does kinda shift from Competent to Call of Duty at times, but most of the time, they remain competent and will give you a run for your money. Cannibal AI is not that far from your everyday zombies from L4D and the likes, but they will try sneak attacks as much as possible.  As for multiplayer. Its pretty much dead. Unless you have friends. Its dead.  Overall, F3AR might be a bit shifty with its price of $10, but is a definite buy if its on sale. It'll give you some decent enjoyment for its price.",
            "review_score": "1"
        },
        {
            "review_text": "What the hell were they thinking making this game? First game was amazing, second was alright, and now this...  It's pretty much just Call of Duty with le funny jumpscares xD all over the places. And what is it with the point system, the ranking up, AND WHY IS THE GAME SO GOD DAMN EASY NOW?  Buy Fear 1 instead, better graphics and gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "i Sow Much Like This Game i Want 2 keys!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "After finding out that FEAR 3 was not made by Monolith Studios I decided to go into the FEAR 3 world with an open mind, and luckily for the game, it made me like it more!  The storyline of FEAR 3 picks up a while after FEAR 1 and straight after FEAR 2, this time you play as PointMan trying to find Alma! The storyline in FEAR 2 confused me ALOT but this one cleared up some things and introduced Becket form FEAR 2!  I was worried about the fact that it was co-op but the way they did it for singleplayer is very clever! If you play it your first time singleplayer with no friends there will be some scares and the gameplay will be alright. After that you should jump straight into co-op and play it again, the scares arnt there anymore but the gameplay gets so much more funner!  The multiplayer has to be the best multiplayer game I know of to date, but then again I wouldnt exactly call it multiplayer because there is only 1 game mode were you are fighting other people. The co-op multiplayer tho is still fun as hell! Running from a giant wall of death, Holding out against endless waves of enemies. And hiding from Alma!   The end was a huge disapointment to me, if a game gives you a 'choose your own ending' it usualy means the game developers were to lazy to think up of one and said 'Choose you own and ♥♥♥♥ off!' I doubt there will be any more in the FEAR series &amp; even tho the ending was a downer, and least FEAR went out with a bang for its MP and SP gameplay experience!  R.I.P FEAR, I loved you all the way through 1,2 &amp; 3...",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed the first 2 F.E.A.R. games and think this game looks great.",
            "review_score": "1"
        },
        {
            "review_text": "its an awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Me and a friend beat this game on the hardest difficulty in under 4 hours. Just. No....",
            "review_score": "-1"
        },
        {
            "review_text": "uhhhh yeah its ok i guess",
            "review_score": "1"
        },
        {
            "review_text": "i dont understand all the negetive hub bub about this fabulouse game its a low price for a high quality game! sure sometimes it gets like call of duty. blagh! but the rest of the times is spooky!",
            "review_score": "1"
        },
        {
            "review_text": "Good game but I wanna play with my gamepad ...:(",
            "review_score": "1"
        },
        {
            "review_text": "Fear 3 is a good game but doesnt hold a candle in terms of gameplay and horror esque moments compared to fear 2",
            "review_score": "1"
        },
        {
            "review_text": "This game is utter garbage seriously.",
            "review_score": "-1"
        },
        {
            "review_text": "I completed this too quick I feel like..   Decent gameplay, supposed to have jump-scares but I don't recall being that scared...  ...apart from the bathroom incident o_O  Ghostly, kinda atmospheric to the environment. Always feel like you're being followed... because you are.. Decent combat, I like the use of slow-mo, but maybe it's too much to my advantage?  Disappointed that I managed to complete so quick, and I'm not even that good..",
            "review_score": "1"
        },
        {
            "review_text": "Not scary,and not Fear...buy Fear 2!",
            "review_score": "-1"
        },
        {
            "review_text": "This is garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "very nice game",
            "review_score": "1"
        },
        {
            "review_text": "Nice action game but it's need to be more scary",
            "review_score": "1"
        },
        {
            "review_text": "This game deviates from everything that made the original FEAR and it's expansions great. It includes regenerating health, cover system, extremely weak AI compared to the original, and I can't do my favorite thing anymore. That is kung foo replica soldiers to death. All of the fun has been stripped out to and replaced with call of duty elements in an effort to stay relevant, your melee attack is even a knife swing. But the FEAR series didnt need to buy into these tropes the gameplay in the first two was tense and had consequences. You were the ultimate bad ♥♥♥ but you had to think and use all the tools available to defeat the smart AI. Levels in the original have branching path ways and felt like real places with boosters to collect to make your health and reflexes better. Now we have a market point system that breaks the immersion of the game as an excuse to have customization. Varying enemy types had a heavier pressence in a battle, HEavy troopers would come through the wall while grunts out flank you. Now we have wave after wave of dumb always reacting the same soldiers. In every firefight i could run right up to the enemies with a shotgun and shoot them. It doesnt matter how much damage I take because I wont take enough to die and it regenerates anyway. Plus I have slo mo which is just a cop out in this game. Sometimes there are a few supernatural monsters thrown in, but it's all forced. I believe that during the production meetings they developed all of the shooter elements and while making the horror someone said, 'Just throw some scary crap in there. The game is called FEAR right?'. So sorry to say but FEAR 3 is lame, buy the original and its expansions Extraction Point and Perseus Mandate, for shooters that actually feel good to play.",
            "review_score": "-1"
        },
        {
            "review_text": "One day I decided to play all the FEAR games front to back, I started with FEAR 1, still as goo as I remembered it and the graphics are still decent for its age. I then played the DLC which I learned are non canon. They felt like singleplayer mods for the base game but a large part is just as good as the original game. FEAR 2 felt like a more streamlined version of the original which is a comon strategy in the gaming world. If a new IP does well the second game will be more streamlined, even if it didn't need to be.  I then played FEAR 3, I immediatly noticed the weak gun sounds, the aweful movement and the damage feedback on you, there is no damage feedback. While in the previous games when you get hit you would at least get a camera shake or a noise indicating you're taking damage in this game you can take damage without noticing it. Sure there's a damage indicator near your crosshair and your screen slowly turns red but you take such a huge amount of damage often times you just stand there taking damage shooting at the enemy right in front of you who also takes quite a bit of damage.  Compare this to FEAR 1 in which the gunplay was excellent, the gunsounds felt like they packed a punch, the dust and debris flying off walls and decoration made a firefight feel genuine and while enemies in the original did take a lot of damage firefights were fun. You had to take cover and the slow motion was a helpful feature. In FEAR 3 it's not really needed as you don't have to take cover that much.  FEAR 1 was a semi tactical shooter in which you couldn't just attack the enemy without thinking, you had to take cover, fall back and use the slow motion.  Also somehow FEAR 3 looks worse than any of the previous games, sure the textures might be higher but there doesn't seem to be a lot of dynamic lighting and everything looks brown. The movement feels weird, it might be the little momentum or the lack of movement feedback but it was much better in the previous games.  The bottom line is, the game feels like a budget title, the entire character of the FEAR games was stripped away and replaced with a generic budget shooter with slow motion tacked on. I won't play this game again and will not finish it.",
            "review_score": "-1"
        },
        {
            "review_text": "The combat is what made the original Fear so good. I don't know how they messed it up so much in Fear 3 but the enemies take far too many hits to go down and they don't seem to react when getting hit. They just carry on running about whilst you're riddling them with bullets. It also lacks the occasional scares and tension of the original games, so it doesn't really feel like a Fear game. I wouldn't reallly recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty awesome story line and not too much horror. Normal difficulty is just about right for non-hardcore FPS gamers (like myself) - quite challenging but not impossible to beat.  Totally enjoyed finishing the campaign playing Point Man. It was pure joy.  Haven't explored much playing Fettel, hopefully soon.  Haven't got into shooting games this deep for a while, strongly recommend this well-executed game - 5/5",
            "review_score": "1"
        },
        {
            "review_text": "this game is so terrible i actually made notes on all the ways it could be improved. the notes lasted for four pages.",
            "review_score": "-1"
        },
        {
            "review_text": "so many dislikes on this third game from these series...well i understand why, maybe the fans felt that was more of a fast cash release...anyways between bad or good i will give a 55% thought, i really cant give the thumbs down because i didnt pay that much for the game and i have to admit that i had some fun with it...so there he go. I still think that the game should be way way cheaper by this time, 20 bucks is too much , thats why i bought it from ♥♥♥ for 3 bucks",
            "review_score": "1"
        },
        {
            "review_text": "UGH, no. Just no, terrible in every way. Full of bugs and awful gameplay, feels like a really bad game from the 90's. DON'T BUY IT.",
            "review_score": "-1"
        },
        {
            "review_text": "Despite a too-short campaign and repetitive levels, FEAR 3 is still a good finale to one of the most unique first-person shooter franchises I've ever played. The weapons are fun, blowing bad guys away in slow-mo remains satisfying, the scares are lethal and the graphics are still quite impressive, with a lot of really beautiful lighting effects. When it comes to the FEAR series, one thing that I've always loved about them is how the genius of each instalment lies in the mixing of cinematic elements of Asian horror with 80s action films. Perhaps the series as a whole could be best described as The Ring meets Die Hard. However, this wouldn't do it justice, these games are well worth playing, both for the casual gamer and the survival horror aficionado. Hopefully someday we can see a fourth one!",
            "review_score": "1"
        },
        {
            "review_text": "The game is the best since the original F.E.A.R.",
            "review_score": "1"
        },
        {
            "review_text": "finnished the game with in 3hours. the game wasnot really spooky at all just a tiny bit at the start with the soda machine jumpscare but thats pretty much it. it also has some fun multiplayer mini-games if u have any friends. fun campainge over all and a meh ending atleast for me . would recommend to a friend~",
            "review_score": "1"
        },
        {
            "review_text": "i think its a good game personally.",
            "review_score": "1"
        },
        {
            "review_text": "Great game as ever. I just love the storyline with those shootings and horror scences ^^ recommended if you like FPS game",
            "review_score": "1"
        },
        {
            "review_text": "Dont waste any money on this title, its not even worth 5$ if you ask me .. what a waste!",
            "review_score": "-1"
        },
        {
            "review_text": "FEAR 1&amp;2 was great. But this one... I don't know what to say. It is terrible. Stay away...",
            "review_score": "-1"
        },
        {
            "review_text": "This feels like a generic FPS with lame attempts to scare you. Also, none of the story makes much sense.",
            "review_score": "-1"
        },
        {
            "review_text": "Just finished the coop. Pretty kewl, but short.",
            "review_score": "1"
        },
        {
            "review_text": "Fairly scary. Absolutely amazing storyline, and the gameplay is iffy. But I definitaly recommend buying this.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the most linear, rudementary and flat-out boring FPS I've ever had the misfortune to play. Wouldn't recommend this game to anyone.. Not even those with half a brain.",
            "review_score": "-1"
        },
        {
            "review_text": "Not as scary as the first or the Second one but some of the multiplayer gamemodes are freaking fun like F****ng Run its a fast phased gamemode with just running and if you get caught by the wall of Death your entire team looses. Coop Is actually realy good i would recommend this  4/5 Story 2/5 Scare Factor 5/5 Replay Value becouse of the singelplayer that you can play as Fettel aswell.",
            "review_score": "1"
        },
        {
            "review_text": "This one is pretty much like a Call of Duty game. Very fast paced, but also very repetitive. Lacks horror that the first two had, but includes more action and stuff. Still good if you like shooters I guess, but this one is probably the worst in the F.E.A.R series.",
            "review_score": "1"
        },
        {
            "review_text": "very spooky , awsome weapons , awsome storyline",
            "review_score": "1"
        },
        {
            "review_text": "Very crapy sequal do not buy it lacks MP mode its not very fun at all",
            "review_score": "1"
        },
        {
            "review_text": "Don't know the way to go.",
            "review_score": "-1"
        },
        {
            "review_text": "F.E.A.R 3 is not a bad game. It's just a bad F.E.A.R game.  It's a prime example of what happens when a game is paced as a sprint. The game focuses so much on combat that it loses all the elements other than basic mechanics that made the series special.   Because of the focus on constant action, anything that attacks you in F.E.A.R 3 will scream or shoot on sight. There are no paranormal entities or Replica Assasins stealthily hunting you outside of one scripted sequence in the beginning of a single stage. There are also very few breaks in the action for horror events compared to the tense pacing breaks of the previous titles. Overall, there's no tension, no interesting characters, and a hollow story that's only tangentally related to the gameplay.   F.E.A.R 3 is still an enjoyable ride of slow-mo head shootin', but that's all it is. For a series fan I'd say this game is a pass, but for someone who wants to do some stylish killing in slow-motion then I'd say F.E.A.R 3 is worth picking up on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Not The Scariest Game out There. Ok Not Scary At All. But over all I like it Its fun. Its A Short Game. But again i recomend it",
            "review_score": "1"
        },
        {
            "review_text": "Love this game! Definately lives up to the series. Love the slow-mo and cover system for slowing down the insanely fast combat style. Fear fans should not be dissappointed!",
            "review_score": "1"
        },
        {
            "review_text": "Absoluter Schrott, fully crap!",
            "review_score": "-1"
        },
        {
            "review_text": "If you want a game like F.E.A.R 1 with the same action and scary moments, don't buy this. But if you want interesting new multiplayer modes and see the continuation of the fear story and want a decent to good shooter, then buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Are you ready to feel FEAR... again... for the third time? Hopefully the last time. ;) The game is super, but if compared to the first one, then I can say: 'Jumpscares dont scare me... much...'.  I give it a 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game was much much better than I expected. A metacritic score of 74 does not do it justice. But I haven't played the first two FEAR games, so I assume its lower score is due to it not living up to the past.  It's about 15 hours to beat the game. It has some features that give it an amazing replay value as well. It's a little too dark for me to play twice, though.",
            "review_score": "1"
        },
        {
            "review_text": "I like and play all the FEAR games. I do recommend them all. ENJOY",
            "review_score": "1"
        },
        {
            "review_text": "Great game with fantastic combat mechanics. Co-op is incredibly fun.",
            "review_score": "1"
        },
        {
            "review_text": "72/100",
            "review_score": "1"
        },
        {
            "review_text": "I'm glad it's over",
            "review_score": "-1"
        },
        {
            "review_text": "Both sides of the game are awesome. Point Man has his usual time slow, and playing as Fettel is just beyond great",
            "review_score": "1"
        },
        {
            "review_text": "FEAR 1 AMAZING!... FEAR 2 ♥♥♥♥♥♥♥T!... FEAR 3 NICE! Worth a try when its cheap!",
            "review_score": "1"
        },
        {
            "review_text": "people die, things happen, you drive a mech every once in a while, then its over",
            "review_score": "-1"
        },
        {
            "review_text": "You know when you watch a movie, and the main charicter did abunch of badass stuff and it goes in slow motion and he like shoots one guy and stabs another? yeah that in a game. with horror. and an interesting plot. allround good game",
            "review_score": "1"
        },
        {
            "review_text": "It doesn't support 1280x1024 as a display resolution.  Just... don't even bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, this game was amazing! Especially when it only cost me 1$ on the humble bundle. Co-op is great!",
            "review_score": "1"
        },
        {
            "review_text": "F.E.A.R. 3 Story 3/5 nothing really interesting that makes you want to immerse into these section of the game.The story is good enough to keep anyone playing and not to annoy yourself in the gaming experience.  Gameplay; Shooter Mechanics 4.3/5 the gameplay is fun with healthy amount variety of guns, the maneuverability feels smooth and meleeing enemies is more encouraged in this game and the game itself is challenging enough.   Innovation 3.9/5 you can pilot a mech....you should like that.  Overall: 7/10  I stating this review without comparing this game to its predecessors because i never played them so i dont know any sorts of improvement in the series.",
            "review_score": "1"
        },
        {
            "review_text": "I've played all 3 games... This game is just awful. So boring, and mindless. Kill hordes of enemies, move to the next room, rinse and repeat.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the greatest game of the series, with an epic storyline, impressive gameplay and an infinate replay value with 2 playable characters This ranks among one of my favorite games!!!",
            "review_score": "1"
        },
        {
            "review_text": "FEAR3 sucks, dont buy it; F and F2 are much better",
            "review_score": "-1"
        },
        {
            "review_text": "Good fun for a single playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "The worst Fear game I have played. It's generic, linear, mostly boring, not scary at all, very short and way too simple. Playing with a friend on the highest difficulty We've died like 2 times. It lacks the atmosphere of the 1st and the 2nd. I am very disappointed",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a fun horror sci-fi FPS game. I was not completely impressed with the game, as I was expecting to be scared out of my wits with this game. With the previous two FEAR games delivering a truely chilling and horrifying experience, something I had absolutely loved in the previous games, I was expecting great things from this game. Although it had some terrifying moments, overall, it generally lacked the horror aspect of the game that the other two games had mastered. That being said, this game was more based toward its coop gameplay. This game did still make for a great FPS, in that its campaign was wildly entertaining, and had tons of replayability with friends as well as changing the difficulty for more XP to go toward the player rankings. The new multiplayer game modes were also very unique, providing a different multiplayer experience, yet still entertaining. Despite its lack of horrific effects, I would still recommend this game to just about anybody, as it is still a great and entertaining shooter in my mind. 88/100",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely great!!! The best is ofc the online. My favorite mp gamemode is soul king. But the MP seems a bit too dead. Every time i check if there is an online game is see: 1. 1 game only 2. no games found People play more fear 3!",
            "review_score": "1"
        },
        {
            "review_text": "Only done it as the gun bloke 2 was scarier",
            "review_score": "-1"
        },
        {
            "review_text": "It aint scary, only a few jumpscares though. Buy it and play CO-Op :D",
            "review_score": "1"
        },
        {
            "review_text": "I did not like this game. It wasn't scary, the story was just weird, the characters acted unusual, and the gameplay was boring.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is nothing like FEAR 2, this game is not a horror game but an action game.  so if you are looking for a game like FEAR 2 then you should not buy this  otherwise if you are looking for an action game, then i think this is a pretty nice game.",
            "review_score": "-1"
        },
        {
            "review_text": "Good series lots of fun and scary too.......=]",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, beat it awhile back, and worth playing again on higher difficulty. :)",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't sure what to expect because I read almost nothing about this game when I purchased it at a discount on Steam. I did play Fear 1 and 2 and enjoyed both.  I found that on its own ~ this is a pretty good FPS games with fun guns and robots to control. Sometimes has good atmosphere and othertimes looks like a PS2 test gen game robot battle game.  Compared to Fear 1 and Fear 2... it was ok but there is nothing scary/jumpy about this game. The messy areas in Fear 1 and 2 feel kind of alive and the junk flies around during combat and slow motion was awesome.  In Fear 3, the lighting is not as awesome, most items on the ground/counter are static or only explode, and the horror/scare moments seem a bit more cartoonish.  I can see they tried but in the end ~ its just a decent FPS with some horror elements... Worth it at a discount - I enjoyed the 6 hour game but i did not try to play as the evil brother.",
            "review_score": "1"
        },
        {
            "review_text": "At the time of writing, I've only played this game co-op. I was the second player, a ghost who can't use guns but can shoot balls of blood (?) out of his hands at enemies. Sometimes I'd possess the baddies and run around pretending to be the much more useful Player 1. Anyway, it's pretty fun (I'm not a FPS fan), so give it a go.  Don't buy this expecting a scary game though, FEAR 3 is far from a scary game.",
            "review_score": "1"
        },
        {
            "review_text": "Really, really good game. Fun (but short) campaign that I've played 3-4 times. Good coop, and the multiplayer is fun too. Very much worth the cheap sale prices.",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME AND I NEED SOMEONE TO PLAY WITH",
            "review_score": "1"
        },
        {
            "review_text": "short single player, co-op makes it better a little bit.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a wonderful game that really adds to the Fear series. The graphics look awesome and very well done. The multiplayer is totally awesome but can sometimes be hard to find people to play with. It is a game that can be play with a friend on singleplayer co-op. It is so much fun to play through the entire campaign with a friend. The sounds at times are really creepy and can give you the chills when you dont know were the enemy is and all you hear is the footsteps. The combat is what makes this game really shine, its really well done. The story can be confusing at times, so its a game that needs to be beaten a couple of times to really understand what is going on. I would suggest playing the previous Fear's to really understand this story better. This isn't as scary as the previous 2 in the in the Fear series but it really does bring something unique. I've loved playing this game and its a great one to pick up, I've enjoyed this greatly awesome game and I know you will too!",
            "review_score": "1"
        },
        {
            "review_text": "If you're expecting a FEAR game, skip this, the magic is gone. The first FEAR game was a suspense game with shooting, this is a shooting game with some suspense scenes. There is a multiplayer survival game that feels like COD's Zombie mode. Fettle is actually pretty fun to play as but enemies are too aware to allow for full use of his powers. Otherwise it's a decent Wally McChestHigh. Check this out If you like cover based FPS with regenerating health and a slow-mo mechanic, and don't mind that it plays like a console port with weird mouse acceleration.",
            "review_score": "1"
        },
        {
            "review_text": "This game keeps on crashing for some reason. I have many other games on steam that causes no problems with my GTX570 and i7 processor. Friend has same problem with a different video card. I want a refund",
            "review_score": "-1"
        },
        {
            "review_text": "good game, best bought when on sale",
            "review_score": "1"
        },
        {
            "review_text": "If you do want this game, DO NOT GO IN EXPECTING A HORROR GAME. It may just be me, but I kept missing the scares. I know they're there because I see them disapear and other times they just weren't scary at all. There are a few fairly creepy moments and there were others that were mildly amusing. If you want a horror game, this isn't the game for you. Now lets get on to the shooting bits. The gunplay just doesn't feel all that good. I don't feel like I'm firing a gun at all. The weapons aren't fun to fire and are fairly generic. The last bad thing about this game is its extremely linear but I guess thats to be expected from fps now days. The only redeming feature is fettel that I found really fun to play as during the combat sections.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend you don't buy this game, even on special offer, 'cos it's crap. IMHO.",
            "review_score": "1"
        },
        {
            "review_text": "Best played with a friend!",
            "review_score": "1"
        },
        {
            "review_text": "a very smooth combat system and great weapons but the story seems to run out.",
            "review_score": "1"
        },
        {
            "review_text": "Have not played this one for a while, but it's good enough for another turn.",
            "review_score": "1"
        },
        {
            "review_text": "Dont expect good old Alma fright scenes from the original F.E.A.R. it goes after its predecessor F.E.A.R. more actiony less creepy, but this one compliments the lack of a good scare with good Coop mechanics, it has its spooky moments though. Its a good buy if you got a friend to play it with.",
            "review_score": "1"
        },
        {
            "review_text": "Meh, cool effects tho",
            "review_score": "1"
        },
        {
            "review_text": "Cool shooter ok graphics either way still a great play",
            "review_score": "1"
        },
        {
            "review_text": "I would definitely recommend this title if you are interested in a jump scare kind of game. However, if you're looking for something with a bit more atmosphere, I would recommend the prequel, F.E.A.R 2.  There is a great transition between gunplay and the horror aspects which the past F.E.A.R games have also done quite well. As a sequel this is a brilliant game and It is definitely worth a look.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "really fun to play with friends!",
            "review_score": "1"
        },
        {
            "review_text": "The first FEAR game had, and still has, some of the best enemy AI around. That cunning enemy is still there in FEAR 3 (NB - I *refuse* to use F3AR...) but the map design quality has dropped slowly since the first game, though the flash of the game universe is in full force. Buy it if you want a solid, tactical shooter with a few scares.",
            "review_score": "1"
        },
        {
            "review_text": "A game disappointing to the franchise that made it into game informers top 25 ...",
            "review_score": "-1"
        },
        {
            "review_text": "FEAR 3 has something different from 1 and 2, is has Multiplayer Co-op, and I really like this, you really can play with your friends. I like FEAR series because was my first shooter with a horror storyline. ",
            "review_score": "1"
        },
        {
            "review_text": "I couldn't get to this game. It delivers exactly zero horror, and outside that is just a mediocre shooter. I only played a few hours because that's as long as the game kept me entertained.",
            "review_score": "-1"
        },
        {
            "review_text": "It a great game to play with a friend at night time oooooooooooooooo",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would uninstall again",
            "review_score": "-1"
        },
        {
            "review_text": "Good game bit short",
            "review_score": "1"
        },
        {
            "review_text": "Well..  FEAR 3 3 times as fun in multiplayer, especially Contraction, sort of a Last Stand gamemode..",
            "review_score": "1"
        },
        {
            "review_text": "It locks my pcsystem up does not work",
            "review_score": "-1"
        },
        {
            "review_text": "i hate fear3, it's awful and i want to punch myself in the face everytime someone says it's good.   not talking about 1+2, those are one of my favorite games.",
            "review_score": "-1"
        },
        {
            "review_text": "It's been 10 years since I played the first Fear game but I remember liking it. I only played a demo for the second one but it seemed cool too. This third game is something else. The story is just non interesting and at least half of the time I don't even really know what's going on. The gameplay is really just:  Take cover Pop up and fire Take cover so health can regenerate Pop up and fire repeat until shooting gallery is empty Move forward Repeat shooting gallery process repeat repeat repeat until level is over  It's a competent shooter, sure. I don't really know why it used the Fear name though. I guess if you like the Fear series and you wish it was actually Call of Duty then you'll dig it. It's OK but I wasn't really looking for Call of Feardy.  I hear the multiplayer aspect is cool but I don't care about that stuff. I probably should have passed on this game but it's not completely horrible. It's just 'meh' really.   The FOV needs to be fixed right from the get go. It's pulled in way too tight. There's no option for it either . You will need to edit a config file. Also the graphics are muddy. There are no hi-res graphics to be found anywhere. This game really isn't that old. Sheesh. Typical console port.",
            "review_score": "-1"
        },
        {
            "review_text": "Was kind of hopeing for less shooting more spooks but it's still a really good game.",
            "review_score": "1"
        },
        {
            "review_text": "This was an amazing game, I was in a bit of a lul with FPS games when I decided to try. It was definitely what I needed to snap out of it. This game had the perfect blend of both atmosphere and story, the game didn't lean to much on one or the other to keep it's eerie mood through the game. I am a horror buff and this game was good about giving jump scares and a feeling of dread around every corner.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun when i played the first fear game i was it was dark and i was playing and i heard a door shut and i turned around in real life lol it scared me it was the game but for this game graphics are good game play is fun only thing is i cant find anyone to play online with",
            "review_score": "1"
        },
        {
            "review_text": "+ Great Coop mode + Good graphics + Hight gore level + Point man's gameplay + Cutscenes + Heavy Power Armor!  - too short - Lacks the dark &amp; scary atmosphere of previous parts - feels a bit casual - Few weird things in Fettel gameplay (why can't he carry nor move laying grenades by his telekinetic power?)  -/+ I wish there could be ending where both bothers could just reunite with Alma and the baby - so the Coop campaign could feel like a real teamwork without sub-conscious competition. But it's just my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "The conclusion of the FEAR trilogy provides a fine end, but the gameplay while feeling great, is stunted with cut scenes breaking the play each chapter. Clearly made for Coop, the ending suffers too.  Decent but not the best. Not that I'm saying don't play it of course - you need to end what you began.",
            "review_score": "1"
        },
        {
            "review_text": "it's alright ",
            "review_score": "1"
        },
        {
            "review_text": "Unable to complete it... story is lacking and tedious fights...",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game if you love a good shoot em' up!!! Lots of non stop action with some very interesting levels.",
            "review_score": "1"
        },
        {
            "review_text": "Less F.E.A.R here,But Still Got Awkward Boner In Last Cutscene",
            "review_score": "-1"
        },
        {
            "review_text": "If you come into this expecting a F.E.A.R game than you may have a bad time. If you come into this expecting a good FPS Horror game to kill some time than you're going to have a great time. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Wow, what a horrible mishmash of cliches and tired tropes. The gameplay is enjoyable though nothing unique, and I survived the nonskippable story parts of the game by fiddling around on my phone until they were over.",
            "review_score": "-1"
        },
        {
            "review_text": "Really good combination of horror and action.",
            "review_score": "1"
        },
        {
            "review_text": "This... this game's a ripoff even for $20, since you can't access 2/3 of the game content without a co-op partner. Guess what's impossible to find on the PC version? Yeah, someone dumb enough to have bought this game.",
            "review_score": "-1"
        },
        {
            "review_text": "F.3.A.R. the darkness =(",
            "review_score": "1"
        },
        {
            "review_text": "Not a Horror game, alot of action but, I love that it supports 5760*1080 out of the box. Know what you are buying and you will like it.",
            "review_score": "1"
        },
        {
            "review_text": "A well made game in all rights and I will say that this is an ACTION game before it is a horror game unlike its predecessors. Multiplayer is good and feels well made but again it is DEAD The games story mode is done well yet short with only a few hours of gameplay to run through yet the leveling and point system creates competition during co-op gameplay which two players control two polar opposite characters. Player one takes on the role of Point Man which is pretty much that, he is the point man who goes in head on and guns down enemies with an arsenal of firepower and slow-mo gunplay. Player two plays as Fettel the main antagonist from F.E.A.R.: First Encounter Assault Recon who plays more as a support class with possessing enemy soldiers and using them for a limited time to use their weapons and back point man up. On the topic of the story is that there are two endings one is for Point Man (good ending) and the second is for Paxton Fettel (bad ending) and depending on which player has the highest score at the end of the game gets their ending but the solo campaign is solely Point Man's ending  7/10 points needs a bit more horror to feel fearful of   Gameplay 8/10 Story 6/10 Controls 8.5/10 Multiplayer (If you can find a game) 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game; fast-paced combat, power armour walkers and the most ♥♥♥♥ed up fictional story about a broken home I've ever seen. It's surprising that more isn't said about this game as I believe it's the best in the series for story and gameplay. There aren't many new features, but that doesn't stop it from being a kick-♥♥♥♥ title. ****",
            "review_score": "1"
        },
        {
            "review_text": "Well, all I can say is that it lasted 6 hours. If you liked the previous FEAR games don't even bother playing this one, it doesn't even deserve being called FEAR. It's more like... 'A lame PS3 game we made because it will sell itself because of the name'. The storyline it's terrible, it doesn't bring anything new to the main storyline of the previous games, it is just a bad ending to it, making FEAR 2 pointless. I really enjoyed some creepy locations, but that's all they were, just creepy locations. There are few enemy types and the combats are always the same. What I find that it really broke the climax of the game was this 'competitive' touch they want to put in... You level up pointlessly (because the skills you gain are nothing exciting) and those 'achievements' totally break the aesthetic of the game and the gameplay itself. So, if you want my oppinion, buy this game if you can get it for 75cents, play it a boring sunday afternoon and then go back to the old ones so they can wipe out the bad taste that this one leaves.",
            "review_score": "-1"
        },
        {
            "review_text": "I wasn't too pleased with this installment of F.E.A.R. because it turned more into an average FPS rather than the horror game that the franchise once was.   For an FPS game, it was decent. For a horror game? Not so much...  The main thing keeping F.E.A.R. alive was... well... the  FEAR  that the series would give you. The lifeline of F.E.A.R. dies within this third installment.",
            "review_score": "-1"
        },
        {
            "review_text": "A very good game, However not a very scary game (there might be parts that make you jump). I have to say the co-op is insane like its wicked sick ( in a good way). THe story is very good, kind of explains what happened in the past and also ends pretty well aswell. this game is good for those that want to finish the F.E.A.R trilogy and find out what happens next or just want a good co-op game. I would recommend it to anyone. If you are still dont trust me just wait for the special that steam has for it, its wroth the money then ",
            "review_score": "1"
        },
        {
            "review_text": "  bit of fun, decent fps for a low price,",
            "review_score": "1"
        },
        {
            "review_text": "Really not much to say about this game. Just sort of meh. There are better ways to spend your time. Pretty much the same as the other games if you play single player.",
            "review_score": "-1"
        },
        {
            "review_text": "Firstly, I have played all the F.E.A.R. games and can say they are amazing. The immersion is incredible once you are sucked into the story it has you. The scare factor is way up there and jump scares are out of control scary as hell. I played the first two in Iraq and was terrified with my headphones on while others slept. It has a very well executed ambiance that makes you look around the room more than play sometimes. I would have to take smoke breaks just for my sanity. I have played all the silent hill games to completion and this games ranks with those titles in my opinion. If you are going to get a fear game then start from the beginning because the story carries throughout and gets weirder and weirder as you progress. The movement and shooting along with A.I is on point and very difficult at times but the payoff is worth it. If you are a whiny baby then play with a friend to make yourself feel like an adult I guess?",
            "review_score": "1"
        },
        {
            "review_text": "(6/10)  Its another fear game, and that isn't necessarily a bad thing, but I think in this outing they really tried very hard to 'modernize' the formula with what in the end is a somewhat tacked on and rather un-necessary cover system. It doesn't really heighten the tension of the game, and kind of undoes some of the overal feel of the time warping when instead of being an amazing time warping marine badass, you spend a good portion of the game hunkered down behind a box.  The overall package isn't awful, it just never fully gels into one cohesive 'game' to play, its constantly wavering back and forth between the old/new systems.",
            "review_score": "-1"
        },
        {
            "review_text": "Good co-op material. Played it once just for the story. It was fine.  Get it when on sale, just like I did.",
            "review_score": "1"
        },
        {
            "review_text": "This game was the worst $20 of my life. This game is only good with friends and it still is a disapointment compared to F.E.A.R 2",
            "review_score": "-1"
        },
        {
            "review_text": "- Graphic: GOOD - Gameplay: GOOD - Combat style: GOOD - Stealth: GOOD enough - Characters: GOOD - Horror: GOOD - AI: High Intelligent - Weapons: Little, but GOOD  100/10 would buy",
            "review_score": "1"
        },
        {
            "review_text": "Fear 3 is the best of all fear games. I have played all of them and they are all good scary games but this one is heavy :D  It is optimized. Controls are simple. Gameplay is linear. Story is freakish as always :) Characters are strong. Level of horror and blood is high and you will also have lots of action. Balanced game. Nice ambient. İdeal story length. Never played multiplayer but it is probably good too.  I have played Alone in the dark, alan wake, silent hill. I consider this game has the action of alan wake, horror of silent hill and ambient of alone in the dark. Nice mixture.  One last thing: There are suicide freaks with bombs straped to their belts running towards you. Try to control your bladdera when they do it :D",
            "review_score": "1"
        },
        {
            "review_text": "First 'not reccomended' from me.. And not actually a horror game...I really liked previous F.E.A.R., which is a great horror shooter mix, very good at merging suspense and action. This on the other hand, is a very generic shooter, that ALWAYS ruins the suspense right when it starts. Like a moment something like that happens and you start feeling fright, boom! There you go, another batch of enemies you must just gun down. Even in the end, the last chapter, when you finally think to yourself 'why can't the whole game be like this?' you realise that that is the most annoying one of all. And the last boss fight couldn't possibly be any more boring and repetative. Plus what the hell is with the achievement system? You collect corpses all trought the game and get points that give you power-ups you actually don't need. It's enough that the steam achievements popping up are annoying, so this is a really not needed. I don't even want to comment on the ilogical ending (not because of spoilers, but because it doesn't deserve to be mentioned, like, anywhere) All in all, a huge disappointment...9 hours of brainless shooting, not wanting to replay any of the missions with the other character.",
            "review_score": "-1"
        },
        {
            "review_text": "What a massive disappointment. I bought the F.E.A.R. bundle and fell in love with the first game. It gave me a super long story, great action, sound design, and was just thoroughly entertaining. The second was vanilla as hell, but still enjoyable. This was beyond mediocre and short. This just feels like any random shooter with F.E.A.R. thrown on as the title. Gameplay is completely standard, story is junk, short, and very unsatisfying as an ending.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate this game so much. It’s so unbelievably generic and bland, it’s sad to see this game use the fear name. The story is so awful, the reason why I liked the story in the first game was even though it was stupid it was subtle and mysterious but here they just went full ret*rd with the plot and the fear storyline. Fettel feels like a cartoon character with his design and voice acting and they actually gave pointman a face, a ret*arded, generic white guy face. Gameplay is very boring and dull, guns feel and sound awful, shooting is not satisfying and the enemy ai is really bad. You can’t even compare how awful the shooting is compared to how masterfully done the the gunplay was in the first game. The games art design and level design is disgusting. It’s all brown and grey absolutely no colour to the game at all and the level design is so bland and forgettable. The scares in this game are so laughable, just the thought that it is actually supposed to scare you is funny. Either the developers did not care or they have no talent or direction. This game has no redeeming qualities at all, it killed the franchise.  2/10 (Awful)",
            "review_score": "-1"
        },
        {
            "review_text": "Very good game and nice..in Insane mod it needs your expert",
            "review_score": "1"
        },
        {
            "review_text": "The game is alright, but in the multiplayer it's just bad.. the xp system is horribly unbalenced and just the whole gameplay is not as good as it could be.",
            "review_score": "-1"
        }
    ]
}