{
    "app_id": 211160,
    "name": "Viking: Battle for Asgard",
    "release_date": "2012-10-17",
    "developer": [
        "Creative Assembly, PC Port - Hardlight"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Hack and Slash"
    ],
    "achievements": 50,
    "positive_ratings": 856,
    "negative_ratings": 1013,
    "price": 9.99,
    "description": "A fierce struggle is taking place within Asgard, the realm of the Norse Gods.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/211160/header.jpg?t=1522072461",
    "minimum_requirements": "OS:Windows XP Service Pack 2, Windows Vista, Windows 7 Processor:Intel Core 2 Duo 2.2 GHz or AMD Athlon™ 64 X2 3800 or better Memory:2 GB RAM Graphics:GeForce 8600 GS, Radeon 3400 or better DirectX®:9.0c Hard Drive:6 GB HD space Sound:Direct X 9.0c compatible sound card and drivers Additional:Keyboard, mouse, optional controller",
    "recommended_requirements": "OS:Windows XP Service Pack 2, Windows Vista, Windows 7 Processor:Intel Core 2 Duo 2.6 GHz or AMD Athlon 64 X2 4400 or better Memory:4 GB RAM Graphics:GeForce 9400 GT, Radeon 4350 or better DirectX®:9.0c Hard Drive:6 GB HD space Sound:Direct X 9.0c compatible sound card and drivers Additional:Keyboard, mouse, optional controller",
    "reviews": [
        {
            "review_text": "When I first saw this game, I thought it would be a lot of fun: massive battles, chopping up minions, being a big damn nordic hero. I wasn't entirely wrong, but I wasn't right either. Viking: Battle for Asgard is a 3rd person hack and slash action adventure game. You play as Skarin, a Viking warrior blessed by Freya, tasked with saving Midgard (yet it's called battle for Asgard..). It takes place on 3 different islands of various sizes. It contains zero notable RPG elements, no loot, no stats, and no detailed information at all. You buy skills (moves) before really knowing much about it, you buy upgrades but don't really know how it differs from the previous one, besides it's  better . It is straight forward and fairly linear. Occasionally you have multiple tasks that can be completed in any order, but they all must be completed before progressing to the next area so there really is no choice involved.   There are also some strange stealth sections that just feel thrown in. Maybe they were trying to break up the hack and slash monotony, which is successful, but because it varies so much from the rest of the gameplay, you really never feel equipped correctly to do them. Those sections feel very out of place, especially when they also have a collecting bit thrown in to them (for a few achievements only) but are never explained whatsoever as to why you would be collecting the things in the first place unless you read the achievements ahead of time. You  may  stumble across one of the skulls, but would never know what the heck you had collected unless you read the achievements. Just seems poorly implemented.  Aside from those skulls, there really aren't any secrets to be found. I like to thoroughly explore areas looking for hidden objects or areas, but there are none to be found. You may occassionally come across a random sack of gold or chest (which only contain gold or a quest item), but that's about it. Because of this, there doesn't feel like much of a reason to explore (even when you're on a rather linear path).   Visuals:  Because this is a console port from Xbox 360/PS3, its graphics are similar to that generation of game. As with a lot of ports, the game is very poorly optimized for PC. It lags pretty noticibly in large battles, it has no Field of View slider, very few graphics options, and the FPS is locked at 30. There is a guide on Steam that will help get the game looking better, but it still cannot unlock the FPS but will change the FOV. Before changing it, there were times when moving the camera made my eyes hurt but even then, turning the camera seemed to blur the screen in a nauseating manner.   All that said, I enjoyed the visuals. There were times when things looked really impressive, scenery looked gorgeous, and combat felt visceral. I think the Creative Assembly did a great job crafting a believable world. It felt consistant and nothing really felt out of place. Small details like fences looked like they really tried to make it fit and appear to belong there. Area layouts made sense.   One of the worst things to me were the animations. Some were just straight strange (dragon summoning looks like your character just collapses and goes ragdoll) and others were just lazy. Every time you fight a Giant, the 3 different Quick Time Events are animated exactly the same, every single time. The first time you see it, you think, wow, that's pretty cool; But after seeing the same thing 9 times, it gets boring and you're just waiting for it to end. Even the dismemberment kills start to get boring after a while as there only appears to be 5 or so different variations.  I think had they actually put in effort on optimization and unlocking the FPS; This game would have been recieved much better on PC.   Controls:  I played it with a wireless Xbox 360 controller and it felt pretty good. I did not try it with keyboard/mouse at all so I cannot say how those were, but right when you load up the game, it specifically says it was designed for a controller. The controls are rather simple to understand and build slowly in complexity. The combat does get rather repetative as you end up using the same few moves as you progress. As mentioned above, the game has Quick Time Events when fighting tough enemies. They're not particulary hard the first time you do them, and then shift into mind numbingly easy as you progress because the pattern  does not change . There's only one kill animation for giants, so there's only one pattern to use every time you kill one. It's repetative and lacks any excitement.  As mentioned above the camera was a problem. It seemed to have a habit of working against you any chance it got, allowing for a sword to your backside. Targeting was also rather strange and likes to work against you. Targeting in Viking seems to rely on auto locking on the target nearest to you, that's fine except when you're getting attacked from multiple sides and are trying to attack a specific enemy before they stike you, only to lunge at a different enemy and get hit multiple times in the back. What makes it worse is that even though you are swinging a sword and axe, you can only seem to hit one target at a time (unless using a special attack). Sure, your swing may go through multiple enemies (especially when they're clipping inside one another) but the same will only register a hit on one, which one can be hard to determine ahead of time.  All said, I still recommend the game but not at full price. If it's under $5 and you like action adventure, hack and slash, or vikings, it's worth it. It's fun enough, the achievements are quite achieveable, and has a run time of 15-20 hours. There are worse ways to spend a weekend. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "BUY IT IF ITS ON SALE-8/10  No game is perfect. Some have iffy controls, others have lame stories, and a few just have weak enemies, but even with these natural foibles, glitches and hang-ups, a videogame can transcend its limitations and be heralded as a title where the sum is greater than the parts.  That isn't the case with Viking: Battle for Asgard.  Set in the time when the Norse Gods ruled and people hid gold in glowing urns for some inexplicable reason, Viking, the latest from SEGA and Creative Assembly, tosses you into the massive boots of Skarin, a shirtless warrior who packs a sword and battleaxe. The game opens with Skarin mortally wounded and about to take a one-way trip to Valhalla, but Freya -- Odin's daughter -- steps in to save the Schwarzenegger-like brute as long as he pledges allegiance to her and promises to go after Hel, queen of the Underworld. Skarin agrees, gets this glowing amulet from Freya, and we're off!  Now, taking on the queen of the damned isn't a one-man gig. The problem is, Hel's Legion -- an army of blue-skinned, undead bad guys -- is roaming the countryside and has imprisoned the very Vikings who would be willing to fight alongside Skarin. This means that the majority of your time in Viking is spent scouring the mountain tops and grassy plains looking for men who are usually locked in giant ribcage prisons or tethered to skull poles. Find the camps, kill the Legion, and free the men. From there, the troops usually give you some task to complete such as gathering a healing honey or eliminating a traitor, and once the odd job is complete, they join your team.  See, you're freeing all of these soldiers for the massive battles that Viking revolves around. When you tap Select and bring up your map, you'll find it covered with various icons indicating enemy encampments, friendly bases and more. Of the enemy kind, you'll see some that have conditions -- free X number of troops, find the battle horn, etc. -- that must be met before you can complete the task. Usually, these are the massive battles that act as a middle and end to the level.Once you meet the battle conditions, you can select the icon on the map and jump straight into the war. Here's where all of the troops you've saved march into battle with you. If you haven't seen these skirmishes in action, they can be pretty impressive. Each one starts with a cutscene depicting a sea of your men marching toward a sea of enemies. Dragons fly overhead, Shaman are casting ominous spells in the distance, and giants wait at the ready. When the scene ends, you're thrust into the battle the imagery just set up. You and hundreds of your men move towards hundreds of enemies.  Although there's no way to control what your men are doing, they're generally pretty good about following you and helping the best they can -- that is by beating the living hell out of all the blue-skinned freaks that get in their way. While your boys on the ground tend to the Legion horde, you're pretty much on your own as far as ending the battle. Each scenario has win conditions such as eliminating two of the three Shamans or taking care of a few giants. Once you've completed the tasks, your troops can move deeper into the base, you'll get a new set of objectives, and the beat goes on. In the end, you have to call your Shaman to the base's heart and have her switch it to good",
            "review_score": "1"
        },
        {
            "review_text": "I think this game gets a bad rap personally. I had a lot of fun with it. Plus, this game does what more should, focus on having a simple goal and then have a world that allows the player to choose what and when they do things. It feels organic, and less restrictive than most modern games. Developers need to lean gamers do not like they're hands being held all the time. Plus, how can you not love the massive siege sections? HOW?! Now, the game is definitely not perfect. First off, I'd recommend straight away playing with a controller. They keyboard just doesn't suit it. Secondly, the boss fights are awful. Including the last boss AND as much as I said developers should focus on simple stories/goals I think the games plot could of done with a bit more exposition.",
            "review_score": "1"
        },
        {
            "review_text": "What to say., well you get what it says on the tin  Graphics are pretty nice, get some very large scale battles, Where as expected you have a set target behind a mountain of mobs that only you can kill. So what do you do? Yep... LEEEE ROOOOYYYYY JEENNNKIIINSSS! *Dies* * Respawns...*  Game has alot of running from A to B to free village from 'Orcs'? Then from B back to A to be told to go find the next village. The combat system is very much hit, dodge, hit dodge, hit dodge, there is a RTS element wher eyou can choose to 'nuke' - Dragon power! certain targets during big battles, Storyline is simple but it works. All in all I'd recomend it as part of a bundle but not worth purchasing on it's own.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun if somewhat repetitive game; I very much enjoyed it, fun setting going on. Voice acting wasn't bad, though you didn't have control over what was going on. I recommend this if you want an action game to play that contains a surprising amount of required stealth.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best action games I've ever played. The combat is like movie cinematics. The game actually knows when to slow down the action for dramatic effect in the middle of a fight. The enemy a.i. is very intelligent and can outsmart you pretty easily. I played on hard and the first difficult fight took me a few times to overcome, but once I got a hang of the combat dynamics it was definitely worth playing on a higher difficulty. Make sure to take time and talk to the NPCs as that really adds a lot more to the story element of the game. Very cool game.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game. Gamplay is pretty simple but giving fun, same as the story. However this PC port is terrible, I could only play without slowmontion on 640x480 so everhing looks ugly.",
            "review_score": "1"
        },
        {
            "review_text": "  A simple but enjoyable game. It begins with a cheesy plot but it gets better at the end, the combat is fun when you master it (it's not complicated to do that), the background is great with a lot of references to the norse-viking culture. If you can get it in sales give it a chance.",
            "review_score": "1"
        },
        {
            "review_text": "One of the few games I played on a console and enjoyed. Sadly, the PC port still suffers (it's a port from a console, they all suffer in various ways) from broken wired controller support (even for the official 360 wired controller) under Vista, Win7, Win8, and Win10. The mapping in the game engine itself appears to be broken, and remapping via Xpadder and the like fails to work. Keyboard and mouse also fail, because it appears that no matter what you assign to the 'A' action, the game completely ignores the input, and also suffers from several other KB&amp;M input control bugs. Hitting Start/Escape also fails to work properly, as it appears that this is bugged in such a way that hitting it once open and closes the pause menu instantly, as if it was receiving double input from a single press.  In the current state of the game, with no hopes of the devs ever fixing it (last post by them was in 2012), I can't recommend this title for the PC. If you have a 360 sitting around at home, you could probably get this game cheap and enjoy a quick hack n slash romp like I did with much less hassle.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of the worst ports I've ever seen.",
            "review_score": "-1"
        },
        {
            "review_text": "I can see a little bit of potential in Viking: Battle for Asgard. Although I felt there are a number of things wrong with this game that brought it down into the “not recommended” category.   The story, from what I can gather, is that you’re a Viking brought back to fight a Legion army and eventually destroy a woman named Hel. You battle across 4 islands (You re-visit one of them so it’s really only 3 distinct locations) On each island you must raise an army large enough to take over the stronghold, find a rune to summon a dragon and upgrade your weapon. Every island has the same basic objectives and it’s very repetitive. With such vast open areas you think there would be more scenarios, but it’s the same formula 4 times in a row.   The gameplay itself is average to below average. The fighting system is clunky which becomes very apparent when you are fighting multiple enemies at once. You end up having to push everyone away from you to separate them out in order to hit them. Otherwise, the surrounding enemies will hit you during your attacks, causing you to be stunned. You are forced to take on a defensive strategy. The extremely narrow FOV also handicaps you as attacks will come blindly.  There is a very basic upgrade system of buying new moves and power-ups. There are not any character stats, just collecting gold to buy these things. The extra moves and combos were useful, but I found myself only using the lighting, fire and ice special attacks barely a handful of times during the game.   The levels are large but mostly empty. There are a number of fast travel locations in each map, which helps but you’re still required to run around the map discovering them first. Your characters running speed is far too slow for these big distances.   The graphics are acceptable and the environment can look quite good. Maybe it was just my game, but I had no in-game music except for the big battles. So most of the time I was listening to my own footsteps.   The large battles seem to be the “best” part of the game, but even this is lacking. The battles are great visually. It was awesome to see my large army charging toward the enemy. Ultimately, you are forced to battle on your own to kill Shamans and giants. Thus making the large scale battle seem unnecessary as you and your enemies respawn continually.    Pros  +Decent graphics +Large scale battles look cool +Large maps (albeit empty) +Environment +Good set of moves to learn   Cons  +30fps +Clunky combat system  +Repetitive gameplay +QTE (quick time events) used excessively  +World map lacks zoom or free movement +Narrow FOV +Character run speed too slow +Stealth sections +Voice acting +Small enemy variety   This isn’t a game I’d recommend to friends. However, if you’re really into Vikings and hack and slashes, you may want to give this game a try if there is a good sale.    4/10  Below average",
            "review_score": "-1"
        },
        {
            "review_text": "Tedious and generic hack-n-slash with shallow character progression. Play Darksiders instead.",
            "review_score": "-1"
        },
        {
            "review_text": "This is one of those rare occurrences where consoles are the preferable option.  Don't get me wrong, the game is good, albeit having zero replay value; I rented it for Xbox 360 back in 2008 and I thoroughly enjoyed the large scaled battles.  However, the port to PC is *incredibly* half-♥♥♥♥♥. So half-♥♥♥♥♥ to the point where it is unplayable with the slowdown and framerate issues.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible controls and asthetics. Watch a few YouTube gameplay videos. Don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Please know before buying this game that it was meant to be played with a controller, not a keyboard.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't bother. Even at discount prices this game doesn't justify purchase. Sadly despite having a viking setting and making an attempt to introduce multiple generes - whereby you engage in first person action to build a force for larger scale combat - it never delivers. While the lack of interesting plot or character development can be forgiven there is nothing to compensate for it's absence. Third person action feels heavy, the character upgrades make no percievable difference, large scale combat involves minimal strategy, and areas, while pretty for the price point, become repetitive. It would be easy to blame these issues on the game being a poor console port but the reality is that I can't see how this would have been anything except faster with a gamepad in hand. If you really have to collect achievments or mindlessly slaughter your way through a limited number of respawning enemy types then try warhammer 40,000 space marine as an alternative, the movement is far superior and the environments more varied.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the perfect example of game that lives up on screenshots and 'who does not like vikings'. It is like a checklist of things rather than a solid game. It lacks depth and soul and it is full of wtf moments. Do not even for a second think you can beat the game by your rules and skill, you can not. If you are not supposed to do something like the game wants, you will never do it. It is like a blend of good concepts that ended up being poorly implemented. Then there is the stealth element (yes, stealth). Probably one of the most horrible, absurd and poorly designed missions I have ever played. I wish I could throw this damn game to the sun.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty good game! If it wasnt for the Low FPS due to it being locked out and capped super low :(",
            "review_score": "1"
        },
        {
            "review_text": "This game is a joke and a bad one at that. They could not be arsed to even port the control menu into the game it has to be done pre launch, same with the graphics options (that are by default set to widescreen. If you dare to continue past that your expirence won't improve much the voice acting is bland at best and in the little time I wasted the most interesting part was collecting sacks of gold. This isn't just a bad port from the little I've played its a poor game, I played Spartan: Total war a long time back and while that had a lot to desire this game is a step down from that and the port makes it even worse,  I only own as thrown in as part of a bundle and I still feel swindled by its presence.",
            "review_score": "-1"
        },
        {
            "review_text": "30fps locked in engine. No workaround available. I could not play it because the stuttering makes me literally sick. Avoid this game even if it is on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Very Crappy Game. Was hoping for a good RTS Action Game, got a frame locked game, badly optimized for PC.",
            "review_score": "-1"
        },
        {
            "review_text": "I love everything about this game, it is probably in my top 10 favourite all time games. One of the most satisfying hack and slash games i've ever played.   Buy it now.  No limbs attached :)",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT GET THIS GAME.  It takes FOREVER to run anywhere (and it's a big map), if you want to buy all the moves and upgrades (that don't do anything, from what I can tell), you have to find every single bag of gold, and when you play offline, it doesn't count the achievements. The stupid zombie guys are really easy to beat, and the only challenge was when you fought the armies of them. The sucky inbetween animations take a while, too. Overall, it's just not worth it. I've suffered through over 8 hours of it, thinking I would beat it, but it's only a third of the game.  Glad I got it as part of a bundle and didn't waste the money on it.",
            "review_score": "-1"
        },
        {
            "review_text": "This is perhaps the worst pc port I've ever played, basically as bad as Dark Souls for pc, but worse, as the game itself isn't as good as dark souls. Repetative combat, and a janky camera don't work well together. Also, when you die, the game teleports you back to the last portal you took, but since there is no sprinting of any kind in this game, you end up going back to the place you died over and over and over again.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so poorly designed, I wouldn't inflict it on anyone. Save yourself. Play Skyrim. The framerate in this directly tied to how quickly you can move your character. A slower framerate and you move in slow motion.",
            "review_score": "-1"
        },
        {
            "review_text": "great concept, but the camera is your enemy in this game",
            "review_score": "-1"
        },
        {
            "review_text": "This blows, it is slow and clunky. Ill give it another hour or two but I am NOT impressed so far.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a bit boring since there is no grinding and not much rewarding going on. 5/10 needs more than what it has.",
            "review_score": "-1"
        },
        {
            "review_text": "It doesnt matter if you have a good pc you play on slowmotion because of bad port",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't want to make a negative post. The reason is that this game could be fine with regular gamers. as for hardcore gamers, no one would like it, because it is poorly designed for a Total war title.   I bought this game with the total war complete pack bundle. I don't recommend buying this game unless on sale. and again this game is not for hardcore gamers!",
            "review_score": "1"
        },
        {
            "review_text": "Barely got it to work on Win 10 x64 by downloading unofficial config files, because the official tool doesn't work in any possible way. The game is practically unplayable because of that.  If you do get it to work, like I did, it has bland mechanics with choppy combat, an uninteresting story, the voice acting is ok but it feels like the same voice actor did the job for every character. and the gameplay overall is extremely boring and repetitive.  If it doesn't work, don't bother trying to get it to. You're not missing on much.  Edit: I also forgot to mention that the game is hard locked to 30fps. if you are used to 60fps, the game will feel like a fast moving slideshow.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly there just wasn't enough content here to warrant hacking and slashing through the entirety of the game. Combat was boring, and the storyline was almost nonexistent.",
            "review_score": "-1"
        },
        {
            "review_text": "Battle hoards and scream Forward as you hack and slash your way through the gates!!! Yes Viking:BFA is beatiful, a bit frustrating, and down right fun at times. I first played this on ps3, but I stoped platforms and went PC all the way. I was well pleased to see Viking:BFA on steam for $5. Well worth $10 Imo. Fighting is fun but a little complicated at times. It's one of those games you got to keep grinding untill you finish. Not lay it down 'oh i will come back to it' because the learning of timing of buttons to press makes a none muscle memory game. The screen filling up with the mob you release and battle your way through hoards of enemies was a blast. A solid 7/10. Check it out pssst Get it for $5 on a sale ;) GAME ON!!!",
            "review_score": "1"
        },
        {
            "review_text": "Its a pretty good game. Its out-dated and sadly never lived up to the hype. That being said, if you enjoy a fair few large battles and kicking the teeth out of anything that walks. Its a pretty nice game. Just go into it expecting mediocrity",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorites, if for atmosphere alone. Gameplay is solid, though the camera can be a worthy opponent. Reminds me of a single player World of Warcraft, or a darker, Norse styled Fable. There's a little bit of everything here, and it's as beautiful to look at as it is fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Just another boring slasher",
            "review_score": "1"
        },
        {
            "review_text": "Framerate capped at 30fps, and now way of changing that, so I stopped playing after 20minutes.  And the 30fps in this game feel more like 15fps.  Aside from that I don't know how the game is, but I cannot recommend it because of the framelock being an instant dealbreaker for me. (got the game in a bundle)",
            "review_score": "-1"
        },
        {
            "review_text": "it may soumd a bit wierd that creative ssembly made an action/adventure game, that doesnt mean it's bad. It's friggen AWESOME. the first time I stood in front of my viking army staring down an entire battle line of walking meatbags, my face melted. I didn't regret buying this at all :D",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥est game i have ever played Combat is Eye bleedingly slow and movement throughout the map makes you want to hurt kittens Do not i repeat do not get this game",
            "review_score": "1"
        },
        {
            "review_text": "can't even run it",
            "review_score": "1"
        },
        {
            "review_text": "ENSIFERUM SIMULATOR  ONE MORE MAGIC POTION/10",
            "review_score": "1"
        },
        {
            "review_text": "a good game, for his age. recommended",
            "review_score": "1"
        },
        {
            "review_text": "Simple hack and slash with a few adventure elements, and walking around enjoying the view. All the game is kind of repetitive, with the same mechanics repeated over and over again, and at half the game you have already fought vs every kind of enemy, so no more surprises (not even the final boss... kind of disappointing). The prime element in the game are the big battles, were instead of Skarin (you) vs a few, there is Skarin + lots of vikings + dragons vs tons of enemies. Three islands, two big battles on each (only one on the first). It's a great game for the price you pay on Steam.  Technically it has the FPS caped at 30, and it is a game with bigger frame drops during battles, and dropping from 30 to 22 is horrid, it was horrid on console, and is specially horrid on PC.",
            "review_score": "1"
        },
        {
            "review_text": "Its a poorly made game.  Buy it and try it if you want to feel disappointed",
            "review_score": "-1"
        },
        {
            "review_text": "7/10 - A solid action adventure that falls short of being great.  Gonna keep this short and sweet. Viking is an action adventure game that takes strong cues from God of War and Dark Siders, but does only one thing new. From a quality and visual perspective, it is a solid title. I think that the mass battles and special buffs the hero can give his soldiers are an interesting touch, but don't do enough to make the game stand apart from its AAA predecessors.  The environments are well made and pleasant, but lack the grandness that I feel a Viking Epic deserves; and frankly what I've come to expect from these kinds of games after GoW and DS.  At the end of the day, its plenty fun and challenging enough to warrant the price, especially if you catch it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit this is a really awesome game.. I don't remember having any games in recent memory with this good of a combat system.  And its hard as hell too, its not some hand-held dumbed down adventure.  Only con is 30fps cap. And thats actually a pretty big deal for me but i've gotten through it.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit this is a really awesome game.. I don't remember having any games in recent memory with this good of a combat system.  And its hard as hell too, its not some hand-held dumbed down adventure.  Only con is 30fps cap. And thats actually a pretty big deal for me but i've gotten through it.",
            "review_score": "1"
        },
        {
            "review_text": "What u will get when u buy this game  1.Knew that SEGA is ♥♥♥♥ed u in the ♥♥♥ 2.A crappy port of locked 30 fps game 3.A god damn ♥♥♥♥ing boring piece of ♥♥♥♥ game",
            "review_score": "-1"
        },
        {
            "review_text": "Great old game with a terrible 30 fps cap",
            "review_score": "-1"
        },
        {
            "review_text": "Release date on console : March 2008 (released 2 years after Oblivion). Release date on PC : October 2012   Worst game ever : - Even Twilight have better Scenario (wtf?) - The graphics look like the haircut of Justin Bieber  - There is no music, just silence - The game have so many bug, i was blocked in the story and we can't jump with 360 pad.  Just lost 3 ♥♥♥♥in' hours of my life.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, terrible port.",
            "review_score": "-1"
        },
        {
            "review_text": "  hmm..this game is good for seeing if the uninstail butten works",
            "review_score": "-1"
        },
        {
            "review_text": "Just stick to making Total War games",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know why I own this game, and if you own it you shouldn't either. It's bad, really ♥♥♥♥ing bad. Don't bother. Really why the ♥♥♥♥ do I own this?",
            "review_score": "-1"
        },
        {
            "review_text": "A friend has gifted me this game but I did not notice it for a period ..Then i decided to try it and it was surprisingly good for its ptice and its limited fame ! I was really interested to see the outcome of our protagonist's adventure but most importantly the game was running smoothly even at my low end desktop so this made it a nice break from some strategy games I like playing in my laptop so It is definitely a nice catch when it is on discount to spend your time with some old good battle ...Just keep in mind that you may be a viking warrior but rushing without a plan will never let you achieve your goals even if you face the lowest level enemies",
            "review_score": "1"
        },
        {
            "review_text": "Such a wasted opportunity. Sluggish glitchy crap. An hour was all I could bear.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing terrible. seriously",
            "review_score": "-1"
        },
        {
            "review_text": "Not too bad of a game, but it is kinda unplayable considering the controller function is super buggy and mouse and keyboard seems to have no functionality at all.",
            "review_score": "-1"
        },
        {
            "review_text": "it's ok, but... have some bugs, and that champ move with 0,00000000000001 m/s",
            "review_score": "1"
        },
        {
            "review_text": "lol it sucks copious amounts of weiner",
            "review_score": "-1"
        },
        {
            "review_text": "Better with a xbox controller, but I think it's playable with mouse/keyboard (since it's what I did).  A good action game, rather repetitive, but with a few good setpiece and a handfull of big battles",
            "review_score": "1"
        },
        {
            "review_text": "RPG? Nah! I do not know what that is, but it is for sure so… Shallow and just bad… Okay, I played only an hour but the gameplay and quests that The Vikings offered me during that hour were enough for me to uninstall it and never play it again.  Pros: - A Viking game - Swarms of enemies  Cons: - Awful graphics - Stupid quests - Horrendous combat system - The stupidest AI I have ever seen in a game - Disappointing, grey world  My rating: 1/10 – based on an hour experience ",
            "review_score": "-1"
        },
        {
            "review_text": "Delightful way to hack through a few hours. I sat down and lost at least four hours on at least two differnt occasions. Amazing gory detail. Feels just like being on the front lines of a siege in any of the medieval total war games. The giant battles with dragons assisting you overhead and the army of men you asseble along your journey really make the game feel like a story with progression. I couldn't tell you what the story was but I had a blast. However I did get this for free from that sega make war not love thing so you might want to take this with a grain of salt. For what its wot=rth I had fun despite the flaws others bring up. I hope they can make it better and more epic if they do make a sequal to this, as this has the best battle sequences I have seen in a hack and slash, which admiteddly I havent played many of.",
            "review_score": "1"
        },
        {
            "review_text": "I have to agree with what many have said.. the idea of this game is great.. the graphics are decent enough.. but the gameplay.. that is where it falls flat on it's face..   If you are in a group of enemies larger than 3, you are going to be killed.. OVER and OVER and OVER.. why? because the gameplay mechanics are HORRIBLE.. some sort of lock on thing that fails horribly... blocking that is next to worthless.. and random pot shots by some offscreen medieval sniper or someshit.. I wouldn't buy this game if they offered it free, honestly.. you will get frustrated in the first hour..   I have tried getting back into it several times.. but, after I write this review.. I am removing it from my pc.. it's just junk.",
            "review_score": "-1"
        },
        {
            "review_text": "Surprisingly awesome for what it is! This game managed to hold my attention and provide me with many hours of fun and joy despite its numerous shortcomings. I can recommend this to people who think they'll like it, and are prepared to get through the somewhat monotonous gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "It kind of reminds me of Dark Siders without the horse and puzzles. It isn't fantastic but it did entertain me through finishing the normal campaign and I didn't ever feel like I should quit. Yeah, it isn't perfect (lack of horse) and the controls kind of suck (Xbox 360 controller) but neither will stop me from replaying it should I get the urge in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the more relaxing action games I've played. Given you do the same thing over-and-over, for hours. The game's combat isn't horrible, but it isn't good. There are moves that are just simply better. (jump + heavy attack kills most things in one hit.) But the most important move is shoving. Why? Because in this magical world of Odin-loving-bearded-manly-men, falling from anything more than three feet causes everything to die of a heart attack. So you will probably find yourself fighting near cliffs.  The music was very good! Albeit, you'll probably enjoy running from landmark to landmark (as fast travel is more of a task than anything in this game) with Amon Amarth playing instead.  All-in-all, the game was mindless and fun in a way. Despite being ridiculously bland in that it didn't change anything up from minute 1 to hour 8 of playing. So if you like time waster games with lots of filler, then it's the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "There are no game guides and tutorials for this game. You are lietrally in the dark fumbling around trying to figure out what to do against large amounts of enemies that are just going to slay you and send you back to the starting point. The allies that you rescue don't bother to join you and help you either. You may as well leave them locked up.",
            "review_score": "-1"
        },
        {
            "review_text": "A mediocre port of a confused mess. Die-hard fans of the genre will probably enjoy it, but everyone else will have, at the very least, spurts of frustration throughout.   PROS: -It isn't terrible at anything it does (but it isn't good at anything it does either).  NEUTRALS: -OK Graphics -Default key remaps are actually OK to play with, but they are NOT intuitive by any means.  PROTIP: Left click equates to 'quick attack' and E equates to 'strong attack' (defaults)  BAD: -Poor death system. If you die, you instantly respawn (as in, before the final blow actually hits you you have already respawned in town)....and then you have to use a waypoint and run back to wherever you were....it is slightly tedious but combined with... -TERRIBLE edge mechanics. Many times a single enemy blow (OR YOUR OWN ATTACK) will cause you to fall over a cliff...to your death instantly...which means respawn in town, teleport to nearest waypoint, run back.....very annoying, especially combined with... -CLUNKY controls -Poor level design (results in excessive amounts of walking due to poorly placed waypoints) -Mediocre port (it isn't the worst port ever, but it is pretty bad....esp the map navigation) -No mouse support in menus / map screen -'Mash F' to interact with objects. I don't know if gamepad players like to do this for some reason, but it certainly is not fun to mash a keyboard key repeatedly just to use a waypoint / interact with world objects / open chests / etc. I'd rather just push it once, or if I have to, hold the button.  Many better games in the genre. Pass on this one.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring, blocky controls, and extremely repetitive. The combat is cool for a while, but I couldn't even bring myself to finish it.",
            "review_score": "-1"
        },
        {
            "review_text": "Viking Battle for asgard is a great game for those who like stealth and leading your armies ito battle as your men shout raising there axes and slicng the orcs down. its a challenging game and takes skill although the combat is a bit repetitave with block strike fire ball but all and all its a good game and i would rccomend.",
            "review_score": "1"
        },
        {
            "review_text": "I will start outI will start out by admitting I didn't finish this one, the camera was so jerky it started making me nauseous and couldn’t play more than 15 minutes at a time. I got as far as letting the drawbridge down so your army could advance to the second area and I gave up. This is a really bad port from a console game, the controls are wonky, the camera is terrible, the animations are poor, and the graphics are mediocre. I got this game in a Humble Bundle cheaply so I can’t complain a whole helluva lot but I just can’t recommend this game for how poor it performs.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game but you need a very powerful computer :)",
            "review_score": "1"
        },
        {
            "review_text": "Open world hack and slash game which is a bit like Shadow of Mordor but much more awful.  ----  + Everything about it reminds me of lord of the rings + There are moments when it's not totally awful + The idea of the big battles is a good one  - There's barely any story to speak of and what there is is not engaging - Combat is spammy and clunky - Killing blows often require quicktime inputs that you can expect to do over and over again - You will constantly get attacked from off camera - The open world is empty and bland - Traversing the world is slow - Missions are mostly repeats - Enemies are frustrating - Overall experience is akin to removing a splinter from beneath your finger nail  ----  Viking: Battle For Asgard is an open world hack and slash game with terrible combat, frustrating enemies, a big empty open world with a bunch of repetitive tasks to complete, and some not-featured-often-enough dragons.  I felt compelled to finish Viking: Battle For Asgard before I reviewed it in order to give it a fair shot. One positive thing I can say about the game is that towards the end the amount of time it takes to get from one place to the next drastically increases. This gave me plenty of time to think about how bad the decision to try and finish this game before I reviewed it was in full. I will never get those 15 hours back.  For all that effort I don't even have anything intelligent to say about the game. I found the experience of playing it to be oddly compelling but in a purely masochistic way. I disliked it to the extent that in the end it was worth playing because of the wave of ecstacy and relief that washed over me when I finished it.  I don't think it's a particularly 'bad' game, it's just so utterly mediocre and boring. And that's so much worse.  Don't do this to yourself.",
            "review_score": "-1"
        },
        {
            "review_text": "Got this game for free in a Sega give-away. Even though it came into age, was fun to play. Sometimes keeps you busy walking but great story. If you get it cheap, I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "  -Bad fighting -Terrible voice acting -The main character is a piece of blank paper",
            "review_score": "-1"
        },
        {
            "review_text": "Good Graphics,  Repetitive Gameplay, Predictable plot, Dull soundtrack, Slow &amp; Robotic character movements, Poor illumination at the game's dungeons. Might be an enjoyable experience,  (Actually, in the middle of the game I started having a good time with it) ^^",
            "review_score": "1"
        },
        {
            "review_text": "  The fact that this game was capped at 30 fps and stuttered on my build (AMD FX 8350 - 4.0 Ghz, Sapphire 270X Vapor-X - 2 GB, 8GB G.Skill RAM) is why I down-rated this game. Looked cool, but unplayable with the lag and stutters. I got it for free, so I guess I can't complain too much, though I can see why it was free.",
            "review_score": "-1"
        },
        {
            "review_text": "Do you love the styling and grinding of World of Warcraft? Was God of War TOO good of a game? Do the puzzles totally detract from the experience? Do you love Viking mythology and history, but absolutely hate learning anything about it? Do you love quick-time-events, bad voice acting, and intermittent bugginess?  If you said yes to the these questions, this game is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Crashes alot and is very simplistic/repetitive. Had better memories of this before.",
            "review_score": "-1"
        }
    ]
}