{
    "app_id": 211180,
    "name": "Unmechanical",
    "release_date": "2012-08-08",
    "developer": [
        "Talawa Games"
    ],
    "publisher": [
        "Teotl Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Casual"
    ],
    "achievements": 17,
    "positive_ratings": 371,
    "negative_ratings": 28,
    "price": 6.99,
    "description": "A carefully created world with unique environments and an engrossing atmosphere, Unmechanical offers over 30 unique puzzles of exploration and adventure!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/211180/header.jpg?t=1452457726",
    "minimum_requirements": "OS:Windows XP SP3 or Windows Vista Processor:2.0+ GHz or equivalent processor Memory:2 GB RAM Graphics:SM3-compatible video card DirectX®:9.0 Hard Drive:1 GB HD space Sound:DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Falling down a pipe and awakening without a clue, Unmechanical sees you taking control of a little flying robot lost in a vast underground mine, as it travels through tunnels solving puzzles to open pathways in the hope of ever seeing the surface again. It's a brief, ambiguous journey that leaves a lot open for player interpretation (occasionally too much), but accomplishes a great deal through context and the brilliantly imaginative environment around you. I had no idea what I would be getting when I first started it up, but by the end was immensely glad I had given it a chance.  The first surprise came in the form of the fantastic visuals, which put Unreal Engine 3 to use more effectively than I've seen from some AAA games. Gorgeous lighting, a creative and evocative art style, and some very clever use of cinematography make moving through the dark mines a beautiful affair. It also helps infer a lot of the narrative, that without any exposition is impressively well realized if you take the time to take it all in. I do wish the ending was a bit more substantial and obvious when it was coming, but being able to quickly reload and see both alternatives put them both in better context (even if they still feel a tad rushed).  The second surprise was that despite my prior assumptions, Unmechanical isn't at all a standard physics puzzler. Instead, every puzzle is contextually placed throughout the world making them more meaningful and the world more engrossing, and avoids falling back on the same types of puzzles as each is unique to the area it resides in. None of them are particularly challenging or involved, but the way the all fit so well within the world and manage to loop back around to each other is brilliant, and shows a level or forethought by the developers that's often missed in a lot of games.  My only real issue is that Unmechanical does a very poor job of conveying where and what you need to do next. Half of this is intentional, as it allows the player to discover things on their own instead of being spoon fed along a linear path, but the other half is simply poor design as paths are often obscured or off screen without any indication you are meant to go back and look for them. This mostly meant I had to rely on the hint system a good deal more than I would have liked, but even then it wasn't entirely effective at guiding me to the next area when I got stuck, which more often than not required me to stumble around and explore every nook and cranny until I found a tunnel I'd missed or a door that had become unlocked.  Aside from that frustration, Unmechanical was remarkably enjoyable. Nothing about it is especially memorable, but I was engaged the entire time through and disappointed when it ended so soon. Though it seems to have flown under the radar for most, I hope that this isn't the last we see of Unmechanical, as for the developer's first major release the quality is already impressive and would likely only improve in a more expansive sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Very short game. I beat it in about 2 hours. So length is a factor you'll probably want to consider. That being said, it's a great puzzle game and the length is just about right. With a game like this, I could maybe see it becoming tedious if it dragged on for 20 hours. Sometimes it's better when a game knows just how long is long enough, and I think Unmechanical knows perfectly well.  There is no combat or action in the game to speak of. It is 100% a puzzle game. The gameplay reminds me a little bit of Insanely Twisted Shadow Planet, but minus the combat, much more emphasis on puzzles, and MUCH more atmospheric. The lighting is excellent and there are some complex and gorgeous backgrounds as well.  The only controls you have in the game are directional movement and the ability to lift / carry light objects using a tiny magnet beam. You wouldn't think much interesting variety would come out of just that, but the puzzles actually stay pretty fresh and interesting all the way through.  I'll admit there were one or two puzzles that I managed to solve, but I'm not entirely sure what the logic of the puzzle was or why the thing I did worked, but you are probably smarter than me. ;-)  It is a very short game, which may give you pause at the $10 price tag, but if the game is on sale or if you want atmospheric puzzlers badly enough, you really can't go wrong with Unmechanical.   On the scale below, despite whatever doubts I might have about the price-to-length ratio, I'm gonna say that Unmechanical just barely scrapes its way into a 6 for me.  7) A classic, essential, and/or must-buy game that is worth full price.  6) A good game that is worth the full price.",
            "review_score": "1"
        },
        {
            "review_text": "“The art of simplicity is a puzzle of complexity.”  Unmechanical is a 2-D platformer game by the company Talawa Games with emphasis on puzzles.  Atmosphere &amp; Details:   + Unmechanical introduces the player to a fascinating, mostly mechanical world with only a few organic components.  + The sterile art direction creates a rather cold atmosphere. + The update 'Unmechanical Extended' adds another, shorter campaign.  o Solid background music.  Puzzles &amp; Gameplay:  + The player has to utilize various objects in each level.  + Well done implementation of physical effects, and the inertia of objects based on their size and weight.  + Some puzzle sections demand a rather high level of logical thinking and physics oriented problem solving.   o For the simple controls a controller is recommended.  Character &amp; Story:  + At the end of both campaigns the player may choose between two different endings.   o Relatively short game that can be finished within a few hours.   - A minimum of story telling elements. - No characterization of the protagonist.  - No voice acting during the entire game.   Summary:   Unmechanical is a short and entertaining 2-D platformer, that offers a fair amount of challenging puzzles. For a potential successor a cooperative multiplayer might be an interesting addition, which would allow for more complex puzzle sections.  --   Estimated time for 100 % completion: +3 hours  15 of the 17 challenges can be obtained during the main campaign. The achievements 'There and back again' and 'Self Sacrifice' are part of the extended campaign, which must be selected separately in the main menu. There are no multiplayer achievements.  Aspirant level of commitment (achievement difficulty: 2 of 10)  Above average intelligence [+1] That's why helicopters need elevators [+1] --  Unmechanical (PC) - 2-D platformer game (Fantasy) - 2012 --  Please also check out the Completing the Backlog’s Curator page   here   – follow for the regular updates on reviews for other games.",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds of the parts of Oddword where you possess a flying slig and zoom around, minus the shooting. Instead, your robot has a small tractor beam used to pick up and manipulate objects. You do so to overcome obstacles to continue your progression through the game.   Overall, this is a well-made, good-looking little game. It reminds me of a cinematic platformer (well, without the actual platforming) such as the aforementioned Oddworld and the original 2D Prince of Persia games. You hit switches in the right order and solve environmental puzzles to progress.  Very fun and it doesn't overstay it's welcome. Admittedly, the endings are somewhat understated and not as rewarding as they could be, and replayabiity is fairly low. But it's overall a good time while it lasts.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the prettiest and aesthetically pleasing games I've played in awhile; It's so unique and likable. Unfortunately it only lasted me about 3 hours, even with ample amounts of time just dicking around with the physics and lighting. Totally worth 10 bucks for me, maybe not for you.",
            "review_score": "1"
        },
        {
            "review_text": "Very short but i liked very much, i found it more interesting than a lot other puzzle games.  This review is not very objective, go check other reviews.",
            "review_score": "1"
        },
        {
            "review_text": "Cute little puzzle game. Puzzles aren't too hard, game isn't too long.",
            "review_score": "1"
        },
        {
            "review_text": "I have not played such a (design- and programme-) flawed buggy game in a long time. This is by far the worst thing since Botanicula (by Amanita Design).  Design-flaws: 1. YOU CANNOT SAVE YOUR PROGRESS!!! What kind of a game does not allow individual files for separate players. Saving occurs… but is completely out of your control. 2. movement is frustrating. 3. some of the puzzles are nerve-rackingly inexact. 4. some of the puzzles involve almost physically impossible feats, e. g., in one of them, one has to move a ball between a barbed wire of electrified nails with the help of two magnets, that are supposed to keep the ball delicately afloat without touching the nails. The puzzle is so sensitive and as good as IMPOSSIBLE: after something like 100 tries, I had to give up. I literally cannot play the normal mode beyond this point. Goodbye 10 €.  Programme-flaws: * Individual saving is not possible * when you ‘continue’ a saved game the bot gets placed at the start of the level. YOU LOSE PROGRESS and perform the tasks all over again. The worst thing is, the game knows, you've done this and you get stuck in an in between state—some of the doors don't open anymore and you literally cannot play anymore.  Summary: Neglected, terrible programming. Steam should demand, that this game be debugged.",
            "review_score": "-1"
        },
        {
            "review_text": "Another game that starts out well as a relaxing puzzle solver and then wham it turns into an idiotic platformer! So glad I got it on sale. It does have some nice ambiance. Should have read the reviews more closely. YMMV so good luck....",
            "review_score": "-1"
        },
        {
            "review_text": "A relaxing puzzle game with some nice character interactions. Some bits were hard to understand and fiddly controls, but enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Okay game. Okay puzzles, quite fun, some nice details, and an odd, janky, sudden ending...",
            "review_score": "-1"
        },
        {
            "review_text": "ehh gets boring quick",
            "review_score": "-1"
        },
        {
            "review_text": "Nice graphics and atmosphere, the puzzles were decent, but it was really short (~3 hours). I would recommend picking this game up during a Steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game has some really good puzzles. Want more!",
            "review_score": "1"
        },
        {
            "review_text": "Hopefully if game works on the machine of the customer I can tell from the beginning this game has a promising sweet immersive atmosphere and without technical problems is more than totally worth it on discount or not in my tastes.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, short puzzle game. Nothing too hard in my opinion, but the puzzles did involve some situational awareness. Interesting art style and 'story' reminiscent of Mechanarium. With no hints the game took me about 3-4 hours to complete. Worth a few bucks and a few hours of your time.",
            "review_score": "1"
        },
        {
            "review_text": "good game with GREAT DESIGN/BACKGROUND, it also have CLEVER PUZZLE.  however it is SHORT   I suggest you wait for a PRICE DROP",
            "review_score": "1"
        },
        {
            "review_text": "Simple, attractive, fun. Need something else?",
            "review_score": "1"
        },
        {
            "review_text": "great game if your looking for a puzzle game, lovely music, the robots are cute and the puzzles are indepth, the game doesnt tell you anything, not even the controls, but thats fine, its not at all difficult to master.  there was a part i was a little anoyed with, you cant enter water, thats fine, but there is a puzzle that involves it, this perticular water has different physics compared to the rest of the water in the game so i never knew to use it, i spent ages stacking baulders on a gurder to make a metal baulder attach 2 wires together, where all you had to do was drop everything in water, and the water raises, the current goes through the water, this was unclear as water everywhere else doesnt get higher the more items you chuck in it.  other than that, definatly recommend",
            "review_score": "1"
        },
        {
            "review_text": "Beautifull graphics. Good platformer.",
            "review_score": "1"
        },
        {
            "review_text": "A neat little bite-sized physics puzzler. The expected play time is 2-4 hours so I dont recomend spending much on but its worth the buy. The 'story' is strange but enjoyable and the visuals are fantastic. Most of the puzzles require a little thought to complete and its rather refreshing to actually have to piece together the clues to figure out a puzzle rather just knowing the end result and working backward to solve it. This can lead to some frustrating times but it also makes the eureka moment all the more satisfying.  4/5",
            "review_score": "1"
        },
        {
            "review_text": "Really great puzzle platformer game. Lots of unique puzzles and the puzzles are not frustratingly difficult but rather intuitive if you're paying close attention. The ending(s) is a little weak and leaves a lot to be desired. It's rather short (~2 hours) but worth picking up at a few bucks. 4/5 Stars",
            "review_score": "1"
        },
        {
            "review_text": "Cool puzzle game. Plus excellent graphics and nice music.",
            "review_score": "1"
        }
    ]
}