{
    "app_id": 211280,
    "name": "Primal Fears",
    "release_date": "2013-01-08",
    "developer": [
        "DnS Development"
    ],
    "publisher": [
        "DnS Development"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Co-op",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Co-op"
    ],
    "achievements": 29,
    "positive_ratings": 172,
    "negative_ratings": 120,
    "price": 6.99,
    "description": "Due to a chemical known as pharGONe, the world has been turned upside down. Battle your way through multiple levels, earning upgrades, competing against your friends and more, and find the truth about what has happened to the world.Use a variety of weapons to stop the mutated population, and save yourself from being another victim.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/211280/header.jpg?t=1447355723",
    "minimum_requirements": "OS: Windows XP Sp3, Windows Vista Sp2, Windows 7, Windows 8 Processor: Intel Core 2 duo 2.4Ghz or higher Memory: 2 GB RAM Graphics: Shader 3.0 or better, NVIDIA 9800 GT 512MB RAM or better, ATI 4850HD 512MB RAM or better DirectX®: DirectX 9.0c Hard Drive: 2 GB Space Free Sound: 100% DirectX 9 Compatible Other Requirements: Broadband Internet Connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I thought this game was well worth the money. Id say 4 dollars, Max if your a solo player. I could see a bit more if you buy it with friends.  Very good game with a odd story, its similar to How to Survive with a bit of dead space? For 4 bucks I would totally say get this game, although I am unsure just how much replayability there is, if any.   The story is hectic and would make no sense, its good writing but what government lets a third party spray 'Gas' all over the city, without testing it on humans? Not the worst thing in the world but deffinately not something to scoff at either, do your writing better!   I really like the controls and was surprised at how fluid they were, and how you had to be facing a direction to move faster, otherwise you walk. Makes for nice 'Back up to wall and shoot everything epicly' scenes. Using the E and Q buttons you can change the direction of the camera, and while the camera is very high up and sometimes very restricting, it was well done and made me feel like any time I tapped E or Q by accident that it was a whole new experience, which it wasent but feels that way.  The monsters got annoying a big part of the issue for the game for me. Half the guns are useless, as the only ones I used were the M4 and the Launcher, an entire clip kills two basic guys... normal difficulty. It was crazy because if 6 guys came up to you, then you spent 5 minutes trying to run back and shoot then run and shoot. Not much strategy.  Also you knew every trap, almost every secret is hidden by a onslaught of enemies waiting for you to pass the invisible line. It was annoying because it was expected everytime.  Id say 7/10 for the type of game its meant to be, and the price of 4 dollars. Any cheaper and id rate it .5 higher for every buck less.  ",
            "review_score": "1"
        },
        {
            "review_text": "What can be said about primal fears? well it is an updated version of dead hoard, there just isn't really much change with this game there are only one or two variations of specimens that have a different size and skin texture but are still the same well let's go through the list.  Pro's  -More Weapons! -Hub World(Camp) -An Arena -Moveable Props  Con's -Moveable Props...(they can get in your way) -Not enough enemy variation -Enemies absorb way to many shots. -Limited sprint 3 seconds(can't roll)useless since most enemies can catch up to you anyway. -Always night. -Cannot shop in peace(shop menu doesn't pause the game also cannot buy medkits) -Re-used enemy jumper(which was in dead horde) -Level design is dull and cliche'd. -One level can take from 15 to 30 minutes to finish depending on difficulty. -Melee weapon is useless in any situation and serves as a joke when you could be spriting away for 3 seconds.  Overall i would say this is an avarage shooter, no real innovating ideas or any new concepts, just reused boring ideas, if you are interested in shooters and just want some mind numbing fun, buy it, if you are looking for something new and interesting, don't buy it.  if you want something similer try nation red or zombie shooter which will prove more fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice lil zombie co-op Shooter. Of course you can play singleplayerbut why??",
            "review_score": "1"
        },
        {
            "review_text": "It is fun to play with friends. and should always be together for fighting massive hordes of creatures. Nice graphics for a $0.99(after discount) game :D",
            "review_score": "1"
        },
        {
            "review_text": "The best shitest indie co-op game this year get it its $10 you can't go wrong",
            "review_score": "1"
        },
        {
            "review_text": "Good game for 69p",
            "review_score": "1"
        },
        {
            "review_text": "This game is neither good or fun.",
            "review_score": "-1"
        },
        {
            "review_text": "+ Unabashedly action-packed, providing scores of different enemies in gigantic groups.    - Repetitive and lacks depth, but it's still a fair improvement over Dead Horde.",
            "review_score": "1"
        },
        {
            "review_text": "The Game is Poorly built and does not have a good feel to the gameplay",
            "review_score": "-1"
        },
        {
            "review_text": "-PRO- -pretty good idea for a game. -kinda scary at some parts.  -CON- -aiming is ♥♥♥♥. -some levels can get you lost easily. -♥♥♥♥♥♥ monster designs (some looks like meatball with legs). -cant see anything once in side some buildings. -pretty boring gameplay.  overall 4/10 meh  ",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ you ♥♥♥♥ing Simon ♥♥♥♥♥♥ ♥♥♥ ♥♥♥♥♥ bought me this ♥♥♥♥. Im killing my self now.",
            "review_score": "1"
        },
        {
            "review_text": "Great game not what I expected. 3/10",
            "review_score": "1"
        },
        {
            "review_text": "Worst game evah !",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this ♥♥♥♥.",
            "review_score": "-1"
        }
    ]
}