{
    "app_id": 211440,
    "name": "Adventures of Shuggy",
    "release_date": "2012-06-13",
    "developer": [
        "Smudged Cat Games Ltd"
    ],
    "publisher": [
        "Smudged Cat Games Ltd"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Platformer",
        "Indie",
        "Puzzle"
    ],
    "achievements": 13,
    "positive_ratings": 955,
    "negative_ratings": 149,
    "price": 3.99,
    "description": "Shuggy has just inherited a castle full of goblins, ghouls, zombies, and robots. Help him clear out over 100 rooms to make his new home liveable again!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/211440/header.jpg?t=1447355738",
    "minimum_requirements": "OS: XP Processor: Dual Core 2.0 GHz Memory: 512 MB RAM Graphics: 128 MB Video RAM and at least Shader Model 2.0 DirectX®: 9.0 Hard Drive: 82 MB HD space Additional: Xbox 360 controller officially supported",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Adventures of Shuggy 10 / 10  A Great 2D platformer.... Really good mechanics that will work your brain.... Rotating worlds, learning to simultaneously use 4 different versions of controls for individual characters... Time shifting.... this is BRAIN TRAINING at it's best.... and all in a Mario kind of way.... Gems, Cute little sounds for everything.... and it's gets tough, really tough....  I usually like really easy 2D platformers so that my brain can take a break between difficult Adventure games or Intense Shooters.... but this Platformer is really Great even though it is eventually hard.... it provides a great variety of game mechanics that will keep you interested....  Thanks to 'The Man' for gifting this to me.... 'SWOOSH'",
            "review_score": "1"
        },
        {
            "review_text": "I'm not much on platform games, but this puzzle-platformer from Smudged Cat is a surprise. The premise is to solve the puzzle of collecting all the gems in the individual rooms of a castle inherited by Shuggy using the different mechanics built into the game.  As someone lacking the dexterity to play the super difficult platform style games of late, I really appreciate the fact that the mechanics are simple to understand and use, but at the same time offer some challenge.  The challenge is in thinking through just exactly how to approach each room so you can move on. And the keyboard worked just fine for me.  The graphics are cartoon style and very well done ---- clear and bright in every level. The music is really good keeping the mood bright.   One of those games that you can get involved with for hours, and not be aware of the time that has gone by. All ages will enjoy this one.",
            "review_score": "1"
        },
        {
            "review_text": "The Adventures of Shuggy follows a feline vampire who just inherited a new house. Unlike a certain other popular Vampire; Shuggy doesn’t get along with the undead, ghosts, monsters, or even robots. Instead, these foul creatures are haunting his new home and wrecking havoc. In order to boot these pests out of the house, Shuggy has to collect a mess of gems and bop a few bosses, over the course of 116 levels. It is an impressive number no doubt, but the game is reasonably paced as all of the levels should take no more than two minutes a piece to complete. Although, you’ll be replaying those levels over and over again, because two minutes is an awfully long time to spend on one level. If you want to compete on the leaderboards, your best times have to be in seconds.   The puzzle-platformer is about as simple a genre to explain as anything. In order to collect all of the gems in each level, Shuggy will probably have to do more than just jump on top of things. Each level is defined by its gimmick. This could be something direct like Shuggy being able to jump really high, or it could be something obtuse and unique. For example, Shuggy could have to use multiple versions of his self or direct little buggers called Shmus to unlock gem-holding cages. Shuggy’s mansion is divided into five different areas, and some will focus on a particular level-type more than others. Even though the gimmick changes constantly, the basic mechanics are very sound, and it takes mere seconds to figure out what to do. This aspect of the game so well done that I don't think it's fair to even call them gimmicks. Shuggy rotating the entire level to reach gems or switching between clones to reach switches is just as natural as running &amp; jumping.  Shuggy is the fragile type, so he has to worry about nasty creatures that walk, jump, fly, fall, and roll. Also questions must be raised about anyone who decorates their home with spikes. Worse still there are also time-distorting levels where Shuggy must use his past selves to step on switches and open paths to gems. Ever seen Time Cop? What happened to the villain can also happen to Shuggy, if he ever makes contact with one of his selves. Thankfully, in this game it isn’t quite as gruesome but the result is definitely something to be avoided. I’m particularly fond of these levels, since they require Shuggy to take differing paths around the room, and to pay attention to where Shuggy-from-5-seconds-ago is going next.   All things considered, death will become the least of your worries before long. Even after you have figured out the solution to the level and grabbed the key, chances are high you’ll want to go back after seeing your position on the leaderboard. Where this game really shines is in replaying levels, trimming seconds or even half-seconds away. There is also an absolute #1 ranking, so the satisfaction of taking that coveted spot, just might be worth the trouble. Some will say that puzzle games lose their purpose when the puzzles are figured out, but thanks to the great controls and mechanics, there is almost always room for improvement.  There is multiplayer support, but my advice is the following: Look into making an open-minded friend in your town OR convincing whoever your dating that this isn’t like those murder-simulators you usually play OR worst comes to worst, begging your parents to have another child. There are 36 cooperative levels, and some additional competitive modes to play, but you need a couch-buddy to coop. From what I can gather the cooperative mode is more than just two Shuggys grabbing gems instead of one. You actually have to work together and co-exist in a fashion, that does not lead to harm for one another.   Game reviews are to nitpicks as an octopus is to ink, so while this game is a quality affair, I can’t very well say I’m done with my review until I get my nitpicking on. Whenever a level begins I would prefer if there was something like a countdown before control is handed to the player. It takes a second or two for Shuggy and all of the objects to spawn into the level, but while those things are happening, Shuggy can move around. It doesn’t take much to memorize what I want to do in the first couple seconds of the level, so thankfully this isn’t a serious issue. There is also a certain random element to the game which I’m kind-of iffy about. A couple of enemies have unpredictable movement patterns. This introduces an element of randomness, which doesn't gel with speedrunning. This isn’t an easy fix since the nature of these enemies gives them their identity, and their change or removal could possibly worsen the game. I’m not quite 100% sure either way, but I still think it is worth mentioning.  While I have my reservations about particular aspects of the game, and the lacking multiplayer support is quite a shame The Adventures of Shuggy is a charming and fun bit of entertainment that I definitely believe is worth your consideration. Again I’m not an expert on the subject of puzzle-platformers but I am a veteran when it comes to recognizing quality. As far as I can tell this game does most everything right.  *** For those wondering about the time spent on this game, I played through the Xbox 360 version. This review is a slightly edited version of one that I wrote for a now-defunct website.",
            "review_score": "1"
        },
        {
            "review_text": "It could be a little nice platforming game, the mechanics aren't that bad. I just hate the movement feel – it's wrong and gooey IMHO.  Oh, and the game is really punishing. Make one mistake, and you restart a level. Having played Super Meat Boy I should've been used to this – I love SMB – but here, the game being a lot slower, restarting is a real torture.",
            "review_score": "-1"
        },
        {
            "review_text": "To start: I used to add a header to these reviews, but since it often made the review too long to submit, I've opted to leave it on my Backloggery.  Gameplay: oh boy another puzzle platformer brought from XBLA time to not recommend it- Wait what? It's actually not half bad? ...you sure? Huh, so it is. Adventures of Shuggy is a puzzle platformer whose main attraction is many stage gimmicks. One stage may have you rotating the entire stage, another one may have you teleporting all over the place, another may have you be zombified so that you can jump and only jump... there's a lot of gimmicks. There's a lot of stages as well; 112 stages in the main game and 40 extra in the teleporter-focused mode. Out of all these levels, there were only seven or eight that I felt were legitimately kinda terrible. Fortunately, there's a lot more than that for levels that are really quite clever with, y'know, actual puzzles.  The platforming itself isn't bad, and in fact there's really only one complaint I have about the platforming, and that is inertia. Shuggy actually has a lot of inertia, meaning that you can very easily end up falling off of a ledge due to your own inertia. You can kinda deal with it after a while, but it's still kinda obnoxious even once you get used to it. Another thing that could be a problem for some is that Shuggy is actually pretty dang fast. There is a bit of precise platforming here and there that could prove tricky for some due to how fast and how inertia-laden Shuggy is, but it never was the top speed that gave me any problems.  There's also boss battles in the game, although they're more akin to boss battles from a game like Donkey Kong '94. I did quite like all of the bosses, and they all took at least some thought and careful planning to defeat. Again, they're, y'know, actual puzzles. It's hard really to talk too much more about this game's gameplay, as the core mechanics are quite simple, and the complexity of the game comes from these gimmicks. There was one gimmick that I enjoyed only about half of the implementations of (Shuggy temporal cloning) and one gimmick that I didn't like at all (wall-crawling Lemming carting around). Apart from those two gimmicks - and they're largely toward the beginning, so if that's causing you duress, just push through; it gets better - I had a great deal of fun with this game. Some other reviewers mentioned a lot of waiting around, but honestly; it's not all that bad. Unless you have super-ADHD, it's really not going to ruin your day. Unlike a lot of puzzle platformers, I can see myself coming back to this game in the future. For $5, it's a great deal. For the $0.49 I picked it up for during the Winter 2013 sale... that's highway robbery. 8/10.  Story: There's not much, really. It's all told through a faux-comic book style presentation. It's honestly not worth rating, as it for the most part stays on the backburner for the gameplay to shine through.  Graphics: It takes a bit of a hit here for two reasons. Reason one is that this game either windows in 720p or fullscreens in 720p. The portiness of this game is quite obvious here, since the 360's maximum resolution for gameplay was 720p. As for the art style... it's alright, but it really does have that 'XBLA-look' to it. I'm not the best at pinning this sort of thing down, but I think it has to do with how the XNA kit handles gradients and sprites in general. It's not bad, but once again, it shows that this was once an XBLA game. Kinda disappointing, honestly. 2/5.  Sound: Sound design isn't the biggest deal for this game; it's mainly some obvious sound effects and that's about it. As for the OST, it's not a thing that I'd get to listen to on my own time, but it's good enough in the context of the game. It's a decidedly jazzy OST which is partly why I'm not too keen on it, but that's because I'm 2dumb2jazz or something. If you're into that kind of thing, maybe you'll want the OST for yourself. 3/5.  Overall scores are: 8/0/2/3; 6.5/10. A game with great gameplay design that is unfortunately hindered by some less-than-amazing AV stuffs. Again though, for $5 (and especially for $0.49), this game is a great deal, and will provide you with a day or two of mostly good times.",
            "review_score": "1"
        },
        {
            "review_text": "I like a lot of things about this - some of the puzzles are really quite clever etc.  The whole thing is let down by horrible controls tho. You start moving really slowly, bui;ding-up speed the longer you keep moving. This means movement ranges from 'sticky' to 'wild' - just stepping-off a ledge is an exercise in frustration - timing jumps etc. is just frustrating.  Note: coming from the XBOX and having access to an analog joystick and not using it is a bloody weird choice!?  Anyway - spoils the entire game for me, controls should not be part of a game's difficulty...",
            "review_score": "-1"
        },
        {
            "review_text": "Don't let the simple graphics fool you, this is a speedrunner's game. The game mechanics is perfect, the controls are tight and the puzzles are clever.  This is one of those games that look simple, but is actually hard if you are trying to clear each level as fast as possible.  At its price, I highly recommend this game to any platformer or speedrunner.",
            "review_score": "1"
        },
        {
            "review_text": "For those who enjoy simplier games this game is definitly a winner. Although nothing like them, it gives the feeling of a good retro game from the old days of the Super Nintendo.",
            "review_score": "1"
        },
        {
            "review_text": "Can you call a game good when upon completion of the many levels you ferociously proclaim 'Yeah, beach! In you ♥♥♥♥ing face!!!' There is a little balance actually. Some levels, required to see THE END screen, are so small and simplistic it makes you re-check the game info (was it addressed to elementary school?) while others are annoyingly difficult with nothing in between. And believe me that's the worst kind of difficulty there is. You wait, wait, wait... make a jump that is not 100% precise, fall and wait for the right sequence to happen again. Annoying and boring - the perfect mix. Rarely it challenges your mind. Most of the time you know what you need to do in order to succeed but game mechanics stands in your way. Too primitive to be called puzzle and with levels so small (one screen - early 80's Donkey Kong style) and actions limited by one ability at the time game lacks drive to bring satisfying action. No storyline whatsoever (you see something - go defeat it). Few decent audio tracks that get repetitive long before you're done with the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Great little platformer game but not worth full price. So just take it if it drops low on price. It also contains Coop but only local mode.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and challenging game. Make something new in every level!",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game , i will finish it!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with unique, challenging puzzles and a nice clean graphical style. Unfortunately the only achievement I couldn't get was a local co-op only achievement. :( Fun puzzle-platformer if you get it on the cheaps though.",
            "review_score": "1"
        },
        {
            "review_text": "Adventures of Shuggy has a ton of content for its price tag with over a hundred levels, with a healthy variety in design and difficulty level. It has a bunch of interesting mechanics ranging from fairly standard tried and tested ideas like rope swinging or a super jump to more unique mechanics such as the time travel levels in which an echo of your past self follows along your exact path and kills you upon contact, forcing you to consider your steps so that you can come back later without bumping into yourself, normally with multiple past Shuggys running around at once making it fairly hectic. New mechanics are introduced at a healthy pace rather than throwing them all at the player at once, allowing for a fairly intuitive game experience. Boss levels are also mostly well designed with only minimal exceptions. You will die repeatedly and frequently but rather than cheap, frustrating deaths they can normally be learned from and then avoided. The soundtrack and art style especially give it a lot of character too, and you are not required to 100% the game in order to complete the main story which given the difficulty of some of its hardest levels is a blessing. Overall a fun little platformer with plenty of content and personality.",
            "review_score": "1"
        },
        {
            "review_text": "A cheap game, yet difficult. The game may seem simple at collecting emeralds and what not. Pretty soon, you have to do missions that involve time travelling controlled by your players actions multiplied by 2. What you do in the past affects the future.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice puzzler, I loved it! It was not boring or too much repetitive, I've enjoyed helping Shuggy with levels and bosses. And Shuggy looks so cute :)",
            "review_score": "1"
        },
        {
            "review_text": "ONE OF THE BEST PLATFORM GAME IVE EVER PLAYED,rated 9.99999/10 thanks",
            "review_score": "1"
        },
        {
            "review_text": "Its a puzzle game for 5 year olds that lacks any charm or originality.   Dont bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Super Addictive and Fun!! Try and get it when the price is low! :D",
            "review_score": "1"
        },
        {
            "review_text": "It's a good indie title worth your time. It's short but there's plenty levelsthat are puzzling, fun, interesting, aesthetically designed well. The main character, Shuggy, is cute and traverses through this castle and has to collect these gems and keys to continue. The UI is designed well. Very good color shading and the color pallet in general looks good. The music is good. There just really isn't a story besides beating the puzzles, completing the 5 main areas, and defeating the bosses in those areas in order to reclaim your castle. That's basically it.  8.0/10",
            "review_score": "1"
        },
        {
            "review_text": "Amaazing puzzles and mind blowing mechanics in a Mario way.",
            "review_score": "1"
        },
        {
            "review_text": "At first glance it looks like a boring newgrounds game but there are just so many levels and mechanics that it is far from it. Listing abilities through the levels there is speeding time, room rotation, growing/shrinking, floating, air jumps, jump only, rotate only, AI team work, multiple Shuggys, block placement, platform moving, teleporting, rope swinging and my personal favourite time cloning. Also features plenty of co-op specific levels, boss fights and leaderboards.",
            "review_score": "1"
        },
        {
            "review_text": "I love a good platformer - often a necessary diversion from the ultra real games. It takes me back.....back to my Commodore 64 days, where I might have played too much Chuckie Egg, Jet Set Willy and Monty on the Run in the 80's. Shuggy (and his adventures) therefore sucked me in to it's quaint and colourful world. What really made me come back to this game and complete it were the mutiple game mechanics used to great effect, the need to fill up the 'chieve list, and there is that which will bring me back still - the leaderboards. I'm in a few top fifties and maybe even a top thirty, but that's enough to make a return worthwhile.",
            "review_score": "1"
        },
        {
            "review_text": "Another one for the Halloween buffs out there! The Adventures for Shuggy is filled with so much charm and cuteness that I almost stopped thinking about how tough the game is. Don't get me wrong, it's not impossible tough, it's fair tough. However, think Super Meat Boy! The controls do have a floaty feel unfortunately, but the game is still fun and worth owning!",
            "review_score": "1"
        },
        {
            "review_text": "Great !",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard, but also very good! recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun and good looking platformer.",
            "review_score": "1"
        },
        {
            "review_text": "Adventures of Shuggy is a little candy made video game. It's a game with great roots on old school platforming game where every scenario is completely different from the previous one, with four different mechanics to help you beat each stage. Great compatibility with the Xbox360 controller. I managed to complete it in just about two hours, but I have seemed to have found a knack at platformers recently!  I recommend this game, plus the added bonus is that it is also pretty cheap individually!",
            "review_score": "1"
        },
        {
            "review_text": "Funny game. Hard to master, a good platformer with some really twisted tricks, recommended for all hardcore platformers out there! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to like this game, but I just couldn't find the charm in it. If you are really into solving puzzles, then you might enjoy it, but otherwise its fun factor is quite low.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a puzzle-platformer broken up into a ton of different short levels. The levels each use one of several different mechanics: pressing a button to rotate the level, trying to get little circle dudes to run into boxes, making clones of yourself to step on switches. The constant variation in mechanics gives the game a WarioWare-like feel, particularly in the shorter early levels. Much like in WarioWare, my enjoyment of the levels has varied and it feels like a game that does a number of different things decently rather than doing any one thing well.   Perhaps the worst levels are those with roving enemies. Usually in a puzzly game like this, the enemies follow a set pattern. You analyze that pattern and figure out how to avoid the enemies. This game elected for seemingly random movement, which can lead to essentially unavoidable deaths when an enemy unexpectedly moves into your or traps you in a corner. Thankfully most levels don't have enemies and you don't need to complete every level to progress.  It is worth noting that while I would call this a puzzle-platformer, the puzzle aspect of the game is much less prominent than in something like Braid. Perhaps only half of the levels have puzzle elements, and those puzzle elements generally boil down to stepping on switches or rotating the level.  The game has support for an Xbox 360 controller and that is how you should play it. Playing with a keyboard is awful.  The music is kinda bad and the sound-effects don't add anything. Mute the game and put on your own music.  For only $5, I would recommend Adventures of Shuggy to anyone who enjoys short bursts of platforming with relatively light puzzle-solving.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great puzzle/platform game. Great music and fluid controls. Cute and colorful graphics. One of my favorite games on Steam to date out of hundreds.",
            "review_score": "1"
        },
        {
            "review_text": "Funny game. Hard to master, a good platformer with some really twisted tricks, recommended for all hardcore platformers out there! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to like this game, but I just couldn't find the charm in it. If you are really into solving puzzles, then you might enjoy it, but otherwise its fun factor is quite low.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a pretty fun little platformer that reminds me a lot of the old 8 and 16 bit platformers on the NES and SNES. I would highly suggest this game due to it's fun mechanics :)",
            "review_score": "1"
        },
        {
            "review_text": "This is the kind of game you can always go back to, no matter where you left off.  It's got over 100 levels with many different playing modes.",
            "review_score": "1"
        },
        {
            "review_text": "A colourful little platformer with some interesting gameplay mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Very well made platform game. Too bad there is no online cooperation mode.",
            "review_score": "1"
        },
        {
            "review_text": "Completion Rate: 100% (Single Player) Overall Rating: 8/10, would play again (co-op/teleporter troubles)  What a fun, little game that I would recommend to everyone who enjoys short levels that make you think a little bit. Though there are few tracks, they are all really well made and catchy. The game kept rotating and bringing in new mechanics, which reduces the monotony of most platformer games. I also received this game for free from a promotional. They might still be running said promotional, so I would suggest you pick it up today!",
            "review_score": "1"
        },
        {
            "review_text": "Shuggy is a great indie game with tons of levels to explore! It's an old school Halloween-esque platformer with puzzles and challenges around every bend. The game play is smooth. The graphics and sounds are acceptable. Each room has an array of new traps and foes to overcome by various means -- fly, float, and swing your way to victory! The developer regularly visits the Steam forums and listens to ideas and suggestions. An expansion pack is soon to be released. Which is good, because despite it's charm, once you have completed the game, its replay value is somewhat limited. While the single player campaign is stellar, the multiplayer aspects also need to be addressed. Offline co-op mode for a PC game is impractical. These two minor aspects would make it a solid 8 gaming score, but I always respect a developer who interacts with the public on a regular basis and is constantly improving game play, so I give it a 9.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Cool one room platformer with short levels for bite sized fun. Great variety of puzzles and puzzle mechanics. Lots of levels. Co-op. Cool beats in some levels. Good dificulty curve.  Cons: Repetitive textures. Tiresome beats in some levels. Some enemies look ugly and out of place. Does not support 1080p",
            "review_score": "1"
        },
        {
            "review_text": "One of the more 'trolly' game I've played, but stlil loads of fun.  If you like binding of isaac, you'll like this one as well.",
            "review_score": "1"
        },
        {
            "review_text": "Yupp , easy lol",
            "review_score": "1"
        },
        {
            "review_text": "Had a really good time playing this free 2D game. Remembered me of Miniclip and I just love it! Would play it again for sure! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It was free so why not.",
            "review_score": "1"
        },
        {
            "review_text": "wtf? little man",
            "review_score": "-1"
        },
        {
            "review_text": "If you like 2d platform/puzzle games, this is one of the best out there!",
            "review_score": "1"
        },
        {
            "review_text": "Had a lot of fun playing with a friend on the couch 10/10",
            "review_score": "1"
        }
    ]
}