{
    "app_id": 211580,
    "name": "Wanderlust: Rebirth",
    "release_date": "2012-07-27",
    "developer": [
        "Yeti Trunk"
    ],
    "publisher": [
        "Chucklefish"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Online Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Adventure"
    ],
    "achievements": 30,
    "positive_ratings": 249,
    "negative_ratings": 229,
    "price": 3.99,
    "description": "Wanderlust: Rebirth is an online four player co-op arcade-action RPG set in the fantasy world, Valandria. The heroes are summoned to Westhaven Arena to prove their worth as heroes of old legend. However, things are not as transparent as they first appear, when our heroes are unknowingly set upon a trek to save mankind from an ominous end.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/211580/header.jpg?t=1479240576",
    "minimum_requirements": "OS:Windows XP/Vista/7 (32- or 64-bit)  Processor:1.6 Ghz Memory:1 GB RAM Graphics:128mb Video Memory DirectX®:8.0 Hard Drive:30 MB HD space Sound:DirectX-compatible sound card  Additional:2-button mouse, keyboard and speakers.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Wanderlust: Rebirth walks a disappointing line between success and catastrophe. Close to fantastic in concept it simultaneously fails to meet basic needs to a crippling point. The key mapping is the worst I've seen in a long time. I can appreciate the 1980s graphics, but no one wants 1980s menu options. On top of that, the clunky combat and unpolished gameplay seems like it skipped its beta stage. I hope the developers return to their drawing boards with the community's feedback to develop the next version of Wanderlust - I'm convinced there's gold at the heart of this mess of a game.",
            "review_score": "-1"
        },
        {
            "review_text": "I would love to recommend this game. I really would. The problem is that in order to enable multiplayer, you need to get the pirated non-steam copy or else it'll never connect you to your friends.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty lackluster and cookie cutter rpg, does nothing special to stand out, if you got the spare money, go ahead. However if you don't you are not missing a damn thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately. I find this game generic. Controls are a mess, the game itself seems to run in a clunky manner, and it's attempt at recreating the 90's style RPG is a bit off. At no point during gameplay did I feel engaged. The storyline isn't original, and there is little depth in what you are trying to accomplish. The reward system for 'Missions' in this game makes it feel as if they broke away from attempting an action RPG and decided halfway through to attempt an arcade game. Many claim this game reminds them of Secret of Mana. However in my own opinion, had this game came out at the same time Secret of Mana had, I would still have chosen Secret of Mana. The art style did hit fairly close to target in trying to emulate the 16 bit era, however once again, depth and immersion are still a huge issue. The towns, the map, the lands feel all bland. Many of the areas in this game use a rather dull color palette, which to me personally is very unappealing. One of the big strengths in Secret of Mana, and even Zelda, aside from their gameplay and mechanics, was the color palettes and music used to really hit on target with the feeling you get from certain areas in the game. I commend W:R for attempting to recreate this feeling. But I suggest the developers go back and really spend a lot of time analyzing exactly what made those games of the 16 bit era classic.",
            "review_score": "-1"
        },
        {
            "review_text": "For the 10 dollars this game costs you can feed a hobo for 38 days on two packs of ramen a day with an extra on fridays. A far better use of money.",
            "review_score": "-1"
        },
        {
            "review_text": "I would rather slam my ♥♥♥♥♥ in a car door. Than ever... ever... play this game again. If it took them 5 years to develop this it must be a joke. What a bunch of tripe.",
            "review_score": "-1"
        },
        {
            "review_text": "In the begining there were a few guiding principles of game design: logical interfaces, fluent controls, challenging the player and simple multi-player. Wanderlust: Rebirth however took the short bus to game design school and missed these important principles.  The interface and menu system are morbidly fascinating; even equipping a new item is a small adventure unto itself as you attempt to decipher the arcane menu system. The mouse isn't integrated into the menu system as we can't garuntee that people will have a mouse hooked up to their computer! Instead we'll navigate this menu with the W,A,S,D keys.  Want to use a new spell? You'll have to look it up in your spell book then go to a different window, click and drag invisible lines between runes then do a small pirouette and hope that the you were holding the correct mouse button. Oh didn't we mention? The mouse we're not sure you have is required for spell casting. Talking with NPC's is initiated with one button (also doubling as your menu button) then progressed with another button.  All of these decisions and more will make you wonder 'Why on earth would you design the interface this way?'...because of REASONS!  No matter how you choose to play this game the controls are utterly baffling. They mouse is required to cast spells but moving with it? We'll have none of that! Sure this is a top-down view and it would make more sense to simply click a location to move there but that's too mainstream for Wanderlust. You're using a controller there? Let me eliminate half the keys and make sure that two of the remaining ones can't be mapped to trigggers, stick push, start or select. Also Let's navigate menu's with the D-pad and move with the Analogue stickbut never shalt their roles be reversible or interchangable!  That modifier key that you had to hold to access your second set of hotkeys on a full keyboard? You don't need it now that you've got less buttons to work with!  All of this could be forgiven however if the core game mechanics held up well. Which, of course, they don't. Playing co-op with a caster proved to be an exercise in futility as the poor melee class was unable to reach enemies with his stumpy little sword before they burst into flames. Inspite of this the combat is laughably easy, particularly with multiple players, as the enemy tends to sit in lovely little clumps and wait for you to attack them. Progression is handled by way of wandering in whatever direction the game will allow and hoping that you end up on the right path. Luckily there is no open-world, multiple pathways or even competing goals to stop you walking down this long corridor of frankly baffling art choices (Why is the GRASS in this CAVE every colour EXCEPT green for instance).   However this is designed to be a multi-player game, I think, so what it really comes down to is how easily I can play with friends. Well I'm glad to report that private games seem to not work at all. Luckily there were only 3 public games open at the time we played so we added a fourth one. Trying to kick an unwanted player however was an exercise in futility. The menu sequence 'Menu -&gt; Players -&gt; [Player Name]' presented me with only one option, Back. Again proving that no one actually bothered to try and design a functioning menu system.  Graphically Wanderlust: Rebirth wouldn't fly as a DOS era game, let alone today. The graphics don't seem to be retro-styled as much as just poorly drawn, The world consistently shows you oddly coloured and out of place objects that you just can't interact with or even investigate. NPC's are drawn in a painful blend of cartoon and 'high-school student who didn't take art class' realistic. The background frequently doesn't give you any clear indication of what is and isn't a walkable path and the colours are just garish.  In all Wanderlust: Rebirth is the kind of fascinatingly, humourously bad game that puts it on par with classic films like 'The Room' and 'Troll 2' or games like the original 'Postal'. Worth the admission price only on the suspicion that you'll get joy from mocking it.",
            "review_score": "-1"
        },
        {
            "review_text": "If you liked games like Chrono Trigger and many other old school rpgs then this is a game for you. The npc party you get in the single player mode is amazing. The multi player mode can be a bit confusing. Overall an awesome game for people who don't care so much about graphics.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hard to recommend. From the difficult and hectic gameplay, to not knowing what the hell is happening on screen. I found this game frustrating and completely lacking in meaningful characters. Other than the very clique storyline, there is very little in this game which would entise me to replay the levels. However the graphics are quite charming and for the price i picked it up (v.cheap), a bit of a bargain.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a very fun mmo rpg but it has some aspect's you may not like also funner with friends",
            "review_score": "-1"
        },
        {
            "review_text": "A truly horrid experience.",
            "review_score": "-1"
        },
        {
            "review_text": "hahaha this game looks so good; reality hurts, possibly the most boring game ever, poor interface, a story that most people skip through, no difficulty (only hard parts are some really annoying creatures) and even with the xp replay function game contains absolutely no replayability.  IMHO- .5/10  (gave a .5 because has/had potential to be amazing but atm an absolute waste of time)",
            "review_score": "-1"
        },
        {
            "review_text": "This game is nothing more than a button masher but I won't complain purchase wise I got my 99 cents worth lol oh well. ",
            "review_score": "-1"
        },
        {
            "review_text": "I dont even understrand what is going on, what are the controls even.",
            "review_score": "-1"
        },
        {
            "review_text": "I'd give this game a 65 because of the outstanding gameplay and because i am a great teacher who gives fair grades",
            "review_score": "1"
        },
        {
            "review_text": "Upon first glance, I thought this game would be same-old, same-old, and I was just buying it to help out the team that's bringing us Starbound. However, after playing it for a few seconds, I quickly became addicted. There's never a shortage of things to do, and even if you repeat the same fights over and over, every encounter has an air of difference, because you'll never block, counter, or dodge in the same way. All in all, this game is a huge 'yes' on my list, and I'm proud to have made it my first review.",
            "review_score": "1"
        },
        {
            "review_text": "The game was fun, until both my girlfriend and I started crashing past the 3rd level. My gf was able to play by herself, but could barely pass any levels later as the level of difficulty was getting out of hand due to poor AI and poor progression.  This game is just not playable.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is an old school rpg inspired by various 16 bit games.  The controls take sometime to get used to, and this game from the start tries to teach you the basics, but then you are on your own.  If you are one of those players that expects the game babysit you from the start till the end, then don´t pick this game up, this is game aimed at people who play the game several times till they get used to the controls and they find a character class they like.  The game difficulty also gets increasingly harder as the game goes on, so don´t judge it it on the first chapters and make sure to make use of the block key.  The user interface is not the best, but it does it job and it provides with enough information to the player.  Overall, I think the greatest strength of this game is combat, it can be hard at times and unforgiving, but once you understand the monster combat patterns and each monster does, you should be able to do well",
            "review_score": "1"
        },
        {
            "review_text": "Wanderlust: Rebirth is one of those games that can be off putting when not approached the right way.   Looking at this game from a Zelda like perspective can get the player in lots of trouble. . . I'd list it with more of a Secret of Mana meets Chantelise or Dialbo 3. . . more one the lines of action rpg with the replaying the levels to progress.  This is one of those games that you play to find drops. . . the real fun begins once you finish chapter 8 and play through the levels toget drops.  It isn't for everyone I'll admit that off the bat. I love games that require skill like Dark Souls. . . this is one of those games. . .You are never really over powered and have to use your skills to progress and get gold on each level.  There are hidden bosses and lots of items to find. . when you do see a chest your heart can skip a beat for the game, unlike most like this, never just gives you an over abundance of items.  Those of you who take on this game I will note that it is a game that needs port forawrding to play MP. . . but it is worth it. . . You can have NPCs aid you and they do get derped out from time to time. . . but I'll say when I play I really don't mind too much.   Each class can have many different skills to make variations of play styles.   I like the music and the assests are great.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "i am the best healbot",
            "review_score": "1"
        },
        {
            "review_text": "A simple RPG that runs great on crappy computers. FPS can lower when you play for a while. unless u have a great computer. This is mainly towards peeps with bad computers. not the game but my point. It's simple and fun to play with some confusion at what your doing at times. you won't get stuck but you'll do stuff randomly and boom! you beat the level. your like wtf did i just do?! But hey it's fun to play with friend. No problems other then the ones i mentioned and that you can't create your own character. You can get weapons and armor and stuff but your character doesn't change the way it looks. kinda sad",
            "review_score": "1"
        },
        {
            "review_text": "It's like a gutted version of Secret of Mana that was made in MS Paint. The only way it could have been better would be if it had horrible translation errors. Maps are small, AI likes to be glitchey, controls handle like jello, there's a crafting part in the tutorial that is never followed up on, and the story ends after 3 hours with 'you all died.'  I'll recommend it in the same manner I recommend the movie 'The Room', this isn't good, in fact it's horrible. But that's why it's hilarious the first time you see it.",
            "review_score": "1"
        },
        {
            "review_text": "This is an incredibly fun game but SP and MP.  A MUST for anyone who is after something cheap and incredibly fun!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "An occasional RPG to play with your friends. Dont really recommend to play it alone since the game its a bit hard without someone helping.  It revives the old style of rpg with his graphics and its lineal story.",
            "review_score": "1"
        },
        {
            "review_text": "A golden chance for same screen co-op missed. Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite the game. Fairly simple easy to pick up and play. 10/10 would buy again!",
            "review_score": "1"
        },
        {
            "review_text": "This game (that i got for free) was almost worth every cent i payed.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite the game. Fairly simple easy to pick up and play. 10/10 would buy again!",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy..... ever",
            "review_score": "1"
        },
        {
            "review_text": "This game has alot of problems. The menus stink and the combat isn't thrilling at all.",
            "review_score": "-1"
        },
        {
            "review_text": "I was really excited to play this and it was right up my alley but unfortunately it fell way short. It's clunky as all hell and not at all what I was expecting. The hitboxes of the environmental objects are absolutely ridiculous. I grew frustrated right off the bat when my shots would hit invisible corners and not make it to their targets when it looked like they clearly should have.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought the 4 pack for me and a group of friends, we played maybe an hour or so and realized the quality of the game was far less than I had expected. I expected quite a bit more from a game maker game as I've played Risk of Rain, Stealth ♥♥♥♥♥♥♥, SanicEvantur2.exe and countless other AWESOME games made in the same engine. Unfortunately, I was nieve and trusted that the game would be at least decent to play with my friends.   However... the game is underdeveloped in nearly EVERY aspect. The controls are ankward, the story is mediocre, the combat is a bore and the RPG elements are simple and unenthralling. This game just isn't a quality product. Wanderlust: Rebirth doesn't deserve even a tenth of the popularity it has.  Final Score:  2/10 Would Never Play Again.",
            "review_score": "-1"
        },
        {
            "review_text": "Got this game by HumbleBundle. It was just 30mb so installed. So, after done with tutorial. Suddenly I addicted with it . So i Play and play and play and yeah, i wanna play more later. So its best game actually!",
            "review_score": "1"
        },
        {
            "review_text": "unlike most of the reviews, i thoroughly enjoyed this game.   it's nothing to write home 'bout, but it's worth the $2.49 i paid for it.",
            "review_score": "1"
        },
        {
            "review_text": "A terrible, unpolished game. The UI &amp; menu navigation makes no gosh darn sense, controls are wonky as ♥♥♥♥, there doesn't seem to be any sort of balance among the classes, and even for being 'retro pixel' the graphics are just straight up crappy. The story is also somehow worse than that of an Uwe Boll film.  BUT, playing the game on co-op is great for all the wrong reasons. I had a blast just making fun of how terrible the game was with a few friends... though thats really not a good enough reason to actually buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Crap, your moms face looks better than this.",
            "review_score": "-1"
        },
        {
            "review_text": "I paid $15, its $3 now",
            "review_score": "1"
        },
        {
            "review_text": "This isn't really a recommendation, more of a caveat. The story is laughable, the gamepad support controls are poor, it's extremely difficult to tell what's occurring in combat, and the point system for completing a chapter is opaque and obtuse. Perhaps it's fun online with other people, but I don't see how - these same issues apply to multiplayer as well. In addition, the game makes you play through 'mini stages' between larger areas, which are just basically small arenas to fight groups of monsters. You MUST complete all these 'mini stages' each time you travel between two major areas, regardless if you've already cleared them. The game has potential, but they need to improve gamepad support and controls as well as fixing the flow of combat. Some might enjoy this, but I feel the majority of gamers would have a hard time accepting this as a completed game.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun, but a bit gory. Also i like pie.",
            "review_score": "1"
        },
        {
            "review_text": "  unbalanced buggy boring frustrating cute",
            "review_score": "-1"
        }
    ]
}