{
    "app_id": 211970,
    "name": "Test Drive: Ferrari Racing Legends",
    "release_date": "2012-12-10",
    "developer": [
        "Slightly Mad Studios"
    ],
    "publisher": [
        "Evolved Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 3,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Racing"
    ],
    "tags": [
        "Racing",
        "Simulation"
    ],
    "achievements": 0,
    "positive_ratings": 144,
    "negative_ratings": 108,
    "price": 14.99,
    "description": "Detailed physics underpin a huge variety of challenges set throughout the history of this landmark automotive brand. Painstakingly detailed cars and tracks reflect visceral damage as races wear on, an acute sense of speed communicates the power of these highly tuned vehicles, as advanced AI challenges even the most experienced driver.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/211970/header.jpg?t=1447355830",
    "minimum_requirements": "OS:Windows® XP (SP3), Windows® Vista (Service Pack 1) or Windows® 7 Operating SystemProcessor:Intel Core 2 Duo 1.6 GHz Memory:1 GB RAMGraphics:256 MB Graphics Memory DirectX&reg;:9.0cHard Drive:6 GB HD spaceSound:DirectX 9 Compatible Sound Card Other Requirements:Broadband Internet connectionAdditional:*Supported chipsets: ATI HD3 Series or greater; NVIDIA GeForce 8 Series or higher or greater Laptop versions of these chipsets may work but are not supported. Updates to your video and sound card drivers may be required.",
    "recommended_requirements": "OS:Windows® XP (SP3), Windows® Vista (Service Pack 2) or Windows® 7 Operating System  Processor:Intel Core 2 Duo 2.0 GHz  / AMD X2 64 2.4GHzMemory:2 GB RAMGraphics:DirectX 9.0c Compatible 3D-accelerated 512 MB video card with Shader Model 3.0 or higherDirectX&reg;:9.0cHard Drive:7 GB HD spaceSound:DirectX 9 Compatible Sound Card Other Requirements:Broadband Internet connectionAdditional:*Supported chipsets: ATI HD3 Series or greater; NVIDIA GeForce 8 Series or higher or greater Laptop versions of these chipsets may work but are not supported. Updates to your video and sound card drivers may be required.",
    "reviews": [
        {
            "review_text": "For $5 you can't go wrong. Especially if your a Ferrari lover. I knew eventually this game would sell for that price, so I just waited. Finally it hit the right price point for this game to pull the trigger. After buying Test Drive Unlimited 2 at full retail price and then playing it, I knew that I wouldn't make that mistake again. Both games were originally put out by Atari, but they are no more. Still, if you're a racing fan, you will probably like this.",
            "review_score": "1"
        },
        {
            "review_text": "Great racing sim from Slightly Mad. Excellent sounds, realistic and fun physics (better than Shift 2), very nice graphics, outstanding car selection if you like Ferrari. The campaign mode can be a bit of a grind with some contrived missions but overall quite fun.",
            "review_score": "1"
        },
        {
            "review_text": "If it stuck to regular racing it wouldn't be so bad, but when it adds random driving scenarios you have to pass to continue the game it becomes annoying.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a poor quality racing simulator for only ferrari vehicles. It has terrible physics and handling and is very uninteresting to play. It has a huge campaign that takes ages to play through and unlock. t is not interesting or worthwhile to play through it. I have and it was not worth the time. there are hardly any tracks and cars unlocked from the start you have to unlock them all by playing boring campaign missions. This is a terrible racing game, almost any other sim is better. And to make t even worse it has GFWL DRM which you have to make an account to sign n and play the game that you bought on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Most cars have ABSOLUTELY NO GRIP. I wonder if Ferraris actually feel like that. If you want to drive on ice, that's the game for you. And there is a predetermined path for you to follow, so you have to win the next race, regardless the difficulty spikes (an issue), otherwise you will be stuck and will never have access to all the cars and tracks - or even other races. I find it a difficult game overall, and for me personally it kills most of the fun - while cruising some events, I'm constantly worried about winning others at all costs, playing over and over until I do, angry for being spinned out or going off track several times along the way. It is a good game, but a disappointing one at the same time, for what it could have been. I recommend you to buy it, though, for it is better to have this experience than not have it.",
            "review_score": "1"
        },
        {
            "review_text": "I would love to play this game I paid for but I can't since it won't save my progress without GFWL. Please patch GFWL out of this game.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Do not listen to these horrible reviews. Ferrari Racing Legends is a sheer driving pleasure. Slightly Mad Studios have done a fantastic job with the driving physics and making the game both accessible and exciting, as they did with Shift. The car roster is huge, and has a lot of variety too. There are some great tracks here from classics like Monza and Silverstone to favourites like Nordschleiffe and Mugello GP. The sound of the engines and life-like interior views coupled with refined driving mechanics make this a blast for racing enthusiasts. The controls are great and there is extensive support for wheels, controllers and keyboard. The events are scenarios, so you could start a race on the 3rd lap in last or it could be a more arcade-style overtaking exercise, where you have to pass all the cars within a time or distance limit. The variety in cars, tracks and races is surprising. But make no mistake, this game is pure racing nothing more, nothing less. There are no upgrades or RPG elements it's just you, the car and the track, although you have to unlock most of the cars and tracks through the campaign. There are no distractions, and there are of course time trials, quick races and multiplayer alongside the very long campaign. The only problem I've found with this game is that environment textures are terrible trees keep popping in and frequent graphical glitches with the scenery when using certain anti-aliasing. Other than that, it's exactly what a racing game should be.",
            "review_score": "1"
        },
        {
            "review_text": "I just got a steam controller and it works perfectly for the game. ",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, challenging, not too pricey.",
            "review_score": "1"
        },
        {
            "review_text": "Remember. That's MY opinion. Maybe you love the game. I don't.  This should be a great game, great idea, nice graphics, but... I don't know. That's not the game for me. Hard controls, response... It's very difficult to have fun with a game you simply can't stay on the road. I remember the Test Drives from Playstation era and this one has nothing to do with them. Sorry guys but I had frustation instead of fun from this game. I'll try a little harder but it looks like I'm uninstalling it after 1 day testing.   I prefer fun over graphics.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is realy good",
            "review_score": "1"
        },
        {
            "review_text": "Remember. That's MY opinion. Maybe you love the game. I don't.  This should be a great game, great idea, nice graphics, but... I don't know. That's not the game for me. Hard controls, response... It's very difficult to have fun with a game you simply can't stay on the road. I remember the Test Drives from Playstation era and this one has nothing to do with them. Sorry guys but I had frustation instead of fun from this game. I'll try a little harder but it looks like I'm uninstalling it after 1 day testing.   I prefer fun over graphics.",
            "review_score": "-1"
        }
    ]
}