{
    "app_id": 212030,
    "name": "Kung Fu Strike - The Warrior's Rise",
    "release_date": "2012-07-24",
    "developer": [
        "Qooc Software"
    ],
    "publisher": [
        "Qooc Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Beat 'em up"
    ],
    "achievements": 12,
    "positive_ratings": 803,
    "negative_ratings": 211,
    "price": 6.99,
    "description": "Taking its inspiration from ancient Chinese tales of revenge and retribution and then adding a dash of over-the-top martial arts and old school arcade fun, Kung Fu Strike features 28 stages of fast-paced combo-based fighting.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/212030/header.jpg?t=1555310636",
    "minimum_requirements": "OS:Win Vista (32/64 bit), Win XP Processor:2.0+ GHZ Single Core Processor Memory:1GB RAM GB RAM Graphics:NVIDIA 6200+ or ATI Radeon 9600+, Shader Model 3.0 compatible DirectX®:9.0c Hard Drive:3 GB HD space Sound:DirectX®: 9.0c compatible Other Requirements:Broadband Internet connection Additional:X360 controller support",
    "recommended_requirements": "OS:Win Vista (32/64 bit), Win 7 (32/64 bit), Win XP Processor:3.0 GHZ Dual Core Processor Memory:1GB RAM GB RAM Graphics:NVIDIA 7900 GS or Equivalent DirectX®:9.0c Hard Drive:3 GB HD space Sound:DirectX®: 9.0c compatible Other Requirements:Broadband Internet connection Additional:X360 controller support",
    "reviews": [
        {
            "review_text": "This is beat ‘em-up game where you fight not one, but many opponents in the same time. It reminds me of games I played in my childhood. They were so difficult sometimes. If you wasn't skilled enough or didn't spend a lot of time to master the game, you couldn't finish it. If you want to finish Kung Fu Strike even on easiest difficulty level, you need both: skill and time. And a gamepad too. Is it good? Definitely yes. Well polished, no bugs, good piece of software.  VERDICT: If you like beat ‘em-up games and don't afraid of high difficulty level, take it. You will have a lot of fun. If you're not sure if you're hard-core or casual player, find out playing this game. If you know, you're casual player, better play solitaire.  Like this review? Consider to join  Good Games Giveaways &amp; Reviews  group and maybe press big sexy 'Follow this curator' button on our  curation page  to read more reviews and win free games.",
            "review_score": "1"
        },
        {
            "review_text": "Kung Fu Stike was a very unexpected blast to play. But be warned it is a very difficult game that wants you to lose. I would not suggest it to gamers that get easily frustrated. So you may be wondering what is this game about? Well it is a weird mix of a beat'em up and a fighting game with a rather cool option to call in reinforcements if you don't mind paying some much needed gold. The story is well....I have no idea what is going on to be honest, but you can safely ignore it without missing much of anything due to its paper thin plot.  The visuals are pretty nice and remind me of Street Fighter 4. The music is nothing memorable but it gets the job done. Pretty much everything is just average in Kung Fu Strike, but where it really shines is in its fast paced, combo centered gameplay. Controls feel nice and responsive, be it in a 3d brawler areana or a 2d boss section. And I love how the crowds of enemies don't just sit around and wait for you to punch them like in the Batman or Dynasty Warriors games. They will attack you from all sides at once rapidly draining your health unless you block or dodge out of the way. This is not a game where you are a overpowered god like character, you are simply a General trying to put down a rebellion and may occasionally need to rely on the help of your comrades if you are not skilled enough at the game.  Still your character is no push over. Deal or take enough damage and you could pull off some special moves that deal serious damage and have a generous area of effect arc to take out the lowly grunts or just get some breathing room when a boss is in the middle of a combo. You can also equip up to three items, from a herb that brings you back from the dead to taking less damage from explosives and thrown weapons. You regain life by picking up rice balls that fly out of a defeated enemy and they may also drop a item that you need to be able to call in for backup.  The game is not perfect though. By far the biggest problem I have with it is that the camera is just bad. Too the point of costing you more than a couple of fights due to it freaking out and spinning all over the place or some object being in front of the camera blocking your view. Another problem is that you cant change the resolution in the option menu but have to go into the game files and set it through a 'Config' file. And the last problem worth noting is that alot of the time you require alot of luck. What I mean by that is you can sometimes go a match with the enemies dropping nothing but coins and no other useful items. Makes it quite frustrating when this game is very stingy with its checkpoint system and the overall difficulty.  Overall I would suggest you try the demo before you buy to get a feel for what this title offers. If you enjoy it and dont mind knowing it will get very difficult later on, it will have you addicted and wanting yet another go at that seemingly impossible boss fight. The sweet taste of victory when you finally bring down his health and dive quick him 20 feet through the air is more than enough to warrant the full price of $10 :p",
            "review_score": "1"
        },
        {
            "review_text": "+Fun in the beginning -Gets tedious with un-inspiring difficulty: quantity instead of quality of enemies -Cannot change controls",
            "review_score": "-1"
        },
        {
            "review_text": "Cleared the game on medium.  If you are expecting a game like DMC do NOT buy the game. It is not the worst action game I played, but many factors made it very unpleasent:  Enemies can and will attack you back during your combo. Multiple enemies will attack you with an overhead and sweep attack at once to make it unblockable. The most effective tactic against any boss in the game is kiting it constantly while your hp and super bar regerenates. For more than half of the game you will be just spamming 'block' and 'super'.  Even when its 75% off this game is definitly not worth its price.",
            "review_score": "-1"
        },
        {
            "review_text": "I see a lot of negative reviews that complain about things they should not. It's a port, you can't move the camera, indeed, but the game it's funny and the combos are really interesting. Boss fights are a little bit too hard, maybe. I do recommend playing it, because if you play with a friend you'll have great times together. Nobody complains about the ugly and horrible PC port at Naruto, but they do here, because this is just a poor little game from a new studio! Please, stop doing that.",
            "review_score": "1"
        },
        {
            "review_text": "Highly enjoyable old school beatemup. Bought on sale and was immediately whisked away to the arcades of my youth.  Addictive and fun. Game pad recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Co-Op'd this with a friend and reminded me of Playing Mortal Kombat: Shaolin Monks way back when.",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly good brawler. Very difficult, especially if you want to get a good score. Recommend watching TBS WTF is of it.",
            "review_score": "1"
        },
        {
            "review_text": "The game has it's good parts as a fighter but the mechanics cheat the player a lot. The game often makes you miss your big attack by having it go off in the wrong direction. KFS encourages the player to make combos but some enemies get to take advantage and can get an unblockabl low attack that you have no chance of dodging because your in a combo. If you enjoy a game that is difficult and occasionally cheats, then this is a good buy. If you don't like getting suckerpunched by code then you will not enjoy this title.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a decent brawler with pretty good combat and pretty mediocre everything else, ok but sort of lacking in polish. I had some fun thwacking crowds of mooks, and the bosses take more skill and awareness of your abilities and are more fun, but it didn't really grab me for some reason. Pretty much unplayable without a controller, unless you want to be very frustrated.",
            "review_score": "-1"
        },
        {
            "review_text": "Lots of good old fashioned ♥♥♥ kicking and face smashing.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥ game. so hard to play even u pick easy the creeps skill will connect forever until u dead, and the creeps are so tanky so hard to die  you need very try hard to pass all the stage.",
            "review_score": "-1"
        },
        {
            "review_text": "Cheap fun. Obligatory ATATTATATATATATATATAATATATATATATATATATATATATATATA.",
            "review_score": "1"
        },
        {
            "review_text": "Context: I played this game in single player mode. PRO: Art style, and from what little story text presented, there's some humor. Music is OK. Seems to not have technical glitch. CON: Need for repetitive trial and error, plus some luck.  1. Enemies and/or level design often have 'special trait' that requires a 'correct' method to fight. The problem is that making 'wrong' move usually result player getting killed rather quickly.  2. More significantly, even with right strategy in mind, the number and mix of enemies rushing the player in a given level tend to result in multiple attack types (blockable+unblockable, ranged+melee...) happening simultaneously or near-simultaneously. The need for precise blocking / dodging timing often means that at least some of the attacks get through. This also tend to end fights quickly, necessitating level restart.   IMHO #2 (quantity instead of quality of enemies) is by far the greatest source of difficulty. This gives me the impression that the game was designed and tested for local co-op. Even in single player mode, when backup AI characters are available fights get noticeably better.",
            "review_score": "-1"
        },
        {
            "review_text": "Its hard not to like this best 2 bucks i ever spent, keeps me more entertained than some AAA games out there.",
            "review_score": "1"
        },
        {
            "review_text": "CAVE PEOPLES HEADS IN, BUT REALLY FAST, AND THEN EVEN FASTER, AND THEN DIE, AND THEN DO IT AGAIN!  11/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically a 3D beat em up with simple mechanics. You basically have 2 attack buttons and a guard/parry as well as a dodge.  I feel as if the gameplay is not really explained much in terms of how to play it more through more advanced levels as parry isn't well explained in terms of how it works, and trying to learn how to beat new enemies is very frustrating as you have no clue what will work, which is quite unreal in a game with such a simple button layout.  The gameplay could be better and the difficulty doesn't help in teaching you anything.",
            "review_score": "-1"
        },
        {
            "review_text": "Why difficulty matters in all games ?. This game unnecessarily difficult . Even easy mode very hard. Only wasting time . Don't buy!..",
            "review_score": "-1"
        },
        {
            "review_text": "I Love it a Bad ♥♥♥ game MUST OWN IT!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game can grab the Dalai Lama and turn him into Charles Manson.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun with friends,  Kind of hard to get used to all the complex button combos for the different special moves.  Good: Fun in Co-op, even has two player mode where two people can play on one PC with two controllers connected. A lot of levels, both co-op and versus for multiplayer.  Cons: No lan support, not really as fun in single player, there are many many problems with the camera, many gameplay choices are unfair rather than challenging and you will die due to unfair gameplay choices a lot.  I recommend it for those who want to experience this with a friend. For a single player experience it can be alright although not as rewarding in my opinion. I hope this was helpful to your purchasing decision.",
            "review_score": "1"
        },
        {
            "review_text": "A game that starts seeming simplistic and ends with complexity in opponents and combos, overall a great fighting experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great Martial Arts game that takes Happy Bashing beat em ups to a new level!",
            "review_score": "1"
        },
        {
            "review_text": "The people who made this were on some good ♥♥♥♥ and I want to smoke whatever they were on. It's interesting enough to a take on a tough action beat-em-up game by someone who has never played any other tough action beat-em-up game and is not beholden to any of that design.",
            "review_score": "1"
        },
        {
            "review_text": "Good for a while if you find it for sale. Way more fun than screenshots make it look.",
            "review_score": "1"
        },
        {
            "review_text": "KFS really brings back the nostalgie for good old Chinese over-the-top kung fu movies. And yes... it is a difficult game, definetely not for casual players. But it is still awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Wow... I got this game when it was on sale for a buck... it's worth MUCH more than that. So awesome.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to waste some time and money on a really stupid idea, theres your perfect chance :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game for players who love old school fighting games. It has good graphics and very nice moves! Been playing this game for a while now and will not stop playing it.",
            "review_score": "1"
        },
        {
            "review_text": "It a KIck ♥♥♥ GAME!!",
            "review_score": "1"
        },
        {
            "review_text": "THROUGHLY ENJOYED THIS GAME WUD PAY FULL PRICE IF I DIDNT GET IT IN THE SALE. VERY ADDICTIVE",
            "review_score": "1"
        },
        {
            "review_text": "Made by asians for asians.  Yes, it's THAT kind of difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "Story mode is just for to be there. Nothing more. Art style is arguable. Graphics are average and do not expect it to run in 1080p right from the start - you have to do some voodo-magic with config files. Developer just decided that you do not need 1080p. Controls are stiff, fighting system is unintuitive and unforgiving, tutorial is bad and not covers all aspects of fighting. You will not know how to beat an specific enemy, or evade special attack - the game just drops this moment out of tutorial tips. Evade moves have too small radius and too bad response to your comands. After all the game left me in burning rage from its stiffness and bad design. My nerves are worth better than this shlack.  To the trash bin for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I got in a Bundler and with the PlayFire Rewards, I thought 'Meh why not' and it was better then I thought it would be, 28 levels and co-op. I died on level 5 easy, I might even go back.",
            "review_score": "1"
        },
        {
            "review_text": "Everybody who is into beat em ups will probably love this. +local co-op, tons of upgradeable stuff, diffrent enemies  -no Hd graphic settings (no graphic Settings at all), the NEED of a gamepad   DONT PLAY THIS WITHOUT GAMEPAD ! I'd rate this game 8/10 or 80% at Version 1.0",
            "review_score": "1"
        },
        {
            "review_text": "This game is very funny. The Kung Fu skill is awesome. I can feel and touch with the power! Those boss in the game are unique.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, bought when it was on sale for £1.39. Certain parts of the game make it feel like Street fighter, the fighting isn't great and the game can be down right irrotating at parts but like with any game I usally judge the quality from the price and for £1.39 it was money very well spent. 4.4/5  Buy while it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Non stop Kung Fu action!!! ATAAAAAAAA!!!",
            "review_score": "1"
        },
        {
            "review_text": "IF ONLY THIS WASN'T LOCAL COOP.",
            "review_score": "1"
        },
        {
            "review_text": "This game is by no means perfect. On many scales, it'll rank as average. BUT there is a very fun, challenging and rewarding experience to be had with this game. I wouldn't pay full price for it, but if you see it in a humble bundle or something, or it goes on sale... consider it!",
            "review_score": "1"
        },
        {
            "review_text": "This game has not the best graphics and not a long campaign, BUT this Old-School-Beat-‘em-up is highly addictive. It combines challenging gameplay with a unique set of fighting skills. What I really like is that you not necessairly need a controller to have the full control over the main character. Personally, I even prefer to play with the keyboard. If you buy this game, be prepared to fail at some point, but know that you will rise again and defeat your opponents by trying harder and a better timing of your chi-attacks!",
            "review_score": "1"
        },
        {
            "review_text": "It's an awesome beat ‘em-up. There aren't a lot of them around STEAM, but even among them this one is special indeed.",
            "review_score": "1"
        },
        {
            "review_text": "Once You adjust the settings in the config file, this is like making one of those crazy movies where people can fly while fighting and other sillyness. I recommend this to anyone who has watched all of the martial arts movies they have and want to see a new one. Yes, I am recommending this to those who want to see a martial arts movie. No it is not live action but it is no less entertaining. A movie offers ~2 hours of entertainment. I am not even half way through this at 1.7 hours. I do recomend a controller.",
            "review_score": "1"
        }
    ]
}