{
    "app_id": 212630,
    "name": "Tom Clancy's Ghost Recon: Future Soldier™",
    "release_date": "2012-06-27",
    "developer": [
        "Ubisoft Paris",
        "Red Storm Entertainment"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Stealth",
        "Co-op"
    ],
    "achievements": 0,
    "positive_ratings": 2178,
    "negative_ratings": 1153,
    "price": 12.49,
    "description": "Join an elite team of special-ops soldiers in the globe’s most deadly warzones to hunt down the highest value targets.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/212630/header.jpg?t=1472606318",
    "minimum_requirements": "OS: Windows Vista® (with Service Pack 2)/ Windows 7® (with Service pack 1), both 32 bit &amp; 64 bit versions. Processor: Intel Pentium D 3.0 Ghz or AMD Athlon64 X2 4400+ 2.2Ghz Memory: 2GB Windows Vista or Windows 7 Graphics: 512 MB DirectX–compliant, Shader 4.0–enabled video card based on nVidia GeForce 8600 GTS/AMD Radeon HD 4650 DirectX®: DirectX 11 Hard Drive: 25 GB  Sound: DirectX 11 – compliant sound card",
    "recommended_requirements": "Recommneded: OS: Windows Vista® (with Service Pack 2)/ Windows 7® (with Service pack 1), both 32 bit &amp; 64 bit versions. Processor: Intel Core2 Quad Q9450/ AMD Phenom II X4 940 or higher Memory: 3 GB Windows Vista® &amp; 7® Graphics: 1024 MB DirectX–compliant, Shader 4.0–enabled video card based on nVidia GeForce GTX 460 or AMD/ATi HD 5850 or better.  DirectX®: DirectX 11 Hard Drive: 25 GB  Sound: DirectX 11 – compliant sound card",
    "reviews": [
        {
            "review_text": "NOTE: This is based on SINGLE-PLAYER ONLY, I did NOT play Co-op or MP, which apparently has some problems.   Ghost Recon: Future Soldier (GRFS for short from now on) is a continuation of the 'Ghost Recon' super special operations that existed long before COD Ghosts came along. There are no 'waves' of baddies coming at you, no cinematic mow-downs, no angst-driven baddie that always got away. Instead, you are the the elite of the elite (cliche, I know), a special cadre of 'operators', augmented with the best technology available, from CrossCom that lets you easily coordinate fire among your teammates, sync shoot that lets you designate targets for simultaneous extermination, optical camo that makes you nearly invisible... if you don't move very fast, sensor ball that picks up baddies in the area... X-ray viewer mode that picks up metal in ANY condition, even blinding sandstorm, as well as aerial and ground drones. And at the finale, you'll get access to Warhound... a mobile fire support platform that has missiles and mortars you can call in. Imagine the stealth kills you can do with the active camo... if you don't want to shoot them in the head.   Obviously there's always bazillion bad guys between you and your objective. And with suppressed weapons taking them out quietly is always an option... or you can go loud and just go guns blazing, but make use of cover or your teammates may not save you in time. At other times you can shoot through enemies cover, and that really makes you feel powerful.   The weapons can all be customized and there are a lot of changes possible, muzzle can be changed to different flash supressor or sound supressors. Sights can be changed from iron sight to red dot scope to 4x tactical scope and more. Magazine can be single, extended, double, or even loaded with armor piercing ammo. And so on. Every weapon is customizable, with parts that you can unlock through playing and accomplishing missions and challenges (i.e. make X kills with weapon Y, or such).   There are multiple levels of difficulty and let's just say, this game REALLY punishes you for tactical mistakes, i.e. exposing yourself when you shouldn't, picking the wrong targets, fail to flank, and so on. Though at easy levels you'll have a chance to recover, albeit unlock things much slower as well.   The graphics are very nice for a shooter, everything looks proper as they are. Jungle looks like jungle, village looks like village, and desert looks like desert. And you get to enjoy watching the operators move, crawl, lean against cover, and so on wit the third-person view, with seamless first-person if you go to scope mode.   The game is an Ubisoft product so Uplay must be installed and game activated through Uplay, but it's not overly tedious. However, it's rather annoying to have to deal with TWO platforms instead of just one.   All in all, as a shooter this game really makes you appreciate what a futuristic soldier will be like, without getting into power armor, exoskeleton, and jump gear of the further future. We have the tech to make this now... or at least in a few years, and we'll need them to solve problems developing around the world.   And yes, I am recommending this game. But remember, I only care about the single player game. And it works fine.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, it is a little short. I do wish it had more content.",
            "review_score": "1"
        },
        {
            "review_text": "Good campaign, graphics, fast, okay multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Just 9/10 Overall! Well because of the Coop! You just need a buddy to play with since there's no public quick game on Coop Campaign and no Local Coop either. Steam/UPlay friends required ;)  Why? I just love the way it is. It's the second copy I have. I have one on uPlay but just want a copy on Steam so me and my brother can play it together too.  I was playing this on my uPlay version account with my classic mobile laptop. Corei7 2670QM 2.2ghz-3.1ghz 2gb GeForce 540M 8GB DDR3 RAM I get roughly ~30 FPS with 720p reso. It's good! But now I'm playing it all over again on 970M gpu at 1080p reso, and still rocks even more better.    PROS ",
            "review_score": "1"
        },
        {
            "review_text": "Ghost Recon Future Soldier (GRFS for short) is sadly quite underrated amongst Steam users, I don’t write a serious review about a game often, but regarding how much I loved this game and how much fun I’ve been going through it, this is my full review analysis about the game (ON SINGLEPLAYER ONLY)  - Gameplay &amp; Combat system: GRFS is a modern military third-person shooter featuring access to high-tech equipment (hence why it’s called “Future Soldier” am I right?), magnetic vision which allows you to see your enemies’ location under any scenarios (technically it’s wall hacks), but with a certain range limit (otherwise you and your team is literally invincible); The warhound which pretty much do all the shooting job for you while you can just sit down and sip that can of soft-drink on your hand; optic camouflage which allows you and your Ghost team to blend into the environments and making sneaky-beaky actions. Whilst the team is on the recon phase (which you’re doing your mission stealthy). You need to think strategically on when and where to move, who to shoot, and preventing enemies from spotting dead bodies therefore raising the alarm, hence you’re forced to go loud. The tagging system is very well made; you can tag up to 4 targets at a time being, your teammate will take down the tagged enemies simultaneously as you open fire, and believe me, it’s the most satisfying and badass feeling when it comes to modern stealth actions like this. Additionally, you are also given a brief slow-motion moment which allows you to take down more targets silently. The scout drone, yes of course, it allows you to scout the area, collecting intel on enemies’ location, and you can also tag your targets using the drone, either that or if you’re a person that prefers sitting back in your comfy chair, then using the drones to tag the enemies and let your teammates do the rest isn’t a bad option. The pacing of GRFS is almost near perfect, there are missions that force you to do your job quietly, whereas there are others which you must gun-blaze the area. Talking about gun-blazing, GRFS isn’t some sort of shooting game where you can go “Yolo Swag” like Call of Duty and Battlefield. Rather, GRFS has a VERY PUNISHING system that if you make mistake strategically (opening fire when you shouldn’t, moving to a place where you shouldn’t, focusing fire on the wrong target, etc.), and on top of all that, you won’t survive for more than 5 seconds without taking cover smartly. (It’s so unlike CoD and BF now amirite?). The tense feelings I get from getting suppressed by enemies’ LMGs and sniper rifle as the camera shakes while I was behind cover, it’s like, oh Jesus, if I peek my head out and take that bullet in the face then I’m dead for sure. (Basically this isn’t a cartoon war game like CoD).   - Gear customization: The customization system is astonishing, from the interface to the available varieties. You can customize every weapon of your choice. Magazine, stock, trigger, barrel, optic sight, gas system, muzzle, side rail, you’ll be like…damn…the choices. There will be bonuses for this attachment and there will be penalty for that and there will also be balanced out stuff. In general, the gun playing style is your choice alone to make.  - Story &amp; characters: There isn’t much of a memorable thing about this part, as this game lack of interesting plot (in my case I legit had to look up the game’s plot on Wikipedia to know wtf is going on), technically it just like, you go to this area, you save and escort this lad in one piece who will later provide you information about the bad lads, therefore you go to the other area and kill the bad lads. Character developments isn’t all that great since the dialogue and voice acting isn’t all that convincing, there are moments which were meant to evoke emotions from the player but…it just doesn’t cut out which in conclusion, the story as well as the characters are forgettable (sure thing Mr Writer, you can kill any of these guys in the Ghost team, I wouldn’t be feeling sad to begin with anyway.)  - Graphics &amp; Animations:  There isn’t much to talk about this category either, the graphics is fabulous, the world scenario and level designs change frequently so it won’t give you a feeling that the game is repetitive by any chance. Animations is so-so okay as the movements and facial expressions could get quite rough at some point. If I remember correctly, GRFS were ported from Xbox 360 to PC (correct me if I’m wrong), the game’s performance isn’t all that good since stuff like frame rate drops and stuttering happen to me occasionally. But…if you’re a person who values the game itself rather than the graphical contents (like me XD)…then I’d say…it doesn’t matter anyway.   - Replay values: Keep this shortly, I’d say that if you’re a completionist then you can always go back from the start, doing the mission’s challenges to get unlock for your guns (Do X with Y; Don’t do Y then Z; etc.). Or play on harder difficulty if you’re a challenge seeker. (In my case I’ve already beaten the game at the highest difficulty.)   - Pain in the ars.e:  Uplay  Overall, would I recommend this game? Yes, of course! For a price tag of $20? The same question can be made for CoD MW2 and the same answer I will give: Yes, it’s very worth it. However, I got this game during a sale and it was like $4 and hell nah, I wanted to pay this game at its full price. It’s an amazing game that will definitely worth every single penny you spent.",
            "review_score": "1"
        },
        {
            "review_text": "The series that fell by the way-side because it had to compete with Call of Duty. Tom Clancy's Ghost Recon: Future Soldier is the latest in the Ghost Recon saga and it breathes fresh air into a long-running franchise.  Take control of a squad of special-op's in this tactical third-person shooter and infiltrate the most dangerous locales around the globe to take out national and global threats.  Commanding feels like the real deal - You tell your squad who and when to shoot, allowing for a vast selection of ways to approach your challenges.  Every gun is customizeable - Earning parts by completing challenges, you can customize your loadout before every mission. Play your way.  The gameplay is phenomenal and has replay value, but the port itself is a little lackluster.  It is definitely playable, but as with most of Ubisoft's PC ports, it has graphical glitches.  Easy, Normal, Hard, Elite and Hardcore difficulties available from the start.  Still recommended for fans of Tom Clancy's Ghost Recon franchise, as well as tactical military shooters.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I played this game TONS on my PS3 but right now, it's not fun after you complete the campaign. No-one plays multiplayer and unless you have a friend to play co-op with, there's not much to do. :(   Pros: Very fun to play, sync shot, adaptive camo I feel it had beautiful graphics  Very cool futuristic stuff Complex attachment system making your gun how YOU want it Cover system is cool Use of bipods is pretty new (I hadn't seen it in other games besides if you go prone more accuracy etc) Cons: Community is virtually dead right now.  Boring without friends Attachment system can be TOO complex for some :P (though there is a preset accuracy damage etc thing you can make for your weapons)  A fun game, but without the multiplayer, it's getting boring D:",
            "review_score": "1"
        },
        {
            "review_text": "The game was incredibly unstable for me, but when it let me play without crashing out now and then, it was fun enough. I expected the gimmicky gadgets to be ignorable like they are in most games like this, but the drone you get was actually really cool and changed the way I played teh game more than I anticipated. Overall, it's like Rainbow Six + Ubertech gadgets, so if you're into tactical squad based shooters, it should be entertaining enough. I felt it strayed too far into action-movie-logic a bit during some of the missions (The last sequence especially was extremely over the edge - apparently walking in a diamond formation in an open field makes you immune to millions of bullets!), but most of the missions were more of the tactical speed I was hoping for.",
            "review_score": "1"
        },
        {
            "review_text": "While i love the co-op i hate Uplay DRM.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best tactical shooters out there.",
            "review_score": "1"
        },
        {
            "review_text": "its really good game  ",
            "review_score": "1"
        },
        {
            "review_text": "Ever since Splinter Cell Conviction I've been dying to see more stealthy action games. So, it is with great pleasure that I can inform everyone that Future Soldier delivers on this front. The tag-and-shoot element from SCC is back, now called Sync Shot. It works the same way; you tag up to 4 enemies and hold a button to shoot them down, all at the same time. The graphics are detailed and sharp, and the voice overs are once again solid. It's a realistic looking game, and it looks great in motion with all the visors and gadgets. Unfortunately the game becomes more of an action game during the last few missions - note that there's still some stealth involved, but it's more fast paced than the missions leading up to these last couple of levels. Nothing frustrating or annoying, but it's just someone people will notice I think. With 10 hours of gameplay (single-player) the game was also surprisingly lengthy. So - an incredibly fun game, and that's what games are all about.  [Rating: 82/100]",
            "review_score": "1"
        },
        {
            "review_text": "Truly become a future soldier with this game. It features not only optical camouflage, the cross-com and synchronised headshots as well as a much more interesting feature called 'gunsmith'. Gunsmith allows you to customize your guns even in the smallest details. The story is a typical Tom Clancy and does not feature a wide variety of mission types or any major plot twists. Co-Op is available during the entire campaign, multiplayer and horde mode are included as well. Multiplayer appears to be completely deserted.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ UPLAY!!!!!!!!!!! I WISH I COULD PLAY BUT I GOT BANNED FROM UPLAY FOR A ♥♥♥♥ING HOUR BECAUSE THEY GIVE YOU ♥♥♥♥ FOR INSTUCTIONS FOR ENTERING THE CD KEY!!!! WHY THE ♥♥♥♥ DO I EVEN NEED A CD KEY?!?!?!?!?!? I BOUGHT A ♥♥♥♥ING STEAM GAME SO I DONT HAVE TO DEAL WITH THIS ♥♥♥♥!!!!!! This is a great game and is fun to play with friends but good ♥♥♥♥ing luck starting this ♥♥♥♥♥ up.",
            "review_score": "1"
        },
        {
            "review_text": "Is a good game especially if you have friends to play with, still the previous versions have better campaings",
            "review_score": "1"
        },
        {
            "review_text": "So far, so good. It's not the old school classical Ghost Recon, but evolution isn't always bad. There are some missions where alerting enemies means you instantly fail, so it still gives you a good mix of both worlds. The gun play is pretty good, but the mouse issues need some resolving if you have a mouse that is reported as 'not working' with the game. My PC plays it at 40+ FPS, with slight dips during heavy explosions or low visibility now and then, so just make sure your CPU and GPU are ready -- any quad core CPU and 256-bit GPU oughtta handle it pretty well. It also supports ambient occlusion, global illumination, DirectX 11, and tessellation.  Other than the bad, the good things seem to outweight them. The game supports 4 player co-op so you can team up with 3 friends of yours and go through the levels, and it has the usual multiplayer mode as well.   Overall, enjoyable so far. Check it out if you're a Clancy fan, or just like the slower, more methodic shooters like these.",
            "review_score": "1"
        },
        {
            "review_text": "I had a lot of fun playing GR:FS :)  Pros:  +great sound +awesome atmosphere +feel like a BAWS when simultaniously killing multiple enemies via order +varied settings/missions +many weapons  Cons:  -bad console port -very linear -weak story(telling)  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Had an awesome campaign! a huge amount of customization which was too much fun to play around with and had a good multiplayer! The campaign was best with a friend on co-op and the high-tech feel to it was really cool",
            "review_score": "1"
        },
        {
            "review_text": "For the fluidity of movements and the graphic presentation, it is among the best. I do not wish to complain of anything else. How well it was presented was all that matters to me. Enjoy the game :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! I just wish there was an option to have an intimate relationship with your team. That would make this game the greatest. I just really love men in tactical gear. Ummfff. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I ain't afraid of no Ghost.  Fun and interesting SP campaign.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun. However it feels like the ending was cut short due to budget issues looming over the devs.    Other than the ending and the ocasional bugs. Game is a must play.",
            "review_score": "1"
        },
        {
            "review_text": "Oops - I slipped up here as I prefer Single Player games - Lol!",
            "review_score": "1"
        },
        {
            "review_text": "Has Some errors due to the ubisoft launcher but that isn't the game fault,also some bugs,one time i got stuck in a wall with a granade but is okay",
            "review_score": "1"
        },
        {
            "review_text": "1 of the best co-op games (when it worked)... graphics are amazing but the connection error broke the game",
            "review_score": "1"
        },
        {
            "review_text": "unpopular Game but it's really a decent game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you can get past the terrible port.",
            "review_score": "1"
        },
        {
            "review_text": "The game is OK. It is not really a deep and meaningful game but it is fun. It is similar to splinter cell conviction but here it has a reason to do this (while I hated splinter cell conviction to have destroyed sam fisher's saga). The gameplay can be (actually SHOULD BE) very tactical. You can give very simple orders to teammates. It is a not at all as tactical as older ghost recons, but the overall gameplay style is ok and well balanced. You can't really go and shoot everybody, you have to plan something first. Graphics are nice with some spots like 'what the hell?' with awful textures and some flickering shadows, general level design is also nice. 12 hours to complete the campaign without worrying about achievements. Good game if cheap (not more than 10 euros I would say). 75/100",
            "review_score": "1"
        },
        {
            "review_text": "I like this game (even though I have never played it :P) but if you have a Windows Computer, this game is not for you- it runs slow, VERY slow.",
            "review_score": "1"
        },
        {
            "review_text": "Why ghosts why not phantoms",
            "review_score": "1"
        },
        {
            "review_text": "made new robot friend in Siberia new robot friend blew up everything with mortar new robot friend shoot down all annoying helicopter with mortar new robot friend make explosive poetry with mortar  new robot friend may or may not be predecessor of skynet, but still new robot friend.    good helicopter come, leave new robot friend behind to die in fiery explosion.  10/10 would make new robot friend again",
            "review_score": "1"
        },
        {
            "review_text": "I played the ♥♥♥♥ out of this on the xbox 360. I loved the damn game soo much. The multiplayer when working was the best there was. It required communication with your teammates and cooperative play too. One man on the drone, One with a lmg for suppressing fire, and ghost to run around hacking people so you could get your coordinated kills. Coordinated kills were the best way to score points and come out with the victory. We would hack the team and leave one guy alone and then hack him once the rest respawned that way you can just know where every enemy is at all times. As for campaign we played the hell out of that too, favorite mission was the mission with the secondary mission of breaking 40 necks. Game gets a 10/10 for fun. Only got a few hours on the pc but would recomend it to anyone for a $10 and under purchase because its not worth $10 anymore, You can see how COD copied this game shortly after this one came out.",
            "review_score": "1"
        },
        {
            "review_text": "Worth getting on sale. The single-player campaign is not very long but it's good, graphics are awesome and it has some really cool mechanics. It has co-op as well, so if you have some friends to play it with it's even better. Never tried the multi-player, so I can't say anything about that.",
            "review_score": "1"
        },
        {
            "review_text": "Yo COD! pack your backs and get the ♥♥♥♥ away from steam, A new hero has arrived.",
            "review_score": "1"
        },
        {
            "review_text": "Modern installment in the series. Does not play like previous GR, more like Splinter Cell: Conviction. And it's not a bad thing. Game feels solid and fun to play, and it looks pretty awesome on PC. Only technical difficulties are darkening the picture of a good game: 80/100.",
            "review_score": "1"
        },
        {
            "review_text": "Great campaign, brilliant gameplay and amazing multiplayer add this game to 'must have' list",
            "review_score": "1"
        },
        {
            "review_text": "This games a ♥♥♥♥in broken ♥♥♥ piece of ♥♥♥♥, waste of money.",
            "review_score": "1"
        },
        {
            "review_text": "its good but its beter when you play it with firands in the CO-OP",
            "review_score": "1"
        },
        {
            "review_text": "This games a ♥♥♥♥in broken ♥♥♥ piece of ♥♥♥♥, waste of money.",
            "review_score": "1"
        },
        {
            "review_text": "Singleplayer is fun,but the multiplayer it seem like dead (just my opinion)",
            "review_score": "1"
        },
        {
            "review_text": "After many patches, the game is very playable. I waited just long enough i guess. Port of course (UBI would have it no other way), but plays like a PC game should. Had fun in the MP, BUT really wanted to do up some CO-OP.",
            "review_score": "1"
        },
        {
            "review_text": "Slow mo effects while raiding is superb. 69/1",
            "review_score": "1"
        },
        {
            "review_text": "If you can past the horrible optimization of the game, it is really fun. I just finished the first mission while also doing some guerrilla mode and had a blast. I would recommend the game. I get a stable 63 FPS(Capped becauase of game) maxed out with DirectX 11 on a Nvidia 690, i7-3930k at 3.2ghz, and 32GB of RAM.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "My opinion refers to single player only - the gameplay is great, I really like the option of optimizing your weapon, controls are a bit clumsy especially when you want to quickly move to some spot (when you are using sprint, you are running directly to closest cover) but bearable. What I really don't like is POOR optimisation - on a PC which allows me to run Battlefield 4 on high settings here I have to set them to low and I get 17 - 25 fps.   If you want to play a good TPP Stealth / Action shooter, Ghost Recon Future Soldier is probably the best choice. I wish there would be more games like this one.",
            "review_score": "1"
        },
        {
            "review_text": "It's Ghost Recon, great game.",
            "review_score": "1"
        },
        {
            "review_text": "Play it. It's perfect",
            "review_score": "1"
        },
        {
            "review_text": "graphics for pc kick concole butt",
            "review_score": "1"
        },
        {
            "review_text": "Still having fun with this game, solid. Long barrels turn me on.",
            "review_score": "1"
        },
        {
            "review_text": "All out nice game. Good balance between shooter and stealth tactics. Could be a little longer, but overall challenging yet satisfying. It's nice that they made the AI smart enough to automatically go to cover and fire back when in assault mode and in recon mode be able to maintain silence and stealth until you are detected...oh GOD don't get detected on the highest difficulty. But I digress. Good game, good graphics, good fun, worth every coin.",
            "review_score": "1"
        },
        {
            "review_text": "Great GAME!!",
            "review_score": "1"
        },
        {
            "review_text": "Such a good game. Plays good, looks good and the weapon customisation is absolutely awesome! It takes some time do get a grip on the controlls, but when you do this game is a blast. Especially when played with friends.   The campaign can be played with up to 4 players, there is a cooperative mutliplayer and a plain vs - multiplayer. Sadly there are few who play it in multiplayer though its a lot of fun as well.  And to be fair it's an ubisoft - title, so i guess you should expect some bugs.. although I personally have, 3hrs into the game, only encountered one, which was mere an annoyance than anything problematic (2-player coop did not load correctly on first try, rematched, worked on second try)  I can only recommend grabbing this game if you are in to tactical shooters!",
            "review_score": "1"
        },
        {
            "review_text": "Though it may not be as tactically inclined as the older titles, Future Soldier holds it's own charm with all the gadgets you can equip and the Gunsmith system to make a loadout that is truly your own. On a side note, AI is typical of modern games in that more &gt; dynamic, but, this doesn't detract from the fun of Co-op and MP.",
            "review_score": "1"
        },
        {
            "review_text": "Its quite a different game with fair bit of stealth involved. Not just about running and gunning in Multiplayer. You have to take cover and move with your team!  Had a problem logging into Ubisoft's Uplay extension (like Steam / Origin) second day itself...",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game to play. The single player campaign is long and it takes a good time to beat. The gurrilea mode is long and have to get past so many waves I don't even think you can get pass till you waste your whole day playing it. The muli-player is bad for now becauses of all the problems they are having with trying to look for a match or even someone throwing a smoke at you then you are lagging like crazy and he is shoting at you, HAHA!! Also the one level with going up 15 floors OMFG!!! THAT WAS DUMB I WISH THERE WAS AN EVELATOR. Also was lagging carzyier than when it rains in some levels.",
            "review_score": "1"
        },
        {
            "review_text": "Such a good game. Plays good, looks good and the weapon customisation is absolutely awesome! It takes some time do get a grip on the controlls, but when you do this game is a blast. Especially when played with friends.   The campaign can be played with up to 4 players, there is a cooperative mutliplayer and a plain vs - multiplayer. Sadly there are few who play it in multiplayer though its a lot of fun as well.  And to be fair it's an ubisoft - title, so i guess you should expect some bugs.. although I personally have, 3hrs into the game, only encountered one, which was mere an annoyance than anything problematic (2-player coop did not load correctly on first try, rematched, worked on second try)  I can only recommend grabbing this game if you are in to tactical shooters!",
            "review_score": "1"
        },
        {
            "review_text": "Best military shooter in a while. In an oversaturated genre, Ghost Recon brings a breath of fresh air with with its slower but more realistic tactical approach to every situation. Good graphics, great gameplay and a cool story (better than the typical military shooter in my opinion). Multiplayer is good but could use some improvement.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing like lining up a Sync Kill. If you like Battlefield, you'll like this.....unless you're just trolling to prove me wrong.",
            "review_score": "1"
        },
        {
            "review_text": "this game is terrible dont buy it really bad game play!! ",
            "review_score": "1"
        },
        {
            "review_text": "Nice storyline and fast-paced tactical combat. Actually very different from Advanced Warfighter series which is more tactical than this action-packed chapters. I would recommend it to all Tom Clancy's fans. I would disencourage people not suited to tactical games.  MULTIPLAYER: to play multiplayer smoothly remember to deactivate Windows Firewall since this game has problems with it (at least on my Win8.1 machine)",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this game without carefully reading the system requirements. This game only supports a very few video cards, and my GTX 550 TI is not one of them, so don't waste your time and money on this game.....",
            "review_score": "1"
        },
        {
            "review_text": "It's Ghost Recon, great game.",
            "review_score": "1"
        },
        {
            "review_text": "Slow mo effects while raiding is superb. 69/1",
            "review_score": "1"
        },
        {
            "review_text": "Not the best Ghost Recon, but still good, and very much worth playing!",
            "review_score": "1"
        },
        {
            "review_text": "Dont touch your graphics!!!! It breaks the game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Good Tactical Shooting Game!.",
            "review_score": "1"
        },
        {
            "review_text": "After playing it on Xbox 360 and now PC i would reccomend the PC version its more of a challenge and the graphics are amazing! plus its just PC nothing beats PC!",
            "review_score": "1"
        },
        {
            "review_text": "It's been quite a while since I finished this game and I've just returned to it after about 2 years. In my opinion the game was one of the most enjoyable and value for money games I've played. I particularly like the stealth aspect and the weapons customisation. I had a problems completing the weapons master challenge however after reviewing the forums I found the answer. I was a little annoyed to find I had to delete and then reinstall the game to complete the challenge. still, this was better than not achieving that one last elusive challenge. I like the DLC content as well. I thought the gameplay was great and particulary liked the squad takedown function as well as the auto cover ability. really disapointed that Ghost Recon : Future Soldier wasn't extended ever further. All in all I would recommend this game for those who enjoy some of the stealth options you can use here",
            "review_score": "1"
        },
        {
            "review_text": "All you have to do is open some ports, and you can enjoy full Co-op campaign mode, and it's awesome. Sync shots are working fine, no lag, no desynchronization, Uplay is working like a charm, but be careful Uplay is not cloud saving, even though he is telling you otherwise. You have alot of guns to chose from, and customization of those is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Flooded with cheaters, otherwise an incredibly fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game with a couple of poor design issues.   Graphics, design, gameplay all top notch stuff. A really enjoyable romp, with some really smart maps and excellent tactical challenges. Totally addictive missions if you like smart shooters.   But, the run mechanics are absolutely dreadful, simply no control over direction with mouse, and I never ended up where I was tring to run to. Shockingly bad.   The cover system works well but the number of keys used was too much. Plenty of expletives were used when I could not manage to exit from cover in a firefight or jumped over a wall instead of covering behind it after running up to it.   Sorry guys, I like a challenge, but that last timed mission with the two targets fleeing was the last straw, must have tried 50 or more times to get through it, and most of the time feeling helpless that there was nothing I could do to prevent the targets fleeing during the firefight in the forest. Seems only luck will allow you to get through that first section and I am not interested when luck is the only way to complete a mission.  In all, this is an excellent game, and I highly recommend it, a lot of really smart work went into making this and the result is superb. But like so many other classics, there is always a flaw or three to contend with.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun and challenging, great high quality details and game play, the only issue is with the occasional frame stutter even on high-end hardware. I haven't tried the multilayer yet, but it seemed to work when I tested the connection to other players.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun and challenging, great high quality details and game play, the only issue is with the occasional frame stutter even on high-end hardware. I haven't tried the multilayer yet, but it seemed to work when I tested the connection to other players.",
            "review_score": "1"
        },
        {
            "review_text": "Great Stealth Action and it really shines where Franchises such as COD fail (when comparing single player campaigns). The story was very meh as all interesting storylines involving soldiers have been done before. In general it would be very fun to play with friends. Too bad ubisoft developed it coz I can't play online with others and as a result the community died... If you have mates though setting up a game with them is easy enough ",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunately i purchased this pile of console ported waste. Dont get me wrong i like the game and some of the elements in it but its the fact that its an Extremely lazey port that hinders any sort of recomendation.  One of the biggest issues i am currently having, is the game itself is bugged to the point where progression in the main campaign is impossible. This is due to controller issues. I do not have a gamepad controller installed on my PC or any of my peripherals plugged in apart from headset, mouse and keyboard yet the game will constantly show prompts in the format of XBox buttons.   One of the pieces of equipment you have at your disposal in this game is a small rotor crat UAV. This is probably one of the most important pieces of equipment you have. Unfortunately it is useless in on the PC due to the controller bug. The Drone will just decend untill it hits the ground then be unable to move. This is certainly an issue when in the campaign there is a sequence where you have to use it to recon a shack. The drone will instead just lower itself into the tepid waters of the river you are standing in making itself a diseased filled watery grave.   I would like to point out that the developers have been as useful as a mint-flavored suppository in resovling issues. Their official fix is to uninstall all peripherals before using their game,",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game and all the dlcs,but after that i acknowledged that most of the service is down .So why does ubi stiil put dlc on the shopping list?high contempt this kind of cheating behaviour",
            "review_score": "-1"
        },
        {
            "review_text": "This is essentially and console-port and a bad one. I didn't like the story or the combat because of it being boring and being far too linear most of the game the promise of the features are kind of non existened. Pls I f you buy some tps cover based game you will find more better games and at sale cheaper.",
            "review_score": "-1"
        },
        {
            "review_text": "-Game is too linear. -Bad optimization (it says minimum: GT8600, Pentium D and for recommended: GTX460 and Intel Core2 Quad. I played it with a GT630 2gb and Intel Celeron G1620 on low, 1280x1024. Had lag. I lowered to 1024x720, still had lag in mp.) -multiplayer simply sucks.  The only reason to buy this game now is if you want to have fun with friend on Guerrila or you want to play the campaign CO-OP. If that's not the case, don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "I shall edit my review a bit,   This game is not the game you would expect from a Triple A title game. It's so dissapointing to see a tactical game turn into ♥♥♥♥. This game is nowhere tactical as you might think. The only tactical thing is pressing Q keys 4 times and press m1 to win.  The first thing you''ll notice when you boot up this game if you have a potato CPU is that your frames go to near zero. To quote some famous youtuber 'The frame in the game goes zero, zero, zero'. I had to turn to the lowest setting to even enjoy ♥♥♥♥ing cutscences without fps lagging. This game engine is so poorly optimized that I would say Planetside 2's game engine is even more optimized. Hell sometimes the game just Alt+F4 without my input for no reason.  As with most AAA titles, the singleplayer returns with the same ol' plot.  'Nuke, russians, vodka blah blah omg nuke go boom we 'murcia coming in the day 2 save the ♥♥♥♥in' day yea.' I'll give credit for the singleplayer as it can be fun sometimes. SOMETIMES. Other than that it's just a mock stleath game.  Now the multiplayer... god who the hell was tasked to create the multiplayer for this game? A triple A title and there's no dedicated servers? No ♥♥♥♥ing server browsers? When I first played the multiplayer my game was plagued with problems. I kept on disconnecting from the game for no apparent reason, and when I even had the chance to play the multiplayer it was all like 'Hammer the crocodile' game you have in arcades. That's the best I could summarize it. You wait for people to pop, you shoot, you win. Simple as that.  Triple AAA game from Ubisoft that went through the quality control check. GJ Ubisoft. Go focus on ♥♥♥ Creed Bajillion ''Murica strikes back again.'",
            "review_score": "-1"
        },
        {
            "review_text": "I normally do not leave reviews, but i must say i am very disappointed in this game. I played the Beta on xbox 360 but never bought the game. Decided i would get it on the pc so i could enjoy it fully. Well the online community is almost non-exsistant. Takes forever to find a match and when you do its most likely going to be a lopsided game. Also the controls are sloppy. Ive been kill many times because my character couldnt figure out how to hit the wall or would take himself off the wall completely. The free to play 'phantoms' is just a better experience online then this is. Thats with not paying a single dime for mupliplayer either in phantom. Sadly, I cannot suggest this game. Played a lot better on console but sadly the pc version dissapointed me.",
            "review_score": "-1"
        },
        {
            "review_text": "ithe uplay crate a acuunt is dont warking ",
            "review_score": "-1"
        },
        {
            "review_text": "Having put many hours into the original Ghost Recon, I was disappointed with the way the sequels diverged from the gameplay from the first game. I haven't played any of the newer (ghost recon) games in many years. I saw this game on sale the other day and thought that it was time to finally give the series another go and try and not compare it to the original game as I knew it wouldn't play the same and I'd end up disappointed. Despite entering the game with an open mind I am very disappointed. I have not anything to say about gameplay. Honestly I didn't get that far. This game is obviously a terrible console port. It is unplayable on my PC. The game runs butter smooth however the method that the game uses to capture mouse movement and move the character completely breaks it for me. From what I've seen the game emulates your mouse as a thumbstick on a controller. This results in there being a maximum input on the mouse (as what would happen if you pushed the thumbstick fully to one side, you can't move any faster than that). Being a low senstivity gamer I set the sensitivity low (10/100) in game, this results in it taking ~5 seconds to turn around as no matter how fast I move the mouse it will not turn my character any faster due to the maximum input imposed on the mouse.",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself is great...but as always Ubisoft did what it usually does: screwed it up I just CAN'T PLAY IT ONLINE WITH MY FRIENDS! It keeps failing during joining... We've tried everything from port forwarding to remove uplay and bla bla and it doesn't work.",
            "review_score": "-1"
        },
        {
            "review_text": "Pre-ordered this game and haven't been able to play the game once without a major issue happening. Very terrible port with too many bugs to count. Single player works but isn't THAT fun.  Co-op breaks too easily and could never get it to work after spending hours reading on fixes that just seemed to never work for anyone. Multiplayer was never any good and doesn't seem to exist anymore with the release of Ghost Recon: Phantoms(basically a free to play version that actually gets updates).",
            "review_score": "-1"
        },
        {
            "review_text": "Biggest mistake of my life, a prime example of why Ubi is so hated in the pc community. Don't get this if you want to play multiplayer, because you won't be able to.",
            "review_score": "-1"
        },
        {
            "review_text": "So I have a computer that can run Battlefield 4 on Ultra 1080p/60FPS, but this game is so horribly unoptimised that I get 20FPS at 720p with minimum settings. basically unplayable. I can't recomend this to anyone. 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible port. I am sure its fun if you get it to work properly. 0000000000000000/10",
            "review_score": "-1"
        },
        {
            "review_text": "glitch laden , with NVIDIA or AMD cards. Would have been better off using a fresh game engine rather than a souped up GRAW engine. Loved the series from the start, hopefully the next one is better",
            "review_score": "-1"
        },
        {
            "review_text": "such a boring game..losing points on everything of it",
            "review_score": "-1"
        },
        {
            "review_text": "Decent Tom Clancy title. It only provided me about 10 hours worth of gameplay as the single player is very short and easy. I couldn't find even one full game for multiplayer without waiting 3 hours for a lobby to fill. If you have money to burn it's okay, otherwise spend it on something more worthwhile.",
            "review_score": "-1"
        },
        {
            "review_text": "Forgettable.   Ghost Recon used to be a great tactical shooter, where strategy and full control of your team was the key to success. Now with Future Soldier it's been turned into yet another generic mindless action-packed linear shootfest.  I will not dignify such disgraceful mess with any more attention beyond the time it took me to complete it.",
            "review_score": "-1"
        },
        {
            "review_text": "Game keeps crashing",
            "review_score": "-1"
        },
        {
            "review_text": "no option to invert axis on controller for pc. wtf, seriously. plus runs through uplay, which is kinda annoying but no anywhere near as annoying as ubisoft apparently deciding that if you want to play this game with a controller you must not care about not being able to play with inverted axis. seriously first pc game in years that doesn't offer what i consider to be a fundamental option. glad for new steam refund policy, first game i've ever felt cheated for buying!",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy it, do yourself a favour. I have been trying to play with friends for 3 hours now. i wish i could have my money back, this game is REALLY not worth it.   P.S Uplay suck my balls",
            "review_score": "-1"
        },
        {
            "review_text": "This is total crap. Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "TOTAL ♥♥♥♥♥♥♥T. I couldnt even start the damn game because it never gives you a cd key and guess what? you need one to play it because uplay needs to suck its ♥♥♥ untill its intestines turn inside out. dont waste your money like i did",
            "review_score": "-1"
        },
        {
            "review_text": "Bad port.  Let me clarify my problem with the game. While the game has gamepad support, it does not allow you to invert the Y axis on the controller without running a third party fix. The way I play games these days require me to use a controller and I've been playing with inverted controls for over 20 years now. I am not going to change my style just for one game.   Since the game is a few years old already, the developers are showing no desire to make this fix. I tried to get this game refunded 4 times before giving up. As this is one of the things I wish I knew about the game before I bought it, I want to warn others about this issue.   If you play games with a controller AND you use inverted controls, this game may not be for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Before you buy, you should know one thing if you're a gamepad user. THERE IS NO INVERT AIM FOR GAMEPAD! For myself, I've played inverted since I started playing shooters over 20 years ago. This lack of a very -common- option, renders the game unplayable for me. What a waste.",
            "review_score": "-1"
        },
        {
            "review_text": "Way too many cut scenes, ever 5 seconds theres a cut scene. Why so many ♥♥♥♥ing cut scenes? Is this a movie or a game? I cant ♥♥♥♥ing tell. The gameplay is not anything like the ther ghost recon games. I enjoyed some of the missions like the stealthy ones that reminded me of the other ghost recons but else it sucks ♥♥♥, and not the good kind. If you like ghost recon you wont like this.",
            "review_score": "-1"
        },
        {
            "review_text": " TL;DR:",
            "review_score": "-1"
        },
        {
            "review_text": "Booted up to a black screen had to change some **** to make it work (in windowed mode)  Load of ****  0/10",
            "review_score": "-1"
        },
        {
            "review_text": "An Epic fail in the world of Ghost Recon. If you love the series, don't buy this one, because it should have the name of Ghost of Duty, or Reconfield. I was very dissapointed.",
            "review_score": "-1"
        },
        {
            "review_text": "~~DO NOT BUY~~ I REPEAT. DO NOT BUY THIS GAME. Crappiest console port, alot of crashes, blue screeens. Constant glitches/bugs. Game breaking bugs. ♥♥♥♥♥♥ DRM. ♥♥♥♥ing consolized UI. DO NOT BUY THIS GAME!",
            "review_score": "-1"
        },
        {
            "review_text": " Dont go for this game.  It was tied with Ubisuck's 'Udont♥♥♥♥ingplayatall' stupid app.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this 'game'. Seriously. Save money and time.",
            "review_score": "-1"
        },
        {
            "review_text": "cant even make a game where you can play with your mates broken pile of ♥♥♥♥ do not waste time on this ♥♥♥ crack of a ♥♥♥♥ing game taken somthing an xbox can do but pc cant ♥♥♥♥ing joke ♥♥♥♥ you ubisoft ♥♥♥♥ you steam and ♥♥♥♥ you uplay hope you all die of cat aids",
            "review_score": "-1"
        },
        {
            "review_text": "  its cant play on win7 many extreme crash to desktop random time. and not support from ubi to fix the problem. keep the money for better game dev guys. i warn you.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't mind third-person shooters, but in this one the controls and camera perspective are quite disorienting. Also, the unskippable cutscenes after every death and having to launch Uplay to play this game are off-putting. Save your money for better shooters instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Uses U Play",
            "review_score": "-1"
        },
        {
            "review_text": "Jsut bought two copies as I wanted to play co-op. After several days of trying to connect still no success! We just get the massage that the other players are offline. Tried everything. DO NOT BUY THIS GAME!! (Or anything for Ubisoft in the future!) :(",
            "review_score": "-1"
        },
        {
            "review_text": "If you're looking for a bog-standard third person shooter with some light stealth mechanics then you'll probably like this fine. If you're looking for anything like the old Ghost Recon games, don't bother with this.",
            "review_score": "-1"
        },
        {
            "review_text": "At the beggining I tagged it under 'stealth action' but if you play it on elite difficulty is prone simulator.  And the drama, so much drama",
            "review_score": "-1"
        },
        {
            "review_text": "Campaign is really by the numbers, and more linear than MW3. Multiplayer has some neat ideas, but is held back by a lack of dedicated servers, small player base (not dead, but there are a few times where lobbies take a bit to fill), and content filling up the wrong things. Less silly bandana masks, more gameplay.  Additionally, the extra time they took with the PC version didn't seem to do much. My favorite holdover from the 360 version this is clearly ported over from is that in multiplayer, you will constantly have 'LB' displayed by your crosshair to remind you that you can press LB to throw your grenade. Except you aren't on Xbox 360, so it's actually F. Good job, Ubisoft.",
            "review_score": "-1"
        },
        {
            "review_text": "Not that geat on PC. Cannot access options during game, controlls are terrible, running makes you lose control of your character",
            "review_score": "-1"
        },
        {
            "review_text": "This game is full of DRM. It is very hard to get it working. I cannot play it on my IP address apparently, I have to connect to a friend's wireless to play. I have tried everything. I would not waste your money on this game because the developers hate you.",
            "review_score": "-1"
        },
        {
            "review_text": "This is neither a tactical shooter nor a good game on the PC ... worst controlls I ever experienced on a 3d person 'arcade' shooter. Extremely linear and scripted AI. Compared to graphically equal games really bad handling of memory, graphics card etc. Unless its on sale - not recommended. For about 3 to 5 bucks its ok ..not much a wast of money.",
            "review_score": "-1"
        },
        {
            "review_text": "dont even bother countless bugs. can not complete story because of scope glitch, if your using a smaller computer screen expect black borders you cannot change in game. multiplayer well be nice but good luck trying to stay connected or find a server you do not lose connection right off. Ubisoft has also let this one fall right off no attempts it seems to fix anything save your money. If your looking for Ghost Recon play GRO much better and its free.",
            "review_score": "-1"
        },
        {
            "review_text": "Would not recommend to anyone who wants to play a tactical shooter. There is nothing realistic or tactical about the gameplay here. The only thing realistic at all are weapon and country names.   GRFS has removed nearly all of the fps simulator like fundamentals that the predecessors had and traded them in for movie like action scenes that are cliche and predictable, cover 'systems' that are clearly taken from a successful game of a different genre (Gears of War), and forgiving and easy to jump into gunplay. Ghost Recon originally was never about any of the features that are within GRFS. You cannot even control your own squad in this game. They just run around like invisible gods amongst the enemy until you yourself open fire.  The name Ghost Recon should never have been attached to this game. I believe most people who played and enjoyed the prior titles find very little of what they used to like in this current iteration.",
            "review_score": "-1"
        },
        {
            "review_text": "unable to load game just purchased and installed from steam. steam support a lost cause.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS IS NOT A RECOMMENDATION! THIS GAME IS A PIECE OF ♥♥♥♥ CONSOLE PORT BY UBER♥♥♥♥, BOGGED DOWN WITH ♥♥♥♥TY BUGS THAT RENDERS THIS DAMN ♥♥♥♥ING UNPLAYABLE!! AVOID AT ALL COSTS AND DO NOT BUY GAME BY UBER♥♥♥♥!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Alright, I was pretty hyped back then in 2012 when I heard that GR:FS is getting released and after hearing the negative reviews I decided not to buy it. Buying it last year seemed like a decent game for 10 euros.  To begin with the issues the game has are as follows: after you download the game you need a Uplay account in order to play the game, otherwise the game won't start... And even with that the game has many graphical issues with my GTX 580, sometimes the display driver stops working and other unnecessary ♥♥♥♥♥♥♥t happens. And sometimes the game gets awful graphical issues and look I can play games like Wolfenstein: The New Order without issues or Company of Heroes 2. The game has awful mechanics and the controls are straight from the console version.  Then the actual game, the storyline seems alright even tough there are clichés within the game... Russia starting WW3 and typical ploy from western media. But the gameplay, it's nothing like the previous Ghost Recon games! The stealth is almost non-existent except for few levels (where you infiltrate the airport) and the stealth mechanics don't work always, even you use camo and act as discreet as you can the enemies still spot you and the mission gets scrubbed.  The checkpoints are fine as long as they work, sometimes it didn't even allow me to save the damn game which made me really ♥♥♥♥♥♥ off! Thanks alot Ubisoft for making this crappy game! I'd rather get those 10 bucks back than play this ♥♥♥♥♥♥ game.  If you want my advice, steer well clear of the PC version and if you happen to own a PS3 or an Xbox 360 this game might be the thing for you. I bought the game few years ago on my PS3 and it did work fine except some minor issues with the game bugging on a few scenes but don't worry it's not as bad as the PC version.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Its basically an xbox game. Calling it a pc game is kinda like calling a ♥♥♥♥♥♥♥♥♥♥ a therapist.   I suppose if you play through the campaign or do co-op it could be enjoyable but I in general dislike the whole xbox feel. (Hence I play pc games, hurr durr).   Only played GR Advanced Warfighter 1 &amp; 2. Both of which felt a lot more strategic I suppose you could say. Learn from your errors, try a new approach, think about how you're going to move forward, where your squadmates should be positioned, multiple attack angles to consider etc.   This just feels like im on a train rushing towards the end of tunnel as fast as I can. Conveniently there is also a nifty gadget that can get me through any situation.  Step forwards or backwards? Not really sure, younger audiences might enjoy this style a lot more. This salty sailor won't be buying any new GR based on this incarnation.",
            "review_score": "-1"
        },
        {
            "review_text": "Unable to play, fails to load with 'CreateProcess failed' error. All the results on Google are from people trying to crack the game or trying to load it on XP, so no help there as I purchased it legally through Steam and am running Windows 10. Nothing worked, which is a shame because I did enjoy this on the Xbox 360.  The 184 hours I supposedly played this game for were spent doing something else entirely. At one point the game did launch, partially, but it would immediately quit the GUI. The game's process never quit, and apparently I didn't notice for a week.",
            "review_score": "-1"
        },
        {
            "review_text": "Do NOT purchase this game! Ubisoft has released a broken port that us absolutely unplayable. From the Forums, my personal experience and the patching issues they have had, approximately 25% of consumers have a broken, unplayable product, and over 50% are experiencing issues that break some part of the game (multiplayer, guerilla mode or campaign mode).",
            "review_score": "-1"
        }
    ]
}