{
    "app_id": 212780,
    "name": "New Star Soccer 5",
    "release_date": "2012-09-27",
    "developer": [
        "New Star Games"
    ],
    "publisher": [
        "New Star Games"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Simulation",
        "Indie"
    ],
    "achievements": 100,
    "positive_ratings": 190,
    "negative_ratings": 105,
    "price": 9.99,
    "description": "Live the life of an up-and-coming superstar in this unique football career game. Start out as a 16 year old lad and work your way to the top to become a footballing legend!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/212780/header.jpg?t=1447355890",
    "minimum_requirements": "OS:Windows XPProcessor:1 GHzMemory:1 GB RAMGraphics:128 MB of video memoryHard Drive:256 MB HD spaceSound:OpenAL compatibleOther Requirements:Broadband Internet connectionAdditional:A gamepad is highly recommended",
    "recommended_requirements": "OS:Windows 7Processor:2 GHzMemory:2 GB RAMGraphics:256 MB of video memoryHard Drive:256 MB HD spaceSound:OpenAL compatibleOther Requirements:Broadband Internet connectionAdditional:A gamepad is highly recommended",
    "reviews": [
        {
            "review_text": "Even though the trailer does make it look somewhat ridiculous and not very soccer based, the fast based gameplay is very gripping and the gameplay becomes addictive in a flash. Once you get over the initial rookie problems, such as the relatively unwieldy controls and pace of game, it pulls you in and forces you to play for hours. Fantastic game.",
            "review_score": "1"
        },
        {
            "review_text": "i prefered the free game on the apps store ",
            "review_score": "-1"
        },
        {
            "review_text": "Great game but for now: DONT BUY IT! Servers not working about 1 week and game dont work now.When this problems will dissapear i will change my review,because this is amazing football 'be a pro' game :) Review update 17.4.2014 - Now servers working,but they are VERY unstable!!! :( Strange issues of servers continues! Review update 29.5.2014 - It is still little unstable,but is much better now :) Now i can really recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "terrible game. I bought it based on the flash game. But ok, let's go: it requires a new subscribe to their site for each career and, if you delete it, it's gone forever and you have to use a new e-mail. I won't get started on how bad is their server. I am really disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "Mix a oldschool gameboy football game with fresh add-ons and you got this game. A pretty fun beer &amp; pretzels game.",
            "review_score": "1"
        },
        {
            "review_text": "Although it looks like a simple game, it is really enjoyable and addicting. Along with football/soccer, you also play the life of a football/soccer player. The reality has been implemented via several things such as losing energy while going to play away, not ignoring the girlfriend, making the papers due to sensational events, earning from horse-racing more than football/soccer. So it has a pretty comprehensive content.  In the game, there are also some events irrelevant to reality like the Premier League championship of a team that have actually never been in the top places of the league, the quarter-finals of UEFA Champions League's including at least one team that actually join to the earlier qualification rounds of the tournament, German National Team's scarcely qualifying out of the qualifications for UEFA European Championship and FIFA World Cup... But these add spice to the taste of the game. :)",
            "review_score": "1"
        },
        {
            "review_text": "'It's FIFA and ISS Pro Evolution Soccer in 2D.' -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Awesome funny casual football/manager thing, great for relaxing !!!",
            "review_score": "1"
        },
        {
            "review_text": "Dont bother, this would be good on a mobile or tablet though.",
            "review_score": "-1"
        },
        {
            "review_text": "A rather basic soccer gameplay (with great chanting/singing during the games), smothered in a plethora of rpg like busy work menus. Not my cup of tea.",
            "review_score": "-1"
        },
        {
            "review_text": "ref sent me off for an ACCESS_VIOLATION_ERROR on goal, was banned from playing for 3 months",
            "review_score": "1"
        },
        {
            "review_text": "Love the game on mobile, they've tried to develop it on PC but they've just overcomplicated it and tried to add too much freedom. The reason people love the handheld version is because it is really simple. Now the game allows you to run around throughout the entire game, which in theory sounds good but it's really poor.  You call for a pass whilst running and your teammates pass behind you then you get the blame for calling for the pass poorly when in reality you're teammate is to blame for the hideous pass. Trying to head the ball is abysmal too. Once you get the ball, you can go on a lot of dribbles and play some nice passes in to your teammates but it's very difficult to tackle opponents and because your teammates can barely pass to you, you find yourself having played 1 pass throughout a game of 90 minutes.  It's cheap so if you enjoy the handheld version, you'll have a voice in your head urging you to buy this. However don't say I didn't warn you!  Oh yes, also the game keeps crashing. I've googled the error to no avail. An exception occurs so perhaps the developers need to try and look into what causes the exception to be thrown.",
            "review_score": "-1"
        },
        {
            "review_text": "Brilliant game, much better than the equivalent modes on FIFA and Pro Evo",
            "review_score": "1"
        },
        {
            "review_text": "If the game worked properly it'd be fun as hell. But no matter what loading up the game causes my computer to crash. In the 90s and early 2000s I could see a game causing a BSOD issue, but in this day and age it's unthinkable. There is NO support from the designer. Support tickets on their forums range back years without replies or fixes.",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game!  But i think its time to give this game a huge update like -more competitions -new kits -updated competition data   And a lot more. I hope the developer will give this game a huge update soon. But i am afraid that won't happen anymore. ",
            "review_score": "-1"
        }
    ]
}