{
    "app_id": 213330,
    "name": "LEGO® Batman™ 2: DC Super Heroes",
    "release_date": "2012-06-22",
    "developer": [
        "TT Games"
    ],
    "publisher": [
        "Warner Bros. Interactive Entertainment "
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Full controller support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "LEGO",
        "Action",
        "Batman"
    ],
    "achievements": 0,
    "positive_ratings": 969,
    "negative_ratings": 129,
    "price": 14.99,
    "description": "Legends Unite! The Dynamic Duo of Batman and Robin join other famous super heroes from the DC Universe including Superman, Wonder Woman and Green Lantern to save Gotham City from destruction at the hands of the notorious villains Lex Luthor and the Joker.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/213330/header.jpg?t=1552479297",
    "minimum_requirements": "Minimum OS: Windows XP, Windows Vista or Windows 7                 Processor: Intel Core 2 Duo 2 GHz or AMD Athlon 64 X2 3800+ - 2x 2000 MHz                 Memory: 1 GB RAM                 Hard Disk Space: 10 GB                                 Video Card: NVIDIA 7600, 7800, 8xxx or better, ATI 1950 or better                 DirectX®: 100% DirectX 9.0c compatible Audio Device                  Sound: DirectX 9.0c compatible                 Additional: 100% DirectX 9.0c compatible computer required",
    "recommended_requirements": "Recommended Processor: Quad core CPU 2.7 GHz                 Memory: 2 GB RAM                                 Video Card: NVIDIA GeForce 8800 or better; ATI HD3870 or better                 Additional: 100% DirectX 9.0c compatible computer required",
    "reviews": [
        {
            "review_text": "I 'finished' the main story of this game (with help from GameFAQs and some Youtube.  I'll admit, I feel 'stupid' playing the Lego games as I quite often don't 'get' what I'm supposed to do to complete each area, and I wish the saves were at any time and not so rare, as sometimes I've lost progress because I needed to quit for the day and couldn't save some progress.  Still, the game is fun, its enjoyable, and worth buying.  I hope there's a sequel, and it seems to hint so at the end of the game. I won't spoil the ending, but its worth watching.  The voices are great. The levels fun. Its a keeper.  ",
            "review_score": "1"
        },
        {
            "review_text": "As far as LEGO games go, this game is definitely... well, a LEGO game.  What I mean by this is that if you have ever played a LEGO game in your life then you already know everything there is to know mechanically about this game. In my experience, LEGO games are not so much about ground breaking, innovative gameplay; but rather, immensely enjoyable fun for the whole family that comes in all kinds of assorted flavors. Personally, I find the Star Wars flavor to be the best out of all of them, but for the same reason that a die-hard LOTR fan would tell you that the Lord of the Rings LEGO Games are the best.  Overall, if you haven't ever played a LEGO game, then don't just buy the 'latest and greatest'. Buy a flavor you love, and I promise you won't be disappointed :)",
            "review_score": "1"
        },
        {
            "review_text": "I playd a alot of lego games but that one is one of my fav!",
            "review_score": "1"
        },
        {
            "review_text": "LEGO Batman 2 is a fun little game. The game is rather short and the open world is very limited, however you do get access to many great DC characters such as the Flash, Green Lantern and Cyborg, Overall I did enjoy the game despite how short it was and miminal open world, but it is a Lego game.",
            "review_score": "1"
        },
        {
            "review_text": "My boys love this game. And why wouldn't they? It's Batman and Legos. Gets a little frustrating when I have to bale them out of a level that they are stuck on. You basically have to rewalk the whole level to see what they missed. But the complaints are mainly due to my kids being young and lazy when it comes to playing this game.   Its a good game if you love comics and Legos. If you love one or the other then maybe think hard before buying.",
            "review_score": "1"
        },
        {
            "review_text": "Grand Theft Auto Gotham, with Legos. It's a surprisingly good blend of Adam West Batman with Tim Burton Batman. Lots to unlock and a good-sized area to explore outside of the regular main quests. Amusing cutscenes, good puzzles, incentive to explore...I'm enjoying it. Downsides: Camera is not your friend sometimes, and you'll want to use a gamepad (which was awkward to get working to replace the keyboard-only default controls). Also no online play, which is a shame - just two people on the same computer.",
            "review_score": "1"
        },
        {
            "review_text": "SHAUN 14 hours ago it's a lego game.",
            "review_score": "1"
        },
        {
            "review_text": "By far the best lego game out there",
            "review_score": "1"
        },
        {
            "review_text": "its a good game for sum funn",
            "review_score": "1"
        },
        {
            "review_text": "Nice game from LEGO.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing upgrade from Lego Batman 1! Loved it!",
            "review_score": "1"
        },
        {
            "review_text": "This game changed my thoughts of legos. Its awesome. Did i mention its awesome?",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Totally awesome lego meets free roam",
            "review_score": "1"
        },
        {
            "review_text": "Hit that buy button, if you haven't already, and stop looking at this review. Believe me, you won't regret it!",
            "review_score": "1"
        },
        {
            "review_text": "There needs to be a third option for 'do you recommend this game?'  Lego Batman 2 introduces a lot of nice new features, like a giant city hubworld to explore that feels a lot like the city from Arkham City, as well as opening up the character roster beyond the batman universe, and many of these characters feel different to play as.  But Lego Batman 2 is still a lego game. A puzzler brawler hybrid that's about a step above a facebook game... and for me that loses it's apeal fast. It's still got some entertainment value... the original story and voice acting actually serve the game quite nicely. But if you've played other lego games and found yourself getting bored, look for this on sale or skip it entirely. After a 10 hour story and 2 hours of just messing around, you may not find yourself anxious to return again.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game been a avid fan of the Batman franchise since i was a wee lad, love the simple roots of the game and a good way to relax. i would give it 4 out of 5 stars beccause the steam version doesn't come with achievements which to me is a big turn off",
            "review_score": "1"
        },
        {
            "review_text": "this game is great lego batman 1,2,3 are soo awesome i like to play it with my pc logitech controller and the voice acting is good also the graphics are great and i can be green lantern and supa mon (superman) i can fly and DIE:D",
            "review_score": "1"
        },
        {
            "review_text": "I had a ton of fun with this game during the story it plays around 10-12 hours story wise, but even after there is still many things to do such as unlock all the characters and achieve all of the gold bricks and red bricks. This game is a ton of fun and could easily get around 20-30 hours of it so its a pretty nice buy for $20 and even better on sale.",
            "review_score": "1"
        },
        {
            "review_text": "this game is one of my favorite if not favorite game that is easy goin and will get you hooked to the point that you will lose track of time i couldent leave because it allways keps you at the edge of your chair my final reviews are that this is a great game and is underated",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good game i would really recomend it to anyone who likes Lego. I give it a 9/10 because the levels are a bit long",
            "review_score": "1"
        },
        {
            "review_text": "Much improved on previous LEGO games; contains very good voice acting, good light hearted atmosphere and even though it's LEGO you still feel awesome flying around as Superman, running fast with The Flash and using Batman's gadgets.",
            "review_score": "1"
        },
        {
            "review_text": "OOOPs Missclicked no this game is seriously epic especially level .... well no spoilers you`ll have to buy it yourself to find out for deffinate ",
            "review_score": "1"
        },
        {
            "review_text": "Game of the century. Have never played something as amazing as this game in my entire life, like since birth. 11/10 across all aspects of this game. Do it. Buy it. LIVE IT. This is the game for you",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun game. Fun gameplay, great sound design and big cast of characters.",
            "review_score": "1"
        },
        {
            "review_text": "OOOPs Missclicked no this game is seriously epic especially level .... well no spoilers you`ll have to buy it yourself to find out for deffinate ",
            "review_score": "1"
        },
        {
            "review_text": "LEGO Batman 2 is a great game, it brings in other DC Super Heroes that one would not normally expect to be in the Batman franchise, these characters include Superman, -- I'll let you find out for yourself, but trust me, it's a great game. Even though it's not the newest edition in the LEGO Batman 2 trilogy, it's still a game worth buying, especially with this snag of a deal! (The deal may be ended by the time you read this review.) LEGO Batman 2 brings a very entertaining campaign with many things to do after completing the campaign. With unique and fun characters to unlock, awesome rewards, and more - LEGO Batman 2 is a game worth purchasing for anybody, despite it's aim towards a younger crowd.",
            "review_score": "1"
        },
        {
            "review_text": "I followed the main quest line with no extra stuff. Awesome game, awesome soundtrack and flying around as Superman as his theme kicks on is the best. I’ve played this and Marvel Super Heroes, these Lego games are fun.",
            "review_score": "1"
        },
        {
            "review_text": "LEGO Batman 2 is a great game, it brings in other DC Super Heroes that one would not normally expect to be in the Batman franchise, these characters include Superman, -- I'll let you find out for yourself, but trust me, it's a great game. Even though it's not the newest edition in the LEGO Batman 2 trilogy, it's still a game worth buying, especially with this snag of a deal! (The deal may be ended by the time you read this review.) LEGO Batman 2 brings a very entertaining campaign with many things to do after completing the campaign. With unique and fun characters to unlock, awesome rewards, and more - LEGO Batman 2 is a game worth purchasing for anybody, despite it's aim towards a younger crowd.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, features the likes of Superman, Wonder Woman, The Green Lantern, and many others. I think it also had Batman, not sure though.",
            "review_score": "1"
        },
        {
            "review_text": "This is the 2nd Lego game I've played, the first being Marvel Super Heroes, and I found this game to be quite enjoyable. I enjoyed this a bit more than the Marvel game but I think a lot of that is because I knew what to expect from it and didn't have as much trouble navigating and using the map to find collectibles. The story portion of the game is short but is pretty fun and light hearted, yet fits in well with the DC and more specifically Batman universe. There are a good number of heroes and villains that you can unlock and play as from both the Batman, Superman and Justice League comics for those familiar with the 2 comics. The only downside to this is that there is not a whole lot reason to use more than a handful of core characters that have abilities that you will find useful quite often. But on the other hand, some characters are basically clones of others in terms of their abilities so you can take your pick of who you'd rather play as.  If you want to just play the story mode, you could probably beat it in 10 hours or less. However there is so much more to do between collectibles and replaying levels in Free Play mode to try and find things that you weren't able to when you played in story mode. Also this is a fun game if you have a kid and want to play local 2 player co-op. I've played this some with my nephew who is 5 and while he's still learning, he can actually do pretty well. I would probably say that it's best suited for kids 7+ but still fun to have something that the 2 of you can play. Overall there is a lot to do and if you plan to get 100% as I did, then be prepared to put in some hours. This seems to be a staple of the Lego games based on the 2 I've played. However, my time played as recorded by Steam is a bit exaggerated due to times when I left the game on pause for long periods of time and times that I played with my nephew on a separate file. However, if you want to go for it all, I'd expect 25-30 hours. The only bad thing about the game is that you can only save your progress at checkpoints during levels and usually when you get collectibles it auto-saves. That's why I had to leave the game on pause for long periods of time a few times because I really had to be somewhere and just didn't have time to get to the next collectible or checkpoint. So just keep that in mind when deciding whether or not to continue playing a level, go for particular collectibles, etc.  Overall, I would definitely recommend this game as something fun for all ages of gamers.",
            "review_score": "1"
        },
        {
            "review_text": "  fun lego videogame, and first one for characters to talk ",
            "review_score": "1"
        },
        {
            "review_text": "The best of Lego Batman titles. Enjoyed open world.",
            "review_score": "1"
        },
        {
            "review_text": "if you are looking for the same lego game experience you should just buy lego batman 3, lego marvel, lego the hobbit, lego the lord of the rings, or lego starwars 3.  the levels are ok but the freeroam and after game stuff is really boring. everything is overpriced, the flying mechanic is horrible, and there is pretty much nothing to in freeroam, not to mention when you end the game you have only unlocked around 7 characters. ",
            "review_score": "-1"
        },
        {
            "review_text": "The camera get's in the way big time. The story is cute, but the camera is so bad. I mean, really, really bad. It feels like it want's to punish you. Seriously.",
            "review_score": "-1"
        },
        {
            "review_text": "Garbage. Not a game for gamers. Pure junk. No mouse? Split screen you can't avoid? I want my money back.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad, it locks up at the first save point. Haven't been able to get past it because of that. I wish I could get my money back because this is a waste of 20 good bucks.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I like this game but I feel like the levels just drag on and on and on. and when you want to have a stopping point there is none....",
            "review_score": "-1"
        }
    ]
}