{
    "app_id": 213650,
    "name": "Dwarfs - F2P",
    "release_date": "2012-10-18",
    "developer": [
        "Power of 2"
    ],
    "publisher": [
        "Tripwire Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual",
        "Free to Play",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Free to Play",
        "Strategy",
        "Casual"
    ],
    "achievements": 29,
    "positive_ratings": 1327,
    "negative_ratings": 225,
    "price": 0.0,
    "description": "Dwarfs!? is an addictive, fast paced arcade-like experience, with plenty of difficulty levels and game modes, in the tradition of great games such as “Lemmings” and “Dwarf Fortress”.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/213650/header.jpg?t=1447355951",
    "minimum_requirements": "OS:Windows XP SP2, Vista, or Windows 7 Processor:1.7+ GHz or better Memory:1 GB RAM Graphics:DirectX®9-compatible DirectX®:9.0 Hard Drive:250 MB HD space",
    "recommended_requirements": "Processor:i7 duel core",
    "reviews": [
        {
            "review_text": "I can say i really dig this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome little game that's suitable for both short and long periods of gaming. Prefer getting the free version to the paid one as I only have to pay to unlock the bits I'd actually use. Word of warning: trying to install this on my Ubuntu partition just didn't work and the devs don't seem to want to fix it. If you want to play this, you pretty much have to have Windows.",
            "review_score": "1"
        },
        {
            "review_text": "This game may be small, but mighty. As this game is only single-player, you can have the peace and tranquility of yourself relaxing. It's a somewhat quiet game, so you can ready your dwarves, level 'em up, and lean back and WATCH THEM GO! I've spent some time playing, and I recommend those who do not mind waiting and patience. But even if you ARE one of those people who need short time, go on 5 minute arcade! This game is very fun and a little addicting, so I guess I would recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, addictive, and quite silly all things considered. Great little game, though the arrows mechanic is a little odd and needs getting used to. Overall, give it a try. It's free, fun and silly. :)",
            "review_score": "1"
        },
        {
            "review_text": "While I do recommend 'Dwarfs!' as a great time waster, I don't recommend it as a serious investment. This kind of game is really for the more casual gamer. I find it to be a great way to relax and take a break from more challenging or competitive games. It is entertaining, but only addictive to a point. Some of the features that you can purchase are more costly that some bargain bin games, but I don't know what they are like.",
            "review_score": "1"
        },
        {
            "review_text": "Its the modarn day version of dungeon keeper without the ♥♥♥♥ing micro transactions ♥♥♥♥ YOU EA",
            "review_score": "1"
        },
        {
            "review_text": "cool game ",
            "review_score": "1"
        },
        {
            "review_text": "Play This Fantastic Game",
            "review_score": "1"
        },
        {
            "review_text": "An awesome game that everyone should play.",
            "review_score": "1"
        },
        {
            "review_text": "I love it AND IT'S FREE TO PLAY i think everyone should take a break and give this game a try seriously give it a try RATING: 100/100 ",
            "review_score": "1"
        },
        {
            "review_text": "Cheesy but fun; and you have to play it to get a dwarf's ax in Killing Floor.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting.",
            "review_score": "1"
        },
        {
            "review_text": "good game for free",
            "review_score": "1"
        },
        {
            "review_text": "Highly recommended! You can trust my judgment because I like legend of zelda!",
            "review_score": "1"
        },
        {
            "review_text": "its a very good game you should buy its fun its fast paced but if you dont pay attention....well everything and i mean EVERYTHING will come down hard on you",
            "review_score": "1"
        },
        {
            "review_text": "i played this game a while ago and liked it i wasnt playing it from steam at the time but now iv found it i will start to play it more and more its soo good",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun and intresting.The only problem with this game is the fact that you have to buy endless mode, but that is not a big deal.But all in all it is a fun time waster so if you want to waste time play this game it is fun.",
            "review_score": "1"
        },
        {
            "review_text": "Dwarfs is one of those games that is a little niche. Control dwarves to mine, and to fight. that's really it. the DLC adds a lot of content, and its good value for money. overall, its worth at least a try. there are no bugs or issues i've found, but if you need something to while away a bit of time then this is your game :)   COMPLETIONISTS NOTE: you'll need to buy the DLC, but its worth it :)",
            "review_score": "1"
        },
        {
            "review_text": "its one game that you can trust plus its free its best to het this than stronghold kingdomes.",
            "review_score": "1"
        },
        {
            "review_text": "Dwarfs is one of those games that is a little niche. Control dwarves to mine, and to fight. that's really it. the DLC adds a lot of content, and its good value for money. overall, its worth at least a try. there are no bugs or issues i've found, but if you need something to while away a bit of time then this is your game :)   COMPLETIONISTS NOTE: you'll need to buy the DLC, but its worth it :)",
            "review_score": "1"
        },
        {
            "review_text": "its an addictive arcade game. it can get a bit tedious at times but still its enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "its a vere good game the graficks are good the game play is good ",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game. Simon from the yogscast voiced the dwaf, what else do you want?",
            "review_score": "1"
        },
        {
            "review_text": "Very fun RTS game, a few things kindof make me mad but overall good.",
            "review_score": "1"
        },
        {
            "review_text": "The Game Is the best mining, stragety, and comedy game on Steam!",
            "review_score": "1"
        },
        {
            "review_text": "Addictive...",
            "review_score": "1"
        },
        {
            "review_text": "Healthy dose of humor and best of all it is free.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game i have played hours of it",
            "review_score": "1"
        },
        {
            "review_text": "I only played to get a KF achievement.  I do however, see how this could be very fun for RTS/tower defense fans. Not my style of game however.",
            "review_score": "1"
        },
        {
            "review_text": "A fun, exciting way to spend hours of time. Keep an eye on your dwarfs or they will cause you problems! Plus HoneyDew (Simon) From the Yogscast voices the tutorial dwarf. Best Game Ever. 10/10 :3",
            "review_score": "1"
        },
        {
            "review_text": "a really good game to play when you are bored with other games :D",
            "review_score": "1"
        },
        {
            "review_text": "very fun casual game. get a big bucket of potato chips a bottle of soda and just go ham for a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "Fun. Gets hectic fast.",
            "review_score": "1"
        },
        {
            "review_text": "Great game even if F2P. quite a challange ",
            "review_score": "1"
        },
        {
            "review_text": "this game is a nice time waster with a fun attitude its simple but fun",
            "review_score": "1"
        },
        {
            "review_text": "I downloaded this because I had an hour to kill before I went to sleep. Next thing I knew, it was 4 hours later and I was yelling at the digger dwarfs every time they hit lava. Overall a very relaxing and casual game, but you can easily become immersed in it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game its a great deal of fun. I even got some high scores at one time. I would spend the money on this game and get the extras.",
            "review_score": "1"
        },
        {
            "review_text": "the world's dumbest AI came to a mining convention.",
            "review_score": "1"
        },
        {
            "review_text": "good game addictive for a while and very fun",
            "review_score": "1"
        },
        {
            "review_text": "pretty good m8",
            "review_score": "1"
        },
        {
            "review_text": "Good Free To Play.",
            "review_score": "1"
        },
        {
            "review_text": "OK... Now I've only just started playing it since it cam out yesterday but I am really enjoying playing this game becasue of how simple the rules of the game is. Just play this game if you want to relax and what a break.",
            "review_score": "1"
        },
        {
            "review_text": "A Quite enjoyable game though you're better off with the full version ",
            "review_score": "1"
        },
        {
            "review_text": "Great little game",
            "review_score": "1"
        },
        {
            "review_text": "A very fun, arcade style game. It's bound to get you frusturated at some point but overall it's very enjoyable. And what's better, it's FREE!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awsome. Like dungeon keeper? then you will like this, too!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and addicting strategy game! YOu have to avoid creatures and defeat them with your warriors and also avoid incoming lava and water to come to ur village! blow up a hole so that it can be trapped there! come join! :3",
            "review_score": "1"
        },
        {
            "review_text": "cool game, takes a few to learn the controls, lots going on",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game becuase it's fun,easy and yet you get to dig as much as you want to unless you prefer games without Dwarfs i say this is the best game i have play since i was 10 and you always get what you want unless there's lava so i say you should download it :D",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game reminiscent of the old games Dungeon Keeper in the new edition.",
            "review_score": "1"
        },
        {
            "review_text": "There is no reson I would not play this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game for killing time, pretty straight forward",
            "review_score": "1"
        },
        {
            "review_text": "very addicting, and the right price too",
            "review_score": "1"
        },
        {
            "review_text": "best game every year",
            "review_score": "1"
        },
        {
            "review_text": "Dwarfs is a really good game and its free",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to pass the time ",
            "review_score": "1"
        },
        {
            "review_text": "This game is really 'cute' i enjoy playing it because i love arcade games,if there is ever going to be a multiplayer i'll definetly play it more",
            "review_score": "1"
        },
        {
            "review_text": "I've logged about 12 hours on this game so far and I've so far only purchased the endless mode DLC, so about twelve games. Maybe more. Dwarfs is a free to play strategy arcade game in which the player takes the place of an omnipotent god/guide/being/etc. The player guides the dwarves that start underground in a cave in an attempt to get a high score by doing things like defeating enemies, digging minerals, and so on.  If you want the short version of this review: If you like strategy, and you want something you can play in the off time, get this game. It's free, it's fun, and perfect for a 'Lunch time game'. If you want to get more out of the game once you buy it, I highly recommend you get the Endless mode DLC. If you want a little bit more in depth, here goes.  VISUAL AESTHETICS:  The game looks very good, and a lot of love and personal style went into creating everything. The dwarves in particular are very adorable to me, and everything oozes with character. Something worth mentioning as well is how well the visuals coincide with the gameplay, in that extra efforts were taken to ensure that the player was not lost or confused at any point, though there are still sometimes where it gets very easy to get lost in the deep caverns. All in all, the game isn't next-gen and people who are even looking at this shouldn't be expecting groundbreaking graphics. It's cute, adorable, varied, and knit together well with the gameplay with a fantastic style.  SOUND AND MUSIC:  There are a few songs on the soundtrack from this game and they're all very relaxing and gives the game a very zen feeling, most of the time (When lava/water/boss fights break out, it's kinda like running out of air in Sonic...) But the music is fantastic otherwise. It's very well paced with the gameplay, and it never feels like it tries to portray something its not, like some games have. The sound effects aren't very special, some fighting, some clattering. I think one aspect that shines though is the voice of the Dwarves themselves, they're very cute and add to the charm of the game. I think if one played this game repeatedly for hours, the music might get tiresome, but it shouldn't if you play it with moderation.  GAMEPLAY:  So, the big one. How does it play? Pretty damn well. The player has a pool of gold to start with, and the Dwarves dig automatically in random and unpredictable directions. Every wall they dig generates a small amount of gold, and can dig up minerals to get more gold. The player can click and drag a line to a destination on a dwarf (or strategically lay it out on his path) and he will follow that line until it ends, digging whatever lies in his wake, but this costs a small amount of gold. This priority makes controlling the dwarves fantastically fun, and easy. Where does the challenge come from? This game is by no stretch of the imagination easy, even on easy mode. The challenges come in three basic forms. Lava, Water, and 'What lurks in the Darkness when you dig too deep.' Basically, every game you initiate will always have caverns inside, their contents being unrevealed until you choose to dig into them. The three things I just mentioned above will literally pour out, and if they flood your starting location, that's game over. But the player is given the tools to dispose of these problems, which cost money from your gold pool, but for this review I won't go in depth on. As your cave gets bigger and bigger, managing these problems gets tougher and tougher. The player needs to make tactical decisions made primarily on luck ('Does that cave have baddies? Or lava? Nonono, ♥♥♥♥ that, seal that ♥♥♥♥.') or split second reactions because their dwarves tunneled into a cavern full of lava and ends up leaking it through a bunch of tunnels.  Every order in the game is given, but no result is immediate, it's similar to Dungeon Keeper or Evil Genius in that regard, combine this with the aspect of you can't liberally pause time like you can in a game like Dwarf Fortress or Crusader Kings II, this becomes extremely difficult, and that's where most of the challenge comes from (You can however speed up time which just helps the game along and increases its user friendly nature!). From there, it gets more difficult when you start unearthing the boss fights, Goblin Shamans, Spider Queens, and the dreaded Lich Lords. With even harder difficulties, and a bunch of scenarios to boot and DLC if you so desire, the gameplay is fun and inviting. In the base game, you can set your timer for as little as five (5) minutes all the way up to sixty (60) minutes. Despite the strategy involved, this makes the game absolutely perfect in terms of time management. You can pop on for a quick 15 minute game and be done before the kettle boils or its time to go to work. All in all the gameplay makes Dwarfs excellent.  AFFORDABILITY:  This game is free. Not much else I should say there. The only thing you should really buy for this if you want a great time is the endless mode DLC, which is 2 bucks. If you want to fully support the devs, every DLC costs 18 dollars in total. It's great, afforable, and fun. If you like strategy games, you have no reason not to install this game, and buy the endless mode DLC.  REPLAYABILITY:  This is arguably Dwarfs strongest suit. I've yet to get tired of this game, I love it and every game is enjoyable and different. For those of you that want high scores for leaderboards and such, that is available to you. I personally don't enjoy them, but the score in this case is still used fantastically to measure your performance, edging you to just give it one more shot, in a fashion similar to tetris. The caves are randomly generated, the scores are limitless, and the Dwarves do not stop. Keep digging on and on, and see how good you can get.  CONS AND CRITIQUE:  This is a great game, but every great game has a flaw or two. My main complaint is with the end game, where you need to be able to bounce between places in a flash, you can navigate to problems pretty easily the first time, but after that you need to remember where they are. I once lost an extremely good run because a Lich Phantom I forgot about destroyed my base. This could've been very easily been remedied with the incorporation of a mini-map. There's also a few minor complaints I had where there's no way to repair the base or the outposts, which I can kinda understand why and these are meant (usually) to be disposable games, but in Endless Mode at least, I felt like that should've been a feature. Those are really my only complaints about this game.  OVERALL:  If you like Dwarves, get this game. If you like Dwarf Fortress, get this game. If you like strategy games, get this game. If you want a game you can play whilst eating a bowl of cereal in the morning get this game. This is definitely one of my favourite arcade style games to have come out in a while, and I encourage anyone who meets the criteria I listed to get this game. And if you don't meet the criteria, I ask that you at least give it a shot. It's a small download, and a 15 minute game certainly wouldn't hurt. The tutorial is user friendly, or you can just dive right in. In five words Dwarfs is:  Arcadey and Amusing Digging Adventures.  Thanks for Reading.",
            "review_score": "1"
        },
        {
            "review_text": "this game is a thinking ,stragy game in a way u must plan carefully on were u want to go next.",
            "review_score": "1"
        },
        {
            "review_text": "If your a Yognaught, like me, this gamesis good for ya :3. This game is just addicting. its 1 of those games, that i like, where you can command your troops to do stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!!!",
            "review_score": "1"
        },
        {
            "review_text": "it's hard to really say why this game is good but sub made a great review on it so check that out",
            "review_score": "1"
        },
        {
            "review_text": "i think that this is a fun yet hard game that anyone can enjoy ",
            "review_score": "1"
        },
        {
            "review_text": "very simple yet addicting game",
            "review_score": "1"
        },
        {
            "review_text": "Good free game it only contains a few game modes but they are all fun its not exactly a game that you would play non stop for a few days more of a game you start up every once in a while but its fun difficult and I enjoy it",
            "review_score": "1"
        },
        {
            "review_text": "A pretty cool game that reminds me of Lemmings. It's free so you should check it out.",
            "review_score": "1"
        },
        {
            "review_text": "A very strange and odd game...I found myself spending much of my day playing this and being content with my creation...I then left for a few minutes and made the mistake of not pausing my game! I come back to witness a wall of water approaching my town hall. Dont leave this game alone or it will punish you! (Also if your not an idiot like me it also helps)",
            "review_score": "1"
        },
        {
            "review_text": "You can unlock an axe in Killing Floor  11/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a really enjoyable, simple but nevertheless fun little arcade-game.  I really recommend this. And it's free! So you have literally no reason not to try it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to pass a little time away",
            "review_score": "1"
        },
        {
            "review_text": "Love this game there is only a problme stupid dwarfs once I cover lava or water they keep digging trough to get to the lava/water...",
            "review_score": "1"
        },
        {
            "review_text": "A nice little hearty game about drunk dwarf miners, their leader, awesome dwarf (Voiced by Simon, Yogscast) leads you through tutorials on how to become a great dwarf leader. With extremely helpful tutorials, fun managment gameplay where danger lurks around every corner, you play as a dwarven overseer on a huge top-down grid where the ammount of miners you have is a double edged sword, more miners? More stress, more stress? More death. You have to lead these little guys around the mines, stopping lava, water, goblin and mining ores to help you mine more ores... It's a very lovely little gem and I highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "nothing to say except its a great game so 8/10 because im too tired to bother with my average long review",
            "review_score": "1"
        },
        {
            "review_text": "Really great game i have played hours of it",
            "review_score": "1"
        },
        {
            "review_text": "A great game that anyone of any age can sink more than several hours in to.",
            "review_score": "1"
        },
        {
            "review_text": "its realy good,",
            "review_score": "1"
        },
        {
            "review_text": "'Dwarfs!?' No, not 'Dwarves!?', 'Dwarfs!?'! This is a nice game for a quite Sunday evening, or if you are looking for a good casual or statagy game.",
            "review_score": "1"
        },
        {
            "review_text": "Simon Lane voices the dwarf. Instant 10/10 (Really though this is quite a fun little game, go ahead and try it out!)",
            "review_score": "1"
        },
        {
            "review_text": "10/10,GREAT GAME,GREAT GAME -Jontron 2014",
            "review_score": "1"
        },
        {
            "review_text": "It's not the best game but i will still recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Guide on how to waste time",
            "review_score": "1"
        },
        {
            "review_text": "Good Free To Play.",
            "review_score": "1"
        },
        {
            "review_text": "FIX THE CRASHING!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "The only reason you should play this game is if you own Killing Floor and want to unlock the Dwarfs?! Axe for the Bezerker class. It is worth playing to unlock the axe, and not much else. There is a reason it is F2P....",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game for people who think fast and act faster. The player does not have complete control over the dwarfs mining; you may guide some of their actions but ultimately you will have too many of them to guide every single one and then they'll dig in whatever direction they want. Your job is to guide them to gems and precious metals and see to it that they don't dig into caves with lava or water, thus flooding the cave and killing all dwarfs. To avoid floods, you have to block or blow holes in the ground. This, however, comes at a cost and thus is one of the reasons to why you have to find gems and precious metals early in the game.  The game's graphics has an old look to them, with a horrendously old-fashioned main menu design, which put me off at first. However, while playing the game the design is not bad and has a more 'retro' feel to it. I rather liked the different maps and tutorials. The game seriously tested my patience, though, and I did not enjoy playing under constant pressure.",
            "review_score": "-1"
        },
        {
            "review_text": "A major annoyance is that using the words 'F2P' is an understatement, this game is techincally not 'F2P' but rather a 'Free-to-play.....in order to get more modes unlock'   'Yo! Dawg, i heard you like Free to play. So we will put pay walls in your free-to-play game in order to unlock the other modes in a Free-to-play game'.  Do i recommend it. No,  Pros: - Dwarves - Dwarves - Dwarves - Achievements  Cons: -Magicial Shooting geysers - Micro-transcation for other modes to be unlock (yes, including the other diffculites because after all they will be after evey inch of your wallet). - Average AI.  - No innovation. A generic arcade game.   5/10  It's a decent game however without the lack of innovation, and 'locking' the other modes and other diffculties through paywalls. It makes this game an almost eye sore. While masking itself as a 'Fun game'",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a nightmare.",
            "review_score": "-1"
        },
        {
            "review_text": "outrageously difficult!",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted the Dwarf ax for Killing Floor so I ended up playing this for just over an hour. Not really worth it IMO, wish I'd just loaded the longest arcade game to get the 40,000 gold required to unlock the achievement and weapon.   As soon as I got in I had to mute everything, the narration and music was a little grating. The tutorials were odd as well, as I maanged to complete a couple of them without even doing anything, think that might need looking at. All in all it doesnt seem like a bad game but it desperately needs a film or some music to go along with it. Now that I have my ax I probably wont play this again.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't even start. Nothing more to say, move along.",
            "review_score": "-1"
        },
        {
            "review_text": "Dwarf Fortress is 100% Free. This costs money for the full game. Get Dwarf Fortress.",
            "review_score": "-1"
        },
        {
            "review_text": "by far worst game i have ever played",
            "review_score": "-1"
        },
        {
            "review_text": "such a ♥♥♥♥ game . never in your whole life play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not good 3 reasons-1) it is pretty much a demo and doesnt bring any fun to it because you have to pay to get the good things-2) like i said it makes you pay to get all the good stuff like skirmish mode-3) its just..like..not fun at all because even though this is ''free to play'' the rest of the game when you buy it is just so boring i do not recomend this game AT ALL! but if you want to be bored out of your mind go ahead and then if you like it ok-but hear my type-THIS-GAME-SUCKS",
            "review_score": "-1"
        },
        {
            "review_text": "Crappy art and lame everything else. Perhaps the paid game modes are better but 'Arcade' is a waste of time. As a Free to Play game, it is worth every penny you'll spend. &gt;:|",
            "review_score": "-1"
        },
        {
            "review_text": "The Dwarfs will brake down walls that are put up to block water or something and will screw your whole game over. Remove that and it would be fun.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't, in my life, ever know a game with such horrible mechanics and A.I. ever. I don't know if that maybe is the point, but if I wanted an experience like this I think I'd babysit my neighbour's braindead kids.  This is more irritating than a challenge. Free or not, it's definitely not worth it.",
            "review_score": "-1"
        }
    ]
}