{
    "app_id": 214170,
    "name": "Divine Divinity",
    "release_date": "2012-07-05",
    "developer": [
        "Larian Studios"
    ],
    "publisher": [
        "Larian Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Fantasy",
        "Isometric"
    ],
    "achievements": 0,
    "positive_ratings": 1432,
    "negative_ratings": 193,
    "price": 4.79,
    "description": "Divine Divinity is an epic role-playing game with hack-and-slash action, offering a huge world to explore and thousands of items to investigate, trade and use.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/214170/header.jpg?t=1447355993",
    "minimum_requirements": "OS: Windows XP                Processor: Pentium IV 1 GHz                Memory: 256 MB RAM                Hard Disk Space: 1.7 GB                                 Video Card: DirectX compatible 3D card                DirectX&reg;: DirectX 9.0c                Sound: DirectX compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Its a Skyrim in 2D, the world its really huge, have thousands of subquests, the steam version you can increase the resolution of the game, very fun, promises many hours of gameplay, a unique game that every RPG lover should try.",
            "review_score": "1"
        },
        {
            "review_text": "Fine old RPG with hours and hours of entertainment. Some bug here and there, but not gamebreaking ones (unless you try to break the game on purpose). Good voiceovers and writing, disappointing skill stock: some skills are plain useless or just broken, which restricts the variety of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Well written, and vivid, characters give an additional spunk to a very good story portrayed in the game. This is complemented by a variaty of side quests, each rewarding in it's own way. Yes, even washing the dishes!  Impact of the class choice is mostly reflected in a special move your character can perform. Other than that, there are no restrictions to learnable skills. This very freedom may be impairing for the newcomers to the genre. Namely, investing in utility skills, very early on, could make the combat tiring and the game less enjoyable. That said, you are highly likely to focus on developing your playstyle during the early part of the game. Once you are confident in your platsyle, you will find yourself exploring the game world and adventuring by your own compass. This, in itself, changes the feel of the game from interesting to compelling.  The music is rather good and helps create an immersive atmosphere. It is a shame that characters with strong local influence are not voiced, for it could have provided the game with an edge. While I did experience a couple of sound effect bugs, restarting the game solved them. I found the graphics satisfactory but couldn't shake the feeling that more could have been invested into visual effects of spells.  Dig through game's local content to find the manual, there is no link from library :(  I earnestly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Save often. Use hotkeys.",
            "review_score": "1"
        },
        {
            "review_text": "Classic Diablo-like game. It sets itself apart by being non-linear, in both game and character progression.  Very recommended, it holds up great.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 Very good  == PROS &amp; CONS ==  + Pros +  + Very good writing, storytelling and overall role-playing dialogues / interactions. + Totally open class-build system that allows you to craft your very own class to suit your play style. + Huge world with tons of secrets and quests. + Challenging enemies, especially during late / endgame areas (On hardest difficulty). + Good variety of weapons, equipments and general loot. + Brilliant mix of real-time and pausable combat. + Above average art direction and graphics. + Great variety of enemies.  - Cons -  - Some abilities are WAY overpowered, to the point you can, with certain combinations, literally insta-kill ANY enemy. - There is no way to Respec your class abilities. - Absence of any weapon / armor / spell crafting, only potion crafting is present and very limited. - Quest rewards are almost always outclassed by random loot in terms of power. - You will have, for most part of the game, the possibility to use a certain item to teleport yourself to a safe area at any time, even during COMBAT.   == Final Thoughts ==  I think this game is a very good old school RPG. You will like it if you liked games like Diablo I and II. Suggested to anyone who is up for a challenging but rewarding adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Divine Divinity is described as a '2D Skyrim' in the advertisement video; however, I honestly think that's selling it a little short. It's a much deeper game with much more customization available and a lot more hidden things to discover. It's an ARPG in the sytles of Diablo but where Diablo focused on gameplay and had a tight/rushable grinding experience Divine Divinity spends much more time in the 'Roleplaying' section of the ARPG namesake. The pace is slower, you can customize your character in much greater ways to build one that's truly unique, and the narrative of the game is more story-centric and focused on taking you through various towns that you can explore that are populated with many different NPCs to interact with. There are a lot of quests and many different hidden secrets and eastereggs to discover, so one of my favorite features is actually allowing you to place a personalized marker on the map to remind yourself of something you'll want to come back to at a later point in time.  I loved exploring the world and interacting with the characters. The game is quite large, so there are several bugs and a few quests that break, but nothing that really detracted from the game for me. Except the framerate. I played the majority of the game on Direct 3D rendering mode and the framerate suffered. Like, really suffered. It's a testament to how much I enjoyed playing Divine Divinity that I continued along when every time poisoin clouds were being rendered or a lot of enemies were onscreen the engine slowed to a crawl. When I switched to the Software renderer at about 50 hours of gametime in the framerate increased dramatically and I no longer experienced slowdowns. It does break video cutscenes and doesn't look as nice but if you're aggravated by the framerate like I was give that a shot and swap back when you need to.  If you like ARPGs and would like to experience a living world around one don't pass on this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "Everything is right in this game.   I got it very cheap in 10/2005 from a gaming magazine and played it a lot. The CD is scratchy now so I bought it on Steam.   * Best fitting game soundtrack I know (you can download it for free) * Easy to understand control * 3 male + 3 female player classes  * Extensive skill system, but not too complex (unlike P&amp;P) * Classic epic storyline with main quests and lots of side quests  * Some humorous elements to lighten up the mood * You can amongst other things steal, sneak, break in, lockpick, perform magic or use brute force * Big open world with many diverse localities and different races, secrets, caves, dungeons... - Due to its age, the Steam overlay won't work, so you can't upload screenshots without using complicated workarounds.   Be prepared to get disorientated at the beginning. It takes a while until you know where you must go. Just enter the darkness, talk to everyone and make use of the saving option.",
            "review_score": "1"
        },
        {
            "review_text": "This game has some of the best music in the entire gaming world-- beautiful, haunting, atmospheric, memorable in a lifetime.   Beneath the old school graphics, the gameplay is excellent, there are interesting skills and vast amount of lore. Your actions and words have consequences. NPCs have personality and top-notch voice acting. This game also contains some super hilarious dialogue.   I believe the game was developed by a rather small team, with many members doing multiple roles. Well, they totally beat some of the larger studios with this incredibly thoughtful game. Bravo guys!  ",
            "review_score": "1"
        },
        {
            "review_text": "The music is beautiful, the gameplay almost flawless, every NPC has something interesting to say and there is a lot of unexpected humor. Truly great game.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR - If you thought Diablo II was too small and needed more freedom in character customization, you'll probably love this game.  Divine Divinity is an isometric action RPG in the style of Diablo but with some unique differences. First off, the world is fairly large, with open areas to explore and an impressive number of side quests to complete. Dungeons are typically expansive as well - the first major dungeon being at least 3 spawling levels with some sub-areas thrown in too. A number of environment pieces can actually be moved (if it has a weight noted, it can be picked up), which allowed for a nice way to hide items/areas without resorting to locked/secret/illusionary entrances all the time.  DD has you choose a class at the start, but you can select spells/skills from anywhere as you progress, allowing you to hybrid to your heart's content. One of DD's strengths is customization - between charms, stats and skills you have a lot of control over how you want to play your character. That said, there are a few skills that are strong enough to warrant including in any build (and a couple that are required later on to finish some quests), which somewhat detracts from the mix-n-match customization as a whole.   One rank each of Repair and Polymorph can let you handle almost anything, and one rank of Pickpocket is needed to pass an initiation test later.    For the most part, the game is non-linear so you can complete and explore as you desire, but you'll find that many locations are way above what you can handle at lower levels. At one point I scoured the countryside killing mobs basically to farm a few levels, which ended up being about 2 nights of gameplay. It was a little annoying that I wasn't working on any major quests at the time, but the map features tons of little interesting areas (most with a small quest/story of their own) which broke up the monotony of level grinding.  There's a fairly large amount of history/lore to back up the main storyline which was adequate and heroic, but I was disappointed with the game's ending (assuming there's only one) as it was a little vague... though I guess that was intentional to allow for sequel potential (which seems to be the case).  Overall Divine Divinity is a solid title in the genre and provides many hours of open-exploration, quest-completing, monster-slaying, loot-obtaining RPG goodness.",
            "review_score": "1"
        },
        {
            "review_text": "My first RPG back then when I was only 10 years old. Now I'm almost 20, and I'm still playing it. It's also (without any of my nostalgic feelings) simply a great game - even today. As long as you don't mind the 2D graphics and the fact that you have to read nearly any dialogues in this game. In Divine Divinity, you play a lost and wounded wanderer, who finds himself in a great battle. A mysterious organisation, named The Black Ring, wants to evoke the Lord of Chaos, an evil and abandonded existence, to surpress the whole country an its population. In fact, the plot is quite exciting and does have many turns. You can visit four great areas and a lot of dungeons as well. You can act very detached from the main quest and spend as much time as you want with side quests or many easter eggs. Also you can feel free to kill almost everyone in the game, as long as you don't mind to be hunted down by the local militia. Fights are turn-based and you are able to pause the game, which is highly recommended in some of the harder fights of the game. Many bosses do have resistances against special kinds of weapons or magic, so you have to be prepared, otherwise, especially in higher difficulties, you will die very often. Every difficulty is possible and the game is, in my opinion well balanced. The graphics are, in fact, not quite good. Even for 2002, there were games with better graphics.  Some of the dialogues are spoken, but you will have to read most of them. The soundtrack is a great piece of art by the russian componist Kirill Pokrovsky. The music perfectly fits with the locations and create an impressive, unique, immersive atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Diablo 2 meets Skyrim. That is Divine Divinity. Worth a playthrough!",
            "review_score": "1"
        },
        {
            "review_text": "A fun little RPG game of the Divinity series, not particular outstanding, but not one of the many boring rpgs out there. You can play as a few different types of characters, warrior, archer, mage, thief, but overall the warrior is vastly superior to the others, easier to play, easier to survive, and in the end he'll have tons of spells and thief abilities anyway. The first 2/3rds of the game is good, the last 1/3 is very rushed and weak so you'll get bored when you start doing the wasteland/ending parts of the game. Plus at that time you usually can kill most mobs in 2 hits so it isn't challenging when you start racking up 3000+ vitality and have all the super armor pieces you need to survive. Plus its pretty easy to cheat in the game with duping/etc so you have to limit yourself from not doing that. Overall, a nice basic rpg thats pretty long, you can get really cheap when its on sale, and will keep your attention for quite a while. A must buy for people who like rpgs, etc.",
            "review_score": "1"
        },
        {
            "review_text": "Divine divinity is the first and i think the best product of Larian studios-the game is almost perfect-quest,monsters,combat is very good,solid graphics(in 2003 very good) and with tremendous playing potencial is this diablo like RPG uch more than blood bath it is one of the best classic RPG games.  Rating: 97%",
            "review_score": "1"
        },
        {
            "review_text": "If you like RPGs and don't mind older games, you'll love this. The voice acting is hilarious to boot. Existential skeletons 10/10 custscene",
            "review_score": "1"
        },
        {
            "review_text": "It’s a great game of its era. Story is good and a fine Isometric RPG. I played this game in 2002 when it was released however stopped playing it after few hours. But it felt great playing it and completing the game in 2016. Recommend to all classic hack and slash fans.",
            "review_score": "1"
        },
        {
            "review_text": "As much as I would love to play this game, it lags as if it is Fallout 4 on max settings. This game is great, just do not get it through Steam.  EDIT: Fixed to the helpful comment I received. It is great now.   'Go to where the game is installed and open the configtool. There you just select software mode instead of 3D something and boom the game runs smooth.'",
            "review_score": "1"
        },
        {
            "review_text": "This game reminds me of what Ultima ONline would be like if it had a single player story mode. The game is so engrossing its amazing. Addicting, serious when it needs to be yet it has its light moments as well. Graphics are good, game play is great and the story is so-so but your playing something like this for the combat and it's right on. I recommend this to anyone that likes RPG games cause this is a good one.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, a really solid and enjoyable game; great world, great story, and lots and lots of quests, secrets, and odds and ends to explore, basically everything that makes an amazing classic RPG. That being said, if you don't like the elements of a classic RPG (slower pace, character building, lots of text, running around and, of course, older graphics), this probably isn't your game, but if you do, get this game right now.  I do have two warnings though. First, the magic system is subpar, or at least the combat spells are. They do little damage, but don't cost too much and cast as quick as you click, so as a mage you just end up spamming your right mouse button until things fall over... consider fighter instead.   Second, the game has a few ridiculously hard bosses. I never actually managed to finish the game as the second-last boss was immune to all my spells, could always blind me (I think it bypasses all resistances), and could insta-kill me and all my maxed-out summoned minions. Getting to a high enough level isn't enough, you pretty much have to be following a guide to stand a chance of finishing, and being forced to min/max really spoils the experience for me.  Still, those are the only things I found wrong. Even at full price, you really can't go wrong with such a gem; just stick with it through the first quest (it'll feel like a bit of a slog at first), make sure you are following some form of guidance for leveling, and you're in for a great time.",
            "review_score": "1"
        },
        {
            "review_text": "Yes! A good RPG. A bunch of quests that are actually different unlike a LOT of RPGs out there. Lots of customization with a good amount of spells and the best part- you actually get to chose what you want. There aren't spells that are linked or locked to the character picked at the beginning. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice RPG game with a nice story and gameplay, soem upgrades are absurdly overpowered.But all you need to do is not pick them : D.",
            "review_score": "1"
        },
        {
            "review_text": "My dead body was somehow able to eat a carrot.  Best game ever 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Story is excellent from year 2002 when it seems game devlopers still had enough time to care to write and program in a good story though the graphics kinda are very dated of that time and do not look good compared to what you will see in a more morden game for example Divine Dvinity: Orginal Sin also the sound gliches some times on windows 8.1 for no appernet reason which i could find as when i reload the game and do the same thing over again it works without any trouble. I am basing the story on the on disc version of this game as i got it on disc some years ago and since the disk is locked onto a single computer i had to buy it again this time on steam though it does have a few issues with newer computers the main example is it runs 200+ fps when on Software render but only at around 32~34 fps when in DirectX3D render with all other settings being unchanged.  It is a good game just run it on max settings for the few graphics settings you get to change and with DirectX3D render and it should all be fine.  I have actually put in a few days into the game but as i cannot migrate files due to DRM protection in steam i have to start over again ... this is my main and probably only complaint about it on steam.",
            "review_score": "1"
        },
        {
            "review_text": "This game is what turned me into a computer nerd, it is amazing.   It has a superb voice acted story that will immerse the **** out of you, a very large skill tree that allows you to progress to suit your play style, and a rewarding loot system similar to diablo. It looks like a Diablo clone but it has much more depth and a longer storyline. Its not expensive just get it.",
            "review_score": "1"
        },
        {
            "review_text": "Dying the entire time because I can't into character building. Terrible voice acting, point and click combat. Limited as ♥♥♥♥ magic, graphics are horrible. Slaughter rabbits for meat and exp farming. Skeletons, everywhere. ♥♥♥♥ bro the game is littered with animated skellingbros.  best game ever made, 10/10 would buy 10 copies of.",
            "review_score": "1"
        },
        {
            "review_text": "I assumed because this was such an old game it would no longer be fun. The game still plays great and story works well. It is a game that requires you to plan out your build before starting or the game will be too hard later on and you will be screwed.",
            "review_score": "1"
        },
        {
            "review_text": "Good ARPG. Takes getting some used to if you didn't grow up playing the classics. Fantastic music, some funny elven voice acting, and a skeleton worrying about existential crisis.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for a few cents but didn't get my moneys woth because the game wont start.",
            "review_score": "-1"
        },
        {
            "review_text": "I was very excited to play this game but I start a normal new game and experience a crash already, sometimes after that it went into the game, but from there the colors were messed up. I have spent a good hour or two searching for fixes, but from my perspective (I have experience in OpenGL and that stuff) in order to release a game on a new age platform like Steam the game should be mostly compatiable with newer systems (Directx 3D halves your framerate when selected and just shows that this game although updated and 'fixed' is not ready to be a full version release).  Wish it worked , but to not be able to even enter the game world makes it a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Laughed and enjoyed the trailer for the game. Bought the game, it’s not exactly like the trailer.",
            "review_score": "-1"
        },
        {
            "review_text": "This game quickly becomes tedious and clunky. I really wanted to like it and at first I found it very fun but eventually the flaws really started to add up. Some of these such as the inconvinient barter system can be attributed to its old age but others have no excuse. The interface is just too inconvenient requring you to go through a slow process just to choose a spell or a potion. In the middle of a battle this slowness really gets in the way and holds the game back. The final nail in the coffin was how tedious the game itself got. Having to run back and forth between towns all the time just to find someone who has the items you need or to complete the missions gets very boring. It's not the worst game ever by any means but I'm disappointed with it.",
            "review_score": "-1"
        },
        {
            "review_text": "A polymorphed almost every boss. Too bad it caused me to be underpowered.",
            "review_score": "-1"
        },
        {
            "review_text": "It could have been one of the best old school RPG, a perfect blend of Ultima and Diablo, but there are three things that ruin completely the game.   First: it could happen to get stuck in the middle of the game because you cannot accomplish a mission, and it's caused by a bug (the famous 'red imps bug')! You can only restart the game and hope that you will not encounter that bug in the future.  Second: the last part of the game is really boring and flat, like the 'Hell' part of the first Diablo.  Third: you will face an enemy that is VERY stressing to fight (Josephine). Why want you to stress yourself that much for a game? And if you don't have the right quantities of potions, and the right skills, you will be just STUCK; not a nice way to present an RPG.  Bugged and sometimes badly designed. It's a pity because everything else is good, good old 2D graphics, nice music (except the monotone 'Hell' background music), nice story(ies), varied locations and characters. A pity.",
            "review_score": "-1"
        },
        {
            "review_text": "May be good game. But why so hard for beginner?",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics seem to be from the last millenia. Sound seems good though. Really good song in the main menu!  Combat seems really stiff. Not at all like Diablo II which this game is strangely compared to. The worst is that when the character is moving the game stutters! Run button also doesn't work....  It sure is oldschool with no modern questmarkers. Having to talk to people and try different alternatives before you get some options (like quests) would probably not happen in a game made after 2010. Inventorysystem is clunky and having to switch from combat mode to unarmed (sheath weapon) feels like 1995 or something!   I only played until I got the mage to thaw his elven friend. Divine Divinity might have been decent back when it was released but today is serves as an example of ancient gamedesign that we have progressed away from.",
            "review_score": "-1"
        },
        {
            "review_text": "I attacked some Dwarven healer's pigs in order to get some supplies and I ended up getting electrocuted to death...   ....This game brings back wave after wave of nostalgia when I spent days and days as a little kid exploring and hacking my way through the world as a mercenary anti-hero. I haven't gotten to playing this game much but this was one of the best and most underrated RPG classics back then. Divine Divinity gives the player the freedom to go about the land of Rivellon however they choose and customize their character however they want. This game was a contender and a survivor seeing how it was able to set the foundations of the Divinity series. If you're into classic RPGs with a good story, flexible customization, a unique sense of humor, and good action then give this game a try; you won't regret it!",
            "review_score": "1"
        },
        {
            "review_text": "A game of my youth, that my mother and father both have copies of, a great RPG, with some good dungeon crawl elements, with such a big open world, and so much to do it guarentees a good long play,  The skill system withen the game can alough for 3 big subtypes of gameplay, and within each subtype whatever the heck you want to play,  'Home is where you put your hay and a teleport pyramid' - Andy Evans, will very much enjoy playing this again.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Diablo, but single player and 100x BETTER! OMG this game is soooooo GOOD ",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of diablo 2 you will really enjoy this game. It has a large open world, many items, and combat like the diablo series. I cant believe I missed this game when it first released!",
            "review_score": "1"
        },
        {
            "review_text": "very deep gameplay. underrated game. a must for RPG fans",
            "review_score": "1"
        },
        {
            "review_text": "I went to a dungeon and saw two skeletons pondering about the logical impossibility of their existence. Upon realizing the absurdity of being able to talk and move without vocal cords or anything to bind them together, they exploded into a pile of bones. They left behind a minor stamina potion. I took the potion.  This game is pretty neat.",
            "review_score": "1"
        },
        {
            "review_text": "WOW! what a hidden gem!  Fans of old 2d RPGs and or hack and slay shouldnt miss this!  ",
            "review_score": "1"
        },
        {
            "review_text": "Can't tell you how many hours I played this game on my windows 98 COMPAQ computer...",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game when I was about 12 years old, and I literally played it until the disk broke and it no longer worked. I haven't been able to find it, but then I saw it.. on Steam! Stayed up three nights in a row and after 40 hours of good, solid, lovely gameplay its finished.   I love its simplicity in style but the extremely high amount of quests.",
            "review_score": "1"
        },
        {
            "review_text": "Elderscrolls-esque classic game that will steal your life, but it is absolutely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Hack 'n' Slay games I've played. It can hold up easily with games like Torchlight or Diablo. One of my little favourites in the gaming scene.",
            "review_score": "1"
        },
        {
            "review_text": "A kick-♥♥♥ old school RPG.",
            "review_score": "1"
        },
        {
            "review_text": "The Diablo III that never was. Divine Divinity is so much like Diablo II that I'm surprised that Blizzard hasn't filed a lawsuit yet. However, being just like Diablo II isn't a bad thing; this game is pure wickedness.",
            "review_score": "1"
        },
        {
            "review_text": "Before I bought this game I was told that it was just like Diablo 2 but with a way better plot line. True. When I watched the trailer for the game it said it was so engrossing that you can't put it down. This is also true. This game has over 50+ hours. True, unless you play it 6 hours a day like I did then false.    If you like action role playing games, ARPG's, then i highly suggest that you pick up this game. The action and story line kick off right in the begining, just remember to save often!",
            "review_score": "1"
        },
        {
            "review_text": "Dont let the admittedly strange title put you off. This RPG from Belgian developer Larian Studios combines the open-endedness of an Elder Scrolls game with combat reminiscent of Diablo II, and does it very well. Very lengthy and challenging.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most badass RPGs ever.",
            "review_score": "1"
        },
        {
            "review_text": "great game if you played diablo 2 or if your a fan of adventure games that actualy take skill to overcome.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, for me it overtakes Diablo by quite a bit",
            "review_score": "1"
        },
        {
            "review_text": "Decent hack n' slash, played through on co-op took about 7h. Boss fights are sometimes challenging at times Overall very enjoyable",
            "review_score": "1"
        },
        {
            "review_text": "Don't let my Steam time fool you, I've done several complete playthroughs, mostly on the Discs I've owned since 2005.  Pros",
            "review_score": "1"
        },
        {
            "review_text": "This is without question the best game I've ever played. I still come back to it after 13 years.",
            "review_score": "1"
        },
        {
            "review_text": "This game is tons of fun. It's made by the same people who made Divinity: Original Sin, and the same sense of humor is in this game. The gameplay is like a cross between Baldur's Gate and Diablo II. There's real time combat with pause, and the skill trees are really a lot of fun. My first playthrough, I went as a summoner, and was able to summon 10 skeletons and a strong knight, and a bunch of rats as well. But you can also play as pure melee, or as a ranger, or any hybrid class you can think of. My advice: invest in the skill that lets you place runes in your equipment. You can easily double your base stats this way. Also, don't invest points in magic, as you can buy magic skill books, and you will have a ton of money as you progress.  If you like ARPGs, quests that can be long and hard to figure out sometimes, a bunch of freedom, and a huge open world to explore and develop your character in any way you can imagine, then this game is for you. It's one of my all-time favorites.",
            "review_score": "1"
        },
        {
            "review_text": "Decent diablo-style rpg, good if you're looking for that kind of gameplay. It's also very open ended and the enemies are not scaled to your level, for better or worse.   Word of Warning for new players: Weapons and Armor have COMPLETELY RANDOM stats. Even the unique set armor and weapons. The stats are decided when you kill a tough enemy or find the item. I'm not talking diablo-style random where it can have a random value added to str or whatnot, I'm talking totally friggin random. You can find a dragon-armor setpiece (best in the game, at least potentially) with literally anywhere from 2-12 mods, all of which vary incredibly. If you want to get the best gear in this game, you will have to save and reload until you find the best roll. Not that I have anything against random rolls, but the game doesn't tell you about this and it is soooo ridiculously random you could reload 50-100 times and never get the same stats twice (and I would know &gt;.&gt;).",
            "review_score": "1"
        },
        {
            "review_text": "take it from me. you need this game. buy it. now....",
            "review_score": "1"
        },
        {
            "review_text": "Incredible old school RPG which I recommend for anyone wanting a good game from the days of old.",
            "review_score": "1"
        }
    ]
}