{
    "app_id": 214590,
    "name": "Fairy Bloom Freesia",
    "release_date": "2012-10-17",
    "developer": [
        "Edelweiss"
    ],
    "publisher": [
        "Nyu Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Anime",
        "Action",
        "Beat 'em up"
    ],
    "achievements": 50,
    "positive_ratings": 882,
    "negative_ratings": 139,
    "price": 5.59,
    "description": "Take control of Freesia as she protects Lita Forest by beating the living daylights out of enemies invading the forest!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/214590/header.jpg?t=1452830657",
    "minimum_requirements": "OS:Windows XP Processor:Pentium4 3.0GHz or better Memory:512 MB RAM Graphics:VGA compatible with DirectX9 or later and Shader Model 2.0 or later DirectX®:9.0 Hard Drive:250 MB HD space Sound:DirectX9(XAudio2) compatible",
    "recommended_requirements": "OS:Windows Vista / 7 Processor:Pentium4 3.0GHz or better Memory:1 GB RAM Graphics:VGA compatible with DirectX9 or later and Shader Model 2.0 or later DirectX®:9.0 Hard Drive:250 MB HD space Sound:DirectX9(XAudio2) compatible",
    "reviews": [
        {
            "review_text": "This game is great. Imagine the endless enemy mode of a Super Smash Bros. game.   Okay, maybe that's not that fun of an experience to think about paying money for but this game shines in the depth of its combat system. Controls are suprisingly similar to Smash Bros. but with lots of room for the customization of your set of 'special' moves.  Fairy Bloom Freesia does have its flaws though, a really short story mode with predictable characters and THE TWO (the big one and the small one) enemies being the most noticable. There are challenging boss fights to mix things up from time to time but also annoying protect-the-big-glowing-orb missions thrown in as filler for a game already lacking in any exciting content.  Overall, this is a game to just lose yourself in. A game to put yourself on auto-pilot to and amaze yourself with 999 combos and juggling for dayz.   Note: A couple of the steam achievements are either translated poorly from japanese or bugged to the point where you can actually get them to count. Another mild annoyance.",
            "review_score": "1"
        },
        {
            "review_text": "Alright, just so you know what you are getting yourself into, I've played way too many fighting games to count, I love combo crazy and challenging beat em ups and hack and slash games such as God Hand, but there's nothing I love more than when a game gives you so much freedom to release the combo cancelling ♥♥♥♥♥ in yourself.  Fairy Bloom Freesia in short is literally like taking: Super Smash Bros or Kirby's simple controls (or Project M turbo mode in general); general things we fighting gamers love in fighting games (cancel combos, parries, etc); Devil May Cry/Bayonetta with its combo craziness of aerial raves, jump cancelling, dodge canceling, air dash cancelling; and then taking God Hand's customization of the moveset and its experimental ways of combos and cancels. Put all these into one, and you get Fairy Bloom Freesia  Similar to God Hand, the story doesn't necessarily take itself to serious as they make jokes to some popular memes and even stereotypes of characters commonly found in games occasionally. There are even some achievements that are callouts to other game franchises such as Devil May Cry like the Aerial Rave achievement. In fact, even most of the design in the game isn't anyhting to crazy in terms of backgrounds and stages because the concentration is all on you having fun and exploiting the gameplay mechanics to your advantage, just the way God Hand did. This game literally wants to have fun with the freedom it gives you to make plenty of dream combos.  The stage design of the game kinda takes a little bit from Smash Bros being a small arena that monsters spawn in with some platforms here and there that you can jump on. While some backgrounds look pretty, you'll notice some repeated objects or just nothing much because the game wants to keep you in the moment of the fight. These stages will be repeated an amount of times, (5 I think), before you fight the boss of the section which can prove challenging if you don't practice up on your just guards, dodges, and cancels (not cancelling out of moves can leave you open sometimes.)  The controls are very simple to grasp and work flawlessly with the game....especially when you cancel them combos. Just don't be afraid to experiment. Moves don't always have to chain into another move, you can chain straight into a dodge if you need to keep yourself from getting attacked.   Rpg elements are included in the game in which you level up getting experience from defeating monster, and also gain mana which can be used to upgrade your normal moveset, gain special moves that can be set to your special attack directions, and passive abilities such as HP boost, berserker (probably super armor), and reducing how much guard crush guage is filled when attacked. Stats also increase with each level up, though, whether the stats gained are random or not, that I cannot confirm.  This is honestly a great game to unwind and relax with especially for fighting game, beat em up, and hack n slash lovers. The freedom of being able to just go wild and make long cancel combos is just a beautiful dream. However, there is one flaw with the game in which the combo meter does not go away after you stop attacking and even if you get hit in the middle of a combo. It lasts about 5 seconds before it actually leaves. This in a way is a flaw but almost seemed necessary to reach the 1000 hit combo achievement for those who can't 'dante must die' the game. It also make its possible to get a pretty high score through less effort for veterans of these games, though, sometimes you'll drop said combo trying to reach a far off enemy. This hardly affects the gameplay otherwise.  If this game is on sale...do not hesitate to buy it. heck, even if it wasn't on sale, the demo would have convinced me to buy it full price. But what really sold me, because I'm Captain Sheepy...is that 'Tetsuzanko' Is a special ability. (Akira Yuki's back strike....Bayonetta?...Yun from Street Fighter 3?....Kyo Kusanagi? Paul Phoenix?...you know, what people call the shoulder charge?)",
            "review_score": "1"
        },
        {
            "review_text": "Fairy Bloom Freesia is an incredible 2D fighting games with very beautiful graphics and extremely fluid motions with easy-to-learn controls. I haven't ever had this much fun button mashing ever since playing Tekken with friends. If there is one thing this game is lacking, it's probably a good story. I mean, the story IS there, but it's just prominent enough. We don't get to know any character very well, besides maybe Freesia, but even then we still don't really know much about her origins. Even so, I still really enjoyed the game. It provided a good challenge, and in my opinion, it really nailed every other aspects of what makes a game fun. Would recommend 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A pure hack and slash 2D platformer. Don't expect any puzzle, any character development, and complicated storyline. Game's also pretty linear, advancing in 'day by day' basis until the end.  For the gameplay: You earn levels and can assign skill points to Freesia to make her stronger and versatile during combat. Character movement and combos aren't as fluid as DmC however, and guarding is a bit irritating as the stance is awkward and you're pretty much locked temporarily in place - a disadvantage if you want to avoid the incoming attacks fast.  That said, it is pretty fun. I hope more Japanese games can come to Steam - a refreshing touch after all western games released here.",
            "review_score": "1"
        },
        {
            "review_text": "(Played with XBOX-controller) A nice under mature 2D 'Bayonetta' with 'Play Station 2'-graphic.",
            "review_score": "1"
        },
        {
            "review_text": "You play as simply the cheerful waifu equivalent of Clint Eastwood in Gran Torino. Except you're an unpaid security guard for a private property owned by an anti-social talking tree. Now a bunch of damn unruly hooligans won't get off your tree dad's private property and you need to get them to leave by serving out some very persuasive asskickings.   Are you the meanest waifu fairy that this forest needs?   Meaner than two fat men wrestling over pork chops and greens? Because that's believable, you know.",
            "review_score": "1"
        },
        {
            "review_text": "Its about time a game like Fairy Bloom Freesia has come across my way. Featuring a endearing loli-esque protagonist to dive into the conglomeration of Beat 'em up games available on Steam, you can only infer by the gallery and thumbnail that you are in for a treat. Should the average player overlook a handful of flaws that were evident already by its kawaii demeanor, Freesia will be one to dazzle.  Did the kawaii tag applied to this game grab your attention? Well, that's because this game exudes moe profusely. Character models, particularly Freesia and Plum-chan, are given a very cute essence to them, which will automatically secure a good 60% percent of the weeaboo consumer-base for this game,   Including myself; I'm a hopeless weeb as well  . Hell, I'd be damned if I didn't give heed to the fact that even the ♥♥♥♥ing golems have a anomalous charm to them, they're just so small and squishy and- getting ahead of myself here. The playing stages are given a seasonal makeover occasionally as the game progresses, keeping the eyes fed when it starts to get boring. In contrast, the enemies never recieve that same variation other than a color palette swap to accomodate to the background in question. Besides that, the game offers something different than the norm we regularly see here on Steam, so the aesthetic direction is something that is has going for it.  With remote intuition from playing fighters of any kind, you can anticipate a sub-par or at least mediocre story. This is where Fairy Bloom Freesia will most likely meet those expectations. The narrative provided here spans across 25 days as you assume control of Freesia, a fairy-figured dollface as you defend Lita Forest and your Master, the omnipotent Jomon Tree from golems (I think that's what they are) and humans who come to the forest under the pretext of taking away the gem encompassing the life of Jomon with orders of fueling an ultimate weapon...or something of the sort. The story here is presented to the player in a style equivilant to that of a visual novel, which may either lead some astray or captivate fans of the genre, which even then will most likely lead to the former. This is due to the fact that the way visual novels play out have the propensity of stressing the specific quriks of characters that make them different from others, and in this case they just so happen to be vapid and once again uninspired. Going under the preconcieved notion that you have not been living under a rock, chances are you have seen the personalities showcased here before. The zealous protag, the pervert, the calm and composed colleague, the eerie weapon of destruction, etc.. You've been there. But nothing will bewilder players more than that ending, which by the way, leaves a ponderous amount of unanswered questions and opportunites that will never come to fruition unless a sequel is in the works, which I doubt there is one if sufficient research was done. I wasn't expecting much from the Story Mode but it for some reason left quite a bit to be desired.  A rather dense and humdrum story, yes, but that doesn't nullify it's ability to entertain the player, as the gameplay is rich with fun. One can argue that Fairy Bloom Freesia is essentially a button masher, which the game is to some degree, but the game also allows for more intricate styles of play. Learning how to manuever properly is going to be players' utmost priority, as later on in the game it becomes impossible to not die instantly without the right 'stepping'. With continuous play of the game, Freesia will transform to a one-loli arsenal as you will unlock an impressive variety of stat boosts and special moves for players to sort as they see fit. Some special attacks are harder to use than others, but the time frame between combo hits is broad, and enemies can collide with eachother, so this grants you the power to land sublime combos nonetheless. It is this metamorphosis of Freesia and the 300+ number displayed on the combo counter that will drive players to stetch through any ordeals they might endure as the game is played. Overall, the game is simple to pick up once you get a knack for the fundamentals, which might bring about a discernable blemish in the game. The game is ♥♥♥♥ easy for it's majority. The average beat 'em up player can feasibly pass Story Mode on Normal in about 2 hours max, and again on Difficult in another 2 since you are provided the ease of preserving your upgrades when you start another new game. Only when you reach Day 70 on Guardian Mode (Which is in essence a Horde/Wave defense mode) or attempt to conquer the story on Cruel will you truly begin to pull your hairs and bargain with the devil. Shynie in general is also another nightmare of boss, the difficulty spike induced by her is unparalleled. Despite the lack of replayability, Fairy Bloom Freesia succeeded to build a solid brawler experience from the foundation up.  FYI: If you can, it would behoove you to play this game with some sort of gamepad (X360, DS3, a ♥♥♥♥ing Nyko for all I care) because the keyboard contols are a tad-bit awkward. It's also adds convienience, no matter what the glut of PC elitists insist.  To reiterate from the intro paragraph, if you are so good as to pardon the shortcomings that mostly stem from the story itself, be ready to have a great amount of fun. Its $8 dollars and well worth that price tag. Combos and lolis. Like come on. I'm getting tired of typing here. I'd recommend it for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Even the story is really short but this game is quite great with its battle animation, good storyline too and mostly its easy to complete this game even play in harder difficultties. But some achievements is bugging Dx",
            "review_score": "1"
        },
        {
            "review_text": "There is a little gril in this game therefore I recommend it .",
            "review_score": "1"
        },
        {
            "review_text": "its that touhou fighting game but in 3d",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game, it's very much worth the low price it is available at during the sales.",
            "review_score": "1"
        },
        {
            "review_text": "*** NOTE THIS IS ONLY A POSITIVE REVIEW FOR A SALE PRICE &lt;$5 ***  Its a cute arena brawler. I made the mistake of not reading it completely and mistaking it for a platformer, but once I got into it, it was fun.   Be warned that the difficulty is pretty unforgiving, but by being so it forces you to think seriously about what upgrades to equip for the specific battle types.  Overall, if you feel like watching a cute anime girl kicking ♥♥♥ in scenic settings, then this will do fine.   NOTE AGAIN: I WOULD ONLY RECOMMEND THIS WHEN ITS ON SALE FOR LESS THAN $5.",
            "review_score": "1"
        },
        {
            "review_text": "Love beat-em-up games? Love anime? Love lolis beating the living crap out of monsters and villains? If you answered yes to those questions, then this game is for you. You won't really find a good story or intriguing characters here, but the combat/gameplay is really satisfyingly fun! Rack up the difficulty and it becomes super intense! If there was more content and an interesting story to this game, it would be a top favourite.   Rating: 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Now I try to unlock all achivements and it's not easy. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "The joy of combat Simplicity brings catharsis Kawaii lolis",
            "review_score": "1"
        },
        {
            "review_text": "what has my life come to",
            "review_score": "1"
        },
        {
            "review_text": "This game is the ♥♥♥♥ing pinnacle of storytelling. The first few seconds after starting a new game we are presented with an unassuming black blob - bothering no-one - just slowly crawling it's way through what appears to be a forest. Then, a few more blobs are shown. Peace and serenity.  Suddenly BOOM.  Another black blob comes flying from beyond the screen and crashes into the first group of blobs! Mayhem! Out of nowhere, a Little Magic Girl(tm) appears, and proceeds to beat them all up! Also, you are that Little Magic Girl(tm) and it is your quest to MURDER ALL BLOBS. BECAUSE REASONS.   In all seriousness, though - it's a fun side-scrolling arena brawler sort of thing, with a bit of customization here and there.",
            "review_score": "1"
        },
        {
            "review_text": "A very aesthetically pleasing arena brawler that offers average speed combat with responsive controls that can compare to AAA fighting games. With its anime theme and its wide array of skills, spells, and buffs, players will suddenly find themselves completing their first play through only to jump back in to unlock what they couldn't do during the first run. The skills reward the player with blur effects, screen shaking, bright lights, and loud percussive explosions and generally feel really good as they're slicing through their targets. With an EXP per kill system that is used to unlock spells, players are tasked with chaining the most absurd amount of combos in an attempt to hit the mother load that never ceases to entertain. The story is very light, however, and can be finished in an hour or two. There are also very few enemies and gameplay may get stale after noticing that monsters in the final levels are the same as the roster from the first. Overall, I recommend this game to any anime enthusiast and brawler battler.",
            "review_score": "1"
        },
        {
            "review_text": "3 things to get the game working before you start: upon play button dont update to 112, then when the game opens choose your language by pressing Z, X is cancel  pressing esc at any time quits the game, so dont be tempted before you save in the intermissions",
            "review_score": "1"
        },
        {
            "review_text": "Really cute fighting game, you should really give it a chance. Its overflowing with moe.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun combo/juggling/chaining-based 2.5D brawler, not the longest story mode ever, but it's reasonably challenging, and it comes with unlockable harder difficulties, a challenge mode with like 4x as many stages as the story mode, and new game+ for both, to transfer over unlocked skills etc, so what I'm saying is, if you like the stuff in the demo then buy it, 'cause it's just more of the same fun that'll last ya a while!",
            "review_score": "1"
        },
        {
            "review_text": "Nice little brawler to pass the time. I recommend playing with a controller. More variety for the monsters would have been nice since right now it's just the same monsters just getting stronger. The boss fights can get tricky if you have a hard time noticing attack patterns. Get the game when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "its fun buy it already",
            "review_score": "1"
        },
        {
            "review_text": "lol, it might seem a cute fairy game, but this fairy's got some fire.  Crazy fighting action game.",
            "review_score": "1"
        },
        {
            "review_text": "short but good game to play between something else",
            "review_score": "1"
        },
        {
            "review_text": "One of the best beat 'em up games I've played. Recommended for combo manics",
            "review_score": "1"
        },
        {
            "review_text": "If you have 5.1+ speakers, turn environment volume to 0% If you have a controller as well as any other special input device, the device you want to use should be installed first. Don't update to 112  I'm on day 8 or 9, idr which... The game itself while a bit glitchy is fun. It's a beat 'em up styled game with a small stage to fight in. Very very cute anime graphics.",
            "review_score": "1"
        },
        {
            "review_text": "A pretty run-of-the-mill 2D arena beat-em'-up. Story isn't much to speak of, controls can be remapped to whatever feels good, has upgrades in between rounds of combat. Every 5 rounds is a boss and a little cutscene to progress the meager story, 25 rounds total. After beating the game, you can replay the story mode at a harder difficulty or with your upgrades kept, or you can play the endless mode. A first-run playthrough on easy mode took me a bit under two hours, and that was because I forgot to equip any upgrades for most of the game and had to continue several times.",
            "review_score": "1"
        },
        {
            "review_text": "Cute game. But it has problems. No Auto-Save. I lost all my progress just by pressing the Esc key. Also Esc just closes the game. Who thought that up? Finally the Easy mode can be challenging. Easy should be EASY. By all means have Easy, Medium, Hard, Very Hard, Ultimate or something like that but don't be silly and say Easy = Easy. Easy should always be Easy. The worst problem is the Esc key. No confirmation, nothing- game just quits.",
            "review_score": "1"
        },
        {
            "review_text": "--------- Gameplay: feel like devil may cry Character: cute girl Music: Japan cute style Art: Just like the screenshots  Total SSS rank   (〃⌒▽⌒)八(〃⌒▽⌒〃)八(⌒▽⌒〃)",
            "review_score": "1"
        },
        {
            "review_text": "This is exactly how Brawl's small-enemies story mode should've played.  It's a pity it's such a low-budget game, even relative to other indie games on Steam. If more dosh had gone its way, this wouldve been a really great game. But as is? I don't think it's worth its price. Which is a pity, because I quite enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "play it with a controller guys it makes ♥♥♥♥ so much easier  super fun game",
            "review_score": "1"
        },
        {
            "review_text": "Although fairly difficult, this game is pretty fun and worthwhile. It may look all cutesy, but all the intense fighting and skills make it a really nice thrill :)",
            "review_score": "1"
        },
        {
            "review_text": "I'm not the biggst advocate of 'Moe' (super Cute styled) anime but this is a great game. Essentailly Guilty Gear styled rush down game with Smash Bros. influence. This is a game that is worth investing in.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, challenging at times too.  ",
            "review_score": "1"
        },
        {
            "review_text": "Very fun. Hours of fairly technical beat-downs on golems, etc. a nice mix of sidescrolling fighter / beat em up, mixed with the fun of rpg level grinding / skill building.  note: use a 360 controller for this. a gamepad is kinda a must for it.   stick in your wishlist, got this on sale myself, but very fun. :)",
            "review_score": "1"
        },
        {
            "review_text": "Ah, so you've found Fairy Bloom Freesia. You may be thinking to yourself: 'This game looks like rubbish! I'm not buying this tub of lard!' Well, you're only thinking that right now. The game is short, but you can play it more than once in a New Game mode with a higher difficulty. The game itself though is already fairly difficult, but it's great fun. The game is seperated into days. Each day you fight a few mobs of monsters throughout the 2.5D beat-em-up forest that you are supposed to protect. Every few days you come across a boss battle until you reach the end of the game. The characters are quite cute in their anime art style; both 3D gameplay and 2D cinematics. Seriously, what kind of anime style anything isn't cute? One thing that bothers me though is the story. While captivating and humorous, I felt as if there could have been more. All-in-all, Fariy Bloom Freesia is probably worth the buy, but you should probably wait for a discounted price.",
            "review_score": "1"
        },
        {
            "review_text": "Remember Half-Life 2, and the early days of Steam? The little joke title 'Codename: Gordon', where you played through 'Half Life' in 2D? Okay, this is that, but for Devil May Cry. Except you're a fairy instead of a tiefling.  It's fun combo-based action combat with little breaks between rounds to upgrade yourself/choose skills/save your game. If this does not appeal to you, I cannot fault you, It's not for everyone. But it's solidly made and gives you quite a bit of replay value if you're into that sort of combo challenge action game  Fat golems are the worst enemies in the game though, holy ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a masochist that enjoys getting their ♥♥♥♥ pushed in on the first boss fight, this is the game for you. It might just be because I'm garbage at the game and playing on normal difficulty...",
            "review_score": "1"
        },
        {
            "review_text": "I used a Gamecube controller for this game. I like it much better for this than the Dualshock or 360 controller.  The good:  It's 7 bucks   Fluid, yet simple combat system  Lots of customization options  Level up system provides boosts in stats as well as any stat boosting skill you have  Pretty backgrounds  The bad:  While the combat is fluid, it's not fluid enough. The dodge move NEEDS it's own button and dashing shouldn't be a double tap on an analog stick, it should be mashing the stick forward instead akin to Smash Bros. (though it might not be as frustrating on a keyboard or d-pad).  Escape closes the game immediately, without providing a warning message.  The first boss is a massive difficulty spike. It needs slightly more telegraphing on it's spinning move, and a longer charge time for the laser.  Just guard must be unlocked and bought.  An overabundance of ranged enemies makes the final are a ♥♥♥♥ing nightmare where a single hit can lock you in a 0 to death combo  Knockback needs be removed or reduced  Also the 1.12 update breaks the game apparently. Nice one Edelweiss.",
            "review_score": "1"
        },
        {
            "review_text": "pretty cute mini game.  it is such easy if you use the defense and small jump skill.  recommanded for those who like fight game.",
            "review_score": "1"
        },
        {
            "review_text": "smashing buttons is fun",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to play if you have a controller! Not that long game but it's still fun",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, it's cute but it's not an JRPG and you do need a controller to play.",
            "review_score": "1"
        },
        {
            "review_text": "main character a qt boss fights are fun",
            "review_score": "1"
        },
        {
            "review_text": "This game was godtier, although the counter move is a bit dumb but still requires some skill to time correctly. It offers some challenging fights such as bosses, and the normal enemies aren't as easy as a normal game would have.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely meaty for the price. Plays a bit like a 2D character action game. Lots of customization and moves woven into a very simple core combat system that feels liquid smooth. Relatively well-translated dialogue in a sparse and simple but intriguing plot.  I'd recommend this for the price it's usually at. If it's on sale, you HAVE to pick it up.  Warning: Normal mode is pretty tough! However, reiteration time is very slight and you keep Mana (used to upgrade skills/stats) you gained in-level even upon death, so it's challenging but very forgiving with a very 'one more try!' feeling. But people who aren't into that kind of challenge shouldn't feel guilty about playing on Easy for their first playthrough!",
            "review_score": "1"
        },
        {
            "review_text": "Literally do-sick-♥♥♥♥ing-combos the game. You can get by with just her dash attack and feel good, but the way the way you can cancel pretty much everything to her backstep really opens up how you can play the game. Probably a little repetitive for most since you're just fighting blobs most of the time, but if you enjoy breaking down game mechanics, this platform beatemup (?? well whatever genre it is) is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why I have this or where it came from. Features a surprisingly complex and rewarding combat system so I can't really complain. Good game, though I don't care for the so called 'story'",
            "review_score": "1"
        },
        {
            "review_text": "Don't even bother with the cutscenes. The horrible story and terrible sprite animations hold absolutely NO candle to the wonderfully addictive combat that has a surprisingly deep combo system. The upgrade system only helps draw you in more. If you are looking for a short burst of intense fun, this is your kind of game. Don't blame me though when you finish the game and start feeling withdrawals.",
            "review_score": "1"
        },
        {
            "review_text": "pros  +good soundtrack  +loli  +good gameplay   cons  - story is simle  -need more lolis  ",
            "review_score": "1"
        },
        {
            "review_text": "Kratos ain't got nothing on Freesia.",
            "review_score": "1"
        },
        {
            "review_text": "quite a fun game not bad for the price the story line was short but it was like a 2d rpg it was fun and quite relaxing with my saitax rumble controller. great way to kill time and to have fun also",
            "review_score": "1"
        },
        {
            "review_text": "Great, charming little beat-em-up with enough action to keep me busy for... about 20 hours (I played the demo first) and offered a pleasant, but not overwhelming, degree of challenge. You could say it's grindy, but it's short, and IMO the amount of grinding you'll need to do doesn't outpace the amount of fun you'll have mastering the system.  The demo left me a little concerned about how well the progression mechanic would work, but once I got the full game, everything fell into place. Not too flexible, not too easy.  The game's fairly self-aware and doesn't take itself too seriously, and the plot isn't anything mind-blowing, but it's still satisfying to fight bigger and bigger enemies, aiming for higher and higher combos. Reminded me of the combat portions of the Devil May Cry series.",
            "review_score": "1"
        },
        {
            "review_text": "a short but very replayable anime-style RPG-ish multi-'world' platform beat-em-up (a lot of qualifers there) about this little fairy girl who hits like a truck and beats the ever living daylights out of little glob monsters to delightful foresty music ",
            "review_score": "1"
        },
        {
            "review_text": "This is the fastest turnaround time I've ever had from trying the demo, to buying the game, to recommending it. Much like the protagonist, Freesia is a short and sweet, :strictly: combat-centric arena beat-em-up (no platforming!). While Story Mode isn't particularly long, Freesia's New Game+ and Survival Mode equivalents offer a surprising amount of replayability for the price. A fantastic game for combo savants and button mashers alike.",
            "review_score": "1"
        },
        {
            "review_text": "From a casual's perspective such as mine, this game comes out as strikingly difficult, yet it's so addictive that you want to challenge it again and again, just so that you can get that tiny little happiness you experience after beating the stage. Very good game.",
            "review_score": "1"
        },
        {
            "review_text": "I really like the game but I can't recommend it because of ♥♥♥♥♥♥♥♥ of errors, crashes and other stuff. You can't just Alt+Tab the game without crash. I hope devs will work on optimizing this.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a buggy, bland, boring game. I 100% suggest staying away from it.          YouTube™ Video:  Game Review: Fairy Bloom Freesia&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Dull brawler with shallow gameplay, unresponsive controls and ugly art style.",
            "review_score": "-1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "Cannot recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Ever play single player Smash Bros with a level 1 AI? It's like that on the smaller levels. Story and music are ...there, maybe you'll enjoy it, but I couldn't get past the gameplay being so boring. This is not a platformer, this is not DMC, this is a beat 'em up in a tiny arena. Too repetitive. Too little there.  For regions outside Japan: you have to click 'no' at the update popup, as the latest update (1.12) is only available for the Japanese version.",
            "review_score": "-1"
        }
    ]
}