{
    "app_id": 214550,
    "name": "Eets Munchies",
    "release_date": "2014-03-11",
    "developer": [
        "Klei Entertainment"
    ],
    "publisher": [
        "Klei Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Casual",
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Indie",
        "Casual",
        "Puzzle"
    ],
    "achievements": 14,
    "positive_ratings": 471,
    "negative_ratings": 122,
    "price": 4.99,
    "description": "A beautiful puzzle game for the whole family!Eets Munchies is a reimagining of the award-winning puzzle game by Klei Entertainment. Featuring gorgeous animation and ridiculous creatures, players help an adorable hungry creature devour cake in increasingly devious puzzles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/214550/header.jpg?t=1477409200",
    "minimum_requirements": "OS: Windows XP/Vista/Windows 7/Windows 8 Processor: 1.7+ GHz or better Memory: 1 GB RAM Graphics: Radeon HD5450 or better; 256 MB or higher DirectX: Version 9.0c Storage: 350 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Eets Munchies is a little puzzle platformer that reminds me with some elements on the ancient 'Incredible Machines' games. It feels just like a ordinary Flash/Director game and has funny slapstick music and movements. If you wonder the first start up - there is no fullscreen. On a full HD resolution you play in a pretty small window. Nevertheless the graphics are cute and original, but sometimes they are distracting you from finding the solution.  Your aim is to place special machines or special food for Eets to lead him to the final cake on a rope. It's a short game but fortunately there is a level editor included. So you'll have lots of new levels in further time ...",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, really fun puzzles. Mystery puzzles were a bit harder than the rest.  Achievements are obtained fairly easily.   9.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "A fun game in which you have to strain the brain",
            "review_score": "1"
        },
        {
            "review_text": "Eets is a game about a little white... whatchamacallit thingy named Eets who is very hungry, and changes his walking behaviour via emotions: Happy, he'll just plod along at a leasurely pace and jump over edges, scared, he'll slowly creep and back away when he comes to an edge, and angry, he'll stomp around at a fast pace and pounce over edges like he's trying to win an olympic event- and you have to use these emotions and a bunch of activatable tools to get Eets to his goal of a nice tasty cake on a rope. While I was a fan of the original Eets Chowdown (in fact, one of the first DLC I ever got on the Xbox 360) I do admit it had some flaws, most glaring of which was the precision of the puzzles combined with how very easy and tempting it was to just go 'Give me the solution', and cheat your way to victory. While Eets Munchies has the same 'Give me the solution' option, I'll be honest- I don't feel as tempted to actually USE it: So far the precision of the items is not as pixel perfect as the original, and those times where you do put something in the wrong place don't feel as frustrating. Another great improvement is the music. Sound effects are replaced with a bunch of notes reminesent of the old Warner Bro's Coyote and Roadrunner cartoons, where Eets foot steps are punctuated by music depending on his mood. Given that Eets is now no longer 3D rendered, and is now 2D animation, this also makes it tons easier to tell what his mood IS exactly (a feature that previously had to be conveyed in a little close-up image of Eets- especially if Eets starts off the level in the air.) Add to that a level editor, and I'd say Eets is now a much better game then it's first outing.",
            "review_score": "1"
        },
        {
            "review_text": "Colorful casual puzzle game, that's not only made to play on your mobile device while you're waiting for something and don't have anything else to do, but also when you are at your PC and you're bored of all the big AAA games. Or if you just like puzzle games, of course.",
            "review_score": "1"
        },
        {
            "review_text": "(Pay no attention to the 'Hours on record'; Got this in a Humble Bundle ages ago with a standalone executable).  It's one of those 'Incredible Machine' type puzzle games. You place objects on the field, then press the 'Go' button to send a thing to a place. The game boils down to trial-and-error, but the game's short enough that it doesn't become boring. The music is peppy, the animations are cute, and a few of the puzzles might surprise you.",
            "review_score": "1"
        },
        {
            "review_text": "Cute and an enjoyable game :)  But the music is a little bit too monotnous... stil it was fun to play :D",
            "review_score": "1"
        },
        {
            "review_text": "Pretty simple iPhone style puzzlegame.  Definitely not worth $7 though.",
            "review_score": "1"
        },
        {
            "review_text": "its a cute game. worth it if you get it for at least 80% off. there are not enough levels and its almost not Challenging. i do agree that this would be a great APP seeing as you can get Better games on your iphone/andriod for less then this game (Even if it was 80% off) i got it from a Humble Bundle a while ago and im happy with that seeing as i didnt have to pay $7 for a game worth maybe $1.50",
            "review_score": "1"
        },
        {
            "review_text": "Once again another nice puzzle game. Games that make you think. Some of the characters in it are kind of adorable I would guess to some people and the music while not earth shatteringly good fits this game. Glad to have played this today and will be recommending it to people I know who need something simple in terms of game play controls to play but still want a challenge and this will give them that.",
            "review_score": "1"
        },
        {
            "review_text": "Fun puzzle game, got in a humble bundle, and originally didn't want to play it, after playing it I couldn't stop. It is having some problems on mac at the moment though, so I've been playing this game on my desktop for the moment. Hopefully that problem will be fixed soon though.",
            "review_score": "1"
        },
        {
            "review_text": "Rating: A beautiful little puzzle game for casual gaming. 8 / 10  Gameplay: You place various items in a 2D jump'n'run like stage to solve a 'puzzle'. The puzzle is basically to get the main character to the final cake, ideally collecting the 3 bonus items. Some of the items will change the mood of the character, and in different moods the character will react in different ways, for example if the character eats a pepper he will get angry and walk faster and jump farther. Another item can make him timid, then he will not jump across gaps and instead turn around.  Graphics: Cuddly graphics look (cel-shading-ish), it suits the gameplay style, in my opinion it looks pretty adorable, should not be taxing for the PC.  Difficulty: I don't think the game is that difficult, in fact the only reason why I would not give it a 10/10 is the 'too easy' part and there are not that many levels to keep you occupied a long time.  Overall: It is a nice cute cuddly puzzling game that you can play in between for short rounds, the levels are relatively easy in my opinion so it may be more suited for younger ages than adults, only thing left to wish for me was more levels. ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game reminding me of Lemmings",
            "review_score": "1"
        },
        {
            "review_text": "Good puzzle game with good physics. the best game to spend leisure time",
            "review_score": "1"
        },
        {
            "review_text": "I don't know how it got into my steam library 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Such a silly little puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "I cant put down this game, It's a fun kid friendly puzzle game that I bought in the Indie Humble Bundle and can be picked up and played by anyone. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun puzzle game, got in a humble bundle, and originally didn't want to play it, after playing it I couldn't stop. It is having some problems on mac at the moment though, so I've been playing this game on my desktop for the moment. Hopefully that problem will be fixed soon though.",
            "review_score": "1"
        },
        {
            "review_text": "Good ♥♥♥♥ mate :D",
            "review_score": "1"
        },
        {
            "review_text": "A really silly and fun puzzle game. Very much reminiscent of the kinda free games that you can play online, but it is deeper and prettier than them, and the price is low enough it's not a big deal.",
            "review_score": "1"
        },
        {
            "review_text": "This game looks really weird but it's actually super adorable, fun, and at times pretty challenging. I totally recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and challenging, kept me entertained for a while plus Workshop stuff is always fun",
            "review_score": "1"
        },
        {
            "review_text": "I understand this game gets 'Very Positive' reviews, but it is clearly not meant for me... I'm afraid I found it 'meh' at best. After a few levels I was already wondering how soon this would end... The game is clearly made for smartphones as it's a rehash of the simple 'get 3 items and reach the exit' idea. In fact, it's probably better on smartphones than on PC, as there's no full screen grfx, and when you do enlarge the window the grfx do look too big.  While just completing a level is pretty easy, however if you are someone who must get every 'pie' before the exit then this game will be quite difficult in the later worlds. Especially so on the challenge levels (aka Mystery Levels) which have no hints and are very different from the previous 'worlds'. I was finally able to complete one of the Mystery Levels after first attempting 5 or so of them.  While the game is fairly polished, it just isn't very exciting or new. It is, however, thankfully short -- I was able to complete all the levels in 2.5 hrs (except the Mystery Levels).  6 out of 10.",
            "review_score": "-1"
        },
        {
            "review_text": "  It's ok, but it's an overpriced mobile game.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont even know where i have this game from but is boring 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "+ Looks like a cartoon/comic + Level editor  - Plays like a mobile game - Very short",
            "review_score": "-1"
        },
        {
            "review_text": "This game was not fun. It feels like educational software.",
            "review_score": "-1"
        },
        {
            "review_text": "How did this even find it's way to becoming a STEAM Game?",
            "review_score": "-1"
        },
        {
            "review_text": "I was in disbelief when I read so many bad criticism to this game, so I gave it a try. I now understand it. This game is completely unpolished. The devs thought it would be a good idea to put the item input BELOW the item so that new players spend 10 minutes figuring out how to grab a ♥♥♥♥ing piece of wood instead of thinking where to put it. The mechanics are wrong, and the puzzles are more volatile than a pregnant woman's hormones. I can't even set the resolution because the game has no options for that.  In conclusion, don't even.",
            "review_score": "-1"
        },
        {
            "review_text": "I was in disbelief when I read so many bad criticism to this game, so I gave it a try. I now understand it. This game is completely unpolished. The devs thought it would be a good idea to put the item input BELOW the item so that new players spend 10 minutes figuring out how to grab a ♥♥♥♥ing piece of wood instead of thinking where to put it. The mechanics are wrong, and the puzzles are more volatile than a pregnant woman's hormones. I can't even set the resolution because the game has no options for that.  In conclusion, don't even.",
            "review_score": "-1"
        }
    ]
}