{
    "app_id": 214630,
    "name": "Call of Duty: Black Ops - Mac Edition",
    "release_date": "2012-09-27",
    "developer": [
        "Aspyr"
    ],
    "publisher": [
        "Aspyr "
    ],
    "platforms": [
        "mac"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Partial Controller Support",
        "Valve Anti-Cheat enabled"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Zombies",
        "Multiplayer"
    ],
    "achievements": 68,
    "positive_ratings": 168,
    "negative_ratings": 105,
    "price": 15.49,
    "description": "Call of Duty®: Black Ops Mac Edition will take you behind enemy lines as a member of an elite special forces unit engaging in covert warfare.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/214630/header.jpg?t=1545235023",
    "minimum_requirements": null,
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "8/10. Pros: -Good MP that isnt hacked or ruined -Best COD campaign of all time (Subtract Modern Warfare trilogy) -Full zombies experience Cons: -MP zombies. Yeah, no. Good luck finding a game. -The cost :( (There used to be an amazon link where you could purchase it for $10, it got removed though. There currently is no solution unfortunately to fix this). Mac cods are expensive :(",
            "review_score": "1"
        },
        {
            "review_text": "I LUV BLAKEPS MEC EDITION ITS FUN PLEYING WIT MY ASPYR FRIENDS SO MANY PEEPUL PLEY THIS GAEM I CAN THINK OF JUST OVER 2 SERVERS THAT PEEPUL ACTUALLY PLEY ON!!!!!1! I WOOD RECUMMEND THIS GAEM TO ANYONE WIT A MEC",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played this game on my Mac for quite a long while now but to Steam, I wanted to say that I find it a very poor service that Black Ops has a PC version and Mac version as seperate purchases. Where as any other game you buy, you get all 3 versions, PC, Mac &amp; Linux, disappointing to say the very least :(",
            "review_score": "-1"
        },
        {
            "review_text": "THis is worse than god damn sonic the god damn hedgehob i wasted some amount of money and i regret the purchase no matter if the price was 30$ or 10 cents. i would go back in time and shoot myself in the face if it meant i wouldnt have to buy this ♥♥♥♥♥♥ game.",
            "review_score": "-1"
        },
        {
            "review_text": "Love it, prestige, prestige and prestige all over again while u one man army through the enemy team! GR8 Fun and multiplayer allows for replayabilty but lots of nooby and complaining players!  Campaign had an interesting storyline and twist, plus zombies is a must play with your friends!  I would r8 it 8/8 kwickscopes M8",
            "review_score": "1"
        },
        {
            "review_text": "i really liked it ",
            "review_score": "1"
        },
        {
            "review_text": "i cant play it on my mac cause it doesnt meet the requirments and it takes two hours to load no joke i have 3 hours on multiplayer and two of those are the main menu or loading screen   worst of all i cant request a refund.. it always gives me the damn msg 'Sorry! We couldn't find the product you specified in our records. You won't be able to create a refund request.'",
            "review_score": "-1"
        },
        {
            "review_text": "I love this game, and can run it suprisingly smooth! I originally had it for PS3 and wanted to do a youtube series on it, so I bought it on my iMac and had loads more fun then on the console. I spend most of my time playing Zombies on it so am defiantly going to buy all the mpa packs! This game delivers exactly what you want, and even more! If you don't have a mac, then buy the PC version because it is so worth it! We could play together if you wanted? Hehe...",
            "review_score": "1"
        },
        {
            "review_text": "Why the hell didnt the porters of this game didnt made it for windows crossplatforms?",
            "review_score": "-1"
        },
        {
            "review_text": "Its great for cod fans. If you have a mac and like cod this game is for you. The only thing thats lacking is zombies no one really playes it",
            "review_score": "1"
        },
        {
            "review_text": "doesn't stop to crash",
            "review_score": "-1"
        },
        {
            "review_text": "I fortunetly got to play this game when it first came out on my xbox and it was amazing. The campaign is awesome (for the most part) and I love the guns in this one, they aren't crazy futuristic guns like in every other COD but they are real cool old guns. The multiplayer is fantastic in its customization and maps as well as the zombies mode which is legendary. With all of this said, I still cannot reccomend this game to anyone. Unless you just want to play multiplayer, then DO NOT BUY THIS GAME. The campaign is so glitchy and most times if you die even once the game freezes and you have to force quit and restart from the beggining, it is so ♥♥♥♥ing annoying. The servers for zombie mode are ♥♥♥♥ing dead as ♥♥♥♥ so you really can only play solo because there still is no private lobbies (WTF?!?). Even the multiplayer servers are pretty much dead with there only being like 2 or 3 servers active and the hosts are constantly changing the rules for playing getting you kicked out for no ♥♥♥♥ing reason. It is so sad to see such an amazing game go down the ♥♥♥♥♥♥♥♥ like this just because the devs have turned a blind eye on it. So as a quick recap, DO NOT BUY THIS GAME unless you ONLY want to play solo zombies or on a (yes I mean 'a' because good luck finding another lobby to play in) faccist ruled server for multiplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible. Dont get it. The graphics are betting in some areas but overall for a mac operating system i expected more. Runs faster, better graphics, etc. I was really let down. It was sluggish, poor graphics, terrible game play cus i couldnt react to anything.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, but not really worth $40. This is actually my favorite CoD believe it or not. Maybe worth it at $20. I recommend getting Rezurection with it, just because Der Riese is amazing. Have a nice day!",
            "review_score": "-1"
        },
        {
            "review_text": "AI sucked so bad,logic is lost",
            "review_score": "-1"
        },
        {
            "review_text": "i r8 8 out of 8 ",
            "review_score": "1"
        },
        {
            "review_text": "its fun to play BUT NOONE PLAYS ZOMBIES if you wanna play zombies add me ill play with you anytime ",
            "review_score": "1"
        },
        {
            "review_text": "not that neat",
            "review_score": "-1"
        },
        {
            "review_text": "i buy it for nostalgia,but wtf u cant play zombie offline!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! WTF",
            "review_score": "-1"
        }
    ]
}