{
    "app_id": 214610,
    "name": "Cherry Tree High Comedy Club",
    "release_date": "2012-11-08",
    "developer": [
        "773"
    ],
    "publisher": [
        "Nyu Media"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Visual Novel",
        "Anime",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 457,
    "negative_ratings": 79,
    "price": 5.59,
    "description": "Guide Mairu through idyllic Cherry Tree Town as she makes new friends and endeavors to persuade them to join her high school comedy club.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/214610/header.jpg?t=1539028121",
    "minimum_requirements": "OS:Windows XP Processor:Pentium 3 or better Memory:128 MB RAM Hard Drive:95 MB HD space",
    "recommended_requirements": "OS:Windows 7 Processor:Pentium 3 or better Memory:128 MB RAM Hard Drive:95 MB HD space",
    "reviews": [
        {
            "review_text": "I made more friends here than in real life.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Persona if you removed everything from it.",
            "review_score": "1"
        },
        {
            "review_text": "this is a cute Non Dating Sim. instead of meeting guys and choosing your 'love' you make friends for your comedy club, i snagged this on sale.   also there is a FREE DEMO OF THIS GAME , so just give it a try. thats what i did and i fell in love with the demo. XD so i gots it!!",
            "review_score": "1"
        },
        {
            "review_text": "Think of those old dating sims - you level up various abilities so you can talk to girls (or boys) better. Except instead of dating, you're trying to get them to join your comedy club. It sounds ridiculous, but it works!  Miley's a hyperactive girl frantically trying to get three more members to join her club. The downside is people here actually read before they sign stuff, so she needs to get really friendly with them before they join up.   The game is freakishly difficult for a dating sim the first time around: unless you have a walkthrough or know exactly what you're doing, you will probably fail. This is not a bad thing. But before you can get New Game+, be prepared to really slog it to just succeed.  What kept me hooked was the writing and translation. The dialogue is hilarious; every character has charm and personality, and there are lots of great zingers during conversations. The translators have done a great job bringing this to a Western audience: think of the Samurai Pizza Cats, and you know the way they tackled this.  Things I would change: skipping cutscene dialogue - there's a LOT of talking, which makes replaying the game tedious - and making it clear that if you use a conversation topic, it's only good once.",
            "review_score": "1"
        },
        {
            "review_text": "Visual novels without the porn part suck more ♥♥♥ than usual. Just an observation on my part. You're welcome.",
            "review_score": "-1"
        },
        {
            "review_text": "Most cutest game ever! Funny graphics, kind and cute characters, interesting storyline. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I'm not saying this is a bad game. It's a decent game if you enjoy those time management games. I personally wouldn't recommend this because the characters feel so shallow. Even though you're recruiting them each of the five cutscenes really give little detail, little conflict in their lives to symphatize, to connect with any of the characters. I literally don't even remember any of their names at this point just because I don;t really care about them. This game has too many flat characters I feel like i can drop any imaginative character in their place and the story will have no change. Basically this is a game with no plot.",
            "review_score": "-1"
        },
        {
            "review_text": "i want to do unspeakable things to the cherry trees",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game! A very nice pixely RPG style anime game, with a very rich plotline to compliment the genre. If you like any RPG anime games such as Corpse Party, I highly reccomend this game. If you play mainly anime fighting games like Street Fighter or Vanguard Princess, and are new to games like this, it might not be the best for you, but you never know! Aside from that it comes with a badge, its own set of cards and a rock bottom price! The jokes in it are easy to get, and can be hilarious at times. I think this game got me laughing about 75% of the time I was playing it! Very Highly Reccomended",
            "review_score": "1"
        },
        {
            "review_text": "You know what, there are games, actual games. And then, there are interactive movies. And this is one of them. Simple and entertaining story, about lasseh who wish to be part of a Comedy buisness, and yous should help her. Somehow this game combines anime style story with a good puzzle gameplay.  I found playing this game is been quite relaxing and fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most intense games I've ever played. Please consult your physician before playing.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥, epic story with an epic comedy XD",
            "review_score": "1"
        },
        {
            "review_text": "Good for fans of the genre. Traditional life sim that manages not to overwhelm you, but still make your choices a tightrope act. The writing is all around pretty good. It plays in a tiny window and has a laughingstock of an options menu. The art is nothing special compared to similar games, but is quite nice.",
            "review_score": "1"
        },
        {
            "review_text": "Wait for a sale.  The only reason I cannot reccoment this game is simply because it is far too short. Lasted me three hours only to reach an ending.  Of course to get to the good ending I should replay it and try to recruit every character, but honestly I can tell that will be an excercise in repetition, since you'd have to re-read the same dialogs again and again. And if you already got an ending, you have completed at least half the characters stories already.  Other than that, it is a solid visual novel of sorts. I just don't find its length justified the full price Steam is asking for it.  If it's 50% off and you like slice-of-life mangas, I'd reccomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm very torn on how to review this game, since quite frankly, I haven't played enough games similar to this to compare it to. So keep that in mind as I try to jumble through my mixed feelings on this game.  For starters, let's start with what the story is about. You are a senior, named Miley. You love comedy. You want to start a comedy club. Jerk president of the student council or whatever says you need 5 members to establish a club. The conflict comes in here. You only have 2 members. Yourself and your best friend/roommate, who never is a big part of the game.  So you, alone, have a month+ (something like 40 days total?) to convince 3 other people to join your club. You accomplish this by getting their 'friend level' up to level 5. They all start out at level 1 when you meet them. There are 6 prospective members you can have join you. You can convince any of them (or none of them) to join your club, through various odds and ends.  One example, and the one I expect most everyone will do on their first (and probably only) run, is the story of a little girl, and her grandfather's candy shop. These stories progress in 5 steps. Step one is the introduction to the character. Step two is the introduction to her story. Step three is the continuation of this story to the point where obvious conflict has arisen. Step four is another continuation of this branch, that usually results in you giving advice, or being helpful to the story's subject. And step five is the conclusion, where the prospective member thanks you for your help in the matter, and then hands you their club signup form, guaranteeing themselves a member of your cult of weirdos.  You need to do this for at least three of the six potential members to 'win'. If you get all six, you get the 'good' ending.   Generally, this is a very easy task requiring absolutely no thought. You wake up in the morning and follow one of two schedules. You have a school schedule, and you have a day off schedule.   On school days, your three blocks of time are as follows... you go to school (and conveniently have most of the characters you wish to recruit in one place, to learn about their likes and dislikes, though this can be uncommon at best), you have a block of time where you can walk around the town and do one special task (whether this is talking to the member you wish to recruit, building your 'skills', or spending time eating and doing absolutely nothing), and then finally go home, and sleep/talk to girlfriends on the phone/make beads for money (which is pretty useless honestly.)  On off days, you do roughly the same thing, except instead of going to school, you get an extra block of the free do whatever you want period.  Now, the game sounded compelling in a way, and I'm a fan of anime-style graphics, so this game caught my eye. I went in with the understanding this game is very short (2 1/2 hours per playthrough at best?) and that the characters aren't to be taken seriously, but this feels like a pretty sloppy piece of work, considering how short the game is.  There are various magazines you can purchase, or movies you can watch with the intent of upgrading your skills... but this is mostly pointless, as I barely touched my skills, and managed to beat the game with 4 of 6 characters recruited into my club. I'm sure the books may play a bigger part when you are trying to broaden your horizons and get all 6... but even then, it's pretty simple to get any character into your club, given the stereotypical nature of all the characters (the ones who look like they like sports like sports, and the ones who like smart stuff like smart stuff).  By far the most interesting character in the game is the punk rock girl, Cindy, and her story is so short, that I feel unsatisfied. This is in contrast to Sara's story, which feels long and drawn out, and less interesting.  I don't know, this is more of a synopsis on gameplay than a real review, so I may as well leave my final verdict here. The game is fun for about all of 20 minutes before the repetitive nature gets to you, and you lose interest in the story or what happens to the club. Should you manage to complete the game, (which isn't hard, the game is laughably easy) you can go into a NG+ mode I haven't touched yet (and don't plan to touch.)  When a game offers me more content like that, and I say, 'no thank you', it generally doesn't bode well for the overall replayabillity of the game. Unless the characters interests change, and the game gets harder (which I doubt on both accounts) I don't think I'll give this game another look.  If you really must try it, get it during a Summer/Winter Sale when it is wicked cheap, and not at the current price. Paying full price will lead to massive disappointment for all.",
            "review_score": "-1"
        },
        {
            "review_text": "Good for fans of the genre. Traditional life sim that manages not to overwhelm you, but still make your choices a tightrope act. The writing is all around pretty good. It plays in a tiny window and has a laughingstock of an options menu. The art is nothing special compared to similar games, but is quite nice.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: 1. Great visuals for a visual novel game. High about my expectations. I love the pixel art and the way the visual elements blend together. 2. Some of the stats have fun titles, and there are a lot of well placed jokes throughout the game.  Cons: 1. No noticeable save system. I ended up quitting out of the game and lost all my progress. 2. Dialogue gets a little too drawn out. I feel like the writing could be better, which is a major flaw considering the game's focus on the story above anything else. 3. Controls are keyboard-based and the game does not support mouse clicks. This isn't a big deal, I guess, but I would have liked to use my mouse to navigate the start screen and menus at least. Maybe I'm spoiled by Flash games?",
            "review_score": "-1"
        },
        {
            "review_text": "goty 2012 what else is there to say great graphics great plot a must play for every hardcore gamer 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Social Links: The Game",
            "review_score": "1"
        },
        {
            "review_text": "high school student miley wants to start a comedy club, but she needs 5 members to make it happen! Run around the town of Cherry Tree, make friends, do a part-time job, and study  the goal of the game is to recruit 3 other members to form her club, by building up your relationships with other characters and improving your own skills in the process. time passes whenever you do certain things so you need to plan accordingly and get all the members need before the deadline!!",
            "review_score": "1"
        },
        {
            "review_text": "once you get used to how the game works (which is probably after about a half a playthrough), it becomes chill as chill can be. the sprites and music just relax me to no end.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a sweet story (albeit somewhat typical) of a girl with the goal to recruit friends for her comedy club. The art is simple ( I love the sprites as you walk around), and the game-play is rather easy to grasp (only took three playthroughs to find everything). Plus it is completely ero-free (no romances, no nudity), so it is great for the kiddies.",
            "review_score": "1"
        },
        {
            "review_text": "Cute, humorous game that's has elements of a VN crossed with an RPG/Princess Maker game. Basically you work to gain money, use said money to build on conversation peices (stats), and use that to raise relationship levels with the girls. Get said levels high enough they'll join your club. Ending depends upon how many of them you end up geting to join by the time limit, it is possible to get them all, if you play it right.",
            "review_score": "1"
        },
        {
            "review_text": "I played about 20 minutes of this game and I can say its quickly becoming one of my favorites on Steam. Its just like Persona without all the fighting. I would definitally pick this up if your looking for a casual game to pass the time by, and enjoy some funny jokes while your at it.",
            "review_score": "1"
        },
        {
            "review_text": "I personally liked this game very much! It's pretty easy and kinda short, but it does have some challenge. I wasn't able to get all the six to join so I have to play the game again. Really fun game though the decisions didn't really do anything and skills were pretty useless too. Atmosphere in this game is something really nice and heart-warming and the art is wonderful too.",
            "review_score": "1"
        },
        {
            "review_text": "Hard to find It on the trading market, but still a wonderful game. I recommend It If your debating on getting It.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Persona but without all that pesky dungeon crawling.",
            "review_score": "1"
        },
        {
            "review_text": "Cherry Tree High Comedy Club is an almost 'dating sim' kind of game, as such its target audience, especially in the way this one is written seems to be women/girls. I however can't fault it for that, and what it does offer in my opinion is some quality gameplay for that genre combined with great dialogue and a decent size city to explore. My grievances are the limited and random statements made by characters, often causing them to repeat the same thing throughout intervals and the somewhat grindy nature of some conversations, provided no in game events are occuring (needed more in my opinion in this regard to detract from the basic gameplay). All in all it is a game of good value if you like the genre, that does even despite these listed flaws keep itself interesting through humor and the odd friendship/life lesson.",
            "review_score": "1"
        },
        {
            "review_text": "It's worth a look....barely. It's like Persona's social links made into a game of their own.",
            "review_score": "1"
        },
        {
            "review_text": "recommended only for true gangsters if you haven't committed a felony yet, this game might be a little too heavy for you",
            "review_score": "1"
        },
        {
            "review_text": "  Best way that i can describe the game   [weknowgifs.com]     So here is a recipe for Cookies with Jam",
            "review_score": "1"
        },
        {
            "review_text": "Ok,.. I was a little drunk when I purchased this game. That's on me.",
            "review_score": "-1"
        },
        {
            "review_text": "Cherry Tree High Comedy Club = One of the worst games i have ever played     As far as dating mechanics and characters goes. Before you start throwing out the you just suck line check my profile i have only had one or two bad routes and those were like my first two routes ever played on any vn. I'm a quick learner but i also quickly learned that on this game picking the right dialogue option wasn't good enough. Oh no not for CTHCC. You have to have pick the right dialogue option and completing the minigames. I don't care if you're pick the best route.  I finished all the minigames in a night and then go to bed then game over!! This is worse than katawa shoujo and go go nippon put together i kid you not. I have also learned that even when im clearly picking the wrong option i have a better shot at finishing th e route if don't say anything at all.  I'm sorry but this game is utter trash. The only thing it has going for it is the fact its a vn. Take that away and this would be the worst game EVERRRR",
            "review_score": "-1"
        },
        {
            "review_text": "Persona 5 has a lot to live up to...",
            "review_score": "1"
        },
        {
            "review_text": "A fun little game, something of a light hearted time management sim. The characters are fun and likable. However note that this game is very short and can be completed in just a few hours. There is some limited replay value to try and get all the characters as your friends but nothing much besides that. The time management aspect is also pretty simple. I personally would have liked more things to do and more impact from how you spent your time. But overall, i would say i found my time playing this game to be amusing and enjoyable enough.",
            "review_score": "1"
        },
        {
            "review_text": "It was a pretty fun game, but sometimes it got a bit repetitive so I don't recommend playing it completely in one go.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like low budget Japan culture styled stories, then this game is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Almost all the plot and character development is back-loaded until hours in, after you figure out the game mechanics. Either play this game until the end, or don't play it at all.",
            "review_score": "1"
        },
        {
            "review_text": "A severely under-appreciated game, with great writing and characters (even if they are all stereotypes). Amazing art and music, but severly lacking in gameplay. The gameplay is quite monogomous and repetitive, but the story and writing drastically make up for it. Come for story &amp; characters, and you'll stay for it. Plus, it has different endings~!",
            "review_score": "1"
        },
        {
            "review_text": "Cherry Tree High Comedy Club is a nice change tone compare to other games and offers something creative with colourful theme.The music was upbeat and rocking, the dialogue was funny like manga, and the characters were colorful and likable.the game also features multiple endings by how many people you convince in the end of the game to join the Comedy Club. The only issue I had with the game was the length in story that possible to finish in 3 - 4 hrs, however Cherry Tree High Comedy Club is fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "My expectations were set too high by Persona. Even so, not really worth the time. Are dialogue options too much to ask?  Still characters were cute enough, and it was a surprisingly memorable experience for what it was.",
            "review_score": "1"
        },
        {
            "review_text": "Very cute little game. That's all I have to say.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "A very cute but very short game. Its similar to a dating sim, as you need to improve stats and sway people over to your side. Theres not very much to say about it, as its a very simple concept with a very simple execution. The music can be a bit repetitive at times, and you really have no need to work for money at all. I was able to sway over 4/6 people to my comedy club in my first run, easily achieving 6/6 on the second. While enjoyable, its only about a 6/10: Its enjoyable and cheerful characters pushing above average.",
            "review_score": "1"
        },
        {
            "review_text": "If you like low budget Japan culture styled stories, then this game is for you!",
            "review_score": "1"
        },
        {
            "review_text": "It's like playing GitS: SAC as The Laughing Man! Laugh, and the World Laughs with you.   However, I'm disappointed at what appears to be excessive localization... EDIT: A year later, holy ♥♥♥♥ an actual 'De-Westernized' English version has been produced and released. A fantastic precedent.",
            "review_score": "1"
        },
        {
            "review_text": "Cherry Tree High Comedy Club is what I would consider a time-management visual novel. You manage a limited amount of time/actions to improve your skills and then use those skills to overcome challenges. It is a good time for the short game/novel it is. About 3-4 hours of unique content with a second playthrough pretty much needed to see the stories of the all characters. After seeing the content however, the game loses all replay value. Nothing random happens and the majority of the events have maybe 1-2 versions depending on your progress at that point in the game. I would recommend to pick it up on sale if you have interest in these types visual novels. However, it won't convince anyone to be a fan of the genre. Keep in mind there is a new game+ that allows you to carry over your stats if you 'beat' the game to allow easier recruitment on future plays.  Note: I played the non-westernized version.  Pros: +Decent characters - I liked them. They were trope heavy, but they were well written and I enjoyed the banter. +Great Art - I really do enjoy the art-style of the game. Between the pixel art characters and the cartoony overworld, you will be enjoying the colorful town.  Meh: ~Short - Common for this genre, but depending on your reading speed it is easy to finish the first time in 2.5-3.5hrs. I completed the game 3 times in my 5.5hrs and saw everything this game has to offer. ~Music - Nothing wrong, nothing noteworthy.  Cons: -No dialogue skip - Most visual novels have the ability to skip over text you have already read, if you plan on playing 2-3 times to either see the other characters or recruit all 6 this feature is sorely missing. -Poor graphics options - Full screen stretches and the default resolution is pitiful. Would benefit from either bars on full screen or the ability to scale the game window. -Short - Common for this genre, but depending on your reading speed it is easy to finish the first time in 2.5-3.5hrs. I completed the game 3 times in my 5.5hrs and saw everything this game has to offer.  TL;DR - Short time-management visual novel, but worth picking up on sale.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little distraction that's part visual novel, part sim game, and all charm. It's short but still really enjoyable, as I had no problem starting on my second playthrough to complete the game immediately after finishing my first one. If you're a fan of visual novels and an anime/manga-type art style, give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "The characters were all quite charming and interesting, well written, with interesting backstories that you learn about as you advance. It was never boring and I wish it was longer. It has hardly any cutscenes and is made in kind of a minimalist way (it's not Tokemeki Memorial), but it's perfect.",
            "review_score": "1"
        }
    ]
}