{
    "app_id": 214770,
    "name": "Guacamelee! Gold Edition",
    "release_date": "2013-08-08",
    "developer": [
        "DrinkBox Studios"
    ],
    "publisher": [
        "DrinkBox Studios"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Metroidvania",
        "Platformer",
        "Action"
    ],
    "achievements": 60,
    "positive_ratings": 4881,
    "negative_ratings": 338,
    "price": 9.99,
    "description": "Guacamelee! Gold Edition is a Metroidvania-style action-platformer set in a magical Mexican-inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/214770/header.jpg?t=1544283359",
    "minimum_requirements": "OS: Windows 7, 8, XP, 2000 and Vista Processor: 2 Ghz+ Memory: 512 MB RAM Graphics: Shader Model 3.0, 256 MB VRAM DirectX: Version 9.0c Storage: 800 MB available space Additional Notes: Supports Xbox 360 Controller and other XInput-compatible controllers",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Guacamelee is a really fun Metroid-like platformer with an equipment system similar to Zelda where you earn melee abilities that help you progress through the game. The story is pretty typical 'hero saving the day' type stuff but its not too heavy so it really doesn't get in the way of enjoying the action of playing. The fighting system is the highlight of this game, and is really intuitive and has a wide set of tools once you start upgrading his/her abilities. Anyone can pick up a controller and join your game at anytime which is really cool, they can also work on upgrading their character as well. The art style in combination with the fiesta style music feels really lively and compelling and is really what helps set this game apart from others like it. The game switches between the real world and an underworld occasionally and that adds some aesthetic complexity. I haven't beat it yet but so far its pretty cool and living up to my expectations, 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot more to wish from indy hit  Guacamelee  but one thing the game does right, one thing from which all other game companies should learn, one thing so important that it got me to start writing video game reviews on a hopefully weekly basis, and that's GAME DIFFICULTY.  Game Difficulty is not an excuse to make players redo the whole stage over and over again because you missed a jump. 'Difficult' is not adding HP or extra damage to monsters. I swear there are still too many punishing mechanics masked as challenge curves such as forcing the player to wait or rushing to reclaim everything that you've earned in a previous playthrough. 'Difficult' makes the player think and plan. 'Difficult' should challenge the game developer as much as it challenges the player.   Guacamelee  is difficult, especially if you want the true ending, but it's not punishing. I miss a jump, I go back to the last platform, I try again. THIS IS HOW IT SHOULD BE. THIS IS WHAT EARNS THIS GAME THE THUMBS UP FROM THIS REVIEWER. I never felt like I was wasting any time playing Guacamelee. There's variety in the platforming challenges, introduced by incorporating the special moves that you discover as tools to broaden movement. The Rooster Uppercut introduces double, then triple jumps. The Dashing Derpderp (bad name, I know), brings a horizontal dash and so forth... There's no resource management to worry about (and that's including health management), you just have the platform challenge in its purest form.  I'm old. Thirty-five years old. I've played the old NES platformers.  There is absolutely nothing good to remember from any of these games.  None. I'm gushing because I remember ♥♥♥♥♥♥♥ Castlevania, ♥♥♥♥♥♥♥ Ninja Turtles and ♥♥♥♥♥♥♥ Megaman and  Guacamalee  ISN'T LIKE THAT. Thank goodness. By the way, that's why every review of Shovel Knight has made me wary of it. Briefly considered it, considered the hype, remembered the old days and went NUH-UH.  Ironically, the hard mode of this game is a complete wash. Just more damage from the monsters and more hits required to kill 'em. Kinda breaks the whole point of my review but I really wanted to laud everything else about this game.  It really does seem like a fun challenging platformer with monsters thrown in because of course you need monsters to smash. A whole combo tutorial camp and none of its lessons are ever necessary. A game built around luchadors and then you have this weak ♥♥♥ combat system. It's kind of a bait-and-switch in that regard: the moves you unlock seem to have a platforming purpose first and an enemy bashing purpose second... Artificial purpose at that, what with the introduction of colored shields to force you to use the appropriately colored attack. That's a juvenile way to handle combat. Boss fights centered on pattern recognition? Yes, that is a hallmark from the platformers of old but that doesn't mean you couldn't add some innovation on it.  I ain't mad, and this is coming from a huge wrestling fan who bought the game because he wanted to play a luchador protagonist. The rest of the game made it worth it.",
            "review_score": "1"
        },
        {
            "review_text": " This is an amazing game. It has platforming, fighting, ability progression, all very well made. Its Metascore is well deserved.   I hate fighting games, and the platforming aspect of  Guacamelee!  is not shown well in the videos and screenshots, so I had very low expectations for it. Aaaaand it's one of my favorite games now. So if you think it's kinda cool, get it and you will not be disappointed. Make sure to give it some time, because the beginning is indeed underwhelming.  If you're still hesitating, a description of the gameplay follows. Contains minor gameplay spoilers (like revealing what abilities await you before you unlock them).  In  Guacamelee!  you unlock various abilities as you progress. But there aren't separate 'fighting abilities' and 'movement abilities', because they're the same thing! At first you get an 'uppercut' ability, which is also a poor-man's double jump. Later you get wall-jumping, dashes, smashes, etc. and eventually the actual double jump, and more yet. All these things are very pleasant to apply in combination to reach more and more places and solve (mostly optional) difficult platforming challenges.  The parts where you kill enemies are also a lot of fun. You can do combos... throw enemies into the air, punch the ♥♥♥♥ out of them, dash to the other side, punch some more, slam them down... that's one example. In many games where you kill things I don't see the point in blocking or using different combos, because usually mashing one button and eventually doing that one overpowered combination will do. Here, though, dodging is something you do a lot. You need to block other enemies' attacks while you're dealing with one or a few of them. It's intuitive and accompanied with nice subtle visual effects. It's fun to anticipate enemies' attacks and dodge projectiles just in time. And of course, different enemies need different strategies. Some of them have colored shields, which require you to use a particular special attack on them first. This doesn't sound that exciting but it really adds a lot to the game in combination with other small things.  There are many characters/costumes with different stats and traits that suit different situations and playstyles.  Local co-op multiplayer... that's very nice probably. But I haven't tried it.  Difficulty... Yes,  Guacamelee!  is quite difficult, although most of the difficult parts are optional, as I already said. If you have some experience with platformers, you will feel right at home: the game won't be very hard, but will still feel rewarding.  Controls are nice. You can do a ton of things with relatively few keys. Keyboard is redefinable. But I played with a controller. Buttons are not redefinable, but the controller support seems very, very good, because my very old noname controller worked perfectly, while most games mirror the 4 buttons on it...  The duration of the first playthrough can vary wildly, depending on your pace and completion rate... let's say 6-14 hours. To get all achievements you may need 15-22 hours. All achievements are fun to get, not grindy and not missable, but some of them may be too hard for the average player.  If you don't like the theme of the game, don't worry, at first I wasn't too fond of it either. But you get used to it and it's quite nice. And if you don't like the main character, you can change it almost right away...  ★★★★★★★★★★",
            "review_score": "1"
        },
        {
            "review_text": " This is an amazing game. It has platforming, fighting, ability progression, all very well made. Its Metascore is well deserved.   I hate fighting games, and the platforming aspect of  Guacamelee!  is not shown well in the videos and screenshots, so I had very low expectations for it. Aaaaand it's one of my favorite games now. So if you think it's kinda cool, get it and you will not be disappointed. Make sure to give it some time, because the beginning is indeed underwhelming.  If you're still hesitating, a description of the gameplay follows. Contains minor gameplay spoilers (like revealing what abilities await you before you unlock them).  In  Guacamelee!  you unlock various abilities as you progress. But there aren't separate 'fighting abilities' and 'movement abilities', because they're the same thing! At first you get an 'uppercut' ability, which is also a poor-man's double jump. Later you get wall-jumping, dashes, smashes, etc. and eventually the actual double jump, and more yet. All these things are very pleasant to apply in combination to reach more and more places and solve (mostly optional) difficult platforming challenges.  The parts where you kill enemies are also a lot of fun. You can do combos... throw enemies into the air, punch the ♥♥♥♥ out of them, dash to the other side, punch some more, slam them down... that's one example. In many games where you kill things I don't see the point in blocking or using different combos, because usually mashing one button and eventually doing that one overpowered combination will do. Here, though, dodging is something you do a lot. You need to block other enemies' attacks while you're dealing with one or a few of them. It's intuitive and accompanied with nice subtle visual effects. It's fun to anticipate enemies' attacks and dodge projectiles just in time. And of course, different enemies need different strategies. Some of them have colored shields, which require you to use a particular special attack on them first. This doesn't sound that exciting but it really adds a lot to the game in combination with other small things.  There are many characters/costumes with different stats and traits that suit different situations and playstyles.  Local co-op multiplayer... that's very nice probably. But I haven't tried it.  Difficulty... Yes,  Guacamelee!  is quite difficult, although most of the difficult parts are optional, as I already said. If you have some experience with platformers, you will feel right at home: the game won't be very hard, but will still feel rewarding.  Controls are nice. You can do a ton of things with relatively few keys. Keyboard is redefinable. But I played with a controller. Buttons are not redefinable, but the controller support seems very, very good, because my very old noname controller worked perfectly, while most games mirror the 4 buttons on it...  The duration of the first playthrough can vary wildly, depending on your pace and completion rate... let's say 6-14 hours. To get all achievements you may need 15-22 hours. All achievements are fun to get, not grindy and not missable, but some of them may be too hard for the average player.  If you don't like the theme of the game, don't worry, at first I wasn't too fond of it either. But you get used to it and it's quite nice. And if you don't like the main character, you can change it almost right away...  ★★★★★★★★★★",
            "review_score": "1"
        },
        {
            "review_text": "A rare two player platformer that feels like a blast from the past. A fun game that you can play with the family.  8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee! is a really good platformer with a metroidvania style set in a world inspired by Mexican culture. This game is filled with comedy, and tons of references to other games, which add to the overall fun.  The gameplay is excellent, as a 'Luchador' you make your way through punching: punching enemies, punching walls, punching chickens... As you progress, you get new abilities, which allow you to access new areas, by way of more, diverse ways of punching. There's also an ability that allows you to change between the world of the living and the world of the dead, and it's an interesting mechanics, as there will be sections where you find travelling back and forth between the worlds.  The environments themselves are really good: the world of the living is colourful, while the world of the dead has a darker tone.  The story is somewhat simple, but even then, it manages to be great. It starts with a normal man living a normal life, but, during the preparations for the 'Día de los Muertos' festival, a powerful being raises from the world of the dead, and our hero must put on the Luchador mask, in order to save the day.  I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I found this game to be somewhat adicting. It does have that metroid type gameing feel and play.  Music is catchy and upbeat. I didn't find any slow spots, the music and badies kept things going at a smoth and steady pace.  The graphics are cool and entertaining and offer graphical delight to the game.  I picked this gem up during the Canada Day sale (I didn't realize this was a Canadian Indie game) and I have happy with the purchase.  Guacamelaa is worth a play.",
            "review_score": "1"
        },
        {
            "review_text": "Great game all around. Pleasing Visuals, enjoyable audio, slick gameplay and (cliche?) story from the unique perspective of a Luchador.   Gameplay is pretty fun. Knocking one enemy into another will force them off their feet (provided no shield), which often makes many fights trivial if you juggle the enemies into each other, giving you reasonably large intervals (for a 2D fighter), where no attacks are coming your way. An enemy who has been knocked down can be supplexed across the screen, essentially every enemy is a projectile used to knock down other enemies, combining this mechanic with juggling makes you feel like a true deity though the resulting gameplay presents little threat.  Unlocking new skills throughout the course of the game is done in a Metroidvania-esque manner, though from memory none of the 'backtracking' (hub aside) is required to complete the game. The difficulty ramps up slowly over the game, enemies towards the end of the game usually require one or two specific skills to 'pop' a recharging shield before they can be hurt, in addition they are mure numerous + more damage. However this is largely an artificial increase in difficulty throughout the game, using the knock-back mechanic is less useful in these situations, forcing the Luchador to focus on one target at a time while breaking shields, and trying to combo those enemies into each other before the shield recharges, it makes you feel like much less of a badass chasing one of 8 foes around a screen instead of bringing pain to all 8 at the same time.   Audio is pretty pleasing to listen to, while I'm personally out-of-touch with the genre/nationality vibe they where going for, it seems to fit the pacing of movement throughout the levels pretty well, I could probably listen to this music for a reasonably longer length of time due to the lack of this style in more media today.   Visuals are pretty nice and colourful. Simple larger sprites make everything super-easy to tell friend-from foe, including yourself when things get a little hectic with more enemies. I think this refined/simple look suits the world of the Luchador quite well, bright colours + striking shapes rather than many complex details/patterns. Makes it really easy to pick out which enemies (or pieces of environment) need which skills to break them.  The only negative about this game, is that some of the side-challenges in an optional areas of the game require nigh on pixel-perfect execution of skill sequencing to pull off a combo/maintain hit-streak. In this regard the game feels very much like a Capcom fighter, finding the sweetspot so that you're skills will juggle the enemy correctly. This level of precision is needed nowhere else in the game so it feels more than a little superfluous. Granted Challenges in games are designed to present situations more complex/difficult than the main game (albeit in smaller packets), so probably not solid grounds to complain about.  Overall this game is pretty baller. For fans of other 2D &amp; 3D beat-em-ups It's pretty much a necessity on the list, it may not not cater to the more experienced 2D fighters in the same way it does to the general populus, as overall the game is fairly easy. Its unique setting definately warrants a look when compared with the dark/gritty beat-em-ups we see more often today.   8/10",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee is a game that mixes a lot of game mechanics at once. It has platforming, exploration, combat, dimension-swapping and more.  The game does a great job of introducing new abilities and mechanics to you as you progress, so the game never gets repetitive.  The combat feels fresh and unique because of the ability to perform your own combos and the ability to grab your opponents and throw them in any direction.  The dimension-swapping mechanic adds some neat puzzles to the game, but it also adds the ability to see 2 different dimensions of the same universe (the 'dead' dimension and the 'real' one) at any time, which is really cool.  One thing I didn't like about this game is that all these mechanics don't always blend in so well during combat. This is more complicated, but I'll explain.  As you unlock new abilities, the combat gradually becomes more interesting, but it also ends up being more tedious. Near the end, it almost becomes an annoyance. They give you more moves, which are very fun to use for platforming and puzzle-solving, but since they constantly add more depth to the combat, they end up just throwing tons of enemies at you at once. But it doesn't stop there. They make it so that you can only hit enemies if you break their shields, which will only break if you do certain moves, and these moves cost stamina, which takes time to regenerate. Also, all enemies can damage you in both dimensions, but you can only hit them in their dimension, etc. It gets overwhelming.  Some enemies even throw objects at you, but even after unlocking new attacks, you can't even break them. Like, you can't punch or kick a flying bone to break it. It just hits you anyway. Ranged attacks are literally indestructible, so you HAVE to dodge them. But the thing is, this isn't a shoot'em up: you can't attack and dodge at the same time. So you'll inevitably end up getting hit. The thing is, I shouldn't feel weaker as I progress through the game. I should feel stronger.  The game is pretty forgiving, so you won't necessarily die too often, and even if you do, you'll respawn just before the fight. But getting completely stopped because of a random little flying bone or an enemy from the other dimension? That completely breaks the flow of the game.  Also, when you use a controller, the button to dodge is R2 and you can't rebind it. This might seem like a minor complaint, but when you make a game about accurately dodging things, you don't put the dodge button on an analog trigger...  Anyway, I'm being overly critical here. I actually enjoyed the game a lot, it's just that combat gets pretty tedious and less fun near the end. The visuals and the characters are always charming, the humor in the dialogue and presentation is genuinely funny (except when it resorts to memes, but that rarely happens), and the music is fitting and pretty catchy!  I'd give this game an 8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "A really solid Metroidvania with beautiful art and animation, an engaging combat system, well designed mechanics and clever puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a love song to Super Metroid played by a nerdy mariachi band.   Instead of an arm cannon, you use your fists. Instead of a morph ball, you turn into a chicken. Instead of color-coded doors to be opened with the appropriate weapon, there are colored blocks to be smashed with your varied slam attacks. You even gain your powers by destroying precious Chozo statues (more on that later.)  The best part of this game, hands down, is the combat. The multitude of useful attacks at your disposal, combined with the responsive dodging mechanic and the fun and powerful grapples means that the combo system is both useful and rewarding. Battles in this game just resonate with me as being really fun, as you can bash some skeletons around, throw them into other skeletons, and just keep it going as the numbers on your screen go up and up and you get a bigger money reward when the fight is finished. It's just really fun, and the enemies are well designed to let you take advantage of combos and such if you're good.  The level design is nice, and they manage to keep the levels fresh with mixtures of new and old elements that let you make use of your powers. Backtracking when you have new powers, a staple of any 'Metroidvania' game, is present in this game, but also quite simplified. Areas that are blocked off from you are marked in bright, unmistakeable colors on your map, and correspond to certain powerups. While this is unfortunate if you enjoy more subtle or clever ways to impede progress, there are a few secret areas scattered about that have very little indication on the map, meaning you have to be perceptive to find them. The art style and design of the levels are also overall pretty good, but while the backgrounds are vibrant and creative, the walls of the levels are all dark and square, making areas seem kind of cramped, and it's just not as visually entertaining as it could be.   Unfortunately, there is a lot of untapped potential in Guacamelee. There were a few levels that were pretty barren as far as secrets and backtracking goes, which sort of made them simply linear puzzle dungeons. The last few hours of gameplay for me could have been a lot better if I had more reasons to revist older areas. Due to the linearity of how and when you get your abilities, most of the secret areas just contained health and stamina upgrades. I would have liked if there were optional powerups or attacks that I could find, or perhaps more villager sidequests that required you to visit other areas. There are only two towns in Guacamelee, and all of the 'quests' are pretty much just completed inside those towns, when there's no reason not to use other areas for them.   My main gripe with this game is how shallow the world feels, and there is one big reason for this: instead of worldbuilding and lore, the game opted for silly references and jokes. I think that the developers got kind of lazy in this regard, because the world concept is a pretty cool one, and the art and character design is top notch. But even though the game was inviting me to care about the world inside through its visuals, it just completely falls flat whenever it wants to convey information about the world directly. The towns are littered with posters of famous luchadores and advertisements, and 100% of those are jokes or references to nerd stuff. They were cute and funny the first couple times I saw them, but then I realized that these areas that could have been vibrant with character were just a platform for showing me some mexican versions of memes.   I mentioned that you gain your powers by smashing Chozo statues, and I mean really. There are Chozo statues laying around in the dungeons, like, actual Chozo statues from Metroid. And you smash them, and then the goatman cometh and yells at you for smashing his rare Chozo statue, and gives you a new power. Again, this was funny the first time, like, haha, we're trying to make a Metroid game guys! Haha! But really, that's a missed opportunity for something more creative or fitting for the game's world. You could still make a lazy Metroid reference, but instead of it being a Chozo make it a Luchadore or something. I hate saying this, but the over-reliance on jokes in this game smashes ~my immersion~. I know, I would roll my eyes if someone told me that, but it's true. It just ticks me off because the lazy world-building sours what would otherwise be a fantastic game.   Despite all that, I really do love this game. It's a blast to play, and I had a good time exploring and taking on the secret challenges. The game can get pretty tough when it wants to, and those difficult areas are really satisfying to beat. The music is great, and the gameplay is superb. I would only write such a big effortpost review if I actually cared enough about the game, so at least there's that. I highly recommend you give Guacamelee! a try.",
            "review_score": "1"
        },
        {
            "review_text": "A visually pleasing game. A few funny references here and there, but not over-the-top too many.   You can unlock different costumes in-game that best suit your favorite style of play. My favorite is the chicken suit; in the middle of a tough fight I can hide away and regenerate some health. The Skeleton suit lets you do endless supermoves. Another suit makes your slams really strong. And so on. When you get into some of the really hairy fights you'll almost wish the slamjam song were playing.  The gameplay is fun, beat-em-up with strategy involved, but also platforming. In fact once you get about halfway through the game some of the jumps and platforming tricks you have to do are a little frustratingly difficult. With a little practice and patience (you get as many fall-off-the-screen deaths as you want), you can make it through. Except maybe a couple of the secret items... getting them (tula tree and sierra, I'm looking at you!) are fairly insane no matter how much you've practiced.   Don't speed-run, at least not the first time. Take your time and enjoy the game. The boss fights each have their own flavor and they each seem fairly impossible at first, but then you clue in on the boss's strategy after a couple tries... almost reminds me (not really) of the old NES game Punch-Out... the bosses are HARD at first but they telegraph most of their moves and once you learn to read the tells and react... presto.   And oh. Make sure you have a controller for this one. You *can* play with the keyboard... but don't do it.  The only con I can think of, is that if you're a completionist, you might throw your laptop across the room (then kick it a few times for good measure) at the Tula Tree... that and you can't decide to marry X'tabay. Caliente!",
            "review_score": "1"
        },
        {
            "review_text": "A pretty challenging and colorful game with interesting bosses and a great combat system.",
            "review_score": "1"
        },
        {
            "review_text": "fantastic game perfect platforming anf pretty decent story   the only problem is that the controlls on pc are wonky unless you have a controller",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful artistic platformer, loads of fun",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! (Action and platform)  With many tributes to other video games in it like Mario,Megaman,Super Metroid, Final Fantasy... The mexican theme and musics are nice and very cool to listen!  It's a very good platform game. the map and the skills system look like a little to metroid. but it's not a negative point for me, i love this game and you should play it if you love games like that.",
            "review_score": "1"
        },
        {
            "review_text": "So far it's great... analogies to the old metroid, great graphics!  Can't wait to try multiplayer!",
            "review_score": "1"
        },
        {
            "review_text": "+Fun beaten up Metroidvania game which is best played with a local buddy. +The workshop customs have some cool designs and ideas *Samus TuT* +and the soundtrack is simply awesome to listen too, festive yet has a retro feel to it! +the controls and gameplay work really well  -The only down side is it has only a handful of bosses  -And can be FULLY completed in less than a day   If you and a IRL pal are looking to mess up some skeletons with a hint of humour  here and there this is for you, just try not to rush it",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee is a great game. It's like Metroid mixed with a beat 'em up game but done so well that I'd definitely say it was a must have game, the Steam community also enhances this experience by adding tons of customised skins like Batman, Johnny Bravo and even Samus (who I played as, of course).   The world is well designed, consisting of towns with villagers and sidequests, big open explorable locations and then temples. It plays just like Metroid but with less back tracking and is easier to navigate through the diverse areas. There are many hidden chests all over the world, I found them all without much trouble, so seasoned Metroid Veterans will likely find them easily.   The combat is also very fun, all of your attacks are general melee based attacks, as you could probably guess from the title. You will unlock special attacks and upgrades which are used for both battle and for navigation; they use up some of your stamina as you use them so you can't over use them to kill all enemies easily. The twist on the combat is that once an enemy is weakened, it can be grabbed and then thrown at other enemies or into walls using the analog for direction. A lot of challenges revolve around good use of this throwing ability and it does make the game feel different from other side scrollers.   The game has great sound design; the music is also greatly composed and enchanced the atmosphere of the areas. The sound effects fit perfectly and make the game feel cartoonish and matches the art style perfectly.  Once you're finished with the game, there is still a hard mode to play through, lots of achievements to get and an online normal and hard speed run leaderboard for both clearing the game and clearing the game with 100%. There is also an area with 17 challenges to test the limits of your skills and to attempt to best your hi-scores. Giving plenty of replay value for those who enjoy the game.   All in all, a fantastic game that I recommend very highly. Why wait for a new Metroid game when you can play this?",
            "review_score": "1"
        },
        {
            "review_text": "I really liked ths game. Has a lot to offer and lots of bonus things you can do. It really ramps up the difficulty in some areas but most of those are optional. It also has hidden tribute to many other games along the way.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! If you like any Metroidvania game, you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee is an action platform, of the Metroidvania variety. You play a Mexican Luchadore, fighting the forces of evil to save your love and the world. Along the way you will explore varied areas, learn new abilities, and fight a multitude of enemies.  Guacamelee is a game that is just oozing style. Everything from the artwork, to the sound, the writing, the characters and the world at large mesh so well together. You will want to spend time exploring the world and talking to its inhabitants. The towns are packed with humor and things to find.  The controls are as tight as they need to be for an action platformer. I played using a 360 pad, and would recommend using a gamepad. After learning new abilities, you will have to combine all your powers to advance in the later stages. I was really amazed at the combinations I could pull off toward the endgame.  I do have one complaint, which falls under performance and controls. Originally it felt like the game moved super fast, and I was having trouble pulling off basic combos and fighting some of the early enemies. One sequence in particular, where you must run in sidescroller fashion from a destructing environment, felt like it was moving way too fast. I was only able to pass it after about 20 attempts. Later I learned that there can be a bug with the vsync that basically doubles the speed of the game. Turning off vsynce solves the problem, however it will lead to some graphical glitches along the way. I found it a small price to pay for a playable game. After playing about the first quarter of the game at double speed, later platforming sections felt pretty easy in comparison.  Beyond my one small complaint above, I was enamored by everything else in Guacamelee. It was fun to explore, fun to see what was next, fun to fight the enemies, and just plain fun overall. I would welcome a sequel, since it feels like there are so many places for this series to go. I see that a rerelease just came out with some new levels, and while I would prefer an entirely new game, eventually I may give that a shot as well.  I completely recommend Guacamelee. While it has received heavy praise so it wasn't a complete surprise, it really exceeded my expectations. At this point you may want to purchase the newer version if you haven't played it yet, but if this game is already sitting in your backlog, move it to the front of the list.  Grade: A",
            "review_score": "1"
        },
        {
            "review_text": "the term 'Metroid-vania' is overplayed but fits the style of Guacamelee. it's a fun Luchadore themed platformer with a simple story but great mechanics and can be truly challenging when it wants to be. also making the combat mimic a simple fighter system where you string combos feels rewarding and plays a role into defeating tougher enemies later on.  definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game , but it could be a little bit better..",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Metroidvania games ever. Platforming is tight, pacing is great, light/dark mechanics are slick, combat is fast and fun, art is amazing, sound is good. Probably in my top 10 list for the year.",
            "review_score": "1"
        },
        {
            "review_text": "The world's finest guacamole simulator.   My mother is allergic to avocados.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like quick melee sidescrolling combat and adventure (and tacos). Then you'll love Guacamelee! This Mexican themed action platformer is set in in the colourful world of luchadores and the not-so-colourful world of the dead (which is still nice to look at anyway). The fighting is fast paced with plenty of moves and enemies to mix it up. There are also puzzle solving elements, where the player (that's you!) has to utilise the new techniques you have learned and quick reactions to solve them all. The music is also beautifully well suited, as are all the sound effects.   The game can be a bit challenging at times when you're facing multiple enemies in different dimensions, but by no means is it impossible. There is a hard mode available after completion of the game if you found the first run through too easy.   The game however, is quite short unfortunately. I finished it in 5:15, though that was with completing most all of the puzzles along the way (which probably made it easier for me anyway). That said, there are a number of side quests that I did not complete, and with multiple costumes also available, combined with the hard mode, there is some replayability in this game.   Another feature, though I have not tried it out, is co-op mode. Could be fun, but not necessary anyway.   The story isn't too bad - typical save the princess stuff with a Mexican and underworld theme mixed into it. The dialogue can be funny at times, but I think the only decent material was when references to other games were made. I feel like the developers tried too hard with this, and perhaps should have been more subtle most of the time - to me it seems they relied upon it too much.  Guacamelee is fun, beautiful to look at, and engrossing, which is why I recommend it, but considering it's length, I would wait for a sale so as to get more bang for your buck.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 - A deeply thrilling Mexican themed Metroidvania style game combined with an enjoyable soundtrack, gorgeous design and satisfying combat. The hours flew by on this and simply could not put it down until it was 100%'d. Loved every minute of it.",
            "review_score": "1"
        },
        {
            "review_text": "Great side scroller beat them up. The combat feels really good and responds well. Dodge mechanic takes some getting used too. Platforming may be tough some times but is fun. Lots of secrets to uncover. Story is entertaining and the humor is okay at times. Very fun and I do reccomend. Short game tho , do not buy over $10 Also you can play as bayonetta and thats cool. ",
            "review_score": "1"
        },
        {
            "review_text": "great game for coop fans!! is more more detailed and polished than it looks on first glance big recommendation",
            "review_score": "1"
        },
        {
            "review_text": "Tight as a gnat's chuff. Great platformer!",
            "review_score": "1"
        },
        {
            "review_text": "A great metroidvania game with very solid controls and an awesome art style.  As for the ♥♥♥♥♥♥ qualities, the seziure warning could not be emphasized enough. Every time you learn a new special move or attain one of the many upgrades, the entire screen flashes incredibly ♥♥♥♥ing rapidly bright neon yellow, pink and blue. I had to look away every ♥♥♥♥♥♥♥ time or it would hurt the ♥♥♥♥ out of my eyes, whoever thought that was a good design decision should be shot in the ♥♥♥♥ing head.  Interenet/videogames references are layered on thick and obnoxious, borderlands style, though at least they happen in the background rather than having plot points revolve around them.",
            "review_score": "1"
        },
        {
            "review_text": "Just Awesome - although the JAguar fight sucks!!!",
            "review_score": "1"
        },
        {
            "review_text": "The only thing I have to say about this game is,  ♥♥♥♥ YOU!",
            "review_score": "1"
        },
        {
            "review_text": "Overall, this game is pretty alright. Not very long by this genre's standards, but it's still a good 9-10 hours if you want to do everything. I'd give it a solid 8/10, but something bugs me.  Hard mode is complete and utter trash. I don't usually complain about hard difficulties, hell, I love hard difficulties, but this game wanted to be special. You want a hard mode that smooths out the game's uneven difficulty? ♥♥♥♥ you! Instead, you get a game with even worse difficulty jumps, horribly unbalanced enemy combinations, and a game that, honestly, isn't very entertaining on a second playthrough.   But hey, if that's your thing, go right ahead hombre. The game is fun enough on its initial playthrough to warrant the $3.75 price tag I bought it at.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "Metroidvania at it's finest, mixed with crazy platforming moments.  Amazing art-style, and crisp hd vector graphics; very skewed towards mexican folklore, so it is clearly not for everyone. Plagued (literally) with references to other games and internet culture. The atention to detail it's remarkable, without any copy and paste material, or mirrored levels, a problem that plagues the genre, ie: the last nds Castlevania iteration. This gives really fresh content for the entire game, but it comes at a price, the length of it.  The length is little short for any major genre enthusiast, with just a little obvious backtracking here and there. The game copes with this by presenting you with amazingly difficult platforming challenges, mixed with insta-death and insta-respawn. I assure you that 2 sections of this game will get you stuck jumping the same platforms again and again for about an hour. For me that sounds like fun, been an old gamer from the NES era, but i am sure that many new fellas will feel ripped off by the platforming difficulty of this title. Some of this rooms are just for item-grabbing, but others are mandatory and un-skippable.  Go watch some youtube vids of it, to get an idea Another thing to mention is the combat system. This game hides an amazingly complex and robust combo system, that you can learn through the game, and test in the Hell challenges.   It took me about 11 hours in my first run, and then about 4 on my second run.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game, buy it now!  That being said, this is a really intelligent, polished and fun metroidvania game. Metroidvania is probably my favorite video game genre, and this one gets it right. While the game doesn't have a large focus on exploration, its still there. The combat is legitimately fun, and is not just tacked on like in many games of the genre. The platforming sections are very interesting and can get challenging. The atmosphere and setting are very unique and cool. The music is beautiful and fitting. The humor is quite good, I laughed out loud a good deal at some of this game's jokes.   I think the coolest thing about this game is the way that platforming and combat are integrated. As you progress in the game you gain combat moves, powerful punches and such. These moves are used in combat, but also are the backbone of platforming. For example the first move you learn is an uppercut that launches you upwards in the air. And while useful for combatting enemies and sending them skyward, the uppercut can also be used as a 'double jump' of sorts.   Highly, highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Deliver a nice piledriver to the face or frog splash your way to victory. This is a great wrestling themed game, sure to please any wrestling fan! A fun way to pass time!!!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game overall! Great art style and the music really fits the theme of the game overall. Controls are pretty clunky if you're going to play on a keyboard. Controller is highly recommended.   10/10 would beat Mexican virgin sacrificer again.",
            "review_score": "1"
        },
        {
            "review_text": "I love being a luchador ^-^. This game is soooo much fun :P",
            "review_score": "1"
        },
        {
            "review_text": "This is easily one of the most engaging games I've seen on the market. Up front, the journey to 100% the game can be infuriating at times, but the casual playthrough is filled with interesting platforming, just enough mechanics to avoid being cumbersome or confusing, a striking art style and presentation, and a comedic style in the dialogue.  The game never seems to drop mechanics it introduces. Many games will put a mechanic on display for one or two stages. Not so with Guacamelee! Throughout the game, the designers constantly throw both old and new at you. It even has things for the hardcore audience with a particular attention to speedrunning.  Things I would have liked to see  1. Tighter input reading: I felt like the game responded slightly late on my button presses at times, though this could be atttributed to my monitor not being top of the line in latency.  2. Controller editting: It seems like a huge oversight in a game this polished for you to be unable to assign any controller button to any action.",
            "review_score": "1"
        },
        {
            "review_text": "fun game better played with a gamepad .",
            "review_score": "1"
        },
        {
            "review_text": "Colourful, creative platformer which at times can be too easy, yet at others blisteringly difficult. Overall, entertaining. Worth checking out!",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome. very attractive art, funny, luchadors. a must if you love the classic super mario side scroller style. also very challenging. first game to make my palms sweat in a long time",
            "review_score": "1"
        },
        {
            "review_text": "This is easily one of the most engaging games I've seen on the market. Up front, the journey to 100% the game can be infuriating at times, but the casual playthrough is filled with interesting platforming, just enough mechanics to avoid being cumbersome or confusing, a striking art style and presentation, and a comedic style in the dialogue.  The game never seems to drop mechanics it introduces. Many games will put a mechanic on display for one or two stages. Not so with Guacamelee! Throughout the game, the designers constantly throw both old and new at you. It even has things for the hardcore audience with a particular attention to speedrunning.  Things I would have liked to see  1. Tighter input reading: I felt like the game responded slightly late on my button presses at times, though this could be atttributed to my monitor not being top of the line in latency.  2. Controller editting: It seems like a huge oversight in a game this polished for you to be unable to assign any controller button to any action.",
            "review_score": "1"
        },
        {
            "review_text": "I wish I were a big burly mexican dude",
            "review_score": "1"
        },
        {
            "review_text": "Colourful, creative platformer which at times can be too easy, yet at others blisteringly difficult. Overall, entertaining. Worth checking out!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, it is a blast from the past in the style of platformers that have long since gone. Now if only you died more easily.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game single-handedly brought my dead cat back to life. Just moments after I defeated the final boss through sheer will power and determination, a sound came from the backyard. I don't know whether it was the adrenaline from just beating this beauty of a game or the multiple coke cans I had drank, but I decided to attack the intruder head on with my fists. So, with my fists raised, I stomped over to the backyard where, lo and behold, my dead (or at least I thought) cat was standing before me! 'Praise The Phil!', I shouted. Literally the entire neighborhood soon arrived to witness the miracle for themselves. LITERALLY the entire neighborhood. Not just the people, no, but every piece of matter showed up!   Praise Phil!",
            "review_score": "1"
        },
        {
            "review_text": "great game for coop fans!! is more more detailed and polished than it looks on first glance big recommendation",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good. Guacamelee is a Metroid-vania platformer with so much charm it'll makes your nuts ache. Great controls (even with a keyboard), fun characters and story, amazing art and sountrack, and good replayability. It also has a lot references to other video games like Super Meat Boy, Bit.TRIP, Megaman, Super Mario Bros., and more. However, the one glaring flaw of the game is that it has memes in it, but only on the billboards in the towns. But if you can look past the small amount of cancer in this game, you have something so amazing and fun that you will play for hours on end.",
            "review_score": "1"
        },
        {
            "review_text": "With satisfying beat-em-up action, tight controls, solid challanges and the overall ambiance of a Mexican daytime TV game show, I strongly encourage Guacamelee! for anyone who even kind of likes punching skeletons.",
            "review_score": "1"
        },
        {
            "review_text": "Excellento gamerino. Much graphics, action. So funne. Juano",
            "review_score": "1"
        },
        {
            "review_text": "fun game  buy it when it is on sale",
            "review_score": "1"
        },
        {
            "review_text": "A great metroidvania platformer with melee combat.  There is a lot to be said, the game has great level designs, great hidden collectables, great secret levels, a bunch of time challenges, leaderboards for who can beat the game the fastest, it even has local co-op.   The only thing that could make it better is if it was longer.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game, with many Easter Eggs! Love it.",
            "review_score": "1"
        },
        {
            "review_text": "I can't think of a way to describe this game that will do it any justice. It's almost as if Super Mario and Super Meat Boy had a baby? Picked this up for a couple bucks during the Steam summer sale and played it more than all the AAA titles I have picked up.... Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent and challenging. Movement is fluid and tight, making the admirably difficult platforming sections a pleasure, while combat feels frantic but fair. Both the soundtrack and the art style are supremely fitting. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "If I could play as The Flea from Mucha Lucha that'd be awesome. Really good adventure-Castlevaniaesque game.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent art style and music! This game is great. Thank God for this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great metroidvania style game that is easily acceptable for new players to this genre, yet still poses a difficult and rewarding challenge with a unique and instinctive combat system. The main story is more than long enough to engross you while the side missions just add even more fun and addictive gameplay. A must buy.",
            "review_score": "1"
        },
        {
            "review_text": "It's a grat game. Love the action/parkour style!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is old shool hard. I love it. It brings me back to the NES days.",
            "review_score": "1"
        },
        {
            "review_text": "Hey, hombre, you're probably looking at this game wondering if it's worth your hard-earned pesos. Why else would you be reading a review from a perfect stranger? 'Cause if I know you, I've probably already told you to pick this game up. And if you haven't already done so, why not, Ryan??  However, for a short time (as this is being written), the game is just under $4. There is absolutely NO reason to pass up this game at that price. Hell, even at the full $15 it's worth the ride.  What you get is a beautifully-animated luchador-flavored Metroid romp in a massively sprawling world that was so good, they made it TWICE! That's right. Twice. That means two times, you idiot. You know how like in Symphony of the Night they flipped the castle upside down and you went through it all over again? Well, it's kind of like that except the other version of the map is the DEATH MIRROR world that you can flip between in REAL TIME... after you unlock the ability, of course. You are, after all, only a lowly masked luchador brawler to begin with, but as with all Metroid-style games, the more you play, the more powerful you become.  Not convinced? How about you can play this game co-op with a friend? No? How about you can buy costumes for both characters that change the way you play the game? Still no? How about the game has amazingly realized mariachi-style music throughout the entire journey? Not yet? How about there is a MASSIVE screen-filling boss in the first third of the game that will scare the bejeezus out of you?? How about brain-teasing platform puzzles coupled with an insanely deep, yet simple-to-execute combo system???! IS THERE ANY WAY TO PLEASE YOU?!?! MUST THE GAME BE MADE IN UNREAL ENGINE FOR YOU TO BE SATISFIED?!?!  Listen, let's talk writing, then. Are we going to talk writing or are you going to break my balls? Good. The writing is fantastically whimsical and funny. Some of it is very cheesy, but it's always intentionally so. The story is all about standard heroics - your lady friend has been kidnapped and you're out to save her. But there's other things going on as well, in the background. You'll meet the bosses long before you have to fight them and learn about them. You'll find out that the main baddy, who is like Manny Calavera dressed as one of the Three Amigos, is only the main baddy because [MINOR SPOILER] he told the devil that he didn't have a job anymore. What are you going to do about it, hombre? Nothing? Nothing?!?! Aw, man, you're breakin' my balls here, you're breakin' my balls.  Look, do yourself a favor and get this game. If the obvious references to Metroid aren't enough to convince you, maybe the endless meme-posters and indie-game tributes, hidden easter eggs, and odd obsession with chickens might be able to convince you. And if you're still not convinced, then I suppose you can go back to your cookie-cutter AAA games that you've played a million times over. Try something new, muchacho.  Seriously, you're breakin' my balls.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun to play with friends! Some parts are really hard and took us quite a while to figure out. It's very easy to follow, and the controls are quite simple! I don't think I would play it alone due to how bad I am lol",
            "review_score": "1"
        },
        {
            "review_text": "This is a lovely game. The graphics are really nice and give a really nice feel to the environment, and it has a great contrast between the two 'worlds' available, and the various levels within them.  The story is a good one, it doesn't go into too much incredible detail (short cutscenes and dialog).  Combat mechanics are good, with a wide variety of combos for your moves, and movement makes good use of the dynamic environment, in both 'worlds'.  Tried with keyboard, and it works great. Some of the move combos might be easier with a controller, I imagine, but the keys can be remapped however you want.  The music soundtrack has a great mexican feel to fit the game.  Well worth a buy.",
            "review_score": "1"
        },
        {
            "review_text": "one of those nice little gems you find while digging through all the games you bought in bundles",
            "review_score": "1"
        },
        {
            "review_text": "This game helped me through my Spanish 1 class. If you need to learn some stuff about Mexican culture, buy this game now. Jeremy Clarkson approves this message.",
            "review_score": "1"
        },
        {
            "review_text": "What can i say about this came other than, Amazing. The experience i had with the game was perfect in almost everyway. It has a nice combat system with a bunch of super moves which you can easily link together for long and powerful combos, Beautiful graphics, an Amazing Soundtrack, Allows you to download free custom skins via the Steam Workshop including some by Drinkbox Studios themselves, Amazing sound design, a fun difficulty curve, A nice amount of challenge and the ability to turn into a Chicken at will. Only downside is there is no Online Co-op, but if you aren't going to buy the game for that reason, to be frank you are missing out 9.5/10 Would buy at full price",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually a top notch platformer, which may not be apparent from the screenshots and video alone. The well thought out level design and game mechanics will push your thumbs to the limit and make you feel like playing Twister on your gamepad. The game is very well paced, and in combination with an original aesthetics and humor, kept me glued to the controller for hours on end.  If you're into games like the Megaman series, don't think twice about this one!",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee is a 2D high-flying combo action and platforming game. The overall theme, music, and graphics are all blended together to make this game a very memorable and fun experience. Some levels or areas can be a bit frustrating as you will need to have precision control and some puzzles can be very tricky, just check out a walk-through or a video to get you passed these areas. There's a ton of content with unique achievements, challenges, hidden goodies, collectibles and costumes to unlock. The game also has a two-player option for local co-op bashing!",
            "review_score": "1"
        },
        {
            "review_text": "Really good game but literally unplayable with keyboard. ",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing Metroidvania and if you don't own it I will suplex your whole family.",
            "review_score": "1"
        },
        {
            "review_text": "A goat taught me how to fly. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game, ton's of fun. Reminds me of platformers from when I was little.",
            "review_score": "1"
        },
        {
            "review_text": "I have never been one for Metroidvania games. That genre has always been too punishing and bland for me. I see the appeal, but for me, it never lasts.  Guacamelee is firmly in that genre, and somehow I love it. Maybe it's the prevalence of save points. Maybe it's the fighting system that rewards variety and reflexes instead of perfect aim and conservation of ammo. Maybe it's just the amazing luchadores. I have never played a game in a world of luchadores, and I'm not sure one has ever been made before this.  There's a well-told story in a unique setting, an engaging combat system, a high level of difficulty, and a couple hundred in-jokes. There are also tons of secrets to find, dozens of challenges to beat, and a bevy of achievements with varying levels of impossibility. All told, this is a great game for fighter/platformers with a good deal of reward for those who like exploring.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic art style, tight and responsive controls, an fun combat system, well-designed stages, memorable bosses. Guacamelee is on of my Games of the Year, and it's a shame it's taken me until December to play it.",
            "review_score": "1"
        },
        {
            "review_text": "A great metroidvania-style game. the visuals are beautiful and the levels are well designed. The beat-em-up gameplay is challenging and very satisfying, including some well designed boss fights. The platforming is also very well done, you must use a combination of wrestling moves, jumps and going between the world of the living and the world of the dead to get through, good stuff! And all done while listening to an awesome Mexican style soundtrack. Definitely one of my favourite games this year! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing Metroidvania and if you don't own it I will suplex your whole family.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very good platform game, with an interesting and funny story, Pretty straightforward, with creative mechanics/gameplay. The game develops as you obtain new powers/moves that increase your fighting ability (beat-em-up) and also allow you to access some new areas, by breaking a block or reaching a higher platform.  This game will please the ones who don't have much pacience for hardcore enemies and puzzles, but is challenging enough for the more hardcore gamer to feel satisfied in solving a way to cross a river, climb a wall or beating a boss.  I definetely recommend this game! 9 out of 10 for a casual platform game.  Not sure about the price, though. I bought it on a bundle.",
            "review_score": "1"
        },
        {
            "review_text": "Super fun. Beware if you're colorblind.  I had a marathon couple of days playing this game; I enjoyed it immensely though I'm not the best platformer or combo-maker. The checkpoint locations were pretty forgiving and the gradually ratched up challenges made the game more fun than frustrating. Until the boss fight against Calaca, but for a very particular reason.  The Calaca boss fight mechanics rely entirely on twitch reactions to colored shields with zero room for error. For my particular kind of color blindness, I can only reliably detect the blue shield and the red shield. The green or yellow shields look identical; it's a 50/50 chance if I do the correct move to score a hit. Every time Calaca attacks his shield is a different color; a process of elimination cannot be used.  If you're partially colorblind, this fight will be more difficult for you. If you're completely colorblind, this fight will be nearly impossible to beat. You would have to stick with a single attack and count on your ability to avoid damage long enough for your random successes to eventually defeat Calaca's first form.  A significant portion of the population suffer from some form of color impaired vision. It's always a shame when game designers are ignorant or willfully disregard that.",
            "review_score": "1"
        },
        {
            "review_text": "Regular guy, die, get a mask in death, come back to life, BEAT SKELETONS UP, UPPERCUT LIKE A ROOSTER, AND BE TAUGHT BY A GOATMAN.  Beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "VERY fun game that actually requires skill to play, you have to link up combos to defeat hard enemies and to earn money to upgrade your luchador. And the platforming takes skill but isn't too hard, most of the time when i died it was my fault and i didn't feel cheated. This game is only like 9 hours long which is the problem. I only paid $3 for it cause it was on sale but after playing it I still think it's worth $15. Very fun and worth it",
            "review_score": "1"
        },
        {
            "review_text": "This game has much to offer - quality animation style, bright colours, and a quirky combat system. The game doesn't have much in the way of story, but it doesn't need it. It follows the traditional platformer style - love interest has been captured by some bad guy, good guy pursues bad guy to save love interest - you know how it goes.   Anyway, the game starts with baby steps. It can feel slightly frustrating when you first play it, but when you learn all the different 'moves/concepts' of the combat system, you appreciate why they started so slowly. This combat system is, quite frankly, fantastic. When the enemies start gaining shields that you have to break, or they go into another dimension that you can't attack, you have to think quickly and act accordingly - button-mashing only gets you so far in this game.   The difficulty mark-up is erratic, though. It starts fairly easy, and then the last part of the game is wincingly hard. It almost killed the experience entirely as it was so needlessly hard - I like difficult games, but this game's difficulty can offer you little by way of dodging/returning damage. Sometimes, you just get ♥♥♥♥ed over without doing anything wrong. I eventually triumphed, but only after a fair few tries.   I'd recommend this game to anyone. It's fast, colourful, funny and challenging. What more can you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "You can play as a chicken.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best purchases I've made on steam this year. At its heart, it's a Metroidvania-style game, but the surprisingly good gameplay mechanics, atypical but highly amusing lucha libre setting, endearing art style (nice change from all of the retro/pixel games lately), and witty dialogue make this a clear winner among similar games.   Combos are easy to string together, but still offer a lot of versatility. The platforming aspects, while at times challenging and requiring creativity, are not completely unforgiving and don't require split-second precision (i.e., Super Meatboy). There are enough side quests to add some flavor, without turning the game into a massive collection of fetch quests. And there's no need for constant backtracking and revisiting old areas (although you do get skills that unlock certain secret/optional rooms, those entrances are clearly marked on your map so you don't have to waste hours checking every wall in every previous area for a secret).   Bottom line, it's just plain fun.",
            "review_score": "1"
        },
        {
            "review_text": "Many good game that a lot of good music artings and wonder. Many jumping like goats and puzzles. Many dialogue and fun characters of interest.",
            "review_score": "1"
        },
        {
            "review_text": "If you can get past the memes and references, it's a pretty solid game with a great soundtrack and SSStylish combat.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Could do a lil better here and there but overall a great game. I can only imagine what the two player is lke since I have no one to play with :(  7/10 game  10/10 loneliness",
            "review_score": "1"
        },
        {
            "review_text": "This game is near perfect, I can't really find anything wrong with it besides it being really hard. 9.8/10",
            "review_score": "1"
        },
        {
            "review_text": "the nicest thing is to have one more controller and play in a team. secret locations are really good.  the main - is graphics. amazing colors) give a player the best mood.",
            "review_score": "1"
        },
        {
            "review_text": "I really cannot recommend this game enough and I am not one to write reviews due to apathy towards many of my game purchases. But this game, its worth every penny! The Artwork is stunning, as is the music, the control's (Im using a 360 pad) and overall game play.  I got my copy in the steam sale but its worth its full price and beyond, this is an excellent and high quality game!",
            "review_score": "1"
        },
        {
            "review_text": "this is a very sort game, but what there is is a LOT of fun to play, some of the puzzles are really unique and very hard, but so rewarding when you get them...the game never had a dull moment with every single step having something new, and all the references to stuff made me giggle a bit :D",
            "review_score": "1"
        },
        {
            "review_text": " Mean Mr. Mustard's short Guacamelee! Gold Edition review    1) Essential - buy it NOW   2) Recommended - buy it on sale",
            "review_score": "1"
        },
        {
            "review_text": "A great metroidvania game with solid combat mechanics and fun platforming. The characters and world are rich with detail and funny refernces to other games/movies/pop culture",
            "review_score": "1"
        },
        {
            "review_text": "I started the game again and for some reason i had to do the tutorial again. 1/10 bad game design",
            "review_score": "1"
        },
        {
            "review_text": "Minus the memes, Guacamelee is a very well put together Metroid-like with a fast paced beat-em-up combat system.",
            "review_score": "1"
        },
        {
            "review_text": "They obviously took couple ideas from Rayman Origins.  Guacamelee wasn't that interesting at all (aside from few giggles and the funny characters).  5/10",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee! Gold Edition is a Metroid-vania style action-platformer set in a magical Mexican inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters.   Guacamelee! builds upon the classic open-world Metroid-vania style of games, by adding a strong melee combat component, a new dimension switching mechanic, and cooperative same-screen multiplayer for the entire story. The game also blurs the boundaries between combat and platforming by making many of the moves useful and necessary for both of these.   Travel through a mystical and mysterious Mexican world as a Luchador using the power of your two fists to battle evil. Uncover hidden wrestling techniques like the Rooster Uppercut, and Dimension Swap to open new areas and secrets.",
            "review_score": "1"
        },
        {
            "review_text": "Damn good game this is. The visual style is very unique...nothing elaborate but beautiful to look at!  The platforming elements here are not precision-based, so the game is very forgiving in that aspect. Combat gets more complex though and like in most games you may need to play boss battles (and even regular battles) a few times to get things right. Decent amount to explore too.  Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Its Really Good Actually! Great Game But I Dislike The Combo System...",
            "review_score": "1"
        },
        {
            "review_text": "Ole. Ole ole, ole ole.  Though this game has nothing to do with Soccer.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome art style and great gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. The art style is awesome, the hispanic/Mexican theme is refershing and the gameplay is punching, hard-hitting and challenging without being frustrating. It's an addictive lillte romp through the old save-the-princess trope. The music is awesome I wish I bought the soundtrack bundle but I'll buy it later separately. I hate the term 'indie games' but this is definitely a AAA indie game.",
            "review_score": "1"
        },
        {
            "review_text": "It's dank",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic graphics, attractive storyline and theatrical imagination. I swear it is no exaggeration that Guacamelee is one of the best action games I have ever played, though it drivers me round the bend almost every time.",
            "review_score": "1"
        },
        {
            "review_text": "Everything about this game is fabulous and your life is simply incomplete if you don't own it.",
            "review_score": "1"
        },
        {
            "review_text": "Mexican-themed beat-em-up Metroidvania? Hell yes it's awesome. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever played the original 'Little Big Planet'''s desert level? THe one where you helped Uncle Jalapeno and did that temple run thingy?  Well take the theme of that, and ALL of the wonderful charm, throw in a suprisingly deep combo system and well developed characters and you get Guacamelee!  Guacamelee is a metroidvania style platformer that puts you in the boots of 'Juan' a simple agave farmer who has a brush with destiny in order to save his lover. Through this game you will unlock many secret abilities that are both used for combat, and to explore new areas (the uppercut acts as a tripple jump for example)  The storytelling of this game is supurb, and you find yourself cheering for Juan without you even realizing it at first. The platforming bits start off as simple, but get unforgiving quickly... in the BEST WAY POSSIBLE. The extra coinage or bit of skull/heart are not so much of a reward, the true reward is getting from point A to point B and that little kick you get when you FINALLY get there.  Lastly: I would reccomend getting the soundtrack edition. The music in this game (like most things in this game) is top notch, and is quite catchy   TL:DR Version  GET. THIS. GAME  9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has everything I ever wanted: Mexicans, metroidvania platforming and cool looking graphics",
            "review_score": "1"
        },
        {
            "review_text": "Did you ever wonder what it would be like if Samus Aran was a luchador? If so, this might be your dream game. Also, you might have landed on the mat a little hard.",
            "review_score": "1"
        },
        {
            "review_text": "This game is AWESOME!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. Smooth controls, gorgeous visuals, a lovely soundtrack and oozing style, including cute references to familiar games. Do not hesitate on this one. It's a big winner.",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly good platformer/brawler. The art style is simple but well utilized and worth the price. The humor is great, the abilities are smooth and the combat is engaging. There is local co-op and, while its fun to play with someone else, the second player makes combat nearly trivial while simotaniously creating a major handicap to the platforming aspect. You often have one player pop out (which is smoothly implimented) during most non-combat areas. A good 4/5 and worth up to $15",
            "review_score": "1"
        },
        {
            "review_text": "Super fun, addiciting, beat-em-up gameplay! I love beat-em-up's (this, Castle Crashers, Scott Pilgrim, etc.) and wow this game is insanely good. It's also a Metroid-vania which basically is like the style of a 2D Metroid or 2D Castlevania game basically where there is one map that you stay at that you can explore and stuff, kind of hard to explain but it basically means a lot of exploration and upgrades. This isn't one of those brawlers where you can just walk across a screen and mash buttons. There are actually levels, it's a platformer as well. So yeah I could go on and on just buy this freakin' game. I wanted it before it was released but it was PS3 and PS Vita exclusive so when it dropped onto Steam, I picked it up instantly.",
            "review_score": "1"
        },
        {
            "review_text": "Its melee Metroid, its Mexican, its $15, and its also very very pretty.",
            "review_score": "1"
        },
        {
            "review_text": "This game is freaking amazing. Fun gameplay that is challenging and anjoyable, tons of good subtle references, and great visuals and story. Check it out if you haven't already!",
            "review_score": "1"
        },
        {
            "review_text": "Casually funny, with a difficulty curve reliant on learning to use new moves effectively, rather than just learning to use them.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpiece. It brings you back in time with it's old platform game style. It is quite challenging, not likely most new games. The artwork is awesome also. You should buy it now.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. The world is pretty big in my opinion. Pretty simple and easy to beat the game. The enemies are mostly the same, though. It gets repetitive after a while because you basically fight the same enemies all the time. History is OK. The bosses are what makes the game fun, basically. Nothing to complain about bugs, I've never found one. Overall, if you get this game in a bundle or sale, good for you. However, if I was you I wouldn't really buy this game on its normal price. It is way overpriced.",
            "review_score": "1"
        },
        {
            "review_text": "This game turned out to be better than I expected. It's quite fun to play, you can unlock sweet abilities over the time, it has some nice challeging bosses, not easy enough to make you bored, not hard enough to make you quit. Plus some custom outfits, including steam workshop ones. To sum it up, try playing it coop, you like it even more.",
            "review_score": "1"
        },
        {
            "review_text": "Mario plus Cave Story. Pokes fun at video games and internet memes. The levels can get difficult but are always interesting so you'll actually want to keep moving and never feel screwed over by masochist designers. There's a reason this game is 90+ on Metacritic.  BTW, this is currently free on XBONE with Xbox Live Gold, so you might even save a few bucks.",
            "review_score": "1"
        },
        {
            "review_text": "[8/10]  You are a luchador who can travel to the world of the dead at any time. You can punch things. Buy today!",
            "review_score": "1"
        },
        {
            "review_text": "Being Mexican and all... I enjoyed the silly references to the culture a lot. This game can be challenging at times, but it's pretty casual. PLAY IT FOR THE PINATAS! ^___^",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! A bombastic, colorful, tight brawling experience. The hard mode has the perfect balance of difficulty and satisfaction. Have fun kids",
            "review_score": "1"
        },
        {
            "review_text": "Man man what a game. Extremely challenging, but it manages to stop just before it gets frustrating. Completing a challenging part of the game is very rewarding. Combat is fun and fresh, throwing enemies into each other is both hilarious and of tactical importance. The platformer parts are also very well done, with a plethora of different abbilities keeping things interesting.  9.8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "What you get from Guacamelee (love the name) is 2D Metroidvania platforming galore. The story is silly, like a mexican b-movie, which isn't too bad. The graphics are real eyecandy, the designers did an excellent job here. The controls are very direct, your character reacts immediatley to your input.  The level design is visually really great, but difficultywise a bit unbalanced. I must admit, that I stopped playing after I put about an hour into a single screen, where I died over and over again.   Recommended if you are up for a real challenge. Sometimes a bit too unforgiving. Rating 8/10 - Good game",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee! Gold Edition is a true to the genera action platformer. As I played through I was taken back to being a young boy enjoying his NES system in part due to the riveting gameplay and colorful characters but also through an array of easter eggs and references ranging from visual cues like Metroid’esk statuary to audio which was clearly inspired by other platformers of yesteryear.   The gameplay is fun, difficult enough to be challenging and perhaps sometime frustrating but rarely so extreme you’ll feel the need to throw your controller. On the topic of controllers I’d highly recommend you have on for this game. While using a keyboard was possible it was a rage generating experience which I would avoid if at all possible.  All in all if you’re in the mood for some amazing platforming action, a interesting enough storyline and some beautiful art and audio design Guacamelee! could be the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "This game is AWESOME!",
            "review_score": "1"
        },
        {
            "review_text": "fights arent the hardest part on this game, making your way through the map is way harder than the fights. its funny yeah the music its cool and i liked the art style. cons: quetzal does not appear i was waiting for him all the game :(",
            "review_score": "1"
        },
        {
            "review_text": "Too much Spanish. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "its cool",
            "review_score": "1"
        },
        {
            "review_text": "Nice beat-em up, great combo potential...  ...and if memes were sugar, it'll give diabetes.",
            "review_score": "1"
        },
        {
            "review_text": "The combo-friendly combat of a good action game with the involved platforming of a good platformer. Plenty of great humor, and energetic music. The best action platformer I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Grteat action adventure game with lots of style and excellent controls",
            "review_score": "1"
        },
        {
            "review_text": "This game is an awesome platforming game, with a unique artstyle and combat mechanics along with good storytelling and bgm. Variaty of skills, combos are very balance and the game does not come across the feeling of grinding as you will get all the skill upgrades as long as you play along through the story.  The game has a lot of reference and easter eggs through out the game and I love it.  The achievements are relatively easy, nothing too hard or require too much of time to get as well.  If you're trying to get all the achievements, I suggest start playing on hard mode(by typing a code) or play through it 2 times, which I did.  Since I finished this when Super Turbo Champhionship Edition is out, I suggest you getting that one since its more of a upgraded version to this game.  10/10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "This game definitely hit the spot for me in the metroidvania genre. It has been sitting in the library for a while, and i hadn't been able to get to it until all i had for gaming with my subpar spec laptop. Which Guacamelee ran beautifully on. The game is definitely changing but i would say well worth the effort. If you enjoy games that on occasion make you want to throw a controller, just so you can feel the increased payout when it works out just right. Well this game is for you. The reverse is also true, if those sorts of games frustrate you... Although the humor is hilarious, and the gameplay is great, I would say there are other titles out there more suited to that play style.",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee is a fun and adicting game, the story is quite good, the game art is exellent and the gameplay is really fun; with plenty of collectibles and 2 different endings this game deserves more than one play.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely great game. Full of humour, challenge, tight controls and deep mechanics. This game only rewards you for playing it through to the end. Some of the best platforming challenges I've ever faced with a hell of a last stage and end boss. Super recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Tons of fun, had a great time going through in coop. The platforming is pretty challenging and the combat is interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful art style, great dialog -- highly recommended for those who like platformers and street-fighter style games (albeit with a bit of a twist). However, the a controller really is needed for this, keyboard controls are almost impractical once you start getting to the very complicated move sequences.",
            "review_score": "1"
        },
        {
            "review_text": "the platforming is great the fighting is great the music is great ♥♥♥♥in 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's challenging, humorous, it looks great and you'll more than likely find yourself humming the awesome soundtrack when you're not playing the game. I picked it up as part of the Humble Bundle and had never even heard of it (I bought the Bundle for Fez and something else I can't recall). I must admit, I had no real intention of playing it. For some reason, probably because of how well it reviewed, I downloaded it and played it. I'm glad I did in the end, it's totally worth your time and money. I've only finished it on normal mode so there is plenty of replayability with hard mode and other challenges. For a guy who plays shooters 99% of the time, I was really surprised by how much I enjoyed this.",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played it on PC, but I can assure you its a damn good platformer, fun characters and exciting maps.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing title, incredibly funny..  Buy a controller just to play this title!",
            "review_score": "1"
        },
        {
            "review_text": "Very challenging metriod-vania platformer with a lot of special jumps, moves and combos. Frustrating but yet satisfying once you complete a hard jump combnation. I loved the art style and music.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game for just ~3h and i am already addicted.  The music is great, it is funny, and it is challenging but fair, combat like the jump &amp; run passages.  You get more abilities the more you play. The more you got, the more secret areas you can reach.  See anything you can't reach? Come back later. It has a teleportation system and a minimap with icons resembling the needed skills. So it is really fun to come back to already visited areas just to find that extra something.  Also features Co - op, which i didn't play so far. But i imagine it is really funny, playing this with a pal.  If you like a awesome looking, challenging, fun to play Action-Platformer with a sense of humor, this is your Game.  Oh, and you can transform yourself into a chicken later in the game. Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly challenging, but satisfying metroidvania game that is set in a Spanish Luchador setting. I quite enjoyed my time with what this game had to offer, its just too bad I got stuck on the incredibly challenging final boss. Its a great indie game that I would reccomend to anyone whos interested in the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Great platformer! It feels very responsive, the platforming puzzles are great and the art style is a fiesta. Played it local co-op so i had a blast yelling at the tv with my partner. BUY IT! also, the references to other games is cool.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun for quick beat 'em up sessions solo or with a partner. The combos and special moves are fun and the art and music are great.  However, once you get a bit later in the game the fun just vanishes in the face of incredibly difficult timing/button combo jumping tasks. Maybe I'm uncoordinated but I spent a long time trying to get through this part and only succeeded in getting ♥♥♥♥♥♥ off and ragequitting several times.  Without that BS, the game would be awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I haven't finnished playing this game and I already like it. It's colorful, has great music , has a variety of enemies and attack combos, plus it has meme references. What more could I ask for?",
            "review_score": "1"
        },
        {
            "review_text": "talking goat chickens hilarious antics  love it",
            "review_score": "1"
        },
        {
            "review_text": "Highly highly recommended. The movement and combat mechanics are amazing, and the levels are very well designed.  It's not fun without using a controller (xbox 360 is officially supported. Other controllers aren't I think). It's also much more fun in 2 player mode.  Note: if you don't like hard platformer games (like super meatboy), you probably wont like some parts of this game).",
            "review_score": "1"
        },
        {
            "review_text": "If you can stand the almost obnoxious mocking of the mexican stereotype, this is actually a enjoyable colorful platformer. As a native Spanish speaker I think the Spanish references are way too much and I expected at least a better Spanish translation. Some scenes are tedious and there's no help on how to deal with certain enemies: if you forget what a character just told you, you are screwed (though there's a helpful 'move list' on the menu).  EDIT: After playing more than 70% of the game I found that it's hard to play with the keyboard and each time you make a mistake you have to start all over. It is becoming more and more frustrating instead of being a fun experience.  Graphics: 9/10 Sound: 7/10 Playability: 4/10 Spanish puns: 4/10 Overall fun: 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Everything about this game is GOLD.",
            "review_score": "1"
        },
        {
            "review_text": "After a Halloween party at my house, we tripped the electrical circuit after trying to plug in one too many space heaters at the same time. Sadly, after this incident, my computer would no longer boot Windows or even the Windows installation disc. Fortunately, I was able to salvage all my photos, documents, and important data. As my computer was getting to be fairly old (about six years), I took this opportunity to build a new PC.  I was trying to decide which game to try out for the first time on my new system, and was greeted by an advertisement in Steam letting me know that  Guacamelee!  was 50% off. I had heard great things about the game and hoped to play it some day, though I was under the impression that it was a PlayStation 3 exclusive. Seeing this pop up on Steam was a nice surprise, so I purchased it and started the download right away.  I'll just say that it was a wonderful experience. I think it struck the perfect balance for this style of game, where it is fairly linear overall but you can explore old locations to find plenty of secrets. New abilities are introduced at a good rate, and new enemies require you to use these powers. The combat was fun as well and I liked using Juan's wrestling skills to destroy opponents.  References to Nintendo characters and random memes made me chuckle. Nothing really made me laugh out loud, but I liked all these little touches.  Final comment: Chicken Suit is the best suit.",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game. Highly suggest it if you like mark of the ninja, super meat boy or god of war. Hard mode was very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee! is a brilliant and vibrant metroidvania that stands out. Its art style is beautiful and is well met by its controls. Constantly challenging the player with new moves and changing enemies, Guacamelee! is well worth the cash.",
            "review_score": "1"
        },
        {
            "review_text": "When I get the chance to play I definitely am enjoying this Luchador game. This isn't just because I happen to prefer the Lucha to WWF, although I will admit to bias. Although this is a wrestling game I am enjoying all of the little quests and puzzles, and the quirks that each character is given.  Plus, there is a shapeshifting goat. He's got a bit of connection to a curse. Our hero stumbles onto the curse through one of the characters. With all of the nods to Los Dias de los Muertos this certainly makes it a good one to play around October/November if you enoy Halloween type things a la Mexicana.  If you are someone that has to worry about kids from 3 on up randomly coming up behind you (my children are in the older range, but some of their friends and the neighbor kids that visit are on the younger end) an thus watch what levels of violence are in the games you play then you don't have to worry much about this one. It's not setting off any 'oh gosh I can't let the kids see this one' bells. It's actually got a very nice child-like flair to it, similar in design to that Lucha cartoon that was so popular several years ago.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game!",
            "review_score": "1"
        },
        {
            "review_text": "An accurate simulation of mexan life  Recommended",
            "review_score": "1"
        },
        {
            "review_text": "This game is stuffed with eastereggs, some obvious, some less obvious. It features a lot of funny conversations and wordgames. The battle system is fun and everyone probably has his own playstyle (mine is throwing enemies around like crazy xD). The story is funny and sad at the same time, the characters are fitting their role and the maps are fitting as are the enemies. The difficulty-curve is really balanced out and the puzzles are fitting their area. Also features quite some useless yet funny achievments =P Features a Hardmode, unlocked after beating the final boss of the game.  Oh, and you should really check the Workshop out to find some models fitting for some of the eastereggs   (Talking about the TF2 Cast, Samus and Mario)    =P And you'll probably make a deal with the devil for this game =P",
            "review_score": "1"
        },
        {
            "review_text": "The combat in this game is actually a lot of fun. The combo system is pretty versatile (independent moves that can be chained pretty well). I got to feel like I was beating the crap out of dudes all of the time without feeling like it was too easy. The script is pretty funny, and there are some crazy platforming puzzles/challenges in there too. The really hard ones are optional. Best with a friend! Yay for co-op!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the few games I've played that immediately hooked me and kept me playing until I finished it without ever pausing to play something else for a few hours.   If you're looking for a game that fuses Metroid-style exploring with solid side scrolling combat and a unique art style - plus plenty of in-jokes, Easter Eggs, and pop-culture references, this is well worth buying and is sure to satisfy you.   If you're looking for a game that lets you cook delcious pastries and serve them to an eclectic group of customers in a downtown LA store, this will likely disappoint you.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Metroidvania style game with catchy graphics, and music. I highly recommend this to anyone who likes games of the metroidvania style!",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game--the music, the graphics, the story, the platforming puzzles a la Meat Boy, the battles, the side-quests...I've only completed part of the story, and I already know that I'll want to play this again in Hard mode (this fact has also been endlessly entertaining for my husband, who is pretty surprised that I've stuck with a game that has a significant component of beat 'em up in the mix!)   Also, props to the devs who have made it possible to play in the guise of a lady luchador! And, Pollo Power wins EVERYTHING.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee! Spicy Racism at it's finest. You will ♥♥♥♥ your pants with excitement, and from the Mexican food.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice soundtrack and original style!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent local co-op game.  Ive been playing this with my girlfriend and we´ve had so much fun so far, great local coop and fun game, cool colors and graphics and nice soundtrack. If you like games like Rayman this is your choice!.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! Classic platformer in the style of Metroid/Castlevania. Excellent stylized graphics and great gameplay. I would recommend this to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the best indie games out there, especially if you already played this on PSN (PS3 and Vita) and await the upcoming PS4 and Xbox One release. If you like beat-em-ups, then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Great mixture of Castlevania, Zelda, Metroid and many other classics. Great sense of humor and plenty of fun to play. It can be as challenging as you want it to be and seems to have lots of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "Very funny game! Many new things to do. Nice colors.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, great graphic, gameplay is simple and fun!",
            "review_score": "1"
        },
        {
            "review_text": "Finally! A game that let's me live my lifelong dream of suplexing chickens!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic platformer with a lot of charm and clever mechanics. The graphics are fresh and colorful. Absolutely a joy to feast your eyes on no matter what game screen you are on. Combat is getting used to. It's all about timing. If you love platformers, this one cannot be excluded from your collection!",
            "review_score": "1"
        },
        {
            "review_text": "Such a cheeky and original game!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best metroidvania games I've played since Metroid Fusion. Just about every aspect of this game was a blast, from the gameplay, the art style, sense of humor, and fantastic taste in music...  Just play it, worth the price. It'll make ya say 'I'm gonna puma pants'.",
            "review_score": "1"
        },
        {
            "review_text": "A really nice metroidvania. It's a bit too short though, and i managed to defeat the final boss without getting touched. I never replayed it, so the replay factor didn't work for me, i guess^^  The artwork, music and funny moments are there, btw. Give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "A friend and I killed 12 hours (practically) 100% ing the game on normal (before i had on steam), totally worth it. It's just too much fun coop with all the jokes and is it probably one of the smoothest side scrolling games that i've played.",
            "review_score": "1"
        },
        {
            "review_text": "very mexican olay!",
            "review_score": "1"
        },
        {
            "review_text": "5/5 Great music, art, controls, gameplay, characters and humor.",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee, the fun, metroidvania platformer we've all been waiting for! I've heard great things about this game for a good while, but never decided to buy it. After buying it I can say that it is worth every penny. I'm a huge fan of platformers so this game was a treat to play. I rarely do this, but I give Guacamelee a 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "HIGHLY recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Metroidvania style game with catchy graphics, and music. I highly recommend this to anyone who likes games of the metroidvania style!",
            "review_score": "1"
        },
        {
            "review_text": "Clever humor, excellent music and a robust combat system. What else do you need? Oh, and you happen to be a luchador. NNAAACCCCHHHHHOOOOOO!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Title: PLEASE MAKE ANOTHER GAME  Pros: - Metroid - Very fun such wow - Runs very smooth - Difficulty is just right, normal is normal and hard is hard and difficulty curve in both modes are just right - Fast paced  Cons: - EDIT: Final boss too easy on Hard difficulty, 2nd and 3rd took my 45 mins and final boss was 5 mins - It ends - No support for multiple save files (I need 3: Normal, Hard, Co-op with my gf), you can still copy and rename the save files etc - I guess Online co-op would be really hard to pull off because how fast this game is, it would bring the sync hell, but still...  Missing: - (Assumption) Ability to create challenge levels within workshop  I defeated first 3 major bosses in Hard recently, most fun boss battles I ever had I'm not a very good gamer, I fail at MANY games I have to play most games on Easy and on some games even that doesn't help, but even I can progress at Hard difficulty in this game so people saying difficulty is unfair are probably trolls",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Tons of fun.  Controls are tight and responsive. Move list is huge combos are satisfying. Levels are expansive and fun to play.  The puzzle rooms are a joy, not a burden.  This is about as good as it gets folks.  I'm not even a fan of the whole Mexican Luchador theme, and still I couldn't put this down. Not knowing what the spanish words meant was kind of a bummer, but added to the overall feel of playing a Mexican game.  Be prepared to laugh every 30 minutes or so. Not the '*chuckle chuckle* I see what you did there' kind of laugh, but the genuine laugh out loud.  This game includes throw backs to more old school platformers than I can list here. I won't spoil the surprise by listing any, but if you like platformers and have played them NES to current day, you will recognize so many things.  for instance I noticed nearly every screen of an entire section of the game being a copy from an older platformer game. You might think that would be a negative, but to me it was simply a joy.  I could go on and on, but suffice to say this game is awesome.  Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and Fun Metroidvania with Luchadores!",
            "review_score": "1"
        },
        {
            "review_text": "A+ geargate game. Fun combat, fun/challenging platforming, neat artstyle, and really funny writing. Occassional stunlockage gets annoying, and some of the bosses are just a little bit ♥♥♥♥♥♥♥t, but otherwise just a really great game. Kinda short though, only 13 hours to 100% it.",
            "review_score": "1"
        },
        {
            "review_text": "this is my type of game :)",
            "review_score": "1"
        },
        {
            "review_text": "this game is quite fun",
            "review_score": "1"
        },
        {
            "review_text": "A great Metroidvania style game. The challenge rooms near the end can make you redo them multiple times to get gold ranking. The only drawback I can say is there is a learning curve to pull off a chain of combos.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious, ridiculous, and crazy fun. Guacamelee is what you get when you implement Super Smash Bros-esque controls in a Metroidvania game. I played through the whole game co-op with a friend in one sitting, and it was fantastic. The main quest is short, but there are a lot of sidequests and collectibles scattered here and there to keep you entertained.  Praises: + Comedic gold. The characters and dialogue are pretty ridiculous, and there are a plethora of references to internet memes/jokes. + Simplistic art style, vibrant colors, and smooth animations. What's especially nice is the strong visual contrast between the world of the living and the world of the dead. + Challenging puzzles, both in solving and executing. + A pretty steady learning curve. By the end of the game, you have a lot of different moves and abilities at your disposal, but they are presented to you one by one throughout the course of the whole game so you aren't overwhelmed. + Two-player co-op is drop-in/drop-out style; great for old-fashioned 'come over and play this game with me' fun.  Criticisms: - A controller is basically a requirement to play. Trying to play with keyboard feels awkward, and you have less precise control of your throws (limited to the 8 directions of WASD as opposed to the full 360-degree control of a thumbstick) - Many of the level designs are far too difficult for both players to coordinate. Most of the time, it was much quicker and easier for one player to turn themselves into a bubble so the other could navigate the level. - I personally don't see this as a huge issue, but an online co-op option would be nice.  All in all, Guacamelee is a fantastic beat-em-up game that will keep you laughing behind your luchador mask.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent platformer/beat-em-up game with a vivid artstyle and catchy electro/mariachi soundtrack. The fighting is very fluid in the game, with new moves introduced as it progresses and makes platforming a lot more fun to do as well.  One word of warning though: there are quite a few instances of bright flashing colours appearing when you get powerups or new moves, so you might want to beware if you have epilepsy or previous experiences with seizures.",
            "review_score": "1"
        },
        {
            "review_text": "I don't normally play Metroidvania games, but I decided to pick this up. Turned out to be one of the better games I've played. The controls are very responsive and the moveset feels natural. Each special move serves its purpose, both in combat and while platforming. The music and art style fit great with the rest of the game and the all the background references to other games are just enough without going overboard. Some of the boss fights seem a little unfair at first (especially on Hard Mode), but after paying attention to the fight, you start to understand what to do - just challenging enough. All in all, this was a really fun game, though a bit short. I would recommend this game to anyone looking for a fun game with some challenge. Note to new players: learn the importance of dodging, you'll need it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun platformer/beat-em-up with a neat graphical style. Gameplay-wise it's nothing you haven't played 1000 times, but it has a lot of charm. I like that you can choose a male or female character, and there are several skins you can unlock for them. The game's overall theme is a caricature of Mexican culture, which some may find to be racist. I won't debate that either way, but I'd put it at about the same level as Speedy Gonzales cartoons - if you found those offensive, then maybe you should give this game a pass. Possible racial implications aside, it's a fun action game. Make sure you have a controller, as some of the moves are difficult to pull off with a keyboard. ",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic platformer.",
            "review_score": "1"
        },
        {
            "review_text": "COME ON AND JAM  AND WELCOME TO THE SLAM",
            "review_score": "1"
        },
        {
            "review_text": "Super fun game with lots of extra content and varied gameplay. As someone who normally doesn't enjoy beat-em-up style combat, I was surprised by how strategic it ended up being, and found myself looking forward to future enemy encounters. As someome who normally does enjoy indie platformers, this game stepped it up with Metroidvania-style levels that forced you to use not only jumping skills, but combat moves and speical abilities in order to progress. A great game all around, and one that I would definitely reccomend to anyone looking for either a modern or classic platformer/beat-em-up.",
            "review_score": "1"
        },
        {
            "review_text": "I want to like Guacamelee. I really do. The Developers did almost everything right. The art style, animations, soundtrack, sound effects, and humor are all top notch. But there are a couple of major problems that hold this game back. The lesser of the two evils is the level design. For the most part, the side puzzles are clever, and the rewards for completing them make them feel worth the effort. However, I can't say the same for the required puzzles.   Much of the later half of the game is vertically oriented, and eventually the game seems to degenerate into a very sloppy platformer. There are few things more frustrating than almost making it to the top of a series of very tiny platforms, only to have one of the many enemies that have started chasing you (as there's no room to fight them) hit you, resulting in knockback the likes of which hasn't been seen since the original NES Castlevania games, and send you all the way back down to the bottom.  This brings me to the more dire of the game's issues: the controls. As another reviewer mentioned, the game starts off with very tight, responsive, and just generally great controls. But as your move pool increases, you increasingly feel like you're in the game. And by that, I mean that it feels like you're wrestling your controller. There are a pretty decent amount of moves at your disposal by the end of the game, and as which move you use depends on which direction you're moving the control stick, pulling off the right move while moving and trying to dodge can be a hassle.  Also, a quick, slightly-spoilery, albeit non-specific complaint about the story:    The endings (yes, both of them) are huge letdowns. Especially after the journey to reach them.    And now for the good parts:  Despite my criticisms, the first half of the game is one of the best metroidvania games I've seen in a long time. The amount of hidden collectibles is incredible, and as I've stated before, the optional puzzles are incredible! And it has the benefit of having something that very, very few PC games seem to include these days: local multiplayer. With steam increasingly pushing Big Picture mode and couch gaming on PCs, Guacamelee is finally giving those of us PC gamers with a social life something we've been longing for for a very long time: a game we can play with friends in the same room (without forcing them to drag their rigs over to our houses). Playing with a friend can reduce the frustration caused by the aforementioned problems, and I'll be honest, it's just plain fun!  Overall, despite the control and occasional level design issues, the game is worth playing, especially if it's on sale, and you've got someone to play it with! I might not recommend it at full price, but it's definitly an enjoyable experience.",
            "review_score": "1"
        },
        {
            "review_text": "Well that's a good game. It's challenging, hard and unforgiving where it needs to be, has stunning vibrant colorful awesome graphics that entwine smoothly with the story; the control scheme is broad and a little confusing at times, but acceptable. Maybe a bit short (I've almost finished it in about 10 hours, with every side quest apart from the really long ones) and with a really little replay value, but a great experience nonetheless. 85/100",
            "review_score": "1"
        },
        {
            "review_text": "This game reminded me of the side scrollers of old including how hard it was. Very fun game with lots of interesting enemies. The final boss was by far the most annoying/rewarding boss to defeat. I would recommend this game to anyone that grew up in the 80's and early 90's and were used to hard side scrollers such as mega man.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished this game last night and I have to say I really enjoyed it. Coming off of Dust: An Elysian Tail before this, both of these games were great MetroidVania-style games, both felt different while not straying too far off the path.  - Environment on this game is a little sillier without making it feel stupid - Love the cartoon-like art style Makes the characters actions and story feel more believable. - Combat system is easy to pick up, and while they can show you many combos with the moves you learn throughout the game, I was able to kind of create my own and play in the action my way, in a sense. - While I don't feel that this game has a lot of replayability, there is quite a bit to do while you are playing it and you can beat the game and go back and finish it if you are up to the challenges. - Some of the platforming is HARD AS HELL... and I loved it! It is one of things that made me come back for more. - Not to forget, there are little Easter Eggs everywhere, paying homage to great game titles and internet memes.  If you like games like Metroid and Castlevania, this is one to pick up, I definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This is where the reviews really help; I saw this game, but wasn't sure about it. Then, I read the reviews and most were positive. This is a side-scrolling game that is a lot of fun to play. The graphics are different, but beautiful and give the game its own style. I'm a mouse and keyboard player, but after playing about five hours decided to try an xbox controller as it was recommended. The controller definitely made a difference by making the moves in the game easier to input. I would recommend this game as it has a great art style, has some great platforming puzzles to get through, and is a lot of fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome platformer that plays like Super Metroid. Funny references to other games. Easy to play with a controller. Grab this game on a sale, and you will actually play it =P",
            "review_score": "1"
        },
        {
            "review_text": "Brawl your way through the realm of the living and the dead to try and save the love of your life or is that afterlife!  A wonderful brawler with interesting special attacks, great costumes and skills to buy as well as beautiful artwork. The story line allows you to visit new areas while at the same time helping you to unlock skills, find side quests and see the world in two different ways as you build up to the day of the dead.  Even as an unexperienced player to these games i found it fun and possible to play even if a little more challenging. It also has challenges for the more serious player with the different levels and puzzle rooms that you need to lucho through.   A beautifully made game that is well worth a play! :D",
            "review_score": "1"
        },
        {
            "review_text": "This is the most Mexican game you'll ever find, despite being made in Canada. It's a great one; the controls are tight, the difficulty felt just right, the visuals are stylish and the world is filled with subtle references to other games and internet memes. If you're remotely interested in platformers, definitely go for this one. My only regret with it is having waited half-a-year after purchasing it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Fun platofmer with lots of luchador action",
            "review_score": "1"
        },
        {
            "review_text": "is a very nice game, art style and gameplay. Level design can be improve a little bit, give some more challenge to player. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is really great. Vibrant Day of the Dead themed 'Metroidvania' with a fantastic combat system.",
            "review_score": "1"
        },
        {
            "review_text": "So when I started considering whether I should recommend this game or not, I realized just how split my opinion on this game is. While I enjoyed most of it, there was a huge spike in difficulty at around the 4-5 hour mark (well, 4-5 hour mark for myself) whereas the enemies weren't the issue - it was the platforming. There was a point when everything so far had been smooth sailing when it came to the platforming and suddenly the flow came to a stop because I had to perform the platforming only to fail - but mainly just to see what's ahead. And so I had to pause the game and think about how to proceed. It really halted my enjoyment because... I actually had to stop playing for a minute or so every once in a while. And it was boring. With that being said, the platforming then takes a huge dip in difficulty as well, when you gain a couple more powers that really improve the flow again. Just know that there's that one section which will probably make you stop... and think.  I must say though that I was pleasently surprised by how tight the controls felt - on a keyboard. Normally, platformer games tend to be rather clunky and nearly unplayable on keyboards but Guacamelee nailed it, in my opinion. And it's not just the controls for general movement. Even the controls for fighting felt incredibly responsive and I had no issues whatsoever pulling off some rather effective combos (though do keep in mind that I'm terrible at pulling off combos in every game, ever...) So yeah, the controls really felt good and if the fact that you haven't got a gamepad puts you off, then I'll tell you right now: 'Don't worry about it, brah, 'sall good.'  The story is very cute. The characters are very interesting. Though one of the villains did leave me a bit disappointed since you had very little interaction with him beyond the occasional warning and I feel like a bit more backstory would've solved that problem. I would also say that there's another character who gets you out of a rather tight spot who I would've liked to see more of - mainly because when I found out who he is, I chuckled and imagined some rather interesting future interactions.  With all that said, I feel like this game is worth a playthrough. I didn't really feel compelled to play through it again on hard mode nor to get the alternate ending (though that's mainly because I imagine that I'd have too hard of a time obtaining the final 2-3 orbs), but definitely worth that one playthrough. That's all for me, folks.  Sincerely, Crayt",
            "review_score": "1"
        },
        {
            "review_text": "A side-scrolling, platform beat-em-up with a lucha libre theme and a mariachi soundtrack.  That's a winning combo in my book.  This game is a hell of a lot of fun and the alternative skins that the community has made just top everything off.",
            "review_score": "1"
        },
        {
            "review_text": "Great level design, combat, and soundtrack. Although, I have no idea why the developers thought that inserting 'le totally epic maymays' into this game would benefit or enhance the game-player's experience, as the 'memes' mostly distracted me and appeared extremely out of place. Reddit humor aside, Guacamelee is still a fun metroidvania-style game that deserves a playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "You can wrestle chickens in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Anyone who grew up with a Super Nintendo owes it to himself to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "The only metroidvania game on steam that isn't a dime-a-dozen clone",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Beside the boring intro this is an amazing game! Great art, good humor, fun gameplay. You get to suplex esqueletos! What more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "A totally awesome game with lots of love and humor in it! The force is strong with this one!",
            "review_score": "1"
        },
        {
            "review_text": "You're a tequila farmer who must save the president's daughter from a villain worse than the devil. You die and come back from the dead as a masked luchador (like any normal tequila farmer) ready to save the day. This is a fun platformer with a brawler twist that encourages exploration. You'll notice many references to video games and even get a good laugh or two from this fun and engaging title. After you beat it, you'll have the option to play on hard mode (which is legitimately hard). There's also the inferno: a series of challenges that test your skill at the game.  Steamworks is a nice touch and it lets you use custom skins for your character. There's something gratifying about playing as Johnny Bravo. There are many skins and more to come in the workshop. The game also features local co-op. You can play with a buddy if you have a pair of controllers and a tv to hook up to.  I got this game on sale at the humble indie store. If you have some extra cash and are looking for a good time, I would definitely recommend this one.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my god, this game is amazing. I cannot count the bazillion references the devs managed to smuggle into the game. But that's just one of many things that makes clear how much effort and love has been put into the game. The game features a unique story plus awesome artwork. Soundtrack is a bit repetitive but high-quality - it's just that you have be open for the hardcore-mexican audio experience. Difficulty is above-average but way below Super Meat Boy - it's always fair and will never cost you too much nerves. And the general game style is Castlevania/Super Metroid, i.e. 2D RPG jump'n'run action sidescroller, without too much RPG. It's been on humble bundle the third time as of writing for a reason.",
            "review_score": "1"
        },
        {
            "review_text": "A great game! I got it on Steam sale and haven't stopped playing it!",
            "review_score": "1"
        },
        {
            "review_text": "is a really really good game, i havent played it that much, but i love al de internet references like de memes and the way they make tribute to another game characters in a luchador form",
            "review_score": "1"
        },
        {
            "review_text": "An amazing, colorful, funny and entertaining metroidvania style game with a lot of replay value.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun, and the writing is silly. Some of the optional/secret platforming sections are really difficult. As such this game made me feel bad about myself and my ability to play games. I highly reccommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm surprised this game isn't more popular. Or maybe it's just my Metroidvania obssession that is telling me it should be more popular.  This game isn't really anything too different. It's your standard Metroidvania game with similar obstacles, powerups, and layout, only everything is a joke. Goat Jump? Goat Run? Goat Fly? These are your powerups, which you get from a goat, obviously.  What really stands this game out from the rest is it's art style, music, and sense of humor. The combat system is fun once you get the repetitive nature of keeping your combo up and learn all of the special moves and grapples.  There's also a ton of hidden things to find (including a handful of references to other games/movies) and a few challenge areas, just to take that silly edge off and remind you this game can be challenging.  All in all, a short fun little game that you will highly enjoy over a weekend.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game during the Steam Holiday Sale 2013 and I have to say that it is pretty freaking awesome. I definitely is a play on Metroid. You learn new abilities from Metroid-looking alters that are hidden in secret areas. There are tons of hidden areas in the game only reachable with your newly learned abilities. There is a good learning curve too: when you progress through the game they add new layers of difficulty that make the game much more difficult. There are harder enemies, harder jumping mechanics (you jump a LOT in this game), and harder bosses to kill. This a 2D masterpiece too with its own personality. I highly suggest picking this up if you're a Metroid fan. DO IT.",
            "review_score": "1"
        },
        {
            "review_text": "Metroidvanias are a dime a dozen. Metroidvanias with this kind of charm, attention to detail, and intricate fighting system are decidedly NOT a dime a dozen. This is a short review: Get it. You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Try this salsa flavored Metroidvania style game. Pure awesomeness!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun platformer. Well balanced difficulty throughout the game. Lots of hidden things to find and awesome graphical theme.  Well worth the time and money!",
            "review_score": "1"
        },
        {
            "review_text": "This game was among only a few that was able to pry me from multiplayer-only games. It's a great platformer, and easy to pick up and play casually. Has a lot of great dialogue, most of it just being funny. It's challenging enough to make it frustrating at times (in a good way), but rewarding all in the same. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "If you have ever enjoyed a Metroid or Castlevania game, you'll love this one. All around great and funny game.",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee is a really colourful and funny 2D platformer that engages me with its rapid and never dull combat gameplay.   It portrays a very simple storyline with many interesting elements inside. I bought this game off steam after reading through the reviews and recommendations and would like to share my own as I really love this game.  If you are looking for simple games like Mario, then you will be in for a shock. Platforming through the map requires frequent button mashing and quick thinking. It is easy to get frustrated initially due to the difficulty of navigating through the map, just for 1 simple treasure. However, once you get the hang of it, you would want to challenge yourself more!  Also, the combat system is really interesting. Just when you thought that the enemies are repetitive, you get shields on them which only certain moves can break them. You get enemies which you have to switch dimension to attack. You have to dodge, jump and wack your way through some stages.   I really love this game a lot and would certainly recommend it to everyone. The story is wackily simple with interesting characters like a GOAT, who teaches you moves, enormous chickens, skeletons and also my fav flame face.   Check this game out and hopefully, you will find it fun too :)",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly fun sidescroller beat-em-up! You have to pick this up!",
            "review_score": "1"
        },
        {
            "review_text": "Metroidvania-style game with a luchadore theme. The animation style works really well. Pro-click.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platformer/beat'em up games I've ever had the pleasure to play with.  A hidden diamond.",
            "review_score": "1"
        },
        {
            "review_text": "Do you have an Xbox controller or nah? Ok then",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the more unusual games I've ever played, but definitely one of the more fun ones.  A beat 'em up thats simple to pick up yet difficult to master with the theme of a mexican luchador fighting the forces of the land of the dead is unique enough without the humor, the wonderful art design, the excellent animation, the clever puzzles, and about fifty video game in-jokes and counting.  I'd highly recommend this one. If nothing else just for the sheer fun of suplexing skeletons into bone dust.",
            "review_score": "1"
        },
        {
            "review_text": "Very good melee platformer in a clean and crisp Mexican art style centered around a hero who finally becomes a Luchador. The controls are tight, enemies are varied, and platforming is fun(especially once you start getting more powers and abilities). ive never really cared for Mexican/hispanic/w.e music, but this music is good and compliments the game perfectly. Recommended for any lover of platformers",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platformers I've played in recent memories. There are times when you want to throw your controller, especially if you're trying to 100% the game (Tule Tree, Sierra Morena orb levels, I'm looking at you), but the games tight controllers and well thought out mechanics save it from being TOO frusterating. After getting 100% in normal mode, I was able to breeze through hard mode because all the challenges the game had to offer honed my skills.  If you like Metroid-vania platformers, you'll love Guacamelee. Spent 20+ hours in this game. Don't regret a single second of it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with some really cool easter eggs and things to notice. If you like luchadores,you will enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "With incredibly smooth gameplay and comedic characters, this game is a joy!",
            "review_score": "1"
        },
        {
            "review_text": "The very definition of 'short but sweet'. This game is a mix of Metroidvania-style progression, beat 'em up combat (with a pretty deep combo system), and some pretty challenging puzzle-platforming.   As far as Metroidvania games go, this has to be one of my favourites; the pacing is excellent, combat is very fun, and the platforming is challenging without becoming excessively frustrating. Also, the game has a unique and striking art style, some great humor, and plenty of in-jokes and references to other games.  The game only took me around 5 hours to complete (without finding all the secrets), but I loved every minute. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "For a sale price, the game is great. At normal $15 price, you're getting somewhat ripped off. The game itself is short, as is the standard of these types of games. However, the level design is simple, and the secrets are very 'meh' at best.  Still, the music, gameplay, graphics, etc. all make for a fantastic package. It's just overpriced. Don't buy it for anything under 50% off.",
            "review_score": "1"
        },
        {
            "review_text": "This game is in a similar style as the side scrolling versions of Metroid, but with a more comical art styling. I absolutely loved Metroid, so I found this game perfect for me. While I was not as immersed in this game as Metroid, Guacamelee was waaaaay more fun!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Great style and animation, great music, and most importantly great gameplay. Combat is pretty simple and intuitive without needing to memorize long combos, but still has a fair amount of depth. It just flows very well.  Very little to complain about until toward the end of the game. Most of the few side missions are simple and not terribly interesting. A couple of the optional platforming segments are frustratingly difficult. Final boss fight was a bit of a letdown.  Overall a great game. Approachable for many players, but with a lot of room for skill.",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee Game so fun, you must try this :))",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, graphics and music blend perfectly, reminds me of Shank but this one has no gore. Quite surprising for an indie game. Well done too!",
            "review_score": "1"
        },
        {
            "review_text": "Fun, challenging at parts, and addictive.",
            "review_score": "1"
        },
        {
            "review_text": "This is a super fun game, fun characters, fun story, fun acts and fun ♥♥♥♥... The combat is deep and the puzzle is fun with a good difficulty control 超级有趣的游戏 战斗爽快有深度，解密也很有意思，你会在某些关卡抓狂的，嘿嘿，不过过了之后很有成就感",
            "review_score": "1"
        },
        {
            "review_text": "A stylish and ironic game, very fun to play!   Just beware that after a few hours of gameplay the game steepens its inclination toward the platform genre , so if you are a bit clumsy when it comes to precise and timed jumps you might be in for a challange (not necessarily a bad thing ofc...)",
            "review_score": "1"
        },
        {
            "review_text": "If you like action-platformers I could not recommend this game more. It's beautiful art style, entrancing music, and tight controls all blend together to make this game a fantastically enjoyable experience. Fans of Cave Story and Metroid, as well as everyone else, should be happy to punch their way through this side-scrolling open world that actually feels fluid. This game is definently worth its $15 price tag and if nothing else pick it up simply to feel like the world's most bad-♥♥♥ chicken.  BUT, please only pick this up if you are not prone to siezures as the game is one giant orgy of flashing lights.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome little platformer with a unique art style that is difficult enough to keep you coming back for more, but not impossible. It gets progressivly more satisfying to play with the use of unlockable moves and hard challenges you won't believe are actually possible. Controls are smooth as silk and there are even a few nods to other popular indie games throughout its comedy. I would recommend this to someone who loves old school platform games that would like a bit of a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "firm but fair",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful looking game. Great for anyone who likes games like Metroid or Castlevania. Nice story with awesome characters and witty dialogue.",
            "review_score": "1"
        },
        {
            "review_text": "Really Neat game love the fighting...but the platforming is killing me. sometimes it seams like ik what to do and then it turns out to be something else. Controller Strongly advised.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a huge fan of brawlers, but OMG thins game is amazing. The humor is amazing, the fighting fells good, and the platforming is smooth. Some people world need a controler to play, but I had a fun time with a keyboard. Awsome game, highly recomend.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible! Not only has it prevented me from losing my virginity, but it has also helped me develop into the 45 year old transgender shemale I am today. If it wasnt for Guac I would be forced to follow my normal routine of masterbating 12 times a day every two hours. Generaly my ♥♥♥♥♥ is on the verge of falling of after a week of hardcore masturbating. With the help of this time consuming game I've managed to curb my masturbation routine to just 5 times a day! I'm much happier now and my ♥♥♥♥♥ a lot happier as well. I would recomend this game to anyone who has absolutely no life and cant manage to stop playing with their skin flute.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wondered what Castlevania: Symphony of the Night would be like if you were in Mexico instead of Transylvania and you were playing as a Luchador instead of the son of Dracula?  ....no?  Well, here it is anyway. And damn, is it fun. It may not be a very long game, but it's worth every moment.",
            "review_score": "1"
        },
        {
            "review_text": "It's a flying elbow of the high ropes! Can't get enough.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite indie game of 2013. Combines awesome combo-based action with interesting Metroid-esque exploration!",
            "review_score": "1"
        },
        {
            "review_text": "Great metroidvania style game. Just gets better the farther in you get.",
            "review_score": "1"
        },
        {
            "review_text": "a very great game. strong combo mechanics, great puzzles, platformer!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best metroidvania games I've played since Metroid Fusion. Just about every aspect of this game was a blast, from the gameplay, the art style, sense of humor, and fantastic taste in music...  Just play it, worth the price. It'll make ya say 'I'm gonna puma pants'.",
            "review_score": "1"
        },
        {
            "review_text": "Hot damn, what is there to say about Guacamelee? Well, for starters, it's amazing to play and controls are faaaaaaaaaaaaaaantastic. With all the easter eggs and poking fun at classics games (and a few memes), it's a fun blast running around and suplexing the hell out of enemies.  10/10, would buy again.",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly good platformer/brawler. The art style is simple but well utilized and worth the price. The humor is great, the abilities are smooth and the combat is engaging. There is local co-op and, while its fun to play with someone else, the second player makes combat nearly trivial while simotaniously creating a major handicap to the platforming aspect. You often have one player pop out (which is smoothly implimented) during most non-combat areas. A good 4/5 and worth up to $15",
            "review_score": "1"
        },
        {
            "review_text": "This was a good platformer that had a lot of satisfying moments. There were a few times when the platforming got difficult for me, but the checkpoints are nicely placed and so it wasn't frustrating. The combat is just OK.",
            "review_score": "1"
        },
        {
            "review_text": "Tons of fun, had a great time going through in coop. The platforming is pretty challenging and the combat is interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game. Challenging and satisfying combat and platforming, and you can play as a chicken.",
            "review_score": "1"
        },
        {
            "review_text": "is good mexican game.",
            "review_score": "1"
        },
        {
            "review_text": "Its melee Metroid, its Mexican, its $15, and its also very very pretty.",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee is a blast! Anyone who picks this game up will thoroughly enjoy it! A suggestion I have is to defninitely play with a controller",
            "review_score": "1"
        },
        {
            "review_text": "This Game impressed me. Everything is prefectly in-theme, the levels are well thought and the difficulty curve quite manageable. If you like fighting games mixed with some clever platforming, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "A really nice metroidvania. It's a bit too short though, and i managed to defeat the final boss without getting touched. I never replayed it, so the replay factor didn't work for me, i guess^^  The artwork, music and funny moments are there, btw. Give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "This game turned out to be better than I expected. It's quite fun to play, you can unlock sweet abilities over the time, it has some nice challeging bosses, not easy enough to make you bored, not hard enough to make you quit. Plus some custom outfits, including steam workshop ones. To sum it up, try playing it coop, you like it even more.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting art style and story setting.  Lackluster story constantly trying to make you laugh and failing miserably most of the time.  The platforming mechanics are OK, however the controls aren't the tightest around.  The combat is relatively simplistic and most of the fights can be easily won simply by button mashin.  6 ½ / 10",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Fun to play, fun dialogues. Cool pop references (games and memes). Nice game art. Nice SFX. Excellent gameplay. Buy it without fear, you'll love it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Really fun story and wrestling references. Beautiful art. Definitely worth a playthrough, especially if you are a wrestling fan or a 'Metroid-vania' fan.",
            "review_score": "1"
        },
        {
            "review_text": "Fun.Fun. Fun. Just a good platform game with a good storyline and fun graphics. You can't lose with this one.",
            "review_score": "1"
        },
        {
            "review_text": "Wondeful Metroidvania with a super tight combat system and responsive controls (if a little oddly strewn about on the controller). The sense of humor is amazing as well with references to other video games everywhere (as well as to a few memes...). Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "a lot of fun in co-op, the perfect game for chilling on a couch and playing on the tv with a controller. but the co-op option doesn't appear until after you play through a few rooms in single player. i thought it just wasn't there.",
            "review_score": "1"
        },
        {
            "review_text": "What you get from Guacamelee (love the name) is 2D Metroidvania platforming galore. The story is silly, like a mexican b-movie, which isn't too bad. The graphics are real eyecandy, the designers did an excellent job here. The controls are very direct, your character reacts immediatley to your input.  The level design is visually really great, but difficultywise a bit unbalanced. I must admit, that I stopped playing after I put about an hour into a single screen, where I died over and over again.   Recommended if you are up for a real challenge. Sometimes a bit too unforgiving. Rating 8/10 - Good game",
            "review_score": "1"
        },
        {
            "review_text": "Hours of fun to be had with this game. Controls are chunky yet so smooth, even with keyboard. The storyline is impressive, but could be vastly improved. Don't expect an amazing ending. The game itself though is great, with great combat and fighting mechanics and button mashing fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Metroid-vania game! Originally released for PS3, plays very well on PC. I used my 360 controller, but keyboard will work just as fine. Lots of challenging puzzles and homages to the old-school NES days. Supports 2 player co-op too!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best platformers with the metroidvania style of level design. Great soundtrack, great humour, everything is GREAT!",
            "review_score": "1"
        },
        {
            "review_text": "This game is freaking amazing. Fun gameplay that is challenging and anjoyable, tons of good subtle references, and great visuals and story. Check it out if you haven't already!",
            "review_score": "1"
        },
        {
            "review_text": "A fun and stylish (if a tad linear) Metroidvania-type title with a good combat system and a gimmick (ligh/dark world switching) that adds to the game without taking over it. It's also affordable, has good visuals, and even official speedrun support! An unequivocal recommendation from me then.",
            "review_score": "1"
        },
        {
            "review_text": "goty whatever year it came out",
            "review_score": "1"
        },
        {
            "review_text": "Up there with Rayman Origins in terms of gorgeous visuals, insane fun and simply top notch platforming.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice soundtrack and original style!",
            "review_score": "1"
        },
        {
            "review_text": "Very funny game! Many new things to do. Nice colors.",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee! is wrestling, sidescrolling platformer, high-paced, RPG/light, arcade fighting game packaged in a VERY colorful piñata shell. What I think is hilarious is that it's a Canadian dev team that made this game.  Starts off very easy, then gets somewhat difficult *solely* because sometimes it's hard to pull off the timing in the moves. There's a game mechanic in which you have to alternate between two different 'dimensions' which is difficult to explain without giving away too much of the story. Speaking of which, is pretty much on par with the Super Mario's story. Serviceable but not a lot of depth. BTW, you can morph into a chicken... Which is actually way more awesome than it sounds.  Game is a little too try-hard in terms of humor, but that's all subjective I suppose.  I can't stress enough, gameplay requires you to have lighting-fast reflexes or you will be forced to play through a lot of areas twice or more until you get it.  The level design is very good. It's challenging but not over the top. The game is pretty short if you're good at it. Which is good because it gets repetitive fairly soonish.  Everything is ULTRA colorful to the point where it kinda is an eyesore (people who get a new ability or challenger know what I'm talking about).  Music is amazing. Hope you like Spanish guitar and trumpet stabs. ;-)  8/10 Would luchador again.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game for the first several hours. After that, it got increasingly difficult to the point where each puzzle could last for 15 minutes or more. I believe it'd be more fun with two people, as you could have someone to share in your agony. There is only local multiplayer, so you have to have a controller or two to play with a friend. I believe that what could make this game perfect is if it were to have online multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this game. The art style is great, controls are tight (using a controller, don't use a keboard), combat is fun and varied and the platforming is great. The puzzles are satisfying to solve (similar to super meat boy) but not too hard. Plenty of secrets and reasons to play through again.   Would recommend, andd I was pleasantly suprised as to how much it sucked me in.",
            "review_score": "1"
        },
        {
            "review_text": "awesome 2d platformer! controller is a must though",
            "review_score": "1"
        },
        {
            "review_text": "Played: Feb 2014 Pros: + Very comfortable controls that allow you to move intuitively (with controller) + Interesting visual style Cons: - Feels very short - Some enemies get very stale by the end - Story starts promising and ends nonsensical  This game bills itself as a “metroidvania” type platformer, and let’s face it: it pretty much is. Some areas are inaccessible until the correct special movement is unlocked, but ultimately there aren’t that many special moves, so many areas are open to you right from the start. You play as a luchador, so there won’t be any weapons to find, either; the few additional moves you can get in the game are all grapples (a move you can complete when smallish enemies have taken enough damage). The low number of moves contributes to the short feel of the game (probably about 8 hours for the first play-though), but man are they satisfying! Throwing a damaged enemy through a whole crowd of others and sending them flying like bowling pins should bring a grin to anybody who picks up this game.  On the other hand, there are only a few enemy types, and late-game difficulty increase consists largely of forcing you to take on more of them and introducing some unblockable types (read: fire-based attacks). As you get good, you’ll find that you can destroy many enemie types in 1-2 seconds, which is good, because otherwise you’d get really bored fighting the same 8-10 monsters.  The story starts out feeling epic, but pretty quickly you find you’re actually just rescuing Princess Peach from Bowser again. The boss minions of the main enemy have very crudely sketched reasons for working with him, nor is it ever clear just why your girlfriend was abducted in the first place. Furthermore, the devil is introduced as a character, then plays essentially zero role. Why introduce a pointless character you might ask? Maybe because the developers just wanted to… in any case this is not a game you should play because it “features elements of hispanic culture”-you won’t pick up any traditional lore at all.  Overall, the game is pretty darn good, and very memorable in some parts. You may find that you’ll get replay out of it if you go in for additional modes unlocked at the end of a run, but I’d try to get it for less than $10 if possible.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a metroidvania combo-brawler with an extremely stylized mexican theme. I really enjoyed most aspects of this game. First I really want to draw attention to the game's amazing art and animation. They did not hold back one bit in committing to their art direction with wonderful color and shapes, and they also really paid off with dramatic mexican brass music. The game is often genuinely funny. So it's worth playing for those aspects alone. But it's also super fun to play.  Your ability to combo and throw enemies is pretty satisfying at the start of the game, and it's like 'Oh yeah I get it, I'm totally a luchador.' But it does a great job of building upon this with mobility and access powers. These take the form of fighting moves, as opposed to different energy beams (a la Metroid), and so at first they feel a little dry (as in, oh this block can only be broken with a certain punch I just got, but not my other punch... OK?). However, I really appreciate how well they compliment the game's melee-combat focus and double up as ways to dramatically improve your character's mobility. The game is most fun to play near the end, and you start to feel like a superhero luchador, which is just something I had never considered. My only complaint is that the combat is a bit unforgiving. It's hard, which is actually nice, but if you take a hit, it takes an excruciatingly long time to get back up, and on the last boss your timing has to just be incredibly perfect, so that got frustrating. I would definitely recommend Guacamelee. Also it has co-op. Go play it with your other friend who is also good at games.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best new platfromers I've played, PERIOD.   Addictive gameplay with just the right amount of dificulty makes for an amazing play-through.  Controller highly recommended (2 if you wanna do the awesome local co-op)",
            "review_score": "1"
        },
        {
            "review_text": "I'm not someone who is intimitely familiar with platformers nor am I someone accustomed to the blissful feeling of completeing games. These were the two reasons why I felt like I had to play this after being seduced by the vivid colors and humerous writing, and I'm so glad I played Guacamelee.   Guacamelee brings me back to playing the old Metroid games on my Gameboy Advance, and the game knows it. Entire game mechanics are in-jokes which are a small part of the fantastic sense of humor of this title. The game takes place in technically an open world, where you can go to any area at any time, assuming you've unlocked the required move to reach the location. Despite being open, you will ALWAYS know exactly where to go, and the areas area small enough as to not feeling like any time is wasted traveling.   Unlike Metroid, Guacamelee features a fantastic brawling combat system which was deftly designed to grow in complexity at the perfect rate I was learning the game. Without being hindered by petty realism, you get to beat to staisfyingly beat up skeletons and throw them at their friends. Boss fights are almost always challenging but so incredibly satisfying when victorious.   The game is wrapped in a nice simple ~6 hour story where I always knew what my purpose was and what the stakes are. It's nothing very emotional but it succeded in giving the gameplay meaning.   All in all, Guacamelee was an incredibly satisfying game to complete and I'd recomend it to anyone interested in the genre of 2D platforming adventures.",
            "review_score": "1"
        },
        {
            "review_text": "Great art style, easy to pick up controls that are satisfying, a good challange by the end of the game and a good amount of secrets to find. Pretty great humour throughout and just a bunch of fun the play. Some of the endgame challanges will leave you in great pain through frustration would definitely reccommend.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Metroidvania game you´ll ever find!!!! Guaca is so perfect in many ways thats is hard to write about it!!! The atmosphere, the combos, the story of the game, every piece glued to become the ultimate mexican brawling game!!! Buy it you´ll love it anyways!!!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like metroid?  What about vanias?  How's about some mexican?  That is what this game is, but it is also more things.  Like hard. It is hard.  But also good! Very good.  Is fun. Do get.",
            "review_score": "1"
        },
        {
            "review_text": "The art and music for Guacamelee is fantastic. It has an excellent, unique style and tons of humour. Playing this game with a keyboard, though, is like defusing a bomb with your feet. The puzzles aren't very challenging but require very precise combos. So while you may know the answer as soon as you enter a zone, you'll spend most of your gameplay sticking to walls unintentionally or misfiring combos only to be bounced erratically to the start point to do it all over.  Use a gamepad or save yourself the headache and just savour the soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Fun &amp; challenging game with internet-humour and awesome soundtrack. Take the seizure warnings seriously, though.",
            "review_score": "1"
        },
        {
            "review_text": "A great game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great metroidvania title with an incredible amount of character. I love it and have purchased it on multiple platforms. If you like metroidvania games, I'd highly recommend that you play this.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun metroidvania game. Give it a shot if you're feeling nostalgic for those.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. If you like open-world platformers with some puzzles and lots of action, (e.g., super metroid, etc) you'll love Guacamelee.",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't feel like metroid but it is inspired by it. You get cool upgrades, you get to explore areas more completely later on, and you get a special ending for collecting some things. I thought the fighting and special moves were cool and the music was really awesome. And it's nice to see a game with some Mexican culture in it.",
            "review_score": "1"
        },
        {
            "review_text": "I love the style of this game, a somewhat Metroid-vania, with an amazing art direction, inside jokes to other game series, and the Mexican-theme music is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game if you are not a completionist.  + Fun combat + Humour + Atmosphere  - Bad and outright buggy controls. (I still press wrong keys sometimes. Also sometimes keypresses don't seem to register.) - It's completionist's hell. You have to revisit areas to find previously inaccessible chests[1]. Oh, and the disappearing platforms laugh at your misery.  [1]It's something I hate in video games. It it's a cheap attempt at artificially lenghtening the game. Especially if you encounter a seemingly impossible challenge that after 10 minutes turns out to really be impossible because you lack required upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "Best platformer I have ever played, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! A bombastic, colorful, tight brawling experience. The hard mode has the perfect balance of difficulty and satisfaction. Have fun kids",
            "review_score": "1"
        },
        {
            "review_text": "Man man what a game. Extremely challenging, but it manages to stop just before it gets frustrating. Completing a challenging part of the game is very rewarding. Combat is fun and fresh, throwing enemies into each other is both hilarious and of tactical importance. The platformer parts are also very well done, with a plethora of different abbilities keeping things interesting.  9.8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Metroidvania style game with a unique setting and lots of funny references to gaming and internet 'culture'. Gameplay wise, the game is littered with super clever, multi-dimentional platforming puzzles and a satisfying combat system. Gotta love it. Buena compra!",
            "review_score": "1"
        },
        {
            "review_text": "great artwork, clean combat, with some old memes",
            "review_score": "1"
        },
        {
            "review_text": "Really very fun and challenging platformer. Only suffers from the rare Metroid-vania problem of needing some ability/power/collectible to continue on to the next part of the game and not enough hints as to where that power/collectible/ability might be hiding. Very fun overall!",
            "review_score": "1"
        },
        {
            "review_text": "Simply hilarious, challenging, a ton of easter eggs, beutiful graphics, nice mechanics. I really recommend to check the keybindings before you start playing, that's what actullay makes this game that challenging. But anyway LOVE IT.  Update: Sry the typo",
            "review_score": "1"
        },
        {
            "review_text": "It really is one delightful platformer! Amazing game!",
            "review_score": "1"
        },
        {
            "review_text": "Hell of a lot fun of fun.",
            "review_score": "1"
        },
        {
            "review_text": "it's a bit like castlevania but with fighting game combos. it's not bad, but honestly i was expecting more.",
            "review_score": "1"
        },
        {
            "review_text": "A fine example of a metroidvania game. You wander gathering powerups so you can access hidden/blocked areas all the while beating up mooks. The story's not Shakespeare but it is entertaining and has some good laughs, although a familiarity with Spanish would be beneficial since there are plenty of puns.  While I've heard it's playable with a keyboard+mouse, I'd strongly recommend using a gamepad.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a whole lot of fun, the graphics are amazing, I really enjoy the luchador style and the music is nice to listen to, although sometimes it can be a bit repetitive. Some of the platforming was challening which was good, but I enjoyed the story and the side quests.",
            "review_score": "1"
        },
        {
            "review_text": "This was a really fun game with some minor difficulty issues. Except for the last two bosses where the difficulty spikes out of control I had a blast. The last two bosses came off more as cheap for me then fun. I didn't feel a wave of accomplishment when I beat the 2nd to last boss, I was just glad the B.S. was over. I watched the last boss get beat on YouTube.   Other then that, there's some fun plat forming puzzles, the combat is fun and the humor is great. I'd wait for a sale, but def. worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great.  As a platform is smooth and flashy, with abilities to unlock during the playthrough and some metroidvania go-back-and-find-what-you-missed. The graphic is colorful, the combos are very responsive and chains well together... and that's very important since you're required to chain a long combo to overcome some obstacles; but don't be afraid, the learning curve scales very well and all the most difficult parts are optional (expansion) or kinda optional (you can skip them if you don't care for the second ending). Also, the plot is quite funny and the endings are both very good, and there's even some character interaction in towns with quests of some sort. Never regretted a single moment spent playing.",
            "review_score": "1"
        },
        {
            "review_text": "Way better than it has any right to be.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game. Best Visual Experience in 2D game",
            "review_score": "1"
        },
        {
            "review_text": "The funniest platformer with a Mexican luchadore theme. An entertaining storyline combined with challenging fighting arenas where you can use your loco moves. Great local co-op as well as single-play. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Verry good game buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Guacmelee is a Metriodvania game where a skeleton devil kidnaps your girlfriend and you turn into a mighty Luchador with MIGHTY POWERS!!!! Basicly what I'm saying is this game isn't anything too special but that does not mean it's a bad game. The game has a beautiful Mexican art style that fill the screen with bright colors and is always a joy to look at. The side-scrolling beat-em up gameplay is very fun and introduces the player to many inventive and challenging puzzles along the way. As the story unfolds you collect new abilities after beating the many crazy boss characters (the most epic being the final boss) and it feels so rewarding to advance through the level. Now that I me addressed the good stuff about this game now for the bad stuff, Firstly I think that their could have been a little more varity in terms of enemy design because fighting the same enemies over and over can get a little redundent after a while. Other then that I highly recommend this game it has minor flaws but overall great game  I give it a 8.5/10   fun game",
            "review_score": "1"
        },
        {
            "review_text": "Guacamelee! Is based on four concepts:  - a Metroid-vania style of gameplay  - a semi-complicated fighting system  - luchadores portrayed in a cartoonish way  - jokes based on modern internet popculture  It seems that there is pretty much nothing you could dislike. Indeed the first half of the game was very enjoyable for me. Some dialogs are written really clever, and the gameplay itself is enough to keep you playing.  But then it all falls in to pieces. The more powers you unlock the more difficult it is to play on a computer keyboard. Soon it becomes unplayable and confusing... and this is the part when someone tells me I should use a gamepad (like the authors told me on the beginning of the game). Well I tried... I have three gamepads and none of them worked... oooohhhh.... it needs an XBOX controller?   So now I should pay because the authors are xbox fanboys or because they sold their souls to MS? Not a chance.  Releasing this game on a PC (an also Linux for god's sake!) is a mockery.  The keyboard and mouse are basic PC controllers , so a game released on WINDOWS/MAC/LINUX should be designed to work with them, or at least allow ANY gamepad to work with it on all operating systems it is available for (I use Linux all the time, and never once had a problem with any of my gamepads in a game that allowed them).  There is also something else, that happens after the first half of the game – all the creativity of the authors just vanish (and the jokes from the first half began to stop being funny in the context also):  „Erm... I don't know how to make this game actually, so... hmm... let's make it incredibly difficult, and fill it with irritating enemies, internet memes redrawn to look mexican and references to other games!”  Give me a break...  This is unfortunately a trend in modern indie games .  „Don't have an idea to make the gameplay interesting? Make it freakishly difficult.”  „Don't have an interesting story? Make it a parody. A parody with a very difficult gameplay!”  „We don't know how to balance the gameplay? Let's give the player every ability we can think of! And make her/him use them simultaneously during a very difficult gameplay!”  I bet at some point of the development, the creators of games like that think they are smart, and creative. Throwing every idea for a gameplay element in to the final product, redrawing jokes made by others and making obvious references to other games...  P.S. Of course the level of difficulty is not only to be blamed on the controller. The game is literally unfair. Exactly like playing a badly designed NES game. UNFAIR. The projectiles thrown by enemies go right through every element of the environment, every enemy and stop only at the player. Every enemy attack is impossible to block and usually it has priority over your attack even if it is a combo, or a special move. Also, some actions work in some cases, and don't work in other (in which logic tells you, they should). The controls feel very awkward generaly, and most actions are hard to trigger.",
            "review_score": "-1"
        },
        {
            "review_text": "Charming and with a lot of style in every way.  I would gladly recommend this game if you are a semi-hardcore or more platformer.  However for everybody else, be fairly warned,  The game has a tendency to have one or two basic ideas (world switch and color shields) and then mercilessly repeat them again and again and again and ... absolutely endlessly again ... in ever more cumbersome ways, which is it way of adding content and 'difficulty'.  It becomes painful over time and in some ways punishing.  Add to this that it also creeps into fights (color shields, warp between worlds, white shields, bombs, bombs with shield .. you get the idea) and it becomes mindnumbing.  Also if you do not own a controller save your self some headaches and pass on this game. It is excruciating without one as the keyboard setup sadly makes the above even worse.  Frankly, the game badly needs a bye option where it lets you pass after a certain amount of attempts or deaths, to appeal to a larger crowd and not to mention provide more entertainment and less annoyance.",
            "review_score": "-1"
        },
        {
            "review_text": "I would love to recommend this game for the lovely art style and metroid style gameplay but the brutal difficulty spikes that come out of no where suck the fun out of the game,",
            "review_score": "-1"
        },
        {
            "review_text": "Really not what I had hoped for or expected. The only game in my steam library I regret buying.  The Good: This game is unique in that it is to my knowledge the only 2D Mexican-themed metroidvania beat-em-up in existence. For the first 1/3 of the game, you'll be thinking 'wow, I've never played anything quite like this'. Almost everything meshes really tightly (more on that 'almost' later).  Superficially, the game is great. I am usually critical of vector/Flash art in indie games (Ed McMillan's style is ugly and unappealing to me) but this game's style is beyond well done and beautifully drawn. It really captures the luchador aesthetic, and it's refreshing to see an indie game with an art style that isn't pixel art (or Ed McMillan's John K-esque gross-out shock-art style). One aspect of this game's art that really impressed me was that it uses its bold and flamboyant colour palette to its advantage: not only do the colours highlight the setting and theme, but bright and vivid contrasts make it very easy to not lose track of your character in the brawls, even in multiplayer. A++ to the art department. Colour me impressed.  The Bad: This game's music is repetitive and unmemorable. While what there is sounds very authentic and fitting, this is a game whose music will become muted very, very quickly. It feels there should be more, but there just… isn’t.  Unfortunately, beneath its shiny exterior Guacamelee! sports some very flawed game mechanics. Fighting becomes bland quickly, and about 1/3 of the way through things start to get baaad. The game tries to stave off the samey-samey-ness of the combat in ways that ultimately fall flat. Instead of increasing the (very limited) variety of enemies, the game introduces gimmicky limitations to combat that feel broken, frustratingly arbitrary, and poorly thought-out with respect to the way the characters control. They also artificially increase the difficulty to levels that border the “completely unfair / broken game design” line.  A fair challenge tests mastery of game mechanics and rewards player skill. Fair challenges are not a part of the latter 2/3 of this game. In fact, some parts of this game are so stupidly difficult (the insta-death fast-spawning exploding bomb enemies for example) that I almost stopped playing. These parts of the game do not test skill; they test patience (in the worst way) and temper. Failure during these parts is almost entirely out of player control. And I do mean literally out of player control because there is virtually no damage-invincibility or ability to recover from a mistake before your character becomes a pingpong ball. And this will happen, again and again and again…  The Ugly: Good writing can be to bad game design as is brown sugar to porridge. It can make something bland into something modestly enjoyable. Unfortunately, Guacamelee!’s writing is more like finding a hair in that bowl of porridge. Sure, it might be your own hair, so there's nothing wrong with it per se, but now you really don’t want to eat any more of that porridge because ewww.  Outside of combat, this game’s story is overrun by a certain style of humour. Take a long sigh out of your nose. That's really the best summary. There are a few actual jokes (setup/payoff) that did make me laugh. Unfortunately they are buried in a sea of dated and cringe-worthy internet memes (???), 'references' to movies, and 'call-outs' to popular videogames. Yes, that last sentence did indeed say “memes', as in 'injokes' with no purpose or amusing qualities beyond 'hey I know what that is lololol'.   Finally, the ending is an absolute joke.  And when I say the ending is an absolute joke, I mean both that it is an out-of-nowhere, context-blind, poorly-integrated reference, and also that it is abrupt, stupid, and ultimately unsatisfying.  Conclusion: I really wanted to recommend this game. After playing, I felt let-down and disappointed. Give it a pass.",
            "review_score": "-1"
        },
        {
            "review_text": "I love the art and humor of this game, and the initial metroid style gameplay is fun. However, I can't recommend this unless you are the type of gamer who enjoys both memorizing long strings of combos, and extreme twitch platforming (think super meat boy with fighting game combos). Without an easier gameplay setting, the initial fun wears off quickly. If you are a masochist who loves dying over and over and over again on the same part, this game is for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Having seen two of my friends finish this game,I thought maybe I had been too harsh in my assessment of the product. Turns out I was right to begin with. The first level is nothing but running back and forth, holding stupid conversations with the locals and jumping up and down while punching some barrels. WOW. Mario has been there and done that already. Then all of a sudden you are dead and there are no clues as to what that giant green sparkly thing in the floor is and can I go back and do something with it? OOPS, no I guess not! Or why am I being attacked by skeletal Mexicans in ponchos and sombreros and why, why, WHY?   I probably have less than an hour in this game and was hoping for more but I found the story to be flat and without real substance and the gameplay to be less than fun (for me, anyway). The colours are nice, and the game appears to be professionally developed but that being said I am glad I only paid $3.00 for this game. Only buy this game if you truly enjoy twitch action side scrolling platformers with repetitive action. Otherwise save your cash. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "A pretty fun little Metroidvania styled platformer that becomes ridiculous towards the end.",
            "review_score": "-1"
        },
        {
            "review_text": "DO YOU LIKE MEMES? WELL HERE'S A BUNCH, THEY'RE FUNNY RIGHT!?!  Have fun doing the same 3 hit combo over and over, because it's all you can do.  Music and visuals weren't as bad, but that's not saying much.  It's not even Metroidvania. It's a clear path, with a pretty obvious side path here and there. That's like saying Bioshock Infinite was Metroidvania. Just because it has a map and a TINY amount of backtracking and a few optional rooms, doesn't mean it's Metroidvania. Wanna see Metroidvania? Go play Metroid or Castlevania: SotN.  Game is terrible. 2/10.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played this and Super Turbo Championship Edition version in other platforms but decided to install it on Steam just to review.  Guacamelee! is a very solid metroidvania with funtastic (Ha!) jokes and well made gameplay also controlls respond pretty well.  To be very honest the only reason I choosed to NOT RECOMMEND the vanilla/gold edition since it is not as awesome as  Super Turbo Championship Edition .    If you want to experience the true LUCHADOR epicness go directly to Super Turbo Championship Edition. Worth each penny :) ",
            "review_score": "-1"
        },
        {
            "review_text": "The game has brilliant ideas but they are poorly executed",
            "review_score": "-1"
        },
        {
            "review_text": "Received this game for free with my new laptop. It looks nice but it just didn't catch with me.",
            "review_score": "-1"
        },
        {
            "review_text": "This is exactly the sort of game that I usually enjoy, and yet it rubs me the wrong way at every opportunity.  The play mechanics are too stiff, so movement and combat just don't feel fun. When fighting, moves can be utilized in concert to air juggle, to maintain long combos, and to throw enemies at one another, but there really isn't any incentive to use these advanced techniques or even to vary attacks at all.  Then there's the Metroid structure, which is too condensed—too simple, too transparent, and too predictable. You're driven along a very narrow path of progression, and along the way you come across obvious markers for places you'll be able to enter once you receive the proper abilities. It's just by-the-numbers, and being teased by these blocked-off side paths feels rote when it should feel exciting. All of the game's puzzle-platforming challenges are characterized by the same workmanlike effort, too.  All of this would be disappointing although perhaps not damning, but Guacamelee wears this constant, unfading caca-eating grin that the writing absolutely does not earn. Many games love to wink at the player, but this one does it while standing over you in an arrogant pose. The most egregious example I've come across was a hidden QR code. I posted a screenshot complaining about how presumptuous and frustrating its inclusion is since I don't own any device capable of reading it, and a friend told me that it says 'Congratulations! You successfully identified and scanned a QR code! Great job!' That's it. That's the kind of reward you can expect for making the effort to discover secret paths.  I wish this game was a person so I could punch it in its stupid face.",
            "review_score": "-1"
        },
        {
            "review_text": "stupid game with unfair bosses, best avoided.  artificial difficulty out of no where, I thought it was only one or two bosses, nope its every ♥♥♥♥ing boss.  avoid.  also ♥♥♥♥ humor. 5/10 would not recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "Very pretty, quite funny. But far too hard! I guess I'm getting old, but, seriously, are platformers these days only made for hyperactive kids on speed?! Though I appreciate the effort, I can't honestly recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "can developers put warnings on the store page if the game is filled with tumblr ♥♥♥♥ please? I was enjoying this until all of a sudden a me gusta face appeared it's not funny. worst £6 I've ever spent",
            "review_score": "-1"
        },
        {
            "review_text": "I completely forgot about this game once I started playing other games.",
            "review_score": "-1"
        },
        {
            "review_text": "Understand, I really want to love this game, I was loving this game, but then I hit a brick wall in a platforming section a little after the second chozo statue. I'm not good at this sort of thing, and I don't feel like replaying the same section over and over until I get lucky. If you're cool with really complex movement, buy this game, I'm sure it will add to the experience, if you can't stand that, don't you're only in for frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "This is really a good game but unfair boss fights and impossible jumping puzzles makes you wonder if the devil himself developed this game",
            "review_score": "-1"
        },
        {
            "review_text": "Fun for the first 2 hours, then the games becomes repetetive, linar and boring. The final 2 bosses are not even worth the fight / time.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is just frustating HARD... this part maskes me quit this game :  five frustating enemy with shield.. you must destroy the shield with special moves.. different shield needs diffrent special moves.. the shield keeps regenerating if you stop attacking them for 2-3 seconds.. enemy can hit you when you performing special moves..  The game didnt let me finish it (or beat enemy asses) with my own way, and not fun anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like this game. I want to recommend it. But I just can't because of a couple of reason. The combat is decent, but feels stiff, as does the platforming. The controls start out being good and manageable, but quickly get bloated. I often would mean to do one move but end up doing another. Much of the platforming gets frustrating and rage-inducing mid to late game and ultimately I just quit, no longer caring to see the end.  It's a great idea, but executed poorly.",
            "review_score": "-1"
        },
        {
            "review_text": "Played my entire childhood. Shaped me as a person. I would not be alive if it wasn't for this game    3/10 would not play again",
            "review_score": "-1"
        },
        {
            "review_text": "Guacamelee! is advertised as a member of the 'Metroidvania' genre, which is largely what drove me to it. It draws on some of the key features of its heritage (accumulation of abilities which open paths and expose secrets) while departing from others (extended exploration, moody atmosphere, isolation). The story, while basic, is overbearing (compared to ancestors of the genre); there are a lot of monologues and cutscenes that probably aren't necessary––they're largely used for jokes. Icons like Super Metroid or Castlevania: Symphony of the Night give broad goals (reach Evil Guy X at the end) and let you work out everything inbetween. Guacamelee! repeatedly says 'go here on the map' with small rewards for deviating. But this is a hallmark of modern games, largely.  Like other reviewers have said, this is more of a brawler-platformer. It will appeal to fans of that type of game. The platforming becomes grueling at times, especially if you're using a keyboard. Don't believe other reviews that say it's unplayable with a keyboard; you'll just have to take a break every 45 minutes when your tendons start to hurt.  This is a weak Metroidvania title but a decent brawler-platformer. If you, like me, are/were expecting the former, you're liable to be disappointed.",
            "review_score": "-1"
        }
    ]
}