{
    "app_id": 215160,
    "name": "The Book of Unwritten Tales",
    "release_date": "2012-07-31",
    "developer": [
        "KING Art"
    ],
    "publisher": [
        "THQ Nordic"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Fantasy"
    ],
    "achievements": 0,
    "positive_ratings": 1386,
    "negative_ratings": 134,
    "price": 17.99,
    "description": "In a world torn by war, the aged gremlin archaeologist Mortimer MacGuffin harbors the dark secret of a powerful artifact.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/215160/header.jpg?t=1533042039",
    "minimum_requirements": "OS:Windows XP SP 3 (32bit) / Vista SP 2 / Windows 7 SP 1  Processor:Pentium IV 2 GHz / Athlon 2.4 GHz  Memory:2 GB RAM Graphics:Direct-X 9c compliant video card with 128 MB RAM, PixelShader 2.0  DirectX®:9.0c Hard Drive:6 GB HD space",
    "recommended_requirements": "OS:Windows XP SP 3 (32bit) / Vista SP 2 / Windows 7 SP 1  Processor:3 GHz Memory:4 GB RAM Graphics:Direct-X 9c compliant video card with 256 MB RAM, PixelShader 2.0 DirectX®:9.0c Hard Drive:6 GB HD space",
    "reviews": [
        {
            "review_text": "The Book of Unwritten Tales is a 3D point-and-click adventure game set in a fantasy world. The game consists of 5 fairly lengthy chapters, although the last chapter was very short compared to the others. The Steam page says the game has about 20 hours of gameplay, but it only took me about 11 hours.   The graphics are pre-rendered in 16:10 aspect ratio, which means that on other aspect ratios there will be black bars on the sides. I have a 16:9 monitor so there were a bit over 1 cm wide black bars on each side of the screen. Aside from that minor issue the graphics are good and the environment looks very detailed.   The story is good, although it's a pretty standard fantasy story. You must find a powerful artifact and not let the evil forces get it. The somewhat silly world and the charming characters make the story a lot better. For example there are 2 NPCs playing a fantasy RPG, in which they must fill tax forms and do other mundane real life tasks. The dialogue is also pretty funny and contains several nods to other games like the Monkey Island series.  I found the puzzles to be easy and simple. I never really had to look for any items as you could get almost all of them on the first time you entered that area. The interactable hotspots disappeared once you no longer needed them or if you had interacted with them for a couple of times. You also had to interact with everything once before you could pick it up, which I learned pretty quickly. That basically meant that all the hotspots remaining after going through them all would be used in a puzzle. The inventory system made everything even simpler as the game showed a text when you could combine two items.   The game is fully voice acted and I thought the voice acting was pretty good. The music wasn't that great, but it was often barely noticeable. There are subtitles available in the game, but they don't show during the few cutscenes the game has.   I thought the game was good and recommend playing it, if you like point-and-click games.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome throwback to the days of Kings Quest and Quest for Glory. I love the humor and excellent writing. Puzzles take some thought but not enough to make you frustrated. Graphics and Voice acting are top notch for this style of game as well. I see they are making a part two. Cant wait!",
            "review_score": "1"
        },
        {
            "review_text": "This was a great adventure game. Sadly, the developers abandoned it. There are many graphics and audio incompatibilities across all platforms. These problems have grown over time with newer versions of operating systems and graphics/audio/input drivers. Many users on the forums encountered show stopping bugs/crashes several chapters into the game.  I spoke to representatives from KING Art, who said the build system for this game was destroyed, and that there are many third party libraries which the game depends on. The game needs significant development to reintegrate with the latest versions of these dependencies in order to recreate a working build system. They said this is simply not going to happen, and that the bugs will not be fixed.  As there is no way to tell if the game will be completable for you, I can't recommend you buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "I'll recommend The Book of Unwritten Tales for those that are in the mood for a comedy point and click adventure game. Really, if you are in the mood for something a bit more serious this certainly isn't for you. The amount of reference humor and fourth wall breaking is turned up to the top on this one. At some parts even to the point where it was getting a bit too much for me. But overall the game's charm and cartoony style won me over.  The puzzles and tasks were challenging, without turning too hard. It is often needed to go and talk to characters you have already talked to in order to progress, but since this is consistent throughout the entire game, it doesn't feel as out of place, as it could have if it had only been done on a single puzzle.  You play as four characters through different parts of the game, and some parts you must switch between multiple characters to use the different strength.  All four with different personality, experience in life, and view on the world. The story is very simple, but as one of the supporting cast puts it “The battle between good and evil is never cliché!”",
            "review_score": "1"
        },
        {
            "review_text": "This is cute, light, and funny.  Its not a deep, complex, or thinking game - it could be played by 8 year olds There are no decisions to make, and you cannot make an error. Not a puzzle game, and not really a true adventure. If you don't mind the conventions of a point-and-click, then you would enjoy this. The experience is like clicking through a movie, imagine playing the movie 'Shrek' and you have an idea of whether you'll enjoy it or not.  The strengths are the voice-acting, the graphics. The comedy is a plus, but not their strongest point.  The weakness is that it can still manage to be tedious, and you turn off your brain to play.",
            "review_score": "1"
        },
        {
            "review_text": "Rating 9/10 Overview: Point and Click Adventure  This is a fantastic point and click adventure game that should be played by anyone who is a fan of the genre. The setting is fantasy, a beautiful artstyle with some great characters and well written dialogue. The comedy elements are also pretty decent. This is a fairly lengthy adventure ranging anywhere between 10-15 hours depending on skill level. The puzzles are not terribly difficult and find the right balance between fun and challenging. Strongly recommended.  ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome point and click fun with terrific writing, but not worth it at full price. Also note that 16:9 is not supported",
            "review_score": "1"
        },
        {
            "review_text": "The Book of Unwritten Tales is a point-and-click adventure video game created by German developer King Art originally released in 2009 in Germany and translated to English and re-released in 2011.  Despite being originally released in 2009, the graphics still looks very beautiful and hand-drawn with alot of attention to details which makes this a beautiful journey to adventure in. Animations are smooth and fluid and the whole game is just looks very pleasing to the eye. The cutscenes could use some improvements however, as they are lower resolution pre-rendered videos with no option for subtitles even though the game itself supports it.  Music is also very orchestral and professional sounding, with nice little jingles accompanied with sweeping epic symphonies. Voice acting is really very good and each of the voices add alot of substance to the characters.  The story itself is about 14 hours long and is an interesting and light-hearted tale that pokes fun at itself and pays homage to alot of fantasy and RPG stereotypes.  Although there are no in-game hint system, the puzzles are not very difficult and feels just right. There are however some puzzle minigames that may require a little dexterity (Eg: a rhythm based music game)  For younger gamers who have not played the classic old Lucasarts adventure games however, they may not get some of the jokes. For the most part though, the overall plot is easy to understand, entertaining and a clever plot mechanic near the end certainly surprised me. The ending was a little abrupt however, and while the game does end in a cliffhanger, it is still quite satisfying.  Downside, there was a potential game stopping bug relatively early in the game and I was lucky to have had a savegame beforehand. (Protip: Do not press ESC when you are doing the Wheel of Fortune, because if you do, the character animations will just loop and you will not be able to progress further)   Other minor annoyances include not being able to make the character walk faster, and the typical 'mouse-over everything on the screen until something is clickable' type of situations. (2nd Protip: Pressing Spacebar will allow you to see ALL the clickable locations on the screen. Be forwarned however that this might make the game a little too easy.) There are also no bonus features to unlock once you've beaten the main game thus lowering the replayability value.  Overall Rating: 8.0 / 10 Old-school adventure gamers will enjoy this game and appreciate some of the jokes which would bring back some nostalgic memories. It is not a very difficult game, and you don't have to think out of the box. For newer gamers who have never played an adventure game, this is an excellent introduction for you. Definitely well worth a look. Don't miss it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun. The beginning is a bit slow and the animation of the characters is not really nice, but the story is nice and very funny. It contains a lot of references, especially to Discworld and Monkey Island!",
            "review_score": "1"
        },
        {
            "review_text": "A great little adventure game which lovingly pokes fun at fantasy adventures. This is very funny and fun to play. It is a little on the short side but as long as you don't use any FAQs will keep you occupied for around 10 hours. Definitly worth buying and look out for the newer stuff too.  89:100",
            "review_score": "1"
        },
        {
            "review_text": "If you like Point-n-click games and fantasy films/books/games, and have a sense of humour about such things, then buy this game. It's gorgeous looking, has some of the best Voice-Over work I've heard (which had me laughing out loud on many occasions), and is around 20 hours long (pretty long for a PnC). Just buy it Mortimer!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game due to its amazing graphics, after having it for a while I decided to play it. I was overwhelmed, I love the game's sense of humor, and the way it breaks the fourth wall.",
            "review_score": "1"
        },
        {
            "review_text": "One of the funniest adventure titles I've played in a good while. So many great pop-culture references from various movies, books and video games. The humour itself reminded me a lot of the good old Lucasarts era, which made me want to replay the old Monkey Island games again.    Voice acting was very good, with lots of interesting characters and a decent story that borrows everything from Lord of the Rings to Star Wars. The length was fairly long for being an adventure game, and it gave me nearly 20 hours of entertainment. But I must admit the ending felt a little rushed and it should have used some more explaining, polish and freshening up.   It's sad to see how unappreciated these games are now a days, but they are slowly making their way back. Germany has been making a lot of great adventure titles lately, and they've really become the new adventure kings.   Like they hinted in the ending, hopefully we will see a sequel sometime in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Stellar game. It had me literally laughing out loud multiple times. The humor was right up my ally.   The puzzles were clear, and the prompts were helpful if you got stuck. I never felt a need to go to a walkthrough, and I never got stuck enough to get frustrated. I did, however heavily utilize the space bar (which reveals all the clickable points) which is a great feature for a game such as this.  The plot was really engaging and I was so thrilled to find that there was a part 2 once I finished it because I definitely wasn't done laughing with these characters.  10/10 Please hit me really hard in the face so I can play it for the first time again.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty entertaining game so far. Story is funny at some times and mildly annoying at other. The scavenger hunt / puzzle blend mixed with pertinent conversation choices make for a fun challenege give these games a shot.",
            "review_score": "1"
        },
        {
            "review_text": "It's alright. It's a point and click adventure that pokes fun at everything from Lord of The Rings to World of Warcraft. If point and click ain't your fancy, don't get this. If you have a raging hard-on for them, however, and want a few cheap laughs- have at it.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most charming and beautiful point and click I have had the pleasure to play. This game is gorgeous to look at. The characters are so lovable. Yes, there is a lot of homage to other games and fantasy genres. but it is not overdone. The story is familiar, but it is told in a fresh way. I would put this right up there with the classics of LucasArts. Also, get the soudtrack! I think it is one of the stars of the game.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game. Good story, great humor, logical puzzles, what more can you ask for in a point and click adventure? I highly recommend this game. You won't regret playing it.",
            "review_score": "1"
        },
        {
            "review_text": "What do you get when a point and click adventure game is fully aware that it is a point and click adventure game? You get this nifty game, where the right combination of self-referential humor, 4th wall breaking, and beautiful set design manifested in a thoroughly pleasant game. I had no idea I have had this game in my steam library, and I have no idea what it is, or how it become one of the 600+ titles. But if I obviously paid money at one point to get it, and that was perhaps the best financial decision i've made this year(this being a particularly bankrupt year in terms of positive monetary decisions for me, but I digress).  The Logic: First of all, when you play an PaC Adventure game, you have to have a very eccentric sense of logic. You can't just simply find a ladder to get a cat down a tree, but you have to cobble together a solution that involves a rubber mouse that you find on the surface of uranus, a piece of string woven from the nosehair of a troll you put asleep with the duck's tears potion from the dungeons, and finally a makeshift fishing rod from a wand you found while rummaging through a witches knicker drawer. This game is fully aware of that, and in its awareness, makes the logic to be a perfect balance of adventure game logic and simple item association. Sure I got stuck a few times, but It was mostly due to me missing an key item among the clutter of the scenery. Of course, this is partially due to a particular gameplay flaw that I will touch on later.  Gameplay: PaC games are generally very easy. You hover your mouse cursor over everything in the scene, until it changes into either a grabby cursor or a magnifying glass, and you keep doing so until you have found every item and every interactables in the scene. The items are in an inventory in the bottom row, and you start mashing them together until you get what you need to solve the puzzle at hand. This method of brute force have served me well for many logically redundant PaC games, and I have applied this method a few times in this game as well... that is, until I discovered the SPACE BAR! The space bar button highlights every item and every interactables in the scene. Such a batvision upgrade seems to made the game easier, and would of course benefit many times where I had mouse scanned everything in a scene for a missing item. Such an control input would serve well to be explained in game at the beginning, instead of being accidentally discovered 2/3 through my playthrough. But overall, I found that the game seems to composite all the important elements in obvious places, and the UI is pretty intuitive for all the interaction of a PaC game.  Artwork and Animation and Sound: I put these category together because… Well mostly because I’m lazy, but also the combination of all 3 together creates immersion for the game, and this immersion stool will immediately topple if one of the three legs is taken out. I've have my hand hovered over the screenshot hotkey for majority of the game. The scenery are beautifully rendered, the characters are very well characterized, and most of the dialog match with the animations. A few sound seems to be out of sync with the animation, but the dialog are so expertly written and enacted that I’ve been willing to let a few negs go. Animation seems to be the weakest leg of the stool, many animations seems slow and unresponsive, especially when you have to repeat an action multiple times, it seems almost unbearably mechanic. These are times when I teeter precariously on this stool of immersion, but the rest of the gameplay is engaging and the dialogs are humors enough to compensate for my sore bum.  Conclusion: I was really tempted to end this review on the word “bum”, but I have to be considerate of all those who skipped ahead of my long-winded rants to ask: SHOULD I BUY THIS GAME? … HELL YES.",
            "review_score": "1"
        },
        {
            "review_text": "Best point &amp; click adventure game since Monkey Island.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite point &amp; click games, I enjoyed it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "As an avid fan of Point and Click quest games in my younger years, i thought i'd give this game a go - and see if it can match up to what i remembered these games to be like.   I have to say i was pleasantly suprised by the game - the story was interesting overall, kind of goofy but that's what i come to expect from fun quest games, the game reminded me of the good ol' point and click adventures of the past and i had a blast playing it.   I would recommend this game to any child of the 80's who grew up on comedy adventure games, i enjoyed it very much.",
            "review_score": "1"
        },
        {
            "review_text": "The Book of Unwritten Tales What can I say? One of the best point and click games out there! Beautiful graphics, Awesome soundtrack Super-cool plot Full of witty jokes and various references! I recommend it with all my heart and I bet it won't disappoint you except if you are a sad sad sad person...",
            "review_score": "1"
        },
        {
            "review_text": "Well, what's there to say. It's a point&amp;click adventure alright, but it's genuinely fun, fully voice acted, has very few stupid minigames and a reasonably pretty world.  You get to meet interesting characters, and the game makes fun about a lot of stuff you find in fantasy-themed games without being ridiculous or stupid (in fact, they even named the old gremlin who set all of this in motion 'MacGuffin'). Expect some real laughs from it.  The puzzles are not overly complex, although I seemed to have missed a detail occasionally so I kept wandering around until I noticed. Never asked daddy Google, though.  Occasionally it drags on a bit since retrying stuff often involves going through some cutscene-ish scenes as well, or simply because you don't exactly know what to do next and walking through places just takes time. The rest of the game more than makes up for that, though.  You also get to play a total of 4 characters, usually on their own, but sometimes you get several of them in a scene and you can (and have to) switch between them. Switching takes a bit of time too, as they walk to some neutral position before actually switching, but you get used to it. It's not like you have to perform time critical action feats. Of course, all of these (and the non-player characters as well) come with their own personality.  In general, I'm not a point&amp;click expert, but I can definitely recommend this. In my opinion, a few minor shortcomings pale in comparison to the characters, story telling and humor -- and puzzles that don't feel contrived.",
            "review_score": "1"
        },
        {
            "review_text": "This may sound a odd question for a point and click adventure game, but do you have dexterity and muscle memory of major league pro gamer? Cuz you are going to need it with that BS rain dance mini game ARGH!!! That section felt like pure trolling by the developers. So for point &amp; click only enthusiasts you have been warned.   As for the rest of the game nothing original the usual generic point &amp; click setup. As in rub inventory items with everything on screen until it works. Oh and as for the humor don't expect Terry Pratchett level of writing or comedy (not by a long shot). Voice acting and visuals are probably about the best thing in this game oh well. The overall presentation does have a professional look to it so the game does have that going for it I suppose?",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fun, light-hearted, full-length adventure game. It's also very accessible to people foreign to the genre since it clears 'hotspots' after they've been used or no long have any impact and never puts the player in an unwinnable situation.  Visuals are very impressive at times. Most puzzles are logical enough, though sometimes they're hamstrung by the problem of knowing what to do to solve them, but you need to talk to a NPC first to actually start solving them. There's also a terrible stealth section in this game. Why would you do this in an adventure game? The playable characters are fun enough save for Nate, who is just boorish and annoying. Most NPC's are fun to interact with.  Game is around 12-14 hours long, though I thought it started to drag in the last couple of hours and I was ready for it be over by the time it wrapped up. One other thing, some people react in abject horror when games break the 4th wall or use humor that references other games, movies, fiction, etc. If you are one of these people, stay away, this game pokes fun at this sort of thing quite often. It didn't bother me as the game is consistently pleasant and light-hearted in nature.  In short, fun adventure game that is accessible to new players.",
            "review_score": "1"
        },
        {
            "review_text": "This was a clever little game.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, loved it start to finish! On to the others in the series now...",
            "review_score": "1"
        },
        {
            "review_text": "It's too blunt for my taste in its desperate attempts to live up to its role models, the legendary Lucasfilm adventures. I hardly made it over the first some puzzles, as the cheese hit me pretty hard: When a bullwhip was introduced rather heavy-handed, the elf girl comments the use of it with a whistling of the Indiana Jones theme. This fanservice was very telegraphed and as the game wasn't too impressive yet, i didn't want to go on.  For Lucasfilm-style Adventure-Fans, this is a nice game. For anybody expecting stories and dialogs mature enough to stand on its own feet, this is a little hard to swallow.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game for story lines and puzzle solving, recommended for those who have kids.",
            "review_score": "1"
        },
        {
            "review_text": "Too cliche, not funny (Which is hard so I try not to be too judgemental about it), puzzles awkardly designed. It's as if they learned very little about the mistakes of Adventure games past. 7ish/10",
            "review_score": "1"
        },
        {
            "review_text": "First off, I want to mention that I finished this game. Being a game that can last up to 20 hours the majority of my time was offline.    Hark back to the days of adventure, by clicking on random pixels, picking up items, and combining items in random or 'logical' ways in hopes of finding your way through the adventure. This game is a throwback. A 'Point and Click' adventure game. While there have been many since the days of Monkey Island, and even in recent years, this is probably one of the best since Monkey Island.    You take the role of a young gnome named Wilbur who yearns for adventure and hopes to remove himself from his menial life, the beautiful elf Ivo who just so happened to be in the right place at the right time, and a wise-cracking cocky human with a peculiar past named Nate. Nate on the run from a bounty hunter has a furry sidekick called 'Critter' whom speaks nothing but nonesense (familiar?).     Spoilers: The adventure begins with a ring...among the backdrop of a war between the Alliance (gnome, dwarf, human...) and an army of orcs.    I'll stop my spoilers there. It should sound familiar to you. This game is humurous, using obvious references to help out its humor, but it doesn't over do it. A wonderously funny game in its own right, It doesn't bash nor does it even spoof what it references. It's good natured ribbing over the typical Toklien-esque fantasy world, and certain games and films we've all come to know through the years, but again it doesn't over do it. It brings up some good points about gaming in general though, mainly directed at the MMORPG when Wilbur asks 'Why would people feel the need to leave their real-life to play a fictitious life....' That's not a direct quote, but it was along the same lines. Most likely done in jest, to me it still brings up a good question about our hobby.    The art style is superb. Bright colors and details abound, and I caught myself wishing there was a 3D space to it, to be able to explore more deeply than you're able in the game. The dialogue is also detailed. Click on certain items on-screen, and you'll get a simple explanation of it, but enough that it may give you a nice background and history of the world. Even minor points of interest, and minor characters have some history and background to them. In summary, this is just a nice game with lots of spirit. Beautiful artwork, clever dialogue, and never a time of frustration, it deserves your attention. I've been gaming since I was a kid, this is one of my favorites.   P.S. Soapbox time: As for Wilbur's question, we all have our reasons to 'game.' I've been lucky enough to travel and have real life adventures in this world. I SEEK it out. What motivated me to do all that? Playing games as a child. The fantasy and the worlds I got sucked into, it motivated me to find it in real life. Hope you all seek your adventures just the same.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game a while back when it was on sale. Im glad I didn't buy it at full price.  I thought this game started out decent and was actually kind of excited to see how everything would develop. Unfortunately for me it turned out to be a quest of boredom and tediousness. It also felt inconsistent since a few parts actually were pretty good and other parts were just 'let's get on with it already'.  The games graphics is pretty good but it could have been better. I had this feeling while playing that the game wasn't as polished as it could've been and that it could have run much smoother.  Certain areas in this game were much more charming and fun to play than the rest and to be honest there weren't that many of them in my opinion.  If you absolutely want it I'd recommend getting it on sale for a low price. But seriously.... get some real point and click adventure games instead, Syberia 1 and 2!",
            "review_score": "-1"
        },
        {
            "review_text": "The jokes are stiff and unoriginal, and most puzzles are way to easy, to the brink of just being ' go fetch that' etcera. But that is pretty standard or mediocre, the main problem I have with this game is that it still now, so long after it´s release (3+ years) it still have game breaking bugs where the game just breaks and corrupts saved data, making all your progress completely invalid. A game that breaks itself through big, biiig bugs and design flaws. Not worth your money, not even on discount because as a consumer, you should NEVER accept this poor quality on a product.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a very different kind of game, you cant die and it plays like a book, just like the name says. So much dialog and great voice acting makes the story worthwhile. The environments are beautiful, this game is like a work of art, of course being mostly a puzzle game you may need to look at a walkthrough I needed t do this twice.  Rating: 9/10 Value: 9.99 (No controller support, does not support steam big picture)",
            "review_score": "1"
        },
        {
            "review_text": "NO. I was not convinced. Beautiful graphics, good voices, nice puzzles, VERY funny dialogs and situations... most of all I loved the non-conformist NPCs, very cooool shaman, pink paladin, anxious dragon, loving zombies, etc. Well that was right ! But where is the story ? Was it so expensive to write a complete scenario, instead of theese shortcuts ?  OK, you play some time, you take pleasure to solve the tricks... after a while, you feel the end is near and you hope for more, for a hard final, for a last tricky enigma in order to show to demons who's the boss here. Aaaaaannd ... Nope, it's already done, here are the credits, thanks for playin', good bye. What a pitiful end of game ! No, no, no... I ended that one, but won't start a new game before at least... well, plenty of time.",
            "review_score": "-1"
        },
        {
            "review_text": "Has a dead end. I can not finish the potion because it blows up. There are many confirming complaints on the interbet.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't let the quirky looking imagery fool you, this is one of the best point and click adventures I've played in years. Up there with Monkey Island in witty humour, plot, and writing with solid voice acting. Couldn't put this one down until it was over.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most memorable adventure game. Because of it's humor. Yes, humor. It's one of the adventure game that reminds me of Monkey Island as it's just as funny and fun!   PROS  ● Unique and memorable characters. ● Lots of middle-earth races. Gnome, elf, orc, troll, etc. ● Lots of humor, and broken 4th wall. ● Lots of popular references. Star Wars? Checked. Monkey Island? Checked. Harry Potter? Checked. ● Just right puzzle difficulty. ● Did I mention the humor?   CONS  ● The graphic is nice, but isn't especially stunning. But for me, I don't mind at all.   FINAL SCORE  Gameplay: 8/10 Story: 7.5/10 Graphic: 7.5/10 Music: 7.5/10  Overall: 8.5/10   Yes, the overall is because of the fun factor it has. It's that fun! Recommended to all adventure games lover and anyone who loves a good laugh.",
            "review_score": "1"
        },
        {
            "review_text": "Witty, beautiful, with logical puzzles that are challenging, but not too hard",
            "review_score": "1"
        },
        {
            "review_text": "It is a witty, classic and light hearted Point and click adventure game. I stumbeld on this one by an offer on Steam and I really had no idea that it was a real hidden gem for adventure games. In my opinion, similar game styles compared to the Book of Unwritten Tales are:     Kings Quest VII    Toonstruck   ",
            "review_score": "1"
        },
        {
            "review_text": "If you like Monkey Island then you'll love this. Apart from an abrupt ending I found it delightful all the way through. Will wait for the sequal eagerly. ",
            "review_score": "1"
        },
        {
            "review_text": "references, references evrywhere  btw: Space bar, space bar evrything",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic story I recommend this game to anyone who likes these sort of games :)",
            "review_score": "1"
        },
        {
            "review_text": "This is one cute, funny and entertaining adventure game in the old school point-n-click style. No big brain cracking puzzles here but what makes this game really wonderful is a great voice acting and music and sound and ... I did love those many pop culture references, presented mostly in the form of witty dialogs - eg, Lord of the Rings, Star Wars, Indiana Jones, many fairy-tales, etc.  And it's quite lengthy, too, took me about 18 hours to finish it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a solid point'n'click adventure game, with lots of jokes and pop culture references. The puzzles are not too hard, and you can press the spacebar to see all the interactable objects on the screen. You can get through the game pretty quickly, but it's more fun if you explore all dialog options and item descriptions.",
            "review_score": "1"
        },
        {
            "review_text": "Okay...because I'm a BIG fan of Star Wars and my wife is a fan of Harry Potter, this game has those two elements combined with the original concept of the game. You'll laugh a lot playing this game, GUARANTEED!!! ;D",
            "review_score": "1"
        },
        {
            "review_text": "pretty solid point and click adventure game with a lot of charisma. the comedic moments make playing it worth it despite that it can get annoying having to go back and forth to get things that you couldnt get before. but, i try to think of it as an easter egg hunt of sorts. Now If you'll excuse me, I have to get back to brewing my dwarven ale.",
            "review_score": "1"
        },
        {
            "review_text": "The story and characters are what make TBoUT an enjoyable experience. If you enjoy a casual point and click puzzle game, this is for you!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a brilliant little adventure game- it really holds true to what made the classic adventure games so great. It has a lot of light humour that isn't too adult or childlike. The background art is very well done, and even the character models are nice (albiet not groundbreaking realism or anything). The voice acting is well done on most of the characters. The puzzles aren't insanely difficult but still provide a good challenge to a seasoned adventure gamer. It's a solid game too, didn't experience any crashes even while flicking between windows on my computer.  There's loads of content too. I'm so used to steam games being over quickly but this is a full length game which is refreshing. If you liked games like Monkey Island and Grim Fandango, give this game a try.   Even though it's fun to play as an adult, it's also appropriate for your kids, so if you're not sure what to get your kids- get this one :)  I'm looking forward to playing the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "An enjoyable, well-written point&amp; click. Although at times it turns into a Hidden Object game when you know what you're looking for but you cannot find it (till you cheat. Or maybe that's just me). The puzzles are fairly intutive overall but still fun. The writing is by far the best part of the game.  I quite enjoyed this one.",
            "review_score": "1"
        },
        {
            "review_text": "First game in the series and already loving it.   It is a great adventure with beautiful graphics and lots of humour, lots of references however the main strength of the game are the story and its world are just absolutely fantastic!  If you like point &amp; click adventure games you should give it a go along the other 'Book of Unwritten Tales' games.",
            "review_score": "1"
        },
        {
            "review_text": "As a big fan of adventure games, I've been looking for a good one on Steam. I was horribly disappointed by the animations of the Monkey Island HD editions and the unintuitive controls or inability to skip narrated dialog. I was very frustarted at the lunacy of Deponia - puzzles so bizarre that solving them was a game of exhaustive trial and error (or basically dependent upon using a guide).  Unwritten Tales sits somewhere between the two. It's not perfect, but it is good enough to enjoy. The voice acting is good, the scenes look good and the puzzles are fairly logical. There's good features like double clicking an exit to skip the walking to it - so there is not much time spent waiting for characters to traverse scenes (and generally there's not absurdly long routes in any particular scene or area unlike Deponia). You can show all the hotspots by pressing the space bar, which is needed because a few of the things you need are pretty small or obscured. It plays well overall.  It does have issues. I've run into a few glitches already. Some of the models look either dated or amateur - especially when animated. A lot of the animations are a bit off, but nothing so bad that it ruins the experience (unlike the Monkey Island HD games). Depsite these, I'm enjoying it so far.",
            "review_score": "1"
        },
        {
            "review_text": "Might have been a good game, but I couldn't get into it when the prerendered cutscenes were lower quality than the game itself and the music was so loud you couldn't hear what people were saying. Subtitles don't work during said cutscenes either... The ambient sound effects during the game were just as bad. It's pointless to record voices for the entire game, if you aren't going to make them audible...",
            "review_score": "-1"
        },
        {
            "review_text": "Best game I have played so far!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but I thought the ending was a bit flat, I was hoping the player would be more involved like with the rest of the game. That doesn't mean the game isn't worth it, the rest of the story was a fun point and click adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play, the developers really put effort into it. Many references to modern day popculture. The only thing I didn't like that much is the fact that the puzzles are quite easy. Harder than in Telltale's 'point &amp; click adventures', but a lot easier than in old gems like DotT, MI, Indiana Jones, ...",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for an epic funny adventure game then look no further - play The book of Unwritten Tales 2!  Seriously though, what this game lacks the sequel makes it up for and it's superior in many ways.  This game however starts out good, is ok in the middle and ends pretty lame. The only fleshed out character is Wilbur the magical gnome and he makes it all worth while. The other two I just couldn't care for. Nate is your typical snarky pirate type of guy and Ivo the half naked elf princess has the depth of a floppy disk (and a really annoying bird as companion). Luckily they both get proper character boosts in the sequel (unfortunately the annoying bird remains annoying).  But because their weak character in this game I only really enjoyed the sections where we get to play as Wilbur. Although it feels like we mostly get to play as Nate, but maybe that's because there's a certain chapter with him that feels twice as long as the others (if you played it you will know what I'm referring to).  The puzzles are rather easy if you compare it with other point &amp; click games, especially if you compare it with classics. The story is.. well, it too is rather bland. The ending left me with more questions than I had during the whole game. It felt kind of rushed.  Basically, what I'm trying to say is you should ignore this game and only get the sequel if you just want a thoroughly enjoyable p&amp;c game.  So why recommend this game?! I don't really recommend it, but I don't dislike it. It's just meh. It has some good parts and lots of stupid humour. You know, the type of humour that makes you facepalm, sigh and roll your eyes? Yeah. These games live and breathe that. So I recommend this game if you have a bad sense of humour and like adorable gnomes.  3/5 get the sequel instead.",
            "review_score": "1"
        },
        {
            "review_text": "Got to actually brew a potion.  10/10 would buy an alchemist minigame based off of this.",
            "review_score": "1"
        },
        {
            "review_text": "A very entertaining adventure game that makes fun of, well, just about everything - but in a clever way. Mostly it makes fun of gaming and its own genre (fantasy, point-and-click, etc.) and it has tons of references for anyone nerdy enough to catch them. Wilbur, the main character, is absolutely adorable and you'll grow to love him in less than a minute. The characters are engaging, you don't get bored looking at the visuals and... I could go on.   Keep in mind that the genre is point-and-click adventure. Don't expect action. Do expect to get stuck because you can't find a certain item - but armed with an emergency walkthrough you should get through those minor difficulties when and if they arrise. If you have the patience to play this genre, this game is definitely worth your time (of which you'll spend around 20 hours to complete it).",
            "review_score": "1"
        },
        {
            "review_text": "If you played any point and click game from times of old are a fan on fantasy, sci-fi or welsh accents then this game is definitely for you. Its really beautifully written and the voice acting is incredible for an indie title. Such great value for money. I havent smiled this much at a game since the old monkey island games.. 'It's ruddy-bloody brilliant' (said in a welsh accent)",
            "review_score": "1"
        },
        {
            "review_text": "You should definetly play it",
            "review_score": "1"
        },
        {
            "review_text": "I will be honest and admit that the golden era of Point &amp; Click was a little past my age. Sure, I like digging up old gems and I have played through the various Monkey Island games, years ago, but that's it.  A few months ago I came across  The Book of Unwritten Tales . I might not be a point &amp; click expert, but holy c%&amp;p was this game fun. It's humorous, it's full of pop culture references, it makes fun of other classic point &amp; clicks in an often clever, and never mean, way. The puzzles are well crafted and the solution is often delightfully improbable (in that way that, you know, 'makes sense' but only due to copious suspension of disbelief).  The music is gorgeous and the settings are very well designed, especially for a game with the kind of funding that  the Book of Unwritten Tales  had.  All in all, I would definitely recommend this game. If you just go through it with a walkthrough (which is, of course, far from encouraged) the game is a little bit on the short side, and considering it's now been 5 years since the game came out, I am not sure I would pay the full 20$ steam price. I would definitely get it if on sale though.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent old school point and click adventure game that closely captures the feel of an early 90s Sierra game, especially the humor. Wish it was a little bit longer though.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with interesting riddles, likeable characters, and lots, lots and lots of humour. Did I mention it is funny to? I'll definitely will want to meet again with Wilbur, Ivo, Critter nad Nate in the sequel.  Only disadvantage in my opinion is Rain Dance puzzle, as I hate obligatory hand / eye coordination elements in adventure games.  Still this is a great game, worth every cent. Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "The Book of Unwritten Tales, truly is a game in the tradition of the olden adventure games. Not too hard, luckily. Enjoyed it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic adventure game! Puzzles, humour, and an excellent story. Highly recommended for any fan of classic adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. The story reminds me of something written by Terry Pratchet - the atmosphere, characters and story. There was only one aspect that was missing in my opinion (spoiler alert) - I was really looking forward to play the game through the ghost mirror with Wilbur (end of spoiler). This is one of my favorite adventure games. And this is the only one that I played with such a humor in it - like the role-playing game WOB which 2 characters play in the game. Ultimately this is a game which rewards you for paying attention to the details and the dialogs. I highly recomend the game.",
            "review_score": "1"
        },
        {
            "review_text": "i recomend onlly for peoples that likes to think alot.",
            "review_score": "1"
        },
        {
            "review_text": "*Gnome Seal of Approval* This is a classic point and click adventure. The humor here is just great and I haven't laughed as much from a game in a long long time. There are references to all sorts of different movies, games and books. Star Wars, Indiana Jones, WoW, Harry Potter, Lors of the Rings and more.  The gameplay is as you'd expect from a point and clicker. Not exactly challenging, but for me the journey is the important part in games like these, not the challenge.  You take control of different characters during the game. Cute little gnome, hot she elf, narcissitic human and the furry oddball sidekick. At one point u even get to control a feminine paladin.  If you like casual adventure games, this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome point&amp;click game it has a great story",
            "review_score": "1"
        },
        {
            "review_text": "I'd dare to say this is the monkey island of this generation. Fans of comedic, perhaps satire point and click adventure should pick this up :)",
            "review_score": "1"
        },
        {
            "review_text": "Best point and click since The Longest Journey - and this is saying a lot!",
            "review_score": "1"
        },
        {
            "review_text": "Game asks for wisdom an example wil be: what do you do with a rope and a net? Good question? Ofcourse it is! Goodluck with that!",
            "review_score": "1"
        },
        {
            "review_text": "This was really fun! The puzzles were for the most part logical - unlike some other point and click adventure games I have played. I very much enjoyed this, and look forward to the next one!  ",
            "review_score": "1"
        },
        {
            "review_text": "clikcy clicky :) great game",
            "review_score": "1"
        },
        {
            "review_text": "Fun point and click game. There were times when I had no idea what to do. Finding what's next can be tricky, but still enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Hated the absolutely ridiculous 'critter' and dumb-♥♥♥ 'cheep cheep' - the rest was good :-)",
            "review_score": "1"
        },
        {
            "review_text": "Greatest adventure game I've come across so far. Monkey Island fans will love this one.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Entertaining, Time Consuming, Easy on the eyes Cons: Having to wait for NPCs to become available to talk to, walking up and talking instead of waiting for everyone to get in to position is annoying.  Classic point and click game reminiscent of the old King's Quest, Space Quest, Monkey Island, Maniac Mansion, etc. The script is well written and the characters are interesting. The art is very pleasant as well as the character models. There are a few annoying quirks about the game play, might not make it replayable for some while others will play it again for sure to find things they missed the first time through.",
            "review_score": "1"
        },
        {
            "review_text": "This game was great! The story was good, nice puzzles, hilarious dialog. All around amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "Dissapointed with the rushed ending, and no last 'Big Puzzle' but otherwise a great point-and-click that shares a lot of sensibilities with The Curse of Monkey Island.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly witty adventure game with humerous dialog and references to other epic stories.",
            "review_score": "1"
        },
        {
            "review_text": "A fun, not too hard and annoying, point n click -game. 'Nuf said.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game. It's fun. Simple puzzles that don't require huge leaps in logic, and few enough options that a 'Click on everything' mentality should pull you through. Everything looks nice, the characters are likable enough. You need to be able to enjoy a good dose of meta-humor though, this game knows it's woorld doesn't make sense, but instead of trying to hide it like other point and clicks it laughs with you at it's sillyness. Example: I enjoyed one part when the question was posed 'Why do you want to go there?' and the answer was 'To look at everything one at a time then pick up anything I can, since it'll probably come in handy later.' The falseness of the world is a feature, not a bug.  That said, I picked it up on sale. I enjoyed the heck out of it, but I honestly wouldn't put down $20 on this game. It's funny, but not challenging enough to occupy you, and not long enough for me to pay full value, that's just me though. If you've got some money to spend and it goes on sale again I definately reccomend it.",
            "review_score": "1"
        },
        {
            "review_text": "The Book Of Unwritten Tales, or BOUT, is a funny, and fun game. I've never been much for point and click adventure games but I decided to give this one a try and I'm glad I did. Note that the game can be difficult, I had to use a guide several times.  Pros:  -Amazing music (I recommend getting the digital deluxe edition which includes the soundtrack) - Beautiful and imaginative scenery (which is good since you'll be staring at it A LOT) - References to many pop culture things, like Lord of the RIngs, Harry Potter - Lovable, and funny characters - I like the plot, the game is very light-hearted, so if you're expecting a kinda silly (but well-thought out) story, it keeps you interested in the gist of why you are figuring out puzzles and such.  Cons: - Sometimes I got stumped and had to look up a guide only to find out that what I was looking for was right before my eyes, just very small and very hard to notice. Which isn't fun really. But that only happened a couple times. -Not really anything else.  Overall I loved BOUT and would recommend it to anyone looking for a point and click adventure game",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game. The sense of humour, storytelling and characters were all to my liking. I'm a sucker for things that look nice and I felt this game looked wonderful.  The characters balance each other very well. I preferred Ivo and Wilbur over Nate at first, but the characters he gets to interact with are so great I forgot my initial slight dislike.  If you like point and click adventures and you have a taste for lots of fantasy references (Discworld, WoW, LotR etc.) and sarcastic voice acting you'll love this as much as I did.  There is only one fault I can find with this game: the ending is a bit too abrupt. But there's no need to let that spoil the fun, especially since there is a part two now :)",
            "review_score": "1"
        },
        {
            "review_text": "I love this game so much. I reccomend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Found it quite fun. I think it took me about 20 hours and I had very few boring moments. The main character, the Gnome, is charming and fun to play. PARENTS: in my opinion, it is fine for 8 years or older; or 12 years old if you are very conservative (there is one adult-ish or teen joke, though a child might really not notice at all).  PRICE matters: I bought BOUT I, II and the Critter Chronicles (Prequel) as a cheap bundle. I would not pay over 15$ for this game alone (as a maximal price only; otherwise find a bundle or wait for a sale).  I suggest playing the Prequel first. BOUT I is better in terms of story and style in my opinion, but the Prequel will give Critter an interesting background when you play BOUT I (Critter has no background or known concept when you play BOUT I).",
            "review_score": "1"
        },
        {
            "review_text": "I've had this game on my wishlist for a while until it went on sale and was not disappointed. Very engaging story and great characters. I loved the concept of being able to switch between them, though at times the process of switching was tedious (waiting for the character to get to the exact position the game requires just to trade an item real quick). There were a few issues with subtitles mismatching and lines going through the screen where action would later take place, but they weren't distracting. There was also one or two times where I could click on something from a previous screen, which was... interesting. Again, that didn't distract from the story and just made me chuckle and move on. There are some fantastic references that had me laughing and looking for others.   I only remember being frustrated with a puzzle twice, and both of them were simply because the solution was too specific and illogical (they may be references?). They didn't completely ruin the game, but they were the times where I had to consult a walkthrough which I do not like doing, but they frustrated me too much to find the real solution. Specifically    When trying to get red paint - there is red powder that obviously needs to get wet: I came across 2 sources of water, the paladins spit and a giant tub of water in the caves, and neither worked, I needed the tiny puddle of tears that I completely missed in the crypt. Also, needed a gold coin for the   phone booth   teleporter. Ran up to grab some from the giant piles by the throne room, but nope, I need to get into that specific locked chest - actually didn't need a walkthrough for this one - it just seemed like a silly solution   . In the grand scheme of the game, these are nothing, and like I said, may be references that I don't know/remember. All the other puzzles were well balanced.",
            "review_score": "1"
        },
        {
            "review_text": "Creative, entertaining, with lots of good fantasy art. Surprising amount of content, though it is reused quite a bit during the end.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend it. I had a great fun time with this game. So many puns, jokes and references to everything! If you like point &amp; click adventure games, and you want to smile while playing, this is your game! On a sidenote: Changing characters can get a little frustrating sometimes, but it doesn't really intefere with the gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "I liked the game a lot. Characters are sweet, story is cool. Puzzles are not so hard.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and humourous game making fun of many Fantasy and Adventure tropes, and with a villain that might actually die from emotional poisoning if you hug her.",
            "review_score": "1"
        },
        {
            "review_text": "Ivo is a whiney ♥♥♥♥♥, Wilbur is a clueless idiot, Nate is a boring ♥♥♥♥♥♥♥, and Critter is a blod that doesn't speak a lick of english.  Aside from the annoying characters, the voice acting is terrible, with pauses between lines about 2 seconds each and line delivery with very confusing inflections.  The humor is very specific, basically if you think references by themselves are funny you will find this game funny. Other than that, the game has standard meta-references to the fact that you're playing a point&amp;click.  The puzzles are extremely easy, especially in the last few hours of the game. The second half of chapter 4 is someone giving you everything you need to solve a puzzle, and then chapter five is you trading items around as the game tells you to. 90% of the puzzles are character X wants item y so you can obtain item z.   The story is boring, though to the game's credit it starts out just fine. I was excited to get to play as these characters and see them get fleshed out, but nothing of the sort happens, except for the rogue character having a forced selfless moment. The story's ending however, is one of the least satisfying endings to a game I've ever played. I won't go into detail, but prepare to be disappointed big time if you decide to play this game even after reading this review.  Not recommended, there are plenty more good point&amp;click games out there for point&amp;click fans.",
            "review_score": "-1"
        },
        {
            "review_text": "I highly recommend this game. Had me laughing out loud plenty of times. One of my all time favourites for sure.",
            "review_score": "1"
        }
    ]
}