{
    "app_id": 215280,
    "name": "Secret World Legends",
    "release_date": "2017-07-31",
    "developer": [
        "Funcom"
    ],
    "publisher": [
        "Funcom"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "MMO",
        "Online Co-op",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "MMORPG",
        "Massively Multiplayer",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 4420,
    "negative_ratings": 2106,
    "price": 0.0,
    "description": "Secret World Legends is a story-driven, shared-world action RPG that plunges players into a shadowy war against the supernatural, where ancient myths and legends cross over into the modern day.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/215280/header.jpg?t=1549637468",
    "minimum_requirements": "OS: Windows 10 / Windows XP (SP 1) / Vista (SP 1) / Windows 7 (SP 1) Processor: 2.6 GHZ Intel Core 2 DUO or equivalent AMD CPU Memory: At least 2GB RAM for Windows XP / 3GB Ram for Windows Vista and Windows 7 Hard Disk Space: 6.4GB Download (13.7 on Disk) Video Card: nVidia 8800 series 512 VRAM or better/Radeon HD3850 512MB or better DirectX®: 9.0c Sound: DirectX 9.0c compatible sound card",
    "recommended_requirements": "OS: Windows 10 64 bit is highly-recommended Processor: Intel Core i5 3.0Ghz or equivalent Memory: 6GB Hard Disk Space: 6.4GB Download (13.7 on Disk) Video Card: Nvidia GTX 560 Ti 1Gb DirectX®: 11.0 Sound: DirectX 9.0c compatible sound card",
    "reviews": [
        {
            "review_text": "When you play this MMO, as you most assuredly should do, it will serve you to remember it is not World of Warcraft. It is not Rift, or Champions Online, neither Age of Conan, nor Star Wars: The Old Republic. It is not for end-gamers or raiders, grinders or power-levelers, PVPers or dungeon runners.Rather, it is The Longest Journey and Dreamfall, Broken Sword and Syberia, Gabriel Knight and I Have No Mouth And I Must Scream. It is for seekers and journeymen, detectives and discoverers; it is for explorers, and it is for adventurers.So is The Secret World a game you will enjoy?   Familiar MMORPG trappings are apparent; there are definite systems and mechanics at play that one could use to thusly label this game, but close examination quickly reveals this style of MMO is not one that will appeal to a mass market.Beyond the limited character customisation options, the somewhat hasty justification of your avatar’s situation and subsequent induction to their chosen faction, lies an entire parallel universe to be explored. The scene set is present day, with the twist that here in The Secret World, all conspiracies, myths, and legends are true.The Secret World delivers a definite sensation that there is nothing here that does not exist through explicit design, be it the name of a town or the colour of the flowers planted in someone’s front yard. It feels as though every constituent is grounded and has a weighty history attached, as though understanding the lore is but an Internet-search away.  The mission structure is unlike any you will have encountered before. There are several types of mission, and a small limit on the number of each that can be active at any time. The translation of this is that one cannot race wantonly through hub areas, collecting missions with abandon, to turn-in simultaneously for experience rewards broaching hedonistic quantities.Neither can missions be discarded once acquired, and though it is possible to pause them to resume later, it’s not an efficient method of churning through content. Of course Funcom doesn’t actually want you to be churning at all, but to be instead involved in your actions, and to see missions through their multiple tiers and increasing difficulties to their satisfying conclusions.Some missions require a rethink of your entire MMO approach to date, and this time I can provide an example. An escort mission of sorts mandated the continued living status of my accompanying NPC. After failing twice, I resolved to level a bit and come back later, until I remembered there are, in fact, no levels.  Experience does still accumulate, but its effect is to unlock more skills and abilities. True, some of these are more powerful, but it doesn’t have the same impact as levelling in other games.Tactical skill-based combat is what's important.The skill wheel takes a while to get your head around, but basically you can choose from melee weapons (sword, hammers, and fists), firearms (pistol, shotgun, and assault rifles) and magic (chaos, blood, and elemental). Each skill has subsequent layers to unlock. You are not tied to any one skill; in fact, you can effectively have two skill 'trees' selected at one time - a Blood Mage wielding a Shotgun, for instance. You can go heavy on one skill and unlock deeper and more complex skills or you can choose to pick a scattering of each.  Visual information in The Secret World is more important than it would be in other MMOs. Clues for quests are scattered about everywhere. Being able to read your environment, not just your powers bar, is a skill to be mastered in this game.Beyond the informational side of things, the general art style and attention to detail just completely suck you in. Sweeping vistas are easy to find if you go high enough, but it's on the ground that you feel the setting. Mist-shrouded woods, caves illuminated by phosphorescent mushrooms or the occasional lantern, burning deserts, and seashores all have a heft to them visually, even when they're overrun by nightmarish creatures that by turns are fascinating and repulsive at the same time.  As with the visual, so with the audio. Sound cues are always important, particularly if you've drawn aggro from a mob, but it's the use of sound in quests and puzzles that make it a step above the norm for MMOs. Finding the signal in static, the right tones to unlock a door, even tracing a siren's song back to its origin point, there's all manner of clever uses for sound in this game and some of them will get you killed in short order if you're not on the bounce. Equally impressive is the voice acting in the game. The storyline and main quests all have voice-overs for their introductions.  There are a couple things I didn’t get into, such as the dungeons, but I never had the chance to go through a multi-person dungeon.However, I did hit a few single player dungeons and they weren’t all that bad solo.It's a blast to see an massively multiplayer online (MMO) role-playing game that doesn't go straight for the high heroic fantasy genre. Funcom has done an excellent job creating a world that is both relatable and mysterious for players to explore. The Secret World delivers an MMO experience that's distinctly different from its competitors, and it's likely going to remain the standard for future games in the horror/supernatural genre.",
            "review_score": "1"
        },
        {
            "review_text": "The Secret World is an anagram for Elect Herd Worst, a message about the false populism of democratic elections, but when you turn that into binary it's '01100101011011000110010101100011011101000010000001101000011001010111001001100100001000000111011101101111011100100111001101110100' which when you realize is actually a secret QR code scans out to a PO box in Indianapolis that contains the name of a monk who lives at the highest peak in Latveria and when you finally go to him and ask what the deep, dark secret of The Secret World is he says ' it's an MMORPG '",
            "review_score": "1"
        },
        {
            "review_text": "So, this game is good, its really good. I have never played a MMO before where such care has been taken into the writing of the game, all quests are fully dialoged and cut sceaned and this greatly helps with immersion and makes you actually start to care about the world around you. The quests range from your standard MMO grind collect fest to some of the MOST FUN and CHALLANGING puzzle quests i have played. EVER, Yes in any game. These 'Investigation' quests will have you searching google, wiki pages, local town info boards, forums, and sometimes real world peripherals. It requires some extreame thinking outside the box. THERE AMAZING more games should do things like this.  The combat is ok, you have the choice between tab targetting and action targetting, the real fun comes in the form of the combat wheel where you will use points to purchase abilitys and passives to experiment with endless possible builds. There is no lvling in the secret world, instead you upgrade weapons and gear which is either dropped by mobs or crafted, the crafting is very simaliar to minecraft where you make the item shape to produse the gear you want.  The atmosphere in this game is incredible, alot of this has to do with some really nice art and sound design, It trully makes you feel alone in this game, Only seeing a fellow person on occasion going about there business really adds to the helplesness that this world has fallen into.  This isnt your standard MMO. You wont find hundreds of players rushing from mob to mob with there flashy mounts, What you will find tho is a amazing story and some really intresting quests that i have never seen done before, So if youre looking for something a little bit different, You owe it to yourself to TRY this game! ",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game.  Cons: Can be difficult to learn Solo play is very challenging Low playerbase  Pros: I found my lord and savior Cthulhu",
            "review_score": "1"
        },
        {
            "review_text": "As far as MMOs go, I'm REALLY enjoying this game immensely.  First, to be clear: It's not going to be for everybody. If you dislike MMO-style gameplay, then look elsewhere: this game includes a (somewhat) typical (though unique in some aspects) quest system, the usual grind from time to time, and tinkering with character stats.  It also does not give you the full experience if all you're interested in is jumping into a game and mindlessly blowing everything up (which, hey, who doesn't love that, too?). Finally, the graphics aren't going to blow your mind (that's not to say they're bad. It's just...they're MMO graphics. What do you want?)  But with all that said and out of the way, I love the effort this game goes through to create such an amazing atmosphere. The story is intricate and intriguing, the main quests include well-crafted cutscenes with quality voice acting. And the quests! The quests took me by surprise!  The quests will range from your typical 'go here and kill 10 zombies,' to an intricate series of puzzles and riddles, leading you through town and exploring secret areas, and finally giving you incredibly challenging riddles that require you to do research (with a pretty cool in-game browser window) to seek out a solution. Never before have I been challenged by an MMO like I have with TSW.  And it's also the first MMO like this I've played that has no classes and no levels, pushing you to really invent unique 'deck' combinations suited to your gameplay, picking and choosing which two weapons you want to use and which abilities for each. I found I was realllly left in the dark about how this all worked, but after I did some research into everything online, everything started to click into place quickly. Which I suppose is just fine for a game that urges you to research and learn, anyway.  The subject and genre are unique and interesting, and it's a good experience to turn off the lights, and immerse yourself in the game, reading the clues and lore, learning new things, and exploring this creepy world. I'm hopeful for even more customization of character, and I think the gameplay system could be made more clear somehow, but overall, this game is a definite new favorite in my library. Solo-friendly. Group-friendly. Helpful and nice community.  Overall, you only get out of this game what you're willing to put in. If you explore and involve yourself with the story, TSW is a rewarding experience. It was a refreshing change from my years of WoW addiction, and made me brush the dust off my brain.  I'm hooked.",
            "review_score": "1"
        },
        {
            "review_text": "You can expect to play a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "The best and perhaps only consistently good part of The Secret World is the world design; the environments are generally fantastic, the story can be pretty good, and the world overall is vibrant (if a bit shallow).  The gameplay leaves a *lot* to be desired. The lack of traditional classes and level structure sounds interesting at first, but it's little more than a facade in reality. The 'classes' of the game are your weapons, which each have two different 'roles' that they're designed around -- Fist weapons heal, Blood magic provides shields, Swords deal DPS, etc -- and the result is ultimately a little more restrictive than Guild Wars (1), except very little in the game makes these equipment 'roles' explicit, leaving all of that to discovery (by which I mean the wiki). The absence of proper 'levels' in the game is just as fake -- you'll still be stomped flat if you wander too far ahead of your 'level' (or encounter a higher-level player in PvP), and you'll trounce anything below your 'level' -- the game just hides all of that information from you. The game doesn't 'unleash' you in any way; it just trades your leash for a shock collar of painful trial-and-error.  The controls and netcode are terrible. And yet, somehow, despite the fact that your player character controls like a fish flopping around on an ice rink, Funcom had the gall to include a significant emphasis on jumping puzzles in TSW. (Full disclosure: this review was the product of after two hours' rage, trying to glide my fish up *two jumps*, complete with skidding about, unregistered jump keys, jumps of inconsistent height and distance, and random rolling around.)  Sadly, the puzzles in TSW are often painfully vague, or utterly tedious. You WILL need to look up many of them from a wiki, and you WILL want to after dealing with some of these quests. For examples: translating morse code for a pattern in a blinking light that you aren't directed towards; translating phrases into *broken* Latin for computer passwords; learning a demonic alphabet so you can type more broken Latin (thankfully provided) into runes on the floor. There's a few good puzzles interspersed, but unfortunately most of them completely miss the mark.  Overall, the game just isn't worth playing as a primary MMO. If it goes on sale for $10, consider picking it up to play for a weekend or two; tour the game's environments, enjoy a few of the better puzzles, but don't pay so much that you'll feel obligated to play through the unending piles of awful that this game also offers.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a real treasure!  The game looks and plays like an mmorpg; mediocre (sorry, mmo-fans). The content and lore is of a level I have not seen in a lot of games. Through the latter I'm getting immersed in a world of fiction and one that borders our own conspiracy culture, history and beliefs.   I highly recommend this game, especially if you don't mind solo-exploring (yes, it is a mmo, but it's as multiplayer as you want it to be; not necessary), if you're into conspiracy culture, myths, monsters, puzzles (please try solve them yourself, it feels so good to solve them) and don't mind closing the curtains and locking yourself in for a couple of days.  It is totally worth it. Listen to all the conversations (exhaust all your options), read all the lore, do as much sidequests as you can, and this will be worth more to you than it costs.   Also; a bottle of wine works well alongside.",
            "review_score": "1"
        },
        {
            "review_text": "It is the best mmo currently available. There is no other online game with better quests or deeper atmosphere. Absolutely everything is voiced and most of the quests deserve to have a full game dedicated to them, If you love the works of Lovecraft, mythology, urban legends, modern setting and mature community, you will find yourself at home here.",
            "review_score": "1"
        },
        {
            "review_text": "Best singleplayer pc rpg questing game ever. Also it is online and has horriterrimegaultrabad group content. Play it like a singleplayer game, or duo with a friend and the quests will drop your jaw.  There are no character levels in a sense, you get skill points and spend them accordingly to get a variaty of skills from the giantish skill wheel, and ability points to pump into your weapons and gear levels. It's a somewhat neat system, but it feels like it's only really there to overcomplicate the 'no character levels' gimmick when in reality there are levels because you have to pump ability points into gear levels then you are rated by what level gear you are wearing. One of the main reasons why the group content is so bad, the dungeons have a recommended gear level but everyone at base gear level wants to go in asap and get carried / bring down the group.  The multiplayer aspect isn't actually that bad, but the playerbase makes it horrible. There tends to be the elitist group that doesn't allow anyone to join or even try to learn the content, then the OMGLETSGO base level players who want to get carried through all the content. The dungeons are pretty well made, focusing more on movement and awareness then mindnumbing loldps.  Now the quest system is a whole new monster. The quest system is built for replayability and actually makes you think and work for it the first time through. The quests are basically placed so when you finish one quest, you should be within earshot of another to pick up, and depending on which quests you choose, your route can change when replaying areas.   The quests aren't the normal 'go here' 'pick this up' 'defend this person' quests, these will actually make you think and make use of the in-game browser. The first area alone will make you translate latin, find secrets in paintings and artists, connect symbols to in-game items, decipher a nursery rhyme, and figure out meanings of cryptic messages. For examgle 'Time is the province of Kings and Gods. The hands of time point to truths written by Kings in the words of God. The path is opened to the enlightened.' is just one of the clues during an investigation mission. All the quests in the game are also given a cooldown when finished so you can replay them and get the full xp again; so you can actually play through the same area as much as you want with no penalty, although higher level area will give better xp so you can get some of the higher tier skills easier.  The game is a bit pricey but don't hesitate to pick it up on sale for a steal. Long as you treat it like an online singleplayer game, you won't be dissappointed. The investigation missions are definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This game has an Engaging storytelling that is unique to any MMO I have played with cinematic cutscenes for every main story mission. The mystical, creepy, and even frightening enviornments keep things fresh, Each quest although there are some cookie cutter MMO quest layouts. The overall questing does not feel grindy each quest moves you foward to the next zone and ready to explore something the real thing that stands out from this game are the Investigation quest which force you to use your gray matter and think outside the box to solve AR riddles and puzzles. Combat is basic and is not mindblowing, but its fairly enjoyable. The player customization is fantastic it can feel like a cash grab somtimes, but its completely optional since all clothing is just for a cosmetic purpose. Community is realy friendly and willing to help you out with many question especially if you join sanctuary chat room. Overall this feels like its own new brand of MMO.   I would Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, takes a little getting used to. Many areas are genuinely creepy. Interesting 'leveling' system, its gear/ability based not leveling up. Capping would be getting all the decks filled out and getting top gear items. Well written, cool characters, good player base especially for RP.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game for quite a while now. Must say, I love this game. I always keep coming back to this game.  There are three factions. Though the story stays the same and the results won't really change, it's fun to see the story from a different faction's perspective. The story is amazing, it's very emersive and engaging. It's uses real myths and urban legends to fuel the story. It's good, play it.  If you like bees and want to feel special, go play it. If you like to get dirty and love filth, go play it. If you like Ankh, clothing, werewolves, evil Tony Stark Tech, bad people, vampires, classless progression, cool story arcs, interesting plot twist or maybe bees? Go play this game.  If none of the above appeal to you, go play this game. It's still good.  Pro's: - Amazing storytelling - Myths and urban legends - Classless system (515 abilities) - Be what you need to be at any place and any time - Make amazing roles (Need to tank?? go dpstank, leechtank, mitigation tank, bufftank or healtank) - Clothing is not based on gear - Bees - Giant birds that try to kill you - Everything else also tries to kill you  Con's: - Endgame can get boring if you don't play with friends - Sometimes a little grindy - No Tilty or Bob boss - Not enough bees  Anyway, go play it.",
            "review_score": "1"
        },
        {
            "review_text": "I give TSW an overwhelmingly positive 5 outta 5  The community is fantatsic. The support is wonderful. The payment modle is fantatsic.  I like this game because there are no traditional levels and no classes. You are free to focus on building the character you enjoy. You pick two weapons to use out of 9 total and your 8 active skills revolve around those weapons. You also get to pick 8 passives. Later in the game you get access to a support weapon, of which there are 4, that has its own passive and active skill. And there are dozens of skills for each weapon type. Putting a build together like this is fun and makes you really think about how everything works together. The great thing is you can have dozens of builds all with different weapons and skills. Even different gear.  To be able to swap out your build as you need to is a HUGE awesome feature. Go from a dedicated tank to a support buffer in seconds. That's cool.  There's 2 sides to this game... one is combat and the other is missions. On the combat side there is normal PvE grinding (which I find VERY statisfying for some reason), as well as nightmare areas that have stupidly powerful enemies you should get in a good group for. There are also dungeons which are group instanced raids of various difficulty.  Missions are a bit more complex. Sure there are some 'go kill things' or 'run to X and get Z' but they are done with intresting bachground. The Secret World is telling you a story in every mission you do. You get to an area and have no idea what's going on. By talking to people, doing missions, exploring the area, actually obersving the monsters behaviors, and things like this... well it all offers you a small piece to what is going on, how it came to happen, and maybe even what happened to lead up to this. But it never fills in all the gaps. And it never comes out to tell you this stuff. You as a player need to connect the dots and really pay attention.  This same theme is how the famous investigation missions are. They are like riddles or mysteries you have to figure out by doing lots of crazy things: researching a biblical theologian's works; logging into fake websites (which are suposed to be real in game); using goggle to do actual real research... its insane! And so staisfying!!! Presently I am stuck on one of these missions now. Sometimes I put a 1/2 hour into mulling over it. Sometimes I go to the RP social meet-up spot and actually role-play trying to do work on it... showing people my notes and sharing my thoughts asking for loose tips. Sometimes I take my research ideas online and surf real life counterparts to get more understanding about what the mission is about. Sure I could go to a cheat site but that would totally defeat the reason for the game! I can put the mission down and go kill things or do other more casual missions.  The other thing I adore about TSW is the cosmetics. You don't have armor. You have stuff like talismens, rings, and charms which are not shown. So every item you see someone in is just a vanity style. The game has a lot of slots for items: head, face, neck, back, chest, legs, etc... so you can buy clothing items in game and mix/ match them up.  TSW is a very hardcore game and not for everyone. I am the type to role-play, take my time with things, and really enjoy a story. This lets me do that beyond my wildest expectations.  Sure its not perfect and I would love to see certain things added, such as player owned apartments, but its amazing as it is. If my review made you wanna try this game please friend me and I'll give you a free 3-day trial. Of course I get a little perk if you do this and buy the game, which I would appricate. I'd be glad to play with you and help teach you the basics too.  I liked this game so much I spent $200 on it to become a grandmaster (lifetime membership).... but please don't be confused! The game is buy to own. There's an optional membership thingie you can get to give you special perks. If you buy the game you never have to spend money on it ever again unless you want dlc. But dude you kvae no idea just how much content is included in the basic $30 game, let alone the $60 massive edition.  This is one of my fav all time games!!! I don't play it constantly because a lot of it is very brain racking and hardcore.",
            "review_score": "1"
        },
        {
            "review_text": "Let me be straight i have many hours in almost all popular, semi-popular MMORPGs out there.All them published since 1999 as well as many RPGs. The Secret World is... Its one of a kind.It's a hidden gem. So whats a MMORPG? Its generally and basically large maps with RPG elements where many people play cooperatively (well..most of them and many of them )  For me, The Secret World is an awesome single player RPG. Its a precious adventure game. So beautiful that many quests and missions can beat the very best RPG games or adventure games out there. Its a very well done cooperative game and a very tactical one. Its a beautiful massively multiplayer online game with many genres combined.Play as you like. Its a game where you dont have to grind many meaningless hours and be effective. Its both a cup of coffee and a big feast that you can enjoy with others. Its....the RPG game for me. And it should be for you too.  P . S : The combat is something you should get used to and love. Can feel clunky at first but beats many tab-targeted ♥♥♥♥♥♥♥t out there. The price/performance ratio is so epic that you feel the comfort and content feeling when you get it on sales. AND! dont let yourself sink into walkthroughs online.It's at its best if you make yourself solve all the puzzles and missions.",
            "review_score": "1"
        },
        {
            "review_text": "Unbelievable game. I've played RPGs all my life and I've never had as much fun as I have with this game. There's a huge amount of content, the areas are deep and interesting, and every NPC has a lovable quirk that makes interacting with them memorable. I can't stress enough how detailed the world is and how critically that supports the gameplay! Also of note, I've found the art to be a lot less sexist than in other games; rather than chainmail bikinis and hulking dudes in tinsuits, the avatars are a lot more realistic and understated.  Outside of the artistic aspects, it plays similarly to any MMO that you're used to. The skill bars are short (something I prefer). Interestingly, only 7 of your skills are active, and 7 are passive skills that are hidden during normal play. I'm just beginning to understand how deep the level of character customization can be.  A very unique feature is the investigation quest, of which there are many. These quests give very little information at the outset and ask you to solve a puzzle, follow a trail, dig up some old mystery, etc. They are very challenging, and each time I play a new one I'm surprised again at the ingenuity of the game developers.  This is an absolute STEAL at $30. I have only two problems: first-time startup was rickety and required some setup tricks on my part, but that took about 20 min to fix. Second, the game world is low on players, so you'll spend most of your time questing alone if you don't play with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game!!!!  4 Years in and it is still the best MMO I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A mindblowing work of art. The creativity in design and writing easily put most MMOs, let alone RPGs to shame.",
            "review_score": "1"
        },
        {
            "review_text": "I played this when the game went to 'No subscription'. Let me say best part on the devs. The game gets dlc almost every 5months and the player base is still high! Great customization and the story gets really good. The enviroment is well detailed along with the player and objects. If you are looking for an online game thats great i wold recommend this one and guild wars!",
            "review_score": "1"
        },
        {
            "review_text": "A pile of weird puzzles, intersecting storylines, and the folks running about the world trying desperately to keep or shove the genie back into the lamp. It not the greatest thing ever, but it's solid. Open character developement does leave the problem of how to advance, but it also gives you a fair bit of freedom to tool about with. The voice over quality pretty good, the little flourishes, refferences, and side stories all add to the feel of the world. It's a madcap little world, one I enjoy playing in.",
            "review_score": "1"
        },
        {
            "review_text": "It's like if The X-Files was written by Steven King and H.P. Lovecraft. It is amazeballs.  But it is TOUGH. Not for people looking for a casual and laid-back playing experience.  The lore and characters are brilliantly written, with fully animated and voiced cutscenes given out liberally for every major mission. They're HIGHLY entertaining, and worth sitting through. The NPC's come in a vareity of delightfully demented flavors, ranging from 'listen to the teddy bear, he knows what he's talking about' to 'we kill monsters, make them into sausages, and eat them'. This is not an exagerration. These characters literally exist in the game. It's a treasure trove of character personality.  The world is a suffocatingly gloomy work of dystopian art. It LITERALLY OOZES with darkness and creepiness in places. You'll see. I lack sufficient words to describe it. You'll see.  9/10 only because it's not an easy game for new players to get into. There's a helluva learning curve.  But if you love the paranormal/supernatural/horror genre?  Welcome home.",
            "review_score": "1"
        },
        {
            "review_text": "Secret World has some of the most interesting and well thought out quest-lines that I've ever played in a game, much less an MMO. Unfotunately the poor combat mechanics, the tedious progression system and the pieced together world really drag it down.",
            "review_score": "-1"
        },
        {
            "review_text": "A mediocre MMO, but a great single player game with social elements. You have to go into this game with a certain mindset to really appreciate it. Do you value well written quests, a well told story and an interesting setting with good characters? This would probably be right up your allyway, if you can deal with the clunky combat. If not it's best to look elsewhere.  ---MORE INFO---  Dungeons are extremely fun and among the best I've played in any MMO game so far. Community is also among the best and is very welcoming and helpful to newcomers. Be sure to /chat join sanctuary when you log in. As I mentioned before, combat is a bit clunky and slow and it can be a bit easy to screw up your build. They added decks a while back that make it easier to follow a certain skill path that can fit what your looking for. Quests are spectacular and are not your typical MMO fare. Some of them are actually quite intellectually challenging and will have you solving puzzles and using the in-game browser to research information. The lore is also very deep and if your big on sinking yourself into a good story, there's lots to find here. End game unfortunately doesn't seem to be very big, it's more about the journey then the goal in this case.  All in all, TSW is a niche title that will satisfy a certain subset of players. If what I said sounds good to you then it is definitely worth a shot. You may request a trial key over on the official forums (or here, on steam) just to try it out and see if it is for you. For a new player there is a lot to discover and do. Hope to see you in game!",
            "review_score": "1"
        },
        {
            "review_text": "It has a unique setting, great atmosphere, challenging/unique puzzles in the form of investigative missions, it's free... and unlike GW2, it doesn't crash my comp.  Gotta say, my only major gripe is the questing system (can't cancel quests by the look of it, can only have -five- total with -one- main quest and 3 side quests, along with one overarching 'zone' quest) and the fact that the character creation options can be kinda -eh-.  Still, highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "OUR WISDOM TASTES SO SWEET. TASTE AND SEE.  LISTEN TO THE VOICES. FOR THEY CORRUPT.  Yeah, so this game is a bit odd to recommend. It's an MMO, and people don't tend to think good things when they think MMO. But it's got an oddly satisfying single player storyline that touches almost every major and minor conspiracy mankind has come up with, and brings it to life.   As an MMO, it's kind of bad. But as a single player RPG? It's actually pretty damn fun, especially if you like seeing what humanity has come up with over the years.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a true Gem. The puzzle investigation quests are made for more than the average smart guy. Zombie-fest, goverment conspiracies and just plain folk like in the Walking Dead trying to survive. Millions of ways to customize your character, as the talent trees are fully learnable by your character. which gives endless possibilities to the way you want to play.  Story is deep and rich. Grabbing a quest, and not reading it could spell death to you. Or just get you plain stuck. I would recommend this game to anyone who loves RPGS and want like a elite challenge. It's good Solo, and Instance runs are great too. Always a secret somewhere in the mix.",
            "review_score": "1"
        },
        {
            "review_text": "While not amazingly visually stunning, the gameplay itself is quite enjoyable for an MMO. The quests are a bit more challenging - especially the investigation ones - Hope you like googling Latin :)   The storyline itself is what keeps me playing, I have not skipped a single video sequence - quite a rarity for me. Even the mission/quest vids help the storytelling along by setting the appropriate drama/horror feel.   It is quite an intrigiuing storyline, although each of the 'Chapters' seems to independant of each other. Each Chapter storyline is never truly 'wrapped up 100%' so that you are always left wondering if there is going to be more content to keep fleshing out that particular section.   I also like the 'open class' system, a lot of variety to 'play your way' instead of being restricted to specific builds. The ability to Load and Save your preferred combinations is a great idea and allows flexibility for gameplay.  It is easily solo-able with a number of different healing 'weapons' available to create a survival build, although in the early sections if you can pump out enough damage, you can usually stay alive against all but the larger mobs.   And the best thing?? No subscription and no crippled Pay-to-Play interface like SWTOR. All of the game content is available to play, with DLC addons availble (callled 'Issues' )  In my opinion, is one of the better models for Free-to-Play out there, as it has survived remarkably well against other titles that went free-to-play.   Regarding 5-man dungeons - I recommend ALWAYS playing as a DPS. Tanking and healing are a pretty big deal and you have to be geared in a very specific way. You will also cop it from the whole group - as you won't be able to finish the dungeon if you aren't set up properly. Best left to the more experienced players until you start reading the forums on how to gear correctly for the roles.    All in all I give this game 9/10. For what this game provides, it is highly entertaining and keeps me coming back to play it. More fun in a group, but easily played as a solo with a bit of forethought. Once again, not amazingly graphically stunning, but I don't need all the 'pretties' to have fun playing a game.   Read below only if you would like to know a little more about the paid DLC available for The Secret World ('Issues') that can be bought in-game    ***UPDATED September 2014***   I have recently purchased the additional 'Issues' and am really enjoying the new storyline content.   ********CONTAINS SPOILERS*********   Issue #5 was full of great additional storyline - great narrative from 'Tyler Freeborn' and a great spooky ending.   Loved the Indiana Jones ripoff quest (with Ark of the Covenant, rolling boulder and the new Whip auxilliary weapon) in Issue #6   Issue #7 was very tongue-in-cheek with numerous 'spy film' references and tropes. The action was great and I finally got to ride my own vehicle, A Snowmobile! ( if only for about 4 minutes lol) The storyline was in-depth and intriguing and I enjoyed the 'reveal' near the end (although I had already kind of guessed)   Plus you get the Flamethrower aux weapon, what's not to like!!!   Issue #8 I am not really a fan of so far. I may change my mind later on, but it defintely feels like it is filler content.  I'm guessing Funcom was pressured to make more end-game content, so they came up with 3 grindy 'Scenario simulations' that you can play repeatedly at different levels of difficulty.  My guess was players wanted something to play while their Nightmare Dungeon runs were on cooldown. Unfortunately, the scenarios have cooldown timers as well!!  I purchased a Tokyo pass from a vendor, which delighted me that I did not have to grind the scenarios for it ( I believe you need to purchase the Sidestories: Further Analysis to be able to do this)   Issue #9 TOKYO!! A whole new area with an additonal level of difficulty.   All enemies now have 'shields' and you have to match your damage type (AEGIS) to that particular shield type to be able to damage it.  The major drawback is that swapping between the 3 AEGIS damage types while in combat will disable your ability to attack for 5 seconds while you change them over!!!   I found Tokyo quite challenging, even the trash mobs tend to kill you if you arent prepared (eg having the right AEGIS powers equipped beforehand)  The quests were quite entertaining and now that the 'Pagan Sidestories' have been released, there is even more content to play in Tokyo before Issue #10. (Issue #9 without the Sidestories was a little sparse on repeatable quests)  Unfortunately as this area is purely end-game content, 'grindy' elements have come into play - repeating the missions to purchase upgrades for your AEGIS powers and grinding mobs to upgrade the 'research' levels on the AEGIS controllers.  Once again, some great pop-culture references from some of the NPCs made me laugh quite a lot. Can't wait for Issue #10 now.",
            "review_score": "1"
        },
        {
            "review_text": "'It's an MMO for the intelligent gamer.'  The Secret World had a lot of hype when it first began circling the web and thankfully it delivered. The repetitive quests age is over and you will not find a lack of things to kill or puzzles to solve. And when I say puzzles, I don't mean 'light the pillars in the correct order', I mean translate “Clavis Aurea” from Latin which means 'Golden Key', go back to City Hall you wandered through on that other mission, grab the giant key on the wall, bring it back, and see if it opens the door. In simpler terms, you will never have to worry about having to go kill 10 monsters for this NPC and then 15 for the next.  The Secret World is also a classless game, you aren't stuck playing the fighter or rogue. However, you must be careful what abilities you invest in, because there isn't a reset potion. Which means if you invest 500pts in swords and then decide you want to wield a gun instead, you can't relocate those points and will be weaker with the guns against tougher monsters unless you go back to a easier area. That's not to say you'll get bored with the sword, but it does make you question where to put each and every point you gain.  All and all, it’s a good MMO and well worth the onetime payment. If MMOs are your thing (and you like the World of Darkness/Cthulhu feel) I would recommend giving The Secret World a shot.",
            "review_score": "1"
        },
        {
            "review_text": "The Secret World is not a perfect game, but it is a game that is actually trying to be different.   Packed with story and challenge, the game rides it's Chthulu-Conspiracy Noir to the hilt. The community is solid and (mostly) beginner friendly, and it's short comings early on have been mostly fixed although non-gamebreaking bugs are still common.  I won't say it's for everyone, but it's a solid game that will appeal to many.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game and different from the previous MMO's I've played in the past. There aren't too many hunt X amount of items in the game which I appreciate. There is also no numbered leveling system. I like the Lovecraftian feel to it and there are plenty of creepy stories that make me hesitate going alone to certain areas. The game is a bit tough to learn and it expects you to think your way through some missions. Solving missions and puzzles are very satisfying when you finally get it.",
            "review_score": "1"
        },
        {
            "review_text": "It's an MMO for grownups. Lots of fun quests where you have to look things up out of game, and actually use your brain and stuff! There's also a good it of the down and dirty killing things, but with a storyline so good you'll not want to skip the cutcenes explaining EACH quest. Even the NPCs are so awesome and individual that you'll want to stop and chat with them... like the Sir in the park in London. You actually feel like you're a part of this awesome place. Huge open maps that you can either physically walk to and from each place OR fast travel to from a really unique hub.  My only qualm is that I wish they'd trust the player a bit more in the character creation. You can create a unique character but it never really feels unique enough. Lots of awesome clothing choices though to make up for it. You can also pretty much create whatever play style you'd like.",
            "review_score": "1"
        },
        {
            "review_text": "Great MMO. Has pretty poor character creation, but after that everything's uphill. Great community and overall a good experience. I recommend this MMO to those into mystery games and MMO games. You can't enjoy this if you dislike either of those.  Purchase this when it's on sale if you're not sure about it. Or do some research.",
            "review_score": "1"
        },
        {
            "review_text": "An MMO for an adult. No more silly gnomes, and lamass trolls who you could give a kid as a plushy. These guys are nasty, the world is gritty, and while you'll laugh occasionally, you wont feel like disney shoved its foot up your ♥♥♥ at the end of the night.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game with new innovative 'leveling' system. The graphics aren't next gen, no, but they are pretty amazing for an MMO. The story is rich and very smart, a real thinker's game to be honest. No MMO has gotten me to really care for the story like this one has. The dialogue is rich and engaging, and while at times te ability wheel prevents your character from their potential,it adds to the challenge that is this game. Definite recommend for MMO skeptics like myself who usually quit MMO's after a couple of months.",
            "review_score": "1"
        },
        {
            "review_text": "Never done the MMO thing, because the games didn't seem to be my style. The only thing about WOW I got into was Hearthstone. I was fixin to try Diablo on PS3, then I read about TSW. I thought, man that's more my kinna game. So I finally purchased the base game, and still getting familiar with the game play. I have to say, even though I'm early in the game, it has been Fantastic! I hate I found out about it 2 years after the fact, and wished it had a bigger following. I tried to sell it to my WOW folks, but bad timing on that. :) Anyways, if you're into the MMO and the Horror genre, this is the ONE! Myself, looking forward to purchasing the remaing issues.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game Hours and hours of joy",
            "review_score": "1"
        },
        {
            "review_text": "This Game is best Ive played so far, I like how there is magic and guns, with third person view I give this a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I've had expereince with many MMO's and RPG's. This one is so refreshing. It isn't the standard pick a class and level up system. This one allows you to be whatever you choose to. Whether you want to be up close, ranged, a mix between the two, or some random combination of skills that somehow you are able to make it work.  In the game, you are able to use 2 different weapons at any given time, (Not including auxilary since I still havent made it that far) which already expands your capabilites beyond most other MMO's. Now if you don't like what you chose thats fine. You simply earn more Ability Points and Skill Points (which isn't hard at all) put them into a different category and start using different skills and weapons.  All the main missions include cutscenes which are fully animated and IMO well written. Then you have side missions everywhere. Some are just there for extra experience, but most actually tie into either the main storyline or one of the main missions.  But out of all the things this game offers, so far my favorite, is the investigation missions. These missions are difficult. They make you think. They only give you hints as what to do, you have to figure it out. There are no waypoints with this one. You will have to search things up and read from books, myths, news reports, and anything else you can think of just to be able to complete these. But if you don't care for this, then just google the mission follow the steps get the experience and move on with your life like a lame person would. (No offence to all those who do this.)  I haven't experience everything this game has to offer yet, so I'll probably come back and add to this after another 100 hours of gameplay or so. Cause at this point, I only complete the first story mission I was assigned. From what I know, I still have 3 other HUGE zones that the story will go across and I've only done 1.  So if you want a simple answer on whether or not this game is worth it. Yes. No subscription, but offer's just as much content as a subscription based game.",
            "review_score": "1"
        },
        {
            "review_text": "So compellng and such a great change from WoW (I miss Vanilla Wow....), although WoW would probably have me hooked again if I spent the 5 days needed to download it all again. Only drawback is the amount of thinking needed (LOL?) I mean the game has it's own in game Google you need to use to solve quests.  I think I'll try it again though - I can see it's worth the effort to get through the first few levels - just gets a bit confusing with how to character build and what to specialise in.  An awesome concept that more people should take a chance on. And yes, it's addictive unless you have absolutely no patience! :)  Great graphics, items, lore, and really nice to be playing with 'real' people and not just NPCs for a change.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun with a large group, but the recent updates have been disappointing at best and deceptive money grabbing tactics at worst. I'll give it a thumbs up for the original storyline, but their newer content is garbage.",
            "review_score": "1"
        },
        {
            "review_text": "love it?......it even has a button for ingame web surfing. The puzzles, quests. i mean just two thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "The Secret World is a really fun MMO that is not all cookie cutter builds you are pretty free to build however you want. You are not stuck with a bad decision as the Skill and Ability Points come pretty quickly just by doing the quests or grinding the monsters in 'farming' spots. It is a fun free alternative to those games that force you to play a certain role. The free to play model used here is a good one, the market items are mostly cosmetic and the boosts are not about making you overpowered but give an alternative to grinding. All in all (at least in my opinion) this is a fun game that deserves a look if you enjoy MMORPG's. The modern setting and the story and lore is top notch.",
            "review_score": "1"
        },
        {
            "review_text": "A modern day MMO with a strong story and deep invesigation missions that will make you think and dive into the Lore. A fantasic game for any fan of Lovecraft.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. You could play all the others mmorpgs in the market and you would not find anything like this game. The combat is not that good, ok, but story, leveling up and configurating your skills are from another world. 100% new 100% original. If you don't want another wow, this is your game. Mindbreaking concepts.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not an MMO connoisseur and I've seen a lot of criticism I don't understand about this game such people might want to investigate for themselves, but if you liked Longest Journey and Dreamfall or a game that encourages (but doesn't force as has been reported) the learning of, for example, Morse Code, you should definately look into this.",
            "review_score": "1"
        },
        {
            "review_text": "One of THE best buy to play MMOs out there, topping Guild Wars. The story is immersive and voice acting is top notch (I reccomend the Illuminati faction). Grabbed it for $15 and don't regret it. Def not a game to miss out on.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 It is a very good game with new mechanics and beautiful story and cinematics making you feel like youre in a movie.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so wonderful for someone like me who prefers games set in modern-day settings. It's an excellent MMO with a deep combat and customization system, clothes that are not tied to armor, and an engaging storyline. If any of this appeals to you, I'd go ahead and pick it up when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": " Dark Demons Cry Gaia   As someone who generally avoids MMOs,  The Secret World  hooked me fairly easily with its modern-day urban fantasy setting and  Deus Ex -like approach to conspiracy lore. In presentation alone it’s a huge breath of fresh air.  The game is “buy to play,” requiring an initial purchase with further subscription being optional. The benefits to a subscription are loyalty rewards for time subscribed ranging from unique pets to clothing items, an XP boost, a 10% discount in the item store, and, most notably, ten dollars worth of currency for said item store. The store itself is home to a great deal of items, but they can ultimately be placed into two categories: Cosmetic and Boosts; even the mystery Loot Crates only provide semi-randomized bonuses that fall into the second category. Paying real money for anything that affects gameplay is really only buying an accelerator for one kind of progression or another, and progression is nowhere near slow enough to make the player feel shoehorned into spending money if they don’t want to. In fact, it’s probably far more likely you’ll find a pair of pants you  really  want for your character in the item store than a boost you can’t live without.  Being effective in combat is more about planning out builds and skill rotation than spamming abilities; players have a fairly limited number of active abilities at any given time, split between any combination of two weapon classes. Some combinations are, of course, better than others, but most weapons have something to offer any given role. The MMO “holy trinity” is present in any activity requiring a group, but because the game is classless and every player eventually learns every skill, there is significant wiggle room. One (in)famous dungeon is often done with a self-healing tank, for example, while the group’s healer switches over to dedicated damage-dealing. Another dungeon usually sees the damage-dealers also playing support roles to help the healer deal with the bosses’ tendency to spam damage-over-time effects.  Aside from things specifically meant for groups, the main meat of the game can be experienced from start to finish by a solo player, although this severely limits play options; a soloist will have to be able to survive on their own, requiring some form of healing or tanking ability, usually the former. Co-op’ing the story and sidequests with even a single friend can result in a much more diversified experience with players able to pick and choose roles, but the capability of solo play allows players who wouldn’t normally be interested in a social experience to treat the game like a normal RPG with drop in/drop out co-op. While endgame dungeon grinds can’t be done solo by any means, the  entire  story can be played through without ever touching the endgame grind. A player uninterested in making the numbers on their gear go up will not find themselves hindered in advancing the plot.  The story itself puts most single-player RPGs to shame. NPCs are lovingly voice-acted and animated, reflected in the game’s 40GB install size. Moreover, they are written as interesting people and do not lose the player to apathy while waiting for them to just say what item they need five of brought to them. Mechanics like player resurrection don’t just have lampshades hung on them, but are actually important to the setting; being dead and looking for something of interest on the other side is required for solving more than one quest. The actual plot twists and turns around the game’s various locations, avoiding frustration by giving the player character actual progress in solving the various mysteries before bringing up new ones. There is  a lot  of story to go through; sidequests often provide relevant information, if not easy access to the in-game codex, giving a reason to do them beyond the XP reward. Unfortunately, the plot does not vary greatly between the different factions; the different NPCs one must deal with provide greater variety between them than the faction specific missions, although a point in those missions’ favor is that they are each actually the same mission as seen differently by each organization. Still, at no point did I find myself not caring what happens next, and not just for the main plot. The player is actively encouraged to wander around  Elder Scrolls  style (though the game world is nowhere near as large as that comparison may imply, unfortunately,) exploring everything. Many quests are found in the wild instead of being given by NPC questgivers, and almost every quest involves exploring the setting in some way, even if it’s only fighting back a nasty overgrowth of the local eldritch horror.  Quests are built with the setting in mind. An entire subset of quests is labeled as “Investigation,” and the game is not kidding. These often require serious thought and observation of details, a far cry from the usual MMO fetch quest. The fact that your character is given a high-end smartphone in the beginning is not just for flavor, as you will often use the in-game web browser to check information from company websites and blogs, or, if you’re very poor at puzzle solving like I am, to google the solution. There is absolutely no shame in giving up on a quest or three in this game. While the investigation missions may be unforgiving, they are rarely illogical and progress naturally; finishing one without cheating feels like one has made a genuine triumph instead of feeling like one has worked around obtuse design.  If anything is obtuse, it’s not the quest design but, rather, the UI. Why a game that has not one but two quests involving morse code does not come standard with an in-game notepad is beyond me. Fortunately, many of the UI’s shortcomings (including the lack of a notepad) can be solved with third-party plugins. Quests are also not bug-free, but the developers have been very diligent in fixing them since release. They're also very attentive towards the player base; not only do events happen regularly, they last long enough for anyone interested to achieve even the most grindy of goals and once-in-the-game’s-lifetime rewards without playing the game non-stop for a week on end.  The game does not have in-depth PvP, but what’s there is functional. Enough people play it that you’ll end up in a queue for the PvP areas more often than not. Starting players will have a stat boost when entering PvP so it can be played at any point in character progression, not just end-game. Effectiveness is entirely based on build, and the game encourages different builds not only for different situations, but for the different activities as well. A standard solo build will be less effective in a dungeon, a standard dungeon build will be less effective in the Scenario activities where each player must have some level of survivability instead of relying purely on the healer. The game makes it relatively easy to manage different builds with an easy menu for saving them and then switching between different ones.  The graphics do not disappoint. High settings put a high amount of detail on everything, from paved road to grass to buildings to clothing. The game is fairly scalable but meeting the minimum system requirements are a must, the developers have not been conservative with them. If you choose to roll a Dragon, be prepared for an experience with the uncanny valley in the intro; by and large, however, the game avoids this problem. The writhing Filth lives up to the horror people speak of it with. The baked desert of Egypt is, as it should be, a far cry from soggy, dreary New England.   The Secret World  brings some much-needed variety into the MMO space, not just for the setting, but for the effort put into quest design that makes accomplishing things both interesting and fulfilling.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Many reviews call it one of the most underrated games out there and I have to call that pretty accurate. MMO in a modern environment with all kinds of fun twists. The game has a great mix of zombies, cultists, conspiracy theory, and other crazy subjects that just fit well. It keeps some of the favorite MMO conventions like tank, healer, dps roles---but at the same time, breaks away with a fairly complex skill system. The game is overwhelming and pretty hard at times and always a bit strange--but very few games have captured me like TSW. The quests are actually interesting and varied. The cut-scenes remind me of GTA a bit in style and do a good job of drawing you in without being too long winded.",
            "review_score": "1"
        },
        {
            "review_text": "Dark twisted game which will claim lots of your free time! Totally awesome and EPIC!!  1 down side to game and i cant believe i'm saying this !..... but here goes  the character builds are to complicated and too serious for casual gamers! if u want an easy or just a quick story ..... then don't buy this game , this takes epic amounts of time and grey matter....(brain power for those who are.... wondering!!??!!??)",
            "review_score": "1"
        },
        {
            "review_text": "A damn fine story driven MMO that takes its cues from Cthulu mythology",
            "review_score": "1"
        },
        {
            "review_text": "The Michael Jordan of MMO. Except it's not cocky as ♥♥♥♥ and salty about Lebron.",
            "review_score": "1"
        },
        {
            "review_text": "Intriguing concept, unique gameplay (particularly the Investigation missions), and an engaging atmosphere all help make this game among the best MMOs I've ever played. Definitely recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't gotten very far, but this is the first MMO that's actually captured my attention for longer than a few weeks. It's a fresh take on the genre with an unconventional leveling and class system, as well as some really interesting quest designs that you don't see in other MMOs. I highly recommend it. Pay only once! No monthly subscription!",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, easy to play my only complaint is that the combat is a bit of button mashing but the story line and graphics have made it fun to play. Its worth a try seems to be alot of content.",
            "review_score": "1"
        },
        {
            "review_text": " Mysteries, X-Files, Cthulhu and oh...",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. The environment and setting are far better than any other MMO I have played. The fact that a large majority of the quests in game have voice acting and cut scenes sets it apart right away.   The gameplay is fun and feels more involved than other MMOs. The quests require actual thought and I have found myself using the built in web browser to look up random facts to figure out how to solve the current puzzle many times. If you try to solve every puzzle on your own without looking up the solution this game will keep you entertained and sometimes stumped for days. Even the few and far between 'gather' quests are all unique. There are awesome dungeons 5 man+, random server events where you are tasked to work with people on the server to defeat things that appear, PvP and a great guild(cabal) system.  The leveling system is great. No levels.  Ok levels.. kind of.. whenever you gain enough experience you unlock ability points to put into either skills or areas where you can modify your stats. At no point are you locked into a class you can spec for another class and switch when you like with the points you gain from 'leveling' and no cap or even really a level number(as far as I know)  The story is really where this game wins though probably due to the extra effort put in for the voice acting and very regular cut scenes. The missions as I said above really make you think and keep you invested in what is going on. The amount of lore you can find either by the hidden lore items you find or just by talking to quest givers and NPCs that you find is insane. If you play.. when you play.. make sure to click the dialog text multiple times I did not know about that when I first started. The NPCs have a lot of dialog if you are into that. The lore mixed with the awesome environments makes this game by far my favorite MMO.",
            "review_score": "1"
        },
        {
            "review_text": "A myriad of myths and legends. This former pay to play MMORPG is now a pay-once play forever.   Setting in an array of apocalyptic, corrupted version of our everyday society. You are chosen by the secret powers that be. From The Modern Masons of the illuminati. To the extreme, lightsworn of templars, or the chaotic, enigma that is The Dragon.  You affiliate yourself with one, that you best beleive has the answers ( or prizes ) you seek. The game itself demands a very high-end computer. The game itself isn't very forgiving on traditional grind to level players. One must immerse themselves on the dark storylines and the cinematics therein.   Enemies consist from the Darkest corners of the mind of Lovecraft. To the word of legends and myth of the forgotten past. If you're sick of killing little bunny heads made out of jelly, (not saying its GrandFantasia* ) and desire a more climatic and adult based rpg. This game will offer this and a unique method of battling.  And remember. ' Dark Days Are Coming '     * ( Totally was talking about Grand Fantasia )",
            "review_score": "1"
        },
        {
            "review_text": "I wouldn't want to spoil anything for anyone so I'll just say it's a solid 9/10 game. Gud game systems, story, puzzles, fighting systems, and gud player base. Not too big but not too small either. Really makes you think unlike a lot of other games. In a word, refreshing.",
            "review_score": "1"
        },
        {
            "review_text": "- Graphics are awesome (if you have the hardware) - Storyline is awesome - Quests are awesome - Skill system is...complicated (but awesome once you figure it out) - No classes, totally open - 9 weapons. 3 guns, 3 magic, 3 melee - 3 factions. Illuminati, Templar, Dragon - ARGs (alternate reality gaming, look it up)  From 0-100 I give this game at LEAST 90 Add 5 points if you have hardware to run it on ultra Add 5 points if you enjoy conspiracy theories  If you ever enjoyed an Alex Jones podcast, you will adore The Secret World.",
            "review_score": "1"
        },
        {
            "review_text": "Incredable, one of the best games i have ever played. Great atmosphere and setup, love that you have total freedom to do, whatever you want without following any story unless you choose. 10/10 Bes gam 1998 ",
            "review_score": "1"
        },
        {
            "review_text": "Most of my hours are on my actual client. I have mix .5/.4's and all MP on NM dungeons. Instead of a basic review just tossing down a few styles that these games have.  General: Pros: Good atmosphere Good lore Easy to jump into and no sub fee Fun Combat  Cons: No huge point to factions. Very small MMO so once your played one char to max, thats it. Re-rolling means going through the exact same content.   Solo play (Questing / overworld) Pros:  Very well written Very nice voice overs/cut-scenes. Excellent quest design with multiples 'types' (Kill/Stealth/Investigation which is a 'puzzle' mission). Easy to get around (its quite literally a hub based MMO with all zones off 1 main hub). Some type of 'theme' for everyone. Best pick-up quest system ever. Never too overwhelmed, but never left with nothing to do/find. Fully repeatable content.  Cons: Weak, short, and disappointing main story (that basically says 'hey, we will finish this later'). VERY linear. Incredible so. You just going to be going from Zone A-&gt;B-&gt;C with no choice in the matter. 8 'main zones' to quest in so a very small world. No real reason to Re-roll since 95% of what you will be doing is the exact same quests. Can be rough for those who don't know MMO basics. While it tries to do everthing, it can be jarring in enviorment. Like Solomen island? Well thats it, it doesn't continue to be like that the next two area's.  Endgame Instance (5 - man) Pros: Very well done fights. Best loot pinata (wow style) dungeons ever made. There is always something worth looting due to BB/upgrade system. Mild flexibility Decent dungeon progression. Enjoyably repeatable. Nicely defined roles  Cons: Meta seems to be require 'X' from 'Y' role. Tank passive flexiblity is hit hard due to required passives. Can't skip cutscenes....EVER. Its neat the first time, not the 100+ times. Some dungeons *Especially* the upper ones are buggy, and most likely will never be fixed. Dungeons are very rarely expanded on. Prepare for 1 new dungeon a year if it keeps at this rate. Top heavy so new players to endgame are left floundering unless they join specific channels etc.  Endgame (Raid) Pros: Decent fights, nothing grand, but not bad. New York Raid (NYR) drop rates are fair. Always a reason to raid NYR due to upgrade mechanic Item drops provide unique effects that are desired (NYR) Pugs are often for raid content so guildless players have a shot (if they can manage to get invited w/o kill proof)  Cons: Only 2 raids, but the Kingsmouth raid drops are so lackluster, by the time you can kill him he isn't worth it. Only 1 really raid worth doing means you are stuck with the raid for a long time. Not much flexibility for guilds due to lockout + 10 man + 1 raid. Requires a decent machine to run it well. Even 10 man's can get quite hefty. Pugs often require kill proof leading to the WoW mindset of 'Link acheezement first plz'.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good, it has pretty much everything in it, the pics on the review when buying don't give it justice. As for the game play itself, once you get used to the controlling of the character and immerse yourself into the game, time ticks by really quickly. the story is huge, and then having mian missions and side missions to help gain AP for lvling, there are hours of play just in the first area, without moving to the next.   Well worth the money, i give it the thumbs up  Cheers",
            "review_score": "1"
        },
        {
            "review_text": "While it certainly is a MMORPG, it doesn't play like one, in a good way. Most of the early content is solo-able, and the mood and atmosphere involved is certainly better than most MMOs I've played.   The first unique thing about The Secret World (TSW) is its setting. Unlike the other MMOs out there that are either sci-fi or fantasy, TSW is set in mondern times, though there are certainly fantasy elements (magic). The setting reminds me a lot of Vampire: Masquerade - Bloodlines. Slight horror elements with a lot of Dan Brown/Lovecraft influences. The writing is rich, and my favorite thing about TSW has to be its quests. In addition to your typical fetch quests, TSW has investigation quests. True to its name, you really have to investigate, solving riddles along the way. For instance, one quest's puzzle required looking up a certain bible passage while another needed you to translate a phrase into Latin. Being able to solve these investigation quests without any online walkthrough help, even non-spoiler ones that drop hints, is a rewarding achievement all on its own.   The biggest concern about TSW is its combat. It is similar to Guild Wars 1: 7 active and 7 passive skills that you choose from your repertoire, and the targeting system is quite similar to GW1 as well, though a little bit more clunky. For instance, while in GW1 using a skill automatically turns your character to face your target, here, if you're midcasting a skill and you break line of sight with the target, the skill is interrupted, so turning the camera is needed against agile enemies while hitting the skill hotkeys.   Anyway, if you're a fan of any of the following: good writing, Lovecraft, Dan Brown, GW1, and Vampire: Masquerade - Bloodlines, then I strongly recommend this gem.    ",
            "review_score": "1"
        },
        {
            "review_text": "i love this game so much its turly a good game and promising game highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "Excellent gothic horror enviroment. Glad I bought it. A nice change from world of warcraft.",
            "review_score": "1"
        },
        {
            "review_text": "The Secret World is a great MMORPG. Players choose one of 3 secret societies to join - The Templars, The Illuminati, or The Dragons. Each of these organizations has their own base of operations and a rich history (Though the Dragons are fictitious). The game gives you access to 9 weapon trees, and unlimited Ability and Skill Points to spend. As long as you continue to complete quests, you will receive both AP and SP, and there is no cap as the goal is to eventually unlock every ability and explore every weapon tree. This game is a great experience, and I would highly recommend it. The fact that there are no subscriptions makes this a great MMORPG to pick up and play!",
            "review_score": "1"
        },
        {
            "review_text": "The setting is what originally got me to buy it. When I first heard about it, I figured it would be like Hunter: the Vigil but online, and settings-wise, it is similar.  What has kept me playing are the NPCs and the ability system. I play with subtitles on and I take screenshots all the time because of the awesome, funny, or insightful things the NPCs say. Player abilities are built around selecting 2 weapons, 7 active powers and 7 passive powers. It gets more complicated as you go because synergies emerge as you earn powers that set conditions and then exploit them. There are no experience levels; content is separated mainly by the quality of your talismans (talismans because pants and shirts are divorced from in-game effect, freeing you to look how you want).   Group roles tend to fall into tanking, healing, support and damage. You are free to change roles any time you aren't fighting: just use the gear manager to switch between ability and equipment sets.  Every MMO seems to want to avoid the 'kill 10 rats' type quests, but The Secret World is one of the few that succeeds. Those missions still exist, but they are clearly labeled Action and they appear along side Sabotage missions, where the player must avoid detection and Investigation missions, which actually require researching the clues on the Internet.  PvP is the primary deficiency I've seen. It is kind of unpopular and my computer can't handle it. (Assault rifle particle effects can be crippling.)  TL;DR - Not a straight WoW copy and great if you're into Lovecraft &amp; World of Darkness",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy playing this game. And te gameplay style is quite different than WOW. If you are fans of L4D and MMO, I recommend this to you.",
            "review_score": "1"
        },
        {
            "review_text": "If you are an mmorpg gamer you should defenately buy and try out this game.It is not Wowish , it is not an sidescrolling mmo and it is not your typical korean 3d-mannga like game. With a modern time setting where every legend is true , be it urban or not, you can meet cthulic monsters,norse gods and even Dracula himself blending in with the games native overpowers the Filth and Gaia.  This game is worth itfor the story alone.Play it as a single player and leave it after you finish the story line.",
            "review_score": "1"
        },
        {
            "review_text": "A great MMO. One time fee. Underappreciated.",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand what was so secret about the world. Everyone of the 3 people that played the game knew about the world.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. My boyfriend pulled me away to play some other MMORPG, but all I can think of is getting back to this one. I really like the more modern-world setting and the supernatural lore. Much more up my alley as far as my interests go.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game for all fans of White Wolfs World of Darkness setting and atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "The Secret World is an underrated gem in terms of popularity, with an unique psedu-real world setting and mythos. Funcom once again proves that with just alittle discipline and polish it could make a name for itself in the games market, but falling short. I adore the mission styles, moving away from typical pig intestine fetch quests.   Graphics:7/10    Gameplay:8/10    Music:8/10b]  ",
            "review_score": "1"
        },
        {
            "review_text": "This is the best MMORPG I've ever played to ! I definitely recommend it.  - The content is really mature and dark (Lovecraft influences), missions aren't about killing mobs only but it also involves stealth missions (don't try to kill mobs there you'll end up dead) and investigation missions (trust me you'd do things you'd never imagine doing while playing a game).  - The universe is modern which is not common in MMORPG and it's very refreshing.  - The gameplay is amazing, with 3 weapons (2 main and 1 auxiliary) you can create tons of build among 525 abilities (active and passive) depending the situation you're facing, there isn't level progression in the game and you can switch role (dps, healer, tank) at any time of the game but end game is more appropriate to do that.  - The main story line is catchy and interesting. Templar, Illuminati, Dragon ... Chose your side.  - The community is really involved in the game and is mostly really mature (especially during event time).  Well I guess you can easily notice my love for this game however there are still few negative points about it.  - As much as I love pvp in this game, it takes sometimes a long time to enter into pvp area due to the lack of pvp players.  - The game engine suffer of some optimization problems especially when it comes to gather a lot of players at the same place (lots of fps decrease) and it also happens randomly at some specific places (and it's not a question of computer hardwares).  - Developers are slow to release new contents even tho there are lots of things to do in The Secret World.  Besides these few negative points, I must confess that this is one of the best game I've ever played to and I definitely recommend it if you're looking for a whole new experience !",
            "review_score": "1"
        },
        {
            "review_text": "This is a unique like there's no class or level in this game. be whoever you want to be and choose your own path, play your own style :D (bad grammar)",
            "review_score": "1"
        },
        {
            "review_text": "I was pretty excited for this game for a long time. It was kind of disappointing though. The story was good and I enjoyed it but the overall gameplay is just boring.",
            "review_score": "-1"
        },
        {
            "review_text": "For the LAZY PEOPLE! - If you want to see a PRO-CON list immediately, click 'Read More' and scroll DOWN! Categories !!! - Positive commentary. !*!*! - Negative Commentary  !!! - I can't recommend this MMORPG enough. I can't get enough of it. Been playing it non stop recently and I don't think it'll end anytime soon. The game mechanics are superb for the style of gameplay it utilizes. Gunplay and melee combat and spectacularly executed, and I have seen few games that can pull it off. Especially in an RPG style game like this. The magic is also well done. Each weapon and fighting style can be combined in hundreds, if not thousands of different ways! The skill trees and the abilities are very well done as well as thought out. Once you learn it, it becomes quite easy to figure out what you want to do with your character, and at that point, the posibilities become endless.  !!! - To start, one of the most important things I really want to mention about this game is it's setting and style. It is MODERN DAY. And there are no fairies or anything! Which is a really fresh getup with the game. Now you're probably thinking, 'There are muthical creatures in this game!' Yes! There are! And each one of them are gruesome, disgusting and AWESOME! They look beautiful. Much different from a futuristic and fairytale style setting. Oh! And I forgot to mention. It has the Illuminati, Templars and Dragons! Secret Societies for FACTIONS!? That's a win/win for everyone.  !!! - You could become a pistol dueling swordsman, a elemental mage who uses shotguns, and even an Assault rifle marksman who bashes enemies heads in with a HAMMER! The combinations and playstyles very in so many forms it takes player variety to a whole new level. I still have yet to use all the weapons and magics with all their main inner ring abilities.  !!! - The questing as well! Man oh man, whoever designed the quest lines and missions on this game knew what the heck they were doing! Along with the main storyline that you play along(which is also extremely compelling) you are allowed to do extra missions along the way with an additional set of 3 extra side missions possible. Now they are not given to you, but as you move to your next objectives you can pick them up along the way, rewarding you with money and some awesome trinkets and gear.  !!! - The game mechanics are also something extremely notable. The way combat is done is fairly simple and straight forward. It is hotkey based but is simplified to the first 7 number keys on your keyboard. You can apply 7 active combat or supportive abilities of which are all really fricking awesome! Along with that, passive abilities (7 of them as well) can be activated as well! This makes loadouts limited, but it allows you to experiment with combat combinations and permutations.  !*!*! -As for the bad parts, there is few to say but the ones that are there are something to note of. Grinding is definitely an aspect of this game, but it doesn't really feel like it as you have much to explore and kill. But repetitive killing will come if you are focusing on acquiring AP and SP points. And there is no Leveling up system, which is pretty cool but it makes guidelines for the newer players hard to follow as they try to progress.  !*!*! - The monsters and enemies on this game are a problem as well, especially when trying to get through the storyline. Determining whether you can fight and KILL the monster you are about to engage is hard to predict since there is no definite sign. Fighting something you can't kill is of serious consequence since you have no real ability to flee. The storyline throws you through missions/tiers quickly, meaning you get through the mission faster than your character can keep up with. So you WILL have to grind and wait a bit to be able to kill or fight the monsters coming up in the next section of the mission.  !*!*! - The learning curve on this game is also a bit of a moderate level. The interface and hotkey tutorials is easily forgotten so you will have to dock some time into learning it. Understanding some of the combat mechanics such as Resource Pooling and Ability screening can be a bit tricky. Figuring out what your supposed to do, how to get stronger character wise, how to get better clothes and MUCH better gear can also be a bit of an issue for new players unless they delve into some research. Noobies might find it frustrating a bit to figure out what they're doing.  The All in All:  PROS -The Factions are Illuminati, Templars and Dragons. Awesome in a box. -New and Fresh setting. Set in the Modern Day rather than fairies and Knights in shining armor. -$29.99 is a GREAT price for what you're getting. -Combat is fun and well executed. -Great Mission and Questing opportunities -Graphics won't murder your computer. (CPU may be an issue) -Thousands of different play styles and combat combinations. -Really. Fricking. Fun.  CONS -Learning the game is a bit tricky. -Character Development vs Monster Progression is hard to keep up with. -Some might find the game a bit repetitive in combat.(Vary your playstyles as you go through! Don't stick to one or two weapons!) -Most of the ways to make yourself look cool is by paying REAL MONEY. But it is not a requirement. Faction armor is provided.  The Verdict, Should you buy this game? YES! For 30 bucks you are getting a SWEET deal. Any MMORPG fan is going to fall in love with this game. The factions are each unique and great! The weapons and magics are all cool and well designed. The quests feel endless. For not subscriptions, this is a MUST BUY! This is definitely a 9/10. I say 9/10 since there are definitely some fixe(not just bugs) and tweaks dearly needed. But otherwise, almost perfect. Get. This. Game.",
            "review_score": "1"
        },
        {
            "review_text": "Are you a fan of Chuthulu? MMORPGs? Killing Demons? Zombies? Vampires? If you answered yes to any (or all) of these than this might just be the MMO for you. There are no classes or levels. You pick your starting weapons (guns, melee or magic) your group (illuminati, Templars or the Dragon) and off you go to solve the mysteries of The Secert World!  While this game suffered early when it was released it has since been updated and refined into a decently made MMO that has a strong committed base of players. The missions you get sent on will test everything from your characters strengths to how intellegent you are. I highly recommend keeping a pencil and notepad near you while playing if you don't just want to Google the answers for the Investigation missions.  8/10 - Graphics 8.72/10 - Story 7/10 - Innovation 10/10 - Replayability 9/10 - Sound &amp; Music 10/10 - Challenge (without being frustrating)",
            "review_score": "1"
        },
        {
            "review_text": "SECRETS AWAIT IN THIS MMO DEVELOPEDBYThe Cable News Network is an American basic cable and satellite television channel that is owned by the Turner Broadcasting System division of Time Warner. The 24-hour cable news channel was founded in 1980 by American media proprietor Ted Turner. WikipediaThe Cable News Network is an American basic cable and satellite television channel that is owned by the Turner Broadcasting System division of Time Warner. The 24-hour cable news channel was founded in 1980 by American media proprietor Ted Turner. Wikipedia END me  wikipedion",
            "review_score": "1"
        },
        {
            "review_text": "one of the best MMORPGs currently in the market til we get archeage.",
            "review_score": "1"
        },
        {
            "review_text": "(Review made after around 150 hrs in the game ; played as an tank/offensive-tank character)  Good story : check, refreshing setting : check, good writting : check, intresting mechanics if you like traditionals MMORPGs : check, customization and flexibility for your character and its build : check, awesome dungeons/raids/instances : check, intresting and varied quests (investigation and infiltration missions !) : check, good community : check, intresting PVP : check, quite cheap, you pay once any play whenever you want without any montly fees : check.  So what's the bottom line ? The interface is viable but sometimes cluncky, the annimation quality isn't fantastic and the combat pacing is sometimes quite slow, its also not so well optimized. The PVP despite having potentials however falls a bit flat for now. Belonging to a faction dosen't change much besides certain aspects of the storyline, it just divides players and exists for pvp purposes.   If you ever liked MMOs but wanted something different, more mature and refreshing : this is the game. If you're not into MMORPGs because you don't like thier gameplays do not expect this game to actually change anything, though the 'grinding' aspect is lessened by the variety of the quests and the storyline and the fact you can experiment builds as you constantly unlock new skills and weapons. This is the a game where you'll end up beign able to do everything, given you take the time to unlock skills and find suited items. At some point it even becomes mandatory as difficutly climbs higher to have multiple working builds to switch from a role to another depending on the situation  A final note : this game actually challenges you, there are investigation quests that requires you to realy think and search over the internet (prepare to be mind♥♥♥♥ed), the combat can be also very challenging (prepare to die... often) and the dungeons requires a good teamwork and learning the tricks without beign stupidly hard, and ends up beign very satisfying. The community is also much more civil and nicer than on other games in that genre. This is my prefered MMORPG so far.",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly the best MMO I have ever played. I don't really play much of the genre because I'm usually turned off by the mechanics and repetitiveness of gameplay but this game gets around that by having quests with really good writing and characters.   Purchased for 15 during a sale, definitely worth at least double that amount.",
            "review_score": "1"
        },
        {
            "review_text": "So, I'm all about MMOs now... apparently they are my favourite thing ever and all I do is play them... But again, I really like the Secret World, it a nice modern take on the genre which by all accounts had previous been fantasy based eras - WoW, Rift (Which is on here too) So this is set in modern day but with like vampires and zombies and witches and monsters and everything fantasy related... em...",
            "review_score": "1"
        },
        {
            "review_text": "I'd like to apologize ahead of time for the lack of a pros and cons or other in depth analysis you might see in other reviews. I'm just here to brown nose a little.  I don't write reviews, ever, but for this game I can make an exception. It's story telling is genius, its graphics don't even need to be good (Even though they are) because they way they've managed to capture the atmosphere is so perfect that I lack words to describe it, and the voice acting is top of the line.  The Secret World is like playing through a really good psychological suspenful, mystery, horror movie. I captures all of the best elements of story telling and its lore has a deceptive depth to it. For the life of me I cannot understand why this game hangs on the fringes as something of a cult 'classic' when it has the potential to be something huge.  Between solving puzzles and wracking my brain dechipering codes or unravelling painfully obscure mysteries I find myself at a loss for exactly how to convey just how much I like this game. It's strange really. The feeling it gives from the music right down to the appropirate scenery. Every lovecraftian thing, every eldritch monstrocity seems enough to make anyone's skin crawl with creep, fear, and confusion.  In more than 100 hours of gameplay I've played solo, I've not completely a single dungeon, and I still find this game incredibly entertaining.  I'll say this and shut up. The story writers for this game could have easily written a series of novels and even the scripts for award winning movies. Hell, even a television series would be mindblowing with the kind of writing they do. I don't know what intellects they have behind it all (Never watched the credits) but these folks are top notch.",
            "review_score": "1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "The first MMO I ever played was Anarchy Online, also by Funcom. I bought it when it was first released and played for years to come.  Since I've tried to find an MMO that I felt had as much depth as well as a breathtaking atmosphere and nothing could compare. That is until I got my mitts on The Secret World (again by Funcom - it appears they got my number). So, I'll break it down into a few categories outlining my favorite part of this game.  Story: One of the largest problems I have with MMOs is that I live in Japan, a time zone that makes it difficult to get online during the busiest hours of play. Usually when I hop into an MMO is sparsely populated and just finding a team can be nearly impossible. Therefore, it's necessary that an MMO have a solo experience that is every bit as strong as the multiplayer experience. On this, The Secret World does not disappoint. The questing and story mission are some of the best I've ever experienced in any game, much less an MMO. The number of story missions, main missions and side missions is staggering, but what's even more staggering is that they all interweave into each other, contributing to the overarching story as a whole. Everything feels connected and it's the most rewarding solo experience in a game I've played to date.  Multiplayer: At first, I thought the multiplayer aspect of the game was sorely lacking, but upon joining the Sanctuary chat channel and finally getting powerful enough to start enjoying dungeons, playing with a team really opened up. Even though there aren't that many dungeons available, they're of the quality that I relish playing them over and over with different teams. The enjoyment comes not from figuring out the dungeon, but figuring out how best to work with your team members. You can constantly tweak your build to fill in gaps in your defense or build up your offense. What this results in is that at the beginning of the dungeon, when the team is still freshly formed, the team is weak. As you plunder through the dungeon, each member slowly tweaks their build and play style to work well with their teammates and by the time you reach the boss of the dungeon, you're team is working together like a well oiled machine, soaking up hits while dishing out the pain. Or, if you don't gel well with your team and try to figure out the best way to work together, you all die.  Character depth: The reason the multiplayer aspect works so well is because of the depth of the character build system. There are no classes, you can learn any weapon on the fly. You can be a healer for a particularly tough fight, but on the easier parts, you can switch over to a damage dealer and help knock the enemies down faster. Or, you can build a leech healer that steals HP every time you deal damage, creating a nearly indestructible solo build. The ability wheel at first seemed simple, buy the most expensive abilities and equip those. You can't think about individual abilities, just like the theme in multiplayer, you have to think about which active abilities and which passive abilities play well with each other. As you dive deeper into the ability wheel, you start to realize the complexity of it all. This allows countless different builds and allows you to make a really unique character that tailors perfectly to your play style. It requires some serious thought though. I have a stack of notes on my desk of build ideas (some borrowed from others, some my own creation and some blends of the two) that I try out depending on the situation. Additionally, there is no one universal build. There is so much diversity in the enemies you come across that sometimes you have to use a completely different build just to survive. This is by far one of the most rewarding aspects of the game.  Atmosphere: Graphics have come a long way since the days of Anarchy Online. This game is nothing short of gorgeous. I have a fairly serious PC (Phenom II X6, Radeon HD 1950, 32GB DDR3) and I still only manage an average of 30 FPS, so keep that in mind. The visuals are stunning and each area has its own unique feel. Nothing feels like it has been reused or recycled. But, in a way, this game reminds me of the Stalker series of games. It's not just about pure graphical power, because in that sense, there are many games out there that can outshine it. It's about the whole package The visuals, the sound, the music, it all works in wonderful unison to pull you into the game. It's so easy to get caught up in the atmosphere and depth that I often found myself completely letting the real world surrounding me dissolve and disappear (much to the chagrin of my significant other).   Community: I've found that the community is even better than the community in Anarchy Online, which is to say, amazing. The Sanctuary chat channel in particular is a godsend. Some of the most helpful people I've ever met in a game, I've met in this game. Everyone is good natured, willing to answer any questions (no matter how menial they may seem), and even help us lowbies battle through some of the more particularly difficult situations. Getting into a Cabal (the equivalent of a guild or org) is taking the wonderful community and adding in a very strong sense of camaraderie. The community is always active, helpful, fun and downright pleasant.  Overall: If you would have asked me in my first 10 to 15 hours of play what I thought of the game, I would have said it was good but not great. If you were to ask me now (at just 150 hours in), I would say it's downright amazing. The game unfolds piece by piece, drawing you in further and further. If you're looking for a unique gaming experience you can share with thousands of wonderful people, this is your one stop shop.",
            "review_score": "1"
        },
        {
            "review_text": "There is nothing like The Secret World. In a MMO marketplace dominated by fantasy and 'space' titles, TSW has attempted to do something unusual and has succeeded. The developer, Funcom, has a history of releasing cerebral, out-of-the-box titles and TSW continues this development strategy. While not tied to a single famous IP like Funcom's Age of Conan MMO, TSW reaches into many lesser known or less celebrated genres such as spy (James Bond), explorer (Indiana Jones), and horror and also the works of H.P. Lovecraft, Stephen King, and John Carpenter as well as many conspiracy and secret society tropes found in movies and fiction.   The updates to the game are released as Issues (complete with comic book cover art) and the hundreds of game missions are connected as part of a vast, interwoven story which unfolds as the game is played. Fully voiced and animated cut scenes for main missions add to the feel of a film or television series with recurring characters. All of the conventional MMO features are here too with a crafting system, PvP, pets, mounts, raids, and guilds (Cabals) but unlike anything found elsewhere in multiplayer online games. For a new experience intended for an adult audience, play The Secret World.",
            "review_score": "1"
        },
        {
            "review_text": "Not a fan of MMOs, but this game has offered a really unique experience. Superb writing and voice acting, excellent puzzles. Well worth playing even single player.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the worst combat in any MMO to not collapse and die immediately but the puzzles and writing almost make up for it - you'll give up when one of the several shocking jumps in difficulty occur, but the game is typically available cheap enough that you'll get your money's worth",
            "review_score": "1"
        },
        {
            "review_text": "This game plays a lot like WoW in a new world. Missions are mostly interesting, weapons are new and unique, guns, magic, swords etc, but ultimatly the mechanis of using them are the same. It quickly goes from intesting to a grind fest though and i became bored fast. Standard MMO if your into that sort of thing",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Best Damn game Ive played in 20 years!",
            "review_score": "1"
        },
        {
            "review_text": "Its one of my favorite MMOs &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "The storyline and voice acting is quite good. PVE combat could use work in dungeons but otherwise is OK. PVP however is the worst I've seen out of any game I've ever played. Boring, poorly implemeted, just not fun.  If you are only interested in PVE give it a shot, otherwise don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Got punched by Cthulhu, got to punch Cthulhu back.  10/10 Would go insane from gazing into the untempered schism again.  (Serious though, one of the friendliest and most welcoming communities I've ever seen in an MMO and the game's story and mechanics are well woven together to provide a good experience for those there to kill zombies, or explore conspiracies and mysteries, or both.)",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing! I love this game! There's still some tweaks needed to make it perfect, but all in all amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. It's an MMO that plays like a single player game, and the atmosphere and lore are incredibly immersive and detailed. I read that, in some areas, you will hardly ever see any other players (by design) in order to enhance the player's immersion in the environment. Pretty kickass. The Ultimate Edition is a great deal in terms of value, so if you're thinking about buying TSW and wondering which version to get, pick the Ultimate Edition. You'll save a bunch of money on the other issues (storylines) in the long run: you get issues 1-4 with the base game, but you get issues 1-11 with the Ultimate Edition. You also get 30 days of membership, 1200 bonus Funcom points (which you can use to buy issue 12 or 13 if you felt like it), an exclusive outfit, some other items, and a bonus game key for the standard edition of the game that you can give to a friend. It really is worth it to get the Ultimate Edition over the base game.",
            "review_score": "1"
        },
        {
            "review_text": "cool game.",
            "review_score": "1"
        },
        {
            "review_text": "I've played, or watched playthroughs of, many 'Lovecraftian' games in the past, hoping to find something that got the right atmosphere without being overly shock-focused, overly gross-focused, or 3edgy5me. I'm kinda annoyed with myself that I was not aware of The Secret World before, AND that it took me almost a year between buying it at a sale and finally trying it. Seriously, wtf me?   PROS: This game is basically the tabletop RPG Call of Cthulhu, but in MMORPG mode. It hits the atmosphere and puzzles just right without being overly tedious as far as the usual grinding quests go. The monster designs are fabulous. Don't just assume that everything is zombies (I know someone who tried the beta then ignored the final release because he assumed that!) Once you get beyond the starter area the enemy diversity gets super interesting and the world building around them is amazing. I've also never encountered puzzles like this, ones where you actually have to do real world research in order to figure things out instead of just clicking the shiny things in different orders until something happens. It's inspired me to make some additions to the tabletop game that I run! The super nice thing is that the really difficult puzzles are just side quests, so you can choose how/when you take them on. Also, the quest difficuly labels change as you increase your skills/weaponry which makes it a lot easier to choose what to do next.  CONS: Unintuitive GUI. Fortunately you won't be fiddling around with it excessively, but it can definitely make using consumables in a fight difficult. The fighting itself gets to be rather repetitive and it can be difficult to switch targets, but honestly, they're just there to slow you down, increase the task difficulty and provide drops. This is not a fight-centric game. The communicty (at least at the lower levels where I still am) is also not very close-knit. I haven't encountered any LFGs except for difficult dungeons, just people soloing. On the other hand, I've had a lot more randoms just jump into a fight to help and then continue about their business once the trouble was over, so that's pretty cool. I've seen some people mention that this game would have been better as just a regular RPG and I can't really argue with that at this time.  OVERALL: the cons aren't nearly enough to keep me away from this game. It's atmospheric enough to creep me out at times (beautiful sound design, omg) which is really difficult to do, challenging enough intellectually to keep my brain awake, great enough story telling that I've found myself wanting to steal them for my own games, humorous enough that I've taken screen shots for the first time in years, and so on and so on.  BRB going to buy all the DLC",
            "review_score": "1"
        },
        {
            "review_text": "I guess this game has potential, won't know for sure until I get past the character naming. Seems as though every name is either taken or not allowed. It's possibly the worst character creator I have come across.",
            "review_score": "1"
        },
        {
            "review_text": "Not very far in, but so far it's unlike most other MMO's out there, which is a nice change of pace.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game if you like great story and heaps of fun story driven quests",
            "review_score": "1"
        },
        {
            "review_text": "I barely hit the minimum requirements. Even on the lowest settings, the graphics are better than Skyrim or Fallout. Gameplay's great. Ingame shop has cool and conveneinet stuff, but nothing you really need, which should be the point of an Item Shop. Membership gives you some pretty cool perks, but similarly, nothing you really need. Which should be the point.  Overall, best fantasy MMO I've ever played. Plenty of new stuff regularly. Lots of thought went into this and it shows.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best mmos around.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, if you like MMO's but want one with a great story this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Good idea but very very bad controls",
            "review_score": "1"
        },
        {
            "review_text": "I love The Secret World. The storyline woven throughout the game is compelling. The environment is submersive, and the music adds to that quality. The missions were well thought and cohesive, and kept me anxious to learn what happens next. I love the way you can customize your game play to suit your style of play. There is so much content and so many things to do...work on achievements, crafting, lore, unique dungeons and raids. The game also has a sense of humor. Some of the NPCs are really funny. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who hasn't enjoyed a MMORPG since the early days of Ultima Online I was rather sceptical when my brother gifted me the game for Christmas 2013. But I was pleasantly surprised and can recommend it to everyone who enjoys conspiracy theories mixed with an eerie and lovecraftian world.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game off and on over the years and everytime I come back to it I love it each time I do, it's a wonderfull game but the player community is a bit on the small side",
            "review_score": "1"
        },
        {
            "review_text": "Ever Wish WoW had guns? Ever wish WoW was set in the 21th century with the Ellurmurnurtur, Chaineezu and the Assassin's lifelong enemies le Templars? Look no further, this not too shabby cluster of randomness is just for you.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game to get immersed in, with a good eye on balance too somehow. Once you understand how the game mechanics work (items, questing, gearing), you see really see how talented the game designers are.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best mmorpg's ever created and it does service to the Lovecraftian tag so well that it's not funny, 11/10, still playing it.",
            "review_score": "1"
        },
        {
            "review_text": "EPIC GET IT BETTER THEN WOW AND WOW IS DIRTY THIS ISNT GET IT NOW!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Bought the game, but was unable to register kept getting an error on their website, contacted funcoms customer service team to see if they could help solve my problem after 3 days of sending emails back and forth they kept suggesting things that i had already tried multiple times and kept asking what my problem was even though i mentioned it many times in the end they said they can't help me with my problem, even though i had already bought the game and that it was their problem i couldn't register an account on their website. Their customer support sucks!",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun. Different style to the mmo formula, mainly in the form of a crazy amount of abilities, weapons, and awesome investigation missions. Makes you feel less like you're in an mmo, more like you're a part of some occult story.",
            "review_score": "1"
        },
        {
            "review_text": "Easy recommendation. I really enjoyed this game, it is very unique for a MMO and the story was well done - Lots of content to keep you playing. However, the endgame game play isn't easy to break into, groups are unnecessarily elitist, leaving long queue times, and ultimately the reason I rarely play now.   For the price, 0 - end game was well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "it's ok",
            "review_score": "1"
        },
        {
            "review_text": "World of Lovecraft.",
            "review_score": "1"
        },
        {
            "review_text": "Simply put .... like some others, couldn't get the game to actually work. After spending god knows how long creating accounts here, creating another account there .. which it asks for full payment details during that process ..... YOU DONT NEED THEM FUNCOM !!! ... I bought your game, There is NO Subscription you can have credit card details IF i choose to buy anything. Then when i finally bit the bullet and added paypal to keep it happy, the game claimed My Account Is Frozen so still couldnt Login .. contacted Funcom, but Never heard back from them?? Any time it shows logged on this game was spent just trying to get logged in, Thank God Steam gave me a refund",
            "review_score": "-1"
        },
        {
            "review_text": "Really awesome graphics and story but combat is boring and even the skills are extremely similar from one weapon to the next",
            "review_score": "1"
        },
        {
            "review_text": "probably the only MMO that's held my attention for more than 2 days brilliant story and more than the usual kill 10 rats quests of other MMO's",
            "review_score": "1"
        },
        {
            "review_text": "It fnckin awsome shiznit",
            "review_score": "1"
        },
        {
            "review_text": "A different kind of MMO. Great for all conspiracy theorists alike!",
            "review_score": "1"
        },
        {
            "review_text": "Been playing TSW on and off since beta.  Illuminati = ♥♥♥♥♥  Environments are legit spooky scary. I give it 8/10 skeletons.  Indepth multi-classing gives illusion of choice in the beginning of obv if you're hardcore neckbeard gamer, that falls to the wayside for endgame.  Voice acting is k/10, I legit have a giggle m7 every once in awhile due to NPC dialogue while my guy looks at them like they're autist feminists with rabiesAIDs.  Graphics look decent for when the game came out.  Overall Popcultureconspiracymaymay the MMO gets a 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Recomended.",
            "review_score": "1"
        },
        {
            "review_text": "love this game",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game if you like to be challanged, but THE COMMUNITY IS UTTER TRASH NOONE AND I REPEAT NOONE EVER TALKS OR WANTS TO TEAM UP TO PLAY also there is alot of work that you as a player have to do meaning look up things in a real bible and know latian thank god for walkthroughs since THE COMMUNITY IS UNHELPFUL AND ONLY OUT FOR THEMSELVES as well as tons of solo instances but other then that this game is great all around just wish the community was better",
            "review_score": "1"
        },
        {
            "review_text": "This game has grown quite a bit since it first released. I played beta and was not impressed. I am really enjoying this game now. I've played about 25 hours as of this writing and have enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is about the story. Such an awesome story. And puzzles, oh my. This game requires you to research everything from Hebrew alphabet to Egyptian mythology, translate Romanian, research pharmaceuticals...and so much more. Very dark horror themes. Play this long enough you WILL dream about it. And you will catch yourself humming the music. Especially a certain Lullaby. This is a damned smart game, and I love it. Mechanics - the combat doesn't suck. There are way better combat mechanics out there, and if that is a primary issue for you then you probably want to keep walking. The deck system is nicely complex and lets the biggest control freak and stats fan have hours of fun putting together builds. But when you hit Issue #8 in Venice they added a new mechanic that is really grind heavy and then becomes essentially useless when you hit Tokyo. I suspect player retention would improve if they stripped that out completely. The scenarios are a fun mechanic and nice for grinding for purple gear but don't spend a lot of time on the augment business - just get to Tokyo where the most recent mechanic kicks in.  Game stability has been really good for me, plenty of tutorials and info out there from the player community and you WILL need those.  So if you love a great story and some compelling content this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "So I was playing this game, and I walked into a town hall. My instincts told me to look at the clock, and wouldn't you know it, the clock had two hands! So I used this information to solve every mystery in the game. I did it.",
            "review_score": "1"
        },
        {
            "review_text": "This an amazing game to play solo and is even better with friends!",
            "review_score": "1"
        },
        {
            "review_text": "'insert trash review about being kind of good'",
            "review_score": "1"
        },
        {
            "review_text": "This MMORPG is the only one which makes you think. For this it deserves all the awards of the video game industry.   - A guy who's really fed up with badly written dumb games and who'd like to enjoy better scenarios and gameplay for god's sake",
            "review_score": "1"
        },
        {
            "review_text": "Simply put, too much of the content is gated by additional purchases via story packs.",
            "review_score": "-1"
        },
        {
            "review_text": "Best story, lots of fun. Give funcom money.",
            "review_score": "1"
        },
        {
            "review_text": "This game required alot of work just to set up and still i couldn't fix it, I do not reccomend unless you actually know how to fix ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Not so secret anymore!",
            "review_score": "1"
        },
        {
            "review_text": "BEST MMORPG OF ALL TIME.   If you like fun games with lots of content that will keep you entertained for a good couple of months or even years then you should give this one a try.   If you like games like World of Warcraft but wish there was one set in a modern apocaliptic world with guns and spells and melee stuff all together AND WITHOUT A PAYMENT FEE EACH MONTH...  ... Then this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "I have heard of great reviews. Friends recommended it. I have put in 7 Hours of game time yet have not been able to log in and customer support has stopped responding to me. I'm glad I got it while it was on a steam sale or else I would be slightly more than just miffed.",
            "review_score": "-1"
        },
        {
            "review_text": "I have not played this title in so long... I pretty much quit playing after the game decided to drop me in the middle of nowhere and hide my main quest from me. When i came back after a year or so, the game was hacked or something, i found a 'Dress' or some sort in my inventory, but when i put it on my character was naked except for panties, and two smiley face stickers on the nipples... Couldn't undo what had happened, so i quit yet again.  With these MMO titles that offer character customization, i try my very best to get my sense of fashion translated into the game, so when this glitch/bug whatever it was happened, i was disgusted and lost all interest in playing it ever again.  I am going to give this title one more chance, hopefully a large majority of the issues i had are a distant thought from the past now. Fingers crossed? Will update later if anything is different, otherwise it's a great game!",
            "review_score": "1"
        },
        {
            "review_text": "pros: nassir dancing bees  cons:  not enough bees nassir dancing",
            "review_score": "1"
        },
        {
            "review_text": "Expect to be offered incentives to 'continue the story' only to discover that there is a huge hole in the progression tree for the story between zones 3 and 4, which you will have to then buy extra 'side' content to progress through, or play dungeons over and over for gear grinding.  If you like grinding continually, get the game. If you like story and are a new player, the game is fine. Just don't expect to be treated fairly in future, and absolutely do not buy into any of their returning player 'offers' unless they're offering ALL the content. Which will probably just mean having to re-buy the whole game. Again and again and again.  Game left me feeling I'm out of pocket for gameplay I can't access, while competing MMOs with similar business models are far more welcoming.  Unless you absolutely love the setting, take your money elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is a lot more fun in third person shooter by pressing T - however, the loading screen will make the game unplayable and a lot of forum threads out there won't be able to help you out.  PS; The story with the Illuminaty is a fun start and so is the Templars, but the Dragon... Anyone playing with the Dragon will have a hard time with the story and the chaos theory.",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "i got bored of this game. it was fun for awhile but it just did not catch my attention like it did when i first started playing.",
            "review_score": "-1"
        },
        {
            "review_text": "I have a love hate relationship with this game.  Pros: THE STORY: OH GOD THE STORY. TRIPLE AAA STUFF RIGHT HERE. Every singe cutscene is animated and every single mission has a cutscene to go along with it. The writing is superb and I rate this as probably the best plot in any MMO. Attention to Detail: You don't usually notice the little things in MMO's since they aren't the point, but this game makes them the point in some missions and with a setting like the one it has, it fits in exceptionally well, speaking of setting. The setting: It's odd how few MMO's, or games for that matter (besides Deus Ex) have had any major foray into this kind of setting with multiple secret organizations in a modern/slightly futuristic world fighting for control. Its great yet brings about a layer of familiarity. Clothing: Yeah this is a pro because how many options you have. No more is your armor cosmetic since its just talismans that dont show up on your model, instead you can truly decide how you look instead of being say a person in a can. The cons: Mechanics: Read any review of Secret World and it will probably mention the god awful mechanics. Combat feels sluggish and a chore, more so then other MMO's. That and any group that is not a group mob will kill you with 100% certanty making progression fell dull. Speaking of progression you dont really discernable grow in strength you just kinda end up stronger without knowing why (usually cause gear). The big problem with progression in this game is that if you are going a one weapon build you can max out by the end of the 3rd area with many more to follow, meaning after that its just outfit collection. The stealth missions made me want to kill myself IRL everytime I got one. Not only is the stealth shoehorned in and terrible to begin with sometimes they shoe in another poorly done challenge into it that makes them so frusterating I nearly tore my hands apart at one point. Pacing: Some points of the game feel exciting and feel like you are doing things, someother times not so much. This wouldn't be unusual except for the fact its kind of a reverse curve. I felt like I was doing less as the game area went on meaning every area had some good hook, but failed to keep it.  Lairs: The biggest noob trap every which really just feels like they are there to kill noobs repetedly. Lairs are essentially end game dungeons stuck in the overworld and can be found as soon as you reach an area. This of course gets you curious so you investigate only to die to the end game level enemies you find. There is one every area so that means you need to leave areas uncompleted in order to progress which, for completionists, is like cutting yourself. Die to quick travel: A small con but one you visit a lot. In order to use the quick travel system you need to die. Thankfully there is a suicide button in game but its still a pain and damages your equipement which you then need to get fixed before the overpowered enemies rip you to shreds. Overall: I really wanted to recommend this game, I really did. I absolutly love the atmospere, I love the story and I love how its not another Fantasy MMO and tries to be something. This game could probably be one of the big MMO's if funcom fixed the mechanics of this game as honestly, everything else is bearable except for the mechanics.",
            "review_score": "-1"
        },
        {
            "review_text": "EULA agreement required to play, but there's nothing on the store page about it. EULA includes provisions radically destructive of personal privacy and security; specifically, ongoing monitoring and transmission of computer memory for any purpose in perpetuity.",
            "review_score": "-1"
        },
        {
            "review_text": "I give Up, Lord knows I have TRIED to like this game, it seems interesting but I just don't like it!  It is more Boring than anything, and to build your character is just not fun! It's more of a pain than nothing else...  I know some people like it but... GOD I just... NO!",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting game, it's kinda confusing more the most part. I'd recommend if it's on sale since It can't hold my interest for more than 20 minutes at a time.",
            "review_score": "-1"
        },
        {
            "review_text": "I am writing on a starter point of view, i know their are people with countless hours on this game but i am just going to talk about my first reaction after playing couple hours. This game is not very noobplayer friendly, the mini map is very counfusing at first. You do not get a great explanation why you should chose a spec team or group. Graphics let me down a bunch but i have hope for this game because of the weirdly addictive storyline. The story is different and intresting i could get into this game if the graphics and the gameplay mechanics were a little better.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game. The premise has amazing possibilities. But the execution ruins it.  The combat system is bad-most of the time you'll be mashing the basic attack button while running in circles, hoping you don't get hit. Since the dodge move takes a while to recharge, you'll barely use it in combat, and most of the advanced attacks either take too long to prepare or are too ineffective to use against the majority of enemies. I haven't tried the PvP aspect, but if it uses the same combat system, it's almost certainly horrible.  The quests range from 'meh' to bad. Most of the time, they're simple: go here, get this and/or kill that, return. When they try to be more complex, however, they actually become worse- the stealth quests have you use tank controls mixed with some platforming to evade lasers and (erratic) cameras, while the research quests, aside from being convoluted in general, often fail in the actual research part: you are far more likely to find an online guide of how to do the entire quest than you are to find the answer you are actually looking for.  The inventory system is also bad- the controls are wonky, the weapon upgrade system appears to be copied from Minecraft, and it appears as though you can't get more storage unless you pay for it through microtransactions.  The story is better, but not by much. My biggest problem is with the intro- you gain magical powers and strange dreams by swallowing a random bee, then either (a) a representative from either the Illuminati or the Templar comes into your apartment, tells you that they're from a secret society, then hands you a either business card or a sealed letter; or (b) a representative from the Dragon comes into your apartment, knocks you out, kidnaps you, and dumps you on a random streetcorner in Seoul. Then, after some more visions, you join the faction and are sent to do their bidding. My problem with this is that, since your character never talks except for asking questions, you are seemingly ok with being kidnapped then ditched in another country (and possibly another continent, depending on where your apartment was).  The factions are good, overall. The Templar and Dragon behave exactly how you expect them to (though I don't know how the Templar is a secret society when they have a building with their insignia plastered all over it). But the Illuminati? I don't feel like I just joined a secret society that is actually in control of the entire world. I feel like I just joined a corporation based in a sewer and composed entirely of the biggest morons on the planet.They have a trail of easily recognizable graffiti leading you to their HQ, Doc Brown himself as their chief scientist, and your boss? Within 5 minutes of meeting her she had told me her entire life story and made me wonder if my entire playthrough with them is going to be composed of jokes and references. Seriously, I don't know how they got the Illuminti so wrong, especially since all they had to do to make a good Illuminati is copy Deus Ex's.  I'll admit that I haven't spent much time with this game, but I've seen enough to know I won't enjoy the rest. It had alot of potential, but it was wasted.",
            "review_score": "-1"
        },
        {
            "review_text": "While this game is rich in the way that it tells its story parts, there are three main problems with it.  The first is that you really determine how in depth your character is going to be when running around and piecing together the plot. Normally this would be a fine example of roleplaying if it weren't for the second problem.  The second problem here being that you don't really have a character in this Role Playing Game. Sure, you have an avatar, that runs around and does things and hits all the appropriate buttons and whatnot, but you aren't really given much of an option to say anything in conversation to any one of the seemingly infinite number of quest givers. You can 'ask' questions afterward, but they don't really have much of an impact with all the people talking either like sceptics, zealots, or inferring everthing in a way that nauseatingly reminds one of 'Wicker Man'. So without any real Character building, the only role that you would play seems to come from the Society you join, however...  The third major problem comes from there being no real difference between the societies. Of course, your taskmasters are different, you have different cutscenes and different cities that you are based in, but they still all ask you go to the same places, to do the same things, and nothing changes. Aside from the lacking in character, the rest of the game holds up well. The enemies are varied and lean heavily on horror inspired literature, the difference between the gloom and harsh lighting in the game gives the palpable feel of hoplessness the game strives to achieve, and the combat mechanics are very MMO. A decent game, but not one I'm willing to sink my teeth into.",
            "review_score": "-1"
        },
        {
            "review_text": "Started off as a refreshing MMO experience, with quests that were original, intriguing and challenging - using the web to invesigate cases being a good example. However, the more you play, the more you notice the classic mmo trope of kill 20 of these, collect 10 of that, and the annoyance begins to grow. Couple this with bugs (should have been sorted by now) and a confusing upgrade system, and you have a game that, overall, isn't enjoyable to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Its boring",
            "review_score": "-1"
        },
        {
            "review_text": "lafy is here mor lik laefy isa cnanycer HA XD",
            "review_score": "1"
        },
        {
            "review_text": "If you like MMOs you should like TSW:UE. It is a little harder to solo after you reach certain levels in zones and has a slight learning curve for the slower learners. Graphics seem just fine to me for its age. You can level up by repeating quests which is nice because you can pick the ones to do over that you liked before. I am not sure if all are repeatable but most are. The story line for each faction is interesting as well. Who doesn't like the question or workings of secret societies? If the Ultimate Edition is on sale it is a no brainer to just pick this up to play alot or just occasionally for free. At full price I still think it is well worth the price. If there are any quirks in the game I don't usually worry about it unless it is a game breaker and I have not experienced any of those yet. I do have some videos of game play on my youtube with no sound or altered sound because of copyright music complaints so I am sorry about that. You can play your own music while watching. I say buy and enjoy whether you like MMOs or not since it has an interesting lore to it.",
            "review_score": "1"
        },
        {
            "review_text": "Dont even bother. you are supposed to review the game here but the problem is you cant get in. the log in wont let you. it will take you about an hour to navigate back and forth between the site of the company trying to make an external account with them and the ♥♥♥♥ing forums trying to get into the game itself. even then it is a coinflip as to whether or not you will get in or just get the 'passwords are case sensitive' error (even if your password is all lowercase and you double checked caps lock is off) save your money. dont get the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sorry but I just haven't enjoyed this game very much. Like any MMO, it can be fun with a friend but that's where the fun ends.  Good:  -Nice graphics with modern setting(something you don't see in typical MMOs) -Lots of different quests that come with cutscenes of very weird and mysterious NPCs -Lots of modern weapon options -Modern clothing customization is unique to this game- no other MMO lets you dress just as you do in real life! -Scary monsters that are fun to kill especially around Halloween season -No subscription required  Bad:  -Players used to being told what to do will be completely lost in this MMO and its unique quest structure(kind that makes you try to play detective and decide on your own what to do next) (YOU WILL BE LOOKING UP HOW TO DO MOST QUESTS) -NPCs are mostly uninteresting and ramble around hoping you care to try to decipher what they are talking about -Community is nice, but mostly non-sociable and while you will always encounter people during your adventures, majority will not care to try to help you -Higher PC requirements than other MMOs(I can run WoW and GW2 just fine with my GT 555m but I struggle to run this game at a good FPS especially in highly populated areas) -Story(s) are mostly uninteresting -PVP is underwhelming -UI is still unintuitive to this date -Lack of direction early on in the game in what weapons and skills you should focus on could result in disaster(If you don't focus on just two weapons and instead try to be good at everything, you will ruin your character and will take a long time for you to get past many quests on your own)  All this said, it's unique enough that I can see why most people recommend this MMO. I really have had some good times playing with others and I will probably continue to play this game to waste time. But it's definitely not my main MMO and I am not always having fun. At least not most of the time. Too many negatives for me to enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is massive, Lots of loot\\Equipment etc, Great Story's, Nice Graphics BUT it also has a pretty big learning curve, missions and quest's can take hours and seem to drag on. Also the missions and Quest are insanly difficult. i tried my best to get into this game but in the end found it far to hard for my skill level and found most of my time spent on the game was looking for missions or just generaly getting about.  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Old graphics on a 3 year old game. If you decide to buy it, I recomend only get it when it's on sale.  This game,'the Secrete World' isn't a secrete at all, unless you haven't bought the game.  Surprisingly enough you hope for more than what it is.     Here's the breakdown of it:       1. 3rd person shooter.  2. Zombies 3 . 3 factions of play.     Pros:  Ultimate edition includes:  free cat , outfit, 2 hats, and starter weapons All the previously released DLC's   Cons:  Graphics  Rough UI  tutorial    Overall Rating:   I would say 6/10. It's not at the top of the list but, there are far worse games out there!   To the  DEVELOPERS ,  Please for the love of  GAMING  If you release new continent   UPDATE THE GRAPHICS ENGINE!  ",
            "review_score": "-1"
        },
        {
            "review_text": "MMORPGs are bad in general and this one is no different. same tired old mechanics you've come to expect in MMOs these days. granted it came out in 2012 it gets a little leeway but that being said if you are looking for an interesting MMO... today... january 19 2015 or later.... you will be dissapointed. dont waste your money. might as well go play everquest or World of Warcraft. becuase its a ♥♥♥♥♥ier version of those games but add cthulu.... OOOOOOOooooo. sorry TSW. i wanted to like you but you really are not cool... you are actually the opposite of cool.... you are uncool. nerd.",
            "review_score": "-1"
        },
        {
            "review_text": "Does not work on 32 bit windows. Its a great game, by all means. But it was advertised as 32 bit compatible, and recently after launch a serious memory leak has been discovered. In December 2012 Funcom said they would fix the memory leak in a patch, its been two years now without any other contact from Funcom. Instead they 'encourage' their customers to upgrade their computers to 64 bit (basically getting new computers with more hardware) instead of fixing the memory leak.  That does not inspire confidence in Funcom as a company, you buy this at a great risk so dont bother paying full price. Its unplayable for a large portion of all players who first bought it.",
            "review_score": "-1"
        },
        {
            "review_text": "according to steam i have 5 hours of 'gameplay' logged... except that i havent played a single minute of this because the entire time has been spent trying to get it to ♥♥♥♥ing work! steam wont give me a refund tho, so it was a giant waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Stuck in the weapon training mission. Can't exit the area till I finish the mission, but can't figure out how to beat the mission. The directions are terrible. I think it's called the 'bulders and consumers' mission, but I can not figure out what it wants from me. Was enjoying the game up until this.",
            "review_score": "-1"
        },
        {
            "review_text": "4/10 only for Hardcore MMORPG fans.",
            "review_score": "-1"
        },
        {
            "review_text": "Basically a simulator where you live through the goth vampire fan fiction your emo step daughter writes in her diary.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't recommand this game to anyone. I know there are many positive reviews, but these people must be gettings something else out of the game.  The first 2 areas of the game are poorly designed. There are many quest which are harder than the abilities you could acquire at that level. Unless you are one of the folks that like doing a quest dozens of times, eventually you just get tiered of repeating the same quest and getting no where.  If I had not bought the game, I would have stopped playing it weeks ago. I'm at the point now that there is not enough fun in the game to justify continual playing. Use my review as a warning save you money and buy a better game. You will thank me later and you mouse and keyboard will thank you since you are not beating them in rage.",
            "review_score": "-1"
        },
        {
            "review_text": "the only reason i hate the game is because of its controls. it use WASD for cam controls and the arrow keys for character controls its ♥♥♥♥ing painful to play also the why you attack in this game is useing the number keys so try moveing around your character and face the cam the right way while ♥♥♥♥ing hordes of enemies run at you and your attacks only hit the enemies if your faceing them and .............. look its just so bad ok ................. *puts hand on shoulder and looks them in the eyes* 'just don't get this game its ♥♥♥♥'",
            "review_score": "-1"
        },
        {
            "review_text": "This game has an interesting storyline and okay quests but the combat whether its pve or pvp is the worst i've ever seen on an mmo.",
            "review_score": "-1"
        },
        {
            "review_text": "This is honestly a horrible game with the allure of a cool trailer and a big skill tree that you can’t build into without being lvl 50. You level slow, monsters respawn too fast, people kill your targets so you have to stand around and wait, the story is the only thing I can even say was alright. 1/10 because it turns on. You don’t want this game",
            "review_score": "-1"
        },
        {
            "review_text": "I will put this mildly. Funcom can go hump a bag of hammers. They're registration system is ♥♥♥♥, their process is ♥♥♥♥, and they're full of ♥♥♥♥, and they do everything possible to ♥♥♥♥ you over. While EA is easily the most vile gaming producer around, at the very least, I can say their customer service is decent--or that it's an exceptionally easy process to contact it. With Funcom, no it's just a large '♥♥♥♥ you, pelebian' from the onset. I should have seen it coming, I played AoC (Age of Conan) for a good while, but in my naivete I figured that if I just reused my old Funcom account all would be just fine and dandy. Boy was I a ♥♥♥♥♥♥♥ed dumbass.  I'll take it step by step, I buy the game, I download the game--so far so good. I log into my old Funcom account, I register The Secret Wold--holy ♥♥♥♥ this going great. So I go right into starting up the game, type in my account username and pw annnnnnnnnnnnnnnnnnnnnnnnd Authentication Failed. Wtf? Try it again. Failed. Again? Failed. How about this time? Failed. What. In. The. ♥♥♥♥in'. Hell. Ok, so turn to technical help on the forums. Try username and pw--failed. Oh that's right forum and game accounts are separate for some dumb reason. It's all good, I remember what my info was, type it annnd Failed. Try again. Failed. Try an older password I used to use back in the day. Failed. Ok ok ok, I'll reset the pw. Reset and failed. Gotta' wait 30 minutes for it update new forum info. What the ♥♥♥♥ is this ♥♥♥♥? Also, because you failed to login 5 times can't try again until 15 minutes. WHAT. IN. THE. ♥♥♥♥ING. LIVING. ♥♥♥♥.  So, now, here I am, writing this review, for a product I bought, I cannot play because Funcom's set up is ♥♥♥♥♥♥♥ nonsensical and stupid. I'm not recommending this game--not because it's a not a good game, believe me I'd love to discover if it is or not. But I haven't been able to because Funcom is run by a bunch of ♥♥♥♥ers. And that's why I'm not recommending it, because of Funcom itself.",
            "review_score": "-1"
        },
        {
            "review_text": "i tried really hard to like this game i just cant its so bad iv played a ton of mmos but this one takes the cake with bad almost as bad as this game allods icame across one day dont wast you money or 40gs of space on this trash",
            "review_score": "-1"
        },
        {
            "review_text": "This game is downright one of the worst MMO's I have played. I got it for 5 dollars and I still wish I could of saved my money. I thought it would be cool to explore the world of HP Lovecraft, but the fact that it is riddled with lots of bugs makes my experience less enjoyable.  -No leveling system. -Hardly anyone on. -Server I play on is a ghost town.  -The dungeons and raids are way to easy. -The plans for future content is very small. -They haven't added any new content in a very long time. -Doesn't play well with the newer gpu's AMD R series or Nvidia 700 cards.",
            "review_score": "-1"
        },
        {
            "review_text": "6/10 decent game. definitely not worth buying, because of its lacking gameplay. If it were a free game, I suppose it's a good game for a weekend with no other games to play, but it isn't.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is ♥♥♥♥!  I Was stoked when I first heard of it but then... ♥♥♥♥!",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game. I got banned for roleplaying on a roleplaying server.",
            "review_score": "-1"
        },
        {
            "review_text": "this game sucks. the combat is repetive the story is ♥♥♥♥♥♥♥♥ and the writing and voice acting are terrible. this game is one big massive pile of dump.",
            "review_score": "-1"
        },
        {
            "review_text": "Got this game to play with acquaintances a few years back. Needless to say we are no longer acquaintances and even so, this game was whack as ♥♥♥♥ because it's an MMO and ain't nobody got time to be grinding ♥♥♥♥. Do I like this? Naw.",
            "review_score": "-1"
        },
        {
            "review_text": "keeps coming up with fatal error after days of loading,garbage.....keep well away HOW DO I GET MY MONEY BACK",
            "review_score": "-1"
        },
        {
            "review_text": "Just your average WoW-like gameplay where you spam a button to cause damage. If that's not your kind of idea for combat, don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't usually review games with such little play time but I just can't play this game anymore than I already have. It just feels terrible for a B2P game. This wouldn't even be good for a F2P game. It's a tab target game with no auto-attack, what is up with that? I tried every weapon in the tutorial and I didn't like any of them. Maybe I'm just spoiled from all the fancy mmos I have played, but this combat is even worse than WoW. I see graphics glitches, poor performance, and this game still looks like garbage.   The only positive I see to this game is the narrative. Maybe if this game had a different developer that actually cared about the game it would be good, but it doesn't even feel finished. I would think after 4 years this game would actually feel fun to play, but it just doesn't. I feel bad for not giving it a chance, but it's just not fun. If I by some chance manage to stomach the game a little further and my opinion changes I will update my review.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game I've ever purchased on Steam. I wasn't expecting a lot, maybe something interesting and new to pick up and get into or even just a whim purchase as I've heard so much about it however my 'whim' resulted in a wasted 25 bucks, it was absolutely mundane and quite frankly tiresome. It's a weird mixture and If you're intrigued I suggest you try to play it on a friends account (if they own the game obviously) or just be stupid enough to shell out the cash and witness the boredom.",
            "review_score": "-1"
        },
        {
            "review_text": "This is literally the -WORST- game I've ever played in my entire life.   The ONLY reason you'd play this game is to get background info on the relative information on the underworld on Earth.   OTHERWISE, this is the WORST game EVER...SERIOUSLY..LIKE WTF",
            "review_score": "-1"
        },
        {
            "review_text": "To be honest its really hard to get into this game, when i started playing it, it just bored me there is a lot of cut scenes every 5 minutes you will be watching a 10 min cut scene which really frustrates me :( , I dont recommend this game for those who seek traditional MMO because this is not the game your looking for My rate for this game out of ten would be a 4/10 this game doesnt suit my needs and needs to be worked on",
            "review_score": "-1"
        },
        {
            "review_text": "This game runs like crap, is buggy as hell, and contributed greatly to my depression.",
            "review_score": "-1"
        },
        {
            "review_text": "Hot mouth garbage",
            "review_score": "-1"
        },
        {
            "review_text": "Bad graphics Not fun Boring",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game ;D",
            "review_score": "1"
        },
        {
            "review_text": "I've played quite a few MMOs (except WoW, oddly enough). I can definitely recommend this game to anyone. The thing is, you have to really be into lore heavy games to truly appreciate it. It's not all about combat 24/7. The characters and world is really fleshed out. For only 10 bucks for the winter sale this is a steal.  Also, if you like Twin Peaks, and Lovecraft, you'll most likely really enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "I've played tons of mmo's and just have to say this is just one of the best ones yet. It's story is amazing and gameplay is just terrific. Over all just a great game to get into. Totaly beats the ♥♥♥♥ out of WoW aha. But thats just me.",
            "review_score": "1"
        },
        {
            "review_text": "If u play this you may forget there a world outside of it  never played something this different it doesnt even feel like playing in a mmo its so much more You have to rethink the way you play",
            "review_score": "1"
        },
        {
            "review_text": "Closest you can get to playing a World of Darkness",
            "review_score": "1"
        },
        {
            "review_text": "I have been playing MMORPG's since 1998. I've been there-done that. The Secret World is different than most MMO's.  I consider community to be a very important part of any MMO &amp; The community is awesome. probably one of the best i have seen-ever. You will not hear 14 year olds blabbering profanity on ths game. The wardrobes are not skimpy as they are in Asian MMos There are no Elitists You will not be damage parsed.  You will not be kicked from a grup for being 'noob' It is not pay to win. The quests are just plain awesome. They are not 'go kill 10X (insert mob here) and receive phat loots. you actually investigate and partake in a pretty decent story.  it is well worth getting while on sale. If you do try it, /chat join sanctuary is the most important command you can do. you will meet EVERYONE on that channel and they are all there to help. also, google secret world scripts as it will save you the trouble of typing that more than once. ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very fun and interesting story lines. Creepy just the way I like it. The modern day feel makes it really stand out from all the other MMOs that are mostly fantasy based. And the character wheel makes it so you can have really any playstyle and enjoy the game and progress. The forums and player base are very helpful and are willing to help out with missions, or instances. Overall I give this game about a 80/100",
            "review_score": "1"
        },
        {
            "review_text": "Great Game to play really gets you to think for most quests (or you know... google).",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Incredible storytelling. Missions that break away from the standard 'Kill ten rats' MMO mold, and lots of potential for unique skill setups  Cons: Very steep learning curve, largely from the sheer amount of choices presented for skill and equipment loadout.",
            "review_score": "1"
        },
        {
            "review_text": "This is not the best game ever. It does not redefine the MMO genre. But I keep playing it. I keep wanting to see what will come next.  The storylines are interesting, varied, and keep me wanting more. I love the writing for the quests, as well as the game as a whole.   I could go into the core concept of not having levels for your character, but I feel like this is something that you should experience for yourself, as I will not be able to do it proper justice.  If you like the MMO concept, and you like the horror genre, I would recommend getting this game. If nothing else, you can always come back to it, no matter how much time you spend away.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most absorbing gaming experiences I've ever had. Great characters, great voice acting and above all a great sense of atmosphere. I wholeheartedly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Two words... ♥♥♥♥ING AWESOME!!!",
            "review_score": "1"
        },
        {
            "review_text": "Woah! MMORPG with enjoyable quests? Blasphamy, im suposed to just run lots of errands and pointlessly murder animals for that spleen that one in ten seem to have... Not quests that make you think, and are entertaining. Bah!",
            "review_score": "1"
        },
        {
            "review_text": "Good literature. Good gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for something different from an MMO and love a more dark setting than is offered by most MMOs, you will find alot to enjoy with The Secret World. It takes some time to learn the mechanics and even longer to master them. However, the level of depth the system offers will make your efforts worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Deep and dark.   Good game for those that like to thinka bout the missions and fully explore the map.  Characters and builds are very flexable and in this game you can learn it all.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is just awesome. The graphics aren't top tier, but the music and atmosphere is great. There are ton's of quests and side quests in each area. Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "mystery quests are so hard! very rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "its alot of fun and very versital and you acutally dont play a class unlike other mmos i have played like ddo,wow,star wars knights of the old republic and other ones good storyline so far from what i have played its a very good game i give it 4/1/2 stars.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic MMO with an interesting combat system that allows you to mix 2 weapons simultaneously along with the best designed and most interesting quests this game is a must buy for anyone who enjoys MMOs and has grown bored of the usual WoW clone format.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!!! Its reminiscent of Ultima Online/Matric Online and Champions Online although none of these MMOs are hugely successful compared to some of the titans today.. they where all ground breaking. Its worth and look at and its Free, no sub!!. Loads of content to upgrade after you get into the swing of things.. So ya give it a shot you will be surprised :)",
            "review_score": "1"
        },
        {
            "review_text": "really good",
            "review_score": "1"
        },
        {
            "review_text": "Decent MMO, no subscription and paying for DLC can be worth it as they story telling and lore are strong. If you like the occult or Lovecraft you'll easily get your monies' worth!",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a big fan of leaving reviews or comments when it comes to anything but in this case its not an option. I've had the game more or less 5 months now and I'm already in The city of the sun god, deleting a couple characters over time and finding one I'm happy with ( Because I do that with my MMORPG's, bad habit I guess ) I ended up being a Templar. I've clocked nearly 300 hours in total to this point and these two weeks alone I've put 70 hours in. I have no regrets about this game at all and the only criticism I have for the game is that solo play is a pain ( But it is a multi player game so they can have that one off ) and that can just be resolved by some extra missions. If you are considering buying this game just make sure you have the time to put in because it sure is addictive.  Its probably bad to say this, but this is the game I've spent my life searching for.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! Funcom unlocks a whole new world of mmorpg's with it's unique style of completely custom class creation. With over 500 Active and passive abilities assorted through an array of weapon's the possibilities are endless. And passive abilities can be used with any weapon's no matter which ability tree they are listed under. The grind is exactly that though, a GRIND. However, having the highest ability in a skill tree doesn't necessarily mean it's the best. Lower leveled and geared players should be totally capable of holding their own in PVE. Finding groups is not an issue. Cabals/Guilds are prominent and PUGs are easy to create and find. Running dungeons is difficult at first due to the fact that skill is based largely on gear ranking you're likely to run into a few elitists that wont play with lower geared players, despite the fact that helping those players would only serve to create more higher geared players they desire to play with. But with the command /chat join noobmares you open yourself to a world of players on equal footing with yourself looking to grind their way to the top. I recommend this game to everyone and only suggest that more people choose to tank at first as the game is largely overpopulated with DPS characters and underpopulated with tanks and healers. This choice would only serve to allow you to level up considerably faster than myself as I find trouble grouping up as a character that can only DPS as of now.",
            "review_score": "1"
        },
        {
            "review_text": "interesting rpg game and on another new level",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so Im fairly new to the game, but i have wanted to play this thing since it was teased, a long time ago. It is a very interesting game, but you need to know that you will need at leat 1 of thse following basic two traits of a common human being, googling and thinking. Yes this game requieres some level of thought because there are a lot of puzzles, which is great but i have seen people that really dislike it.  Other than that with my noobishness all that i can say for now is the following:  PROs - Great lore, enthrailng, mysterious, and above everything else absolutely immersive. -Great 'quest' system, the best out there, really im not kidding, at least they have voice acting in every semi-mportant mission, thats a thing -Great ambience, the enemies are quite disturbing sometimes -It will get you hooked, somehow i know it -Innovative design of character progression, which is unrivaled yet, really ive seen people saying its a bad system, that it is no 'MMO' that is called fear of change. -Good gameplay, really fluid id say  CONs -Rather lacky regarding character creation (but customization is awesome) -Graphically its quite normal id say -It may be hard for controller users to adapt -It will create addiction inside you -Has a somewhat more difficult learning curve, but hey cmoen  11/10 buy it",
            "review_score": "1"
        },
        {
            "review_text": "It breaks away from the traditional MMO model of get quest X, do quest X, turn in and find next quest giver. All the little details matter which in other MMOs are often cosmetic, here they can be clues or key pieces of information to solve puzzles. Highly recommended. The mood and tone, the atmosphere; drawers you in and you become part of this world, in ways that other MMOs simply fail to do.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game!",
            "review_score": "1"
        },
        {
            "review_text": "I'll keep this review as brief as possible. After all hours played is a good indicator that I like the game :)  PROS - This is NOT a copy/paste MMO and by that I mean TSW is very unique in its story and playstyle and If your anything like me I got very bored of every MMO feeling like a WoW clone. - This game offers a lot of Bang for your Buck. Yes there are some issues (content) that is DLC however there is no subscription required and the base cost of the game gives you countless hours of gameplay. Not to mention any content that is available for purchase does not give you an advantage over the general playerbase it is 90% story focused. - This game has a Kick-♥♥♥ community, very mature playerbase which can lead to a lot of fun in group content. Also generally a very friendly playerbase. (In otherwords you dont have to deal with much immature ♥♥♥♥♥♥♥t). - Very vast customization! You can truely be any role and there are MANY. The playstyles offered in this game are neverending, new builds pop up all the time. - In game help. I have found there ingame help (via GM's) to be one of the best in any MMO i've played. In my experiences they have been quick to reply and very helpful. Type: /petition in game to contact a GM.  CONS - It has a small playerbase, a loyal one but small nonetheless. Recommend players to join a cabal (guild) as soon as possible to help when looking for players for group content. - It has a steep learning curve (when compared with most MMO's) again joining a cabal helps with this.  - Updates are slow. They are actually making great improvments in this area and one can now expect events/new content every 1-2 months but having a small playerbase and not being a pay-to-win or subscription based game they operate on a smaller budget/team.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most unique MMORPGs I have ever played. I play a chick character and she has a nice ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "If your a horror fan who likes mmo's with a great story and gaemplay... get this and you wont regret it",
            "review_score": "1"
        },
        {
            "review_text": "I love the quests, the stories, the fact you can collect lore about places, and the factions. c:",
            "review_score": "1"
        },
        {
            "review_text": "I like the premise of The Secret World. The story is pretty much the strong point of this game. The gameplay is typical MMORPG but I found that I can't solo the game after a while, which puts me off it as I don't have other friends playing it. And with dwindling player base the world feels rather empty, even in the city. If they make the game story completeable solo, I would play it again. Pretty graphic but the skills/abilities /magic could be more varied visually.",
            "review_score": "1"
        },
        {
            "review_text": "It's great, I swear. ",
            "review_score": "1"
        },
        {
            "review_text": "My favorite MMO. Ever. Hands-down. I feel like the world around me is alive, and I care so deeply for the characters stuck in it. I'm fascinated by the lore and have spent an undue amount of time reading up on it even while I'm not playing. My only complaint, really, is how geared you have to be in order to even *think* about entering PVP. That aspect of the game isn't at all fun for me, but I adore the story content and can't wait for Issue 13 so we can explore more of Kaidan.",
            "review_score": "1"
        },
        {
            "review_text": "I quit Secret World back when Issue 4 was latest. Recently came back when I bought Ultimate Edition from sale. Totally worth the 18e I spent. Love the atmosphere, very nice plot and lots of things to do and explore. After Secret World, all fantasy MMOs feel boring, at least to me. I'd rate 8/10 cause of some clitches and graphic bugs here and there.",
            "review_score": "1"
        },
        {
            "review_text": "Update of my evaluation little before 4th birthday of my purchase.  Well, even if I took some long break between sessions, I'm always up for it. And here's why...  In 99% of MMO's, usual quests sound like: 'Go kill 20 rabbits and bring their ears as proof'. And of course only 50% of the rabbits have ears! At a point, I remember I didn't even read the quest anymore, just eying on my map to see the nearest objectives... Well that's finally over! A REAL scenario, cinematic quest introductions,multi-role characters never doing the same twice unless I wanted to... This game has all I could ask for. Adding the fact that it's now free from monthly subscription, I can't find a shade on it. --- Ah! most of all, quests are hard. Really hard. What's my point? A real noob filter cleaning the community from all those parasites you wished soooo many times to eviscerate on other MMO titles. --- Yeah well, I know it sounds rude but common, 'The quests are stupidly hard *whinnes*'... What the hell are you doing on that game??? This is maybe the FIRST thing people who played it are talking about. Quests. So Funcom went for the most crazy bet by implementing real deep research throu the game? I hail and kneel to you, guys. No joke.  Other usuall BS is regarding solo instances: 'I can't go in with mah buddy, what kind of MMO is that???' Well, go play COD? Or maybe reroll Horde on WOW and grind Warsong? The point of those quest is pretty clear, you're not good enough? Come back later when you will be. But until then, no access to the next map! Genius. I will quickly here compare TSW to WOW... I played WOW for years. And it turned casual. On its gameplay. Wasn't good enough to drop Arthas? No prob, wait the next add-on and go back on with 10 or 20 more levels! What there is to be proud about?  So again, last words: You want something difficult, noob-free and rewarding? Grab it! Full price or not, it deserves it.",
            "review_score": "1"
        },
        {
            "review_text": "Really want to play this game, however, this game does not work correctly on my rig with Windows 10 Professional. The Patcher application fails with a fatal error. Now, I don't blame Funcom for this as the specifications do not mention Windows 10 and they recommend Windows 7. So while the game is free once you've purchased it, I have wasted the purchase price. There seem to be a lot of forum chatter concerning the problem I'm experiencing with fixes available which only work for some and not others. So would I recommend this game, not for Windows 10, if you have Windows 7 and this type of game appeals to you then go for it, despite real world financial transactions, this is the type of game I would have lost many hours to, now it is an uninstalled game in my Steam Library. I don't request a refund as it serves to remind me of my mistake so next time I'll be more careful in assuming that games will run on my OS and Rig. The next time, I'll think twice. For those who are able to play the game, lucky bast$%ds ! :-)",
            "review_score": "-1"
        },
        {
            "review_text": "I bought it cheap, thank god. I wanted to like it, I heard great things about it, but I really just couldn't get into it. It just seemed so bland. Maybe I chose the wrong starting point and/or combat styles, but I was very unimpressed",
            "review_score": "-1"
        },
        {
            "review_text": "This game is all about questing. Most of the time you're playing solo, which is why it's buy to play. The focus isn't about getting to the 'endgame', but to just enjoy building your own class and seeing what works for different situations and what doesn't.   The instances are short, but enjoyable. A lot of focus is (even from the early dungeons) on boss mechanics.   I've heard a lot of problems about the game-store and Funcom, but never experienced any myself.  Also the servers suck sometimes.  You'll easily get your moneys worth here though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible. I hate that I over looked it for so long. There is not a game out there like it and it blew me away by how much content there is and how fun it is. Definitely check it out if you are ready for a different kind of MMO experience. I've played everything, WoW, EQ2, Archeage, Rift, ESO, and more and this is still one of my favorites. I did stop playing because I got bored simply because i didnt have anyone to play with anymore.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, weird and funny at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "  Lovecraftian references...check World Of Darkness atmosphere...check Some of the most enjoyable and immersive characters to send you around fighting all the horrors mankind has managed to conceive till now...check Some of the most challenging puzzles to melt your brain...check No need to add anything else...it is a 'must play'.  P.S.The option to call your friends to share the insanity...check",
            "review_score": "1"
        },
        {
            "review_text": "This was a game that I had been extraordinarily hyped about back when it was first released. It took four years for me to actually get around to playing it, but let me just say that I am not disappointed. Character customization is fairly decent, the quests that you can embark on are all unique, and I've found myself amused by a good number of NPCs, their dialogue, and general antics. I love the nods given to Lovecraft and other known authors, particularly in the first region you visit, Solomon Island. But where I think this game truly shines is its lore. That has me coming back for more, staying up later and later each night to uncover and grasp the full extent of it. It honestly is like falling into a whole new dimension.",
            "review_score": "1"
        },
        {
            "review_text": "I can be standing next to someone elses avatar wearing a bikini and/or bunny ears one minute and screaming my head off at a jump scare the next. I tried it when it first came out and coming back into it, I'm enjoying it even more. I just can't stop playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game with all possibilitys",
            "review_score": "1"
        },
        {
            "review_text": "Really good!! modern day mmo!!",
            "review_score": "1"
        },
        {
            "review_text": "I Subcribed to this game up until this went fee2pay. I havent played much after, but the setting is one of the most orignal. The whole world is full of story, a lot of it so deep it had me guessing if it was part of a quest or if it was part of a quest or just back story.  But one of the best parts of this game is that i was halfway to the level cap by only doing non-combat missions, because they were more fun.",
            "review_score": "1"
        },
        {
            "review_text": "fun game for a buy to play",
            "review_score": "1"
        },
        {
            "review_text": "Very different from most modern MMO's. Not perfect. Fighting system could definitely be better, but it does have an interesting classless skill system, a truly interesting story with horror elements and great environments and a genuinely difficult puzzle system (if you don't cheat and look up the answers via Google, at least). Overall a very fun game and definitely worth checking out now that the subscription fee is optional. Give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "Very Great MMO, No Class Restrictions, Build Your Character WIth Any Skills You WIsh, Or Pick From A Framework, Lots To Do And Gear Is Mostly Ahestic.",
            "review_score": "1"
        },
        {
            "review_text": "You're thinking 'Another momurpugur? WoW already finished that genre', but you are so wrong. It's not actually a momurpugur at all, it's a MMO-Point and Click-Adventure game (MMOPaCAG). Mopackagee. The main draw isn't to level up since there aren't classes and everyone can max every skill at once eventually, but the sweet quests, dialogue, voice acting and lore. My absolute favorites are the Investigation quests where you often have to consult blogs and websites on the internet for clues and information that you need to progress. And these things are HARD, like 90s adventure game hard. We're talking comparing ISBN-13 numbers on a person's favorite books to figure out his key code hard.  If you're into self-flagellation via meticulous clue scouring and crazy connections, this is your game. Also if you're into urban myths, ancient horrors, Lovecraft, Poe, conspiracy theories, folklore, and dialogue so riddled with unexplained references to such things that it'd require a dictionary for the uninitiated.",
            "review_score": "1"
        },
        {
            "review_text": "It's not easy. Nothing's handed to you on a platter. You get unique cutscenes, awesome characters, and an entrancing storyline that evokes your imagination, and allows you to paint your own interpretation of it.   There are several different types of missions (Quests), which are:   Investigation (Usually involves researching, using google, or just your wits and own personal knowledge),  Sabotage (Lasers. Cameras. Avoiding them. Avoiding being seen.)  Normal. (Kill things, collect things, or just scout around and look at things.)  Group (Akin to dungeon missions, usually.) Scenario. (Interesting addition-- Kinda like the Danger Room in X-men, or the Hologram room from Star Trek. You go through different simulations in order to train.)  You can open up all skill points and ability points in the game-- Nothing is barred from you. This is both awesome and intimidating, because you create your own 'deck', or in other MMOs, 'build'.  It has its flaws. It may make most people tear their hair out. But, if you like a good story, good characters, a challenge, and actually having fun while immersing yourself, then I couldn't recommend this game more if I tried. If you like adventure point and click games, you'll have the patience to love this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is AMAZING! Fight the shadows of the world around us! SHOW THEM WHATS UP! This game has everything you need in an MMO.",
            "review_score": "1"
        },
        {
            "review_text": "Smartest game I've ever played. Storyline is thick 'n juicy, and the writing style is everything I look for in a novel. I just love moving about in the world, especially grabbing and reading the incredible Lore. This universe is fleshed out and amazing, the fiction thorough and researched.  I can't stop playing it.  BTW: I recommend the Illuminati for the sheer fun of the mission reports followed by the mysterious Dragon, where you are made to feel like an important cog in a twelve-dimensional mathematical machine.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME",
            "review_score": "1"
        },
        {
            "review_text": "Much Yes. Very Wow. Conspiracy Theories and Mystical Geekism for all. Let me tell you about The True World.",
            "review_score": "1"
        },
        {
            "review_text": "its half off u should pick it up ",
            "review_score": "1"
        },
        {
            "review_text": "TSW is an interesting game, the only real problem that I've had with it is that it is hard to play solo in the wildness at times",
            "review_score": "1"
        },
        {
            "review_text": "The atmosphere, sound effects, music and the numerous cutscenes in this game combine to make it a fantastically immersive experience for me. I love the fact that I can explore and complete missions in a vast landscape without having to rely on other players constantly to get through things. Some missions even require the player to research outside the immediate game for clues and it has its own built in web browser with which to do that. The npc dialog is engaging and there are many different types of npc characters, none of which sound like they are reading from a script when they speak. I value that a lot, since badly acted dialog can yank me right out of that immersive feeling when I'm playing a game.  Players can choose from one of three factions when they create their character, all of which are human. It is sort of refreshing not to be innundated with choices of elves and dwarves and other mythical creatures as a 'hero.' Each faction starts the game in a different area, before moving on to to investigate the goings on in Kingsmouth, a fictitious New England town.  Overall, the atmosphere coupled with the necessity to use both brain and brawn to get through the missions makes for a great game and its well worth the price I paid for this MMO.   ",
            "review_score": "1"
        },
        {
            "review_text": "Great deal and nice atmosphere in the starting areas",
            "review_score": "1"
        },
        {
            "review_text": "By far the best game :) love it",
            "review_score": "1"
        },
        {
            "review_text": "The perfect MMO if you don't want to click every two seconds everywere and use a little brain. Nice quests, awesome story and ambientation, you won't regret buying it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is sweet! One of the best and most different MMO's I have ever played. Great story.....",
            "review_score": "1"
        },
        {
            "review_text": "Rock solid MMO game! Really enjoy not caring about levels and just making my toon, my way!",
            "review_score": "1"
        },
        {
            "review_text": "As a junkie for conspiracy theory and urban fantasy, I've been waiting for this MMO a long time. The initial release was buggy, but after almost 2 years in operation, the game runs just fine. There is plenty of depth here, and PvP is lucrative, encouraging players developing characters to get into PvP early. There are two downsides here. First, the game requires some significant hardware to run properly, and second, the server propulations are currently low. In spite of the imperfections, I've been very happy with the current version of the game, and I plan on continuing to focus on playing this game. I recommend the game for those interested in the themes it covers, and also for those who love MMORPG's in general.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not going to give a big review; others have done already that. In my personal opinion it’s one of the best MMOs I have ever played. Since I purchase this game, I have become a potato (from Scorcher24 review of the game). I was drawn in and hooked after the first 15 minutes of playing it, to the point of not wanting to put it down. I give this game a 9/10 because of the bugs; but, what online games don’t have bugs? Yes, you will run into some lag from time to time, but it only last for few seconds; it’s far and between.",
            "review_score": "1"
        },
        {
            "review_text": "If you are into games that are more based on leveling skills rather than leveling than the character itself, like Mabinogi, Shin Megami Tensei: Imagine, or Age of Wushu/Wulin, then try this game out. The more hours you put into it, the more satisfaction you'll have at completing all paths of your character.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic gameplay! Really easy to jump into. Easy learning curve for non-MMO players. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Tesselation: The MMO.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say that this game is amazing as you can play the way you want without having to focus on various levels and requirements for powers. I started a character with an assault rifle skill and then started on blood magic which is making him more survivable. And the best part is you can pick this game up for cheap and never have to pay a monthly fee for playing. What a deal! :)",
            "review_score": "1"
        },
        {
            "review_text": "the quick questions: MMORPG: Yes, but a small player base, but personaly i like only having a few persons around when you are saving the world. it makes it easyer to feel that YOU are saving the world and not just another one down the same ride.  TIme Line: real world, now and here. just with magic and creepy monsters. for the once that know Call of C.... you well see planty of that.  leaning Curve: Steep at the beginning, the charater system is complitly Diffrent that what you have tryed befor. but on the flip side, there is no max level. so you well eventualy leand everything and every skill in the game.  way i keep comming back to this game: it isthe only MMO that expects you to use the internet when doing some questes. it even have a ingame Browser for you to use. in one of the Questes i hade to look up the componet i wanted to repair on the internet in order to fix it ingame. ¨  one you have payed fo the game it is Free to play. yes you get some benefits if you subscripe but they are minor and i you love the game there is a option for a single payment for a lifetime subcription if that is youre thing. if this game hase youre fancy. i sugest spending reading abit more about it around on the net. maby even get a layout for how you are gona build yuore character initially. yes you are gona make miskates but dont worry. no level cap remimber, you well get it all in the end.  Good luck out there and welcome to The Secret World.",
            "review_score": "1"
        },
        {
            "review_text": "Good game worth the 30$ combat is decent, customization is endless, no class system allows you to become what you. want, decks allow for optimization in any two weapons you choose, and pvp scales you up so everybody is on equal footing gear wise. voice acting could use some work but can be skippes with esc.",
            "review_score": "1"
        },
        {
            "review_text": "its quite a good mmorpg",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun, with a really great story, an amazing, detailed setting and unique gameplay. However, it's also really, really buggy. The bugs haven't prevented me from playing it near constantly, though; they're easy enough to deal with.",
            "review_score": "1"
        },
        {
            "review_text": "Bar none one of the best pay2play MMO games ever. The setting and how the story is blended with the quests is remarkable. If someone were to see me playing the game they could easily mistake The Secret World for being a highly polished single-player experience. Many times i replay quests for the sheer fun of playing through them. The quests are almost always unique and the quest givers are always a treat (Sam Krieg and Nassir are just two of many favorites).  That said TSW is not without its issues. The main one for me is the sheer install size of the game. Its massive so it compllicates things for someone with limited hard drive space. The second gripe I have is the performance and loading times. That isn't as much a mark against the game as such it's just a heads up that an SSD and a relatively beefy PC rig would be helpful in getting to the game faster. Believe me, when I get to fiending for TSW a 40 gig download with 1+ minute load screens feels like eternity. Again, I have a poor PC setup so your mileage will vary if you have a computer from this decade.  All in all, my decision to skip TSW when it first released with its monthly fee setup was a huge mistake on my part. I would have gladly paid $15 per month for this game. If you can get the game on sale, wonderful. If not, dont make the mistake I did and take a pass on the game for 'another time.' Its worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like it could've gone somewhere but failed epically.  The online experience was a big let down and the controls were shocking at best.   For the amount of self made hype it had around it scores a lowball of 5/10",
            "review_score": "1"
        },
        {
            "review_text": "Excellent MMO - loved the storyline, good content, and no subscription fee! Took over 300 hours to get to the end game, so great value for money spent! Will need to see how the end game pans out.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very different approach to MMOs, and I heartily approve of the directions in which it's dared to be different. Some missions are investigative in nature, requiring a good deal of research on cryptic clues. And combat? Forget burning some blue bar to expend your more powerful skills: abilities are divided into generators and consumers. The weak ones produce resources (up to 5), and the stronger ones consume them, giving fights a tactical ebb and flow.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best MMO's ever made, under rated and exceptionally good. a Steal at £24.99 with no monthly fees... Sure GW2 is the new WoW.. and there is WoW. TSW is an adult game, its for adults.. kids get to stay away and play the fairytales with little dollys and christmas presents. Open a present in TSW ands its likely to rip your face off. If you liked L4D, get this.. if you didn't and you wanted your Zombie killing in a more thoughtful setting get this. If you liked old skool horror, get this.",
            "review_score": "1"
        },
        {
            "review_text": "Great quests. better than expected",
            "review_score": "1"
        },
        {
            "review_text": "I say give it a try, not your avg MMO, feels like a singleplayer game with CO-OP added in",
            "review_score": "1"
        },
        {
            "review_text": "Only the best MMO I played in my life. :) Graphics are amazing, gameplay too. :)",
            "review_score": "1"
        },
        {
            "review_text": "ok if you like rpgs and mythical type games, then just get this. its just good. hard at times, but still really good, armors have no rates so if you get a set that looks cool you can keep it forever and it wont change your stats. theres not even classes you basiclly pick a weapon ( magic, guns, or mele) which all have 3 sub weapons, for ex. guns have pistols, shotguns, and assault rifles... oh you can also get a horse hats for money... i like horse hats...",
            "review_score": "1"
        },
        {
            "review_text": "Great story. Fast and fun gameplay. Investigation missions that will wrack your brain and keep you thinking outside the box.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to learn, very VERY difficult to master, this MMO is easily one that will devour many many hours.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best MMOs I've ever played. It has a strong emphasis on story and fleshed out NPC characters. The quests actually allow you to find out more about this deeply detailed world and draw you deeper within it. It's more than just 'kill 5 monsters and bring me their heads'.   I will say that without a guide it can be difficult to build a successful character, but thankfully there's all sorts to be found on the internet. :D",
            "review_score": "1"
        },
        {
            "review_text": "love this game so fun...and worth ever penny",
            "review_score": "1"
        },
        {
            "review_text": "Among one of the best MMORPG games I have played. Funcom does what it does best, story, atmosphere and graphics. The Secret World is a great MMO for those looking for something different than your traditional cookie cutter fantasy games.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful character designes and landscapes (if you have a good enough graphics card). Can be a little slow at some points. Best if you play with frieds, even if there are solo missions at times. Over all 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Different class of MMO.",
            "review_score": "1"
        },
        {
            "review_text": "A unique and creative game that will blow your minds off literally",
            "review_score": "1"
        },
        {
            "review_text": "Made a character, stared at the smily stickers on the female character boobs for a few minutes, then ran around killing zombies with a shotgun with infinite ammo for a few hours. Did this for a few days until I realised, I could do this in real life.  Bought a shotgun, shot a zombie in the face, good times, but now I'm in a mental asylum. I don't see what their problem is, since when did ridding the world of evil become a crime? I have to go now, they're handing out those tasty blue sweets again.",
            "review_score": "1"
        },
        {
            "review_text": "I can recall the first time I saw this game on the Steam page. The name of the game and the picture was intriguing to say the least. Iinitially thought that it was like all the mmo's out there with nothing to set it aside. I was surprised once I did start playing it because it is indeed unique from other mmo's out there. There are so many different things to try out once you play. You get three different factions that you choose from. The Illuminati, Templars, and Dragon are the three. Once you choose one of them you are brought to the character creation screen. The options for customisation aren't huge but enough that you can flesh out your avatar to your liking. The fact that you can purchase clothes and other things in the game makes up for the lack of extra customisation. After all of that you are shown the begininning of your journey in a beautiful cinematic introduction. Just sit back and watch it. All three factions have their own intro so try all three to see the difference for yourself. Once you gain control of your avatar you can start playing the game and fear not...you will not be left in the dark if it is your first time playing. You have helpful hints pop up on the side of the screen that are non intrusive and guide you along the way until you feel comfortable enough to go it alone. The community of players in the game are also a vibrant bunch. So many people that are willing to stop what they are doing in order to answer a question you may have. You might get the rare player that says nothing back but mostly you get a response. The players who have been on the game longer and have more experience are always willing to help you out. I know this from personal experience and from word of mouth. The game also features a cabal system which is another term for guild. You can join one of many guilds within the game and start building friendships with your fellow guildies. There is way too much for me to cover in here but I would definately give this game a 4 out of 5 stars. I would give it 5 stars if there were more realms to play on and if the DX 11 version of the graphics were properly fixed. Other than those everything else is perfect to me. Give it a try and definately bring a friend because it will be that much sweeter!",
            "review_score": "1"
        },
        {
            "review_text": "Pros: This game has an intriging storyline and a lot to do without feeling like you're just mindlessly grinding. Even though I only have 13 hours of gameplay in I can tell when I'm going to really like a game by how it starts off. Despite this game coming out in 2012 the graphics are really enjoyable, not amazing, but more appleaing than most games around that time period.  Cons: The defualt keybindings are a little screwy in my opinon and unique compared to most game layouts. I had to do a little changing them around to find something I could use comfortablely and be able to fight well with. The combat system is alright, I'm just getting too used to the newer ones that give you a whole lot more action feels.",
            "review_score": "1"
        },
        {
            "review_text": "Secret World is a great MMO with a lot of content to explore. It has a definitive feel to it unlike any other mmo on the market with challenging and engaging quest lines.  The combat system is easy enough to figure out and has a rotation system similar to most mmos.   The versatile skill tree allows for you to 'eventually' branch into every weapon style available. While allowing for this versatility from the beginning can seem very beneficial it is not something you want to dabble a couple here and there with. I recommend following a pre-designed path and adhering to it for content quest purposes.   Although they are continuing to work on the pvp scene, I find the battlefield clunky and really wish they had set this down as a more traditional pvp field seen in other popular mmos. The few encounters I ran in it just seemed unfilling to my taste, but everyone should try it out as it may be the style they like.  Of the few dungeons I ran it was in my opinion that ranged dps was the most effective after healer/tank. Melee dps just got aoe'd or engaged way too much to be effective as constantly having to kite out of the way or avoid damage deterred the ability to distribute dps effectively. However, maybe a ranged/melee hybrid would be effective here and that is very possible in the flexibility granted in your skill tree.  If you can hold out to buy the main content on sale I would do that, but it is even worth the full sticker price since this is essentially a buy the game you get the mmo no strings attached situation like guild wars.   A lot of reviews will cover everything I just said but not many mention the fact that older gen computers will struggle to run this game. I rarely find games where the FPS fall below 30 for me, but in this one(on my normal settings) it initially ran at an unplayable 8 FPS until I adjusted down. My computer isn't old or brand new but a decent gaming machine purchased two years ago. Like any games you have this trouble with, just lowering the settings will allow you to find a comfortable fps to play at but I imagine any PC four-five years old or more will find this game a nightmare to run so invest in the game wisely.  Storyline gets a 9/10 Gameplay 8/10 PVP 5/10 Dungeons/Raids 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Set in the sort of low-fantasy world where shady government agencies work with Illuminati sorcerers to keep Cthulhu underwater, The Secret World boasts an amazing amount of content and one of the most friendly, helpful, and welcoming online communities I've seen (provided you can find them; new players should say '/chat join Sanctuary' pretty much first thing). The learning curve is insane, throwing a ton of terminology and possibilities into your face right off the bat, but once you figure THAT out, you can tackle quests miles past standard MMO kill-and-return objectives with unparalleled flexibility. The Massive Edition is an amazing deal, and in sheer dollars-to-time probably couldn't be beaten with a stick.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome....and scary",
            "review_score": "1"
        },
        {
            "review_text": "You can read any number of reviews that will give you insight into the settings, gameplay, etc. I recommend the game, but with one caveat - combat is laborious. Each fight feels more like a war of attrition rather than a visceral experience. And that's going one-on-one. If another monster wades into the fight, then it's pretty close to 'game over'. In fact, it is the somewhat tedious combat that caused me to stop playing. There's only so much grindy combat a guy can take before his mind starts wandering.",
            "review_score": "1"
        },
        {
            "review_text": "Not your usual MMO, TSW is conspiracy theories and horror tales rolled up into a hot mess and tosses you right into the center of it. The quests and missions require some critical thinking, the stories are engaging and the voice acting is superb. Content is King and The Secret World seems to have plenty of it.   Pros: - Engaging story - Interesting game mechanics - No GRIND... none unless you want to of course - Interesting quests and missions that break the mold of the 'usual' kill quests  - Some very engaging level design - Strong Character Customization Capabilities - Horizontal Growth rather than Vertical so you don't outlevel your friends. Have uber gear? You can still join them and fight alongside each other   Cons: [update after weeks of playing] - The new Aegis system of shields and attacks introduces a new game mechanic in the last DLC. Currently the Aegis system is not available if you have not bought the DLC so it limits those players from advancing this mechanic which will be used in all future DLC. -Introducing a new mechanic like Aegis is awkward and personally I hate it. It suddendly changes gameplay and you find yourself having to learn a new mechanic on top of all the power changes - The end game has turned into a gear grind. To me gear grinds are the laziest form of game design since they basically are a way to make people have to work harder just to enjoy new content there by increasing the shelf life of said content...  - (And this is sort of a big one. It almost made me not even try the game and I am very patient) Just to get this game registered and to create an account took over 2 hours. That may should like an exaggeration however it isn't. In order to play the game you have to first create an account on Funcom, the page refreshes at each step to create an account is anywhere between 3-10 minutes each and your account name must be unique so the chances of doing multiple refreshes is great.   Then, after creating the Funcom account you must actually create a game account but this is not obvious. You see a place to enter a key to 'register' it. Once you do that, (the refresh this time took over 7 minutes) you must click on this button that says 'Create Account' with no mention of the game at all, so it is not very clear this needs to be done to play the game.   You might think at this point that you are free and home clear... but no. Now you must link the Funcom/game account with Steam...   In the end with the confusing and redundant registration, the frustratingly slow refreshes that often timed out, and the horrible support (Live chat put me on hold after taking a lifetime to fire up and eventually I just gave up on that option)  I just wanted my money back at this point. What a terrible user experiance. It is a wonder anyone ever actually registers and plays this game. Even if the servers did not take so incredibly long to respond the registration process is tedious and extreme.",
            "review_score": "1"
        },
        {
            "review_text": "An MMO that makes you think. Some of the quests require actual problem solving.",
            "review_score": "1"
        },
        {
            "review_text": "For a B2P game, it's quite solid. Some stories are engaging, but some are a bit lackluster. I don't mind dipping in to the game from time to time. It's good for a nice break. I recommend for the pure fact of it's above average storylines and B2P. What LinearMMOs should be. Subscriptions for these types of games is dead.",
            "review_score": "1"
        },
        {
            "review_text": "best mmorpg ive ever played",
            "review_score": "1"
        },
        {
            "review_text": "For now really refreshing mmo, with interesting storyline and not bad at all community.",
            "review_score": "1"
        },
        {
            "review_text": "What I love about this game is that it's not a class specific game. You can use any weapon in the game if you learn how to use it. Not like the other MMO games that I've played to where weapons are restricted to what class you play.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game yesterday. Am I cut out to be a proper illuminati bro?  10/10 WILL NOT GET ♥♥♥♥ED BY AK'AB AGAIN",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game, that threatens to topple my favourite MMO from number 1 all time favourite MMO (which I'll refrain from naming). Great idea, amazing game, brilliantly done.",
            "review_score": "1"
        },
        {
            "review_text": "Admittedly I'm very new to this game, but so far it has amazed and enticed me. So much so that I spent about 11 hours straight playing it after I started.   The best parts for me are the investigations and puzzles that have no indicator in the map, just a clue and a goal, and the rest is up to you. But I also like that the players are... More civilised? More mature? Then other MMO's. One of the earliest things I noticed was that in the General Chat, people were asking questions and getting help. No one was ♥♥♥♥♥ing, raging or complaining, and everyone was using correct Grammar and Punctuation. That's not something one see's in MMO's today. Or games in General.   While we have evolved past 1337 5P34K, we gamers, as a generalisation, still speak like '12yo AOL's lol wut.' and for the most part, we love a good troll, but at least in my first 11 hours, Everyone was sincere and polite, and the humour was general, and not at someone expense. Truly a nice contrast to what I am used to in games today.   I'll expand on my thoughts toward the game as I continue to explore it, but for now, these are my first thoughts.   8/10 - A great gaming experience, and truly seems to be the best case scenario for a gaming community.  ",
            "review_score": "1"
        },
        {
            "review_text": "Steam really needs a neutral option.  To start off, I am not a fan of MMOs, i have been looking for one that i thought i would like and thought that this would be it. The premise of the game is perfect for me, and ever since i saw the first two preview videos, i was excited to play this game. At the time i was poor and busy so i couldn't justify playing a pay to play game, but years later it stopped being pay for play and i was excited to get it. before this i had only played two MMOs and really didn't like the mechanics, auto-attack with an occational power use. The same type of mechanics the secret world uses. The controls for the game are also really bad, it is the first game i have played where you mostly use the keyboard and sometimes use the mouse.  I like horror games in general because they are immersive, this game kicks you out of the story every chance it gets, and because it is an MMO and there are a bunch of people running around being annoying, it is basically impossible to get immersed in the first place.  If this was the game that was promised in the preview videos, it would probably be one of my favorite games, but this game is just world of horrorcraft with worse controls.",
            "review_score": "-1"
        },
        {
            "review_text": "LOVE the lore (Especially the New England references) that alludes to some of my absolute favorite authors. The character advancement mechanics are not the norm of most MMOs, and I honestly feel that many more games could learn from TSW.  The Base Edition gets you pretty far. I still haven't bought any story edition addons and have tons of progress to make. If there's ever a free weekend or something in the near future, some players may feel overwhelmed, but the playerbase is actually really amazing and helpful, as well as anything you have questions about can be researched with a native in-game browser (not just the steam overlay) which also functions as a tool utilized for in-game missions. Nobody should ever miss the chance to try this game if they're able, and I encourage anyone who can relate to this review to buy the game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing ambiance , never boring, so far.",
            "review_score": "1"
        },
        {
            "review_text": "The Secret world is a game I have enjoyed, and am still enjoying a lot. It may not have the best graphics, and an okay combat system, but its is a fun game, with an amazing story-line compared to other MMORPGs out there. I will however say, that you should probally pick it up if it is on sale. it is not worth the full price, considering the all-around quality of the game.",
            "review_score": "1"
        },
        {
            "review_text": "I orginally gave this a very good rating, but now after playing for awhile and nearing end game I need to revise that. For the price it is a very good bargain considering all the DLC and the game is enjoyable to play alone or with friends. Now somethings can be placed at the designers doorstep and will be part of my rating. Other things the designers cannot control, but I will note here, concerning the so called elitist you find in any game, when you reject a friend for a dungeon mission with an excuse they are not ready and need to grind more, but will accept me with an identical build, just my weapons and talismens are level 10 purple and she was level 10 green it tells me your not a elitist, your a snob. A game is meant to be fun, and done mostly for enjoyment. So for other users out there, never accept the elitist who turns you away, just repost and found another group for dungeon missions.  Now for why I am lowering my rating, the storyline is one of the best I have ever seen in a MMO, for the most part even with the interface being a bit dated it is still very playable and most missions are fun as well as challaging. The problem comes in near end game to progress in the game you must complete sections before moving on to the next one, no problem there and is standard in most all games. The problem is near end game the missions become a bit buggy, in one case I had completed the mission and was waiting for the last part to finish, five minutes later I am still standing there waiting. All the swarms of attackers are killed off and I am still standing there waiting for five minutes, so I put in for  in-game support detailing what has happened, twenty minutes later still standing there and no word from a GM. Sign off and return 2 hours later still no word from a GM. So I backtrack and rerun that last step so I can complete the mission this time it works a few seconds after killing the last attacker it finished the mission. So I now move on to another mission, signed off and returned later, now I have a message from a GM saying sorry they missed me in-game and the mission I re-ran to finish is now showing paused at that last step, so the GM reset it and now I need to re-run it a third time just so I can write it off, not very good customer service on that one. I also find at times for no appearent reason my health in-game just drops to a dangoues level with an attacker who just does not have that big a hit, so again another buggy mission after the last update.  So where I gave this a five star rating before and recommend it as a must play game, I now lower it to three stars due to poor respond times by GM's and updates that introduce buggy code. Would I recommend it, yes, but not as a must have the game is fun, but it is starting to show it's age in both members and content. One DLC The Venetain Agenda is both a wast of time and money, just a slash and dash repetatively, that has no storyline and becomes boring fast the designers would be better off with this as a side mission for those who like this type of content and not a addition to the DLC storyline that acts as a roadblock to progession.",
            "review_score": "-1"
        },
        {
            "review_text": "In my personal opinion, this game is excellent. The story is solid and immersive and you actually end up wanting to learn it even if there is no reward for it. You want to hear the whole quest text and speak to all the characters. Below I've written an amalgamation of an essay and a review that really isn't something you can't find anywhere else on the internet by people who do this kind of thing for a living, but it should provide somewhat detailed insight to the pros and cons of the game. The game is really all it claims to be, if you are the kind of person who likes conspiracies, folklore, secrets, otherwordly vistas and entities and all that good stuff, you will probably like this game too.    From an objective point of view however, there are some drawbacks that everyone seems to agree on.   The animation and graphics, while not bad-looking by any means, don't really work well with the rest of the game and it really shows during fights.   The combat could also have been executed better. There are no classes in this game, you can initially train in the use of 9 weapons and later unlock 5 more. You can choose which ones you'll master first, but inevitably you will end up unlocking all of them. While it allows for great flexibility and a variety of options, with over 400 active and passive abilities that can be mixed in creative ways to create 'decks', every weapon fights the same way as the others, with slight differences between weapons of the three different categories. These are the main problems that stem from the mechanical part of the game.  There is also a relative hortage of content. More on that below.  Those drawbacks, however, are nothing in front of what it actually does right.   First of all, it portrays the co-existance of the modern world and the 'Secret World' in a realistic and entertaining way. Instead of being entirely seperated, occult and mundane co-exist, but it is always played out in a realistic way.  'Quests' is a word that will neven be missing from any detailed review of the game, which is strange, because there aren't any. The game gives you missions, instead. 'Gives you' in mechanics only, however, as in the game, save for the story missions that are directly given to you by your superiors, you actally operate under your own initiative most of the time. There won't be any farmer or guard that wants you to kill 12 boars, any and all missions you undertake begin when you become aware of a matter than needs further analysis, investigating or when you decide to help or work with someone. They all serve a purpose story-wise and in the end you report directly back to your superiors who notify you of anything of importance that was learned from your involvement and offer advice as how to progress from now on. The missions are split into categories depending on their nature. This means that while there won't be any shartage of Deep Ones to kill, you might need to infiltrate a place without being seen at one moment, while hitting the books the next. And I mean that literally as in order to complete investigation missions you will often need to put the pieces together yourself and if you want my advice, it's better to spend an evening finding the code behind Morninglight quiz answers than looking it up on the internet. You will figure it out after a while. (And to be honest learning to do the research without guidelines might actually have real-world uses.) For those missions you are provided an in-game funtional internet browser that further increases the immersion of doing your own research on the secret societies that exist in the game.  Another thing that the game executed well is the story. The Secret World has very rich lore, from origins of monster, werewolves and vampires, to ancient and dark forces that could easily find a place in the pages of cosmic horror books such as the ones written by H.P. Lovecraft. The storytelling is also executed better than most games. The exposition is kept to a minimum and you pretty much gather the story piece by piece, either by finding collectibles simply called 'lore' or by paying attention to the characters when they explain their situation. As a field operative of a well-established and powerful faction, you are involved in this story and you actually have a say in it rather than simply obeying orders like most other mmos.   That pretty much covers the qualities that make the game unique. You can look up gameplay videos and wikis if you wish to know more. If you are concerned about the price, the value you get out of it depends on you. Some people might not enjoy the difficult investigation missions or the cosmic horror. This is not a game that you will enjoy solely because of the gameplay and I can't stress this enough. This game is almost perfectly attuned with my interests, both in setting and gameplay, so I could see myself spending more than the current price on the market. This is not neccesarily true for everyone and even though it is a good game in every aspect, due to the aforementioned relative lack of content, unless you are a sucker for this particular setting and atmosphere, you might want to play it safe and wait for a discount.",
            "review_score": "1"
        },
        {
            "review_text": "This is the one MMO I can still play. Tierd of your basic class based gameplay with the same kill x number of things or collect 10 rabbit ears that drop off the feral rabbits then this is kinda your game. You still get those kinds of quests but they aren't the only types. Want story told to you through fmv and cutsceens instead of reading page of ater page of text then here you go. You like read all that text then there is plenty of optional reading to keep you busy and entertained for years. I've tried all the other games but they just kept hitting too close to the same strike zone. This one is still close but far enough away that I don't get instantly boarded and a been there, done that vibe.",
            "review_score": "1"
        },
        {
            "review_text": "SO, let me say i'v been addicted to this every since i played it, i was tempeted to buy it at first but i gave it a try. Trust you should give it a try while it's on sale perfect steal it's fun!",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game. Some minor bugs. Love the difficult/esoteric knowledge puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Let me begin by saying I loved it for the first few minutes while the story was playing out - then I hated it for the seeimingly simplistic combat - then I loved it again once I realized the actual depth of the game.  It seems a bit obtuse and shallow at first - but stick with it through the growing pains. It's incredible. The mystery, the story, the characters - the surprisingly deep skill system and active/passive abilities - it all combines to create an experience that will have you thinking about when you're away from your keyboard. The graphics are good, the controls decent, and the UI is very customizable.  You don't need a sub, but you get little extra perks here and there if you are subbed. You get a boost in XP and currency, as well as some in-game goodies and whatnot. So it's not 'pay to win,' but as a member, you're journey will have some extra perks.  I got it at a sale price of like $20 which I'm pretty sure affects my perception of value/enjoyment, but I'm pretty sure I'm gonna sub and see this game through to the end. Or maybe not; they keep releasing new chapters, so I may always have something new to do!",
            "review_score": "1"
        },
        {
            "review_text": "It's a really cool mmo with interesting story lines, both main and side quests. Lots of side quests that you actually want to know the ending to and it really gives you a sense that there is a world that exists and has existed before you got there. The voice acting is good too. I like the dungeons and holiday raids too.  also There's a huge amount of build customization which allows for really unique ideas.   ~8 active skills and 8 passives ~stats are determined by gear or talismans (so switch gear real quick to change your build even mid dungeon and you can change skills too)  ~gear are purely stats your asthetic appearance can be changed with other items in a drop down menu so you can be as bad a.ss ( or  s.l.utty/  re.tar.ded) as you like ~you don't level up but simply get more skills and points to wear higher 'level' stuff ~the gear levels only go up to 10 so the real challenge is just getting more XP when you want to try out making a new build which is super fun",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game for awhile i have to say i love it. The mssions are awesome and the lore is amazing. Each quest has an interesting plot that goes farther than kill x of y or colect x of b, ontop of the investigating quest forcing you to relay on real research and knowlege out side of the game (translating greek, morsecode, looking into Bible ver). The modern settings is also i nice change from the traditional setting.  The combat is interesting and defferent than any other MMO i have played, along with the ability to build any way you want.. not being stuck in a single class. That all being said this MMO is an MMO for people who may not like MMOs. You can play and have fun by youself, in fact that adds to the setting of isolation. The community is friendly and more mature than other MMOs i have played and are willing to help you solve the sometimes very hard puzzles.  All in all this is an inteligent mature MMO, Would totally recommend",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and sometimes scary as hell MMO.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It's so interesting and it's hard for me to stop playing. Can't wait to play more!",
            "review_score": "1"
        },
        {
            "review_text": "I did buy this game long ago and got the Ultimate edition on steam later on, so i have way more hours in this game than Steam shows.  To keep the review short. Pros:  -The story is amazing and you just can't put it down. - The class system is kinda unique you can be anything you want to be with one character. - The factions are fun and their stories are interesting too.  Cons: - Well the episodes can add up and get really expensive to buy, but it's kinda understandable since the story is well made . - It feels a little like the game is trying to milk you like a cash cow, but the game is playable without the micro transactions.",
            "review_score": "1"
        },
        {
            "review_text": "Underrated/hidden gem so far. Solid voice acting, pretty fun feeling gameplay (for MMO standards), lots of customization and honestly a nice UI. It feels like a single player game but in a persistent MMO world, which makes it feel really unique so far. I've played WoW for thousands of hours and I would recommend this game on sale easily, I can see me playing it for a number of hours to come.  Also, having an in-game browser is a really cool feature and makes me wish it was in more games, especially MMOs. Very clever choice.",
            "review_score": "1"
        },
        {
            "review_text": "Must have for people who look for a fantastic story based mmo with Alot of different paths builds and elements",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this game quite a bit as it offers a lot of different ways to go about same task. There isn't just one way to complete something like many MMOrpgs force you into. And the quests riddles/puzzles are unique keeping you on your toes than the traditional slay x amount of these or collect this .. market this etc.  I like to recommend this game to rpg'rs looking for something different",
            "review_score": "1"
        },
        {
            "review_text": "FIRST MMO I HAVE TRULY GOT INTO.  This game is brilliant for people wanting a little bit more than the traditional fantasy MMO with the classes you have to stick with. In The Secret World the setting is modern day as you work for 1 of 3 factions; Templars, Dragons and the Illuminati. Classes are build up from a skill tree which you can interchange along with 2 weapons, experimenting with the weapons and skills means you can be a DPS one dungeon then switch to tank the next without having to start a new character.   If you are a fan of monsters this MMO has you covered as you battle things rangin from zombies, vampires, werewolves, wendigos as well as massive demons and cthulu. In my opinion missions are alot more fun as 'kill x amount of mobs' are fairly rare and instead are replaced by thought provoking tasks (which sometimes require ARG segments). The story is engaging and with it being in a modern setting, the aesthetic is very pleasing to roam around in.",
            "review_score": "1"
        },
        {
            "review_text": "5650 hours in and not a single regret! ",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of Lovecraft, King, Barker, Cambell, Derleth, Chris Carter, William Gibson BUY THIS GAME!  It quite simply kicks ♥♥♥, has an amazing soundtrack a deep and engaging storyline and the single best community in any MMO.",
            "review_score": "1"
        },
        {
            "review_text": "What a mind blowing awesome game! Cant believe i had never come across this game before. Ive never spent 20 hours in a game so quickly before, and to be honest im not even 10% into the game yet. I can easily see this game being over 500 hours especially with the expansions that i got included with the ultimate edition!  After 20 hours, im no way near bored, still discovering and learning new things every day and the missions are so much fun! None of the quests feel boring or repetative, they actually feel like real quests that you are doing. Plus for the main quests i love seeing the FMV sequences play out, they can be quite fun!!  If you havent seen this game before, i urge you to not think about it, just buy it! The only problem is that when you get into this game theres no getting out, and you wont be able to play anything else for weeks to come (probably much longer!)!!! ",
            "review_score": "1"
        }
    ]
}