{
    "app_id": 215530,
    "name": "The Incredible Adventures of Van Helsing",
    "release_date": "2013-05-22",
    "developer": [
        "NeocoreGames"
    ],
    "publisher": [
        "NeocoreGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Hack and Slash",
        "Action RPG"
    ],
    "achievements": 95,
    "positive_ratings": 4993,
    "negative_ratings": 1064,
    "price": 10.99,
    "description": "Put on your wide-brimmed hat, grab your weapons and embark on an incredible adventure in the gothic-noir world of Borgovia, where mad science threatens the fragile peace between monster and mortal.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/215530/header.jpg?t=1507543615",
    "minimum_requirements": "OS:Windows XP SP3, Windows 7, Windows 8 Processor:Dual Core CPU 2.0 GHz Memory:2 GB RAM Graphics:GeForce 8800, Radeon HD4000, Intel HD4000 (min. 512 MB VRAM)  DirectX®:9.0c Hard Drive:20 GB HD space Sound:DirectX 9.0c compatible sound card",
    "recommended_requirements": "OS:Windows 7 (64 bit), Windows 8 (64 bit) Processor:Quad Core CPU 2.5 GHz Memory:4 GB RAM Graphics:GeForce 560 or Radeon HD5800 DirectX®:11 Hard Drive:20 GB HD space Sound:DirectX 11 compatible sound card",
    "reviews": [
        {
            "review_text": "Beside the Torchlight franchise, Titan Quest and the free Path of Exile NeocoreGames' Van Helsing represents another alternative for those finding the latest Diablo entry a bit too casual. What's more is that while Van Helsing is shorter than aforementioned hack 'n' slash games it still offers a decent story and a lot of content. Due to the additional game modes (scenario and neverending story) it has a high replayability value, as well.  The game follows a quest of Van Helsing and his companion, the ghost Katharina, who try to get to Borgovia to stop a mad scientist. Along the way you encounter dozens of different enemies throughout numerous different environments. Some of these locales look stunningly beautiful: you traverse through a muddy forest fighting hideous monsters and evil spirits and also join the resistance in a town to fight the soldier-machines. These machines add the steampunk part of the game - with all the traps and contraptions you find they make the game even more diverse.  One of the things I liked about Van Helsing was its atmosphere. Sound effects and the score are excellent and I liked the sarcastic conversations between Helsing and Katharina. One-liners are common from them as well as from enemies and there are numerous references to other video games and films throughout the game. In order to find all of them it's worth hovering the cursor over all objects in every environment - Van Helsing might collect a quest item or just make a funny comment.  There are many sidemissions, of course, as it is common in this genre and there's even one that takes you throughout the game. You just need to carefully look everywhere and open all chests, containers, destroy all barrels and boxes as you might find the next piece of the puzzle. It's worth mentioning, though, that not all items are related to a quest, still, they will be part of the corresponding tab in your inventory.  Normally, Van Helsing wields two swords and two pistols. You can decide which way to go from there in terms of customisation. Beside these two tabs there is also one called Tricks (active spells) and Auras (passive skills). Every level-up grants you ability points (the good-old attributes we are talking about here), skill points and occasionally reputation points, but the latter is not related to quest but more to the annihilation of strong beasts. Your reputation can then yields you perks - the list is gradually increasing and you can pick more and more of them along the way.  Katharina, the ghost companion is a bit similar to the pet we have in Torchlight. She can do the shopping on behalf of us and can also pick up loot by category. Her behaviour is completely modifiable. Of course, she has many skills and also attributes - her skills either make her stronger or support Van Helsing in combat.   While there are no other companions in the game the abovementioned customisation I described for Van Helsing is the Hunter class only. With the added DLCs you can play as a Thaumaturge or Arcane Mechanic. I hear they are pretty fun and diverse, too, so this is all the more in favour of the longevity of this game.  Van Helsing is pretty cool game considering it is a relatively low-budget hack 'n' slash. It is filled with content and there's high replayability due to the 3 different classes, more difficulty levels, hardcore mode, online cooperative mode in the game. I look forward to playing with its sequel. In the meantime, if you are the fan of the genre Van Helsing should be in your library. Word of advice: buckle up as the game can be pretty challenging even on normal difficulty setting!",
            "review_score": "1"
        },
        {
            "review_text": "This game is as its name implies: 'INCREDIBLE'!  I have played Diablo, Diablo 2, Torchlight, Torchlight 2, and not one of them was as pure fun as this.  The main characters, Van Helsing and Katharina are what makes the game great. They're incredibly funny to listen to. Great dialogue, with very nice voiceovers which seem almost impossibly good for such a small game. The references to other games, books and movies are great and fit the tone, which is always one of (mostly) lighthearted fun. The game is set in a sort of dark steampunk/clockwork setting, but it always aims to amuse and not to drag you down. It doesn't take itself too seriously and that is rare in games like this.  It is a solid ARPG, and the mechanics are simple and still have depth and it's really fun and rewarding trying out different approaches. You can play your Van Helsing as a gun-toting Monsterhunter or as a sword-fighting Slayer. You can even play him as a Mage. Each class plays very different and you can also adjust your companion similarly, which is a great idea.  As I said, I got more fun out of this than Torchlight 2, for example (the story here and the graphics fit my tastes better), so it is a definitve must buy for any ARPG fan, especially if it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "  The Incredible Adventures of Van Helsing – REVIEW",
            "review_score": "1"
        },
        {
            "review_text": "A memorable hack-n'-slash ARPG. The gameplay is not necessarily unique, but the game manages to stand out in its own way with its 'magic vs machine' theme. It also has quite a bit of technical flaws, but the art style and the steampunk atmosphere manages to make up for it. (I have not tried co-op mode yet, so do not expect it to be included in this review)   Pros:",
            "review_score": "1"
        },
        {
            "review_text": "Great game, very nice hack'n'slash. This game have very nice plot, main hero and companion Lady Catarina.",
            "review_score": "1"
        },
        {
            "review_text": "A great Action-RPG. Similar to Torchlight/Diablo, if you like your RPG's to have a lot of loot then this game is for you.   Not particularly long but it's also quite cheap. As far as 'bang for buck' goes, you'll get your money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a real mixed bag. On one hand - its fun. It's well designed, has interesting character aspects (skills, perks, etc), a companion , nice graphics, good gameplay.  On the other hand - its hard to enjoy it when the game is riddled with bugs. Some of which were litterally game stopping (eg Industrial Port / Palace quest bug - only recently (12/10/13) patched. There are also other numerous bugs (now with fixes via the /FixQuest command) - and MP hasn't worked for many (perhaps patched today as well) and warning of data loss for MP characters. For some, having your game not progress unexpectedly, requiring you to search the web for solutions, isn't enjoyable or expected from Steam games.  Perhaps now, the game is bug free. Perhaps not. I would say this game is not one i'd reccomend due to how many issues there have been that are substantial (MP, game stopping bugs) - unless you can get it for a massive Steam discount (80% off). Then the risk would be worth the reward. Paying full price now - without time showing if all the bugs are fully worked out - is not something recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "This is pretty good. I am long since tired of Diablo clones, but I liked this one. It is worth a playthrough, somewhere on the order of 10 hours of play. It does not try to stretch that to 40 with fake longevity or 400 by asking you to keep re-running the same maps. It's not flawless, and I wouldn't recommend it without a sale (I got it in a Humble Bundle), but it does its job of being entertaining and engrossing.",
            "review_score": "1"
        },
        {
            "review_text": "Van Helsing is an entertaining, monster-killing, townsfolk-saving trek through 19th-century Eastern Europe, but doesn't go that extra mile ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome diablo clone with only bad optimization =/,but anyway love it &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Graphics... check. Great Story and Voice Acting... check. Worthwhile level progression and combat... check. Looting that matters... check. Controller Support... CHECK! Instantly one of my favorites in it's genre. Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "A great ARPG. Does everything we want from an ARPG title, and a bit more. Does have some flaw, but not a deal breaker. The first series of a trilogy. Review based on GOTY version as the based version might have other flaws as mentioned by other review.   Pro     Memorable companion. The ghost companion makes me feel like I'm not just going out to kill monster randomly. I’m out for an adventure. She’s a playful character and does make all those little things interesting by her quirky remarks.    Quest system. The main quest system doesn’t differ much from any other ARPG, but the side quest is where it gets interesting. The game doesn’t use the standard exclamation-mark-quest-here for all quest. The quest might be out there hidden in the nearby area by interactable items. Once you get the item, read what the item tells you and look for any related items in the surrounding area.    Tower defence mini game. The game manages to incorporate a tower defence game without slipping away from its main genre. You can’t fully rely on the traps provided thus you should deploy the trap tactically and let you yourself be the main defence. Unfortunately, there are not much chance to play this mini game and only playable depending on the storyline.    The skill systems are well made. You have lots of build choice you can make. With the skill refund, you can change your playstyle midgame. The build might not be well balanced, but it might be just me, not good at creating a build.   Con     Artificial difficulty. As other mention, the game uses artificial difficulty by employing a sheer number of enemies. I’m not saying the enemies design are bad, but you always need to fight with a sheer number of them, and by that I mean, a buttload of them up to the point that you can’t move due to being surrounded by them. It is not undefeatable though.    Some skills are pure useless. The skill itself aren’t bad, but due to the artificial difficulty, some skills, especially single target skills are worthless. You’ll only use AOE skills or you won’t make it to kill each of the enemies one by one.    The game feels pretty short. Granted that this is only the first part of a trilogy, but it does feels a bit short. Nevertheless, it makes you want to continue with the second instalment. Probably it’s not really a con point.     Some bug and glitches can still be seen. For example, the Mana per second for Ray of Destruction skill are listed as Skill.Common.ManaCostPerSecond.   ",
            "review_score": "1"
        },
        {
            "review_text": "I want to like this game. The writing is decent and enjoyable, the ambiance is interesting, and it has a pet system similar to Torchlight, but with more customization and leveling options.  However, ultimately, in my experience, it devolves into a tedius grind at higher levels, where virtually every fight wound up being 'aggro group of enemies, kite for an unforgivably long time until all dead, run to next group of enemies', and I really can't overlook that. Maybe it would have been better if I hadn't been playing on Hard difficulty, but the lack of variation in enemy AI and length of time every enemy took to kill really wore on me.  Go download some mods for Torchlight II if you want to reinvigorate your Diablo-like experience.",
            "review_score": "-1"
        },
        {
            "review_text": "Diablo like game, I started multiplayer so I guess I didn't have any tutorial which made it more diffcult... Obviously it's not all like diablo, so I am happy because there is a really nice experience. I will definitely update this review when I keep progressing the game.  UPDATE 04.03.2016 part 1 ------------------------------- I got stuck yesterday. I didn't see half of NPC in Secret Lair. Tried everything... Had to do Old town once again, thanks god it was multiplayer so the other person had proper save...  USEFUL INFO 04.03.2016 ---------------------------------------   The game doesn't have 'I want to play once again' experience. Maybe with DLC, but... probably nah.  MUSIC ----------- So far music is really nice and calming. But repeative and does not make any athmosphere.  ISSUES ------------- My game sometimes freezes while I'm playing and I need to wait till it will pass. Music and everything is fine, just have 1 frame per 6 seconds...  MORE INFO AND SPOILERS... ------------------------------------------------  I wish there could be more essence adding gemstones... And more possibilities to mix essences. And also more powerful weapons... Fighting those monsters take ages with weapon 20-35 dmg...  I've got 6 different green set items, each and every one from a different set. And I can mix 3 items into 1 item, but I got nothing good anyway.  You have companion that acts like pet from Torchlight. You have sets like in Diablo. -------------------------------------------------  Update 04.03.2016 Part 2 ---------------------------------------------  There are some problems with the game. Firstly it's freezeing for no reason sometimes... Secondly it's repeative. When I mean repeative... I mean really... annoyingly repeative. The futher You go, the more it feels like grinding. Not hack and slash.  I didn't get any better weapon since good 10 lvls... And the drop isn't good either. From some quests both players get the same items with same stats... When you do quest twice.. Happend to me, because of the invisible NPC bug... You get the same thing, same stats from the same quests... It is trully a one time game...  I will update.  Update 06-03-2016 ------------------------------  Yesterday I finished the game. And I was very unhappy that I couldn't lvl up more than 30 lvl. That nothing really good dropped, and    the last boss was too easy    All that grinding for this? Well... Still 7/10. But probably wouldn't play again.   So far 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Time Bought: 1 week after release Money Spent: even trade with friend for Sniper Elite Nazi Zombie Army Worth The Price?: YES, and then some Position In Game At Time Of Review: finished story mode, maxed out hunter class, working on the 2 DLC classes  I was not expecting to play this game more than a few hours at the most since I have not been into an RPG since The Summoner from the first Playstation. Boy was I surprised!!! This game has GREAT graphics, AMAZING and INDULGING music, as well as REALLY FUN gear to upgrade and toy around with!! I have only played the sp so far and am enjoying every second of it. There are tons of funny easter eggs in the game that will keep you amused and laughing as well. I can't wait to experiment and play the mp aspect after some of my friends get it during the upcoming steam summer sale :)  Thank you again Unknown9916 for trading this wonderful game with me!!! :)  Rating: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "GAME CRASHES ON LOAD EVERY TIME.  IF YOU LOOK AT THE FORUMS THIS HAS BECOME AN INCREASING PROBLEM FOR THOUSANDS OF PLAYERS.  RUNNING:  4.2 GHZ PROCESSOR 8GB RAM 2 X QUAD CORE WINDOWS 7 HOME   ",
            "review_score": "-1"
        },
        {
            "review_text": "An incredible, insanely addictive game with great characters, great voice acting, great graphics, design and gameplay. Sadly, there is a good number of bugs which can prevent you from advancing further in the game. But the good news is, the developer is very responsible towards players, so as soon they notice the complaint, they make a patch.  At this point, I'd give it 8/10. It would be 9.5/10 easily if it was bug-free.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, I really enjoy playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game mix diablo, torchlight, and witcher in to a isometrice action rpg and you get this game. plays great with a controller although some feature need to be used with keyboard and mouse but a fun game overall",
            "review_score": "1"
        },
        {
            "review_text": "A ton of fun. If you liked Titan Quest, this feels like a spiritual successor. It's not very long, guessing around 20 hours. I got it for less than $7 though, and that's a great value. I'll probably replay it at some point as well. I'd say it's easily worth the price at full price too. It feels more engaging than your typical isometric arpg, especially playing at higher difficulties. They made most of the abilities have combinations, so you're constantly doing things. Unless you're playing the game on an easier difficulty, it shouldn't be a matter of spamming a single ability over and over (which is nice compared to a majority of these style games).  The leveling system feels nice. It's usually exciting to get a new level. There's also a reputation system, where you get to choose a new strong buff after gaining enough reputation. The reputation system felt a bit slow, though. I'm nearly at the end of the game and I've gotten around 6 levels in reputation. The loot system felt on-par with other games in this genre. I got the feeling that there weren't many 'set' items, but that actually was a positive thing given the length of the game and it's focus on a single player experience. I was able to complete 2 sets in my playthrough. I usually don't like forced companions in these types of games, but I enjoyed the companion in this one. She had a lot of dialog, and actually felt helpful. She also buffs you as you level her up. There are side quests that give you unique items for the main Hunter class, but you can equip them on your companion if you're not a hunter.  Overall, I had a ton of fun with this game, and I highly recommend it if it's on a sale or even if it's not. Just keep in mind isometric arpgs are not everyone's cup of tea.  I did not try the multiplayer, so I cannot comment on that.",
            "review_score": "1"
        },
        {
            "review_text": "Basically everything you liked about the Diablo games set in the world of Van Helsing.  +Good variety of monsters, skills, loot including weapons, armor, and of course Van Helsing hats +Different classes for different playstyles +Well-written and amusing spoken dialogue, especially between your character and companion +Companion gains levels and learns new skills just as you do  -Often crashes on loading new areas/zones -Fairly long initial game loading time -Not much variety in monster group sizes, that is they are about all in similar size clusters",
            "review_score": "1"
        },
        {
            "review_text": "it has something that torchlight and diablo series doesn't have :)",
            "review_score": "1"
        },
        {
            "review_text": "Nice ARPG, with a good protagonist and a great sidekick. The East European mythology + steampunk setting is a refreshing variation from the usual fantasy mix. ",
            "review_score": "1"
        },
        {
            "review_text": "A real gem for ARPG veterans or casual gamers alike. Do pick up the DLCs too, they are worth it!",
            "review_score": "1"
        },
        {
            "review_text": "Fun, but still very alpha (as of 10 January 2016).  1. Doesn't work on OS X 10.11.2. Crashes on launch. Tweak your system to make the game work. 2. Hordes. It's impossible not to die when 50 or more enemies attack you at once, all the time. I'm talking about casual mode. In despite of whatever skills or armory you possess. 3. My Mac meets all the requirements and I have over 30 frames per second. However, animations look very glitchy, skipping like 90% of all frames, despite of overall framerate. Even RuneScape animations look better. 4. The game keeps freezing.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly good game, but couldn't solve its 'incredible' random crash problem with the numerous ways suggested over the internet. (On an offline game, I have no idea how much its buggy on the multiplayer) Game crashes so often that it even didn't let me finish find the mayor quest. Waste of so much potential. If you're an RPG and hack'n'slash fan buy it, play it and if its not crashing every damn 8 mins you're good to go ^^ If you keep getting those crashes, get a refund immediately.",
            "review_score": "-1"
        },
        {
            "review_text": "6/10 if played alone, 7/10 with one or two friends, 7+/10 with three friends. Buggy even three months after release.",
            "review_score": "1"
        },
        {
            "review_text": "Guys you need to get this game so many referance to so many other things in this From lord of the rings all the way to indiana jones and thats just the 1st chapter. This game is worth the amount of money it is and it get better with DLC, My virdict after 5 hours is worth the time you will pump into it",
            "review_score": "1"
        },
        {
            "review_text": "One of those rare instances where the zerg rush has been perfected outside of an RTS. The first in a trilogy of games, Van Helsing's Hack and Slash adventure offers some surprisingly diverse game play, witty banter, teeth grinding moments, and an overall good experience in one package.    The game allows for easy switching between ranged and melee attacks. You're ghostly companion is also useful, as well as buffs you. The game itself is well done, with a pletora of items, stats, askills, and abilities to tweak to your hearts content. It also gives you the ability to adjust your stats and skills (for a price) so you don't have to worry about making a mistake in your build. The story is also interesting, with some good humour written into it.   The game itself is a little buggy. Music tends to dissapear at times, and the melee skill habitually dissapeared, very annoying during a fight. Even on normal, enemy density is quite large in some areas, resulting in the veritable zerg rush that can quickly get you killed if your not ready for it. While it does force you to put some thoughts into tactics, it can also be quite annoying at times (waaaaaay too much zerg on the last boss).    The other potential issue, is that the other two classes, and the ability to manually level your companion, have to be acquired via dlc.    Overall however, this was an excellent and enjoyable game that is worth trying if you are into diablo-esque games (though you may want to try and pick it up on sale so you can get the all the dlc at a good price). Looking forward to playing th next two parts in the series to see how the plot will thicken.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE THIS GAME! Seriously I havent played in a few years because this didnt work well with windows 8 or 8.1 but I am hapy its back! :) If you like great soundtracks and diablo style dungeon diving and brawling this is the game for you! There are great easter eggs that will keep you exploring as the mystery in this game sucks you in. I highly recommend this one :)",
            "review_score": "1"
        },
        {
            "review_text": "Every good thing everyone else said. I'm SO happy someone referenced this game in their review of a ♥♥♥♥♥♥ game I had purchased. I've been taking my time exploring every nook &amp; cranny, so I've only just started Act III -- therefore, I can't speak to replayability, 'endgame', the 'Nightmare' mode (can't remember what it's called at the moment), etc. But even if it ended with what I've experienced so far, it would still be absolutely worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game minus the multiplayer issues and some quests bugging.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, loads of builds, easily rebuild your character. Quest actions have different rewards, voice acting on all NPCs. Beats Diablo 3",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. It had a surprising amount of content for something only $15. Most of all I liked the sense of humor in it all.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 - It's ok.",
            "review_score": "1"
        },
        {
            "review_text": "Not very original, but a lot of fun. It's very much a Diablo clone, but it's far more polished and enjoyable than I would have expected. It's got a nice tongue-in-cheek sense of humor, fun if fairly mindless combat, a nice art style, and some fairly deep build customization options.  For such a low price tag, you can't go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "unreal game. lots of Steam Achievements to collect 10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed 'The Incredible Adventures of Van Helsing.' There's a lot to like: the atmosphere is great, Katerina is a wonderful snarky companion (and she picks up my loot!) and the storyline is nice as well. The game is rather short but bodes well for replay value. The thing that bothered me the most was the constant freezing - this game would freeze a lot (read: almost every time) during heavy combat. Quite, quite annoying. Regardless, I still enjoyed the game enough to buy part II.",
            "review_score": "1"
        },
        {
            "review_text": "Yet another game better than Diablo 3.",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining writing, an interesting setting and some clever game mechanics (especially the companion system) help this ARPG rise well above the pack.   It could explain some of its gameplay a little better, and some aspects don't work quite as well as they should, but the positives far outweigh the negatives.",
            "review_score": "1"
        },
        {
            "review_text": "If Diablo 2 met steampunk and Transylvanian gothic, it would look something like Van Helsing. Point and kill combat, a witty banter between the two characters, and a personal hideout. Fun times.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best Diablo-likes around. UI improvements in every area and several ways of control just because they could. Skill system several layers deep and innovative mouse-specific gameplay mechanics.  DLC sadly practically mandatory, but apart from that an incredibly solid game.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed playing this game. Although it may look a lot like Diablo (and it does play a lot like Diablo) it has an interesting way of doing missions and interactions with many NPC's allowing you to make choices which will affect your playing experience and the outcome of certain fights.  CO-OP is highly recommended for having the most fun.",
            "review_score": "1"
        },
        {
            "review_text": "A great Diablo-like experience!  Pros : - Interesting dark universe - Intersting main characters and interactions between them - Challenging - Cool loot!  Cons : - Classes locked behind a paywall, as DLCs (really?) - Some secondary characters completly meaningless/straight up dumb. - Can be too tough at times (might force you to run around to fight hordes)  I loved Diablo II, and I love that game the exact same way!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Drama with DLC and puplisher pricing but solid entertainment value.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good RPG Game such as Diablo III",
            "review_score": "1"
        },
        {
            "review_text": "A game that flew under the radar, this definetely deserves your attention, it is a fantastic RPG. Great vioce acting, flowing combat, riddled with references and secrets, and a vast variety of enemies and enviroments. This is a must own.  Buy it now!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game with a focused story that is dark and kind of funny.",
            "review_score": "1"
        },
        {
            "review_text": "The Incredible Adventures of Van Helsing is an ARPG. It's a very good, entertaining ARPG. I've had plenty of fun with the game, especially once the online was fixed and I picked up the Thaumaturge. The DLC classes are a bit pricey, especially since they add a bit of much-needed diversity to the game, but the base content is by no means bad. Just a bit limited in your character options, especially for more than 2-3 people.  The atmosphere and tone of the game is dark, but at the same time it's not. The dialouge is surprisingly entertaining, but not all that great. The back and forth with Katarina and the hunter is especially amusing. There are a few other humorous characters (like the priest in the village), but no one really THAT memorable.  The combat is pretty standard fare for the genre, but it's not bad, or even bland. I'm not a Diablo 2 veteran or anything, so I can't really say for sure how 'done-to-death' this whole system is, but I enjoyed it.  IT'S a good game. If you like ARPGs, or want to try them, it's not a bad one to pick up. Especially if it's on sale. Like it is right now.",
            "review_score": "1"
        },
        {
            "review_text": "The Incredible Adventures of Van Helsing Complete Pack is a beautiful, isometric action-rpg that provides a challenging experience which has a sense of humor, an interesting companion system, satisfying combat, very buggy controller support, and some noteworthy differences from the base version.  There's a lot of quirky referential humor in the game that I do not want to spoil here. Just make sure to explore everywhere and talk to everyone and... everything, especially in the first town. The world is not grim dark; it has a joke or two up its sleeve.  Katarina, Van Helsing's companion, is very helpful and has very interesting ways to alter her behavior to fit your play style. She will level up with you and has her own set of skills, two with the DLC. You can also choose three different states for her which include ghost (peaceful), melee, and ranged. You can alter how aggressive she is with enemies. She can also pick up different items of varying rarities automatically according to player desires. I had her pick up all the gold, ignore the white items, pick up the magic items, and fight enemies in melee form. It is a neat feature that is greatly appreciated and should be present in more games with companions/followers.  The combat requires you to pay attention and engage its systems if success interests you. The game has a combo system that alters how a skill can be used. For example, Earthquake, a spell that deals damage in a line, has three different power-ups that can be used in a combo: Brutal Stomp which adds 1.5 meters to the skill's width, Intense Shockwave which adds 30% more damage, and Scorching Fumes which burns everything hit for 10% of Van Helsing's Spellpower. You can spend skill points on the ones you want and organize them in whatever order. You stack up to three combos with the a, s, and d keys resulting in a very powerful skill waiting to be used. I went with 90% additional damage for Earthquake with a high critical chance build to great effect. I could have gone with 1.5 meters to width and 60% additional damage. Other skills have different power-ups available for experimentation. You will be working with Katarina to dispose of monsters while using tricks to change the flow of battle. I often used the one that freezes time to give myself a chance to observe the situation and line up Earthquake perfectly, especially when fighting extremely large groups.  This game will test the average player's abilities, but the systems it has in place makes it forgiving and approachable. Despite dying a good dozen or so times during my time with the game, I only had to pay a bit of gold to resurrect and continue the battle against evil. There are also special npcs in towns that can refund skill points for both the player and Katarina should you want to try a different build or made a mistake in your allocations.  Do not use a controller with this game. Playing this game with a controller resulted in a frustrating battle with the user interface. Looking at the skill power-ups wouldn't work for skills at the bottom of the page and laying down certain traps did not turn out very well. The combat experience works well enough, but the UI problems are severe enough to just stick with mouse and keyboard. The UI for mouse and keyboard results in faster interactions for everything and lets you properly look at all the information available. I spent fifteen hours with this game using the controller until I finally decided to stop torturing myself. The last four hours were blissful.  Finally, the complete pack comes with three different pieces of DLC which includes an additional skill tree for Katarina known as Blue Blood and two more classes, Thaumaturge and Arcane Mechanic. The Blue Blood tree has some really powerful abilities that drastically change Katarina's performance. She could rival me in power and I do not know what I would have done without her. Blue Blood allows for major damage, health, and defense increases. It also gives her different passive spells that she can activate based on chance or even death for one of them (big explosion). It even adds an often used Trick called Ghostly Mirage which allows for two Katarina illusions that can deal damage. The two extra classes, basically a mage and a scientist/engineer, have one main skill tree and a heavily modified Tricks tree allowing for a different experience from the Hunter who wields swords and/or pistols with some magic. If the classes do not interest you, I still heavily recommend Blue Blood unless you want an extra challenging experience.  The Incredible Adventures of Van Helsing is a good action-rpg that should entertain those familiar with the genre. Again, I am heavily recommending to not use a controller with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Love Action RPG / Hack &amp; Slash games? Do yourself a big favour and just get this.  The graphics are tone wise what I would have expected of a proper Diablo 2 sequel.  Lovely story, humour rich content and satisfying gameplay. This is a game you will play thorugh to the end, and it has an amazing soundtrack.  Can´t recommend it enough!",
            "review_score": "1"
        },
        {
            "review_text": "Personal Rating: 7.5 of 10  Hack and Slash RPG game. Gameplay and mechanics is identical to Diablo and it comes with decent graphics and soundtrack. The developer has come a long way to patch and fix the game since its release but it still has tonnes of bugs. However, developers are still pretty much active to resolve them. The only drawback of the game is that the maps are not randomly generated hence reducing the replayability greatly.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game, great story, witty banter between the npcs with humor and a really functional game with a lot of replayability.  The game is one of the most complete action rpg's i've played since Diablo and Diablo 2 and i really felt pulled into the game from start to finish.  I had zero bugs that i can remember and it was very easy to pick up the mechanics combat / skill sets but deep enough to keep you thinking.  Graphics fit well and looked great, also a rarity the DLC are worth getting and add to the game.",
            "review_score": "1"
        },
        {
            "review_text": "6.5/10  Mechanics are pretty much like in Diablo III, except you dont need to farm half a year. A bit more dynamic, a bit more casual. Graphics quality is not as good as in Diablo, but it looks well. I've found some mobs pretty awesome and scary.  Anyway, not so many RPG games to play on Mac.",
            "review_score": "1"
        },
        {
            "review_text": "Okey guys. If you like RPG's (Diablo, Neverwinternights, Torchlight, Dragon Age...etc) this game is jsut for you. It has cool story line full of different interesting quests and jokes. And jokes are really funny. + amazing sound + amazing details + cool upgrade system and, of course its gameplay. I did this game on nightmare(or whatever last lvl says), and i got tonn of pleasure. It wasn't so easy to make some quests,but that is all the point - hard game means emotional game. For example one achievement about killing Igor's (don't worry,not a spoiler) worth a lot. You are trying to kill another ♥♥♥♥♥♥♥s,while Igors try to kill you, that's unforgetable. Last time i was so happy after game'd ended - Dragon age 1-st (also nightmare).   _______  To summ up: buy it,feel it, listen to it. enjoy it",
            "review_score": "1"
        },
        {
            "review_text": "I'm torn on this one.... Great gameplay and quite decent graphics, but the voice acting was incredibly brutal. the female companion said and repeated the most idiotic things in an over the top and phoney accent that was quite transparent at times. She was the deciding factor in deleting this from my hard drive.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Good gameplay and nice graphics game! Worth all the money!",
            "review_score": "1"
        },
        {
            "review_text": "Having finished Van Helsing in Heroic Hardcore with melee orientated setup, I can only say that it has been a worthy and enjoyable fill to my Diablo 2 addiction. The Blue Blood DLC helped a lot to clear up later levels which previously I found too hard (completed it by only reaching lvl28). Single playthrough took about 35 hours completing about 75% of achievements (could have been higher but gave up on achievements after aiming for the 'But they are so cute! one by not killing any Igors at all, until the very end when one died by accident having forgotten to switch Katarina to ethereal). Enjoyed the good graphics, very funny dialogue and a lot of action. My only disapointment was the let down felt once completed, with only a 30sec cinematic ending the game.   TL;DR: I would highly recommend 'The Incredible Adventures of Van Helsing' to anyone that is a fan of Diablo 2 type of games or anyone looking for an action/ hack and slash rpg adventure. ",
            "review_score": "1"
        },
        {
            "review_text": "I usaully dont reviews games, but this one caught my attention:   1.Voice actng is average 2. story is decant 3. Gemplay elements are ok 4. Side missions are creative, but broken 5. Everything can one shoot you 6. Some zones you cant leave you are forced to use town portal 7. 60 potions will only last you for about a min 8. The mobs have over 5 buffs and mini boses's have over 12... and that was all in the first area... later on they became so fast and area so narrow you cant even kite them   Do i recommend this game; yes if you are bored and got nothing better to do  oh and if you think diablo 1 was hard, I recommend you trying this one out It will change your mind.  I was playing on casual with a friend( who happened to wrote his review right bellow me) and the scaling was on hard , and when we tried hard it was heroic... the expirence of hardcore is basicly right click delte save game file, because you will die on first incounter....  if you are playing this for the sake of story save yourself time and patience and go watch a playtrough (if anyone actualyl lasted for 70+h )   DONT LISTEN TO THE GUY BELLOW ME OR EVEN ME PLAY THIS GAME AND EXPEREINCE THIS AMAZING ADVENTURE OF GLITCHINES!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Van Helsing is definately not a game without flaws, but for the most part they all seem to have counterpoints. The lack of meaningful character customization is off-set by the tightly focused story-driven nature of the game. The static maps kill replayability a bit, but also allow for better designed set pieces.   The skill system is a shallow ocean- giving the illusion of depth but in order to be viable you really need to pick a set of a couple skills and pour all your points into them. I can't speak for the ranged tree as I primarily played melee, your choices are somewhat limited given the crazy mob density that this game throws at you- which, don't get me wrong, was definately a positive- but it means that you need abilities that will kill a lot of guys at once in order to keep from being overwhelmed or whittling guys down at a choke point one at a time for hours on end. Then, while you're doing that you realize you could just be Earthquaking all the guys in a row and be done 10 times quicker.  In short, Van Helsing is worth the price of admission, especially if you can catch it on sale. It's a fun, short romp that does what it advertises, just don't expect a Diablo/Torchlight/Path of Exile killer.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and interesting, especially if you like the old Diablo games.",
            "review_score": "1"
        },
        {
            "review_text": "What a fun gamevery Diablo 3 like and the banter with the ghost and Van Helsing is awesome...",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed it a lot,nice gameplay and well developed characters.worth buying",
            "review_score": "1"
        },
        {
            "review_text": "With the plethora of options available to the modern ARPG connoisseur, Van Helsing finds itself an average product on a shelf packed with fantastic games at extremely reasonable prices. It's unfortunate, because I'm sure this game would've been considered great in 2004-2008. With Torchlight 2, Diablo 3, and Path of Exile easily available - all superior options, and all unique from each other - the generic and mediocre Van Helsing cannot be recommended in good conscience.",
            "review_score": "-1"
        },
        {
            "review_text": "Just got during sale, cant connect to any game because of a server mismatch. Just says PINGING.   ?? Now after reading other comments this problem has been happening for since the game has been out! That is bad, when is this getting fixed!!!  This game is USELESS without a connection.",
            "review_score": "-1"
        },
        {
            "review_text": "Really funny RPG , its not close to Diablo 3 but it's really cool . I'd describe it between diablo 3 and torchlight 2",
            "review_score": "1"
        },
        {
            "review_text": "Biggest waste of money of mi life. can't play the coop mode with a friend,can't join an online game,it crashes,i play diablo so good and this game (that seems to have fewer requirements),works so bad. Everytime crashes or don't work correctly when trying to play online. Since december 2013 they had this problem and they just don't fixed it. DON'T BUY THIS,IT's WASTE OF MONEY.   It is a hoax ",
            "review_score": "-1"
        },
        {
            "review_text": "If you really enjoyed Diablo or those type of games, it's worth checking this game out. The developers obviously cared about their finished product.  If you're on the fence or you do not enjoy those games, do not try this. The first half of the game is pretty enjoyable, but after a while you either get so specialized and good with your skills that you are ripping stuff apart or it just feels downright repetitive, although that may just be a hallmark of this type of game's combat system.  It's about 15 hours long, give or take a few hours depending on how quickly you move through it and how thorough you are. I played the entire game single player, so perhaps multiplayer is a completely different experience. If you plan on playing this alone though, unless you're really in love with this type of game, do not purchase it.",
            "review_score": "-1"
        },
        {
            "review_text": "IDK i foind it boring can't play over 30 min in 1 session",
            "review_score": "-1"
        },
        {
            "review_text": "  This wasn't what I expected when they said Bloodborne was coming to PC",
            "review_score": "1"
        },
        {
            "review_text": "Game has 1 free class...",
            "review_score": "-1"
        },
        {
            "review_text": "I've played a lot of Diablo and this is almost as goog",
            "review_score": "1"
        },
        {
            "review_text": "Well, this is going to be a very opinionated review. It may be due to the fact that i am not a very big fan of this type of game, but i did not find this game very satisfying. Even buying it when it was 70% off still leaves me wishing i had my six dollars back. Upon entry into the game i instantly began comparing it to Diablo III because i absolutely enjoyed that game to the fullest, and upon a dissappointing few first moments, i decided to give it a try none the less. After playing for a couple of hours, gaining quite a few levels, it became unbearable. Again, taking into account I don't usually play this type of game, it was just bland. Yes it offered lots of hack and slash action but it seems like too much of a rip off of Diablo, except with less depth. The game offers very little customization, and seemingly similar talents, which in the end, just leaves you with a boring grind for gear to defeat the final boss... not very impressed. 3/10 in my eyes",
            "review_score": "-1"
        },
        {
            "review_text": "Nice potential, but the game is way too buggy to be played. Constant crashes, connection issues, 'skills without cooldowns' bug, 'camera angle is messed up' bug and many more.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a good action rpg with a diffrent type of setting which drew me in,A bit more harder then other action rpgs ive played The time ive played it which is small due to other games, Ive enjoyed it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok for a time waister, but you never really feel powerful or seem to find any amazing equipment. I kept going thinking it would improve. I like the premise but it just feels....off.",
            "review_score": "-1"
        },
        {
            "review_text": "Gamepads without functions:(",
            "review_score": "-1"
        },
        {
            "review_text": "The Incredible Adventures of Bug Helsing.  The game is so bugged all my NPC's ran away... Literally.",
            "review_score": "-1"
        },
        {
            "review_text": "This game basically improves on everything Diablo 3 was lacking and adds a huge amount more. Truly one of the best Diablo style games I've ever played, and I've played Torchlight, Diablo 3 and Path of Exile.",
            "review_score": "1"
        },
        {
            "review_text": "Graphics are beautiful an the world is extremely well done creating an enriching atmosphere... the voice acting is well done an so is the story... the game audio an music is extremely well done an creates an even deeper atmosphere for the game... the combat is smooth an flows well with the game an the amount of powers an special abilties you get along the way keep the combat fresh an entertaining... the controls once you get used to them are probably the best I have ever seen implemented in a ARPG an also help keep your attack an defense tactics flowing an unpredictable to enemies... the AI is done respectably well by being powerful an challenging enough that you will feel accomplished for defeating them an will not run through them like a lawn mower cutting grass... Solid 8.5/10 for me and well worth the price of admission.",
            "review_score": "1"
        },
        {
            "review_text": "Take Diablo 3, make it good, thats this game. 10 Vampires out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Cool.Big Graphics and game quality but lots of bugs ",
            "review_score": "1"
        },
        {
            "review_text": "The game is not properly balanced. The way monsters swarm you makes the combat and gameplay not very fun. It does not live up to the standard set by Diablo, in my opinion. I would recommend Gauntlet (when on sale, due to limited content) or Path of Exile (if you like the grind) over this.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly buggy game after just a few hours of play. Was unplayable in 4-player multiplayer.  'Minor' issues we encountered: random extreme lag, quest and UI bugs 'Major' issues: constant fast travel and loading screen related crashes, getting stuck in inescapable areas,   and my favorite bug that ended it for us: several of our characters were permanently transformed/cloned into multiclass freaks complete with merged inventories and skills. It was the most hilarious game break I've ever seen.  I have no idea how this game has an 86% positive rating on steam. Completely broken and buggy mess. Can't even comment on balance and story because we never made it past the early game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's alright.... its a copy of torchlight with 1/5 of the storyline or gameplay with less cartoony graphics.. It's alright....",
            "review_score": "1"
        },
        {
            "review_text": "o.k... first, this is a blatant Diablo III ripoff.....UI, loot, combat, even main character voice! however, it's set in a steampunk era, you have a base, memorable characters... overall i enjoyed this MORE than Diablo III... at $14.99 this game is exceptional!",
            "review_score": "1"
        },
        {
            "review_text": "I don't know why that's so much hate on this game. It's a good game but sadly it's extremely underrated. While games like Call of Duty gets the most attention and it's the same ♥♥♥♥ every year. The game is like your typical ARPG games just like Diablo or Torchlight. So if you like games like Diablo or any other ARPG games, then maybe you'll like this (or not). Plus the graphics are awesome, give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Atmospheric ARPG, more customizable than obvious at first glance.",
            "review_score": "1"
        },
        {
            "review_text": "Van Helsing is a good indie aRPG. I say indie, because if this had been released from a well known publisher it would have been treated as garbage and been on every 80% off sale it could find. Why do I say that? Well first let me just say that I wholly recommend this game! It's very fun and engaging. It presents a decent reward system. The graphics and sounds go along well with the pace of the action. So why call it garbage?   I didn't, I said it would have been treated as garbage had it been released from a big company. Van Helsing has bugs... Game breaking bugs wherein you can not complete main/storyline quests. Multiplayer bugs where games will just crash randomly or lag for no apparent reason or even spawn you into places where you are not supposed to reach thereby making you have to quit and return to the game. No tutorial for advanced features. Want to know how to upgrade (socket) items? So do I, go look for a youtube video, because this game honestly never tells you. The sounds, while going along well are somewhat repetative or campy. Also, the graphics, while they look well, enemies have a tendency to blend into the scene making it hard to know if you've killed everyone. It sports a strange control scheme and has no option to evade combat. If you're ranged and you get swarmed you can't run away because clicking in any direction means you're going to auto-attack. Also, if you have a controller plugged in, the game will not allow you to use a mouse and keyboard. You must exit, disconnect the controller, and restart the game.  Wooo... That was a long list of dislikes! I'm sorry, but I want you to know what you're getting into if you decide to purchase this title. Van Helsing has issues, BUT the game is fun! There is good dialogue and a story that makes sense. How many aRPG's have a story... and that makes sense!? The action is paced very well and never gets boring. There are quite a few quests to complete and I never had an issue figuring out where to go to complete them. Even though there are bugs the development team is working hard to correct them. Yes there are some instances where quests can't be completed, but until that's fixed, they've released a patch where you can bring up a console and complete the quest you're stuck on. The DLC classes provide more options. I like the Thaumaturge class. I'm very squishy, but I can take down the largest of monsters with ease.   So here's my final recommendation: If you like aRPG's and are looking for something to fill the gap between releases from big companies then I say grab this title. You will not be dissapointed. If aRPG's are not in your cup of tea, this game will not change your mind. If you are on the fence, just look over my comments about the bads and the goods. If you can live with the bads I think you'll find a lot of fun to be had here!",
            "review_score": "1"
        },
        {
            "review_text": "I haven't finish this game but i love the story and gameplay maybe is good for me since in the last few months i got some really bad games from steam.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth the $5 sale price. Only been playing it for about half hour. Haven't even seen the secret lair yet.",
            "review_score": "1"
        },
        {
            "review_text": "Quite a fun little RPG, even if it is pretty short. There isn't a lot of stratagy, it's a hack and slash. It does it better than others I've tried though. Although I wouldn't pay full price it's worth picking up when it's on a sale. Also has some Tower Defense sections that were fun and broke the game up a bit (In a good way).",
            "review_score": "1"
        },
        {
            "review_text": "Guzu, get this game now or Shinji Ikari will come and masturbate over you while you're sleeping.. Seriously, it's a very good game and it's ♥♥♥♥ing cheap now!",
            "review_score": "1"
        },
        {
            "review_text": "Don't have Diablo? Fan of Demon Hunting? Like Loots, i mean LOTS OF FREAKIN' LOOTS? Like to play Hardcore RPG Hack n Slash with friends and die easily? Then Get this game already!!! No regrets!!    10/100 Would die in 1 hit again.",
            "review_score": "1"
        },
        {
            "review_text": "One of the closest game to diablo I. Multiplayer works fine. ",
            "review_score": "1"
        },
        {
            "review_text": "I love the incredible adventures of van helsing I cannot wait until the incredible adventures of van helsing 2 comes out next year.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun ARPG. The play mechanics are excellent, the maps are huge, the quests are fun, and, for a lower budget game, the voice acting is quite nice. There are two DLCs thus far and for those who have the game, the dev has offered a unique item and an aura as a thank you.   Diablo, Torchlight, Grim Dawn, and other ARPG players will feel right at home with this game. There is a LOT of loot, a nice skill tree for your main character plus your ghost companion - she is a blast BTW with her snide and condescending remarks to Van Helsing. But, unlike the annoying companion in Legend: Hand of God, THIS companion is also a potentially gruesome, merciless killing machine. The DLC offers more replayability, but, even without it, you can play through the game again and specialize in different kinds of attacks - the same goes for your companion.  This game LOVES to swarm you and enemies will attack in all directions - it's absolutely glorious and at times, loot drops can be almost as crazy as Torchlight II.  I hope that Neocore will consider making a sequel. The game would easily compete with the best triple A ARPGs out there. A random map function would really round the game out.   Props to the devs who have been VERY responsive and have kept this jewel up to date. I am an ARPG fanatic and The Incredible Adventures of Van Helsing is one of the most fun I am still playing.",
            "review_score": "1"
        },
        {
            "review_text": "Where is Local Co-Op?",
            "review_score": "-1"
        },
        {
            "review_text": "Just finished the game and it was great.",
            "review_score": "1"
        },
        {
            "review_text": "I would strongy not recommend this game on iOS as after last update it does not work at all and there isn't any workaround yet. Basically it's a rip off. Developer states a game is available on iOS, but the opposite is true...",
            "review_score": "-1"
        },
        {
            "review_text": "What's with all them people recommending abysmal, amateur games lately? Stop feeding me this pig grub and making me spend money on trash titles that only waste my time.  Van Helsing is basically a shovelware title made only to generate income for the least possible costs possible. It's your standard, soulless, mediocre-but-annoyingly-bad-at-the-end hack'n'slash. Everything in this game screams with lack of creativity, the lack of any ultimate point of this title being even made besides 'people will buy anything at steam sales' logic. Yeah, let's take an interesting theme and turn it into another uninspired shovelware.   I fiddled around a little with characters, progressed a little into the story but the fundamentals of the gameplay, controls and the balance (that ranged class was a total afterthought, it's so underpowered and limited compared to the hunter) turned out to be terribly implemented and got me ultimately bored on hard difficulty. There's literally nothing of interest in this game, everything was done before and better.  But the worst part is that killing enemies is fiddly (targeting is a chore, especially with the ranged character) and absolutely unrewarding, which means it's unsatysfying. Even putting down boss enemies turns into running in circles taking that HP bloat down for some crappy loot worse than anything you get from a vendor.   Oh, yeah, how about tying difficulty level with number of enemies? That can't go wrong, can it? Yeah, it can and it did, because the only thing it changes is forcing the player into doing more circles kiting enemies until they all go down.  How about ♥♥♥♥ voice actors on the top of that? Apparently some people liked them generic characters with terrible va - and terrible dialogue lines in this game are being described as 'humorous'. What? Straightforward terrible references and unfunny lines are 'humorous' now? Seriously?  Hard to see a good h'n's lately. Just get Torchlight 2 which is better in everything from Van Helsing. Even if it has arguably worse esthetics.",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't even start on my Macbook Pro, DON'T BUY!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Frustrating, incredibly buggy game.",
            "review_score": "-1"
        },
        {
            "review_text": "I am very disapointed in this game as a vampire lover van helsing is not all good in this game. The game mechanic is terrible and so is the graphic making all charcter cartoonish while the lands some what better. I'm sorry to critize on the hard work but it pisses me off that i waste money on game like this to be surrounded by werewolf in a heart beat not even allowing me to attack from any range. So I highly recomened not buying this game if your not into bad mechanic games.",
            "review_score": "-1"
        },
        {
            "review_text": "Diablo clone. really good game!! got some tower defense in there as well.brilliant!",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game but a true hack and slash, got kinda boring after awhile!",
            "review_score": "1"
        },
        {
            "review_text": "Wow it's bad",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game, but easy. Too easy.",
            "review_score": "1"
        },
        {
            "review_text": "Game refuses to start. no amount of deleting and reinstalling has fixed it or verify game cache. Wasted my money not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "very bad  it doesn't launch on mac !  and the support doesn't care !!",
            "review_score": "-1"
        },
        {
            "review_text": "if you like games based on books then this wont disapoint you. lots of monster lore and other goodies. also achievements left and right making you feel good for doing stuff. love it.",
            "review_score": "1"
        },
        {
            "review_text": "hey guys it's the boy you been wait forr kk js whats good is van brah   21/10 wont play again. IGN ",
            "review_score": "-1"
        },
        {
            "review_text": "Hideous controls playing it on PC with movement and 2 main attack spells being on mouse buttons so you probably need gamepad. Also thought perk/talent/skill system is unnecessary complicated. After each level up you have to put silly amount of skill/spell/perk etc points to urself and ur companion. Spell choices themselves seemed kinda awkward and a lot of them felt like offering to choose the visual instead of different playstyle. Liked that every quest is voice acted and the relationship between main character and his companion was also pretty entertaining.",
            "review_score": "-1"
        },
        {
            "review_text": "Standard fare for a hack and slash, in terms of gameplay. Dialog was barely tolerable, though.",
            "review_score": "-1"
        },
        {
            "review_text": "There's really nothing incredible about this game... It should be renamed to the mundane, boring, been done before adventures of some guy who looks like Van Helsing. It's been patched more times than Diablo 3 and D3 is still a much better game than this... which is a sad thing to even admit.  Near the end I had to just stop playing it because it turns from a Diablo clone ARPG to a lame tower defense game that completely sucks the life out of you...",
            "review_score": "-1"
        },
        {
            "review_text": "Great action rpg",
            "review_score": "1"
        },
        {
            "review_text": "Boring, linear, small number of skills to choose from. And skills are boring too.",
            "review_score": "-1"
        },
        {
            "review_text": "Got a mad lair Got a Genny going Tried to upgrade it game bricked  GG 10/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "Not too fun, feels very robotic",
            "review_score": "-1"
        },
        {
            "review_text": "It's not the game for me. Not even worth the $6 I paid for it, and the DLC. I don't understand why it has such a positive rating. Yes, the hours on record are correct. I only gave it half an hour's review.  Edit: I played the game for half an hour. That's all I needed to determine I didn't enjoy the game. The max you can play a game before asking for a refund is 2 hours, I believe. I didn't ask for a refund. I didn't ask for a refund because, as it's been pointed out, I didn't research the game before I purchased it. That was my mistake, and I paid for it ($6). But my use of this feature is not improper. Had I done research, I wouldn't have liked the game anyway. It wouldn't have changed that. And I would have told people 'I don't like this game'. Since I did buy the game, I have access to this feature, and I used it. There are no facts here, this is opinion. Whether or not a game is good, is subjective.",
            "review_score": "-1"
        },
        {
            "review_text": "  pretty good!",
            "review_score": "1"
        },
        {
            "review_text": "Font too small with Mac OS, i can't play this game because i cant read anything..",
            "review_score": "-1"
        },
        {
            "review_text": "Why do you have to write a review to recommend the game. I'm just thumbing it, so this review is not worth reading.",
            "review_score": "-1"
        },
        {
            "review_text": "So far the game is well worth the price. If you enjoy action rpg games and interesting monsters then give it a go. It is not quite as good as Torch light 2 but the graphics are comparable. The character ability/skill trees take some getting used to, yet work well.",
            "review_score": "1"
        },
        {
            "review_text": "Diablo-like game with a steampunk vibe and wry sense of humor. Very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "I'm really enjoying this game takes what i like from Diablo and Torchlight.. its REALLY difficult! but REALLY FUN!!!",
            "review_score": "1"
        },
        {
            "review_text": "Great game enjoy it.It s a lot like tourchlight :)",
            "review_score": "1"
        },
        {
            "review_text": "a great game similar to the torchlight games. reminded me much of warcraft before world of. on sale it is a easy buy but there is considerable choice out there in fantasy gaming. about 20 hrs of playing with the option of 3 classes and redoing the whole story at 30+ level (higher item drops and tougher monsters).",
            "review_score": "1"
        },
        {
            "review_text": "I'm posting this review after I've just finished the game in Normal mode.  Yeah, this is not a review for those Professional/Hardcore gamers who want difficulty at every step.  TL;DR Good Hack and Slash Game. 7/10 . But buy this game during sales. I bought it at $5.09. In my opinion anywhere below $10 is worth it. Above it, not so much.   Broader Explanation: I personally view these Hack and Slash kind of games as either of the two things:  a) A tool for some excellant story telling. or b) Stress relief where I'm simply entertained after playing this game.  The Incredible Adventures of Van Helsing is pretty good at both of these categories. Not a bad story line with decent continuity and fun enough game on the destroy-everything-in-sight front as well. A few points: Story line and Ambience is Good- 7/10 Re-Playability is lower than that of Torchlight II. Meaning its average- 5 /10 Item Complexity, enchanting, Visual effects of items- 6/10 Skill Points, Ability Points and general Magic/Ability in-game- 6/10 Graphics/Visual Ambience- 5/10 in some parts and 7/10 in some parts.  Satisfaction- 7/10  So I would put this game on a solid 7/10",
            "review_score": "1"
        },
        {
            "review_text": "The Incredible Adventures of Van Helsing are indeed incredible. Nothing short of amazing, especially from an underdog like this game was believed to be. An incredible ARPG with awesome scenery, a beautiful soundtrack and a most deserving sidekick to the protagonist.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoying Russian Roulette with five bullets in a chamber instead of one? then you will enjoy Adventure of Van Helsing series. This game developer is lazy ♥♥♥ who build a broken unplayable game (and yes I installed all your lazy to implement program inside your stupid lazy ♥♥♥ folder that called InstallUtils and none of these works, and yes I've changed VanHelsing_x64 to VanHelsing_x86, so don't give me that excueses)  Seriously I am fed and ♥♥♥♥♥♥ because not even once, yes... NOT EVEN ONCE I can play this stupid game (I tried to install and delete this stupid 19.2GB game that doesn't work for 5 times, and none of them even work), I am not asking for my money back, I am just asking for people who read this review to reconsider on buying software from this lazy ♥♥♥ developer. As for myself I am thanking the software developer for the hard lesson in my gaming experience, I won't ever again support any software from this developer even if it's FREE to INSTALL.",
            "review_score": "-1"
        },
        {
            "review_text": "It's basically Torchlight. Skill trees, HP and mana, a pet, color coded loot, etc.   Some highlights: Skills have powerups you can enable per use that are fueled by a third resource called rage. These do things like more damage, more targets, heal you on hit, and similar bonuses. You get rage when you kill monsters. It's a nice little system I wouldn't mind seeing elsewhere.  Easy respec on abilities and skills. This was great for me when I realized investing heavily in the first skill wasn't a good long term solution, and when I realized one of my passives wasn't needed anymore. You can also refund some of the starting skills if they aren't useful for you. You can't respec perks for some reason, so check a guide before investing. Some of the late-game ones are straight out better than the early ones.  Some meh-lights: The writing I found to be adequate. Nothing exceptional, but it didn't pain me.   The core combat started out kind of bleh. Slow, low damage attacks and limited mana. It picked up after a little while, but the start wasn't great. When I got the laser skill, it was just as fun as it was in Torchlight.  I started to get some loot fatigue near the end. There's a lot of items, and even with the summary tooltips it's sometimes hard to parse which item is really better.   One downer: A certain boss is one of the more frustrating bosses I've faced in a diablo-like. He has a charge attack that could one-hit me, and he would do it from offscreen so I had no chance to dodge. He also had homing missiles and infinite ranged attack mooks. I did not enjoy that fight at all.",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty fun game to play if you're a fan of action hack n' slash RPGs like Diablo. I really didn't know what to expect when first playing, but I was pleasantly surprised. Coming from playing too much Diablo 3, I was glad that the game had more customization to your character. You are free to add points to your attributes and skill points in a skill tree.  As far as the gameplay goes, it took a little bit for the game to take off for me. First, each class has a rage bar that goes up during combat. You use part of the rage bar to activate extra effects to your attacks, like stunning enemies for 2 seconds to your electric attack. You have a primary left and right-click attack, followed by 1-4 key press 'trick' abilities, like healing. You don't level really fast, so to start getting new skills took a bit of dedication to the game. Stick with it, and you will enjoy your adventure with your ghostly companion. As far as difficulty goes, the game was nearly impossible for me on the highest difficulty. I suggest playing on the next level below that if you want a challenge that's do-able.  I do like the that game has decent voice acting, since your characters will talk a lot during your adventure. When you fight monsters, you will generally be fighting a LOT at once, which really causes you to stay on your toes. It has the same feel as Diablo, fighting champion packs and elite monsters. And of course, the loot which ranges from basic non magically items to epic/set.",
            "review_score": "1"
        },
        {
            "review_text": "Didn't expect much for such a low priced game but surprisingly is quite well made and addictive. No ragrets! Not even a single letter.",
            "review_score": "1"
        },
        {
            "review_text": "Its an alright RPG, limited to Lv30. Items/drops are the same no matter what if you are on (just an increase drop rate on Heroic). Your ability to be over powered is based on everything (your skills+eguipment+essenses+perks) and not the Lv taged to the equipment, resistances mean nothing as far as I can tell. The story to me did not live up to the van Helsing image near the end, however, it was still a good play for 30hrs.  Overall, I would say 65/100.",
            "review_score": "1"
        },
        {
            "review_text": "It crashed after an hour into the game, so it must be good.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty solid ARPG, Steampunk feel to the interface and story line. It isn't anything groundbreaking. ARPG's are pretty much click on this, use this ability, use a potion, backpeddle when you get swarmed, and move on. There is a tower defence game mechanism for two 'zones/levels' of the story to break it up. Honestly I could have done without it but hey it wasn't that big of a deal. In the end it's a good game to log in and have some mindless ARPG fun.",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome Action RPG. Highly recommended. I feel it's better than vanilla Diablo 3",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing on the big picture mode",
            "review_score": "1"
        },
        {
            "review_text": "A very good game, with a steam punkish theme.",
            "review_score": "1"
        },
        {
            "review_text": "Its like an MMO, without the annoying MMO part. highly recommended and it holds up on its own even with its current ages.",
            "review_score": "1"
        },
        {
            "review_text": "The game, if it actually lets you play, is a run of the mill slasher game but as I said that's only if it lets you play... If you run it through Steam it crashes, if you run it through the game folder itself it'll run but you won't be able to use your DLC.  Waste of my money.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really nice game. I personally love arpgs, but more the fantasy atmosphere and the fact that you are a hero in a story. I don't care to finish a game more times to get better loot or to play it online.  And this game is really good with the single player campaign. The story is simplistic like in other similar games so kill the bad guy, save the world, but here the story is always present when you play. You got feedbacks from it consantly. In a lot of games of the genre the story is a background and you just grind without knowing what happens really. I liked as well how the side quests were offered. It is not necessary to complete them, but they are in correlation with the main storyline, so completing them you enrich the story itself. So it was very enjoyable playing it. Also the action is good. Not easy, sometimes frustrating, but it is really not enough to just click and tank. You need to use strategy anyway you die even in normal. Some enemies are strong but not fast, so you need to attack them from behind or from the side, or shoot them. The ranged enemies hit you hard, so you need to kill them first anyway you are dead. So using strategy is essential, and it is very good that you need to think a bit while clicking. The humour is a great factor in the game, it is nice that it doesn't take serious itself. A lot of people criticises the voice acting. I think it was also okay, the borgovian npc-s speak english with an eastern european accent, it is not bad as Borgovia is a fictional eastern european state. I recently rewatched the movie, and Kate Beckinsale who is actually english, acted with a horrible eastern european accent, because she was a transilvanian (actually a romanian or hungarian) princess.  So I really enjoyed the hours with the game, but there were some frustrating factors as well. It is a good thing that if you kill a pack of enemy it doesn't reborn in the stage, so if you killed everyone you can search for hidden things. It is great, I don't like continous grinding, maybe this is the most boring thing in an arpg, but if you exit the game and restart, the system remembers until where you arrived so you don' need to reexplore the place, but the enemies reborn. As the fighting is really intense and hardcore, it is really frustrating to arrive to the place where you finished earlier as the groups are more difficult to finish than in other arpg games. So if you have just half an hours to play it is really not your game. It will be very frustrating for you, as the stages are huge. It is better if you can dedicate some hours to play for it.  There were some minor bugs in the grapichs sometimes, but it was not so disturbing.  And for concluding you play with Van Helsing. It's cool as hell :)   Recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:   Large environments.   Nice skill effects.   Large amount of customizability.   Decent humor.   Champion monsters are a fun fight.  Cons:   Maps get very samey after you enter the city.   Very few quests, however each one is long.   Unnecessary, unfailable, and poorly made TD minigame required for story progression.   Very little change in monsters, mostly just 'Monster Veteran' once you reach later parts of the game.   No real way to play using both sword and gun, you pick one and have to deal with it for the rest of the game.   Fame ranking stops at level 10. Really? You put more champion monsters in the game than you can actually rank up with?   Final boss fight and ending lackluster. It's literally just kiting around the arena for like 10-15 minutes.  Overall, it's a fun game to bust a week over, but don't expect it to be a mind-blowing experience.",
            "review_score": "1"
        },
        {
            "review_text": "Never had any real inclination to play or buy this game. Got it in a humble bundle, gave it a try and I loved it!",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of Diablo 2 you will love this great voice acting tons of lore and a deep story deep skill tree's and stat system for both you and Lady Kat tons of loot to be found tons and tons of free updates with new content and two more games planned.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting mechanics, impressive voice work, but in the end, the game's instability will be your greatest foe, and it will likely always win.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥t and ridiculous. Tons of same monters, sometimes with changed size and color. Gameplay is boring. Only quests is different, but that is obviously not enougth.",
            "review_score": "-1"
        },
        {
            "review_text": "TIAVH isn't a horrible game, but it's not quite up to par. If you picked this up in a bundle or on a deep discount, it'd be worth spending some time with, but otherwise, I wouldn't drop my money into this game.  The environment's graphics are decent, but the UI is horrible, with very little explanation in the beginning of the features of the UI. While the basics of the UI are easy enough to determine, much of it is not intuitive at all. There is a tutorial popup system, which attempts to help you out, but it seems to only point out those parts which are intuitive.  The gameplay isn't bad at all, but unfortunately the targetting system is horrible here. you can almost not aim for specific mobs unless they are on their own. At least the game highlights the target that you are aiming for, but unfortunately line-of-sight issues mean you're often shooting an object or another enemy that's in the line of fire instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Very Nice action RPG with online multiplayer, it really delivers a good take on the diablo-esque formula. Crashed a lot though.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a big RPG fan,but this game is great. I've played it for like 6 hours to this moment,but I think I'll play it much more! The story is meh,but the loot...the music! My God it's great...",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Difficult but doable if you follow along and do what it tells you.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with some nice graphics and a good story. Fairly short and definitely a tough game to play. Be prepared to die alot when you play normal or higher. Lots of secret places, objects and achievements here as well. Challenging game and a tough, fun and rewarding final battle. The voice asting in this game was very well done with several humorous moments. A change of style from Diablo and the great many clones that are out there. Excellent fun at an excellent price.",
            "review_score": "1"
        },
        {
            "review_text": "Well made and very addicting.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little ARPG, quite challenging at times. Plenty of easter eggs and pop culture references.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "I was enjoying this game... until like many other people have stated/moaned/♥♥♥♥♥ed/cried/shouted... IT BROKE :(  A sad state of affairs yet again, how the developers/designer missed such glaring bugs I don't know. I read the forums and looked at the many fixes, tried and failed but cannot seem to resolve the issues, so sadly hours wasted yet again.  I liked to recommend this game because for a diablo clone it was fun (pick up and play) But unlike RONSEAL - It didn't do what is said on the tin",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fun diablike that has some fairly interesting skills and ability combos that keep the game interesting the whole play through while leaving you still wanting to try another character or two before putting it back on the shelf. The most appealing thing about this game is certainly the humor and the atmosphere. Even during my second play through I was still laughing at the same comments, particuraly those of the sexy spectre Katarina. Music is also amazing. Would rate this game as a wooden block out of six. Would certainly play. Overall Rating: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "solid game would recommend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a shame. It starts quite well, but as soon as you are progressing through the game, the flaws appear very clearly.  The maps are very small and therefore, instead of creating more areas, the devs have favored the overfilling of the few maps with thousands of monsters. Yes that's true it's a H&amp;S, but in this game the maps are literally overcrowded by unimaginative packs of monsters.  Second disappointment is when your realize that the game mechanics are botched up : adding strength also add life (good for melee fighters). If you choose to play as ranged characters, you'll have to split your stats between dexterity (ranged) and strength (for not being insta-killed by the endless swarms mentioned above), and therefore preventing your ranged character to dispatch efficiently the monsters (who are packed tight).  Therefore the game is heavily favored and unbalanced at best. Combat versus the final boss is also a freaking pain to play : you have to run around in circles for literally 20 minutes (check the videos on youtube), praying that the boss and the sarm of werewolves-on-steroids will not one-shot you, as you can't save during this combat.  Avoid this game by all cost, this deceiving game is not worth your trouble.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is bugged enough to annoy you while playing, but at least you want to play it. Unfortunately, I've run in to so much nonsense that I can't really stand to play it sometimes.   1. Using a controller, for some reason here and there it just can't seem to get to certain slots on the inventory. Of course they had to be annoying and make it a stupid circle. They couldn't be bothered to make it up and down. This gets really frustrating when your inventory is full or you get a good item and you want to equip it... might as well forget it.   2. Randomly my attacks don't work, they stop firing projectiles or making the animation and I have to either teleport to town or restart the game.   3. Sometimes can't connect, and sometimes horrendus lag. I look at how many people are playing and theres roughly 400 per day... and I imagine some of those aren't even online.   4. They've updated this game many times but never fixed these issues, and if you play you know they exist. So either the developers don't play or they don't care about their game.   Don't bother playing this one, you aren't missing anything.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun take on a classic type of game featured in the popular Blizzard game Diablo. In the Incredible Adventures of Van Helsing you take control of a descendant of Van Helsing family as a monster hunter, in this game a mad scientist has begun making monsters so you must fight your way through tons of levels and tons of monsters each with unique abilities and features. I love Diablo and this game genre but I prefer this game more now because I really like the Steampunk esq. Gothic feel on it.",
            "review_score": "1"
        },
        {
            "review_text": "Too bad the interface sucks. I would have loved this game if it was easier too navigate trough missions and surroundings.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fully serviceable isometric action RPG. All told, it doesn't really bring anything new or exciting to the genre, and there are plenty other (and free) games out there that will scratch the isometric ARPG itch if that's your interest. The reason to get this game is the atmosphere, which is does really well. But the mediocre voice acting and story aren't goin to assist anyone in feeling sucked into the game. This is a do not recommend unless you're a huge RPG fan looking of something new, or you're a big fan of the traditional monster scene. ",
            "review_score": "-1"
        },
        {
            "review_text": "A fun quick romp, storyline was ok but the gameplay more than made up for it.",
            "review_score": "1"
        },
        {
            "review_text": "A must for any action RPG fan 5 star rating for this indie tilte",
            "review_score": "1"
        },
        {
            "review_text": "The game is enjoyable unless you want to play multiplayer. Once you setup a hosted game it gives you a red cloud in the bottom lefthand corner and there is nothing out on the net on what causes that. Then if you have a friend host it give you the message pinging with nothing happening or it does not come up in the list of games. If you try to send an in game invite it gives you the pininging message. If you want to play multiplayer I would hold off on buying this game as it needs major patching.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very similar to lawn mowing: mindless grind through the grass, stopping to empty the basket (respawn, and I mean every few minutes, the grass is pretty frickin' tall) and occassional backtracking looking for missed spots. And all this because your dad told you to (plot similarities). Not really a fan of lawn mowing.",
            "review_score": "-1"
        },
        {
            "review_text": "I LOVE THIS GAME  ",
            "review_score": "1"
        },
        {
            "review_text": "It's a good action top down RPG. However, it's hard game.  Pro: Graphics is good even zooming in, the text details is there. Awesome voice acting. Nice storyline.  Cons: Some quests are buggy especially online. The game felt slow paced. Better get trilogy if you want to finish the storyline. Cliffhanging ending.",
            "review_score": "1"
        },
        {
            "review_text": "Meh not a bad game. Too bad there isnt anyone online anymore solo gets boring fast.",
            "review_score": "1"
        },
        {
            "review_text": "A nice,old-school hack and slash with nice graphics,amusing gameplay,great soundtrack,hundreds of thousands of enemies willing to kill you,tons of heavy items to carry by the protagonist and a great,ghostly companion Lady Katarina,who will charm you. 8/10 A solid aRPG.",
            "review_score": "1"
        },
        {
            "review_text": "I got the adventures of van helsing for christmas day. I own all of them and i havent stopped playing them yet i realy enjoy playing .",
            "review_score": "1"
        },
        {
            "review_text": "It's quite fun. However, the punchline is a little bit unfunny some of the time to me.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty solid hack and slash title. Nothing really new with the exception of really great pet abilities. Beautiful atmosphere with an interesting setting. A must have for any fan of Vampire Hunters and Victorian inspired Steampunk culture.",
            "review_score": "1"
        },
        {
            "review_text": "i sctually love this game. deeper than i expected, cleverer than i expected, engrossing, satisfying click-happy combat, all the loot-payoff such games require, beautiful lighting effects, odd conversations, open maps, really just a joy to play and replay. have at it!",
            "review_score": "1"
        },
        {
            "review_text": "I have played PoE Beta, Torchlight 1 &amp; 2, Diablo 1, 2 and 3. This game beats them all except for maybe Diablo 2 with Expansion during its heyday.   Van Helsing is fun and unique with witty dialogue and snappy writing. You actually get rewarded for exploring your entire map. The loot is fun (no AH). You can play offline if it's just single player. You can also play online (public or steam friends only) with up to 4 people in co-op (password or sans). Your companion picks up stuff like potions, crafting mats and different levels of unique or common gear depending on how you set her. She can also be sent to town to sell, as well as buy a specifically designated number of potions; She's sassy too. You have enchanting as well as alchemy for upgrading your gear. You make decisions in dialogue even that impact your gameplay more true to table-top role playing games! Yes, The Incredible Adventures of Van Helsing is addictive and yes, the story is fun.   I would recommend this game to anyone who enjoys top-down action rpgs. The Incredible Adventures of Van Helsing is what Diablo 3 should have been.  [ Also, I just go the DLC tonight and I am enjoying my Arcane Mechanic, which can be played with pets. I have yet to try the Thaumargist (sp?), which appears to be a steampunk version of a mage. I do like the steampunkish feel of hte game. The artwork is quite good. ]",
            "review_score": "1"
        },
        {
            "review_text": "ARPG with good graphics, interesting combat and GUNZ",
            "review_score": "1"
        },
        {
            "review_text": "What can I say. Everything that looks, sounds and feels like Diablo. Isn't Diablo. Same here. For me it's a no.",
            "review_score": "-1"
        },
        {
            "review_text": "This is another great game along side of Path of Exile that was a better hack and slash then D3.",
            "review_score": "1"
        },
        {
            "review_text": "Pleasantly surprised by this one. Neat little ARPG with some replay value. Voice acting and story was decent with a few cringey actors here and there. Unfortunately, the skills system makes it pretty much impossible to have more than 4 active combat sklils at once, and 2 auras with no way to switch them unless you want to spend thousands of gold reseting your skill points. While gold is plentiful at the end of the game, it still seems like a poor design choice.   I also felt the level limit and skill points available to be very low. I understand this was for balance reasons, but you really don't feel truly powerful at max level, and your skill options are limited due to the UI and skill tree designs.   Overall, still enjoyable and well worth the $6 sale price I paid for the complete pack.",
            "review_score": "1"
        },
        {
            "review_text": "Definitely recommend this game. Especially if you enjoy Diablo style games.The scripting is cool. Sometimes funny, sometimes creepy. Gameplay is straightforward and you'll be racking up Exp. in no time. There is quite a wide variety of equipment to collect from battles as well. Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "It's a Diablo clone, but I can gib a werewolf with a pistol as the son of Van Helsing.. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "there is only one way to describe this game. mom's spaghetti. 10/10. play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Action RPG, sort of in the vein of Diablo and Torchlight. Don't get this thinking it's just like those games though. There are a lot of differences, such as a much different skill system that might take you a while to get the hang of. I bought the normal game and all the DLC, so obviously I enjoyed the game a lot. Basically it's just a complicated, unique ARPG in a giant sea of more casual ARPGs. Definitely give it a shot though, since it's relatively cheap for how expansive it is. Also, they're making the sequel and it should be out later this year.",
            "review_score": "1"
        },
        {
            "review_text": "BUGGED and SLUGGISH. Very visual game, stunning imagery. But has a few game breaking bugs. I hope some of them may be addressed in the future",
            "review_score": "1"
        },
        {
            "review_text": "Not a great game overall, but it is worth the price (with discount). It is good enough to entertain you for a few hours/days, especially if you like games like Diablo.",
            "review_score": "1"
        },
        {
            "review_text": "The game is like DIablo and Torchlight and is a baby of them in one. So far it is a game to keep me busy while I watch movies and youtube. Good enough for me and currently cheap and on sale. Abou $7 for the complete pack and that is a meal skipped.   ",
            "review_score": "1"
        },
        {
            "review_text": "You know what'd be great? If I could play the game. That's an aspect you need, right? To be able to play the game? Not just sit at a 'System Requirements being measured' screen for god knows how long, only to figure out you've been waiting for over 4 hours for it to load. Point is, it doesn't work. I've tried it on not one, but two different computers. BOTH with the requirements to play it, and it just crashes at the first screen. I've asked for help on forums, and no one has a decent mindset to give me feedback. So I'm gonna come out and say if the community sucks so bad they can't give a nice response, I can't imagine how it must be in-game. So, if anyone has a nice helpful response, I'm open for it.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "This Van Helsing game is great...if you look pass the bugs, that areas lag when you start them up because there're so many monsters in there (lag reduces as you kill them off), wierd glitches with your character (lag based once again), that certain quests doesn't work and you sometimes can't progress forwards and needs to type something in console 'cos the developers released a half-♥♥♥♥♥ game.  Ok I might be a tad too harsh, 'cos really, they're fixing alot of bugs every second week or so, but it really reduced my positive experince to more of a 'meh'. I played this game 'cos I didn't want to play Diablo III, and to be fair it can be alot of fun (massive amounts of monsters, overwhelming sometimes actually, that you have to shoot/cut your way through, VERY satisfying, nice enviroments etc), but all the bugs, the lag, and lack of optimisation really gets to ya after a while.  So final verdict: If you want to slay a billion monsters whilst also being tactical about it (or you get swarmed!), this is the game for you. If you want the game to run super smooth whilst doing it...nah, prepare to adapt. To me this game is a 5.5/10. Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "this game is so awesome!",
            "review_score": "1"
        },
        {
            "review_text": "If you're running a 64 bit operating system, this game has some serious bugs which as yet have not been fixed. Otherwise the game is actually a very decent ARPG.",
            "review_score": "1"
        },
        {
            "review_text": "So here is the deal... this is a 9 out of 10 game that currently only gets a 7 out of 10 on the Mac due to an abundance of memory leak crashing bugs that make the game rather frustrating at times, especially around Gallowsbog and the Abandonded Research Station areas. Luckily the game autosaves very regularly and I have not had to repeat alot of sections after each crash as in other games. This means if you grin and bear it you can get thru the troubled sections fo the game and then it seems to stabalize and play very well. Truth is, it is a very fun game and at least for me was worth the effort to get thru the bugs. While I hated Diablo 3, this game built on their game engine is a blast filled with steampunky goodness and very much worth a play... and get the DLC, the Arcane Mechanic is exceptionally cool.",
            "review_score": "1"
        },
        {
            "review_text": "its a superbly fun and addictive game",
            "review_score": "1"
        },
        {
            "review_text": "Never managed get this work properly.. Basically, multiplayer never worked for me and not a single dlc what i purchased appeared in game. Of course contacted support and answer was shortly something like this 'it´s steam, contact there..' and i did. Steam support says contact the game support.. i contacted uninstall button. But pretty game, and good story. Shame it didn´t work for me.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is awesome it similar to diablo 2 or 3 and you got a sidekick name katarina she can do melee and range attack even the DLC pack are very useful like thaumaturge (spellpower elemental) , arcane mechanic ( robotic and 20th century guns) and for sidekick power is blueblood skills better then the general skills so i recommend u to buy this game",
            "review_score": "1"
        },
        {
            "review_text": "Tons of great play time for a really good price, and I totally love all humoristic references to games and movies :D Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Best ARPG I have played in a while, besides the Torchlight series and Dungeon Siege. Recommend to any fans of ARPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly enjoyable. Consider it an early Victorian era (with magic) Diablo 2 (not D3) mashup, and you're not far wrong. I have no idea about longevity, but so far it's just great fun.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and decent looking steampunky ARPG set in an Eastern European country of Borgovia - think Transylvania/Romania with various beasties from Slavic/Balkans folklore. Curiously for Van Helsing and the location - there are almost no vampires.  There are some interesting innovations (lair defence instances, configurable powerups for attacks...) and the DLC actually improves and enriches the gameplay.  Blue Blood  DLC is a must for ranged/glass cannon Van Helsings as it allows two more melee Katarinas (three in total) for tanking the neverending mobs.  The story and the voice acting are mostly awful but that does not diminish the overall enjoyment in the 16-20 hrs. long campaign. A good first effort from the Hungarian developer.  7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Good stuff, for you hack &amp; slash needs!  On par with torchlight II quality wise.",
            "review_score": "1"
        },
        {
            "review_text": "For an indie title this neat little ARPG is pretty decent. Has everything expected from this genre: Lots of treasure, tons of monsters to dispatch of and plenty of perks and such and they are useful not like *kaff kaff* diablo. Great game. Even better if you manage to pick it up on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, ♥♥♥♥ing love it",
            "review_score": "1"
        },
        {
            "review_text": "This game is like Diablo 2 and Torchlight made a baby and it aged pretty fast to a mature adult. A lot of bugs were cleared since the beta days and its definetly worth every cent. :)",
            "review_score": "1"
        },
        {
            "review_text": "For fans of Diablo 2 or Torchlight, this is a great game with a lot of content for it's size. It does feel short when compared to those others, but still worth playing. ",
            "review_score": "1"
        },
        {
            "review_text": "The game is nice but it becomes nonsense once the normal story mode is finished. It is not balanced when playing the higher difficulty modes. It is not like, say, Dungeon Siege 2 because it does not add anything new for the higher difficulty settings. It is extremely and ridiculously difficult which makes it impossible to enjoy it anymore. Considering the low price of the game, I think the developers did not want to put too much effort on that account and this game has pretty much come up as a game which is fun for only once. So I believe they messed up this game because it had great potential. I hope the second will be a lot better than this. Finding a nice game like this and not being able to get the most out of it is very disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "I had a blast with this game. I'm a huge RPG nut, and while I've usually stayed away from the hack n' slash subgenre, the story, acting, writing, action, and strategy were too much for me to resist. I gladly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, storyline is awesome. Graphics are good, and hours of fun. I would recommend this game to anyone.  Well worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful and brilliant action RPG! This game is in the same league as Diablo 3 or Torchlight 2. It oozes thoughtful design, gorgeous visuals, and addictive RPG elements! Packed with depth, this huge ARPG will keep you occupied for quite awhile, and it has amazing production values for not being a AAA release. All ARPG fans, grab this game NOW and do not miss out on this packed ARPG!",
            "review_score": "1"
        },
        {
            "review_text": "When I first fired this up I was all 'Meh...another shamelessly derivitive Diablo clone. Let's see how long it takes to bore me to tears.' The next thing I knew it was way past midnight. Pure hack n slash satisfaction, with a healthy dose of funny references and jokes to satisfy your inner geek. Doesn't overstay it's welcome like so many ARPGs - just the right length. Looking forward to the rest of the trilogy.",
            "review_score": "1"
        },
        {
            "review_text": "So far it's capped at lvl 30 and when you finish the end boss thats kinda it... well you can play again on hard or try your hand at multiplayer or some challenge maps but it has a definite sense of completion about it. Not that this is an altogether bad thing when compared to Diablo (which knows nothing of completion).   I think the best part of this game is the pants... thats right I said PANTS! Well pants... and weapons sorting. The game gives you a clear indication of what items are better than what you are carrying by highlighting in green or red (+ or -), what the new weapon will do if you equip it. Even in damage per second!!! This made pant sorting so much easier. Oh and they have borrowed the Torchlight pet ability in that you can send your ghostly companion back to town with loot to sell and she'll bring back potions (very handy if you want to push through the levels).  Can't wait for an expansion. If you like your Diablo vampiry and your pants neatly folded in your draw, GET THIS GAME!",
            "review_score": "1"
        },
        {
            "review_text": "Would be a great game if it didn't crash every 10 seconds. It's kind of hit and miss whether you'll get to play it at all.",
            "review_score": "-1"
        },
        {
            "review_text": "Weapons, explosions, werewolves, bowler hats- what is not to like?",
            "review_score": "1"
        },
        {
            "review_text": "If you played any of the TORCHLIGHT GAMES this game will come very easy to you. A LOT of the same game mechanics exist is both games. I wont pay full price for this game, but i would pay for it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, at the beginning hard to get a grip on, but after few hours it's nice and easy to play. Good alternative to the new Diablo.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game, but too short.",
            "review_score": "1"
        },
        {
            "review_text": "I never noticed this game until it hit on a sale, and glad I grabbed it. Great game, but I will say there doesn't seem to be much incentive to play after beating it.",
            "review_score": "1"
        },
        {
            "review_text": "This game caught me off guard. I was expecting a mediocre and poorly made game for the price. Instead, I got a very solid, well made game, that is every bit as fun as past ARPGs such as TItan quest and D2. Its story and voice acting are quite a bit better than D3, and the world is much more interesting. The systems in the game are pretty deep, and the skill system takes a bit of learning, but over all, the game is a lot of fun. If you can grab this game on sale, and you enjoy ARPGs, you wont regret it. The only downside is the 20+ gig install. (make sure to get the complete pack if you buy it, otherwise you will end up paying a lot more for each DLC later)",
            "review_score": "1"
        },
        {
            "review_text": "If you don't own this game you are letting the terrorists win. This game is easily one of the best games to come out since Diablo 2. 10 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Very good ARPG for a very good price.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, at least for the singleplayer part havn't tried multiplayer yet.  Also the game kinda reminded me of Diablo 2",
            "review_score": "1"
        },
        {
            "review_text": "Nice Story, lots of 'easter eggs'  good gameplay, and an interesting approach to developing your character.  ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game so far! It reminds me of Diablo on steroids, meets Torchlight!",
            "review_score": "1"
        },
        {
            "review_text": "Funny, charming and well designed!",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "The game has been amazing. I have been engrossed as I have travelled from place to place helping the locals deal with the monster infestation. The skill system is both diverse and expansive enough to ensure that I have enough scope to create a unique character.  I look forward to more adventures being created so that I can continue my journey.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and fairly accessible game, this is really very well made considering its price. The combat is quite fast and punchy and you get into the systems of the game surpisingly fast. In the long run the fairly limited skill trees may be a problem - the included character has one for melee and one for ranged, and the other characters are DLC and only have one tree each - but for a casual rampage this is very good indeed.",
            "review_score": "1"
        },
        {
            "review_text": "I bought Van Helsing on launch day. Let that settle in. I absolutely wanted to believe this would finally bring all the lore of Van Helsing to the principles of a great action game and it hit the nail on the head. Yes, there were teething problems on Day 1, coop was broken and it was clear that if you wanted to join someone else's game you had to be prepared to either move forward or backwards in your own solo campaign, however the action, the fantastic campaign, and the fabulous NPC companion was just what I was looking for as an alternative to Diablo 3. I say alternative as I love Diablo 1 &amp; 2 and lambasted the notion of the third on the basis of the auction house and the draconian DRM out of, what I can only assume, was Blizzard's ♥♥♥♥♥♥♥ised view of the PC platform and their need to feed the greed train. If you want the fantastic action of Torchlight 2, with the grinding of Diablo with the wonderful dialogue of Dragon age do yourself a favour and get this game. It is WELL worth the money.  EDIT: Now with the edition of controller support this will look and play fantastic on NVidia Shield.",
            "review_score": "1"
        },
        {
            "review_text": "I played through this game and it was pretty fun overall. Pretty good looting, the tower defense portion leaves something to be desired but overall, with funny dialogue and addicting monster slaying, this makes for a decent playthrough",
            "review_score": "1"
        },
        {
            "review_text": "The game have a great potential and it is very atmospheric. Unfortunatelly it is also quite buggy and have balancing issues. It seems the devs are just ignoring some of the old bugs and they also have a questionable DLC sale policies so make sure you buy the whole package while it is on sale (or wait for the sale). Overally the game is enjoyable and worth getting while on sale.",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly fun way of wasting 15 hours.",
            "review_score": "1"
        },
        {
            "review_text": "(probably not even half done, but here's my thoughts so far)  The good: - Really good graphics. - Good voiceacting. - Neat storyline. - Improves upon T2's scroll system. - Powerup system is pretty cool. - Skill point system is kinda cool. - Quick stat comparison between items(something T2 didn't have).  The bad: - Obnoxious loading times for certain areas. - Mildly annoying control scheme. - Lady Katarina can be stupid as hell sometimes. - Levelups are too frequent - you'll be assigning points every 5 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "Starts off decently. The way it pigeonholes you into choosing ways to play ensures lots of playthroughs to experiment with different playstyles. But, due to limited level advancement, you can never overpower the enemies you play against. In fact once you hit the cap, it becomes a strategy game more than an action game, due to the limited resources to distribute. Get it wrong and you'll just die a lot.  This game has an excellent foundation, but totally whiffs on the foundation of the diablo genre. It's fun to become crazy awesome over time. If you make a game where I have limited resources and can never overpower the enemies, then it becomes a strategy game with diablo playstyle. And since it's basically a strategy game, you have to have creative enemies and encounters. It doesn't. It has repetitive waves of monsters that you fight through. So in that essence it's a bad strategy game.  In short, you'll have a fun time starting out. As the game progresses though, it turns into a horrible strategy game. I give it 8/10 to start, and finishes around 4/10. I'll average that out for overall score.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is super fun although you apparently need a decent video card to play it even though it look like Diablo 3.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. I don't have lot of hours just yet, but have gotten far enough to play the 'Tower Defense' portion which I find is pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "now that this game has controller support, just ♥♥♥♥ING BUY IT!!!! AMAZING!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun multiplayer. Good for a team of four.",
            "review_score": "1"
        },
        {
            "review_text": "A fun, engaging game in the Style of Diablo/Torchlight, doesn't take itself seriously at all but has surprising depth and complexity.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty decent game that resembles Diablo or Torchlight. If you like action RPGs you should enjoy this game as well. I found it nice that you're accompanied by a ghost who not only helps you smite your foes but makes all the trips for you to sell your junk (much like Torchlight).",
            "review_score": "1"
        },
        {
            "review_text": "A good game, better than Diablo 3 in my opinion, but unfortunately extremely buggy. At least the development team is extremely fast in providing the patches fix.",
            "review_score": "1"
        },
        {
            "review_text": "Hate to sound like everyone else, but it's definitely comparable to a Diablo game. Has a lot of the same feel, but a different kinda change of pace. One of those games I'd suggest getting when it's under $10USD.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game love it",
            "review_score": "1"
        },
        {
            "review_text": "This was a Steam Sale impulse buy. Given the extreme load times, the excessive HD footprint, the shortness of the single player campaign, unnecessary pop culture references and the inexcusable game-breaking bugs for anyone choosing to use an x-box controller over a mouse -- I expected disappointment. But in the end, the satisfaction I got from using a flamethrower to eradicate wave after wave of spiders and not-zerglings made it a worthwhile purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Van Helsing came out of nowhere, and surprised me positively to an extend. It focusses on the character, they story, the atmosphere but never forgets how to motivate the player with constant level-ups, lots of items. The DLCs added new classes and some replayability, however that's still the point where the game lacks most. Get this if you want a good solo experience and no forced online play like in Diablo 3 or PoE.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Diablo 3 style game, its fairly short, its install size is massive, but over all a pretty solid game",
            "review_score": "1"
        },
        {
            "review_text": "Actiony RPG fun in a bun!",
            "review_score": "1"
        },
        {
            "review_text": "Game runs unacceptably poorly on the mac client (on a machine that is more than up to the task).",
            "review_score": "-1"
        },
        {
            "review_text": "Its as if they took Torchlights good points.. Diablo's good points.. and added their own flavor to it.. graphics are solid and the story and game play are about as good as it gets. coop works flawlessly",
            "review_score": "1"
        },
        {
            "review_text": "It's a very good game, with nice graphics. Not properly optimized though^^  There's one thing which bothers me: there are no actual 'hits' in this game. Models will just fire stuff and move their swords in the air, and the HP will decrease magically. As a result, I usually get bored of this after an hour. I'm downloading Diablo3 again just to kill bunch of monsters with a Barbarian, that 'no hit' thing disappointed me so much I need to get that feeling again. SMASH SMASH PUNCH BOOM :P",
            "review_score": "1"
        },
        {
            "review_text": "Might be the best indie-esque game I've played in recent memory, maybe ever. Exceptional art direction, graphics engine, OST, and gameplay. Deep and rewarding skill system, and it doesn't feel like a ♥♥♥♥ing chore to level your character unlike some *other* games that shall go nameless.  THROW $15 AT YOUR COMPUTER ALREADY.",
            "review_score": "1"
        },
        {
            "review_text": "Worth your money. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "Running around dropping turrets and robospiders that auto aggro packs you werent ready for. Katoonking nades and burning everything with fire. Chatty euro vamp tanker minion with 3 sisters. Testy and chesty. Who you gonna call? Fakk Diablo.",
            "review_score": "1"
        },
        {
            "review_text": "Its like diablo, but not nearly as good. It is steampunk, if thats a feature for you, this game is still ♥♥♥♥. It runs poorly, looks bad, isnt even a good copy of an older game. I beat this game, and I am glad I didnt spend more than a few dollars on this through a humble bundle. If you want a good diablo clone. Play POE. 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "At first i hated this game, because im more of a console gamer than PC. But when i got the hang of it it was pretty great definetely worth buying!",
            "review_score": "1"
        },
        {
            "review_text": "HOLY ♥♥♥♥ AND BALLS this game is fun as hell. The characters feel unique compared to other Diablo-likes and the setting is so original that it actually got out of the fantasy cliches. danouttadan will play again",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. you can do nothing wrong here in buying it, if you like Hack'n'Slash'Loot with a basic yet well-made skill-system. it's like playing a dark steampunk comic with a good portion of humor. characters and their audio parts are very good imo. it offers some endgame content (replayable [farmable] maps) and you can import your characters to the sequel.  ",
            "review_score": "1"
        },
        {
            "review_text": "The Incredible Adventures of Van Helsing has a great atmosphere. If you like horror and steampunk this is definitely for you! It is a top of the line ARPG, with a well-placed dark musical score. If you pass this game up you are cheating yourself out of a great experience. Fans of Diablo, and Castlevania will especially love this game.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun to play...",
            "review_score": "1"
        },
        {
            "review_text": "I do not believe I have had this much fun playing a video game since Super Mario Brothers. Seriously. Don't watch any trailers, don't read any reviews (after this one), just buy the game.",
            "review_score": "1"
        },
        {
            "review_text": "pretty cool game, i would reccoment for anyone that enjoy's the diablo or torchlight series.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome hack and slash game where you get to play the son of the great Dr. Abraham Van Helsing to stop the plans of a mad scientist! A good buy if you enjoy games like the Diablo or Torchlight.",
            "review_score": "1"
        },
        {
            "review_text": "Played the game on hard mode. The previous reviews pretty much summarized the good sides of this game: - Well designed world. - Some really nice background music (definitely getting game OST if there is one).  - Attractive graphics. - Highly customizable settings (could play this game on my laptop). - Some interesting references to pop culture (really liked Baggins dude!). - Good voice acting. - Decent storyline.  But all in all I would advise you to avoid this game. Here is why: - If you do not buy DLCs then there is only one character class you can 'choose' from. The character can do both melee and range attacks, however, due to horrible difficulty balance I had to specialize only on one attack type. The result is there is not a lot of variation in the action.  - Except very rare short conversations, the sidekick ghost lady is useless. She dies really fast and eats up all the health potions. I have ended up keeping her in a ghost form all the time. The result is the game would not change much if she was removed completely. - The game gives you impression of customization, but it actuallly punishes you for doint it. After mid point of the game, customization becomes really expensive and you can end up spending all the gold and still not getting what you want. - The essense system (aka gems and gem slots) is useless. Items where you can put gems are rare. If one is found then usually it does not have enough essense capacity to put useful essense. You can use an essense to increase the capacity but during my 27 hours of gameplay I had collected only 3 capacity increasing essense. Finally, there is not a lot of variation in essense types. I had collected only 20 or so different essense types during the entire game! - The fighting becomes really repetitive quite fast. There are many enemies that look different, but really just a skin deep difference. All off them can be categorized into melee enemies that charge in mass, melee enemies with hooks and ranged enemies. There is no interesting behavior from AI. More challenging enemies have simply 1) more HP and higher defense points, 2) just attack in bigger numbers, or 3) have more HP and defense and attack in higher numbers. It is not possible to use interesting tactics. Most of my gameplay consisted of repeating two things: have a short skirmish and then running away to use potion before having another short skirmish. Bullet spongy enemies just killed all the fun for me in this game. Most annoying are the enemies with hooks. It is not possible to predict or avoid hooks using your skills. The hook animation is instantaneous. The problem is, at least on higher difficulty, if you get hooked then you are basically dead. - Horrible camera angles. It is not possible to control the camera. Did I tell you about enemies with hooks? Well many times I was hooked by enemies I could not even see. I am not even talking about number of times I was shot at by enemies outside of the screen. - Bad character controls. There is no keyboard-based movement control. Mouse is used to click on a place where you want to move your character. Sounds good enough right? Well not. Combined with horrible camera angles and enemies swarming everywhere you will end up in many situation where you cannot find a free space to click on and move your character. I ended up more than dozen times dead because my character refused to move. The complexity of the surrounding world makes the situation even worse because it is not immediately obvious where you can and cannot click.  If you are looking for a good ARPG then go for Path of Exile. PoE is superior to this game in everyway. Plus, PoE is free, and there is no DLC nonsense.",
            "review_score": "-1"
        },
        {
            "review_text": "Brilliant game, really addictive. Already completed this once and had to start with the next character! Only draw back for me is that the games a tad short but they make up for that with non stop action. Would highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "great game and the new dlc is awesome",
            "review_score": "1"
        },
        {
            "review_text": "It's a nice game. Has a few bugs (crashes after loading sequences) but overall it's cool! :)  Definitely gonna play the next ones.",
            "review_score": "1"
        },
        {
            "review_text": "All I got to say is if you like killing hordes of monsters with awesome and fun abilities then this game is for you! My personal Favorite was the Hunter as in Monster Hunter right? how I feel it should be played because thats what Van Helsing is.",
            "review_score": "1"
        },
        {
            "review_text": "Even on casual, the enemies are too OP, have to run in circles and pop healing spells and potions to stay alive, while trying to hit-n-run all the time, and that is just after the first town. If it is that hard the through the hole game, then it isn't worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game. It has a very setting being in the Van Helsing Universe. As well as great production value. But the core mechanics of the game are very lacking.   Every time I engage in combat the frame rate drops rather considerably despite what setting it is on.   Also the combat lacks a tactile feel to it making it feel rather shallow instead of engaging.   The menues are not as well developed or organize then they need to be.   And I find the map and quest design to be somewhat generic.    I don't find this game very enjoyable because of these faults. Maybe the sequal recify these problems that I have but this version dissapointed me. :(",
            "review_score": "-1"
        },
        {
            "review_text": "This is a fun Diablo-style top-down game. You play as the monster hunter Van Helsing and go around slaying monsters and collecting gear. Highly recommended, fun story too.",
            "review_score": "1"
        },
        {
            "review_text": "I beat this game in just over 30 hours. It was great fun, if you don't mind click and slash games. Personally, I love most fantasy based RPGs, so this one was right up my alley.",
            "review_score": "1"
        },
        {
            "review_text": "Such a good game, this is what action RPG is all about. Shame on you D3. Kappa",
            "review_score": "1"
        },
        {
            "review_text": "It's Van Helsing. In a Diablo-Torchlight-esque kind of game. What more could you ask?  Did i mention it has multiplayer too? :D :D :D :D :D   Game story ending impression:    I was disappointed with the ending. The game builds your anticipation as the story goes on then when you get to the ending, It's like the writers just quit their job or something. It felt like all the anticipation was there for nothing at all. NOTHING.  ",
            "review_score": "1"
        },
        {
            "review_text": "A fun RPG steampunk adventure with few cons. Cons - The character that appears on the arts and the cutscenes isnt same as the character in game. The Ending was boring. Can be really repetitive and less fun killing same enemies all the time. Pros - Fun story , characters and environment. You fight hordes of enemies.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i played so far and one of my favourite too :P",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Decent mechanics, although I much prefer the sequel to this game.",
            "review_score": "1"
        },
        {
            "review_text": "Hack'n'Slay adventure game in a late middle ages steampunk world. Totally worth the time and money.",
            "review_score": "1"
        },
        {
            "review_text": "Play it, Love it, replay it...",
            "review_score": "1"
        },
        {
            "review_text": "A great love letter to anybody who loved Diablo I &amp; II: satisfying combat and loot system, nice story-telling and great interaction between you and your companion; moreover, the graphics are really nice and so are enemy and character design, all set in a fantastic steampunk world. A must-have if you are into (or want to try) hack 'n' slash.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good ARPG with great story (including the famous Van Helsing's son and his lady friend, the ghost Katarina), amazing visuals and funny dialogues between the main characters. Throughout the game you will also find easter eggs from famous movies and games like the killer rabbit from Monty Python and the Holy Grail.  Definitely worth to play",
            "review_score": "1"
        },
        {
            "review_text": "Yes, this is a perfect HackNSlash. I love the story, humor and the references to folklore are pretty damn good. I would play again...and again :) By the way, get the other 2 games to expand on the story.",
            "review_score": "1"
        },
        {
            "review_text": "we all have firsts right? I remember mine, it wasn't this game though (resident evil 4) but this one was one of my first top down arpg. borrowed my friend's copy from a recommendation and found out that top down arpgs kinda grew on me. I know hours seem a little too short on my steam account but I guess I contributed more on both my friend's and cousin's account. anyways, this one is the first of it's kind/series and it isn't the last. I heavily recommend players getting all three in the trilogy, better yet, get the final cut if you're in for the adventure, or get all three and allegedly get the final cut version for free, whichever. anyways, this game sets the bar pretty high for the others within the same genre. Holly out.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun 3rd person stroller with a very addictive setting",
            "review_score": "1"
        },
        {
            "review_text": "Difficult not to recommend this surprisingly good, atmospheric and addictive steampunk hack'n'slash, whether you already play Diablo 3 / Path of Exile or not. Special mention for the wonderful soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "an okay diablo-clone, the blue blood DLC makes it pretty op since you can spam ultimate attacks on completely stunned opponents if you do it right, endboss was meh, zerged him down in &lt;25 seconds at max level standing completely still",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the most bug ridden game I've ever completed. ...And now I'm running thorough it again with another character class.",
            "review_score": "1"
        },
        {
            "review_text": "This is worth picking on sale, fresh interesting setting and pushes the usual action RPG buttons.  Cons however is having to buy other classes as DLC, slightly dreary art design and palette and shortness of the game. If you want a better sort of action RPG with guns consider getting Torchlight 2 instead and play a Hunter.",
            "review_score": "1"
        },
        {
            "review_text": "A very atmospheric game really better than diablo Music is awesome But this game is very short",
            "review_score": "1"
        },
        {
            "review_text": "I thought it was going to be great game. But it’s really alright game.",
            "review_score": "-1"
        },
        {
            "review_text": "Old Diablo style is back in this awsome game :D !",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "The Good: - A variety of gameplay options - An intricate leveling system - A large variety of monsters - Combat is easy to learn and hard to master  The Bad: - I encountered glitches often, though nothing gamebreaking - Combat can become somewhat repetitive - Despite the monsters never respawning, I reached max level earlier than expected - Respawning mechanics made the game a little too easy, especially for boss fights - The control scheme proved to be a hinderance from time to time  Overall:  The Incredible Adventures of Van Helsing is a fun, if somewhat repetitve, game. It has plenty of content, though leans a little towards the easy side.",
            "review_score": "1"
        },
        {
            "review_text": "the game running out problimes and is fun and great game play 10/10",
            "review_score": "1"
        }
    ]
}