{
    "app_id": 215630,
    "name": "Demonicon",
    "release_date": "2013-10-24",
    "developer": [
        "Noumena Studios"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Adventure"
    ],
    "achievements": 49,
    "positive_ratings": 492,
    "negative_ratings": 235,
    "price": 6.99,
    "description": "The Dark Eye - Demonicon is a thrilling action-RPG set in the extraordinarily popular universe of “The Dark Eye”, a richly crafted fantasy world beloved by fantasy gamers across the globe.The Dark Eye - Demonicon tells the tragic story of a brother and sister who become pawns of sinister forces in a world of cruelty and depravity.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/215630/header.jpg?t=1447356147",
    "minimum_requirements": "OS: Windows XP SP3 (32bit), Windows Vista / 7 / 8 Processor: 2 GHz Dual-core Memory: 2 GB RAM Graphics: Dedicated DirectX 9.0c compatible graphics card with 512MB VRAM and Shader Model 4.0 support. ATI/AMD Radeon 3800 series and higher, NVIDIA GeForce 9600GT and higher DirectX: Version 9.0c Storage: 10 GB available space Sound Card: DirectX compatible",
    "recommended_requirements": "OS: Windows Vista / 7 / 8 (64bit) Processor: 3 GHz Quad-core Memory: 4 GB RAM Graphics: Dedicated DirectX 9.0c compatible graphics card with 1GB VRAM and Shader Model 5.0 support Additional Notes: Best played with Xbox 360® controller for Windows",
    "reviews": [
        {
            "review_text": "The Dark Eye Demonicon is a third person action-RPG set within The Dark Eye series, a German tabletop role-playing game that outsells Dungeons &amp; Dragons in the German market. You play as Cairon, a young man who suddenly acquires demonic powers when his blood is mixed with the blood of his sister. Some people begin to take an interest in you, and events unfold from there. It is a fairly straightforward tale, with plenty of twists and turns that are less than shocking along the way. But it is an interesting story, and it features one of the most often used tropes in role-playing games today: moral choices.At certain points throughout the story, you have to make choices that will affect how others will view you. Standard stuff, but the best part is that you will often have no idea how your choices will impact you in the future.As Cairon explores the world, he has a few methods with which he can dispatch his enemies. Attacking with your weapon and using whatever physical skills you have is the first method, alongside throwing weapons which he can use to attack enemies at a distance. And then there is magic, which is comprised of four spells with multiple unlockable variations for each spell. Both play well, and I used a mixture of the magic and the mundane as I journeyed through the game.Alongside your combat skills are your non-combat skills such as lock-picking and legend lore, which are used to acquire and unlock additional opportunities. If you upgrade your fast talking ability for example, you will be able to obtain greater rewards for quests or avoid fights entirely in some cases. But a key detail to all of this is the way in which you use experience, or in Demonicon, AP and GP. AP is used for physical oriented skills, non combat skills and primary stats, while GP is used to upgrade your magic abilities. This is an interesting feature, as you now have to choose between upgrading your skills and upgrading your stats when you obtain experience. In theory you could turn Cairon into the least capable warrior in all existence, but in practice you will have increased everything at least moderately by the end of the game. You’ll want to level up everything at least somewhat equally, but the non-traditional character progression forces one to make careful decisions as you progress through the game.If there is one major problem that I can pinpoint in Demonicon, it would be the technical issues that pop up time and again.Textures would pop in and out when I entered conversations, the camera would often move by itself to the worst possible place imaginable during a battle and plenty of other technical glitches and bugs occurred during the 19 hours I spent with the game.With Demonicon being far from flawless, I found myself wondering whether or not I enjoyed it enough to give it a positive recommendation. Honestly, I did. Despite its issues, The Dark Eye: Demonicon remains a fun adventure that, while lacking polish, is an enjoyable journey through The Dark Eye setting.",
            "review_score": "1"
        },
        {
            "review_text": "As a longtime fan of the Dark Eye pen and paper rpg, I was intrigued when I heard about Demonicon. An action-rpg in the Black Lands, dealing with the legacy of Borbarad - sounds good, at least in theory. Let's see how it holds up:  Liked: - the content is mature (little SPOILER: there is a budding incestous relationship between our main protagonists) - the gameplay is on average pretty smooth, barring a few hiccups - the setting has been almost painstakingly recreated and the details border on continuity porn (if you don't know what that is, look it up on  tvtropes.org)  - the story manages to pull you in and doesn't let up until the very end, with tough decisions, whose results you only see after a while, but for some there is always a third option depending on your skills -superb VA (at least in the german version, haven't tried the english yet; little spoiler: your father has the german voice of Liam Neeson)  Disliked (well not actually disliked, but more puzzled by): - a couple of glitches in the graphics, nothing major or gamebreaking; I've seen a lot worse in AAA titles - something in the story progression that didn't make a lot of sense (SPOILER: you beat a powerful and annoying Rondrian and loot the armor from his corpse, only to be immediately offered a better demonic version by a demon - what's up with that?)  Bottom line: IMO Demonicon felt like a somewhat quality-reduced clone of The Witcher 2, which is a superb game and thus Demonicon managed to be at least a good game. If you liked The Witcher 2 and you need to pass some time until The Witcher 3 arrives, then Demonicon is the game for you. If you're a fan of The Dark Eye, then Demonicon is also for you, since this is the only game besides Drakensang that made me feel like I was actually walking through Aventuria. Everybody else, it's up to you.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game is a real hidden gem. I'm a huge fan of RPG's but had never heard of this game until i saw it in the sale. The game can seem very linear and a little simplistic at times but you can forgive that with the in depth storyline and fluid combat. The areas can be quite small and although it's techincally free roam in these areas with side quests it doesn't always feel that way. The Game does have some basic customization with armour and weapons but could be better, i found myself with a massive amount in my inventory throughout the game but not a lot to do with it other than make potions, add runes to weapons or armour and equip these new and improved weapons and armour. The Graphics are OK and it's nice to have choices with dialogue throughout the game. I was impressed at the length of the game and the entire game has voice acting which is a bonus. But there is a lot of talking so if you have a short attention span this may not be for you as although the dialogue can be skipped the storyline is very in depth and can get confusing if you miss any. The game has quite a complex level up system which can be very hard to grasp at first but gives quite a few options to change gameplay such as fast talking to open new dialogue options and different branches of magic to mix up combat. This is a great game to pick up in the sale as although i find it to be a great game it doesn't match up to some of the other great RPG's with a similar full price price tag such as skyrim. The biggest problem with this game is the lack of manual saving and to some people i can see why this would be unforgivable as i have died serveral times on hard difficulty and have been put back to my last save 10 minutes earlier so i have to kill everyone and loot the area all over again.",
            "review_score": "1"
        },
        {
            "review_text": "Well then, where to begin... To begin with: this game is decent. It has solid combat mechanics and an easily maneuverable UI (Crafting, level up etc. etc.). Storyline, and the universe itself, is dark and unforgiving (think Witcher mixed with Dante's inferno), yet really cool. The only 'negative' thing is that the game promises the 'good/evil' meter most games these days have, but when playing you'll experience a lot of 'grey zones' AKA. No1 is without a dark scheme, and most people will betray you or slaughter you children. I, personally, don't find that to be a bad thing as it brings diversity and depth to the universe, but some people might be confused by the lack of linear gameplay.  Overall, it's a game worth getting if you're into old-school RPG's with demons, white knights, cults and lush fantsy environments.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I play RPGs for the story. As long as the controls work and the premise isn't half-♥♥♥♥♥, I'm happy. This is very much one of those. If you're looking for a game to blow you away with graphics, or let you roam the world endlessly, this is not the game for you. However, if you enjoy good story-telling and some fun gameplay to go with it, this is a good pit stop. The biggest claim to fame for this game is the DnD type feel. You're never much stronger than your enemies. You have ongoing side plots and decisions you make matter for the future. If you like DnD and RPGs, take this one for a spin. You won't regret it.  Only 1 complaint: no fast travel and your movement speed is kinda slow out of combat. Near the end of the game there's a section where you'll ravel over the same area like, 7 times. Put on an audio book.... you'll be briskly jogging a lot.",
            "review_score": "1"
        },
        {
            "review_text": "This is my first review, so don't expect anything technical.  The game has a lot of potential, but if you're expecting an arpg with free roaming, free combat, then this game does not have it. Combat and the ability to gain 'AP' are limited to quest only; no level grinding here.  I played the game before the first patch was released, so the game was quite buggy but playable. I was looking for a dark, mature storyline; found it here.  The high point is the combat. It was quite fun. The unfortunate part is that you could not initialize combat on your own, but had to wait for the game to do it , which meant you were constantly placed in situations where you were outnumbered and surrounded; frustrating.  I paid $49 for it. The fact that there was no free roaming and lack of exploration made it feel like I got ripped off. I would recommend this game if you can get it cheaper.",
            "review_score": "1"
        },
        {
            "review_text": "First, i dont know why this game has so 'bad' review. i liked it. Buy it on sale. It's no AAA game but i had fun and i got way more than i expected.  Pros: - Whole thing kind of reminds me of the Lannisters in GoT - you get XP for nearly everything (which makes you want to do so) - Decisions, Decisions - Fighting is kinda fun - Story is okay - You can answer 3(?) times with 'I'm the best' - ♥♥♥♥♥house  Cons: - normal was kindy easy (demonic aura &amp; high crit) - you can't really run - sidequest don't have any audio dialogues - couldn't visit ♥♥♥♥♥house, character is still virgin - answers of npc are sometimes kind of flat - npc's always speak about the same stuff when u run through the city  About the Endfight: - Made Chickenwings (+20 Min) - Went for a smoke (-3 min) - talked every side-dialogue (-5 min) - killed boss, 1 Potion needed (-5 min) - atm writing this review (-2 min) Chicken Wings ready.    ",
            "review_score": "1"
        },
        {
            "review_text": "Action-RPG done right.  Usually the term action-rpg just means 'action', but every now and again a developer gets it right. Demonicon may be a bit rough around the edges, particularly regarding dialog continuity and the occasional frustrating camera angle, but the core gameplay is a spot on mixture of live action combat and rewarding character progression. Real time hack-n-slash that also gives a moderate amount of actual character customization, with upgrade paths not just for spells and combat moves, but general stats, haggling, crafting, perception checks, lock picking, and more. Plus, each zone allows for some freedom of exploration rather than forcing you down the linear path right away. Combine this with a decent story, and the game actually feels like it is taking the RPG half of 'action-RPG' seriously.  If you liked The Witcher II, you will like Demonicon.  The game is a bit short though where the campaign should take around 20 hours, so try and get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very entertaining if you take it without any prior experiences with adventure RPGs in mind. It feels as if your stuck in a closed storyline with the illusion of choice always present. However the game turns this into a positive towards the end, and builds you up into making careful yet definitive decisions that influence each summary of the type of person and world you are creating for the future. The mechanics weren't the best, a bit clunky for sure. However the storyline is rich in real life problems saturated with just the right amount of demonic lore to keep you wondering why America is not voting Bernie Sanders.",
            "review_score": "1"
        },
        {
            "review_text": "'Not recommend' with Full price, but i got the game from a bundle and I enjoy it :D  I really like the story and 'das schwarze augen' world",
            "review_score": "1"
        },
        {
            "review_text": "I launched the game, changed the graphics settings, and it crashed. I had to do it again. Waste of time. Then in the boss fight with the cannibal, he froze at 25% health and I could not inflict any damage on him. Game-breaking bug and supreme waste of time fighting for something I could not fix. I could relaunch the game and try again to see if he will not freeze, but the game is clearly unstable and not worth its full price. I do not want to play only to encounter more errors along the game.  I got this game in a bundle, and even then, it is not a good idea. The animations are wonky (they cut suddenly from one dialogue to another) aside the instability. One can buy Dragon Age (for the animations) or Shadow of Mordor (for the hit streak system) with a discount and pay a similarly low price for a much better experience.",
            "review_score": "-1"
        },
        {
            "review_text": "It's far from the worst game out there.   This game is quite mediocre and kinda ok. But combat is way to repetative and kills my enjoyment of this game. Enviroment and physics seems a bit 'clumsy' and I find it quite annoying that I can't jump. The technolegy for this game seems to be 10 years old.  I will give it a plus for story, which seems to be just as good as any other RPG. However I've not played this game through, and doubt that I will. So I can't tell if the story will be that great throughout the game.  To me this game is just mediocre, and I expect far more from an RPG made in 2013.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is not open-world, this is fine. The problem arises when you start playing and the same scenarios are over the game, over and over... The same empty city and the same Mountains scenario. In addition, the sets armor are horrible very bad desing, the only weapon decent and appraising that you get over the game is the last one which you can play for 10 mintues. But anyway, the gameplay is decent and the story is good... However, there are more cons than pros in this game and that is why we have to take care when we are buying a game and be sad about our money lost in this uncomplete game.",
            "review_score": "-1"
        },
        {
            "review_text": "if you can look past the ♥♥♥♥♥♥♥t voice acting you will enjoy this game.  Great story, gameplay and skill system  Overall a decent RPG  9/11 IGN",
            "review_score": "1"
        },
        {
            "review_text": "The RPG framework is good. It's some oldschool RPG using the Dark Eye system. Parts of the story are fun and there are some choices to make along the way. Incest, undead brothels, demon summoning, evil mages - great stuff. The action gameplay is atrocious. Many levels and areas feel unfinished, almost randomly generated with poor attention to detail. Gear and consumables are bare-bones with little variety. It could have been great. It feels unfinished and rushed.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is not good. It's not the worst game I have played but it is not worth your time. It has a terrible combat system. It is basically a button masher with a bit of 'magic' thrown in but it doesn't work very well. The animations are very slow and clunky. It's like swinging your weapon underwater. I was fighting one of the bosses and he would dissappear and reappear behind me and the camera would bug out and change views everytime. Really frustrating to deal with. The graphics, music and voice over are OK but lack polish like the rest of the game.  Why do these people bother making a game if you are going to come up with something that is so lacking. If you don't have the talent or budget to make something that works and is fun, just don't bother making the game. I tried to overlook the games issues and enjoy it but after 8 hours I uninstalled it. Good thing I didn't pay much for it. Unfourtunately I wasted time that I could have been playing something else much better.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really worth $40. Maybe more like $10. Tutorials are silly and things like using spells which are useful get no help. Compass bar is lame, graphics are marginal and the game locked up for me when I tried to ESC out of the intro credits. You only get to play as the guy who apparently wears lead boots and runs about as fast as his injured sister can walk. inventory system is pretty standard although character points are goofy (spell points are separate from character stats and are called 'gift' points which sounds like you should be shopping at Target.)  Only plus is that I haven't fallen through the map yet and the story, while one big cliche, at least seems to move quickly.  Right now, don't buy. When it gets farther along maybe.",
            "review_score": "-1"
        },
        {
            "review_text": "New Review!  sKorpion rating: 9/10  The game has been patched! this provided MAJOR improvement to the gameplay and performance!  excellent story! memorable characters. quality voice acting. good combat/skills that YOU choose to personalize character. graphics craked up game is gorgeous.  still can't rebind all keys... but that is my only complaint.  overall thoroughly enjoyed the experience... enough so that i am hoping for DLC or Demonicon II ;)",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay is good. Graphics is good. Character Development is okay. Content is short.",
            "review_score": "1"
        },
        {
            "review_text": "An unexpectedly great game. Reminds me a lot of the Gothic trilogy.  A dense dark atmosphere, consistently well done. Graphics are a bit outdated, but the combination of graphics, music and effects still feels very real and immersive.  The story is the strongest point of this game. It's original, well-paced, and has a lot of depth to it. Especially interesting for players with a background in the Dark Eye (whether from other games or the tabletop RPG), but also works fine on its own.  Recommended for anyone interested in a story-driven RPG that's a fair bit darker than usual. Strongly recommended for any Dark Eye fans.",
            "review_score": "1"
        },
        {
            "review_text": "This will be my first review, generally I do not do reviews, because I am lazy, but this game is so much fun, that now I have to start. I bought the game on sale for 6 euros, it is worth some more, and a lot more of you collect Das Schwarze Auge games. So far, I did not finish the game so everything I say is based on the first 30 something percent of my progress.  First of all, I read earlier that Demonicon resembles the Witcher. It is true but only concerning the graphics and the cartoon cutscenes. Demonicon is much more immersive, though more linear. Whereas I, in both Witcher 1 and 2, had to take huge pauses when playing through - because the story was not too interesting, and I got bored at some parts - here I played through the first 27% of Demonicon at once, if I remember well.  The point is that the story is dark fantasy, and is as immersive as in Dragon Age, only with much less sidequests. The side quests are there rather only to show that this game has sidequests, but that is not its strongest side. This game is rather about one great main quest, which fits the DSA universe very well. It is NOT true that without the Dark Eye background the story is senseless, or makes very little sense to an outsider. In the in-game codex there is plenty information to get acquainted with the DSA setting. The German voice acting is also okay, nothing wrong with that.  The graphics of the better parts resemble to Witcher.  However, there are worse graphical parts, mainly when you meet with non-talking NPCs. At those points this game resembled to another dark fantasy rpg, Hunted. Apart from the main, important characters, the less important characters are not too living. They are very static, which could be theoretically good, but in Demonicon you cannot talk to most of them either, which gives a bit of a dead feeling ('lifeless environment', but on the contrary, the sounds are very living). And also gives you the hint only to concentrate on the main quest.  I have to say as well, that the sizes of the city of Warunk are so proportionate and so realistic, I think it beats everything so far I have encountered. The city, and its districts are neither too big, nor too small. I assume in the medieval time we had the same sized towns. It feels good too go on the Warunkan streets. For comparison, the Dragon Age Denerim is highly disproportionate.  STORY: Again, the main quest and story is as good as in Dragon Age, with moral choices, which field is the best one ever invented in an rpg, according to me. M&amp;M Dark Messiah also came to my mind as a comparison. GRAPHICS: Graphics are similar to Witcher and Hunted.  IMPORTANT: You have to shun this game if do not like linear games and prefer the free roaming style. You can free roam, but only a little bit, within a smaller place usually, and also it is not worth to do it too much - you just rather proceed with the story.  One additional fact concerning the skills. This game has 8 or so non-martial skills. I felt when I distributed the skill points, that they are not a waste, because I could make use of every skill, including the Legends and Lore, each of them were important. Also this game made me think that even in a pen and paper rpg you do not need more non-martial skills than these 8 (legends, plant caring, persuation, spotting things, disarm traps, open locks and two more). If there is more of them you will use only a small percentage of them, so most points you spend will be a waste. Or, you will not be able to spend sufficient points to each important one of them (to the ones you really need)",
            "review_score": "1"
        },
        {
            "review_text": "pretty sweet, story is good, seems similar to dragon age",
            "review_score": "1"
        },
        {
            "review_text": "game is much like mars logos  combat is clunky  worthless choices  forced incest  0 replay value  and lots of buggy battle bosses",
            "review_score": "-1"
        },
        {
            "review_text": "Bad game to play with controller. The 'start' and 'back' button have been confused. No quick map button. Game feels very sluggish. Luckily I got this on sale for $5 instead of paying the usual $30",
            "review_score": "-1"
        },
        {
            "review_text": "Want to play a game with REALLY bad 'real time combat' and 'fedex quests?' If so, then Demonicon is the game for you!",
            "review_score": "-1"
        },
        {
            "review_text": "puh technically NO  - npc talk during story talk - bad graphics - u cant go where u are not supposed to go just countign the worst points here  story is good but RAILDOING even if u have some 'choices' it will change nothing to the overall story events exept for the very last one in the game and thats how the game ends  it would be easy to get all the archivements in this game but playing it throu more than once?  if it wasnt 2,99€ I would have goen steam refund after 10min",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game that I picked up rather randomly, with the only intention being to pass the time with...that turned around into getting 'into it' and finishing it over the course of this week. The first thing worth noting is that I wish that the steam review system allowed for Neutral Reviews, because this is one particular game that I feel falls into neither one side or the other, but kind of in-between, depending on the player.  That said, I won't elaborate much on the story, because I feel that the game's description does an adequate enough job and I prefer to avoid spoilers. However, worth noting is that the story is one of the stronger points that this game has, it's interesting right from the very beginning and hooks you in. It's a shame though, because it kinda falls through near the end, I personally didn't like the ending, but that's just me and I think the game would have benefitted from more choice and consequence dialogue options, beyond the few choices you get to make at critical points in the story. Then again, maybe I'm asking for too much and should go play a Bioware RPG then? Regardless, what choice and consequence options there are, are pretty interesting and thankfully, aren't simply a matter of 'good or evil' and instead, as previously stated, choice and consequence options. For example *SPOILER ALER!!!* the first such option has you deciding between letting a cannibal go and saving his captives, with the obvious conseqence of letting him run free and keep eating humans, or killing him, which at the same time, will kill his captives because they are bound to his life by a spell. I actually had to give this decision a few moments of thought before deciding, and when a game makes me stop to think, I believe it's done something right.  Moving on to the gameplay, the core of it is typical Action/RPG fare. Standard attacks, skills and magic are your options in combat. Standard hack and slashing consists of stringing together attacks into combo chains, the higher your combo chain, the higher the chance of scoring critical hits and after a certain amount, you start recovering hit points every time you hit an enemy. Also at your disposal is a dodge function and skills that you can learn with Adventure Points (AP) which you earn through combat and completing quests among other methods. Magic is learned using Gift Points (GP) which is strictly earned through combat and tied to how often you use magic. Finally, there are more geenric skills that are helpful throughout the game, such as Blacksmithing, which allows you to disarm traps and upgrade weapons, Lock Picking which allows you to, well...Pick Locks, Fast Talking which opens up optional disalogue choices and Lore which allows you to gain extra insight into people, places, enemies and so on, in the form of more information being unlocked in your journal and it also opens up more optional dialogue choices. Complementing everything, is Alchemy Crafting which allows you to brew Potions, Poisons and make Balms, unfortunately I cannot comment on that feature, as I mostly ignored it, because I went for the achievement for completing the game without using any potions and Blacksmithing, which allows you to upgrade weapons with components that you buy, or find in chests or get as rewards for completing quests. With gameplay in general, I had a few issues, while combat is easy to grasp, it also felt too simplistic and while some of the skills and magic are definitely useful, they didn't really stand out for me in terms of being 'fun to play with', also, one of the things that immediately come to mind when I think of an Action/RPG, is loot, lots of (hopefully) varied and fun to tinker with, loot...most of the loot in this game is generic and not really interesting, and I hate...let me say it again, I HATE, that the game only has two different melee weapons: Swords and Clubs...I mean, really? Oh, wait...no shields either. Finally, the end fight disappointed me, it was a push over and probably the easiest boss fight in the entire game.  Graphics and Sound...probably where this game fails at quite miserably, wallows in the mud and then gets stomped on by a passing horse. No, really...it's THAT bad. Graphically, this game looks like it belongs in the early 00s, while the atmosphere is spot on, giving the game a less 'Fantasy' and more 'Realistic' setting, the graphics are bad at best. Adding insult to injury, a lot of the animations during cutscenes are cringe-worthy or plain don't exist, like an NPC handing the main character an item and the main character supposedly examining it, which is suggested, but isn't animated, unless you use the imagination and imagine it. What animations are there, are mostly cringe-worthy as I mentioned before, like the main character awkwardly drawing his sword and looking as if his about to fall backwards because of it's weight. Another complaint is the design of the game world, while the atmosphere is great and lends itself to the plot quite nicely, at the same time...it doesn't have a whole lot of variety and not much in terms of interesting things to see. Finally, generic music and sound and mostly awful voice acting, some people have praised the voice work on this game and I guess to each their own, but in my opinion, it's horrible.  Final thoughts: This game had a lot of potential, but instead was ruined. The game is rather short, the first chapter itself spans about half of the time you'll spend playing this game, which gives you false expectactions as it sets the stage to make you believe that each chapter will be similar in length, but their not. More interesting side quests and less linearity may also have helped, but most of all, better graphics, at least for a game that came out in 2013. Oh and is asking to be able to skip cutscenes too much? &lt;_&lt;  Ultimately, I recommend the game, why? Because despite it's flaws, it's still an enjoyable game, if you can get it for 75% off, as it's NOT worth the full asking price.",
            "review_score": "1"
        },
        {
            "review_text": "This game has neither neat-looking graphics, a fun combat system, nor likeable/convincing characters. So why am I giving this game a thumbs up?  It's highly motivating and even if the charakters are either uninteresting and/or annoying, I wanted to know how the story progresses.  Motivating because during the game you'll get PLENTY of experience points and there are many ways how to spend them. Even if the combat system is really awkward and wooden, I still wanted to continue, because I was rewarded for every single action. And the XP was motivating to the end.  About the story - don't worry, I won't spoil here - it had many 'WTF'-moments at the beginning, where I thought that the characters made absolutely no sense at all. I was about to dump the game, but gave it one more shot and in the end everything will be explained. It's high-fantasy and sometimes very much over-the-top, but that's a characteristic of The Black Eye. And well, if the game is called 'Demonicon', you kind of gotta expect that there are indeed tons of demons to fight against.  Another reason which made me keep playing was the atmosphere: it was dark and gritty, sometimes a bit insincere, but it managed to keep me hooked. If you played Drakensang, another The Black Eye - RPG, you will be surprised how dirty, cruel and hopeless the world seems in a sudden. Beside this, you have many choices in the game and they do matter. Not gameplay-wise, but storywise and this is something I miss in many other games (Telltale Games, I'm looking at you!).  So all in all I can say, this game was good entertainment. Don't expect too much, though. I wouldn't reccomend spending more than 10€ for this game, but if it's on sale and you like a diverting, interesting RPG, go for it.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not perfect and the ending feels rushed; but the gameplay, although simple, is enjoyable; yet it is the story that is its real saving grace. It's fairly unique, as far as games go; unafraid to take risks that most games would shy away from. If you have the taste for the dark and mature, and if you're immature enough to appreciate a good sense of humor, there's a good chance that you will enjoy this game. Just don't go into it expecting perfection. It feels more like a budget title. A B title, if you will. A damned good one; but still.",
            "review_score": "1"
        },
        {
            "review_text": "Sure it's a little rough around the edges and a lot of people are up in arms about the initial story line, but once you get a little bit in Demonicon turns out to be a pretty fun game. There aren't nearly enough games using The Dark Eye rules and even ones that bend them a bit like Demonicon are still a delight.",
            "review_score": "1"
        }
    ]
}