{
    "app_id": 215870,
    "name": "Dungeon-Party",
    "release_date": "2013-03-13",
    "developer": [
        "Cyanide Studio"
    ],
    "publisher": [
        "Bigben Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player"
    ],
    "genres": [
        "Free to Play",
        "Massively Multiplayer"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "Multiplayer"
    ],
    "achievements": 20,
    "positive_ratings": 154,
    "negative_ratings": 231,
    "price": 0.0,
    "description": "Dungeon Party is a free online game that is played in teams. You are plunged into a totally crazy, heroic-fantasy world, where you compete in teams of heroes in dungeons full of deadly traps and awesome monsters to win the treasures they are trying so hard to hide.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/215870/header.jpg?t=1539183437",
    "minimum_requirements": "OS:Windows Vista / Windows XP Processor:Intel Pentium 4 processor or equivalent AMD Memory:1 GB RAM Graphics:NVIDIA GeForce 6600 or equivalent ATI Hard Drive:2 GB HD space Other Requirements:Broadband Internet connection",
    "recommended_requirements": "Processor:Intel Core 2 Duo processor or equivalent AMD Memory:2 GB RAM Graphics:NVIDIA GeForce 8600 or equivalent ATI Hard Drive:2 GB HD space Other Requirements:Broadband Internet connection",
    "reviews": [
        {
            "review_text": "I heard people say that this game was terrible but when i loaded in it changed my life for the better. This game is truely great. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is a funny spin on capture the flag. If you enjoy capture the flag without the physical activity then you will enjoy this.",
            "review_score": "1"
        },
        {
            "review_text": "improve on graphics? ",
            "review_score": "1"
        },
        {
            "review_text": "This is, hands-down, the ♥♥♥♥♥iest game i've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A work of art. Makes me cry after playing for 5 minutes.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is af ucking masterpeiece and i recommend any ♥♥♥♥ing sadist cheeky ♥♥♥♥ to play this",
            "review_score": "1"
        },
        {
            "review_text": "I don't even understand what happend went into the game and 7 other players were online. Idk honeslty how to play and there is no tutoirial. waste of my time",
            "review_score": "1"
        },
        {
            "review_text": "its pretty fun just be sure to play with others.",
            "review_score": "1"
        },
        {
            "review_text": "Dungeon Party is a free online game that is played in teams. You are plunged into a totally crazy, heroic-fantasy world, where you compete in teams of heroes in dungeons full of deadly traps and awesome monsters to win the treasures they are trying so hard to hide.",
            "review_score": "1"
        },
        {
            "review_text": "horrible game. clunky controls and bad graphics. the tutorial sucks and you have to find a button to even do the tutorial. no one is online to play with you and there are no bots and the game is ♥♥♥♥♥♥♥♥ly hard when you are alone. 2 little enemies that arent a boss should not be able to get me to half health. the lobby is a chore to get through and the spells are badly described. if they took this game, remade it, and then rereleased it, it might have a chance. but right now....just save your time, you wont even get into a game with ppl in it. also the trailer that says a ton of custimization? true...IF YOU PAY REAL MONEY -.- otherwise u get like two outfits....",
            "review_score": "-1"
        },
        {
            "review_text": "Cons: bad character design, bad enemy design, bad gameplay, doesnt even have anyone playing it, got to first mini boss took me 10 lives and trugging through the level to beat it to progress, first proper boss to over powered and couldnt even fight it, the mini boss and boss I just mentioned were in the tutorial, terrible music, waste of time, need to buy basicly anything with real money.  Pro: being able to give your character a back story.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game in steam atm, no ability to mute sounds etc. you cant make characters cause you get error strings from your name or your description etc. really?",
            "review_score": "-1"
        },
        {
            "review_text": "no one plays this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game ever so weird and terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "Just... Really?",
            "review_score": "-1"
        },
        {
            "review_text": "This game has ruined my life. I used to live a peacefull, content, exciting life, before I played this game. After I played this game I lost all hope in humanity, I killed my family, I began to abus drugs, and I dropped out of school. This game is death.",
            "review_score": "-1"
        },
        {
            "review_text": "nope don't want to create an account to something I don't really care about",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't really like the game.... probably because it's very different. I mean none other game is like it, it has it's own charm. But not for me....",
            "review_score": "-1"
        },
        {
            "review_text": "Theres dungeons. but where is the party",
            "review_score": "-1"
        },
        {
            "review_text": "The graphics are bad. I dont even know how to get past the begining. I dont even know why i downloaded it.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ THIS ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Wanted to know what the game was like... Can't create account... Website offline... Forums are dead... GG",
            "review_score": "-1"
        },
        {
            "review_text": "I killed my friend with a shovel and I still hate it.",
            "review_score": "-1"
        },
        {
            "review_text": "This was one of the first free2play games I got on steam. i feel really bad now",
            "review_score": "-1"
        },
        {
            "review_text": "it sucks",
            "review_score": "-1"
        },
        {
            "review_text": "If you like games with an annoying soundtrack, awful cartoon graphics, a steep learning curve, and an trashy combat system, Then you are in for a treat. Don't get this.",
            "review_score": "-1"
        },
        {
            "review_text": "Haven't been able to get on servers and play that few times I tried. Not sure if anything is fixed yet. So can't say anything good about it yet either.",
            "review_score": "-1"
        }
    ]
}