{
    "app_id": 216110,
    "name": "Tiny Troopers",
    "release_date": "2012-08-24",
    "developer": [
        "Kukouri"
    ],
    "publisher": [
        "Iceberg Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Strategy",
        "Indie"
    ],
    "achievements": 25,
    "positive_ratings": 719,
    "negative_ratings": 183,
    "price": 3.99,
    "description": "Tiny Troopers puts you in command of a team of small soldiers. War might be hell but this is the funniest way to fight in one!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/216110/header.jpg?t=1447356213",
    "minimum_requirements": "OS:Windows XP/SP3/ Windows Vista / Windows 7 Processor:Intel Core 2 Duo 1.8 GHz or AMD X2 64 2.0 Ghz Memory:2 GB RAM Graphics:256 MB HD 2600 or better \\ 256 MB Nvidia 7900 or better DirectX®:9.0c Hard Drive:500 MB HD space Sound:DirectX 9.0c Compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a fun little game about a rag-tag pair of soldiers that, through a series of missions, rise through the ranks and have more and more specialists available to their squad. The gameplay itself is fun, and is diverse enough so that you won't bore too quickly. Though some of the missions seem to drag on, running from place to place, the majority of them are quite easy to do and countinue on. Nice game, consider this if you have a spare dollar or two.",
            "review_score": "1"
        },
        {
            "review_text": "Tiny Troopers is based on the venerable Amiga classic Cannon Fodder to such an extent that it's pretty much a bootleg of it. Which is not a bad thing purely of itself, although it is casualized and streamlined to 'get with the times'. Now  that  could be a bad thing depending on how much of a purist you are, and how attached to the original Cannon Fodder might you be. Luckily for me - and the game, too - I am hardly attached to the original (despite having some sentiment for it) and thus I managed to enjoy this experience.  Part of this casualization stems from the fact that the game was initially developed for mobile devices and ported to PC only at a later time. So the finer points of game design such as how difficult the fights are, or - more precisely - how many opponents might be typically visible at one time are steeped in the realities of touch controls, small screens and the mobile game audience (I'll mercifully leave it at that).  Before we leave the subject of the game's heritage, I'd like to touch up on its visuals. They're 3D, yes, but a very particular kind of 3D that an experienced eye will immediately identify as 'mobile 3D'. Which generally boils down to being blocky, unimpressive and focused on performance (low poly). Which, in turn, means that no effort was spent on improving the visuals for the PC port - or not enough effort, anyways. The saving grace of these visuals is a smart, cartoony art direction that makes good use of the limited resources available to it. The result is that the game looks 'acceptable' on PC, kinda like you would expect an indie game to look.  The original Cannon Fodder tried to convey an anti-war undercurrent in its design and humour. It backfired as it was misunderstood by some and caused controversy, but not the kind the authors intended. I hope those rotten peaceniks learned their lesson, but if not, I can at least see that the developers of Tiny Troopers learned that lesson in their stead. No such triteness is detectable here, the game is pure, nonjudgmental entertainment. It evokes the kind of cheerful imagining of war most of us had when we were kids, similar to what I recently experienced when playing Battle Group 2. Indeed, the target audience here appears to be very young.  There are 30 levels, each available in 3 difficulty settings. This makes the game somewhat short but not tragically so. These are available as part of a campaign with soldier progression and permadeath (sans Boot Hill) or as standalone missions to farm currency. There is also a survival mode dressed up in zombie trappings and some sort of NG+. The difficulty settings are well apart of each other and offer a varied experience. In the achievement department, 'Battlefield Triage!' requires a few hours of aggravating grinding but the rest are straightforward.  I had fun with this. I'd recommend it for a few laughs and some nostalgia, preferably when a discount is available. It's a mediocre game, but I've seen much worse.",
            "review_score": "1"
        },
        {
            "review_text": "  10/10 Gameplay 4/10 Difficulty 10/10 Zombie Survival Mode You can get the game for free on a ios machine such as a tablet but I think you will have an easier time playing it on a computer.",
            "review_score": "1"
        },
        {
            "review_text": "Basic game play, poor controls and very minimal audio. don't recommend paying full price, I picked this up in a humble bundle and am only just getting around to it it does the job of being different.",
            "review_score": "1"
        },
        {
            "review_text": "Plays likes a poor mans cannon fodder and not as much fun. Levels are short and not overly exciting. It could get better later in the game but honestly I just couldn't put myself through it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game may seem simple at first glance, and i would be lying if i said you were wrong. But the simplicity of this game is overwelmed by the features presented. this game doesnt have a huge campaign, but its hard and can take you a long time. The game is a beautiful shooter, the controls are great and the sounds the little army men make couldnt be better! i whole-heartedly reccomend thiis game.",
            "review_score": "1"
        },
        {
            "review_text": "I dont understand why in the earth i bought this mobile like game to pc. Its stupid. F*ck you.",
            "review_score": "-1"
        },
        {
            "review_text": "Suddenly i'm in my early teens sitting infront of an atari playing cannon fodder :) and when that nastalga wears off you realise you are playing a fun little title that builds on a very similar footing and keeps going. Check out the android version (roll on the single game multi platform license peeps!) as its also as much if not more fun",
            "review_score": "1"
        },
        {
            "review_text": "I bought the game in a Humble Bundle , but when I had to try it showed only the intro and went back into the black. have tried to reinstall it, but it did not help. what should I do?",
            "review_score": "1"
        },
        {
            "review_text": "I'm sorry not to recommend this game. Though it's a very fun and simple game, I suggest to buy this only if it's on sale.  Not that this game is no fun. It's a really cool game with OK graphics and easy controls. It's only very hard to keep playing this game. The story mode is really short, and then the only thing that is left to do is zombie mode, which is very fun.  Overal, this game has no storyline, just a few seperate stories, The graphics are not good and not bad, but still it brought me 8 hours of fun.",
            "review_score": "-1"
        },
        {
            "review_text": "  Cute game :3 with cute soldiers &lt;3  good game anyways~",
            "review_score": "1"
        },
        {
            "review_text": "cute shooting game with cheap cost  9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is hours of fun. It's perfect for pick up and play as well. You can jump in, play two or three levels in about 10-15 minutes depending on difficulty and go do something else. Or like me, get stuck on it for hours. It's a great point and click adventure. I love the look and controls of this game. They're incredibly easy to get used to and the leveling up system is both simplistic while being incredibly efficient. It also gives you a reason not to let your men die, especially high ranking members of your team as once they're dead, they're gone for good and you're graced with a new troop with a new name and no level ups. Its hours of fun and the prospect of losing men in war is heightened in this game due to the finality of it. Kind of like in Final Fantasy Tactics if you've ever played that game. I absolutley recommend this game. I had to edit my review after so long to give the game justice. My first review was like two sentences long. Anwyay, amazing game!",
            "review_score": "1"
        },
        {
            "review_text": "Fun little point and click game. Well worth the 99 cent",
            "review_score": "1"
        },
        {
            "review_text": "cute in small doses but i wouldnt spend all day playing this game still its a good game the only problem is that the charecter voices tend to get a bit annoying but that thats my only complaint lol.  personal rating 6/10",
            "review_score": "1"
        },
        {
            "review_text": "Solid little game for 5 bucks.   Two game modes, campaign, and zombie(at the bottom of the screen) and you can replay campaign missions from the mission tab.  Campaign opens with a brief overview of the mission, followed by buying a loadout for that mission which includes 5 separate one time boosts that stack, 1 of 5 specialists, and permanent boosts that are bought with a secondary game currency(medals) found throughout the levels. When the mission starts you will likely want to buy map intel from the command menu so that you can see where the cheap ambushes are going to come from, because the fixed camera angle can lead to some cheap deaths. The perma death of your soldiers though is a nice touch(they always get replaced though), you can become very invested in keeping the little guys alive after a few missions.  Zombie mode, single map, survive as long as you can, every 5 waves you can collect another soldier that will respawn(at their panel) after a bit, periodically you get air drops of grenades, rockets, airstrikes and med kits and the enemies drop coins which count towards your score, they disappear after a short while.  Couple gripes, camera angle can lead to some cheap deaths as enemies will often shoot you from off screen before you see them, especially from below. One instance of falling off the map in the snow area which forced me to abort the mission, this lost all the boosts and the specialist I had bought, that irked me a bit.  Overall a very fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad, funny game.  There are 3 modes: campaign, missions and zombie attack. But there is one bug: final achievement is wrong.. I've collected more then 10 medicreates and didn't get it :(",
            "review_score": "1"
        },
        {
            "review_text": "good top-down shooter to spend a while.",
            "review_score": "1"
        },
        {
            "review_text": "great game, simple and easy to get into  (this review simple and easy to read)",
            "review_score": "1"
        },
        {
            "review_text": "One of the best things I have ever played. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game sucks. It runs perfectly well on my computer, but the game is barely playable.",
            "review_score": "-1"
        },
        {
            "review_text": "This game 's still much better than COD Ghost ! An interesting game with a lot of shooting and blood !  8/10 .! Good game !",
            "review_score": "1"
        },
        {
            "review_text": "Alright indie game, I guess it would be alot better on a mobile device 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game...thanks 'TINY Solders'",
            "review_score": "1"
        },
        {
            "review_text": "this is poop.",
            "review_score": "-1"
        },
        {
            "review_text": "I recomend this game at any price! This is my go to game when I just want to have some crazy relaxing fun. The perma death that happens to your troops is very interesting acpect of this game. Graphics are super fun and really good as well as for the game mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "buy it for a laugh its cheap",
            "review_score": "1"
        }
    ]
}