{
    "app_id": 216260,
    "name": "Don Bradman Cricket 14",
    "release_date": "2014-06-25",
    "developer": [
        "Big Ant Studios"
    ],
    "publisher": [
        "Big Ant Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Sports"
    ],
    "tags": [
        "Sports",
        "Simulation",
        "Indie"
    ],
    "achievements": 35,
    "positive_ratings": 444,
    "negative_ratings": 52,
    "price": 15.49,
    "description": "The first thing to think about when you start playing Don Bradman Cricket 14 is to forget what you know about Cricket games and start afresh…it's cricket like you've never seen it before!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/216260/header.jpg?t=1447356227",
    "minimum_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 8 Processor: Pentium Dual-Core CPU E5700 @ 3.00Ghz/AMD Athlon II X2 250 Processor 3.01Ghz Memory: 2 GB RAM Graphics: Radeon HD 6670 or NVIDIA Geforce GT520 with Min 1GB Memory DirectX: Version 9.0c Network: Broadband Internet connection Storage: 2 GB available space Additional Notes: Controller Required",
    "recommended_requirements": "OS: Windows XP/Windows Vista/Windows 7/Windows 8 Processor: Intel CoreTM I3-3210 CPU @ 3.20Ghz (4 Cpus) /AMD Phenom II X4 960T 3.0Ghz Memory: 4 GB RAM Graphics: Radeon HD 7790 or NVIDIA GeForce GTX 650 with minimum 2GB Memory DirectX: Version 9.0c Network: Broadband Internet connection Storage: 2 GB available space Additional Notes: Controller Required",
    "reviews": [
        {
            "review_text": "Arguably the best Cricket game ever, and I've played many. If not, it's certainly near the top.  Nice graphics, excellent gameplay, patches released on a regular basis. There is realism, depth (batting especially will take a little while to get the hang of), and room for the community to step in and create players, teams and umpires. And there is a long-awaited CAREER MODE, where you start as a 16 year old and work your way up from County/State/Province-level to International selection.  There isn't a large amount of stadia, but this is to be expected of a first release. Clearly gameplay has been the focus and DBC14 is better for it.  In my opinion, DBC14 is worthy of the 'Don Bradman' branding. Well done Big Ant on hitting this one for six.  P.S. You will need a controller, which I think is a good move, I couldn't imagine playing this on a keyboard.",
            "review_score": "1"
        },
        {
            "review_text": "Best cricket game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "The precision bowling and batting is incredible, along with very very satisfying fielding play. I most definitely rate Don Bradman Cricket 14 a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Also an American who does not have a Cricket knowledge background, this is a fantastic creation of the game.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Cricket Game EVER!!! For any one who played EA Cricket 07 you know this is an outstanding cricket. May this franchise last for ever.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Cricket Game ever.",
            "review_score": "1"
        },
        {
            "review_text": "The best ever cricket game made ever. Easy to play tough to master. Great deal of satisfaction seeing that bowling with a plan rewards you with a wicket, or the batsman sees your plan and smacks you for a 6. Great realism , great controls all round great Game!",
            "review_score": "1"
        },
        {
            "review_text": "Easily the best cricket game ever made.  The learning curve can be steep but the rewards are there if you put in the time and effort.  It can be a bit fiddly to start with as the controls are nothing like any cricket game ever made, so persevere and you'll be rewarded.  For every wicket you take there is a sense of pride, just like when you score some runs.  For me I've found the batting to be the hardest part, whereas bowling is tough but like I said rewarding.  This game is well worth your time and effort.",
            "review_score": "1"
        },
        {
            "review_text": "Out in my first game for a golden duck. 10/10 would buy again",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game. Best Cricket Game Ever Developed. We all should buy this game and support the Developers.",
            "review_score": "1"
        },
        {
            "review_text": "Top Game",
            "review_score": "1"
        },
        {
            "review_text": "This is the best cricket game ever developed.  When i first played it, the experience just swept me off my feet. I was thinking if its really possible to develop a game with so much realism.  Batting seems as if we're really doing it. In order to score runs, you've got to apply yourself. Also one could play all the possible shots in the cricketing notebook.  Edges are very realistic which was never done before in any game.  Fast bowling is a real charm with all the subtle variations possible. Although spin bowling bores me personally, its also good with all real variations.  Overall, Its an excellent game which must not be missed.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Cricket Game Ever Period",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic cricket simulation, easily the best of a the decade. Wonderful support by the developers post-launch. Would recommend (buy it directly from Big Ant the developers website for a big discount) to anyone who has interest in cricket. Can't wait for the next iteration.",
            "review_score": "1"
        },
        {
            "review_text": "Really good graphics but very hard to but when you are a newbie like me at batting   get a NIVIDIA Geforce graphics card and a xbox 360 controller and a tutorial and you are all set  8/10 wouldn't buy through Steam but through EB Games (gamespot)",
            "review_score": "1"
        },
        {
            "review_text": "A cricket game afer almost 5 years - and what a materpiece it has turned out to be. All the pros and cons have been adequetely listed by others so I'm not gonna repeat the same things again.  BA Studious have got 90% of the aspects right in their first iteration itself and that speaks volumes of the effort the team has put in. I have no doubt in my mind that in the coming years, if the franchise manages to do well it will easily overtake/threaten the big brands in the market. I can only wish that the PC platform will be supported when that happens.",
            "review_score": "1"
        },
        {
            "review_text": "buy it its worth it great game",
            "review_score": "1"
        },
        {
            "review_text": "A decent cricket game after a long wait....If you love cricket you cannot miss this game... The AI is super at higher levels....",
            "review_score": "1"
        },
        {
            "review_text": "Simply the best cricket game made ! Takes a while to get used to the controls but great in game physics make this a must buy for cricket fans.",
            "review_score": "1"
        },
        {
            "review_text": "Is Don Is Good.",
            "review_score": "1"
        },
        {
            "review_text": "I don't like cricket. I love it.  Bradman 14 is the cricket game that we have been waiting for. That's pretty much all you need to know. Finally a developer has cracked the combination of making a game feel like a proper simulation of the sport. It oozes cricketness. Sure, you can play it like a hit and giggle arcade game if you want, but if you also want to make a ponderous innings in the vein of Chris Tavaré, the game is more than happy for you to go out and block every single ball back to the bowler.  The graphics are very serviceable, animations are generally good although the bowling action isn't 100% smooth, with the ball popping out of the bowlers hand at slightly odd angles, I suppose rather a tricky thing to model though when you have to allow all the variations in bowling and outcomes that result. Batting is a real joy, I love spending a while at the crease fashioning a score. And then smashing a ball down a patrolling outfielders throat having forgotten he was out there. Foolish.  Career mode is wonderful. You take control of one person. You perform their every cricketing move, if you fancy it. I generally only bother with batting myself as I am a glory hunter who prefers not to toil too hard. I've not progressed too far, but I am happy in my role as a county cricketer. One day I'll develop the patience and progress to international level. Maybe.  There's still a couple of minor aesthetic issues with the game although the devs are actively patching it at the moment. Hopefully these will get resolved.  Anyway, this review can all be boiled down to this: do you like playing cricket games on your computer? If so, buy this, you can't go wrong. Simple.",
            "review_score": "1"
        },
        {
            "review_text": "A patch already! Kudos to Big Ant for game support!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Best cricket game I ever played.",
            "review_score": "1"
        },
        {
            "review_text": "The casual match thing doesn't work.",
            "review_score": "1"
        },
        {
            "review_text": "Not only the best cricket, but one of the best sports games period.  Pros -Career Mode and Character Creation -Cricket Academy (Allows you to mod/edit/alter players/teams/upires/uniforms etc) -Rewarding gameplay (All aspects of batting, bowling and fielding covered) -All Cricket formats covered (Test, First Class, ODI, List A, T20I, T20 etc) -Great graphics with some added filter options -Wonderful sound design including match announcers  Cons -A few small things that don't detract from the game experience I.E. Unable to change your characters batting position, bat, clothing etc once selected at the start of career mode ",
            "review_score": "1"
        },
        {
            "review_text": "This game is a tonne of fun. Some minor issues, AI being the biggest of those, but overall it's a great first iteration with hopefully more to come over the years. If you have loved cricket games in the past, you'll love this.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a brilliant game of cricket. Sure it's not a million pounds ea sports development but it's made with care and imagination ,you might get bored quickly with the commentary Which sounds a bit like that boring bloke on the IPL if you've seen that. But there's a fantastic muted pa system in the background.... So many great features. The realistic approach towards batting, bowling and fielding is one of the biggest assets of this game which no other cricketing game was able to provide till now. Tackling license problem with smart and creative idea is just exceptional and gives a buyer an idea that how much Bigant studios are determined to give the best of this game to the users. In spite of having lack of sponsors and not having a million pounds like EA sports development have they have managed to pull off things in a great manner. However few areas where it needs advancement are Commentary it can put you off, definitely graphics can get better and better, crowd need to be alive and small glitches here and there should be sorted (Like when you get a batsman out it should come out realistic more than often its batman who leaves the ball and it hits the stump which is very rare and is not that realistic in a way.",
            "review_score": "1"
        },
        {
            "review_text": "The definitive cricket game! Clearly, the creators are very passionate about the sport and it shows. Ultimately, the game is both a realistic representation of cricket and it is fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "thanks to the supportive staff the game runs smooth ... its the best cricket game ever!!!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with regular update support from one of the best developers. Please do add an option of choosing between easy stroke play mode OR realistic stroke play. I am getting irritated on how each and every update, either makes the stroke play easy at the rookie level or realistic on the other patch. Many a times I play this game just to relax and would love to get an option of easier stroke play on rookie level forever untill I myself change to option to either a higher difficulty level or the realistic stroke play option.  Was playing a match, and was hitting all over the park, saved the game, shut off the pc,  next day woke up, only to see a new update downloading to play the game, and this time, the same strokes leads not even out of the inner circle with even a little bit of misstiming. I would happy accept the realistic gameplay on certain occassions and do appreciate the efforts that you put in, But no in a mood when I want to relax playing the game. Since the career of dbc14 is my one stop relaxation game since its release.",
            "review_score": "1"
        },
        {
            "review_text": "  Who doesn't love this game :)",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the nicest cricket game to come out in a while. The twin stick shot making is way better than choose-a-shot method of EA games. Bowling is also more fun than press-a-button. Especially since Spin and fast bowling uses different controls. I do wish they had the option for field radar. It does get annoying to keep looking through first person before every delivery since there really isn't any indication if there was a change in field placement. Also I really wish they would come out with a newer version of this game since it is now over two years old.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome cricket game,i never seen such a cricket game before,Good Entertaining for cricket lover.Sound,Graphics r great.Thanks to Big Ant.If Commentators mentions the opening players name and coming to bat would be more great',It would be better if the commentators tell the real name of fielders,instead of mid-wicket has taken the catch,in the next patch.Pls add Digital score board with different colurs of score board would be better.So far no rly.thnx.Need to wait for online cricket,so it would be better to set a target post it to leaderboard then other try to get it.Pls add that option.",
            "review_score": "1"
        },
        {
            "review_text": "great cricket game highly recamended",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with regular update support from one of the best developers. Please do add an option of choosing between easy stroke play mode OR realistic stroke play. I am getting irritated on how each and every update, either makes the stroke play easy at the rookie level or realistic on the other patch. Many a times I play this game just to relax and would love to get an option of easier stroke play on rookie level forever untill I myself change to option to either a higher difficulty level or the realistic stroke play option.  Was playing a match, and was hitting all over the park, saved the game, shut off the pc,  next day woke up, only to see a new update downloading to play the game, and this time, the same strokes leads not even out of the inner circle with even a little bit of misstiming. I would happy accept the realistic gameplay on certain occassions and do appreciate the efforts that you put in, But no in a mood when I want to relax playing the game. Since the career of dbc14 is my one stop relaxation game since its release.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game good gameplay. very realistic only the ambience and feel of ground is a bit mellow. Waiting for Don bradman 17 hopefully it will have pumped up audience in the IPL and limited over fixtures.",
            "review_score": "1"
        },
        {
            "review_text": "The BEST cricket game",
            "review_score": "1"
        },
        {
            "review_text": "Best cricket game",
            "review_score": "1"
        },
        {
            "review_text": "Quality game if you love cricket. The career mode is particularly good and can't wait for the next one!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much the closest you'll come to playing cricket without actually playing cricket. I am usually not a fan of sports games and have found cricket games in the past a little lame. This genre usually boils down to 'find the cheesiest method to win easy and repeat over and over'. Not this game.  Game still has some minor issues but nothing I would rate gamebreaking. In fact the only reason these issues stick out is because everything else is so brilliant.  Career mode! There's literally hundreds of hours of play there if you decide to play all the way through to retirement.  A Warning: Batting can be frustratingly difficult beyond the rookie/amateur level due to reaction times otherwise this game is beyond awesome. Bowling on the other hand is way too easy on rookie/amateur levels but starts to get realistic on pro and beyond.  Looking forward to DBC17!",
            "review_score": "1"
        },
        {
            "review_text": "Premium price for a substandard product. The editors in the game are quite powerful and featured but that's let down by the other aspects of the game. Graphics quality from the stadium models to the actual textures are anywhere from average to extremely poor. The lack of resolution options for UHD and wide screen users is disheartening (max res is 2560x1440). The menu is cumbersome to say the least and the actual game controls end up being a chore and take away any fun that is left in the game.",
            "review_score": "-1"
        },
        {
            "review_text": "i loved all the old cricket games this one it to complicated. refund please!!!!!!!!",
            "review_score": "-1"
        }
    ]
}