{
    "app_id": 216210,
    "name": "Secret Files 3",
    "release_date": "2012-09-13",
    "developer": [
        "Animation Arts"
    ],
    "publisher": [
        "Deep Silver"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Female Protagonist"
    ],
    "achievements": 0,
    "positive_ratings": 55,
    "negative_ratings": 31,
    "price": 7.99,
    "description": "The bestselling Secret Files franchise celebrates its return! The dream couple Max and Nina have announced their forthcoming wedding.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/216210/header.jpg?t=1479893821",
    "minimum_requirements": "OS:Windows® XP/Vista™/Windows 7™/Windows 8™ Processor:Pentium® IV 2 Ghz Single Core or 100 % compatible Processor Memory:512 MB RAM Graphics:DirectX® 9-compatible Graphicard with min. 128 MB memory Hard Drive:2 GB HD space Sound:DirectX® 9-compatible 16 Bit-Soundcard (optional) Additional:Mouse",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Third time's a charm they say. After another total replacement of the voice cast, they finally nailed it. The new voice acting may not be award-winning, but at least it doesn't annoy and distract anymore. Also, object interactions have a lot less 'quest logic' and more life logic this time. In fact, this was pretty much the first adventure game in a long while where I didn't have to resort to any kind of extra help. This is the first game in the Secret Files franchise which I fully enjoyed and have no reason whatsoever not to recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Disappointing story. Very short (took me less than 4 hours, not counting replaying a major part of the game after a crash), annoying and repetitive mini games. Some fun moments, but doesn't get anywhere close to Secret Files 1 and 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Not what I was expecting at all it did not meat my expectations",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game to complete the series.  Sadly it is rather disappointing compared to the first two games. If you feel the need to finish a game series I'd still recommend it, otherwise try to stay away.",
            "review_score": "-1"
        }
    ]
}