{
    "app_id": 21670,
    "name": "Bionic Commando",
    "release_date": "2009-07-28",
    "developer": [
        "Capcom"
    ],
    "publisher": [
        "Capcom"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Third Person"
    ],
    "achievements": 0,
    "positive_ratings": 649,
    "negative_ratings": 247,
    "price": 6.49,
    "description": "The first true sequel to the classic 1988 Nintendo Entertainment System original, Bionic Commando sees the return of the bionically-enhanced Nathan &quot;R.A.D.&quot; Spencer. Time has not been kind to Spencer: Five years after his heroic defeat of the Imperials, he has been betrayed by the government he swore to serve, imprisoned for...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/21670/header.jpg?t=1550018984",
    "minimum_requirements": "Supported OS: Windows® XP Service Pack 2 or Windows Vista® (service pack is optional)                         Processor: Dual-core processor (Intel® Core™2 Duo 2.4 GHz or AMD Athlon™ X2 5200+ 2.6 GHz)                          Memory: 1.5 GB RAM                          Graphics: DirectX®9.0c/Shader3.0 compatible, VRAM 512 MB (NVIDIA® GeForce&amp;reg 7800 series or ATI Radeon™ X1900)                           Sound: DirectX®9.0c compatible sound cards      DirectX®: DirectX®9.0c                      Hard Drive: 8.0 GB free space          Peripherals: Keyboard and Xbox 360 controller supported",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "I picked this game up on the winter sale 2014 for like a buck something and didnt expect to much from it . I thought that due to most ports to PC suck real bad.But then i played this one i think Capcom did a real good job with this one !! It translated to PC very well .Im useing keyboard and mouse it works 100% fine (when does that happen in a port?) !!   The game play is action packed. It starts out a bit slow but finished hard and fast!! The gfx are decent and the controls once set up are fine,bigtime for this being a port!! The plot kinda reminds me a bit of chesse like in Far Cry 3 : Blood Dragon but in a good way (love that game also) !  I say if you are looking for some good old school button masher, pick this one up 100% !! And if it goes on sale you better get this game in you library !!!",
            "review_score": "1"
        },
        {
            "review_text": "I will never understand how this game sank a developer...   High quality, just ignore the dreadlocks.",
            "review_score": "1"
        },
        {
            "review_text": "Yea, I got it... The story is... well it semi-sucks. But don't forget that's only a minor part of playing the game. The true test is are you enjoying it as you play it, not how a dumb sap ♥♥♥ ending it had. I agree with all the negative dissapointment the reviewers had over the story ending. Even I found it stupid but I still had a blast until I got sucker punched by the ending. But I had a blast untiI got there and then it was game over, nothing left to hurt over except the ending. Don't let the ending color this gaming experience. The game was done right with solid controls and gave you a fair amount of freedom to get creative. The developers even left it open ended in their own way but this games ending was a back-lash that ended the next one in a heartbeat. The gameplay has everything going for it so just forget the stupid story behind it and enjoy it proper. Problem was they over reached in the story and when for the most dramatic they could think of... instead the story turned into a bad joke. Story aside, kick-♥♥♥ game. Made Spiderman seem kinda lame. He had the great story but questionable controls. Which one would you really enjoy more on that note? I have to have fun playing the game, not watching the cut scenes.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know what all the fuss is about... this game is fun. Like nachos it's got just the right amount of cheese. Best $2 I ever spent!",
            "review_score": "1"
        },
        {
            "review_text": "Good game that could have been amazing if not for a few major flaws. Still worth playing though",
            "review_score": "1"
        },
        {
            "review_text": "Bionic Commando is the proverbial diamond in the rough. Ignored by critics, adored by gamers, this titleshould be in every person's steam library as it is always on sale. A particularly good game for a gamepad.  On to the game... The swing mechanic is perfect. Meaning that it is extremely accurate and requires precise control to really master. But when you do, you will become the swing cyber ape of violent death. It is glorious. Weapons are fun and overpowered, and the massive environments really let you swing out. You begin powerful and end the game a god of some strange swinging death. HUZZAH indeed!  The game is also beautiful through and through. Buy immediately.",
            "review_score": "1"
        },
        {
            "review_text": "Actually quite a good action adventure game with a unique twist using the bionic arm for some smooth swinging and grabbing objects, and then throwing them.. could be cars, enemies, boulders... quite cool after you get the hang of it. Too bad that there are no Steam achievements, but there are plenty in game (quite difficult ones)... Story was also nice, some cool speech taunts. Needs some time to grow on you, as sometimes the automatic save checkpoints are too far away, and you need to replay some sections several tims until you get them... Also, the post nuclear scenario with the radiation as level boundaries worked quite nicely to set the stage... 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "Quick Summary: Third Person shooter/platformer with somewhat clunky controls (if you use keyboard + mouse) and not too much depth. It’s still fun and challenging though, so it’s worth playing through. If you have a mediocre computer like me, you might want to artificially cap the frame rate (using your video card settings) since the game will try to run at as high an fps as possible and heat up your video card.  You play Spencer, a “bionic commando” pulled out of prison many years after the events of the original Nintendo game from the 1980’s (imprisoned for murdering all the bad guys). In this version of the future, many soldiers who have lost limbs in combat have been outfitted with cybernetic “upgrades” turning them into super soldiers, kind of like the Deus Ex games. Due to the threat of super soldiers running around, bionic upgrades have been banned, and a lot of soldiers have been forced to give up their arms and legs, leading to bad blood between the government and some very dangerous people. In this sequel, a terrorist group called BioReign has attacked a city and it’s your job to go in and discover what they want while killing everyone in your way.  You control Spencer in third person perspective and with the aid of your bionic arm, you can swing around like Spider-man. Seriously you can swing from pole to pole or wall to wall just like the recent Spider-man games (Shattered Dimensions, Ultimate Spider-man, and Web of Shadows). This makes it a lot easier to get from place to place once you master the timing and aiming required to swing across the battlefield without ever touching the floor. Unlike Spider-man, you actually need to aim where to grapple. That arm of yours is also your best weapon since it can snag enemies and throw them around, or just punch them in the face. You can kill any basic enemy in the game with 2 punches.  As for gunplay, you have a basic pew pew gun with lots of ammo, but the secondary guns (shotgun, sniper rifle, rocket launcher, etc.) are all extremely limited in ammo. You cannot pick up guns dropped by your enemies and they rarely drop any useful ammo. You can only get more ammo by picking up a new gun from drop pods that land near you (especially in boss fights). Because of this gun scarcity, you need to get used to using your melee punch and grapple slam. I didn’t realize until about 75% through the game how easy it is to pull in enemies and throw them at other guys. You’ll barely need your guns after that unless you get swarmed or need to fight heavy cyber gorilla dudes.  Pros: +Decent graphics and an okay story. The visuals for the characters faces aren’t that good, but the gameplay visuals are well done in the ruined city, as you would expect from a modern console port.  +A few challenging boss fights to test your reflexes.   Cons: -This is a console port, and even if you use keyboard + mouse, the on screen directions are for an xbox controller. This can be a problem during the quick time events if you’re not used to playing with a controller. It can also take some time to get used to the swinging mechanic. The arm’s grapple range is a little difficult to estimate at times, so you’ll be falling to your doom a few times. -The game uses a checkpoint system, and the checkpoints are farther apart than I’m used to. There are a number of action sequences where you’ll die and think “wtf, I have to do the whole thing over?” Fortunately, I realized about halfway through the game that you don’t actually have to fight most of the enemies. The game doesn’t have “experience” or money so there’s no real reason that you need to kill everyone. Some places have doors that won’t unlock unless everyone’s dead though.   Overall the game is not bad, but it could have been a lot better. It’s not that good as a shooter, and the swinging portions can be annoying where you’ll swear you should have grappled but still fall to your death.  ",
            "review_score": "1"
        },
        {
            "review_text": "You fight angels with an arm made out of your wife and there is weird magic poison everywhere to prevent you from having fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game has really stupid dialogue. It's OKAY, not great, worth playing, not amazing, but if you asked me if you should buy it I would say 'Sure, why not. It's fun'",
            "review_score": "1"
        },
        {
            "review_text": "Another underrated game I enjoyed. It isn't perfect, or even close to it. I strongly recommend using a controller and focusing on the fun set-pieces.",
            "review_score": "1"
        },
        {
            "review_text": " Bionic Commando",
            "review_score": "1"
        },
        {
            "review_text": "A pretty fun decent game. Has pleasant graphics and solid smooth gameplay. The sound is good and the music is not bad. I wish I would have payed more attention to this when it came out in 2009 because I am having a good time playing it. Well mostly. The grappling swinging controls are not as awesome as a lot of user reviews would lead you to believe, but they are competent. The problem being that swing points are usually too close together making consistent swinging very awkward to do. It is also very hard to gauge when to release to swing outward correctly even though it shows you a blue icon letting you know when. You still have to pinpoint release to swing even remotely how you want to, which leads to a lot of swinging straight up or at a upward angle, or too low, as opposed to straight forward or at a much desired but very hard to do forward upward angle to propel you forward correctly. The third person shooting aspect is forgettable especially since the only weapon you have in the game is a pistol, although you can find secondary weapons sometimes like a minigun which blows, or a grenade launcher which rocks. You can also punch objects into the air then jump up and punch them at your enemy, or you can latch your grapple onto an object and whip it into them, or you can grapple onto an enemy and jump kick them twice to kill them. You can use the jump kick move for a lot of your kills.  Some parts are not very fun. Mainly the part I just got passed. It didn't make any sense but up until this point, about 4-5 hours into the game, everything was very easy, then all of a sudden I had to fight two robots and the difficulty spiked massively from a 2 to a 9 and they are not even bosses, just regular enemies. They are not exactly fun to fight until I just swung objects into them with swing grapple and on like my 5+ try I killed them.  Overall it was a solid purchase. I think I payed $2.50 for it and at that price it was a very good deal. Do not pay more than $5 though because it is a pretty short game. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I grew up playing Bionic Commando in the 90s. It was a side scrolling masterpiece: innovative gameplay, epic level design and an actual storyline.The kid in me was trembling with expectation when I started playing this 3D sequel.   Although I was annoyed by the many modern gaming sins: no health bar, mandatory/not always well placed checkpoints (now that just added 5h of replaying through parts of levels thank you), invisible level barriers (radiation and water) and etc...Still, I was literally hooked, in part because I was curious to see what's next: the environments are lush even if the level design is either repetitive or slightly inconsistent (often too hard or too easy). By adding more realistic FPS gunplay Grin took away some of the fun of shooting bullets and chasing them while swinging with your arm, in fact shooting and swinging simultaneously is never really required so you're either playing 'Prince of Persia' jumping and flying around or 'Splinter Cell' shooting guards in buildings over the shoulder. The only two cool gameplay mechanics are the dive bomb (death from above) and the abilities to throw objects (even cars and billboards) but Spencer's a total wimp as a couple strong shots will take him down most of the time and even near the end of the game he has limited abilities and a small arsenal (only 4 classic guns). And as the controls are far from perfect (specially for precision swinging) you will die abundantly.  There are some epic moments like the boss fights, but all in all this feels for fans only, the amount of pleasure to be derived from this mechanical arm is somewhat inferior to the pain. But if you wanna find out why the hell Spencer has dreadlocks this is the game for you!  PS: Haven't managed to log on to online MP so I assume it's dead. PPS: There are no graphic options or full controller support.",
            "review_score": "1"
        },
        {
            "review_text": "4 out of 10. Disappointment sets in when controlling your bionic arm is crap. Don't waste your cash on this game.",
            "review_score": "1"
        },
        {
            "review_text": "BIONIC ARRRRRRRRMMMMMM!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "good game idk why people hate it so much  i mean could be a bit more free roam i GUESS",
            "review_score": "1"
        },
        {
            "review_text": "Fun platformer based off the original. Sort of.  Who cares? It's Bionic Commando!",
            "review_score": "1"
        },
        {
            "review_text": "It's fun game. Highly recommended. Though, bear in mind that the multiplayer is dead, you'll just have to do with the single player campaign. Which is not bad actually, full of cliches really. But the game doesn't take itself all that seriously.",
            "review_score": "1"
        },
        {
            "review_text": "A very underated game, it deserves all the credit by its beautiful graphics, awesome gameplay and interesting story. The big amount of combat movements must satisfy to practically any player.   I can't understand why this game was rated with 7 and Bionic Rearmed, with its lack of actions, situations, poor visuals, etc. deserves a 9 for the press.  The game has some compatibility problems, but all they are easy to fix if you read the forum game here at Steam. Please, give an oportunity to this gem, it worths every euro it costs.",
            "review_score": "1"
        },
        {
            "review_text": "The coolest game that wasn't finished and should have sold better. I love this game to death, but sadly doubt we will see another. :( Only way is if there is a show of demand for it and it would have to be a huge demand i am afraid. Anyway great game for what it is. Definitely recommend!",
            "review_score": "1"
        },
        {
            "review_text": "At it's core, Bionic Commando has a really fun central concept. Flinging around from building to building, whipping enemies into the air and slamming down from above like a meteor is all pretty awesome. Unfortunately, it's held back by some questionable design decisions, and a general lack of diversity.  Would I recommend it? For it's current low price, it's worth a go if you're curious. But once the novelty of the bionic arm wears off, the rest of the game isn't strong enough to carry on with the show.",
            "review_score": "1"
        },
        {
            "review_text": "The noodle-arm at the home screen made me giggle. Noodle/10.",
            "review_score": "1"
        },
        {
            "review_text": "Why did I buy this??",
            "review_score": "1"
        },
        {
            "review_text": "This game is really underrated. Its fun and the atmosphere shines through. Its even better with a controller.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Easy to play. Short storyline. Good controls. Thrill of allways being in combat. Cons: story does not proggress much. Killing foes with same weapons and tactics all game. Overall: 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": " Summary",
            "review_score": "-1"
        },
        {
            "review_text": "What could have been an excellent gem of a game is bogged down by unperfected mechanics, unimmersive collectibles, a boring story, and painful gameplay. Not worth your time.",
            "review_score": "-1"
        },
        {
            "review_text": "if you haven't got a 360 controller to play this don't buy it",
            "review_score": "-1"
        },
        {
            "review_text": "It's hard to find anything good in this game unless you liked NES original and 80s action movies. Cheesy dialogues, primitive story, repetetive level design, dumb AI (and thus boring fights). Basically, this is an 80s game remade in 3D. And that's not enough for a solid gaming experience these days.  Another bad thing is that the game punishes you for exploration. This alone is ridiculous and enough to not buy it! Instead of invisible walls there are radiation zones here, and the main hero gets killed almost immediately when gettin into one of those. So go from one waypoint to another and don't think about exploring or the fact the games evolved for the past 30 years. Would you kindly?",
            "review_score": "-1"
        },
        {
            "review_text": "  ---Poor art direction ---Paper-thin and clichéd story ---Laborious, repetitive gameplay ---Unrelatable characters ---Uninspired level design  Nothing can save what amounts to be a money trap for nostalgic and desperate gamers. It's difficult to feel an ounce of sympathy for anyone involved in the game's formulaic, darker-and-edgier revenge plot - and so the whole experience quickly turns into what feels like a job, a walking simulator that leads the player from one arena to another. Items, challenges, and collectibles were scattered around without much thought to them. Levels seem to have been made with a Playstation 1 era design philosophy: it's not difficult to bump against a wall that's been painted with a flat background scenery.  Much like a robot would attempt to mimic a human, this rendition of Bionic Commando seeks to mindlessly check all the boxes on a list in an attempt to mimic a video game. The result is artificial, and at times insulting. One's money is much better spent elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "you know, i was hoping that this game would be good. I mean it is ♥♥♥♥ing bionic commando, he was so badass and cool. but then this game was a ♥♥♥♥ up. the tutorial makes zero sence to the player because you are expected to play with a ♥♥♥♥ing xbox controller. so it took me an hour to do the tutorial but how was the actual gameplay. well i thought that the wire swinging would be so much fun, but the timing for the wire was so weird that the game knew it and did not even bother to change it. the main game mechanic of wire swinging was ♥♥♥♥ed up beyond beleif they they put a signal when to let go of the wire button. The AI is ♥♥♥♥ing stupid and all they do is aimbot you and gang up on you. the main reason you die in this game is the 'radiation'. the radiation ♥♥♥♥s with your mechanical arm and kill you within 3 seconds of standing in it. the only reason radiation is in this game is to prevent the player from going to explore and look around. they used the radiation to kill the player for going out of bounds. The radiation works sometimes and sometimes it does not. i found areas were i could walk on radiation and out of bounds. they were lazy with this game , honestly. they should have made this game open world if the wire swinging mechanic is such a big part of the game. this would have been a more badass spiderman game. but this game has issues, yes u cannot say that it does not. But even though this game is flawed, the ideas were amazing. one hand shoots, the bionic arm can grapple, throw and light and heavy punch. over all i give this game a 6/10 because of it's lazy game design and radiation boundries.  Edit:  I actually sold this game because it was so bad, like i couldent even have fun with this piece of sh!t",
            "review_score": "-1"
        },
        {
            "review_text": "A horrible, unfinished disaster of a game. Content was obviously cut all over the place. It's graphically and artistically hideous. The combat is weightless and shallow, and your hitbox seems to take up the entire screen. The story is complete nonsense. The whole swinging mechanic is ridiculously awkward and unnatural feeling. And the final boss is a 10 second long cutscene preceded by a few QTE's.  Pretty much everything that could've gone wrong, did go wrong.",
            "review_score": "-1"
        },
        {
            "review_text": "Bionic Commando- The Game That's Such A Bad Remake Its Good!  I have not played much of this extremely odd title, mainly due to its lack of real keyboard support (all the button prompts are for Xbox remotes!), the wide variety of glitches, the awful combat and platforming, the fact it neglects the previous games and tries to make a dark, gritty game, and it's general consolization of a once beloved franchise. If you stumble upon this game and do choose to purchase it (although I wouldn't if I were you) you will find a short lame story, that doesn't justify itself and mediocre controls at best, alongside some seriously bad voice acting. Although underneath all that consolization and the ruining of a classic franchise is a half decent sci-fi military shooter (on console at least) that suffers from its own intuitive and feels like it was never planned to be made.  This review was made in 2016  Would You Like Some Tea's Score: 5/10-Mediocre",
            "review_score": "-1"
        },
        {
            "review_text": "Its just bad. Run away.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't recommend this. Irritating controls and checkpoints spoil what could have been a decent game.",
            "review_score": "-1"
        }
    ]
}