{
    "app_id": 217140,
    "name": "Rise of the Triad",
    "release_date": "2013-07-31",
    "developer": [
        "Slipgate Ironworks™"
    ],
    "publisher": [
        "Apogee Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Action",
        "Fast-Paced"
    ],
    "achievements": 80,
    "positive_ratings": 1436,
    "negative_ratings": 673,
    "price": 10.99,
    "description": "Apogee Software and Interceptor Entertainment proudly present the rebirth of the cult-classic first-person shooter, “Rise of the Triad”. Bigger, better and more ludicrous than ever before.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/217140/header.jpg?t=1554159004",
    "minimum_requirements": "OS:Windows XP or Vista 32-bit Processor:2.4 GHz Dual Core Processor or Better Memory:2 GB RAM Graphics:ATI Radeon HD 3870 / NVIDIA 8800 GT DirectX®:9.0 Hard Drive:7 GB HD space Sound:DirectX Compatible         Additional:You're Gonna Need More Than a 486",
    "recommended_requirements": "OS:Windows 7 64-bit Processor:2.4 GHz Quad Core Processor or Better  Memory:4 GB RAM Graphics:AMD Radeon HD 6950 / NVIDIA GTX 560 DirectX®:9.0 Hard Drive:7 GB HD space Sound:DirectX Compatible         Additional:Overclock Your Rig to Ludicrous Speed",
    "reviews": [
        {
            "review_text": "This game takes me back. It's unforgiving, rough, hard, and funny too! If you enjoy old school fps action and witty humor then this is for you! 7/10",
            "review_score": "1"
        },
        {
            "review_text": "A bit rough around the edges, but a bresh of fresh air for us old school gamers who was wanting a game to bring back memories of the old days of Unreal Tournament, Quake, Duke 3D and Doom.  Yes the weapons are crazy, the Doggies are woofing and the Skeletons are smoking cigars... Wait, what?   Welcome to Rise Of The Triad, now that the patches are out I can finally review this properly.  Simply this game is awesome, I've been replaying it constantly in order to find every last easter egg, every last weapon, every last secret and ever last picture of the great North Korean leader himself.   The Graphics are ok, not brilliant but when you're whizzing around at the speed in game you won't really care about the graphics, the guns sound brilliant and responsive and the weapons have this larger than life feel that the tone is going for and the soundtrack is killer.   The multiplayer isn't dead however, part of the community plays regularly on a Saturday night as part of a community event to keep this game alive.  If you want an awesome fast,frantic and responsive shooter that isn't like Call of Doge? This is the one to pick up.  COME GET SOME.",
            "review_score": "1"
        },
        {
            "review_text": "One Crazy FPS lol! If you enjoy the likes of Duke Nukem and Shadow Warrior, and the Serious Sam series you will no doubt love the insanity that the updated and improved remake of Rise of the Triad brings to the table. So many crazy one liners, guns, death scenes, achievements, and game modes to choose from.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a mixed bag in many areas but in the end the pros outweigh the cons. The game is fast paced and the weapons really do pack a satisfying punch. The single player campaign contains almost no annoying cutscenes or scripted sections so the player has complete control over their actions on non-linear stages. The game also has excellent post release support with new (FREE) DLC such as new multiplayer maps and even a map editor with a bunch more content to come. Now the game is not perfect, it's main issue lies in optimization and some people on lower end systems may have problems running the game at a stable framerate. In addition to this the player may also run into some occasional bugs although this has been drastically improved by the developers post release. As for what comes to the community it is currently rather small but still very active with people making custom maps and doing frequent multiplayer events so the multiplayer is definitely not dead.  In conclusion: would i recommend this game? Absolutely. It is definitely the best FPS i have played this year and a fresh change from all those modern military shooters being released every 2 weeks.  7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I've waited months and months and months to purchase this game And today, finally this dream came true. I finally got the game. This game is everything I've been expecting so far. Excellent old-school FPS shooter game. +Amazing guns  +LUDICROUS GIBS! +Beautiful graphics  +Great community +Badass soundtrack  The experience I've had with this game is superb, an experience I haven't had in a long time with any game. It's a must buy for any FPS players.",
            "review_score": "1"
        },
        {
            "review_text": "Rise Of The Triad is a game that falls short of greatness. I'm not an ♥♥♥ kisser nor a hater, so I wanted to give my thoughts. ROTT is a shooter game, a reboot of the 1995 shooter of the same name. For the time, it was a rough game, but the wackiness helped it become a cult classic. The new game has been made to keep the same gameplay, the same wackiness as the original. The gameplay is execellent, blasting through enemies with an arsenal of weapons. The level design is quite good. It really stays faithful to its roots. The multiplayer is mostly absent, because not enough people play it. There are MP events, but they still only attract a dozen of players. This is one of the most poorly optimized games I've ever played. The framerate can drop massively at parts, and it can be annoying. Quicksaves have been added, too. If you're looking for a solid SP game that you can spend a while in, this is the game for you. If you're looking for the next Unreal Tournament, look somewhere else. It seems that people either make this game sound better than it actually is, or they make the game sound worse than what it actually is, so tread carefully. It's a solid game, but not a GOTY.",
            "review_score": "1"
        },
        {
            "review_text": "Super game as i told to few of friends it have reminder of Duke Nukem Forever.",
            "review_score": "1"
        },
        {
            "review_text": "I played the hell out of the original 'back in the day'. I see a lot of the former version in the current one, a lot of the same maps, but they look a hell of a lot better now with the updated graphics. Loving it! I think I'll go ahead and buy it, I've already spent a couple of hours playing during the free weekend. For all of you 'old timers' out there that played the original, this is definitely worth trying, you'll like it.",
            "review_score": "1"
        },
        {
            "review_text": "A blast from the past, a type of shooter that just isn't made these days. Ridiculously fast, absurdly gory and deliberately silly. A faithful and enjoyable update of an overlooked FPS classic.Certainly not for everyone, and the online play still needs some work, but if you're in any way tempted by this game, you should go right out and buy it.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this up for $5.99 (or something like that) during the Autumn Sale. The game is a pure throwback to the 90s. The action is fast-paced, the violence is over-the-top, and the music is as forgettable as most FPS music from the 90s. If you liked the original Rise of the Triad, you will not be disappointed. All of the crazy rocket launchers are back, as well as the moving platforms, traps, God Mode, ridiculous nazi-esque villains, and coins.   If you are looking for innovation, I would adivse you to look elsewhere. While the game captures the feel of Rise of the Triad in a modern setting, the gameplay is purely a 90s child.   Bottom line: If you love Rise of the Triad or old-schol first person shooters, pick it up. If you are not a fan of either, I'd play a demo first if possible.",
            "review_score": "1"
        },
        {
            "review_text": "Must have for an oldschool gamer ;D",
            "review_score": "1"
        },
        {
            "review_text": "The game is addicting, very fast paced, and I can't stop having fun with this game. SHOULD BUY 10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Happy memories of playing the original, this one seems just as insane.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced Gory action! What do you need more? GO BUY IT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Deputy Callahan: you gotta get this game man you just gotta Tuxedo: eh Deputy Callahan: custo, ritz, and myself played this for like 4 hours straight yesterday Deputy Callahan: laughing till we peed Deputy Callahan: we literally urinated all over our desks Deputy Callahan: dont you want to urinate on your desk?",
            "review_score": "1"
        },
        {
            "review_text": "Where is every bowdeh?",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced and fun!  If only there were more players/servers online....  Get it when you have a chance and you won't be disappointed!",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced First Person Shooter! Fun but more challenging than most FPSs I've played.",
            "review_score": "1"
        },
        {
            "review_text": "Leave your brain at the door and your enemies on the floor.  Good old school retro fun with a butt load of fun easter eggs.  Worth the price tag.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "The original was the first shooter game I have ever played. I've played the shareware numerous times, before getting the full version. This remake does a decent job at nostalgia. Heck Episode 2 is probably my favorite levels here.   Some mechanics feel dated and the toilet humour can be annoying.   In the end games like Painkiller(2004) really overshadow this, with much better evolution of the old school mechanics. Painkiller did everything better, because if you're modernizing an old game with just fancy graphics it feels stupid that the enemy in ROTT act like the 2D sprites with their stiff animation, lack of movements and 100% accuracy. Sometimes you enter a large area and theres a guard with a pistol firing beyond the draw distance. The robot guards have a 100% accuraccy and whats worst is that theres so much particle effects that you're screen is a purple flashbang. The monk stages are even more annoying.  Mutiplayer can't outdo Quake 3 or UT04, but still nice to have it in there.   ROTT is still worth getting if you played the original and oved it. If you haven't, then I'd suggest you pick it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "RAY SIPE BASED GOD MODE RISE OF THE TRIANGLES NOW WITH A LOW WANG",
            "review_score": "1"
        },
        {
            "review_text": "Revised video review:          YouTube™ Video:  Review - Rise of the Triad 2013 - Modern Gems Episode 2&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "This game is way fun, give it a shot. If you like twitch shooters you've got nothing to lose!",
            "review_score": "1"
        },
        {
            "review_text": "I played the original, 20+ years ago. It was the first game that my dad ever actually bought for me. He saw me playing the demo, pretty much non-stop, and found out what it was. This was the infancy of FPS games, and after him seeing me beat Wolfenstein 3d, Doom and Doom 2, and Editing both of them non-stop, he knew that there was something about this game, that had to be awesome.   He stole my Demo.  I was Away for the weekend at a Track meet, and when I got home Sunday night, there he was playing the game on his Computer. I had no idea what he was playing. He turned around and mentioned that this game was really good. Yeah.  Monday After school, I finally got to play the full game, on my slower computer, with the screen shrunk down to 80%, and It was amazing. I played through the game long enough to get bored of gaming on PC... which now that I think back... this is the game that killed PC gaming for me.   Not realizing the last statement, I bought the game on the cheap on Steam, mapped the controls to a 360 controller, and gave it a whirl.   Nostalgia.   The only driving force in playing this game was nostalgia.   It has the effect of Pancakes, with extra butter, syrup, vanilla ice cream and cherry compote. Those first 3 or 4 bites are amazing. But tastebud overload subsided, you realize, you don't really want this any more.  By the time I made it to the 3rd level, I was bored. I had the strange feeling that the first few levels were ripped from the original game design. Up until this point, I felt my interest in the game waning pretty fast... and then it happened. I died.  The exact same thing happens to me, like a stored trigger point, every time I play a game for Nostalgia. What ever caused me to press quit game the very last time I played the game, seems to do it all over.   This happens every time I play anything old. SMB, DK, Street Fighter, it doesn't matter. Game over means... Hey I'm playing something else.  Over all,  if you are playing the game for a budget entertainment standpoint: Buy it. if you are looking to revitalize a memory from years gone by: Buy it... but don't expect Pinnacle of gaming, like it was. ",
            "review_score": "1"
        },
        {
            "review_text": "A great original FPS. Get it!",
            "review_score": "1"
        },
        {
            "review_text": "Great Remake Of the Original! Brings back alot of Nostalgia:D",
            "review_score": "1"
        },
        {
            "review_text": "REAL MANS GAME!!!!!!!!!!!!! FULL OF TESTOSTERONE AND COMEPLETELY ♥♥♥♥ING AWESOME",
            "review_score": "1"
        },
        {
            "review_text": "Balls to the wall and genuinely fun. Multiplayer is dead but if you can find a game it's pretty great.",
            "review_score": "1"
        },
        {
            "review_text": "a amazing game of which did oldschool right in this modern world.",
            "review_score": "1"
        },
        {
            "review_text": "Finished 6/10  Good: +Fun remake of old-school game +Gives a good challenge +Alot of maze level +VERY STRONG soundtrack (may be listened as standalone music)  Bad: -Uneven optimisation (despite the Unreal Engine) -Buggy enviroment -Sloppy respawn of enemies",
            "review_score": "1"
        },
        {
            "review_text": "Behold!   Rise of the Triad... A game I've been waiting for years.  No more objective markers, no more stupid hints like you have no brain to use.  The main thing I like about this game is that its challenging and fun, playing on the hardest difficulty and enjoying it as hell, bosses are very tough and difficult to kill, trying to kill the boss 25-50 times and wasting around an hour or two to kill him and this is absolutely amazing It's a bit of strain but rewarding at the end!  Its a true classic FPS gem, single-player campaign is fun, there are secrets on every level. The further you get into it the better it gets, weapons are cool and deadly, there are many different rocket launchers with varying characteristics some are very powerful and dangerous, you will enjoy shooting them off on your enemy's face and it will explode in a mess of guts and gore...  Level design isnt linear and it encourages exploration, there are secrets and fun stuff to discover.  Soundtracks are amazing and METAAAAL!  Graphics are beautiful it runs on UE3, personally it looks stunning on high settings, it takes my breath away on Castle levels but thats maybe because I love castles... I think developers have done a great job in level design, its a piece of art.  I fell in love with this game I havent played such a game for a long long time, this was refreshing after long dead years of FPS-generation.  I got the game several months after release and I havent had such performance issues, just minor lags on very intense situations, it got patched several times though I cant promise because UE3 is a powerful engine if your hardware is dated you may have some performance issues on highest settings, but you can always decrease the quality and still continue playing, it also features Multiplayer, and its insanely fast paced and tons of fun.  Running with a single GTX570 &amp; i5-2500k &amp; 8gb of RAM, almost all settings set on highest except AA.  I wish from developers to add an instant-action mode, where you play against AI/Bots opponents in multiplayer maps, because I want to play after I finish the campaign for a long time...  It's more than worth its value, if you are a fan of FPS you will not be disappointed with Rise of the Triad.  Great job Interceptor Entertainment &amp; Apogee Software.",
            "review_score": "1"
        },
        {
            "review_text": "its Duke Nukem on crack pretty much the old game redone with all the classic stuff u can ask for in a redux of a game.",
            "review_score": "1"
        },
        {
            "review_text": "Not very often that I feel as an artist that I could have done a better job than the actual game devs, but this is one of em. Indie , retro and old school do not mean you get away with giving the player sub par games. Would not recomend.",
            "review_score": "1"
        },
        {
            "review_text": "What this game is: An updated version of the original. It plays mostly the same as the original. What this game isn't: An FPS with lots of story behind it. I mean yeah... It does have a story, but you won't see A LOT of it.  In short: Play this game if you love classic fast paced FPS games with millions of secrets packed into each level. Do not play this if you're expecting something along the lines of Bioshock Inifinite. I love this game because I enjoyed the original and grew up on classic FPS goodness. This game is silly as hell and I love it. (It has some issues, but hey, its new and that's to be expected. If you run into any issues, do some good and let the devs know).",
            "review_score": "1"
        },
        {
            "review_text": "Not very well-optimized but as a game it's a hell of an experience. I'd go so far as to say that beating it on Ludicrous/the original game on crezzy man difficulty is a pilgrimage any gamer worth their salt should experience.",
            "review_score": "1"
        },
        {
            "review_text": "Complex, nuanced, meaningful, story driven, thought provoking. None of these apply in any way to ROTT...  Did you love play shooters in the 90's? If so you have to play this.... It's a complete hyperactive rocket jumping sugar rush of a game. Yes it is occasionally glitchy, yes the AI is bloody awful, yes it's got a drab colour pallette and occasionally questionable balance, but hell, it's the crack addict love child of ROTT and Quake 3 with a healthy dose of B movie pseudo-Nazi baddies to slaughter and who could say no to that?",
            "review_score": "1"
        },
        {
            "review_text": "Nice FPS arena. Very fast with a lot of weapons. The problem is that no one play multiplayer and every server is empty. Very sad story. This game deserves more. And more. Give it a shot. You'll not regret.",
            "review_score": "1"
        },
        {
            "review_text": "its mostly a game which u wanna play when u r ♥♥♥♥♥♥♥ting like just for laughs and not serious at all. :D",
            "review_score": "1"
        },
        {
            "review_text": "Nice FPS arena. Very fast with a lot of weapons. The problem is that no one play multiplayer and every server is empty. Very sad story. This game deserves more. And more. Give it a shot. You'll not regret.",
            "review_score": "1"
        },
        {
            "review_text": "A blast from the past of PC FPS games, including all the previous glitches and annoances, but overall, a decent game.  I remember the first Rise of the Triad, this game does a great job of modernizing the classic. There's a lot of firefights, but there are also a lot of avoiding obsticals and making perfect timed jumps. It never gets to the point where it's too ridiculous to get past, if you keep trying you can beat the more difficult parts. Ammo on your primary guns is unlimited, the only weapons that are limited are the rocket launches and other various weapons that you can pick up randomly throughout the game. The graphics are decent, but by no means are amazing or stunning. I like the gameplay, has a very retroish PC FPS feeling. It is very unfortunate that the game does not have co-op multiplayer.   The problem I have with this game, is they have also brought back oldschool FPS PC gaming problems. Sometimes when I use the quicksave and reload it, the game crashes. Somehow the game corrupts its own quick save files randomly, no big deal though, you can still restart at the beginning of the level. The framerate will randomly glitch and drop on you, but it’s not game breaking, and it doesn’t happen often.   Overall this game is definitely worth what they are asking for it. Anyone who likes the oldschool days of FPS shooters should definitely pick this title up.  ",
            "review_score": "1"
        },
        {
            "review_text": "My Video Review of ROTT! ENJOY:         YouTube™ Video:  Rise of the Triad (2013) Review Rant&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "this game is ludicras it turned me into a sexual dinosaur if you want to be cool and ludicras keep playing this game itll transform you from some nothing into someone who actually matters",
            "review_score": "1"
        },
        {
            "review_text": "These text to speech programs are becoming more advanced.  Oh, and the actual game is GOTY 2013",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia, Probably one of the nicest communities out there. The company listens to the people and they even work with the people! This is great fun when everyone is playing multiplayer especially user created maps. Everyone that worked on this game worked hard and it clearly shows. Despite the bugs that were there, the game runs pretty great now after some patches. 11/10. Hope in the ROTT chat and enjoy the hilarity that ensues in the chat and in game. I definately recommend and it is a must buy. If it there isn't many people playing multiplayer all of us in the community all get on the group chat and we all go play when everyone is one. There is even ROTT events or nights were we all get on and play with each other testing out user created maps and other things! Must buy! Go support RoTT and Interceptor Entertainment!. It's also a great way to relax and quit worrying about those slow paced shooters that get you raging because of bad source code or better equipment. This tests your reflexes and your skills! Go buy!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you've played the original ROTT you already know what the game is about. It's basicly a remake and a more gory version of ROTT! :) Dark humour, metal music and endless of death match gaming. Havn't tried the multiplayer yet but I'm sure it's even more fun then!",
            "review_score": "1"
        },
        {
            "review_text": "The game is not perfect it has some flaws,  But even with his flaws it is ♥♥♥♥ing amazing, it is fast like a real pc fps should be, it doesn´t take things serius the gameplay and has cool mechanics like jump pads, collecting coins, secrets, etc...  I want more games to be like this and not like cod or battlefield",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but needs more bloody farts of intestines!",
            "review_score": "1"
        },
        {
            "review_text": "IF YOU LIKE WOLFENSTEIN OR THE OLD ROTT BUY THIS NOW",
            "review_score": "1"
        },
        {
            "review_text": "Why don't you own this game yet.",
            "review_score": "1"
        },
        {
            "review_text": "Plays like the original Doom or Wolfenstien games, but with high res textures. Quite comical. Can see it playing well at LANs.",
            "review_score": "1"
        },
        {
            "review_text": "Fairly faithful to the original. No health regen, just you and super fast frantic action.  ",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AMAZING. It's fast, it's gory, it doesn't hold your hand or babysit you, and again: it's FAST. There's no health or shield regeneration. There's no squad to back you up. You can't stealth your way through this game. It has platforming elements, point pickups, and it keeps track of the time as a reminder that you aren't taking a stroll. Except for the secret areas, which are totally worth going out of your way for. If you liked 1990s shooters, you're going to want to play this.",
            "review_score": "1"
        },
        {
            "review_text": "Profoundly immature, with a checkpointing system that gives you only enough of a safety net to not drive you completely insane, and bosses that are only beatable if you can exploit their AI... Rise of the Triad is still, somehow, an entirely enjoyable retro thrill ride punctuated by bullets and SO MANY EXPLOSIONS.",
            "review_score": "1"
        },
        {
            "review_text": "A Brutal and excellent flashback to the 90s era of video games.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but needs more bloody farts of intestines!",
            "review_score": "1"
        },
        {
            "review_text": "Must have for any SS fans",
            "review_score": "1"
        },
        {
            "review_text": "Its fun action packed arcade-y type game. It keeps you on the edge of your seat.",
            "review_score": "1"
        },
        {
            "review_text": "this is a good game for people who loved the old ROTT, and also good for people lookign for a new and fun arena shooter with some comical twists. for £12 this is a no brainer as it has tons of content and a great and active multiplayer (steam doesn't count people playing that didnt download through steam, and most people dont buy through steam due to its DRM).",
            "review_score": "1"
        },
        {
            "review_text": "'teabag an enemy while in dog mode' nuff said",
            "review_score": "1"
        },
        {
            "review_text": "Such fun. So wow.  Not played a whole bunch of the game, but the two levels I have played have really evoked a sense of fun that I've struggled to find with the majority of shooters. Running around smashing fools with the doomstick and they're eyeballs sliding down the screen is exactly the sort of nonsense I love in a game.  Copious amounts of secrets stashed into each level makes me want to look everywhere, all the time, for anything I can find.   Get stuck in :D",
            "review_score": "1"
        },
        {
            "review_text": "This is my first game recommendation. I used to play legacy RotT after it was first published. Shooting Nazis in a game with elevating platforms everywhere was a huge blast in contrast to the hallway maze games before it, although I gotta say the guards dogs always did a good job of pumping the adreniline up (Wolfenstein 3D).  This modern day rewrite of that old RotT classic really works for me. The sounds and sensations from the original are here but technically ramped up, especially the colorful fast-moving graphics. (Remember the starchy redish grays? Not here.) And the best part is the pace is still there, moving elevators and all. Your reflexes have to be fast and continuous, almost like doing a dance - you get into a rhythm - your movement becomes fluid and calcuating.  Having said all this, I have yet to get far in the game as a single player. I don't say this embarrassingly as the game can test your nerves and reflexes. But even playing in snippets it's a very fun FPS. I suggest you grab a copy!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, really brings back the old school fps of the 90s with a BANG! Wish the multiplayer was a little bit more active, oh well still worth it for the price.",
            "review_score": "1"
        },
        {
            "review_text": "A fun fast paced first person shooter which is sadly held back by some performace issues.",
            "review_score": "1"
        },
        {
            "review_text": "Do you enjoy FPS games from the 90's? Did/Do you enjoy Rise of the Triad: Dark War? If yes to either of those, or both, you might want to check this game out. It has the same power-ups, power-downs, weapons, and enemies from the original (Plus it has a shotgun now). Even the awesome music from the original is there, but modernized and even better. I LOVE THE MUSIC! The gameplay is very similar to the original, with running around killing everything and avoiding traps, with hardly any story. There was one room that I HATED. It was all about platforming up to the next level, on jump pads. It was REALLY BAD. There are other small platforming bits here and there, but that was the only one that I really didn't like. I also had problems with some doors opening towards the end, and the game crashed on me a few times. The game is also really hard, and it challenges you. In a good way. When it comes to the multiplayer it is hard to find people, they are usually playing on saturday. But when you do find people it is fun classic arena style multiplayer! Overall, there were some problems but the rest of the game outshines them. I would recommend Rise of the Triad for some good old school fun and challenge! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Infinite ammo for some guns, but not skimping out on the reload animations? CHECK!  Gibs and more gibs? DOUBLE CHECK!  Regenerating health? Go ♥♥♥♥ yourself!  ",
            "review_score": "1"
        },
        {
            "review_text": "Still waiting for coop update. :C   This review will be updated if it happens.",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia at it's peak. The game feels as if the original was really taken in to consideration! (unlike other game revamps) Everything you loved from the original still exists, wheather it be intense amounts of gore, the spinning blades, jump pads, disc-like lifts, fire traps, spear traps; you name it! Even the eyeballs spatter across the screen when you rocket some poor souls face off. Oh, and the weaponry...My god it's even more nostalgia! Drunken missiles, napalm gun, heat seekers!   If you played the original, get it. If you haven't... Still get it and you'll be happy that you did!",
            "review_score": "1"
        },
        {
            "review_text": "This is what DNF should have been!",
            "review_score": "1"
        },
        {
            "review_text": "Hey remember when every fps game in pre 2009 thought jumping puzzles with floaty movement was the best idea ever. Now imagine if the game that pretty much started all that ♥♥♥♥♥♥♥t decided to be remade. You have the wonderful gore and levels of classic RoT but instead of losing the worst aspect of the games they brought them back tenfold and devoted a few levels to them. God help you if you can beat those without noclipping past the ♥♥♥♥♥♥♥t and the instadeath traps. But if you do you will be rewarded with mindnumbning violence that really doesnt get old. Really if you can get past that tedium, this game is right up your butt.",
            "review_score": "1"
        },
        {
            "review_text": "This baby would put a smile on anybody's face.",
            "review_score": "1"
        },
        {
            "review_text": "In a world where fps is all about searching through boxes and dressers for coins: this game exsists and is very entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "What if Quake And DOOM get baby and Upgrade him with unreal Tournament?Will be THIS game.Gore,Blood,Jokes,BOSSES!, And Ofcourse Magic.  I think this game gives Old school shooters new life. Sadly Multiplayer not soo popular and Good one(im laggins as hell with 30 ping :| ) Alot of bugs like in E1L5-Boss fight. I died from boss and Loading save then i was spawned Under Floor. Weapons Insane funny but they need Nerf Excalibat( something Excalibur but Bat) this game cost Money what Apogee want for it?YES!YES AND AGAIN YES! P.S. this game get workshop :P",
            "review_score": "1"
        },
        {
            "review_text": "A really good remake of the 1994 original Rise of the Triad: Dark War. The gameplay is fun although some of the jumping around and platforming elements maybe are a bit unwelcome. Solid FPS action, not a fantastic game, but pretty good stuff all round. Quite a good game really.",
            "review_score": "1"
        },
        {
            "review_text": "Frame rate is a little slow. game play is ludacris  this takes me back nice job like it",
            "review_score": "1"
        },
        {
            "review_text": "They say it be like it is but it do. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "as oldschool as it can get",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun! You Love It If You Love Quake An Unreal!!",
            "review_score": "1"
        },
        {
            "review_text": "First FPS game I learned growing up with my 5 older brothers. I liked it then and it is still fun now! This is the 2013 version, so much more modernized than the original 1990's version - which is great to see! Fun! -- Ohh, and the Multiplayer DeathMatch is Awesome! WoW!",
            "review_score": "1"
        },
        {
            "review_text": "Oh HELL YES!",
            "review_score": "1"
        },
        {
            "review_text": "This game really captures the feel of the old school 90s shooters.   They really hit a home run redoing this game. The game is actually hard! I was just about to give up hope that Halo and more modern games which funnel you through the game (so you don't get stuck) had left dificult gaming as a lost art.  They did mimic some of the levels from the orriginal game which is awesome, but the game is not a secret finding fest like the old one was unfortunately.",
            "review_score": "1"
        },
        {
            "review_text": "Aaah this game brings back memories. Bloody, gory, disgusting, funny, frustrating memories... I love it :)",
            "review_score": "1"
        },
        {
            "review_text": "Who needs nostalgia when you have this beauty?   10/10 would cut dudes in half with a machinegun again",
            "review_score": "1"
        },
        {
            "review_text": "Get this game when it is on sale its a fair deal.   Just finished it and I have to say it was the hell of a game. There are 2 very hard 'puzzle' levels which will drive u mad but everything else is pretty much splatter and gore and getting achievements for tea bagging ripped of enemy heads...   6/10 ... Barely enjoyable but still a thumbs up for all the insanity...",
            "review_score": "1"
        },
        {
            "review_text": "WTF am I playing - Me, 2015 ",
            "review_score": "1"
        },
        {
            "review_text": "Crummy game 1/10 would not buy. Doesn't even have killstreakz lul 420  ",
            "review_score": "1"
        },
        {
            "review_text": "Disregard all the negative reveiws because they are all complaining over wonky movement and physics Well, To start. This game originally on the snes, wolfenstien 3-D was a face paced (LOW PHYSICS) game that was run and gun Much like this currently is. Now all these cod players over here that dont know what it feels like to play Unreal, quake,duke nukem(Preferably the megaton edition) and MAYBE half-life, the original doom and serious sam The level designs are perfect , tight corners and chaotic to all ♥♥♥♥ blended together with secrets and having the player be in a state of adrenaline rushes mixed with panic because lets be honest in 2016 the generation of tommorow cant even think for themself let alone problably even know how to run and gun outside of cod and ghost recon. So get your thrill on people! Even though my side of the arguement might just be some biased rambling and not even proper points put together this games worth the 15$",
            "review_score": "1"
        },
        {
            "review_text": "This remake is f..n AWESOME!!!!!! Must have, exactly!",
            "review_score": "1"
        },
        {
            "review_text": "A great fastpace FPS. I still have a problem with the number of weapons you can carry but it is done for gameplay purposes.",
            "review_score": "1"
        },
        {
            "review_text": "If you love brown, hitscan everything, and giblets, boy have I got a game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Certainly played the original a good bit, made some maps for it and was looking forward to this release. Without question, I can give it a thumbs up. Played it before they had fully finished it, before they had steam achievements, etc. Recently took the opportunity to revisit the game and share thoughts of this near-final version. (I say near-final, since this development team has continued to issue so many new things and fixes over the years it's remarkable.)  The game is mostly linear, but not bothersome. There are some well-placed secrets that make it worth poking around. You'll need to get a key or flip a switch to progress, but it's not like other games of the mid 90's where you could get lost, or really had to FIGURE OUT the level. I don't even remember if the original RoTT had any 'maze' type aspect to it to be honest, so this may be spot-on in that regard.  This game's levels are completely planned--- WELL planned with health + enemies in known quantities and locations. I like this. I am not as much of a fan of games that employ the 'lock you in a room and spawn enemies at you until you're blue in the face' mechanics. I find it to be cheap level design! Some may wonder at why we are gathering coins and jumping impossible heights, but this was the original game. You collect coins because you want a high score! You want a high-score because... 1990's!  The missile, flame &amp; magic weapons are as much of a blast to use as ever, but stick to them. I find the pistols and machine gun to be quite underwhelming in all regards, including the animations in which your victims react to being shot by them. You'll only use them for backup though, so it's not a huge deal.  The soundtrack was done with so much passion, they are truly an audiophile's dream. Games from the 90's were all about the music, the melody, and having a 'song' to play a game to. Go old-school and listen to the MIDI versions as well!  The bosses are a challenge and have some interesting mechanics, so much so you will likely have to turn down the difficulty. There are no 'circle strafe and win' fights here, but there's also no obtuse boss mechanics where you have to die 100 times (or read online) to be able to win.  Multiplayer still seems alive and well. Subscribe the levels recommended to have in your downloads so you can jump in and get to work. Here, you'll see how fast and intense this game can truly be! It works well and is as intended. There is no progress or incentive to do it other than ... you want to shoot other people. Again, 1990's here.  Now for the negatives and I jot these down so you can make sure you come in knowing them and are not disappointed. In no way did they significantly impact MY enjoyment, but some frustrated me at times: -Occasional quick save crashes -Difficult FPS platforming to be found here-- but try to have fun. It really is unique! Quicksave and try again quickly! -Getting stuck at odd times on doorways, ramps, rocks &amp; misc. objects -There are random checkpoints, very frustrating when attempting to get 100% level completion! You can turn a corner or step through a door and find yourself locked from going back and exploring. Use the guide in the forums, if you're trying to get the achievements. -Sometimes difficult to shoot enemies behind railings due to explosive weapons detonating on 'invisible walls' making enemies invulnerable. Just jump and shoot down at them to land your kill.",
            "review_score": "1"
        },
        {
            "review_text": "Rise of the Triad is a modern remake of.. well.. Rise of the Triad from 1995. It keeps the nostalgic feeling for those who played it in the 90's (which I didn't) and offers really good gameplay exactly what you expected from the word of mouth of people and screenshots.   This FPS reminds me how Bioshock Infinite got 10/10 across the board. As anything on this Earth NOTHING is perfect and giving a game (that is overhyped, like GTA 5) a 10/10 is ludicious re-evaluation is highly needed.   I think this game is better this Bioshock Infinite. I've played this for 30 seconds and was immediately put into action and having fun. This game rewards exploration and poking around walls, corners, vents, you name 'em. Which is the opposite with gemes like COD and BF; where the single-player is chuck-full of cinematics and scripted events and shooting galleries! *cough* BIOSHOCK INFINITE *COUGH*.  It has good enemy variety. Excellent map design. Good soundtrack, very smooth gameplay. 70 FPS on high settings on 900p.  If I could give any game a 10/10, Rise of the Triad would be one of them. Though I think it's a 9/10. It lacks some customizations I would've loved like changing the weapon model FOV but I don't mind it as it is now. Also some minor bugs, like getting stucked in certain spots in a map. And I don't like the checkpoint system, you can go 20 mins ahead in a map and if you die you go back to the spawn point and have to redo everything from the beginning. The enemies look like Nazis, the flags look like the Nazi flag and the Triad logo looks like Illuminati! lol",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥♥ this game was fun. Just finished it yesterday and for anyone wondering if it's a faithful yet still fresh enough recreation of the original I can definitely say yes. It doesn't screw around, doesn't try to be more than what the original was at its core (like some other remakes try to do with hours of cutscenes and deep intertwined plot). Just tells you that you're part of a badass quartet, drops you in a level and gives you a gun. Except here you get some purdy graphics and awesome satisfying gibs and weapon kills. It's also definitely no pushover in the difficulty department just like its predecessor.  If you played the original and have always wondered what it would be like if it was made in 2013 here you go. Those who are expecting anything else but an epic run and gun marathon will likely be disappointed. This is a visually and gameplay updated version of one of the codifiers of the arcade shooter. With all that implies. If you want recursive betrayals, drama and tearjerking with regenerating health and four shot deaths. You best look at Call of Duty.  I made a partial series of this for  Project P . I didn't record the other 3 worlds because even though they were all awesome and varied I can only say so much about the game before I say all there is to say and just want to sit back, listen to the music (which is also good, oh man is it good) and enjoy it silently.  One more thing, wait through the credits. Trust me on this. It's amusing and at the same time kind of touching. I'm not the emotional or particularly nostalgic type but you'll see what I mean.",
            "review_score": "1"
        },
        {
            "review_text": "This game has lots of potential, too bad the devs couldn't make it run well enough. It's got a HUGE amount of bugs and it's really unoptimized to run even on some pretty strong hardware. The AI is dumb as hell, but the graphics is decent with pretty neat textures. Gameplay is nothing special, it gets tedious after about an hour of gameplay. If you can get past all of this, you should get yourself this game, because it's a neat remake of an old classic.",
            "review_score": "1"
        },
        {
            "review_text": "This game is unforgiving 1/3 of the time. I give it a 666/10 must play to the end!",
            "review_score": "1"
        },
        {
            "review_text": "Great and funny game!",
            "review_score": "1"
        },
        {
            "review_text": "I would recomend upgrading your PC before playing this if you have a low end build. Mainly because this is one of those games where the graphics are at the same consistancy of oatmeal that's been sitting on the counter for way too long and can stab the $h1t out of your eyes if looked at for long periods of time, but other than that I'd say give this game a shot. It's one hell of a tribute to retro shooters and the game knows just how kickass it is with small details like a woman nairator saying 'Holy f*cking $hit!' when you set your settings to high the specs under minimum, a large amount gibs of various enemy CPU's baised on how hard you kicked their a$s that would even give a horror movie villan an erection, and even recommended being 'You're gonna need more than a 486' and 'Overclock your rig to ludicrous speed' that just gets the inner retro shooter enthusiast in me smile;  9.6/10: Ludicrous Enjoyment.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME NO SERVERS NO BOTS SO DONT BE EXPECTING CRAZY ONLINE FUN UNTIL THEY SORT THIS OUT WITH BOTS OR SOME WAY OF GETTING PPL TO PLAY ONLINE",
            "review_score": "1"
        },
        {
            "review_text": "Reminded me of 'Rise of the Triad' but not in a good way.",
            "review_score": "1"
        },
        {
            "review_text": "I like this game You kill things  THE END",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥♥♥ ♥♥♥ game wouldnt even play it iwth your balls nowamsayin",
            "review_score": "1"
        },
        {
            "review_text": "Good shooty, very bad jumpy.   Worth getting, but ♥♥♥♥ jumpy.",
            "review_score": "1"
        },
        {
            "review_text": "Oh yeah so much old school in this game Fast paced, cool power-ups a ton of secrets to find Its a great bast to play online.  If you played the rise of the triad before you own it to yourself!",
            "review_score": "1"
        },
        {
            "review_text": "You don't need to know much besides that this game is 'LUDICROUS!!!!!!!!'   Seriously, it's tons of fun and a great game. Why haven't you bought it yet?!",
            "review_score": "1"
        },
        {
            "review_text": "This is a good one. I love the old-school shooters and this is a shining example that a young team can produce a really good game when they love what they are doing. This game has bugs and rough around the edges. You can see that the dev team was problably not very experienced. But they surely loved this project and the player can live with the bugs because the overall gameplay and fun-factor is high. If you look around, you can find small easter eggs and funny items in every level. The difficulty is kind of high but it's bearable. Back in the days this difficulty was perfectly normal. :) Although some bugs helped me kill the bosses and I was glad for those glitches. :) All in all: if you like hard, gory and fun games, don't miss this one!",
            "review_score": "1"
        },
        {
            "review_text": "An ultra-violent amped up romp. It will kick your ♥♥♥, and you'll enjoy every second of it; and if you think it won't, just ask yourself a simple question.  'When was the last time I had to circle strafe and kill thirty enemies with nothing but my MP40 and space bar to save me.'",
            "review_score": "1"
        },
        {
            "review_text": "This game is ludicrous and great. But the multiplayer's pretty dead right now, which is neither ludicrous nor great.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic modernisation of the classic game. It's unlike any other shooter of today and I mean that quite literally. If you're familiar with the 1994 classic, then this is -exactly- the same except with today's graphics. It is a little difficult even on the easy difficulty, especially if you play as Lorelei Ni, it was for me at least. Still, there's no reason you shouldn't get this, the metacritic score is a load of tosh. Just buy it, it's -that- good.",
            "review_score": "1"
        },
        {
            "review_text": "APOGEE IS BACK BABY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Is it a good game? Yes. Is it worth $15? No. This is a fun game but it is way overpriced, my advice is to wait until it is on sale than get it because it is a fun game to have and can play for hours.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun if you like the older style of shooter. Sadly it has a limited online population, generally only one server with &lt;10 players.  As long as you can find people in MP it's worth buying in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "I can't really seem to get into this game, but I still like it.",
            "review_score": "1"
        },
        {
            "review_text": "Get this game. One of the best games of 2013.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for the price!",
            "review_score": "1"
        },
        {
            "review_text": "This is one hell of a game.",
            "review_score": "1"
        },
        {
            "review_text": "This game was ok, up until I got to the jumping puzzles. That combined with fairly frequent crashes when quickloading means that I will not be finishing this game, and honestly regret my purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "Game that is mediocre fun and better than todays mainstream fps but still after 3 years, haven't been properly optimized. Cannot recommend, worst performing Unreal Engine 3 game.",
            "review_score": "-1"
        },
        {
            "review_text": "Was awesome. Now it runs at 3-7 fps and is unplayable. At first, playing on smaller machine, I thought something was wrong with the rig. Then I fired it up on my dual gpu X99 system and its definitely the games fault. A shame that Apogee, the once king of PC games, cant make a DX9 game run right at the present. I was hoping for a resurgence from Apogee. Dont think thats gonna happen",
            "review_score": "-1"
        },
        {
            "review_text": "It's been a while since this game has been relevant to me (or anyone else for that matter), but, while I'm writing reviews, I might as well close the book on this one. I did enjoy RotT for a while, in spite of its best efforts to ensure I couldn't, but looking back at it from a more objective point of view, this was a subpar experience. Let me break this up into some relatively simple points.  +The soundtrack was one of the finest points of the original game, and the same is true here. Lee Jackson's masterful compositions translated quite naturally to metal. +The smorgasbord of ridiculous rocket launchers is as satisfying as ever to use. Just like the original, the game really only comes alive when you get a hold of some explosives. And there will indeed be ludicrous gibs. +The powerups are all back, including the delightfully stupid 'dog mode', which I've yet to see in any other game. +Bullet weapons are less boring to use than in the original, though the dual pistols feel useless now. +There's now an extra weapon slot for magic weapons, though it rarely comes into play. +The multiplayer was pretty fun, albeit not very populated, and I can't imagine that's gotten any better with time. +At least they managed to implement manual saves, even if it is only a single quicksave slot. Most games these days offer no such function. +The General Darian fight was a huge step up, as was El Oscuro, who you are actually allowed to shoot at now.  -The level design somehow manages to be worse than it was before. There was a certain charm in the nonsensical quality of the original, with its maze-like layout and creative use of traps. Now everything is essentially a straight line, with the unique quirks of the old RotT heavily applied to only a few select areas... -with the exception of the bouncing pads, which are now mostly directional and make up several horrendous platforming segments. Your character's rigid movements, combined with said pads' tiny size, leave very little margin for error. -Touchplates, pushwalls, and wandering walls are gone. -Every checkpoint is a point of no return, so missing any secrets means replaying the whole level. -Reloading a checkpoint will sometimes leave you unable to get 100% due to some enemies not re-spawning or some of your coins being uncounted, but, I guess that's a good incentive to not die... -Enemies are somehow even dumber than their 90's counterparts, standing perfectly still to repeatedly shoot at you; you'll still get hurt pretty quickly though. Back in the day, hitscan enemies shuffled side to side in a random fashion while occasionally taking a shot at you in-between, but that was still somewhat decent game design, unlike this. -Level geometry is finicky, sometimes trapping you inside of it, and sometimes being unexpectedly intangible. -Even on reasonably powerful machines, the game's performance is mediocre at best. Framerate will take a sharp nosedive when the action gets complex, and large levels will often trigger a crash to desktop. This has been a problem from day one. -Krist was a classic case of 'kill him faster than he kills you', NME's heat seeking missles were often instant death, and Snake Oscuro was overly long and tedious.  So yeah. The old RotT definitely was not perfect, and I'd hoped that this would address some of its shortcomings, but it brings its own instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Frustrating, repetitive and glitchy, you're better off grabbing one of the true '90s classics from Steam or GoG. On the other hand, they gave the redhead even larger breasts than in the original, proving that entropy is not an irresistible force.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow......... This game is an epic fail.. Thank god I only paid 2.09 for it. Lasted about 1/2 way through first stage and quit. Looks like they took very little time and care unless this game is meant to be a joke!",
            "review_score": "-1"
        },
        {
            "review_text": "For a game with so much platforming, there sure are some janky physics. Also, something that might barely scrape you in one instance and do about 3% damage will suddenly insta-kill you in a lot of places.  Far too many bugs, too. Don't even bother with quick saving and quick loading. They'll crash your game about half the time. Died because your character over shot a jump in a series of stupid platforming exercises? Too bad, go back to the last checkpoint and do everything over again.  I like the secrets, which is something modern FPSes are desperately lacking, but this doesn't stack up to the original very well at all.",
            "review_score": "-1"
        },
        {
            "review_text": "I can hardly give a recommendation for this game. The game for itself is nice and it feels good to play. Unfortunately not too many games have a simple 'pick up and play' character anymore. Doom 3 disappointed a bit. But the Number one problem I have with this game is the technical aspect, which the game perfectly says up front:  'Additional:You're Gonna Need More Than a 486'  Oh, you bet! I ran this game on a Quad-Core @ 2,3 GHz with 8 GB RAM and a HD 5750, but even on the lowest settings (including 1024x768 resolution) possible it stutters with at most 30 FPS, mostly 15 FPS. And that rig is defnitely better than a 486, I guess.  My other computer is a laptop with an i7 (8 threads @ 2,8 GHz), 8 GB RAM and a decent nVidia GT 540M and I have the same problem (lowest settings). Here, I get at most 35 FPS and mostly 17 FPS. This too is better than a 486!  So hell, I don't know what is going on here. I updated my drivers and still no improvement. Combined with the horrendous jumping sequences this isn't fun at all. Those sequences are easily the worst part of the game. It is amplified by the fact that the hero doesn't have feet and legs and not even a basic blob shadow, which would help me in telling where I could land. Sure this game is a throwback to the 90's, but why don't get developers that this doesn't mean you cannot improve the gameplay where it's needed? Is this really so hard to understand? We live in the year 2014, and by now they still cannot do this? Like, having 100K polygon human models is no deal, but making it so you can actually see your legs is too much??? Man...  Besides this jumping-BS the gameplay is good and you get exactly what you expect. Other than that, it is only recommendable if you have a decent rig. Otherwise you're in for some insane lagging.",
            "review_score": "-1"
        },
        {
            "review_text": "Almost a year after it's release and it still feels buggy and broken.  The developers did not plan for quicksaving when making this game, they blames the Unreal Engine, they claimed it made the game more retro (despite the original ROTT having Quicksaves) eventually they just updated the game and gave us the ability to save anywhere. However again, it was not planned for, so it breaks the game often. Doors don't open, enemies won't spawn etc.  The game is brutally punishing, unnecessarily so. If I was playing on Normal, Hard or Insane I would expect the normal enemies to be bullet sponges but on easy? I had already had my fill of what this games devs consider challenging (ie, badly placed checkpoints, weapons which injure you more then the enemy, terrible platforming sections) so I was fine with taking the cowards way out and playing on easy mode just to finish the game and have a little more fun. Nope. Easy is what would be considered Hard on another game, this isn't a GOOD thing. It adds to the games overly frustrating nature and I'm less likely to put up with terrible optimization or bugs and laugh at their stupid ♥♥♥♥ing jokes as a result.  It's an old school game, but like a badly designed old school game.",
            "review_score": "-1"
        },
        {
            "review_text": "Alright, so I reinstalled the game to fix the crashing, so I can give it a slightly more in-depth review now:  Game is still ♥♥♥. It's got several issues, the primary of which is hitscan enemies. Around 80% of all enemies are hitscan. Which isn't AS big an issue in the first few levels because you're outside and the enemies aren't miles away from you blending into the background. But the later levels take place in-doors, with gray and black uniforms blending into gray and black backgrounds.   Often times you'll walk into a room wondering where the bullets are coming from, which leads into playing the game as a cover shooter. You better enjoy hiding behind walls and taking potshots, cause you're gonna be doing this for the majority of the game. See, when you enter a room and there are 5 people, it's stupid to run in and start shooting since none of their shots will miss. And I have a strong suspicion that part of the goal here WAS to hide enemies in the rooms, since a few of them are up on rafters where you wouldn't spot them easily. So you hide behind walls when entering a room trying to find them, and if they're all in front of you then you take them out one by one.  The mid-game bossfight shows just how fun this system can be. A boss that is all hitscan all the time. Luckily there are doorways for you to hide behind, so the bossfight goes like this: throw two rockets, hide until his 7 second barrage ends, repeat. And no, you can't tank his shots since you'll die in 2 seconds to them. Exciting.  Hitscan and enemies that blend into the background destroy any enjoyability this game might give you. But the enemies themselves are sort of...I mean, they just stand there shooting. Some are a little craftier and roll when being shot. Otherwise, god damn you might as well be shooting target dummies. Target dummies with hitscan weapons. So the task is hiding behind walls, spotting them, and going to target practice.  Then there's the precision platforming. To it's credit, the game's level design is such that there are traps throughout the levels, and for the most part it keeps the game fun and has you weaving and dodging throughout the level. But one level in particular, the castle level in episode 2, is awful. They expect you to jump from jumppad to jumppad in a vertical fashion and make every landing with the floatiest, shi*tiest aerial control around. Now you CAN quick save...  ..but the game kept crashing, and when I reinstalled I didn't wanna risk constant crashes again so I just used a flying cheat. Thank God for cheat codes. Fire the guy that designed that level. That room in particular.  Then there's strange design decisions. You have a gun, double guns, and an automatic rifle. All have infinite ammo and stay with you. Why you would have a gun and dual weild guns in the game when you'll just default on the rifle is beyond me. It's unnecessary, a better option would be to be able to carry more of the weapons with limited ammo laying around the level. Often times you're backtracking after using a weapon to pick up another that was left behind.   The game also has special pick ups throughout the levels. You use them, like, 6 times in the whole game.   Game has nice music though. But god damn is everything else a let down. The first level is cool and sh*t and you're getting pumped up. But then you play the rest of the game. I didn't think one issue: hitscan enemies, could ruin so much of the game. But Jesus it leads into several other issues and it all just crumbles from there. Game has a 'mostly' positive rating atm, which means a sizable portion of them are negative. It's roughly a third of the reviews that are negative; avoid this title.",
            "review_score": "-1"
        },
        {
            "review_text": "Somehow it jsut doesn't feel as good as the first time....",
            "review_score": "-1"
        },
        {
            "review_text": "Nobody wanted a RotT remake and unfortunately all this does is deliver something that isn't really worth caring about.",
            "review_score": "-1"
        },
        {
            "review_text": "I like FPS with old school mechanic (including original ROTT and Duke Nukem Forever). But this... Where ♥♥♥♥in manual saves? Okay, you don't want manual saves, but at least place normal amount of checkpoints, not 1-2 on really BIG level. BTW, original ROTT have manual saves. Next, situation, when you stay on open ground and enemy start attack you. It hard recognize where enemy is. Very annoying. Puzzle levels, when you must use jump pads and when you fall you must start over again (yeah, checkpoint). Play The Room level and you understand. Some problems with optimizations (seems fixed a bit in 1.02 patch). Devs promise impove save system 2 months(!) later. Doh. I reccomend wait for fixes and then start play. P.S. Its not just me, game forum flooded with requests to add a sane save system.",
            "review_score": "-1"
        },
        {
            "review_text": "I found myself questioning the gameplay direction the developers were going for. There were some interesting mechanics put into play like the special power up pick ups which turns you into a dog or a god that shoots projectiles out of his hand. I also like how at times the enemy can roll over to you and take your gun. Everything else the game has to offer feels plain, dull or not something that should of coexist. I'm probably judging it too hard and the game is just not for me but if their goal was to have a simple shoot em up, I would prefer to play painkiller instead.",
            "review_score": "-1"
        },
        {
            "review_text": "level design is broken in this game",
            "review_score": "-1"
        },
        {
            "review_text": "There were no reason to play the original ROTT if you had Doom or Heretic, and there is no reason to play this if you have Shadow Warrior or Painkiller(I advise Black Edition, not HD). Don't buy mediocre games out of nostalgia.",
            "review_score": "-1"
        },
        {
            "review_text": "Game itself is good, funny gameplay, alot of destruction, nice powerups (like dog mode), unfortunately all of this fun of destroying, anihilation, burning enemies, explosions - destroys optymalization...  If youre heading to buy this game hoping 'minimal System Requirements' will be enough to play - forget it, even on highest possible (Ludicrous) it will lag like hell, first boss was terrible to beat - all cos of low fps, another one stage called Bouncing Castle, and unfortunately another frustration when Youre jumping, reaching highest point and then fps are falling to 5 - You fall down, die and Youre also forced to start from checkpoint.  By the way, if not this terrible optymalization, game would be good, not the best, but good.",
            "review_score": "-1"
        },
        {
            "review_text": "Not the remake I expected. Little too superficial ...",
            "review_score": "-1"
        },
        {
            "review_text": "I was really hyped for this game when it came out because I love oldschool shooters. Unfortunately Rise of the Triad is a real disappointment. The levels are bland and there are too many annoying jumping puzzles. The character models look really unpolished. Also the humor in the game is not my cup of tea. The one-liners and briefing texts are just completely unfunny to me. I've played pretty far in the game because I had hopes it would get better. It didn't. For now I've given up on it. It feels more like a chore than fun. You are probably better off playing the classic Rise of the Triad.",
            "review_score": "-1"
        },
        {
            "review_text": "Incredibly buggy to the point where it outweighs everything else that could be said about the game. If this were an early access game in late alpha or early beta, it would be off to a promising start, but this is supposed to be a finished product and it isn't. It isn't anywhere near being. It took me an hour and a half to hit a game breaking bug, and before that I ran into dozens of more minor ones. Even when it isn't breaking, what's there doesn't seem quite finished yet. The sound effects are of inconsistent quality, enemies behave erratically, and the level design isn't as interesting as I'd like it to be. This is theoretically a finished release, though it does still seem to be getting patched which is a very good thing. I want a renaissance of secret filled old school shooters as badly as anyone, but this is too frayed around the edges to fully scratch that itch. If you're a fan of old school shooters, wait for it to be on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "It simply amazes me in this day an age, how people manage to screw up a simple reboot. You already have a fantastic, well respected and loved title, which that lone puts you 50% of the way to your goal, all you need to do now is to include what made that title good, and improve on what wasn't so good. A very simple concept.  However, Rise of the Triad misses this mark by a country mile, and for some reason the development team decided to follow the exact opposite of the formula I listed above. Allow me to explain...  Rise of the Triad was one of those game released on PC in the early 90s, when the home computer field discovered it wasn't going to suffer the same ♥♥♥♥♥♥ inspection as Consoles like Sega and Nintendo were getting over their subject material. It came along the same vein as Blood, Doom 2, and a host of clones such as Dark Forces, when FPS was the name of the game in PC titles. Having an adjustable violence setting was RotT's selling point, saying it was fit for play by children on one end, and chew your enemies into hamburger on the other. But what set it apart from the other titles of the time, was it's bizarre game modes, weapons, and power ups. Made my Apogee who was already worth it's weight in gold by that time, it got a dedicated following while still remaining a cult title for years. The game play was mostly solid, though it did lend itself to a lot of gimmicks like floating platforms and trampolines that shot you around the level which sometimes didn't work as well as it could. However, it made up for this with a menagerie of strange ways to dispatch your foes, including a 'God Mode' that didn't just make you invincible, but enabled you to smite people with a touch.  The reboot manages to remake this title, with absolutely none of the charm of the original, and compounds the broken gimmicks of the first, even adding a few new ones of it's own.   For starters, this games graphical requirements are outrageous. On par with Painkiller Hell and Damnation, this game uses an insane amount of PC power for a game that really doesn't need it. The backgrounds are rather dull, and the character models aren't anything to write home about, so I'm befuddled at the disregard for any kind of resource streamlining. This game also uses motion blur that does more to make you sea sick than enhance game play by any means, and until recently wasn't possible to toggle off. Secondly, the dialog, flavor text, descriptions, and spoken parts are horribly dated. Riddled with the worst in 90's humor, the game gives you the feeling they went back to 1996 and drafted the dialog writers of Duke Nukem 3D. 'All around bad ♥♥♥.' is not a clever description of a character in 2014.The enemies resemble WWII German solders and Occupied Berlin guards, once again reinforcing the idea that it's okay to kill in unspeakable ways, so long as the people resemble Germans.  Lastly, you will die.... a lot. Not because the game is actually difficult, but because the the aiming mechanic for the enemies is hopelessly broken. You will constantly be shot by mobs that you can not see, let alone figure out where their fire is coming from. And, exactly like the original the platforms and trampoline mechanics are wonky and unreliable.   So in all, save your money and go by the Throw Back Pack, that includes both original Triad games. At least those games troubles were due to the limitations of technology at the time, rather than just poor vision and terrible direction.",
            "review_score": "-1"
        },
        {
            "review_text": "If you were a fan of the original, maybe you'll like it. If not, you probably won't. Simple as.",
            "review_score": "-1"
        },
        {
            "review_text": "If you were a fan of the original, maybe you'll like it. If not, you probably won't. Simple as.",
            "review_score": "-1"
        },
        {
            "review_text": "The original Rise of the Triad was a minor mid-90s FPS which pales in comparison to the true classics of that era: the likes of Doom II, Duke Nukem 3D, and Shadow Warrior. It was built on the already-elderly Wolfenstein 3D engine and represented an abortive sequel to that game.  This remake was clearly made with a genuine love of the original game which is odd, given how thoroughly mediocre the '94 version was and remains. What it was not made with is a commitment to quality control or a clear design focus. While a huge amount of effort is evident in the visuals, the AI is truly atrocious, the weapon selection is unvaried and dull, and the gameplay carbon-copies the very worst of 1990s FPS design. Worse still, the game is unstable, poorly optimised and buggy: levels full of spinning blades are boring, but they also aren't even a challenge when the hit detection is so broken that you can frequently just glide right by or through them.  If Rise of the Triad looks fun to you and if you haven't already, then do yourself a favour and seek out the real classics of '90s shooting. Buy Doom II, fire up a source port and play some of the incredible maps that have emerged in recent years; or, grab yourself a copy of Flying Wild Hog's infinitely superior Shadow Warrior reboot. A great game remade well is a far better investment than a mediocre one remade lazily.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this game based on nostalgic memories of the original. I think my money would have been better spent on the original. This new version is not very enjoyable, choppy frame rate even on low settings using 9800gtx and 3.4 ghz i7. very difficult gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a hard review to give, because I wanted to love this game so much. I have to say this from the get go, the gameplay itself is fantastic, however there are things that stop me from recommending it.  Regardless of what the developers say, multiplayer is for all intents and purposes dead. Three servers online, all with zero players. Group chat has 4 idle participants. Not sure how their Saturday night events are but I'm not one for waiting a whole week to play a game for a couple hours. There is singleplayer but the main focus of the game was in the multiplayer, singleplayer is essentially multiplayer with AI.  Developer also fails to deleliver what they say; we were promsied features such as proper Eyefinity/Surround support and over a year later the game still doesn't work with these enabled.  LIke I said though, the game itself is great, when you can find people to play with. Fast paced and a lot of fun, however I think the genre itself is dying, so it's not really the games fault. Graphics are great, TONS of settings you can tweak. A few minor problems such as the developer console only being available while in a match, minor things like that, but overall the gameplay is very fun.  TL;DR - Fun game while it lived but no one plays it, would not recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "This game tought me a lesson. Never listen to BEN.",
            "review_score": "-1"
        },
        {
            "review_text": "It's bad.",
            "review_score": "-1"
        },
        {
            "review_text": "The movement sucks! The platforming sucks! The level design sucks!",
            "review_score": "-1"
        },
        {
            "review_text": "If you are looking for some single player shooter. DO NOT buy this game. First of all, textures are very glitchy and i had to restart checkpoints cause of all the texture stucking. Second, inbetween checkpoints you do have a quick save/loads BUT often when you are trying to quick load the game its crushing and you are loosing the saves. Third, AI is incredibly stupid, very often you can shoot enemies from afar and they will not even bother, not to mention that they will stuck into the textures too. Most of the Boss fights comes like this: 'I see the Boss, i start to fight the Boss, i am runing/dodging Bosses attacks. Boss stuck into the texture. I am shooting the Boss from the safe spot to the death. The End'. And now comes the final part that was killing me all the time. The developers wanted to bring back old school 'fast running hero' game. Your character WILL be very fast and agile (despite that until the final chapters you can not dodge enemies bullets and all your fast running is a waste) and then the developers deside to implement into the game a 'MUST go through' platforming challenges! Just think, YOU HAVE TO go through all the platforming with character that moves with the speed of a rocket! I can understand the appeal of a 3D platforming, what i can not understand is why the hell you want to try and jump on 2 cm platform builded 5 story height ladder with a Tazmanian devil?! The character is too fast and control unresponsive for such a challenges (BTW i took the most tanky and slow character). And for the 'Coup de grace' when you are trying those challenges you will quickly realize that most of the jump platforms are bugged and not doing its job very well :D  DO NOT buy this game at least until textures, platforming and AI will be fixed. Period.",
            "review_score": "-1"
        },
        {
            "review_text": "Absolute rubbish.   My full review is available here:         YouTube™ Video:  Rise of the Triad (2013) - PC - Review&nbsp;",
            "review_score": "-1"
        },
        {
            "review_text": "Is this remake truly a successor of the original? well for the most part...yes it is.Make no mistake about it if you didn't like the original you probably won't like the remake.I felt it was very polished.I don't recommend this game because I couldn't enjoy it from it's faults.The audio was glitchy and the overall movement was skipping framerates more than Max Headroom's digital stutter.I tried adjusting the resolution with very minor improvement...it was a waste of money on my end.",
            "review_score": "-1"
        },
        {
            "review_text": "Rise of the Triad, the original, never amounted to much - sure it had some features not found in other FPS games of it's era, but it really didn't garner much more than a niche fan base. This remake will likely only accomplish the same minimal popularity.   If you were a fan of the original, the devs did a decent job of an update - however, that's about it. Nothing here really feels new or fresh to the FPS genre. This is just a simple run and gun FPS - nothing less, nothing more. There's a decent amount of gore in it - but it grows tiresome. The game also feels overly difficult for all the wrong reasons - oftentimes I'd get confused which way the game wanted me to go, or I'd be getting shot from a distance and it was difficult to gauge where. And there is humour in the game. Actually, let me rephrase that. And there is 'humour' in the game. You can tell the dev's have about the same level of wit as a college freshman - needless to say, I rarely even cracked a smile.   Some notes: 1) The 360 controller works, but doesn't work very well - and there are no means of adjusting the thumbstick sensitivity or modifying the buttons. I personally prefer playing games with a controller - so this was a thumbs down for me. 2) I haven't experienced any of the 'bugs' mentioned by other players - I don't doubt they exist, but it may not be as common as reported. 3) The games icon (some guys 'O' face) is just stupid - you can tell the dev's wanted to find the most absurd image, almost to slap the people purchasing their game in the face. 4) Apogee's Twitter support is a joke - whoever is running it acts like a little kid who has a tantrum if you disagree or make any form of criticism. If someone at Apogee reads this - fire the idiot, he's not doing your company any good!  Buy this game if: A) You absolutely adored the original B) You're a fan of run and gun FPS games with minimal substance C) You get it bundled in one of the various 'Indie Bundles' available (this is how I purchased it). Otherwise, don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "Even the trailer has framerate issues.",
            "review_score": "-1"
        },
        {
            "review_text": "While the retro-style direct action promise of this Rise of the Triad re-make seems fun at first, the game shows that it's shallow gameplay and unimaginative levels and enemies get boring really quickly. Multiplayer does not eliviate this as the gameplay is waaay to fast and imprecise to get any serious fun out of it. Plus there's hardly anyone there to play it with.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has severe performance issues and looks like they aren't patching it anymore, unless your computer is so uber that it can overcome the bad engine of this game, I recommend you to stay away.",
            "review_score": "-1"
        },
        {
            "review_text": "Nothing at all like the original. Kinda clunky.",
            "review_score": "-1"
        },
        {
            "review_text": "I see what they are trying to do. It isn't working. This game looks and plays like crap. Unless it is on sale and you have some major nastalgia about the old ROTT game you would do best to avoid this one.",
            "review_score": "-1"
        },
        {
            "review_text": "piece of ♥♥♥♥ 0/10 ♥♥♥♥ e2l2",
            "review_score": "-1"
        },
        {
            "review_text": "You can chew a ♥♥♥♥♥♥ and have more fun with this.",
            "review_score": "-1"
        },
        {
            "review_text": "It is not really a review, it's a warning:  This game is extremely buggy!!!  Freeze and crash are frequent, moreover my gamefile have just disappeared.  Done! ------------------------  Ce n'est pas vraiment une critique, il s'agit d'un avertissement:  Ce jeu est très buggé!!!  Le jeu gel et plante très souvent, de plus ma partie s'est effacée.  Fin de l'avertissement!",
            "review_score": "-1"
        },
        {
            "review_text": "Short version: Awful.  Long version: On my spectrum of crappy shooters it's worse than Command &amp; Conquer: Renegade and slightly better than Serious Sam 3.  Technical: Only one save, occasionally crashes and frequently changes the difficulty level without permission. Horrendous bouts of lag. E4M2 respawns every enemy in the map when you quickload. It took me 45 minutes to get out of the starting hallway. Not even joking. 3/10  Graphics: Passable, but so is a kidney stone.  AI: Endless waves of generic looking Not-Nazis, robots and sorcerers. Human enemies frequently rush you then glitch backwards ten feet. Since they blend seemlessly with the brownish environment you won't know who's shooting at you most of the time. 0/10  Weapons: You move faster while using ironsights. Think about that. Also: What's with all the rocket launcher variations? I only need ONE to get the job done. That's why it's a rocket launcher. Bullet weapons have unlimited ammo and never need to be reloaded. Yet, pressing R *initiates a reload animation*. 0/10  Items: You can turn into a dog and bite guys in the nuts, because it was in the original. Other 'power-ups' reverse your controls and turn you into a pinball, or make everything psychadelic. 3/10  Level Design: You find keys. You open doors. You shoot bad guys. Traps weren't cool in 1995 and they make even less sense in 2014. 0/10  Story: You are part of a spec-ops team sent to infiltrate a make-believe island off the coast of Los Angeles that has been appropriated by a mysterious terrorist cult for nefarious purposes. In other words, there is no story. 0/10  Humor: 'Oh, I get it, you only THINK you're John Woo.' 0/10  Characters: You get to pick from four caricatures who fart frequently and utter ridiculous 'catch-phrases' during gameplay. How this pays homage to the original is anyone's guess. Each player has individual strengths, ranging from running faster, to running A LOT faster. Seriously, that's it. Since the default movement speed is already ludicrous, this was a cryptic design decision. 0/10  Music: You can pick between the original remastered tracks or modern heavy-metal renditions of said tracks, and they both sound awesome. 10/10  Gameplay: This is a game that is trying to be 'old-school'. Unfortunately, it's not old, it was made in 2012, so it just comes off as 'bad-school'. It's energy is a 10. Had the developers showed some restraint and cranked it back to 7, they could have had a fun, modestly-paced Return to Castle Wolfenstein clone. Instead, the character speed is so fast and the mouse sensitivity so amped it's hard to hit even basic enemies. This also makes it almost impossible to make precision jumps, which is poison considering most of the secrets and puzzles involve moving platforms and jump pads. 3/10  Replayability: The final boss is so tedious I actually opted to nuke L.A. and get the 'bad' ending just so I wouldn't have to fight him. Lastly: Every time you die-- and you will die often, cheaply-- the mission-briefing guy tells you how much you suck. Who is this person? How does he know what I'm doing? And why should I care what he thinks? 0/10  Overall: This game is so bad it made me want to cut myself. There is so little substance beyond endless gore and depravity that I actually sympathized with politicians who try to ban violent video games. The reason modern shooters tend to include regenerating health, cover systems and checkpoints isn't because gaming is dumbing down, it's because those things WORK.",
            "review_score": "-1"
        },
        {
            "review_text": "As a Quake and a Doom fan, this game was terrible. This felt like a ♥♥♥♥♥♥ version of Duke Nukem. Im not even kidding you. The Voice acting was trash. The gimmicks included in this game were bad. Holy crap! this whole game is bad. Reading others reviews about how good this game is. Take the game out of your ♥♥♥. This game sucked! And this coming from someone who has played quake for over 18 years. So... Yea... Game is terrible.",
            "review_score": "-1"
        },
        {
            "review_text": "I think this is the worst joke i ever seen. BAD.BAD and BAD! Ugly like hell, level design looks like a drunk skurriel's womit, animations better done on commodore 64 in the 80's, music and effects bubbling from the toilet,  No! 0 of 10 ! seriously !  ps.: RUN! if anybody try to give you a copy of this piece of s... ( even for free !!! )  s.h.a.m.e...",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know what they did to the Unreal engine but this game plays like ♥♥♥ on a stick. Worst $11.24 I've ever spent.",
            "review_score": "-1"
        },
        {
            "review_text": "I thought i was paying 16.99 for an fps action shooter.... I DIDN'T WANT TO PAY 16.99 FOR A ♥♥♥♥N PLATFORMER AND A PARKOUR JUMPER WITH BROKEN MECHANICS. If i wanted that i would have gone and played every other game out there right now.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this game.  This game doesn't even run. It won't get past the launcher unless you launch it directly from the install folder rather than steam.  Also the audio is completely ♥♥♥♥ed full of crackles and static.  First level won't load.  ♥♥♥♥ this game and ♥♥♥♥ these developers for using Nvidia SHITworks to make a ♥♥♥♥ game that doesn't run.  Uninstalled with literally zero seconds of playtime.  ♥♥♥♥ this game, ♥♥♥♥ Interceptor Entertainment. Not worth your time unless you want to get frustrated troubleshooting a 3 year old title.",
            "review_score": "-1"
        },
        {
            "review_text": "It's so bad.",
            "review_score": "-1"
        },
        {
            "review_text": "An unfinished, untested mess of a generic low budget shooter #252346546. Avoid if at all possible.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like this silly old-school arcade first-person shooter, and at times it let me. The performance was all over the place even after I've spent a considerable amount of time tweaking graphics options and .ini files. But my main gripe is the same that a lot of other people that left negative reviews have - it's how buggy this game is. It played mostly fine for the first two levels and I've quite enjoyed my time with it. but on the third level trying to load a quicksave has always led to a crash. I tried both a 32-bit and a 64-bit executables, and the result was always the same - a crash. And after trying to beat the level a couple of times and having to start it over from the beginning each time after dying, I gave up.  It's a shame, really, there's a refreshingly fast-paced, silly and gory FPS hidden somewhere under the numerous technical problems.",
            "review_score": "-1"
        }
    ]
}