{
    "app_id": 217270,
    "name": "Karateka",
    "release_date": "2012-12-03",
    "developer": [
        "Liquid Entertainment"
    ],
    "publisher": [
        "DotEmu"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Fighting"
    ],
    "achievements": 12,
    "positive_ratings": 127,
    "negative_ratings": 55,
    "price": 2.89,
    "description": "From PRINCE OF PERSIA creator Jordan Mechner, the original side-scrolling karate classic comes to Steam with art by Jeff Matsuda (The Batman) and music by Grammy-winning composer Christopher Tin (CIVILIZATION IV).",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/217270/header.jpg?t=1447356330",
    "minimum_requirements": "OS:Win XP, Win 7, Vista, Win 8 Processor:1.5GHz dual-core Memory:1000 MB RAM Graphics:ATI X1800 or better DirectX®:9.0c Hard Drive:1000 MB HD space Sound:44kHz stereo Additional:Runs on Unreal Engine 3",
    "recommended_requirements": "OS:Win 7 Memory:2000 MB RAM Graphics:ATI X1800 or better DirectX®:9.0c Hard Drive:1500 MB HD space Additional:Runs on Unreal Engine 3",
    "reviews": [
        {
            "review_text": "3/10  An interesting concept, squandered by uninteresting gameplay and a disappointing lack of content.  (+) Interesting concept (+) Unique approach to difficulty  (-) Basically just one giant QTE (-) Pointlessly Repetitive (-) Far too short (can be completed in less than an hour)",
            "review_score": "-1"
        },
        {
            "review_text": "Karateka may seem somewhat familiar if your memory goes as far back as Commodore 64 or even earlier computers and your mind would not be playing tricks on you for a change because it is, in fact, a remake of an old namesake classic. Besides the obvious graphical facelift, remake also sports a different rhythm-centric combat system, actual health to make it more bearable and expanded story where you get to play as three characters in succession after previous one falls in his effort to rescue the princess from the clutches of evil martial arts master Akuma. It's a short game lasting barely 30 minutes or so if you don't skip cutscenes, but some achievements will have you replaying it couple of times if you want to get them all for the sake of completion.   Would I recommend Karateka? If you know what you're getting yourself into and can accept a short game for what you paid for it, sure. Just don't lose your cool if you keep getting hit for that one perfect achievement. I know I did.",
            "review_score": "1"
        },
        {
            "review_text": "1.) If you didn't play this 30 years ago.  2.) Do not understand Martial Arts.  You'll HATE IT. ~ Don't even waste your time... Go play Something else.  =====================================================  OG. ~ Loved the Apple IIe version. Orange or Green. Total Cult program.  Had to Bow. Couldn't RUN. Had to plan each attack meticulously. And it was the coolest thing ever... Baap, Baaap, Bap, Bap, Baaap, POW! ...  You had to move in and out. It was a total Martial Arts Dance. ~ True to the Core at the most BASIC =) level.   Loved the original to levels unknown. It was my first ever game. Early 80's. The 7 year olds had it on 5 1/4' floppy. And it was worth GOLD. 3rd Grade. Smuggled into Computer Class.  ~  5 Stars. 10/10   They NAILED IT!  =') ~ Almost makes me cry. THANK YOU! For bringing back a Dream come True. There is only one thing any true Karateka fan cares about: 'How does it FEEL?' Ans: IT'S PERFECT! xD~   KUDOS!!!  Die-hard. Everytime we had mandatory 'computer class' ;D Those who knew finished their bs assignment and then loaded it up. ;D~ Beat the boss a couple times but never saved the girl... Never knew there was a BOW key. Heartbreak. =')  ~ The cool kids hinted about it.  *Watch out for the Bird! =) O.G.! PERFECT! And the commercial is ... Beyond Priceless. ~ No one who wasn't around would understand it...  For those who can appreciate, watch out for the bird and  don't forget to BOW! ;D~ Nit-pick all you want: (O.G.)  I read reviews from people with og knowledge ripped it hard... Whaaatever. HATERS. xD! Lucky you got anything.  Seriously...  Flawless. Dream come True.    Thanks for Making It.  GOOD LOOKING OUT! =) Happy Camper. ~ Charlie Brown.",
            "review_score": "1"
        },
        {
            "review_text": "It's very very nearly... a game of nothing but quicktime events. So yeah, it sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, it's pretty and plays somewhat similarly to the original. I'm not really sure why it needed to be made, because seeing such an old game done up in such a fancy way is really a reminder of how far things have come. Playing the original as it was has nostalgia value, and this sort of does too, in a weird way. It's familiar but not at the same time. I think I have better feelings toward it having gotten it as part of a bundle than I would if I'd paid full price for it, as much as I like the people involved in making it. They also kind of half-♥♥♥♥♥ the PC version, but what are you going to do?",
            "review_score": "1"
        },
        {
            "review_text": "its a very good game",
            "review_score": "1"
        },
        {
            "review_text": "It's style might not be for everyone, but I really enjoy it! It's not a key mashing, fighting game. It's a game about timing and reflex much like real martial arts. You wait for audio and visual ques and then defend, and attack.  You fight through different enemies, stages, all while trying to save your lady!  You get 3 different characters to play. You start out with one, when you die, the next one comes up until you either win or all 3 characters die.",
            "review_score": "1"
        },
        {
            "review_text": "The cool thing about Karetaka is that it's difficulty is all on you, and I like that. It's up to the player if they feel they are intimidated by the results of their actions, and I like that about the game, and in that way, it doesn't dissuade you from 'losing.' I was satisfied just beating the game, but to others they might want the original 'prince' to save her from her plight.  The combat is fun, rewards you for watching your opponent, like in real martial arts.  Word of warning: I beat this game in 38 minutes, so if that kind of thing bothers you (games being too short) then I wouldn't consider getting this game.",
            "review_score": "1"
        },
        {
            "review_text": "For once, the meta score is acurate. Controls are awful unless you have a 360 controller, but the gameplay seems like it would be better on a tablet or phone. Music and graphics are very pretty though. I've also read that it takes next to no time to beat, if that is the case I'm sure I'll finish it eventually. ~PR0XIDIAN",
            "review_score": "1"
        },
        {
            "review_text": "I was a fan of the classic Karateka in the arcade so I was excited about this.  It's not exactly what I expected but I like this game. I wouldn't want to play lots of games like this but this one is a good one.",
            "review_score": "1"
        }
    ]
}