{
    "app_id": 217690,
    "name": "Anna - Extended Edition",
    "release_date": "2013-04-12",
    "developer": [
        "Dreampainters"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Horror",
        "Adventure",
        "Indie"
    ],
    "achievements": 35,
    "positive_ratings": 878,
    "negative_ratings": 489,
    "price": 7.99,
    "description": "Anna - Extended Edition has been given an overhaul based on the feedback of the thousands of players of the original Anna.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/217690/header.jpg?t=1447356368",
    "minimum_requirements": "OS: Windows XP Processor: Dual Core Memory: 2 GB RAM Graphics: Shader model 3 graphic card DirectX®: 9.0c Hard Drive: 850 MB HD space Sound: Stereo sound card",
    "recommended_requirements": "OS: Windows 7 Processor: Quad Core Memory: 4 GB RAM Graphics: Nvidia series 3/4/5 or ATI HD series DirectX®: 9.0c Hard Drive: 850 MB HD space Sound: 5.1/7.1 sound card",
    "reviews": [
        {
            "review_text": "Game is ok, but the controls feel like they are from 1996. Also requires some lame Kalypso(sp?) account before you can play.... You must also agree to some lengthy TOS when you sign up too, and they try to 'opt-in' spamming you on their mailng list. until they remove that crap I can't recommend buying it on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Could be a good game, but it's just an annoying point and click fest, most of the times you'll feel like exploring every inch of the given map to find all the needed items, and then just trying to use'em in every interactable place... but that's just the nutshell of how bad it is, my main concerns are: 1. HORRIBLE CONTROLS, one of the worst I've ever seen, the camera is worst than if you were drunk playing anything else, pretty bad menu interaction, no shortcuts, just awful. 2. Pretty bad programmed game, just happens that my pc is good enough to run way better graphics games, but on this one it simply lags for no reason, and I doubt the devs will do anything about it since its problably just a dead game in their hands by now, and no, I don't wanna waste hours of my time to solve a problem that shouldn't be my own, devs should be concerned about it, not me/us. 3. Talking about the point and click fest, it sounds so random, you do wanna try to use your head and think how the puzzles should be solved, but no, you better just try most of the things randomly, or you WILL get stuck, just in the 2nd part of the game (this isn't a spoiler at all, it's a pretty short example) when I entered the house, you are supposed to remove a stuck knife's blade out of a table (among other things), so, I have a bunch of objects I collected that I have no idea where they gonna work at all, I have an axe, a huge blade, blablabla, no, they won't remove the knife's blade from the table, but the TREE BRENCH that I got earlier, of course, THIS ONE removes the knife's blade.... that was enough for me, you see? you want to use your head, but you better just randomly try every object you got, oh and be sure to look in every corner, every small inch, because if you missed something, you can be stuck having no idea what to do, no fun at all, I'm sorry, and if you wanna know, I love puzzle games, and I played alot of'em, Zelda, Penumbra, Amnesia, Resident Evil, any puzzle game you guess, is 10x better than this one.",
            "review_score": "-1"
        },
        {
            "review_text": "I couldn't help but to fall in love with Anna.  Eventually that made me do some horrible things, like :   - rise the volume of my computer - disturb my neighbours with creepy sounds, like babies crying - skip dinner - stay awake later at night  - look for pagan lore on the internet - behave strangely - neglect my beloved - write a review...   Well... More seriously, the game has everything you'll be looking for in a horror adventure game. It's at the same time creepy and beautiful, disturbing and enchanting. Both story and atmosphere are very nice, and all we could wish would be for the game to last more longer. But honesty, as I needed a few playthrough to make it to the end, I can't say it's too short for the price I've putted into this.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a huge dissapointment to me. I usually like point-and-click games and am also a fan of horror games, so I assumed that Anna would be a great fit. Boy, was I wrong. While the game looks pretty and you can feel that is desperetly tries to have a deep, thrilling story, it fails utterly at it. The story is predictable and one that has been told over and over again, in better and more engaging ways. The 'horror' is hardly able to amount to slight tension and to top it all off, the music and sound effect is horribly annoying;    After 5 minutes in the first room, I wanted to kill the person I was supposed to be reaching    and the looping music was driving me mad. In addition to the bad sound effect/music and a dull story, you have to battle with (often) ridicilous and illogical puzzles and sub-par controls, and to top it all of, you have to log into your kalypso account on startup, of course in addition to being logged on steam. The only good side I can say about this game is that the graphics and lighting are both fine. In conclusion, I would say that taking a walk in a thunderstorm with no umbrella, while having to go to the toilet is slightly more appealing to me than to play this game.        Bad story    Bad puzzle    Bad controls     Bad launcer    Bad experince  [/b]  [/list]",
            "review_score": "-1"
        },
        {
            "review_text": "The atmosphere is well done but thats about the only thing it does well. The controls and interface are clunky and annoying to use and the story is never that well explained. Also the base game is 2 hours. Don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "This may have mixed reviews, and quite frankly I do understand why. However, I found this game to be captivating and beautiful and so utterly perplexing that I just cannot help but love the thing. Maybe it is the crazy Alice in me who laughs at the chaos others find so distressing. I would recommend for the hair raising storyline and haunting soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Anna - Extended Edition was one of the earlier games that I got on steam due to it being in a Humble Bundle years ago before I started to collect steam games. Due to the earliness of me getting the game, I am writing this review years after I played it. However, I do remember quite a bit about this game and my hours played do not include the offline hours which would total to around 2 or 3 or 4 more.  At the time, I remember that Anna had some decently nice looking graphics and okay movement (at least on the outside of the house). However, the game was quite annoying in finding out what to do next as it didn't really give me lots of hints as to where and what. I also did not like the item usage controls but that wasn't too important. As I figured out what to do in Anna and started to progress through the story (which wasn't too straightfoward at all), I never really felt the scare which I expected that I might feel. Sure some parts were dark and creepy, but Anna never allowed me to feel the scare that games like Dead Space did.  Overall, if you enjoy progressing through a story and playing through some creepy situations, go with Anna. However, unless it is on sale, I would not recommend this game.  Rating: 6.4/10 Recommend: on 75% sale or better only",
            "review_score": "-1"
        },
        {
            "review_text": "Boring pretentious garbage. The story is atrocious, the gameplay is clunky and horrible. This game does not have any redeeming qualities, avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks good and all, but it makes Tetris feel like a heart-pounding hyperspeed thrill ride in comparison. Also, how to strengthen the atmosphere of a 'dream'? Make puzzles with intuition-defying, random solutions. Brilliant. Wait, the opposite of that.",
            "review_score": "-1"
        },
        {
            "review_text": "These puzzles make no sense, and any kind of pretense of it being scary is one big fat joke.",
            "review_score": "-1"
        },
        {
            "review_text": "This first person puzzle game is very poorly translated to English, and although it is apparently a horror game, it fails to do so on many levels. The story leads you on into one anti-climactic situation after another. When you take bad writing and transform it into a game... it is still going to be a bad game.",
            "review_score": "-1"
        },
        {
            "review_text": "While I never review games I didn’t clear, whenever in a point and click adventure game like Anna the very first puzzle you come across requires you to check a walkthrough on the Internet you get a very clear picture of the things to come",
            "review_score": "-1"
        },
        {
            "review_text": "Anna, at least I found, is a pretty confusing mess of a game that doesn’t really know what it is trying to do. At first, it seems like a very cut-and-dry Unity based adventure game (think Gone Home, or Slenderman for its control scheme/layout/control feel). As supposed to those games, however, there is a much lighter tone (at least at first), but once you pass the first true puzzle of the game, the whole mood changes. Gone is the bright, beautiful scenery, replaced with a drab, plain shack essentially. Once in the new setting, more horror based elements start to present them. These aren’t necessarily fear-inducing (which is what I believe this style of game is commonly used for), instead it just has an overall creepy vibe. The creepy vibe is sometimes subdued by the absurdity of the scares at some points (“walk into a room, ooooh there’s blood on the wall! Isn’t that scary?!”). Sometimes, they do have a really effective moment (there is one puzzle I can recall upon completion, a floating mask will follow you around, with the sounds of muffled breathing coming from behind you until you turn around), but these moments are far and few between, and not enough to set the mood.   Although these horror elements are going on, there is very soft and relaxing guitar music playing, which partially breaks the immersion with the game. There is also never really any sense of danger (for one, you can’t die, but this is common in these sorts of games). I found there was always just a one off scare, then more relaxing music and adventure-esque puzzles (The first puzzle involves putting two pieces of a mirror shard in an eye hole in the wall, using a pine cone to make an iris, burning said pinecone to “burn the left side of the door to reveal a keyhole (I never gathered this occurred when playing)”, then putting out the eye with a filled canteen).   In terms of the story, it follows a person being drawn to the cabin by a mysterious voice to be revealed as “Anna.” Exploring through the game shows that she was an ancient goddess that would lure men into worshiping her, then killing for her pleasure (very similar in narrative to the ancient cult of Diana of Italian mythos). In terms of the endings, they tend to go against the norm that each ending gets progressively worse and worse for the main character as it goes on (the happier ending is the easiest).  In conclusion, the game seems to be slightly confused in terms of what it is trying to do. The story was very horror-esque, but at no point did it really feel like it was truly immersive into this role. The music (although nice) didn’t really fit into this game, as well as the different scare tatics implemented. Overall, I cannot recommend this game for many. If you are a fan of much slower horror games, maybe give this a play (it’s not very long either, clocking in at about 3-4 hours), but as a general note, I cannot recommend the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I feel bad rating down an indie game, but I think it's appropriate in this case. I suppose the best way to describe it is to simply treat it like a sandbox horror and not a puzzle game.  Firstly I would like to establish that this game DOES have some VERY good moments (creepy poltergeist moments when you run affoul some of the 'spooks' like the wooden mannequins). But overall the game isn't actually remotely scary at all.  That aside, the gameplay is awful. The interface is very clumsty and requires a ridiculous amount of precision. It is supposed to be a 'puzzle' game, but the puzzles are completely nonsensical. There are little to no clues for solving most of them, you just spam trial-and-error with every silly combination of materials until something happens, and then you must repeat it a number of times just to get one puzzle done (and believe me, a lot of the combinations are the most inane and arbitrary you could imagine- like sticking a pinecone into a mirror and lighting it on fire to open a nearby door- and that's the easiest one). Basically, you don't 'Solve' anything, you're just supposed to 'know the answer'. Furthermore, after playing through the game, you just get the 'bad' ending, because you didn't solve the 'other puzzle'. After watching the solution played on youtube (the guy spent over an hour randomly punching in combinations until they fit together), I decided it wasn't remotely worth it and uninstalled it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game scares the ♥♥♥♥ out of you after you get upstairs.",
            "review_score": "1"
        },
        {
            "review_text": "Before I played this game I had no idea how in the world to perform strange, batshit crazy occult rituals.  Sometimes I wonder if they were created exactly how I learned how to do them... By acting like a ♥♥♥♥♥♥ and doing random ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, this is not puzzle game, but low budget first person point&amp;click adventure (a very typical one), with clunky controls. The main problem is that this adventure takes every textbook design aspect, even the bad ones and just applies them with very little thought. By the first 15minutes of the game you will be in your inventory combining stuff with a stuff, running around the house to figure out what to click next, because you just missed something. Point&amp;click adventures without logic behind their actions usually end up as a very frustrating experience and so does this game. I could possibly forgive this problem (because I do like adventures), but as you progress in the game it gets more and more tedious. Inventory gets bigger, more rooms to visit... so many illogical possibilities open up.  The game also wants to be horror experience and so is trying to be like (for example) Amnesia with its 'sanity meter', but in the end it forces you to miss a lot of the cool and 'scary' stuff around you, because the game is built upon events that will spring around you and so when you stop and look at some of it, you will lose a portion of sanity. Sometime you will even lose sanity seemingly by itself... making you to even more to focus on the running around blind to the scenes around you. Do you hear a scary sound? Quickly  run  walk away, it might be something cool for a change.  On the other hand, the story seems to be interesting even if the delivery is bit of a mess. Level design is very fine, with bits and pieces done wrong. Music is very good, and as voice acting goes, it will not offend you even though script is totally forgettable.  Simply put, the game is not well designed. It has very pesky and completely unnecessary DRM. Technical aspects of the game have their share of problems (I guess Unity engine implementation done wrong) and to this day my Linux version still does not work properly, for some reason I could only walk around in the garden.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed it, but I really wouldn't recommend it to anyone. Finished the majority of the game in about 5 hours. The story was painfully predictable, a problem I run into with games, tv, and movies. Recycled ideas.",
            "review_score": "-1"
        },
        {
            "review_text": "This would be a good adventure: thrilling setting, nicely told story, well-placed music and effects. Often enough, i felt scared for a moment or two. But there are two things that annoyed me:  - A technical problem, maybe only on Linux, maybe only with Intel IrisPro5200: whenever there is a 'cut-scene' or some kind of fading effect, it takes forever. I literally had to wait for minutes to be able to continue playing. It's even impossible to access the menu to load a save or exit the game. - The sanity meter dropped too fast and the game was over before i could fully explore the house and solve the riddles. Sometimes there was the 'scary' moments when the red eye was flashing a couple of times, but i couldn't run away, because the game held me captive in one of these 'cut-scenes'. I have developed a strong dislike for adventure games where you can lose health but not regain it.  Otherwise the game is worth playing.",
            "review_score": "-1"
        },
        {
            "review_text": "The Extended Edition just doesn't work. I have to go through the dumb Kalypso launcher, and then the game just crashes on the other end. Although the original edition works perfectly, you are paying for twice as much content as you are promised.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥ (and creepy) game. DO NOT BUY IT!",
            "review_score": "-1"
        },
        {
            "review_text": "This game was pretty boring, if you like these sort of find and click items in a random house then you may enjoy it. Otherwise dont bother playing it. Its not scary or very interesting. Graphics are ok and the story is average at best.",
            "review_score": "-1"
        },
        {
            "review_text": "Interesting concept for a game, and mildly interesting story.  Can't recommend this game tho as the interface is terrible, the puzzles illogical, it's overall very buggy, and the frame-rate is bad even on good hardware. The more subtle game mechanics (sanity, etc) are not very clear and simply doing a few things out of order (for which there is no indication you are doing so), can change the outcome.",
            "review_score": "-1"
        },
        {
            "review_text": "I want my money back!  There is so much wrong with this game. It's not even funny. Honestly, I dont't even know where to start. How about the extra account you need to play this game? Are you kidding me? From the ui, the controls, the graphics, the sound design, gameplay mechanics, story telling etc. Everything is a huge mess. Im playing games since the golden age of atari and the like and came across some serious ♥♥♥♥♥♥♥t in video gaming history. Man, this is 2014 - and ♥♥♥♥♥♥ games are still beeing made. Kalypso Media? Never again! Ever!",
            "review_score": "-1"
        },
        {
            "review_text": "I'll try to write a good review about Anna, pretty much like how this game TRIES to be a good game. In fact, 'trying' is the whole theme of this game: It's a game that TRIES to be clever. It's a game that TRIES to be scary. It's a game that TRIES to offer a well-balanced challenge. It's a game that TRIES to be immersive. Sadly, it fails, leaving this Amnesia-♥♥♥-point-and-click adventure knockoff a title best left for the dust mites.",
            "review_score": "-1"
        },
        {
            "review_text": "Was cool for one playthrough with a walkthrough, thats about it",
            "review_score": "-1"
        },
        {
            "review_text": "I like the horror elements of the game, the graphics, the music, the atmosphere, and the story. The game is very immersive and there are parts of the game that were pretty scary.  But the inventory management system is a constant pain in the butt, often requiring four clicks in the items menu just to see if something works. The puzzles make absolutely no sense and as a result leave the player feeling frustrated and annoyed instead of terrified. Furthermore the incomprehensible puzzles slow your progress down to a crawl. When you're not searching the cabin inch by inch for a needed item, you're asking yourself 'how in the hell is that supposed to work?'  I recommend just looking up a video walkthrough and just watching that instead. You'll get the story and experience of Anna without the headaches, frustration, and guesswork needed to complete this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I barely gave the game a chance and I never will again... Very buggy and sloppy.  Complete waste of $10.",
            "review_score": "-1"
        },
        {
            "review_text": "Nice little horror game, you have to solve a number of puzzles to figure out how to progress.. overall, I like it. It has some creepy moments and scary parts and it requires you to think about things and find a solution.",
            "review_score": "1"
        },
        {
            "review_text": "This is a puzzle game, so don't expect something too easy as Portal that you can end in 30 mins since it's easy as..  Anyway, Anna is the perfect definition of the mind blowing in all terms. The graphics are pretty good, the story is brilliant and the puzzles awesome. (The puzzles are not senseless, it's all wrote in the books.) This is recommended for the puzzle solving lovers.",
            "review_score": "1"
        },
        {
            "review_text": "Started playing this game....left the house within minutes, it now has its own section heading in my steam library....it's under HELL NO! subheading, I don't believe I will ever venture into this game territory again just from shear wimpiness, I don't do scary games, i thought this was more of a mystery game T.T i was so wrong.  Would highly reccommend to any 'scary game' fans of the point and click kind of genre but other than that I can't really leave any useful feedback T.T  I'm gonna go play happy smily bunnies or something T.T",
            "review_score": "1"
        },
        {
            "review_text": "Fun and interesting, but wasn't scary at all-- largely due to the fact that i had to refer to a walkthrough 99% of the time.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It's simple and truly scary, that's what makes it beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "I played less than 30 minutes of this game because I couldn't handle how random puzzles were. For example, to open a door, you have to find a couple gem stones by doing ridiculous things like pushing rocks into a river. After you've found the two gems, you have to place them in a slot above a door, light them on fire, then extinguish them with water before the door will open. Absolutely ridiculous.",
            "review_score": "-1"
        },
        {
            "review_text": "Short Puzzle-adventure mystery game. It is worth a shot if you like games with focus on storytelling. Though i might add, I would only buy it on sale",
            "review_score": "1"
        },
        {
            "review_text": "The game while its got a great atmosphere the puzzles aren't that hard although some solutions as others have said don't make any sense at all like at the start you cut a rope with a knife to open some small doors and behind those doors is a concrete wall. Now behind that concrete wall is some gears that operate the door allowing you to get in the building but you need to use a small weak little wooden twig to break though a concrete wall....told you its not very realistic or logical.  Lastly this game does have a lighting bug that pops up now and then where any light source gets insanely bright and flashes for a couple seconds but mostly happens after the game has been paused for a while or if you use the steam overlay(Shift+Tab) for a while.   6/10 Overall its a decent game with ok atmosphere but don't expect much",
            "review_score": "1"
        },
        {
            "review_text": "Eerie, bone-chilling atmosphere. Gripping story as you sink deeper and deeper into madness. And the masks. When there are masks involved, you just know it's gonna get ugly. And that statue that keeps following me around. I think this game is starting to affect my sanity.  10/10  *Note: Play the Extended Edition in one go. Goosebumps and shivers down your spine guaranteed. The EE has much more content than the original and makes more sense. Try getting all the endings. Yes there are a few. After that give the original version a try, go nuts and paint the sawmill red. See what I did there?",
            "review_score": "1"
        },
        {
            "review_text": "Too hard without guide :P",
            "review_score": "-1"
        },
        {
            "review_text": "Beautiful Game! The game is amaizing , great graphics , amaizing sound. The only things that are bothering me are the lag ( nvidia GT635 , 16 gb ram ) , the hard puzzles and not having a tutorial. Those are the only things i dont like about the game, but overall realy fun game , played about 30h offline (thats why it doesnt show up in the comment) , i loved it very interesting, the graphics and sound make me want to play the game more. Definately Recomed It!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ı've ever played. But if you are a casual adventure/horror player don't try this. This game is way deeper than amnesia and others. It blends puzzles and narrative really well. And also visual effects are just amazing. I really congratulate the team.  This game made me wonder what if the video game industry funds this type of games that I think immortal pieces of art. At old times when everything is not about graphics and action, artisticly rich games such as monkey island, grim fandango, sanitarium etc. produced within the mainstream, but now only independent producers create such rare games with really insufficient funds.   I hope that virtual reality tech to clear the way for these kind of games.",
            "review_score": "1"
        },
        {
            "review_text": "I can't describe this game because leaved to me so much emotions that i had to reset my brain to continue using it.",
            "review_score": "1"
        },
        {
            "review_text": "It's pitched to be a game similar to Penumbra or Amnesisa. It's not. It's quite far from it in fact.",
            "review_score": "-1"
        },
        {
            "review_text": "Anna: Extended Edition represents the natural maturation of Dreampainters debut title. Italian developers corrected the most bitter points of their previous work in order to create a deep and complete game, an homage at the same time to the never-dying adventure game genre and to the most deep and sick horror.",
            "review_score": "1"
        },
        {
            "review_text": "Extended Edition is a very long extended edition. Completing the steps to beating the game takes a lot longer and are harder to find. To get to know the story I suggest completing the shorter story first then move to the extended edition. Overall very creepy and dark scary game.",
            "review_score": "1"
        },
        {
            "review_text": "I emersed myself in Anna [Extended Edition] for hours. Scary, yet casual, with no combat. Exactly what I prefer, if you have similar interests in PC games as I then I would highly recommend this game. While playing I found it somewhat difficult. I don't claim to be the smartest. I had only played 63% of the game until getting kicked out of house from 'losing my mind'. I do plan on re-playing soon. I believe I saw enough to form an opinion and it's as enteraining as it is scary. I do have to mention I get scared fairly easily, but I haven't played a game that has scared me as much as this one.. THANKS :]",
            "review_score": "1"
        },
        {
            "review_text": "Lovely, chilling, and absolutely terrifying (for me). Don't play if you have severe phobias of things sneaking up on you or of darkness. I was petrified the first time I tried to play this, 10/10 would recommend for people who don't normally do horror.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game.",
            "review_score": "-1"
        },
        {
            "review_text": "A disturbing game but a really good one.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing, atmospheric, story-driven horror game. If you are looking for a game to hold your hand and walk you through a neat, wrapped up plot - skip this. If you like creepy stories with tough puzzles, this is for you. It's not perfect - there are a few issues with controls and things - but they are far from gamebreaking. This is easily one of my favorite horror games out there.",
            "review_score": "1"
        },
        {
            "review_text": "Very short! However, for only some bucks it's still worth it!  Gameplay feels great and jump scares will definitely take place!",
            "review_score": "1"
        },
        {
            "review_text": "Literally one of the most uniquely strange and disturbing games that is completely different than every other similar game. The game is great, yet tricky, however Kalypso as a company really sucks.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game for around two hours, only making progress with the help of a walkthrough. Some of the puzzles were obvious whilst others I would never have figured out without help. As a puzzle game I found it frustrating. I didn't particularly enjoy anything else about it either. Toward the end of the game, the screen flashed and I suddenly couldn't interact with anything. I couldn't even access the menu. I was forced to alt f4, losing all of my progress. I would highly recommend playing something else. Having to sign into an account to play is annoying too. Enjoyment rating 2/10.",
            "review_score": "-1"
        },
        {
            "review_text": "Puzzles are not intuitive of satisfying and the story is not engaging.",
            "review_score": "-1"
        },
        {
            "review_text": "Great horror game with challenging puzzles to solve, intuitions to find and piece together to form new intuitions, variety of endings, and BEAUTIFUL music. That and a CREEPY as hell doll that follows you EVERYWHERE you go and appears when you least expect it!  But that is ONLY the beginning. The ending differs on how you play and how many clues/intuitions you collect, making this game holding hours of creepy fun as you learn the true nature of Anna.  'S H E I S A L W A Y S W A T C H I N G ! !' O.O",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't go through the whole game so . . Yeah can't say much but it is creepy and scary as ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "First person point and click adventure",
            "review_score": "1"
        },
        {
            "review_text": "For the people who like horror and mulitple endings THIS GAME IS PERFECT FOR YOU! but really, it has multiple endings and its just beautiful, i havent finished ANY of the endings but i do recommend it for those fans of horror games.",
            "review_score": "1"
        },
        {
            "review_text": "Stay away from this. How can they price this 10 euros...it is technically primitive in both graphics and interface. The 'gameplay' is not game nor play, and the solutions to the 'puzzles' are not those of a reasoning mind. The atmosphere is a bit creepy and ok, but really i don't even care to see the second ending. Another 'indipendent game' that tries to achieve something artistically 'different' from the mass. Sorry, would prefer something less experimental.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, I was quite iffy about getting in but I saw a friend had it that only getts good games so I decided to try it ! I'm happy i did I love it.. Puzzles are one of the tings I adore and this one just really does my head in but i work it out eventually :3 I love the creepy atmosphere and the story line :3 it's a tad cute in a creepy ♥♥♥ way and I love it!",
            "review_score": "1"
        },
        {
            "review_text": "This game has some stunningly beautiful graphics and the ability to keep you on your toes the entire time with the lighting and atmosphere of the enivronment. I recommend playing at night in a dark room to get the most out of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "A Very Boring horror game... It's a must play",
            "review_score": "1"
        },
        {
            "review_text": "You need to think a lot and you'll scare a lot too.",
            "review_score": "1"
        },
        {
            "review_text": "A Succint Review: Spooky game Spooky sounds Spooky objects Spooky wood lady Spooky wood lady whos follows you Spooky wood lady has teeth Ending was.... a surprise",
            "review_score": "1"
        },
        {
            "review_text": "All I can say is that this game is beautiful. Not only are the graphics amazing and the music immersive, but the puzzles are actually interesting and it makes you wanna play more! The plotline is really nice too and everything about this game makes me smile! Bravo (:",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game! wow! excellent atmosphere, a very good technical execution, maybe a bit short and sometimes difficult but if you can find it on sale and you like horror adventure games give it a try!",
            "review_score": "1"
        },
        {
            "review_text": "weird creepy first person point and click game almost like amnesia, some drm thing that you need to log in every time you start the game in it though",
            "review_score": "1"
        },
        {
            "review_text": "I fully reccomend the Extended version. This was the way the game was meant to be. The confusing puzzles have been redone to make more sense, and there is logic to the game now. Fully enjoyable puzzler with an interesting story and eye-gasmic detail. Glad to see the developers listened to the community and fixed what was needing to be fixed.",
            "review_score": "1"
        },
        {
            "review_text": "Anna is a fun and scary game without the feeling of being rushed. The puzzles are really fun to figure out yet still gives you the chills while playing.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't expecting much from Anna and what I got was a surprisingly strong Myst-style adventure game with a heavy atmosphere and strong presentation. It's not often a game can deeply rattle me but Anna has some legitimate scares and freakout moments by smartly employing insanity effects you often can't predict and organically using events that happen behind you.   My largest complaint is that the puzzles can be pretty obtuse -- not because they're actually difficult but the darkness of the game and detailed levels make it easy to skip things you wish you had noticed. This aside, play the extended edition version of the game with a pair of headphones and immerse yourself in a fantastic 3-4 hour experience any fan of adventure and horror games will love.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that if you play it in the dark, you genuinely do get a bit jumpy- and the way you handle the controls seems to effect the sanity of your character- which messes with the way you play. Very mysterious game, great environments; the puzzles are possibly TOO complex? It's like a horrific version of myst with added point and click item use. Anyway I give it a 6.5/10 would have been higher if the scare-tactics were a little more related to actual gameplay as opposed to time played.",
            "review_score": "1"
        },
        {
            "review_text": "Oh my gosh. I don't know how to properly describe this game. It's beautiful - and I don't mean just when I have the graphics cranked up. The story is compelling, and even though I wanted to flee the house so many times, it was worth every jump (and scream) just to keep unravelling the tale of what happened in the sawmill. I finally beat it two days ago and I'm still sleeping with the lights on. I call that a victory for Anna.  If you have a dressmaker's dummy in your bedroom (like I do), may I recommend moving it to a closet? You'll thank me later.",
            "review_score": "1"
        },
        {
            "review_text": "A mysterious adventure into the Mind of an archane being that embodies the archtype of a woman, Anna. You awaken outside of a Saw Mill in Italy, with vauge memories of a Woman you called your love. You enter the mill seeking her, to find the supernatural consuming your mind and experiences. Great Game, remenicent of Amnesia: Dark Descent.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy atmospheric games that submerge you right into the game itself. From the start you are exploring the exterior of the plot house, trying to solve the unsolvable and win your way inside. Anna is a good game for this, because not only does it have the creep factor that Horror gamers crave, it isn't full of billions of overused jump scares. It can be quite psychological at times, and forces you to really think each move you make through before acting on it. I really have enjoyed the changes they made to the original game based on the community. It helped pull the game together storywise and gameplay wise. A word of caution! This game has LOTS of reading!! I actually do reccomend guides if you are acchievement hunting, and keep in mind that one guide might not be enough. This game changes with every playthrough!",
            "review_score": "1"
        },
        {
            "review_text": "Love the game and love the anxiety lol if ur wearing a headset and playing in the dark at night its on a whole new level. The gme does however freeze a lot and Kalypso takes forever to send confirmation emails, its worth the money especially since its on sale right now!",
            "review_score": "1"
        },
        {
            "review_text": "This game is an amazing piece of art. The music is wonderful, and the graphics are amazing. I would highly recommend this game to anyone who likes beautiful graphics and an amazing soundtrack. The story wasn't that great, and the puzzles didn't make much sense, but it's still an amazing game.   Story: 7/10  Music: 10/10  Graphics: 8/10 ( know I said it has amazing graphics, but it's a little too bright. XP)",
            "review_score": "1"
        },
        {
            "review_text": "Hell yes. More qwerky games like this please!",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR 33 minutes worth of vocal/interactive content for 10$ - think about that.   Very short review, unless you enjoy riduculous puzzles that make sense only after you complete them, like adding spokes to a bike tire after inflating a flat piece of rubber with air, but before that you had to combine a door handle with a soder pipe....  why the complecations? I love the story of the game, but even as I watch a 'speedrun' (that takes about 37 minutes) I can't feel anything other than extreme disappointment for the lack of content for the price. 37 minutes worth of ACTUAL content for 10$ - think about that.",
            "review_score": "1"
        },
        {
            "review_text": "This game scared the **** out of me. Super creepy and a complete mind ♥♥♥♥. I loved it. I usually go back and try to replay to get all the achievements though I don't know if I can in this game, it scared me too much. Don't play alone in the dark. Actually, do play alone in the dark. It's better that way.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who owned this game before extended edition, the first release had bugs but it was more simple and easy to finish.  Personally what I love most about this game is the music (Really nice soundtrack) and the art is pretty amazing as well.   I do admit puzzles are pretty 'Wtf am I doing' or 'Maybe if I keep clicking something will happen' but overall it's not that bad of a game.  7/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is a slow, short puzzler. You walk, you click, you experience the mystery.  There are chilling effects, a few jump scares and lots of foreshadowing.  I can beat this game in less than 20 minutes because I am a speed runner.    Fans of Myst should pick up this title to have a little fun, the Devs are working on a 'sequel' as of now.    The bad: some puzzles can be a little hard to follow, and not every thing is given to you as a hint. there is a lot of alchemy involved here.  The inventory can be misleading.  The readables can be misleading once they have passed their prime purpose.  Right click a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Not a fan!!",
            "review_score": "-1"
        }
    ]
}