{
    "app_id": 217750,
    "name": "Age of Conan: Unchained",
    "release_date": "2013-02-22",
    "developer": [
        "Funcom"
    ],
    "publisher": [
        "Funcom"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "MMO"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Free to Play",
        "Massively Multiplayer",
        "RPG"
    ],
    "achievements": 0,
    "positive_ratings": 874,
    "negative_ratings": 397,
    "price": 0.0,
    "description": "Age of Conan: Unchained is an award-winning and critically acclaimed massively multiplayer online game set in the sexy, savage and brutal world of Conan the Barbarian.Tread in the footsteps of the greatest fantasy hero of all time, and explore the vast reaches of Hyboria.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/217750/header.jpg?t=1528219772",
    "minimum_requirements": "OS:Windows XP / Vista / 7 or later Processor:3Ghz Pentium IV or later Memory:2 GB RAM Graphics:Shader model 2.0 and 128 MB RAM: NVIDIA GeForce 5800 or ATI 9800 or better DirectX®:9.0c Hard Drive:30 GB HD space Sound:DirectX 9.0c compatible Other Requirements:Broadband Internet connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Beautiful world, beautiful music, items made to little details ... so raw and vicious, this game has best mmorpg world I ever played ... also I find things from Howards stories as a great reward for somebody who loves Conan and his world like me ... game has a lots of bugs but which game does not ... as always it is not for all ... the combat system may be hard for somebody ... and other will just miss their pinky stuff and violet dragons ... I highly recommend this for all Howard and Lovecraft fans.",
            "review_score": "1"
        },
        {
            "review_text": "I think that game is too underrated,it's amazing and it's not like the other MMORPG's i'm really enjoying it!",
            "review_score": "1"
        },
        {
            "review_text": "Of all the MMORPGs I've played AoC was the best at organically forcing players to work together, and therefore was a uniquely social game. I made lots of friends and got involved with my guild - something I didn't feel I had to do nor had a desire to do in other MMOs like WoW for example. Unfortunately it suffered in other ways (lack of voice acting past level 20, lack of mid-level quests thus resulting in a heavy grind) and so eventually I moved on. Would recommend if they fixed their previous issues and there was a larger player base. The world was beautiful and the lore felt much more rich than any other MMO I've played.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game when it released some years ago. As it got f2p it got a lot worse BUT yesterday the changed the subscription model which is alot fairer for f2p's.  It's worth to give it a new try now!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most intriguing and outstanding mmo's I've played. Based on Robert E. Howards barbarian realm you get the gritty feel of adventure, decapitations and brutality from day one. Tortage is THE best starter zone in any mmo (well, atleast among the ten-score of mmo's I've played), and then the content keeps evolving. Even now, 6 years after release the game stand strong, and you can get a lot of it without opting for the payed version. Free to play give you oodles of time to enjoy a challenging gameplay that requires something more than just the average point-and-click.  It's just damn good.",
            "review_score": "1"
        },
        {
            "review_text": "I really wish after finally downloading the whole 20 gigs that when i go to play it decides it has to download another 1 GB which is not even run through steam, so the download times are shocking, Thats another 2 hours i have to wait extra. Please include this in the files we are downloading anyway.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game...awesome graphics and gameplay that makes you think you are the hero of the tale...",
            "review_score": "1"
        },
        {
            "review_text": "Bit naff when it first came out, but has awesome graphics engine and the best combat system in any mmo, requiring a decent level of skill to be good at it. Interesting classes too - lots of fun to level a character in f2p :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is evolving constantly and it is still absolutely great. The recent udpates and change to paid membership has really made alot of people angry (those that have paid) because they had to pay for what now can be purchased ala carte. Those that complain about rude people are on the pvp server (Fury). If you don't want rude people and pvp ganking, log into Crom server. The Fury PVP is so unbalanced I can understand why people are leaving that server-   Overall, the game is addictive and beyond fun. The graphics are fine, even great by today's standards-the music is wonderful. There are so many things you can do beyond the normal storyline/gameplay such as, crafting and building guilds. Being in a good guild makes alot of difference.   Play the game. If you are a fan of Conan, or just fantasy settings and MMO's- play. You'll love it. Really. You will.",
            "review_score": "1"
        },
        {
            "review_text": "Great game.Even now(2016)I can still enjoy it.PLAY IT!!!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best options for f2p, 80%&gt; content all free and finally we meet some good gore (Chopping heads off, or break your foes neck with a mace). In combination with a good storyline and good graphics.Just awsome.",
            "review_score": "1"
        },
        {
            "review_text": "420",
            "review_score": "1"
        },
        {
            "review_text": "One of the best MMORPG's out there, no childish elves and ♥♥♥♥ just the brutal savagery of Robert.E.Howards Hyboria. If you're already a fan of all things Conan like me then by Crom you'll love this game, if not, chances are you'll still love this game. Afterall you only have to venture 5 steps into any town and you'll be overwhelmed by loads of axe wielding, topless women. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! If you are looking for a bloody, entertaining MMO experience, do not hesitate.",
            "review_score": "1"
        },
        {
            "review_text": " rating servers in Age of Conan EU, Worldwide:  Crom (PvE) - 40% Fury (PvP) - 75% Rage (Hardcore PvP ruleset) - unknown, i not played here. (probably very few)",
            "review_score": "1"
        },
        {
            "review_text": "a bit aged and dated, but the graphics are still good to look at and gameplay is as i remembered - typical quest and hunt rpg - having some pretty frequent lag-deaths though that is annoying.",
            "review_score": "1"
        },
        {
            "review_text": "I Rate This 10/10 Would Kill Again :3! You Haters Out There... Go ♥♥♥♥ Your Self x21",
            "review_score": "1"
        },
        {
            "review_text": "Cool game but needs more guides on how to complete certain parts of the game",
            "review_score": "1"
        },
        {
            "review_text": " Age of Conan: Unchained",
            "review_score": "1"
        },
        {
            "review_text": "i love this game im an addict to all games :)",
            "review_score": "1"
        },
        {
            "review_text": "the females shows their breasts...  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but Django is better.",
            "review_score": "1"
        },
        {
            "review_text": "Found the action to be to old fashioned, looks like it was a great game in its time. not for someone picking it up in 2016.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game, However the community the most toxic thing on steam, Worse then rust. Don't ask anything in NPH as you will more then likely be abused. Go try Tera instead. Atleast you can report hackers and trolls there.",
            "review_score": "-1"
        },
        {
            "review_text": "It's like if Runescape was in third person... and had ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Felt a bit samey with the other MMORPG around, didn't offer anything .. erm different",
            "review_score": "-1"
        },
        {
            "review_text": "such a huge game with outdated graphics and clunky combat. I can't recommend this. waste of bandwidth :(",
            "review_score": "-1"
        },
        {
            "review_text": "You have to pay to continue the game.",
            "review_score": "-1"
        },
        {
            "review_text": "My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.' I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because this game gave me cancer anyway.",
            "review_score": "-1"
        },
        {
            "review_text": "Wanted to play with a friend, we swap RPGs regularly. We both played an entire night waiting until the time we could actually do things together until I googled it and we cant do anything together until level 20. Not interested in playing half of the storyline by myself thanks :/",
            "review_score": "-1"
        },
        {
            "review_text": "cool a waiting sim ! no but srly i waited like 5h before i can even play its still downloading so i give it a negative because its downloading and ♥♥♥♥ P.s whoever says i have a ♥♥♥♥ pc or internet no the game eats my internet its so ♥♥♥♥ing slow right now :/",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent MMO for those looking for originality, diversity, story and last, but certainly not least...PVP. It's been vastly under appreciated.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I actually started playing it back when it first launched live, and stuck with it for about a year before quitting. Part of the reason I quit was my computer at the time was stressed playing it and I felt like I was missing out on the game graphics at the time. Another reason I quit was the guild I was in moved on to another game.  Years later I logged back in and found my characters waiting for me.  Of course my computer now can run this game at maximum settings, and it looks great.   Jumping back into the game again I have to admit I really love the 'new player intro' (level 1-20) missions. I decided to get back into the game by starting a new character, and the intro levels are very detailed, lots of fun, great story line to follow - and if you are a fan of Robert E Howard's Conan stories you can feel the game developers really tried to create that same 'feel' you get from the stories; a brutal world, savage, dark magics, vileness, evil cults, bloodshed... harsh!  Do I recommend this game? Yes. It's free to play, and what you get to experience for free is a great story line and the opportunity to explore a beautiful game world, and it's a big game world. Probably not a great game for young kids, as their is a fair amount of nudity (topless women). But hey, I would have loved a game like this back in the late 80s when I fist got into computer gaming.",
            "review_score": "1"
        },
        {
            "review_text": "love the blood dance spilled all over the place ",
            "review_score": "1"
        }
    ]
}