{
    "app_id": 21800,
    "name": "Tom Clancy's EndWar™",
    "release_date": "2009-02-25",
    "developer": [
        "Ubisoft  Shanghaï"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "RTS",
        "Tactical"
    ],
    "achievements": 0,
    "positive_ratings": 276,
    "negative_ratings": 108,
    "price": 8.59,
    "description": "Live the thrilling career of an army commander and lead your army to victory in a massive online World War III! Take control of the U.S.-led Joint Strike Force, the European Enforcers Corps, or the Russian Spetsnaz Guards Brigade in a persistent ongoing World War.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/21800/header.jpg?t=1541778594",
    "minimum_requirements": "OS: Windows® XP (with SP2) or Windows Vista® (with SP1)                     Processor: Intel® Core® 2 Duo E4400 2.0 GHz or 3.0 GHz AMD Athlon™ 64 X2 Dual Core 6000+ or better                     Memory: 1 GB Windows XP / 2 GB Windows Vista                     Graphics: 256 MB DirectX® 9.0c–compliant video card with Shader Model 3.0 or higher (see supported list*)                     Hard Drive: 10 GB free hard disk space                     Sound: DirectX 9.0c–compatible sound card                     Network: Broadband connection with 256 kbps upstream or faster and service required for multiplayer mode                     Peripherals: Windows-compatible mouse required.                    *Supported Video Cards at Time of Release                     ATI® RADEON® X1800XT / X1900XT / HD 2000 / 3000 / 4000 series                     NVIDIA® GeForce® 7800 GT / 7950 GT / 8 / 9 / 200 series                     Laptop versions of these cards may work but are NOT supported. These chipsets are the only ones that will run this game. For the most up-to-date minimum requirement listings, please visit the FAQ for this game on our support website at: <a href=\"https://steamcommunity.com/linkfilter/?url=http://support.ubi.com\" target=\"_blank\" rel=\"noopener\"  >http://support.ubi.com.                     NVIDIA® nForce™ or other motherboards/soundcards containing the Dolby® Digital Interactive. Content Encoder required for Dolby Digital audio.",
    "recommended_requirements": "OS: Windows® XP (with SP2) or Windows Vista® (with SP1)                     Processor: Intel® Core® 2 Duo E6600 2.4GHz, Intel® Core® 2 Quad Q6600 2.4GHz, or 2.5 GHz AMD Quad-Core Phenom™ X4 9850 or better                     Memory: 2 GB                     Graphics: 512 MB DirectX® 9.0c–compliant video card with Shader Model 3.0 or higher*                     Hard Drive: 10 GB free hard disk space                     Sound: DirectX 9.0c–compatible sound card with latest drivers                     Network: Broadband connection with 256 kbps upstream or faster and service required for multiplayer mode                     Peripherals: Windows-compatible mouse required. Windows-compatible headset required for voice command.",
    "reviews": [
        {
            "review_text": "Great game. Definitely is worth far more than its new counter-part 'Endwar Online'. Though voice commands work 85% of the time, it does not diminish the experience, and even though mutliplayer went offline a while ago, it is still worth picking.",
            "review_score": "1"
        },
        {
            "review_text": "Tom Clancys Endwar is a Great RTS and Strategy Game  It provides hours of fun and entertainment for a low cost as well. Something else i really liked is the story on this game was alot better than i remember. Now it is not a ground breaking story and is not really rememberable i just enjoyed the short cutscenes after every battle that detailed the battle around the globe.  Pros Good graphics Each unit is unique and is needed for the overall success Voice command is a charm Low price Detailed Units Each army has unique units   Cons Matches can become predicatable so play on higher diffuculty Not a lenghty story about 8 hours but not bad Only 3 armies    If you want a fun RTS that is not too expensive get this. ",
            "review_score": "1"
        },
        {
            "review_text": "this is a game about giving people orders  only buy it if you like giving people orders",
            "review_score": "1"
        },
        {
            "review_text": "If you want a really decent RTS, then this Tom Clancy game is for you. Giving you a choice between one of three powerful factions, conquer the world as you crush your enemies into dust.",
            "review_score": "1"
        },
        {
            "review_text": "This game has an awesome setting and awesome gameplay but what ruins it is the camera controls. I dont know if theres a way to fix it or something but it really annoys me and my friend that also got the game.",
            "review_score": "1"
        },
        {
            "review_text": "The idea is amazing, but the end result is very average.   If the designers comitted truly to the voice command idea, it could have been a very sweet game. Instead you are left struggling with both keyboard, mouse, and voice. Why use voice when you can just click? It seems to me for this idea to work, you have to either be able to do everything by voice or there would be no point.  1) You can't take cover using voice, you have to click 2) You can't control the camera using voice, not even with something as simple as 'camera left left left', so you have to keep your hand on the mouse if only to rotate the view 3) To move something or attack something, you have to know the number of the unit. What if you have 4 helicopters on the field and you want to attack a tank with the closest one? you can't, because you can't see the number of units on the map. So you have to keep guessing or switching between units looking for the right one. A better solution would be to have a bigger map, with numbers clearly shown above the unit icons. 4) In time sensitive situations where you have to react quick, it is a real mess to attack the enemies because once again, it can be difficult to know the number of the unit you want to attack. Enemy tanks flanking on the left? Your helicopters are ready, but even if the tanks are on your screen often their number won't be displayed (it seems to depend on distance or visibility) so you can't efficiently react, and since you can't even send your units to a location by voice you'r back to right clicking. 5) Mission command actually talks to you as you play, and if you are issuing commands at the same time you won't hear what is being said.  So to make it short, even if the available voice commands work well, voice recognition is reliable, the game relies too much on keyboard / mouse for the 'voice commanding' thing to really fly. But i can see how if they make aonther game in the series and address all these issues, this concept of 'hands free strategy' could be really fun.",
            "review_score": "1"
        },
        {
            "review_text": "Its endwar  Voice cammands...  ... 'Yeah! i know the voice commands don't work, but at least they try!'   70/100",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Extremely simplistic rock, paper, scissors gameplay could work if it wasn't for the fact that the camera is absolutely abyssmal and there's almost no ability to micromanage at all. The voice command system works but it's one of the few aspects of the game that actually does work. The gameplay is extremely underwhelming and the different nations are essentially the same outside of cosmetic differences.  Quite simply - it's not worth buying.",
            "review_score": "-1"
        },
        {
            "review_text": "great game. really fun. only problem is theater of war has been offline over a year and nobody plays anymore. waste without multiplayer",
            "review_score": "-1"
        },
        {
            "review_text": "Way too easy. Unrealistic. ( Was able to destroy several heavy tanks with only one unit of footsoldiers.) Bullchenschiten.",
            "review_score": "-1"
        },
        {
            "review_text": "Bland, stale, boring, unenthusiastic gameplay. Wooden dialogue. Dull visuals. The premise and cutscenes are the only things going for it. Voice-command is a cool idea not implemented well here. Recommend World In Conflict instead.",
            "review_score": "-1"
        },
        {
            "review_text": "stay away 30 fps lock go buy world in conflict instead.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a good game but it has quite a few problems. Like crashes. But that not a reason to not play it. It is a really fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable RTS. Light hearted table-top feel to it. Familiarity of Tom Clancy game-based characters help (i.e. Mitchell is moving up!)",
            "review_score": "1"
        },
        {
            "review_text": "Commander, check unit 'EndWar', bad camera.",
            "review_score": "-1"
        },
        {
            "review_text": "it is a good game",
            "review_score": "1"
        },
        {
            "review_text": "Shouting out commands - priceless!  Seriously, EndWar is one of my favourite strategy games thanks to the awesome voice command option. I played it first on my Xbox 360 with a headset and gamepad. Both platforms run it equally well.  The game has no story to speak of, and once you figure out the mechanics you have to switch to expert mode (which is the second of three difficulty settings), otherwise it will be too easy. Don't be fooled, however - one mistake can cost you grately.  The units have a staggering number of upgrades and abilities that you buy for credits. The more successful your operations are, the more money you earn. Depending on your style, you can prioritize your upgrades.  The voice command feature is the meat of the game. On Xbox 360 I used it almost exclusively. On PC I combine it with mouse/keyboard to be in a few places at the same time. As an avid RTS player, with a few thousand ladder games completed in Starcraft, Warcraft III, and Starcraft II, I still think that thanks to the voice system EndWar offers an unparalleld level of immersion. That said, the game does not require such a high skill level to master as the aforementioned titles.  Unreal Engine 3 makes it still look awesome in 2016. It runs great on a dual core laptop with an intel 2.1 Ghz, 4GB Ram and a GT540m at 1280x720 maxed out details.  Not sure if it keeps you busy for a long time, but the campaign shouldn't take you more than 10-15 hours if you do not repeat too often. Due to its randomness and three playable factions, you might wanna repeat it.  I haven't checked the multiplayer mode on PC but it was fun playing it on Xbox 360. Not sure if the PC community is still there, though.  I strongly recommend the title as it is something truly unique with its voice command feature",
            "review_score": "1"
        },
        {
            "review_text": "If you have a mic, you will absolutely love this game! Its unique and awesome!",
            "review_score": "1"
        }
    ]
}