{
    "app_id": 218090,
    "name": "Unity of Command: Stalingrad Campaign",
    "release_date": "2012-10-17",
    "developer": [
        "2x2 Games"
    ],
    "publisher": [
        "2x2 Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "World War II",
        "Turn-Based Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 504,
    "negative_ratings": 116,
    "price": 14.99,
    "description": "Unity of Command is an innovative and refreshing operational-level wargame that covers the entire 1942/43 Stalingrad Campaign on the Eastern Front.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/218090/header.jpg?t=1555512908",
    "minimum_requirements": "OS:Windows XP Processor:1.6 GHz Memory:1 GB RAM Hard Drive:150 MB HD space",
    "recommended_requirements": "Processor:2.0 GHz Memory:2 GB RAM",
    "reviews": [
        {
            "review_text": " Best Suited For Casual Strategists",
            "review_score": "1"
        },
        {
            "review_text": "Unity of Command is like no other game I've played. Attractive design and wonderful UI make me wish all other strategy games I play looked this good. Having 25+ years of PC gaming xp that started with a Commodore 64, this game is on my very short list of best ever! I keep comming back to it and never know why I left.   The user interface is perfection and does not take up 40% of the screen like other strategy games. I love that you can see the risk involved in your attack moves beforehand so your can approach conflicts in your own way. Really like the combined arms play and excellent balance. Love the theater of war moves, the complexity of logistics, and sharp background music. Replayabilty is very satisfying. Greatly detailed manual as well. Highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "'MUH SUPPLY LINES'  This expression indicates Player's confusion and lack of understanding. When confronted with game mechanic he cannot understand, Player mumbles 'b-b-but muh supply lines' or 'muh supply lines mutha♥♥♥♥a'. This is usually followed by getting encircled and losing all his panzer divisions.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Every few months, I come back to it; I try to improve my performance in the campaign, or to improve on my performances on the tougher maps.",
            "review_score": "1"
        },
        {
            "review_text": "First impressions review.  It looks deceptively simple, the UI is very intuitive and the game is beautifully designed. Very accessible and after i did the tutorial I felt ready to tackle the 1st scenario.  I got my butt handed to me! but that's a good thing, the AI out thought and out fought me, Now I'm hooked, hopefully once I get to grips with the games mechanics and gain a deeper understanding of its finer points I will improve, Its obvious the simplicity of the UI and controls definitely hides a deeper complexity.  This game is easy to get into but hard to master, exactly how all games should be.  Very impressed so far, can't wait until I feel confident enough to pit myself against others in multiplayer.  For the price (bought the bundle in a sale - £5 for the base game and both DLC packages) it's a solid 8/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the better world war 2 strategy games to come out in sometime. The game is easy to get into and has a very easy to understand UI.",
            "review_score": "1"
        },
        {
            "review_text": "i wont regret myself for buying this game  -the AI are great they will @@@@@ you up if you are even foolish enough to make a tiny hole on your defense  - realistic supply system  i wish there is future sequel maybe western front",
            "review_score": "1"
        },
        {
            "review_text": "A good turn-based strategy in the line of Panzer General.  It has some flaws: - dumb, unrealistic AI - no difficulty level modification - not possible to save during a scenario, not possible to play two campaigns at the same time - encircling enemy unit does not give you attacking bonuses - attacking enemy unit from multiple sides does not give you additional bonus - very little randomness during battle - no separate units of artillery, anti-tank, aircraft - some minor absurds in supply/territory control  Once you get passed through them, the game becomes very enjoyable and quite addictive.",
            "review_score": "1"
        },
        {
            "review_text": "I was able to get this on sale. I enjoy it very much and seems to run smoothly.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting wargame on the light end of the complexity spectrum. One of the better AI's that I've seen in a wargame. If you can get it on sale, then go for it. So far I'm having fun with it.",
            "review_score": "1"
        },
        {
            "review_text": "Its a one of a kind strategy game with very comples ai and is very challenging it is one of the underrated strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed Unity of Command it has great depth and historicial accuracy. The Black campaign is my favourite so if your going to buy it get the trilogy. A tip before you move press the spacebar shows max movement took me a while to stumble on that one.   Pros Historicialy accurate units, Tanks having overrun, ability to add special units to divisions, fun battles some short some very long. Good replay value  Cons, none I can think off if your into WW2 wargames buy it",
            "review_score": "1"
        },
        {
            "review_text": "i very like it remembers me the old gba game 'advance wars' i really like it! its hard its simple its a true challenge uderstand it at the perfection, i cant even success the easy ones.... but i want to learn more from it, very good game!",
            "review_score": "1"
        },
        {
            "review_text": "A very good and deep wargame. Enjoyed the Soviet campaign, haven't played as Germans though as it would be rather painful to replay the attack on my country and capturing it. The specialist arms system, whereby a unit can be assigned an additional weapon, is ingenious. Sometimes it was a game-changer! I also appreciate the well-timed missions. Sometimes it took me many attempts to clear the objectives in time, but I enjoyed trying nevertheless. Overall, a great game, if only a bit short, even with all DLCs. A couple more campaigns would be just perfect, but then I don't and probably won't play as German. The historical accuracy is almost complete, and the real tactics may be traced in that the in-game Soviets have to pave their way with bodies of their own, as they get a lot of infantry and often not much more, and almost every German unit is here superior to a corresponding Russian one, the Soviets just have more men to dispose of. The real campaigns, according to the best accounts, were fought just like that.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best lightweight hex games in the industry, great mechanics and really fun.",
            "review_score": "1"
        },
        {
            "review_text": "Great turn based strategy... Secially good for WW2 buffs (or histroy in general:)",
            "review_score": "1"
        },
        {
            "review_text": "Unity of Command is a great game. It is presented in a straightforward and elegant way, making what could have been an incomprehensible mess into a very accessible wargame. However, do not mistake this for a lack of difficulty. The extremely crafty AI is very quick to put this idea to bed. Attempting to reproduce the stunning encirclements that the Wehrmacht pulled off expertly throughout Operation Barbarossa often ends up in disaster when the AI exploits the holes left by your advancing troops to turn the tables and cut off your supply lines. If you want an easy game, then you are looking in the wrong place with Unity of Command.  Speaking of supply lines, they are often the key to success or failure. Cutting off the supply lines to a strong enemy force can turn an impossible fight into an easy cleanup operation. Because there is such great risk involved, and it often goes pear shaped, the satisfaction that results in successfully pulling off a large scale encirclement is huge. It's what keeps me coming back to Unity of Command again and again, even though the AI continuously puts me in my place when I get careless or overconfident.  For anyone with an interest in the eastern front during World War 2 and turn based strategy games, I cannot recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent. While it is very quick to learn to play, there is also an impressive depth and detail to the game. My only negative is that I wish there were more battles to play, so maybe the Red Turn and Black Turn DLC would be a good investment.",
            "review_score": "1"
        },
        {
            "review_text": "Unity of Command is a tough one. The game works very well. I particularly like the way that it visually represents the action that your seeing, with each of your unit's having pips showing their combat effectiveness. However, the turn limits per scenario are, frankly, brutally unrealistic. In many cases, the enemy would just gang themselves around 1 of my 5 objectives and literally make it impossible to do anything within the rest of the time frame. However, this is done to show the way in which the Russian front battles took place, as the German's frequently relied on the Blitzkrieg tactic to rapidly advance and crush their enemies, forcing the Russians to have to adapt and use similar techniques while countering. The game, I feel could have used either longer time limits, or no time limits, but replace these with much higher numbers of units, perhaps staggering them to arrive after a certain objective is met or a certain time limit expires. However, it's an enjoyable and interesting experience, and should definitely be looked at for fans of Risk type games.",
            "review_score": "1"
        },
        {
            "review_text": "I feel so just roflstomped by this game but I can't put it down",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun! Reminds me of Panzer General from back in the day! An Incredibly challenging game and a very rewarding experience. The AI can be brutal. Every move can make or break your battle so make it count.",
            "review_score": "1"
        },
        {
            "review_text": "Unity of Command is basically a much more accessible, combat-only version of the Hearts of Iron games by Paradox.  Like old-school board-game war-games, Unity of Command works off of simple mathematical statistics within a turn-based framework on a hexagon-filled battlefield. The computer makes the random 'dice-rolls' for you, and streamlines the war-gaming experience. In addition, the computer also adds some very limited random elements - primarily semi-randomized weather effects which change movement rules and cover calculations.  Each game is a particular strategic scenario on the Eastern Front of World War II: many are historical, while a few entail hypothetical operations. The campaign-mode is just a sequential playing-through of those scenarios, with only a slight change in that sometimes you have to win a scenario with a certain score to progress to the next one.   Honestly, the campaign-mode is not very fleshed out, and I don't play it much at all.   But individual scenarios are great. They range from 6-turn affairs with just 20 units on either side, to 18-turn massive battles with dozens and dozens of units to move around. And the scenarios can be played in single-player, in on-line multi, or in hot-seat multi modes, so if the (remarkably good) AI isn't quite enough, you can easily recruit a friend in your neighborhood to play against you.  It's alot of fun, and I recommend getting the DLC packs (Red-Turn and Black-Turn) pretty much right away so that you have a good number of scenarios to play through. That said, there are also user-created scenarios on Steam Workshop, I believe, but they vary greatly in challenge and entertainment value. ",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic little game, don't let it's ugly cousins give you a bad impression of it. From the outside, it looks like a standard Paradox/Geopolitical combat game, but in reality the combat and strategy plays like Civ. All you need to concern yourself with are the objectives you've been set, the time limit on each scenario and your supply lines. Rather than being given an entire country and told to manage it's economics, politics, diplomacy, research and military tactics all at once, this game deals with none of that. It is purely and simply tactical/strategic warfare. The combats similarity to Civ V (which, I am told, in turn is similar to Panzer Corp so maybe I should be comparing that) is based upon it's turn based, one unit per tile nature. You capture any land you walk on, but are restricted in this by your supply lines, which you can extend or cut off by capturing roads. If your troops are poorly supplied, they may become easy targets or have their movement range progressively reduced or be unable to enter combat. There is a turn timer related to your objectives, and this provides a good kick up the backside and adds a great deal of tension to your strategy, although missing the final objective by one hex can be extremely frustrating should it happen.  Overall, a really good strategy game, it doesn't over complicate it's subject matter and deals well with the simple concepts that it uses.",
            "review_score": "1"
        },
        {
            "review_text": "i love this game, but it is just so difficult - anyone more experienced with strategy games would probably find it a breeze, but i find it a challenge just to get past level 3!  Definitely recommend it to those after a challenge or anyone who likes turn based strategy games",
            "review_score": "1"
        },
        {
            "review_text": "Great game about the great war",
            "review_score": "1"
        },
        {
            "review_text": "Excellent turn-based Wargame. The best since very long, maybe since Panzer General II ... :)  -----------------  Excellent Wargame en tour en tour. Le meilleur depuis longtemps, peut-être même depuis Panzer General II ... :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastc game for those who love military sims. Very easily accessible, yet tactically rich. The interface is one of the best I've seen in a military sim. Though somewhat short in campaign length, steam workshop adds replayability and creativity.",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "Best indie game, best strategy game, and best game I played last year.",
            "review_score": "1"
        },
        {
            "review_text": "The king of the strategies(Hearts of Iron) is dead, long live the king!  Sorry Enemy Unknown, you were great too but here we have an underrated gem which deserves some love.  Main campaign is about Stalingrad Offensive of Germans and counter offensive of Soviets. DLC's consists of Red Turn(Which is 'Race to Berlin') and Operation Barbarossa(1941 offensive of Germans)  Only minus sides of the game are first you can't be defender side while playing against AI. Developers say AI has its limitations and 'think' only one or two steps forward. Ai is awesome as defender anyway so i'm not sure if i can count this as 'minus' side.  Secondly maps has turn points, if you fail to deliver all at the end you fail. You get more prestige points for earlier capture. Sometimes in bigger maps(like Moscow) it makes one crazy to lose at the end because of 'turn limit' but you can always restart the map *shrugs* But it is kinda historical if you think Germans' race against winter(which failed) but again it is not a nice feature but i don't mind.  Except this everything, from AI to maps, from historical accuracy to gameplay, specific units(Romanian, SS, Italian, Hungarian divisions) to randomness(Such as weather change)... Everything is fine.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "For a game that doesn't have very high system requirements, this game looks and plays incredibly well. I like the fact it's a WWII game that doesn't focus on the U.S., and overall has a great atomosphere to it. The gameplay reminded me of Civ, minus the civilization portion, and if Civ solely focused on combat. I you're looking for a well made strategy game that is easy to learn, but challanging at the same time, this one's pretty damn worth it. Love the music too, good stuff.",
            "review_score": "1"
        },
        {
            "review_text": "This game has something of an Axis and Allies: War at Sea feel to it. The strategy is more tactical than it is big picture. Campaigns are laid out decently for single player. Most certainly worthwhile if you enjoy board game style turn based strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a game where not only did i regret buying it, but i also regret the 6 hours i had spent trying to play the game.",
            "review_score": "1"
        },
        {
            "review_text": "If you don´t like turn based games try this game anyway! The supply rules make this game special.",
            "review_score": "1"
        },
        {
            "review_text": "The good: I like the simplistic gameplay, and the focus on keeping your supply lines intact while pushing forwards. That´s what this game is about. Capturing objectives while keeping your units in supply so they don´t run out of juice on the front lines. All within a tight turn limit. It´s an intriguing and (to me) novel concept.  The bad: It´s frustrating beyond belief. Not because it´s hard (it is) but because it´s to damn random.  +Pushing an enemy off a tile is random. +Getting 'Overrun' results, which allow you to attack again in the same turn, is random. +A battle can randomly turn out to not go as predicted and you don´t defeat a unit that you needed gone (the game shows you the expected outcome before you attack). +Bad weather which heavily favours the defender (you are never the defender) may randomly show up and completely screw over your push for the objective. +Specialists (expensive and often crucial) within your units may or may not be among the casualties when the unit fights.  The problem with that is, the game does not give you the time for this kind of randomness. The turn limits are so tight that any one of these events can screw you over. Sure you might still beat the mission but the game differentiates between normal, decisive and brilliant victories. Many follow up missions are barred behind decisive victories and some even behind brilliant victories. So you try over and over again, without any change in strategy (once you got it down) and hope that you get enough 'Overrun' results with your armoured units and you hope that your push doesn´t get stuck in bad weather until you finally beat it in time.   Due to this, I can´t really recommend it as much as I like the concept of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "The game had potential, I liked the units, interaction, and alternate history option but the game suffers form lack of strategy in that there is only the one way to win their way. No save option during scenarios so lose and start all over this can be a lot of time lost, lack of fun gameplay it just feels like a constant grind rather than playing a game, lack of decent tutorial and for as simple a game it is they could have added more options like more unit customizations and upgrades. I don't recommend this game there are better WWII games out there.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks like it could have been a decent turn based strategy game —&nbsp;if it didn't crash or fail to launch 95% of the time.   It has run for a total of 1 time out of the last 20 times i tried launching it. And it reports a not-super helpful message:'an error ocurred'",
            "review_score": "-1"
        },
        {
            "review_text": "Simply the most boring game I have played.",
            "review_score": "-1"
        },
        {
            "review_text": "100% IMPOSSIBLE TO EVEN KILL ONE THING",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "Not what i was expecting. This is not your hardcore hex based wargamer.  This is a arcadey click wargame, hardly any depth at all and no skill. It comes down to just attacking anything with anything. This game also contains a bad mechanic that is a timer, you know do this or that before turn6.  If you want a complex tactical clever wargame this is not it. If you want a limited advanced wars set in ww2 then give it a go, but even advanced wars had more freedom.",
            "review_score": "-1"
        }
    ]
}