{
    "app_id": 218510,
    "name": "Planets Under Attack",
    "release_date": "2012-09-27",
    "developer": [
        "Targem Games"
    ],
    "publisher": [
        "Topware Interactive"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Space"
    ],
    "achievements": 21,
    "positive_ratings": 492,
    "negative_ratings": 191,
    "price": 6.99,
    "description": "Play as humans or robots in a brand new sci-fi strategy adventure! Travel into the far reaches of space, through cleverly designed star constellations and variable game modes, conquering enemy planets using 15 combinable technologies.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/218510/header.jpg?t=1511884757",
    "minimum_requirements": "OS:Windows XP SP2 / Vista / 7 Processor:1.5 GHz Single Core CPU  Memory:512 MB RAM Graphics:Graphics card with Shader 3.0 support and 128 MB RAM DirectX®:9.0c Hard Drive:300 MB HD space",
    "recommended_requirements": "OS:Windows XP SP2 / Vista / 7 Processor:Intel Core 2 Duo or AMD Athlon 64x2 Memory:1 GB RAM Graphics:Graphics card with Shader 3.0 support and 256 MB RAM DirectX®:9.0c Hard Drive:300 MB HD space",
    "reviews": [
        {
            "review_text": "7.5/10 - Exciting, Planet based strategy game!  I usually don't like games under TopWare; but this game is a gem! For a highly discounted price I would highly recommend this game. For $10... Maybe not.   I really love the campaign. I've completed 12 of the 36 levels in about 45 minutes. The degree of difficulty is increasing at a rapid rate. With 3 levels of difficulty I see some good replay value ahead. There are some easy to impossible achievements, card drops and more.   I didn't find a multiplayer game yet, but I have a feeling during popular hours it will happen. This consists of 4 players building defenses and conquering the solar system. It's a calculated numbers game which I am really enjoying!  Worth $6-7     Accidently Reviewed",
            "review_score": "1"
        },
        {
            "review_text": "PUA is pretty enjoyable (while you're wining) because of its light humour, lovely music and fresh gameplay. And the most important thing: this game gives a real chalenge to your tactical skills.",
            "review_score": "1"
        },
        {
            "review_text": "Simplistically infuriating is the best way to sum it up. It's a well-done space strategy and resource management game (I'm sure there's some popular acronym for that or better classification). Gets increasingly harder as you progress (damn mean AI). It's entertaining and sadistically fun. Graphics are decent enough. Nice and cartoony so you don't strangle the game when the AI gangs up on you :)",
            "review_score": "1"
        },
        {
            "review_text": "Nice game! Good newbie guide, classic game play, good graphic.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game to play when you haven't got the time to play a full game of dota 2 :)",
            "review_score": "1"
        },
        {
            "review_text": "'Planets Under Attack' is a strategy gem: very simple concept, yet has just enough depth to the gameplay to make it not just addicting but weirdly satisfying, especially after playing tug of war with the AI over a planet for what seems like forever and finally ripping it from their hands at the same time you attack their last planet.   A quick summary of the gameplay: you start with usually one planet in one of multiple gametypes, including a deathmatch type, king of the hill type, and a gametype where you vie for control of specific planets ( the first to control all the marked planets wins, regardless of how many planets the other players have). You click on another planet and hold the mouse button to determine how many ships you want to send; neutral planets/your own planets dont cost any money to invade, but enemy planets do--at least for the human race, the only race i've played as so far, but i've read that the robots play differently--and you go from there, upgrading your planets to increase taxes and building up your defenses by transferring ships to increase the population. Again, on the surface, simple, but a game can quickly dissolve into chaos requiring quick thinking and quicker clicking to turn the tide.  Definitely recommended if you get a coupon, but for $10, its a great strategy time killer that also has a fun multiplayer. Check it out.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great and fun game. It's a space RTS, you upgrade your planets, build your fleet, and then mass your fleet to differen't planets to take them over. 4 Differen't game modes, lots of fun. Game needs more players, so spread the word!!",
            "review_score": "1"
        },
        {
            "review_text": "Simple game but challenging  Super recommended for casual gamer",
            "review_score": "1"
        },
        {
            "review_text": "10",
            "review_score": "1"
        },
        {
            "review_text": "Nice Game Needed More Players And ALeins",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Good game from Russian gamedev studio - i like it=)",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Planets Under Attack - Genociding Populations for fun and PROFIT&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Planets under attack is a very beautiful replayable indie game with great story and voice acting. would recommend in a heartbea tto anybody with a couple of extra cents in their wallet (i mean come on) great game.",
            "review_score": "1"
        },
        {
            "review_text": "its fun but kinda hard, i got an extra 2 copies i bought for a friends but they dont wanna play so anyone wanna trade a game for this i will, just messag me or something for what game you would trade, thanks.",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome guyzz",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game no cons so far 10/10 would play again. ",
            "review_score": "1"
        },
        {
            "review_text": "Some of the levels are horribly unbalanced and the overall feeling of this strategy game is that it is a visually appealing speace-based Excel spreadsheet.",
            "review_score": "-1"
        },
        {
            "review_text": "The game concept is good enough, especially for the price point of $0.99 USD (Steam sale).  However, for those looking for cooperative mode vs. AI, in an online capacity, know that the game does not currently support it. Despite advertising it as such and asserting that it offers this capability, the game does not at this provide it. A lengthy thread on the forums has also gone unanswered by the developers so no clarity has been shed on the subject. As such, no online coop campaign OR skirmish options exist for players vs. AI.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Saidly the game difficulty after first few mission is pretty much impossible. It's fun in the beginning, but it quicly escalates to being unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of money... Could be so much better.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a nice idea, but personally, I found it a bit overcomplicated and confusing. Every time I thought I understood the game, it threw in a new gamemode whose mechanics I had to memorize.",
            "review_score": "-1"
        },
        {
            "review_text": "Very annoying 'Narrator' and overall boring.",
            "review_score": "-1"
        },
        {
            "review_text": "The AI cheats in the hard level.",
            "review_score": "-1"
        },
        {
            "review_text": "Seems like the game has potential, but it's unplayable for a lot of people because of the failure to deal with customisation of controls. I can't recommend it because my community mostly can't play it. Such a simple oversight too, even just letting us choose some useful keyboard mappings would solve it.",
            "review_score": "-1"
        },
        {
            "review_text": "I just got the game and am unable to figure it out completely. The 'Controls' secition only lists using the mouse wheel to mark a planet of yours as 'Battle Mode' which means ships can be launched from it I found out and 'Defend Mode' which means when you send ships that planet will not send them and they will come from other planets. There was mention in the tutorial about clearing a marker, but I can't find any way to change what I assume is the marker around the enemy planet (by just clicking fast?) or to recall ships once I send them. The control scheme is far from 'intuitive' and if that is all there is to the game I can't see it being very fun.",
            "review_score": "-1"
        },
        {
            "review_text": "A good Hybrid 3x type of game (Astralux, Eufloria, Little Stars for Little Wars, Abstractanks, etc) pretty much ruined by TERRIBLE controls and cheating AI.  Bottom line, this game could have easily been contender for the best Indie game of 2012 except for the mind numbingly bad control mechanisms. There are controls 3x type of games adhere to, and this one broke all of that adhereance, and in the process ruined what could have been an amazing game.  Sad to say, while being a HUGE fan of 3x games like this, I couldn't tolerate this one for more than an hour.",
            "review_score": "-1"
        }
    ]
}