{
    "app_id": 218660,
    "name": "iBomber Attack",
    "release_date": "2012-11-01",
    "developer": [
        "Cobra Mobile"
    ],
    "publisher": [
        "Cobra Mobile"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Adventure"
    ],
    "achievements": 12,
    "positive_ratings": 112,
    "negative_ratings": 30,
    "price": 4.99,
    "description": "The legendary iBomber series returns but this time it’s time to ATTACK! Jump into your tank and get ready to blast your way around Europe and defeat the enemy in this visceral tour of destruction! With 24 missions full of explosive action to go at, iBomber Attack is a dose of high-octane entertainment that you won’t be able to put down.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/218660/header.jpg?t=1447356452",
    "minimum_requirements": "OS:Windows XP Processor:1.5Ghz Memory:512 MB RAM Graphics:OpenGL 2.0 Compatible. ATI, NVIDIA or Intel HD. Hard Drive:900 MB HD space Sound:Windows compatible sound card. Additional:Older Intel graphics cards may have slowdown issues.",
    "recommended_requirements": "OS:Windows 7 Processor:2.0 Memory:1024 MB RAM Graphics:OpenGL 2.0 Compatible. ATI, NVIDIA or Intel HD. Hard Drive:900 MB HD space Sound:Windows compatible sound card. Additional:Older Intel graphics cards may have slowdown issues.",
    "reviews": [
        {
            "review_text": "★★★★★    I haven't given too many games a 5 star rating, but this game sure does deserve one. I can't believe how one game can get me to invest so many hours in one sitting. This rarely occurs for me due to health reasons. Sitting that long. The gameplay is outstanding, graphics, sound, music, everything. And this is a port? I'm surprised. I believe I've reached level 14 and there's much more to go and it just gets better with every completed level. Don't pass this one up if you like destroying everything. Worth a play for sure. UPDATE: I forgot to include the tip, to make sure you use a controller because it's so much easier on your hands and switching between weapons. And it never crashed on me once after completing the single player campaign, unlike some AAA titles out there. If you're running Linux? Check the forums for the game starting properly too.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game and easy to play. Time or no time. Its all up to you. Thats a nice touch. Finally a game that you can tailor how you want to play it. What an idea. The graphics are good and clean looking. I played it with an xbox controller. Sound is good as well. I liked this game a lot more then I thought I would. The game has upgrades like better speed and such and alternate weapons like a bomb strike and a machine gun. Very good. 8/10 not deep but a good arcade shoot em up.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very good game for the money...",
            "review_score": "1"
        },
        {
            "review_text": "Graphics : 5/10 Music : 5/10 Gameplay : 5/10 Story : 5/10  Overall : 5/10",
            "review_score": "-1"
        },
        {
            "review_text": "good manybe tank is much good but tank style is too little",
            "review_score": "1"
        },
        {
            "review_text": "The misleadingly named iBomber Attack is a game that has nothing to do with bombers, and everything to do with tanks. Specifically, it involves tanks blowing up lots and lots of stuff from a top-down point of view.  This is not a game with revolutionary graphics. It does not have an engaging storyline. There is no music and most sound effects consist of explosions.  And yet, it is fun.   There's just something addictive about systematically blasting a building to pieces to get at an enemy on the other side. Or blasting anything to pieces really, since almost anything you encounter can be destroyed. You may start out in a pristine rural village with cobblestone streets and majestic fountains. Rest assured, by the time you've finished the level the whole place will be a smoking ruin - hells yeah!  The controls are easy to master. You do get the ability to buy various upgrades and weapons for your tank as you complete missions.  The game is single-player only, with both a campaign and a survival mode. You're looking at several solid hours worth of mindless entertainment for a reasonable price (I bought the game for one dollar).",
            "review_score": "1"
        },
        {
            "review_text": "I expected a mobile game with little no depth. The opening menu and options are very mobile like, but don't let that full you. This game is pretty great. It plops you on a large map with non-linear objectives. If you like mindless shooting, this game will be great for you.",
            "review_score": "1"
        }
    ]
}