{
    "app_id": 219780,
    "name": "Divinity II: Developer's Cut",
    "release_date": "2012-10-29",
    "developer": [
        "Larian Studios"
    ],
    "publisher": [
        "Larian Studios",
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Fantasy",
        "Open World"
    ],
    "achievements": 0,
    "positive_ratings": 2001,
    "negative_ratings": 441,
    "price": 14.99,
    "description": "Dragons: they have been hunted, they have been slain, but now the hour to strike back has come.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/219780/header.jpg?t=1473764310",
    "minimum_requirements": "OS: Windows XP SP3 or higher Processor: Intel Core 2 Duo 1.8Ghz or equivalent Memory: 1 GB RAM Graphics: Nvidia GeForce 7600 with 256MB RAM or equivalent DirectX®: 9.0c Hard Drive: 15 GB HD space Sound: DirectX9.0c compatible Additional: When running Windows Vista or higher, double the required memory",
    "recommended_requirements": "OS: Windows XP SP3 or higher Processor: Intel Core 2 Duo 2.6Ghz or equivalent Memory: 2 GB RAM Graphics: Nvidia GeForce 8800 with 512MB RAM or equivalent DirectX®: 9.0c Hard Drive: 15 GB HD space Sound: DirectX9.0c compatible Additional: When running Windows Vista or higher, double the required memory",
    "reviews": [
        {
            "review_text": "Great underappreciated RPG. Big world, multiple ways to approach most quests, tons and tons of content. My favourite thing about the game is that you can read people's minds for a fee, leading to all sorts of cool situations.  Very recommended, give it a try if you have the time.",
            "review_score": "1"
        },
        {
            "review_text": "One of the few RPG that features heavy air battle, and lets you walk in air battle maps; One of the few RPG where you can almost mind read everybody, with voiced results; One of the few RPG where you have access to both crafted and random generated gears; One of the few RPG whose script writers still practice the forsaken art of limmericking; One of the few RPG where dodging attacks is actually fun and jumping around is not only glitch free and liberating.. the list goes on. This game puts loads of 'open world' games to shame in terms of what you are allowed to do.",
            "review_score": "1"
        },
        {
            "review_text": "First off, let me start by saying; GET THIS GAME.   I'll explain, I've played many open world (and closed) RPG games, and I can honestly say this rank among the top 3 for me. I played this game ALL THE TIME on the Xbox 360, and I'm SO GLAD that PC had a version of it aswell.  This game, is a game you can VERY EASILY sink hundreds of thousands of hours into, and I honestly mean that.  I'll get to the pros and cons, but seriously, just buy this game. PROS: The dialogue is funny, crisp, and refreshing. There are SO MANY WAYS to approach any scenario in the game. A conversation which can end in bloodshed can just as well end in a new ally gained. VERY GOOD if you enjoyed some of the older Dragon Age games. The storyline is amazing and feels so intricately designed. The characters are unique and memorable and bound to earn your love. The gameplay is dynamic and well polished.  Combat is intense and you have a vast array of weapons and spells to tailor to your liking. There are SO MANY quests, and each and every one of them feel unique and crafted with love, not following standard RPG clone formula. The music, the environment, the creatures, all of which are aesthetically pleasing on a grand scale. Every location is beautiful and unique, and you actually feel immersed. The load times are very short, which is nice when you just want to get into the game and play.  CONS: While I cannot necessarily fault the game for this, I still must bring it up. The content was heavily reduced and many features and areas were cut for the sake of portability to consoles. No mod support. I feel like this is key for maximizing the life span of an RPG game (look at bethesda titles.) Combat, while I did praise it in the Pros sections, it can be a tad bit clunky at times.   That's it. I really can't think of anything else to write here.  If you're like me, and love beautifully crafted games...buy this game. If you're STILL hesitant, at least get it on a sale, they have them pretty frequently.",
            "review_score": "1"
        },
        {
            "review_text": "'Victory is mine,' my character declared as she slayed a rabbit for the first time.",
            "review_score": "1"
        },
        {
            "review_text": "This game does NOT hold your hand. I thought playing oblivion was enough, but it obviously wasn't. There isn't a convenient marker that shows you exactly where to go. You have to memorize the direction given from NPCs and actually use clues given throughout the game.  Although that makes it alot harder, it does well to add immersion. I'm liking it so far.  The only gripe I have is the combat. It's a bit clunky and dated, and it shows. But everything else makes up for it enough to earn a thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Rating: 8.5/10 Very Good  ===  NOTE PLEASE READ  I have only &lt; 1h of game time because, since i have Windows 10, i must run the game via an external .exe to make it compatible. Steam does not log played time with this different .exe  I have played 100+ hours and did all side-quests i found.  ===    Pros &amp; Cons",
            "review_score": "1"
        },
        {
            "review_text": "This. Game, Man!  This is one of the most inspired games out there, it's more than clear that this world was developed with love and passion over the desire to make profit and sales. Gameplay is somewhat floaty and will require some getting used to but offers an amazing range of variety and clear and significan progress as you level up.  The story is nothing too shocking but a good one nonethless, I enjoyed it even though it was predictable and average, you might not be to impressed here.  The game's world and art style is what drew me in the most, it has amazing towns, very classical looking while offering new area that will later spawn nostalgia if you play long enough.  Humor, something not common in RPG's but this one does splendidly well, even though they try and present this serious and critical situation of dragons and demons, the character's dialogue can be hilariously cliche and the developers clearly spent time focusing on making this game what it really is, a game. Of course one can demand immersion from RPG titles but do not go into this looking for that. The dialogue is clearly written to lighten up the feel of the game and bring smiles without breaking your experience.   Voice acting is mediocre with no lazy work, all characters are voiced professionally and respectfully. Although the game promises an open world, the player will have to make some progress before in the story to reach the core of the game, having the dragon power, and even then the game continues to be a challenging one.  In the end this stands a solid RPG made by a very dedicated and passionate team, although by no means a triple A title, the game holds a firm standing in the RPG genre as a unique and creative title. Play.This.Game.",
            "review_score": "1"
        },
        {
            "review_text": "Divinity II: Developer's Cut is a fun game with nice visuals and it was well worth the money. :) Enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "One of the most underrated and forgotten VERY GOOD game of the last decade.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. The game is very easy to learn. The graphics the scenery alone is fantastic. It is like looking at a painting each time. Much detail just went in to this game. The gameplay is quite easy. The battle also easy which could be a downside for some. Sometimes the success of your character in battle relies heavily on the equipment you have rather than the actual level of your character. Regardless of what everyone says, this game is just worth every penny for it. =)",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most fun RPG's I have played in awhile. Deep Skill customization to make the character like you want him or her to be. Want to be a unarmed preist who can beat his enemies into a pulp with his fist and summon deadly monsters to aid him, no promblem. Want to be a powerful mage who can still use a giant hammer and still be effective with that hammer while burning your foes in fire, go for it. I wish more games were like this one and that the devs would make another one like this instead of Divinity original sin or Dragon commander(still great games but I want another rpg third person game like this one) I give it a 10/10   If you don't like to know about the story don't read on some people may consider it a spoiler     The game also has a pretty awesome vilian named Damian who wants to destroy mankind for killing his girlfriend, he is soulbound to her before she died so he became immortal (soul bound is when you use magic to bind your souls, if you die, they die or reversed, but it also works on the soon to die in a different way). The game starts out as you being a initiate to a elite force of dragon hunters called the Slayers. Your mission is to hunt down the last dragon knight and put him or her to death. (dragon knights are people who can turn into dragons) well this dragon knight screws you over by forcing her powers on you and ruins your life. I'll let you figure out the rest. I give it a clear 10/10 can play the same game hundreds of times but to be warned it is almost as hard as darksouls on normal, so do every side quest before even thinking on taking on the bossess.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, really enjoying it. The voice acting and dialogue is just great, always refreshing. I normally skip the boring RPG storys and the droning dialogue of main/side npc's, but in this game I look for people to talk to just to listen to the random interesting and often helpful things they come up with.   The story is just great all around, and I have been actively having fun the entire time I have played (bar the beginning half-hour of same-ol same-ol introduction).  The side quests are refreshing, with often intriguing story's and interesting things to try to accomplish and puzzles to complete.   I am always surprised when I stumble across yet another random secret, the lengths Larian Studios went to come up with so many secrets that I am sure many people never even see.  I would rate this in the top 5 RPG's I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't Skyrim but that doesn't mean its not any good. This game has been one of my favorite RPGs. One that I will go back to time and time again. It can be over the top, cartoonish, and childish at times but thats what gives Divinity 2 its charm. Days worth of content await and much more for the player who's willing to overlook its dated gameplay and graphics. Combat may not be as easy and the entire experience may vary per person. Dialogue can range from rich to shallow humor, but with the amount of easter eggs and homages, one can be sure that conversation can be quite a treat. The dragon form is one of the best aspects of the game as it is unique in itself. I found myself flying a good bit of my playthrough and just attacking fortresses in the areas presented. There are some glitches and bugs that can make it a chore to play at times but nonetheless it is a very good game that blends two distinct genres. My only regret is that Larian wasn't able to make this game the way it was supposed to be due to budget cuts. Its not Skyrim or Dragon Age but it is still quite a gem of a game and highly underrated, that is if you are willing to overlook its flaws. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "A superb game Pro:  Excellent RPG Good and totally unexpected twists Although you will make use of skills, it is not a game where you just order up all your attacks in advance, you will have to do the fighting (I found being a ranger with a little summoning good)  Cons: I do not want spoil anything, but I feel like, storywise, this game ended up contributing little to the divinity universe. I have only ever played this and Original Sin but I still feel this is true. Whilst the main game runs for about 40 hrs and the expansion another 10-20, I feel like there should have been more areas to explore.  Overall: Great game, get it, especially on sale. My cons in this cause are simply things I wish they could have done more with, what did do was superb.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG games I have ever played. Very strong story and characters",
            "review_score": "1"
        },
        {
            "review_text": "I like this game but the sky and lighting for me was overpowering, even after messing with settings. It could be just an AMD thing, who knows?   The good   Big and strange world to explore. I stress strange Lots of different ways to configure your character Bright and dazzling world (but see the bad too) Interesting in-game lore and history  Doesn't hold your hand in regards to quest progression, what to do etc. Some pretty funny in-jokes and pop-culture references Amusing dialogue and voice-over at times Excellent spell and combat effects Mindreading people adds a new dimension to gameplay Great armour and weapon modelling Challenging boss fights Flying and fighting as a dragon!   The bad   Game takes its time to get going. You're halfway through it by the time you get to be a dragon, own a tower etc It could well be my graphics card (390x) but the world is very shiny and bronze-y, Everything glistens and reflects. Makes many environments washed out Occasionally weird and strange music that's off-putting, and a touch inappropriate for a fantasy game IMHO Some generic step and fetch it quests Game is brutal, even in easy mode Some very generic dungeons The fact that it can be difficult to figure out what to do next or where to go may throw off some players",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. Played it to completion. Decent story and good graphics.",
            "review_score": "1"
        },
        {
            "review_text": "It was far the best experience for me in the past years on the RPG genre. I played out this game back in 2011 (2010). I still admire Divinity 2 just as it's predecessors. The story, the music, the gameplay mechanics, the RPG elements, tha atmoshpere, the funny parts are all trademarks of a good Divinity sequel. For me the Divinity games are like Morrowind or Fallout. Pure, deep and rewarding experiene.",
            "review_score": "1"
        },
        {
            "review_text": "This game is another Larian studios product and it is very very interesting game-i played only Developers cut version so i avoided all bugs and enjoyed the game a lot.It is brilliant RPG very original with the dragon morph and very good graphics the weak point of this game is the end of the base game which is sad and strange.  Rating: 90%",
            "review_score": "1"
        },
        {
            "review_text": "Divinity 2 is like poor man's version of game, where you combine Dragon Age: Origins, Drakengard series and Witcher without boobs. But it's hard to say, should you buy it or not. It has little charm, but it doesn't reach those expectations about those combined games. I still give it a recommendation, but i wouldn't buy it for full price. If it's in -75 %, i would check it out.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly one of the best storylines and play through i've played on an action based RPG. Great Game",
            "review_score": "1"
        },
        {
            "review_text": "A decent RPG with standard loot, stats progress and skilltree. What different this one from others how ever is none boring quests, there not much kill this, deliver that and repeat. Also your choises will change your game story and you may read NPC's minds with the cost of XP giving you more information or additional quests and treassures. The game is filled with humor and refrences, just the way i like it. You may save whenever you like, and with perma death you will have to. I don't know why they even had perma death with unlimited save, could as well had some kind or respawn rather than letting the player replas the content they forgot to save. I had a few problems where i managed to get into places where i shouldn't and thought that was a part of the current game but if It's not obvious, it's propably not how It's done :p It's not 100% polished, you might need to look the quests up on a wiki and it could have had a bit more different mobs but if you like RPG and enjoy conversations, decisions and story this is a game for you. A few hours will quickly pass.",
            "review_score": "1"
        },
        {
            "review_text": "I was expecting an average action-RPG, but this turned out to be a bit above average due to interesting writing, fun combat skills, and the built-in developer cheat mode. There's lots of crafting and upgrading to be had here, along with some ill-advised jumping puzzles and puzzling aerial combat (which I didn't mind, but I could see someone really hating).",
            "review_score": "1"
        },
        {
            "review_text": "I don't have enough thumbs for this review. I pulled a 12 hour marathon when I started playing this, and I *never* really marathon games these days. Definitely reccomended for anyone who, at the very least, liked Dragon's Dogma or similar ARPGs.",
            "review_score": "1"
        },
        {
            "review_text": "Worth looking into (somewhere between Morrowind and Baldur's gate in my mind, your mileage may vary)",
            "review_score": "1"
        },
        {
            "review_text": "A very decent hack n slash RPG",
            "review_score": "1"
        },
        {
            "review_text": "A very decent hack n slash RPG",
            "review_score": "1"
        },
        {
            "review_text": "A hidden gem, even if lacking some polish, with lots of charm to it's writing. The game doesn't hold your hand like modern RPGs with quest markers and shining ingredients and you might walk into areas with enemies way over your skill level, so watch out if you're not into games that may get a little rough.",
            "review_score": "1"
        },
        {
            "review_text": "If you like story-driven RPG games, I think you'll love Divinity 2. This the second game I've played from Larian (the other being Divinity: Original Sin), and I can say, I'm extremely impressed by this studio. Larian manages to incorperate almost every character and every location on the map into a quest of some sort. This game feels extremely deep and broad in its scope, and it shines with its great expansive dialog, huge item sets, and multiple playstyles. If you're new to the series, the gameplay for Divinity 2 is a positive mix of The Witcher and Diablo with an original, epic, story and top-knotch writing. It had the rare mix of being fun to play and fun to explore. I enjoyed playing it immensely.",
            "review_score": "1"
        },
        {
            "review_text": "I like the Torchlight/Diablo-style games somewhat, but I love the way they did this game a lot more. I prefer these third-person, open-world RPG's.  If you like the Tomb Raider-like gamestyles then this is the game for you. While the combat isn't exactly what most gamers would like, it was more than satisfactory to me.  Personally, I hope the next Divinity game plays in this style instead of the Diablo/Torchlight style.",
            "review_score": "1"
        },
        {
            "review_text": "i recommend this game for everyone who loves to play a open world rpg.",
            "review_score": "1"
        },
        {
            "review_text": "I love Divine Divinity and played to the end twice. After the sequel: Beyond Divinity's fault i afraid to buy the third Divinity but this is a good surprise in any aspect.  + fantastic mood / atmosphere + not traditional but very great and unique soundtrack + great visual ( also optimised well / less than three year old game runs very smoothly in ultra settengs on a six year old gpu ) + fast and enjoyable action ( fighting agains enemies is fun ) + perfect learning three ( allow me to upgrade my character / skills in that way i like ( can mix cross-path skills ) + interesting npcs and their side stories ( lot of them finished in the jail because of little dirty secrets of them :) + played hours without a crash, glitch or any sign of a bug ( yeah, this is not made by bethesda :) + i always start female caracter when it is possible, and this one is soo sexy and her body just dance all the time ( maybe something wrong with me ?! :)  Currently, i can say only one thing that bothered me but i liked every minute i've played!  - No quest markers ( yeah, we are hardcore and we don't gide your hand ) is a quite annoying when a lot of active quest in the pocket ( i need to remember what an npc said or digging it from that stupid log ):. - Ok, the keara's flying fortress mission is blow up my brain. The 'logic task' with the statues is more than i can handle! I wish the creators die slowly and painfully and rot in a pit full of the most slow and painfull poisonous animal. I hate you guys! Die! Die! Die! Die! &gt;:E   I think this game is underrated a bit but i think this is a very-very great and fantastic one !",
            "review_score": "1"
        },
        {
            "review_text": "Divinty 2 managed to keep me interested in its gameplay for at least 10 hours, which can be rare in single player games. During that 10 hours, I found my self very interested, however the only thing I felt was lacking was the Combat system. It felt too simple for me; and while its been quite some time between writing this review and playing it; I still felt like it was overall a good game. I did not stick through till the end of this game, mainly because it started feeling like an MMO. I was just running around doing the same things over and over again, and that was all I could look forward to doing in the future of the game.   Still, I recommend this game, as I know that there are many gamers out there who enjoy this; and I did find some enjoyment within it. It was certainly worth the low price I had paid for it, as it was on sale at the time.",
            "review_score": "1"
        },
        {
            "review_text": "One word would be enough to describe this game: Excellence.  I bought it long time ago,played it on some non-steam version and finished it twice. I bought it having in mind the old 'Divinity' games and it turned out it's something new.Despite being diamterically different of the oldies I liked it. Do you feel the ancient fire inside? Buy this awesome game and enjoy it!",
            "review_score": "1"
        },
        {
            "review_text": "Best single player RPG I've played finally got it on PC I've been hundreds of hours into this on console amazing replay value and TONS of builds you can test out",
            "review_score": "1"
        },
        {
            "review_text": "It's got a lot of rough spots, but it isn't easy mode and it's a very fun action RPG. It's certainly better than a lot of the shallow stuff Obsidian puts out, and those are considered triple-A titles. Grab it when it goes on sale. You'll have a lot of fun.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Humorous too. And cheap. You won't regret buying it.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody love this game.",
            "review_score": "1"
        },
        {
            "review_text": "'Creatures of this broken dale, fear now all my mighty gale and know the greatest mage by far, is the mighty BELLEGAR!' ",
            "review_score": "1"
        },
        {
            "review_text": "Good old fashioned dungeon crawler with lots of choices for character customization.",
            "review_score": "1"
        },
        {
            "review_text": "great game dont pass it up. i lost 8 hrs first time playing. $3.99 and im sure ill lose many more hrs. Its a very good game and i did not want to waste my money but i did and it wasnt a waste at all. great game hope to see it again with updated engine and an even bigger world.  10/10 would lose countless more hrs exploring this world!!!!   This is an update to my earlier review. The combat in this game is great as well. Its challenging you cant just hack and slash.You can see my soecs on my steam page, Im running this on everything ultra and it looks really pleasing to the eye. It reminds me so much of Elder Scrolls, but not at the same time. the story is great. so all in all for $3.99 its an amazing steal. RPG lovers dont pass this up!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. I picked it up and Beyond Divinity and Divine Divinity for five dollars during a steam sale. Best five dollars I've ever spent (although honestly, I would pay the regular $20 price tag.) I keep expecting the game to end but after 31 hours (with 95% of the sidequests finished) I realize I have only now hit the half-way point. Which is awesome. Lots of games end by the time you're powerful enough. A lot of reviews complain that the levelling doesn't make sense or the controls are awkward. If you've played Divinity: Original Sin and enjoyed it, then you'll probably enjoy this game. The writing or story isn't as good as in Original Sin but its still decent. The levelling is complicated in that if you don't want to start over a few times until you find a good build you should just look up a character guide. I spent 20 hours in Original Sin finding a good character set up, so I just went straight to a character guide. As far as the combat, its not the most polished, but its functional, works well, and is enjoyable.  The best part of the game is where you get to turn into a mother ♥♥♥♥ing dragon. I didn't even know you could do that when I bought the game. Its awesome. It makes travelling around really fast and if your human character is a little awkward when it comes to fighting, its the complete opposite for the dragon. Everything is smooth and fast and exciting.  I'd give it an 8/10. Definitely worth the $20 price from a game length aspect but you can easily pick it up for a lot less since it goes on sale pretty frequently.",
            "review_score": "1"
        },
        {
            "review_text": "Game is about 40 hours of decent paced gameplay , could probably cut that donw to 35 easily if you wernt wandering about clueless like myself   Its a decent story , combat is good for the time period and moral choices are brushed on lightly . 8/10 .",
            "review_score": "1"
        },
        {
            "review_text": "A fun and challenging RPG for anyone to dive into Whether you're cutting down the undead, kicking bunnies because it's humorous or knocking wyverns from the sky, it is well worth the buy in the end",
            "review_score": "1"
        },
        {
            "review_text": "Played it when I was younger. Played it again when I was older. Still love it. It's a funny rpg. Plus you can transform into a dragon.",
            "review_score": "1"
        },
        {
            "review_text": "YES YES YES!!!  Larian are probably the only company whose games I will willingly preorder, because everything they do has some kind of magic about it, and this extra-long extra-fun RPG is the best they've made before Divinity: Original Sin.  It's a totally beautiful game for such an oldie, too. Everything is just beautiful. Good artistry. The dialogue is funny and interesting, the combat is really fun, with lots of dodges, tricks and spells.. GET IT !!!   10",
            "review_score": "1"
        },
        {
            "review_text": "Nice RPG. But dragonplay sucks!",
            "review_score": "1"
        },
        {
            "review_text": "Good 30+ hours of classic RPG fun!",
            "review_score": "1"
        },
        {
            "review_text": "It's fun for ten hours.",
            "review_score": "1"
        },
        {
            "review_text": "Great :D",
            "review_score": "1"
        },
        {
            "review_text": "Overwhelmingly underrated, exceptionally belittled, ferociously disregarded. Those were just some Stupidly-long descriptions, but the point is that this game is really really good: as generic as RPGs go, but that isn't a bad thing! Infact, it works in the game's favor! Sure, the graphics are less than stellar, but the audio is good and the combat &amp; leveling are above average, there is A TON of stuff to do in-game and the writing as a whole is an exemple for all RPGs out there: it is smart, quirky, humorous and witty, by far the best part in the game. I found the puzzles to be somewhat of a challenge and i liked most of the characters (Did i mention the writing in this game?).  The storymode is divided into two parts: they are both interesting, and there is a really good twist between them. The best part about this game is that it doesn't hold your hand: you want to do something? it's up to you to figure out how to do it, you need to think in order to be successful, and that is very much appreciated. The game might be considered more of an Hack n' slash rather than a full-blown RPG, but that also works in the game's favor in my opinion. for this price, it is an absolute must. If you are lacking in money, or you might be a jew, wait for a discount (Please don't kill me i'm a jew this was just a joke...!!!).",
            "review_score": "1"
        },
        {
            "review_text": "This game, though it can be very difficult, because there is no objective marker. But how many games in the world that allow you to transform into a freakin' dragon! The storyline is good, the humor is ridiculously hilarious! If you are a RPG fan, I highly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "I played this game into the early hours of the morning every day for weeks on my laptop that was producing nearly unplayable frame-rates and singeing the skin off my palms because I liked it so much. 10/10 would receive 2nd degree burns again.",
            "review_score": "1"
        },
        {
            "review_text": "Freaking awesome game, one of the best RPG's i have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Free roaming gaming goodness",
            "review_score": "1"
        },
        {
            "review_text": "this is the best before skyrim released. for those who loves rpg game, this is one of must play rpg. (No Followers, Just Creature though)  Gameplay 8 Music 7 Graphic 7 Story 9 Become Dragon 10 Skills 5 (Lack more skills) ",
            "review_score": "1"
        },
        {
            "review_text": "Yes great game, must play RPG Clasics.",
            "review_score": "1"
        },
        {
            "review_text": "Note: that I have no hours because I found it on sale elsewhere and refunded on steam. This is a 50h game plus 20h expansion.   This game is huge with tons of skills which you are totally free to take at any time. So you can make your character do basically anything. The combat is good, same with the visuals and music. I especially like the music. The story is also above average for sure and being a dragon is pretty sick.  The drawbacks are all in the level design. Often they will trap you in a room and you must just search for the tiny book (in an entire ♥♥♥♥ing library) or key to click on in an entire area of interactables. Often these interactables will chunk you for 55% of your max hp if you pick the wrong thing. This leads to just reloading and searching for WAY too long in many places. So I strongly recommend just googling every time you are stuck so you can focus on the great parts of the game which is combat, story, exploring, and your characters development. It even has some platforming elements which are fun too.  Plus there is no fall damage so you can skydive off of towers. Later in the game you can skydive, then halfway through your fall, turn into a dragon and fly away. But in the best interests for your sanity, google through the 'puzzles' which are basically click on stuff which kills you until you find the hidden thing to click on which doesn't",
            "review_score": "1"
        },
        {
            "review_text": "I've already played Divine Divinity a few years ago and liked it, so I had really high expectations. Needless to say, the game made me fall in love with it. The graphics look good and I enjoyed the storyline so far (still haven't finished the whole game). The world isn't as huge as in Skyrim, but being able to fly around as a dragon makes up for it ;).",
            "review_score": "1"
        },
        {
            "review_text": "This game makes being a mage really fun... that's what i've been doing for 13 hours so far, fireballs and ♥♥♥♥..   48 hrs. so fun, the dialogue is fantastic, having alot of fun with this game and not even done yet... very recommended",
            "review_score": "1"
        },
        {
            "review_text": "This game, though it can be very difficult, because there is no objective marker. But how many games in the world that allow you to transform into a freakin' dragon! The storyline is good, the humor is ridiculously hilarious! If you are a RPG fan, I highly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "When I bought the Divinity Anthology, I was really just buying it for this game (but I still soldiered through Divine Divinity at least first before jumping to this one). It was worthwhile playing through Divine Divinity - there's a lot of little callbacks and references to the world and previous events that made the experience of Divinity 2 more enjoyable.   Divinity 2 is a 3rd person Action RPG with a skill tree and stat allocation - think like a combination of World of Warcraft and Diablo. My wife said it reminded her of Dark Souls (or at least watching me play it) and I can see the resemblance. Overall the system works well - it's got a nice skill basis such that you can dodge around projectiles and attacks and avoid using potions and even kite enemies around if you're ranged. The options for character customization are broad too.   The world is large and full of character, and they definitely improved the quality of voiceover from Beyond Divinity. The plot is solid with an interesting (but apparently controversial) ending. Unfortunately it does fall into the trap of 'throw dozens of enemies at them' again, with the endgame becoming a -bit- of a trudge. They do close it out with a solid final area though.  The expansion pack sold the game for me though. They took the enemy count, toned it down, and made the majority of it venturing through one town fixing problems, talking to people, solving puzzles. One giant series of side quests, essentially. It was executed really well - and then they nailed the final sequence out of the park.   Playing through the first two Divinity games to get to Divinity 2 was definitely worth the wait - and I'd even recommend picking it up outside of the anthology if you don't care about the world-building done by the previous two games.",
            "review_score": "1"
        },
        {
            "review_text": "Pick this up if you want a good third-person action RPG. It's got a good amount of exploration and free-roam, and the combat isn't the best but it's solid enough to be really fun. Also the story is bonkers and the voice acting is really good.",
            "review_score": "1"
        },
        {
            "review_text": "I have always enjoyed Larian Studios' sense of Humour and the great lengths they go to to fill their world with as much to see as possible. This game is no exception and while there are certainly area's that could be improved upon (namely the clunky combat, wonky AI, bad pathing and just moving around was a hassle sometimes) there are more positives to commend it. If you enjoy 3d action rpgs that don't take themselves too seriously but still offer an engaging story, loads of content and memorable characters, this game is for you. Overall certainly a great buy for the price, thoroughly enjoyed it :)",
            "review_score": "1"
        },
        {
            "review_text": "I bought this as part of a bundle, having no idea what it was or what to expect. Due to the bundle the game was pretty cheap, so I didn't expect much. I was pleasantly surprised.  Classic third person sword and shield adventure game with a bit of a twist.  Entertaining characters, an interesting story and fun gameplay.  The styles aren't perhaps as balanced as they could be, and some play styles are harder than others. For example, I found melee classes much more challenging than ranged classes, and that influences how I played the game, despite my original intentons.   Currently this is on steam for £14.99. Not sure if I'd pay full price for Divinity II, but if you see this in a bundle anywhere, or on sale definitely snap it up.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "I dropped it halfway, because the story and main character were kinda bland for today's standards. The reason i recommend this game is for its gameplay mechanics, which is quite nice even when compared to games nowadays. Not a really helpful review, i know...... :(",
            "review_score": "1"
        },
        {
            "review_text": "This is apparently the game after Divine Divinity? .... R U SURE",
            "review_score": "-1"
        },
        {
            "review_text": "The game itself, is a fun and great game, inspired by classic RPGs with loads of possiblities.  However, I have experienced a lot of problems with it, regadring crashing, specifically when attempting to launch the game. No matter what I do, it doesn't seem to work.  So I can unfortunately, by no means, recommend this game for having such gamebreaking bugs.",
            "review_score": "-1"
        },
        {
            "review_text": "It could have been a good game, but: -sometimes it is too horrid. -annoying magic item system: 'magic' and 'charms' are unnecessary duplications of the same. It is OK if you have to calculate which item is the better to wear but after a while it becomes annoying if there is no reason of complication. It just wants to seem detailed but it is not. -schematic NPCs -ugly graphics of the flying fortresses -no dragon form option in the expansion except the last battle  Pro: -sometimes there are funny conversations but not too often. -when you can turn to dragon that it is good (but why can not you destroy normal mobs in dragon form?)  Overall you can buy better RPGs for the price of this.",
            "review_score": "-1"
        },
        {
            "review_text": "Game won't run. CTD",
            "review_score": "-1"
        },
        {
            "review_text": "This game is sadly disappointing I started it up thinking it would be pretty impressing for how it looked but I knew it probably wouldnt be good.The customization is 3 options: Gender,Hair Options which is disappointing because it only has a few option and the last option is Voice which was disappointing because you can only choose between 3 voices that somewhat sound the same. The story is really something you would see in a better game and the combat is really disappointing. That is why I give this game a no.If you want a better game for the same price I recommend: Dishonored.",
            "review_score": "-1"
        },
        {
            "review_text": "its the third time the fix the game and it still broken ...",
            "review_score": "-1"
        },
        {
            "review_text": "pros cant think of any  cons what the **** do I do? No guideance at all. movement and jumping are horrible combat is boring",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes on boot after the intro video with no error. Was not able to resolve this issue. Waste of money. (all other steam and non-steam games start and run fine. windows10) ",
            "review_score": "-1"
        },
        {
            "review_text": "This game has difficulty spikes that were supposed to have been fixed in the Dragon Knight Saga patch. It is unbearably painful to play in these difficulty spike areas, given how generic the combat is no matter how dumb the AI acts. This game starts off painfully to the point that I wouldn't recommend it, no matter what happens later on in the game, simply because it is too frustrating to get past the initial hurdle. If you want to play this game, know full well that it is easy to break a character build that will be unable to progress past future enemies, a flaw that they attempted to fix by cutting down enemy health and damage. Larian studios, although making improvements to their combat in their newer titles, completely failed here and left a mediocre combat system in this game. If you want to make a game functional, don't start off a player's stats at 1, this is not an mmo, though they certainly designed it to feel like one for the basic human character. At these stat levels, it was bound to happen that they would encounter problems balancing enemy levels and stats early on. On a plus, you at least have cool combat animations.  The jumping mechanic is glitchy at best, don't blame yourself if you jump in a stream and cannot get out easily. The ending is garbage and cliche, you spend the entire game listening to cutscenes of the villain making grandiose speeches in front of you. The expansion also has a mediocre ending, although it at least makes you happier than the base game with its conclusion. The engine is on par with TES Morrowind, but many times less enjoyable or memorable. The dragon mechanic is a cheap gimmick halfway through the game, with completely uninspired flight mechanics and nominal mmo interfacing. I can guarantee that half of the positive reviews are waxing nostalgia for the franchise, which is deserved given how much better its previous titles merit. Absolutely the worst of the franchise, skip it if you don't want to be screwed over by the story and forced through repetitive and pointless gameplay. The only upside is that the side quests are at least original and interesting in the choices you can make, never painting a black and white picture.  I honestly do not know how people tolerate this game to play it through. The core game is entirely flawed, such that there is a limited pool of XP, nothing respawns, you literally have to beat every side quest to have the XP to make a good character build. There is nothing enjoyable about the combat, it even takes away from the enjoyment of playing the game. It is a torture to try and beat the game when you are instantly dying because you didn't pick the boilerplate max stat character build. This game had so much potential, the combat engine ruined it entirely for me. I'm glad I got this on sale for less than three dollars, it is not worth anything more. I don't hate games often, but this has caused me serious grief and I regret every minute I spent playing it.  Before the Dragon Knight Saga, this game got between a 6 and a 7 on many review sites. Even with the Dragon Knight Saga, it still deserves the mediocre score, and nothing can redeem this game besides a complete re-make.",
            "review_score": "-1"
        },
        {
            "review_text": "maybe if the game would load past the start up i could review it well. the comunity has many people with the same problem. i meet all system requirements. upon start the main menu will load where you can choose normal mode or directors cut. also treasure vault videos ect. when i click to start either normal or directors cut the screen goes black like it wants to load then force closes. shows no error msgs or anything. would really love to play the game since i enjoyed the others. wish you would patch n fix. i use windows 7 home :,(",
            "review_score": "-1"
        },
        {
            "review_text": "To be fair I haven't played the game as much as I should to give it a fair shake, but to me, its one of those games that I just can't be bothered to play, I'm sure its good, but for me I just found the first area after the tutorial to be far too boring, I never really made it past that, and I honestly don't care to proceed either.",
            "review_score": "-1"
        },
        {
            "review_text": "Rubbish just rubbish. The combat is uninteresting and then turn out to be the only thing in the game pretty much. Many encounters just consist of the same few enemies. You have to wait forever for you recuperate your health. I specced full mage and each encounter just turns into waiting for your mana to get back, you have juice and drink, but it still takes time.   The plot as far as I managed through it seems horribly generic, but I can't really comment having only played a few hours. The quests are all kinda generic and rewards a bit naff.  I just can't recommend this game in anyway shap or form even if it was £3.",
            "review_score": "-1"
        },
        {
            "review_text": "The lagyest game ever i can run Crisis 3 on ultra 60 fps on ultra and i cant run this game on low without lag spikes up the A**",
            "review_score": "-1"
        },
        {
            "review_text": "I gave this a good try and it was just generic as ♥♥♥♥. Combat is weak, feels dollar store generic, has no 'oomph' to it, and there were no objective markers on my map so you just have to explore until you find something and either you have a quest for that area or you dont. Game just felt generic and clunky-clanky. And combat consists of pounding mouse 1 until something dies and using a few skills. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "If you are going to offer a game for sale it ought to run on modern hardware without requiring downgrading Physx etc. I give this game a zero.",
            "review_score": "-1"
        },
        {
            "review_text": "Game doesn't have native controller support, requires a 3rd party program such as Xpadder to function.  Game's camera feels choppy/is stuttering, Some kind of FPS problem? Still searching for a fix. Might have to refund if this can't be resolved.",
            "review_score": "-1"
        }
    ]
}