{
    "app_id": 219760,
    "name": "Beyond Divinity",
    "release_date": "2012-10-29",
    "developer": [
        "Larian Studios"
    ],
    "publisher": [
        "Larian Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Singleplayer",
        "Isometric"
    ],
    "achievements": 0,
    "positive_ratings": 150,
    "negative_ratings": 131,
    "price": 4.79,
    "description": "Beyond Divinity is the follow-up to the award-winning Divine Divinity.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/219760/header.jpg?t=1447356548",
    "minimum_requirements": "OS: Windows XP Processor: Pentium 4 1.4 GHz Memory: 256 MB RAM Graphics: DirectX compatible 3D card DirectX®: 9.0c Hard Drive: 2300 MB HD space Sound: DirectX compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The tutorial/learning curve is the only hard part about this game. It is frustrating in the beginning and you die often. Here is my tip to get past it. save alot, and RUN if it seems impossible. At first, you need to click on top right icon to select and play as the death knight. Now near top right is option to 'Select all' You can now fight and control both people at once. You can right click items to send to opposite character if it suits them better. Also click on potion symbol to access all the potions you have, but you have to click it for the corresponding character to heal them.  Also near top right is option to set your secondary skills. I set the human to lockpicking and skills can be upgraded via vendors to either add new skills, or in essence increase the max level your skills can get to. If you skip one of the imps, it may not let you get skills to +10 as the imp allows. (Thief skills like pickpocket, sneak, lockpick, etc) I would make sure to talk to him and get enough money for atleast lockpick 10)  The torture chamber master seems impossible. Just backtrack after getting some keys to the burning area that you started at where you first meet the death knight. There should be a small bow in top left area beyond previously locked gate. In battle press space much like dragonage origins, and make sure to click select all and then click enemy and unpause. I control the deathknight to hold aggro and have human archer stay back. Your bow will eventually break, but as soon as you can warp back to base camp from the key you can buy repair skill up to level 6, drag the basecamp key into your inventory and topright skill menu, you will see ability to warp to battlefield, which is an area with many shops but also areas to level up at. Skeletons won't level you up so skip the long dungeon full of them. Once you get a little further where you fight deathknights in chambers, you will soon find another battlegrounds upgrade to lvl 2.   You can now access new dungeons around lvl 7 area (Keep crossing bridges to the right of battlegrounds to reach these crystal staircase like places) You can only reach the new ones as you get higher level battleground keys.   Look for levers around, hold ALT to see items. Make sure to find a large key that allows you to travel to battlegrounds.   SEE ISN'T IT EASY TO FIGURE OUT_ OF COURSE IT IS! I recommend playing divine divinity first, i got to lv33 in divine divinity, and want to play through both of these before i get into divinity original sin further. Great game, but not as good as divine divinity, but it feels like an accomplishment to get into this game and overcome the learning curves, to get a new experience much like the previous game, but with gameplay that reminds me a bit of dragonage origins.",
            "review_score": "1"
        },
        {
            "review_text": "Another game breaking issue with lag when you hit the open land. I can play witht he lag but I don't have that much time to see a min. go by while I wait for five steps. Searched a few fix but nothing helps. Game test showed 60 fps.",
            "review_score": "1"
        },
        {
            "review_text": "Good sequel, althought it could've been better. Just evade Battlefields, because they ruined something about this game. 8,5/10 worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Another classic RPG on Larian Studios belt, this time with a cleaner setup(albeit a more confusing one), you find yourself cursed alongside one of the Elite Guards of Samuel, a Dark Knight who refuses to tell you his name, in order to remove the curse you must find Isolde, the Dark Knight's former mistress, but the jorney is far less easy and simple than first thought.",
            "review_score": "1"
        },
        {
            "review_text": "I've never tried divinity before this. Boy, was this an awful way to get into the franchise. I just hope this game doesn't reflect the other Divinity games. Though, to be fair, I did get warned by the reviews that this was one of the worst ones when I bought it. You start off at the character creation screen. And right off the bat i'm jaw dropped at how awful the graphics are on my character. So I note that down and go about creating my chracter. The classes are Warrior, Wizard, and... Survivor? I think you mean *Thief*, Divinity. Anyway, the character creation is pretty bland. I think you have the choice of like 5 or 6 hair styles and you can't really change your appearance at all. So I pick my stats and my generic character, and I think: ' Okay now I'll spawn in. ' Nope. Without explination, they throw you into ANOTHER creation screen for some guy called the death knight. I thought they turned my character into this guy. So naturally, i'm like: ' What the hell divinity? I wanted to be a thie- er uh.... a *Survivor*... Not a knight?' So tack on an additional five minutes of fumbling with the menu before I realise he's your companion. Could've EXPLAINED that to me. So you start off in a jail cell ( The elder scrolls called, they want their plot back ) and the knight that I had trouble with in the menu comes up to my cell, to speak with me. Real quick, have you ever played a new game and something bad happens and you think: ' Oh No.... It's gonna be one of THOSE games... ' Well this was one of those for me. In the next 60 seconds, two things about this game became crystal clear. 1: The voice acting... Is some of the worst i've ever heard in a video game. 2: The story is REALLY bad. I'm not even gonna talk about the story. Just google it if you're curious. I played maybe 10-20 more minutes of this game. It's isometric, which is fine. I love the clasic fallout games so i'm used to isometric. In fact, the isometric combat is the only SINGLE thing this game did decently that I can name off. And it's only decent. I also should mention, the backgrounds suck. They're ugly. And why is this dungeon that looks like something from the 9th circle of hell being gaurded by dumb generic soldiers that adress you with ' HEY UHH ERRR HOWD YOU A GET OUT OF YOUR A CELL YOU'RE ONLY LEAVIN HEAR IN A COUGHIN (I know it's coffin Lol)'. Just awful. The exit was locked so the knight recommended I search the cells for a key or something. I try, and something comes out and one hit kills me. Thus marked the end of my adventures in 'Beyond Divinity'. Honestly this game was awful. I got it for like $1.49, and i kind of want my money back. I can't recommend this game to ANYONE. Sale or not. There are better isometric games, and better RPG titles. Every little thing in this game is either a HUGE flaw, or a small flaw that adds up when put together with other flaws. This game SUCKS. 3/10 Simply because the game functions. Hopefully the other Divinity games are better.",
            "review_score": "-1"
        },
        {
            "review_text": "The original Divine Divinity was waaaaay better than this crap. This game is so screwed I can't even get out of the first dungeon! I don't know how the game rolls for hits but I always get killed by the first guard I see..even on Very Easy..because my character can't hit for ♥♥♥♥. Loading the game up for the first time you'll instantly feel that it's wrong..very wrong..like rushed wrong. You'll have a much better time playing the original than this poor excuse of a sequel.",
            "review_score": "-1"
        },
        {
            "review_text": "Well i play long time ago divinity divine and like but i kind dark ambient (remenber a little olds diablos) sometimes have a little bug when a kill fergus drop a saber i can pick up but nothing like a quick load dont fix,. Buy in sale if love old classics rpgs i love this game so far.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a follow-up story to Divine Divinity--although Larian never conceived of it as an actual sequel. It has much in common with DD, but is less ambitious in scope and not as open (two of its four acts are quite linear). I guess I'm one of the minority who like it about as much as the original title.  BAD  - For me it was a bit glitchy--occasionally crashed entirely, with other (non-game breaking) bugs, such as a quest log that wouldn't scroll down and would go wonky on occasion.  - Some of the things it tries with the builds don't quite come off. For example, some of the skills simply don't have their advertised value. (Advice: do your research ahead of time, and this won't be painful.)  - As others have noted, the voice acting ranges from mediocre to bad. But sometimes the badness is amusing. (My favorite was when a single character was voiced by two different actors in the same dialogue, with different accents and everything.)  - The balancing isn't always quite right. The first act is a bit too difficult relative to the rest.  DEBATABLE  +/- Battlefields are pretty boring if you actually go through the tedium of clearing out the dungeons. But I actually think the mechanic of having these optional areas works out well--you have merchants whenever you need them, and if you feel like grinding for levels, it's there for you. (Note: I did the Act I battlefield dungeons and skipped the rest.)  +/- Unless you really want to tackle those battlefields, this game is smaller and less open than DD...but for my money, that's not really a problem.  +/- The overall story makes a bad first impression (it looks at first blush like a haphazard mess), but a very good last impression (the pieces end up fitting together). Unlike at least one other reviewer here, I think the last act is the best part of either BD or DD.  GOOD  + Good ol' Larian goofiness is back. The subquests still have that flavor.  + I think the puzzles here are often pretty clever, and they come at you a bit more quickly than they do in DD--especially in the (more linear) first and fourth acts.  + Having two characters to control adds another layer of strategy missing from DD.  OVERVIEW  If you want the finest of Larian's stuff, pass right on by and look to Original Sin. But if you're on a Larian kick, there's really no reason to skip over this title--it's perfectly enjoyable.",
            "review_score": "1"
        }
    ]
}