{
    "app_id": 219910,
    "name": "Edna & Harvey: Harvey's New Eyes",
    "release_date": "2012-10-16",
    "developer": [
        "Daedalic Entertainment"
    ],
    "publisher": [
        "Daedalic Entertainment"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Point & Click",
        "Adventure",
        "Dark Humor"
    ],
    "achievements": 29,
    "positive_ratings": 1674,
    "negative_ratings": 162,
    "price": 15.99,
    "description": "From the creators of the award winning games “The Whispered World” and “Deponia” comes this extraordinary game Edna &amp; Harvey: Harvey's New Eyes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/219910/header.jpg?t=1524052454",
    "minimum_requirements": "OS:Windows Vista/7 Processor:2GHz (Single Core) or 1,8GHz (Dual Core) Memory:1536 MB RAM Graphics:ATI Radeon HD 3400 Series, Geforce 9400 Series with at least 256 MB VRAM Hard Drive:1100 MB HD space Sound:DirectX 9.0c compatible sound card with latest drivers",
    "recommended_requirements": "OS:Windows Vista/7/8 Processor:2.6 GHz Dual Core CPU Memory:2 GB RAM Graphics:ATI Radeon HD 4500 Series, Geforce 9400 GT or higher Hard Drive:1100 MB HD space Sound:DirectX 9.0c compatible sound card with latest drivers",
    "reviews": [
        {
            "review_text": "Very twisted, funny and original. 10/10 would decimate catholic school population again.  I disagree with some reviews in one key point: this game is DEFINITELY NOT FOR CHILDREN. At first the violent scenes are somewhat 'censored' (you'll see what I mean) but gore is still strongly suggested and even censored some scenes can be deeply disturbing, even if presented in a humorous way. Later on the violence gets more graphic. So IMHO, ---definitely--- not intended for kids.  Although the story and script are great and the game's biggest strength, I feel like the ending(s) were a little rushed. They should have extended them more, explain some stuff and make each of them longer and more unique. It was kind of disappointing, but I still recommend it since it's only the last 5 minutes of the game that I didn't love.  It actually lasted me around 8 - 10 hours of real game time.",
            "review_score": "1"
        },
        {
            "review_text": "English version (polska wersja niżej)  I bought Edna and Harvey’s New Eyes by mistake. It was bundled with another Daedalic game that I wanted, but I decided to give it a try and 1 hour into gameplay I concluded that if this game manages to keep similar brilliant mood and humor to the final credits, I will madly fall in love with it. In the end it didn’t, but still it is my favorite game from this studio so far. Now, that you know my opinion on the subject, let me tell you that you really should not read this mini-review since perhaps this game is best approached like a typical Daedalic point and click …  …still reading this? …  …you’ve been warned…  …because it is not the studio’s most typical game. Sure it retains all the mechanisms this genre is known for, still it seems to be bad at what most Daedalic games are good (2d art) and brilliant at everything else .   The game’s story, narration and voice acting are among the strongest I’ve seen in a point and click during the last few years. I won’t describe the plot here (not to tell too much, and you’ve got it covered on the game’s Store Page). Instead let me focus on the narration. While Lilly ( the protagonist) does not say a single word throughout the entire game (or does she … ?) the narrator does an OUTSTANDING job constantly commenting on her actions and motives, brilliantly combining the innocence of child’s perspective with the games quite sadistic sense of humor.   Regrettably, the game’s 2nd and 3rd chapters feel slightly weaker than the beginning and conclusion. As far as I know the game has three endings (two of them good, while the third one … truly awesome). A very strong 8 out of 10.    PL   Ednę i Harvey’a kupiłem przez przypadek. Był w paczce z inną grą z Daedalic w którą chciałem zagrać, zdecydowałem się jednak dać jej szansę i po pierwszej godzinie miałem wrażenie że jeżeli gra utrzyma atmosferę i humor do napisów końcowych, zakocham się w niej bez pamięci. Nie udało się, ale mimo to stała się moją ulubioną pozycją ze studia Daedalic (a ukończyłem już kilka…). A teraz, skoro już znasz moją opinię najlepiej zrobisz nie czytając dalej tej mini-recki bo w Harvey’s New Eyes gra się najlepiej kiedy spodziewasz się typowo Daedalicowej przygodówki …  ..dalej to czytasz?...  ..ostrzegałem…  … bo Edna and Harvey nie jest do końca typowym dla tego studia point and clickiem. Zachowuje wszystkie mechanizmy właściwe tego typu grom, ale grafika odstaje od tego do czego przyzwyczaili graczy ludzie z Daedalic’a. Za to voice acting (zazwyczaj tragiczny w grach tych twórców) jest jednym z najlepszych jakie słyszałem od lat, muzyka idealnie pasuje do klimatu gry (rewelacyjny temat z napisów końcowych!) zagadki są ciekawe, pomysłowe … i bywają trudne (niektóre zwyczajnie przekombinowane, inne po prostu rewelacyjne).   Fabuły nie będę zdradzał (a co, jest opisana na stronie gry) powiem tylko że razem z narracją stanowią największą zaletę tej gry. Lilly (postać sterowana przez gracza) nie wypowiada nawet słowa (chociaż … nie, nic nie powiem! ), za to narrator ciągle komentuje jej poczynania i intencje. I trzeba powiedzieć że robi to w sposób naprawdę GENIALNY. Narracja zgrabnie łączy niewinność perspektywy z jakiej patrzy dziecko z (BARDZO) morderczym humorem jakim ocieka gra.  Szkoda że rodział drugi i trzeci są odrobinę słabsze od pierwszego i rewelacyjnego finału gry (z tego co udało mi się odkryć są trzy zakończenia: dwa solidne i jedno … doskonałe). Podsumowując: bardzo solidne 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "So the 2nd part for me. I play this 1st part now after 2nd part Break Out . Its a bit long ago but i was directly back in the game, even if the parts are 2 differents in second you play Edna to Escape and now you see the beginning with Lilly. The story is curious and with many funny parts again. I love the style of Daedaldic Games and the strange art they bring in games. Enjoy this game if you like point and click adventurs or a high mid class story. You dont need to play Break out first but i find it would be better. So i give this game for the fun i had 92 % because i love Point and Click games, for others its mabe to high points, but watch trailer and decide yourself if you want play the game and how much you think its worth and than buy it when the price is fine (50% better 66-75% discount). Thank you for reading and hopefully enjoy the puzzles, characters and tale parts.",
            "review_score": "1"
        },
        {
            "review_text": "holy guacamole! i blew through this in one day and it was flippin fantastc! i cut a tendon in my thumb so i was looking for a god one handed point and click and my gosh did this deliver. i wont spoil anything, but trust me, GET. THIS. GAME.",
            "review_score": "1"
        },
        {
            "review_text": "Really amazing humor in the game, there are some unique mechanics that work really well and are well explained. First game where I screamed 'hell yes' at 'Do you want to play the tutorial?'. I can't remember the last time I've enjoyed the humor in a new point &amp; click adventure game this much, and I'd definitely rank it among the best I've ever played, and I've played quite a few.  There are some puzzles that offer the option to skip if you don't like those parts, and I find it a great idea .. some adventure games have had awful puzzles and being forced to play through them has really brought down the experience as a whole, though I've not yet had similar experiences with this game's puzzles.  I've not yet finished the game and had to really struggle to be able to stop and go to bed, a couple of hours later than I originally planned to. I can't see how the game could possibly be ruined in whatever remains of it as everything I've seen so far has been great.  There are a couple of cases where the controls and hitboxes for interactable things have felt a bit off, but overall they're still among the best I've seen in similar games. There is a well done 'highlight things I can interact with' -key, so no need to do pixel hunting either.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious! If you have a dark and twisted sense of humour you will love this game!",
            "review_score": "1"
        },
        {
            "review_text": "You play as Lilly, a small girl that doesn't seem so bright in the head. She meets different kind of people, and it only gets funnier as the story goes on!  Funniest moment: 'Kids shouldn't be having items like that....take this instead!' O_O You just end up sitting there gaping in shock, then burst out in laughter.  A short very hilarious game, with challenges and tons of fun! Spent exactly 15 hours to complete the game twice including all achievements. First round probably took the whole 10-12 hours, a few hours for some single achievements and then maybe less than 1.5 hours to complete the game over again to get 100% achievements.  Recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Well.. after picking up and finishing this game in one day the first thing that crossed my mind is: This game was worth every second playing. Actually, I wouldn't mind playing it a couple times more.   The graphics are .. something to adjust to in the first couple of minutes, but still quite enjoyable. The humor of this game is .. incredible. I sat hear laughing tears at some points.  The music get's a little repetitive after staying quite a while on the same screen, but that's alright - just think a little quicker, eh.   So .. all in all, I'd rate this game a definite 9/10.  Why 9/10?   Well damn it, I really didn't want to ♥♥♥♥ing kill Capu. I liked Capu, for ♥♥♥♥s sake. Hmpf.  ",
            "review_score": "1"
        },
        {
            "review_text": "Recently, I picked this game up in a Humble Weekly Sale, and I greatly enjoyed it. It should be noted that it is a sequel; as a result, many parts of it will make little to no sense without playing the previous game: 'Edna and Harvey: the Breakout.' I, being cheap, chose to watch a playthrough on youtube rather than buy the twenty dollar game, so that I might have context for this game. I also have a few warnings about this game. For starters, do not be fooled by the innocent exterior, this game is dark, extremely dark. It may also screw with your mind to some degree or another, especially the ending. The ending can be a no-win situation, unless you count the somewhat secret ending. I'll leave it to you to figure out how to get to that ending. This game differs from its predecessor in as much as there is a secret ending which can be considered somewhat good. Despite the darkness and tendency to mess with the head, or perhaps because of it, the story is very good and well written. This game is more than just a game, it is a story (in fact 'Edna and Harvey: the Breakout' was originally a German university project on the topic of 'The Computer Game as a Non-Linear Narrative Form.' In my opinion, both games accomplish the goal of proving the computer game as a storytelling medium very well.) I know that most games need a story of some sort, but point-and-click adventure games depend heavily on the story, bringing it to the forefront, as opposed to FPS games, for example, where story can and often does take a backseat to the gameplay of shooting things. As a result, this genre of games must be judged on storytelling more so than others. Also, being a point-and-click adventure game, it requires the usual application of combined genius and madness to figure out the circuitous solutions to the puzzles. While it is very good for what it is, I wouldn't recommend it to anyone who dislikes the genre. If your prior experiences with point-and-clicks range from 'meh' to bad, I doubt this will change your opinion of them. All of the above also goes for this game's predecessor, which I also recommend. Finally, I would like to bring up price. I have seven hours logged on this game by Steam, and I've beaten it. So I would say 20 dollars is a tad bit steep, and would suggest waiting for this game to go on sale, if it ever does. I enjoyed it, but I don't think 20 dollars is worth it, especially since point-and-click adventure games have almost no replay value. There are other games for the same price or less that you could probably get more playtime out of. So, to sum up the pros and cons of this game, it is a very solid point-and-click with a good, if dark and confusing, story, generally clever, if contrived and circuitous, puzzles, that, while generally fun, probably isn't worth 20 dollars.",
            "review_score": "1"
        },
        {
            "review_text": "A humourous game, though relatively short (unless you're looking to get all those multiple clickety achievements).  Pros: - The narrator is absolutely hilarious - Tackles morbidity in a light-hearted way - Storyline is very straightforward, as are the puzzles and minigames - Bonus for players of the original Edna &amp; Harvey game: References galore (although I don't fall into this category so I couldn't fully appreciate the nods)  Cons: - Art style is rather simplistic, though I attribute that to the game's age - Sometimes the puzzles are a bit too easy, especially comparing them with Daedalic's other point-and-click titles - A bit too many achievements that require you to click on things 200000 times  I wouldn't recommend this game at full price, but if it's on sale it's definitely worth it!",
            "review_score": "1"
        },
        {
            "review_text": "The first chapter was AMAZING. The rest was average, posibly because the start raises your expectations way to high. Great story, ok puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Lili totally a serial killer! This game not suitable for kid under 18... too many purple goo and gnome!!! :P",
            "review_score": "1"
        },
        {
            "review_text": "A story about a shy little girl with a dark and twisted secret that's so horrible even she doesn't realize it, pitted against a mad old tyrant who plans to hypnotize the children of the world into becoming his obedient, mindless slaves.  In this case, the narrator is more of a character than the protagonist, and BOY is he a better character.  Unless you do something about it.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game. I watched it as a let's Play by a fellow german youtuber and I imidiently thought 'GOT TO BUY IT!' And i was not let down.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game",
            "review_score": "1"
        },
        {
            "review_text": "After 'The Whispered World' with 9000 bugs I recalled about Edna &amp; Harvey.  Daedalic, why u dont fix ur broken games? I still have a problems with achievements (I have no achievements full playthrough), sometimes game is frozen. I love Daedalic games, but after total ignore from developers Im not sure buy other they products",
            "review_score": "-1"
        },
        {
            "review_text": "Again, vanilla adventure game but with a very funny story and characters.",
            "review_score": "1"
        },
        {
            "review_text": "A true masterpiece! A really really good adventure game but I am just not patient enough to play such a brilliant game! The visuals are stunning, it has pieces of black humour throughout and the story is just amazing! Try it if you want some challenge and you like adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "Well.. It's not game for ur kids mates.",
            "review_score": "1"
        },
        {
            "review_text": "8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is #2 so if you havent played the first one look into it. Fun to figure out what works with what. Sometimes things that you are trying or doing make no sense, however if they did, this game would be very short. If you like looking for a balloon wrench that you use to remove a real metal bolt, then this game is for you! The story is one of the major strengths of this game. Its interesting and fun. Characters from the first game make return appearances. Mini games abound in this sequel. Thumbs up for this point and click puzzle adventure.",
            "review_score": "1"
        },
        {
            "review_text": "Only the music is good in this game,the puzzles are insanly hard and some insanly easy. The story is not good,the art is not good,the animations are.....kinda good. but overall i rate this game:  2/10 wouldnt watch 20 minutes of intro again. :)",
            "review_score": "-1"
        },
        {
            "review_text": "I would like to see the click boxes and audio improved. sometimes you are ignoring an area because you think you already tried to click there but really you just missed the very edge of the click box. I think the game could work if the pace was a little faster, faster transitions, options to get out of repeat dialogue faster, etc.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is interesting to say the least but the ending ruined the game for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I prefered Edna &amp; Harvey: The Breakout more dispite this game being significatnly higher in production quality and I'm not 100% sure why, I think it was because I quite liked Edna as a character while Lilli felt a bit lacking. This is still a great game though with an abundance of personality.",
            "review_score": "1"
        },
        {
            "review_text": "its not everyday that i find a decent point and click game.  if you played monkey island series, then you gonna like this one.  its a great game",
            "review_score": "1"
        },
        {
            "review_text": "An excellent point-n-click adventure game. It’s got a simplistic art style that I like a lot. The game just has action/look and never gives you too many objects, so you never get hopelessly stuck trying random things for hours. The game has a kind of cartoon/fun style combined with dark humour, which works very well. The protagonist only speaks a tiny little amount, which cleverly makes the conversations focussed on the person you are talking to.  I played this game before playing The Breakout, so I sometimes felt that I wasn't quite understanding the story. For that reason I'd recommend playing the original game first, then this.",
            "review_score": "1"
        },
        {
            "review_text": "I REALLY enjoyed this game. Even though i hadn't played 'edna and harvey: the breakout', it was still easy to follow the storyline.  The game takes you to a monastry where you meet a little girl called Lilly, who despite wanting to do everything right, has no friends and mother superior absolutely hates her..  She seems to have only one friend, called Edna. But one day a man called dr. Marcel comes to take her away and you have to protect her. But not before finishing al the chores you have to do for mother superior. But grave mistakes can be made with the best intentions.   The game has a dark humour to it that you just have to love. If you are the type that can't handle that, you won't enjoy it, but if you like weird/sarcastic/cynical humour, you definitely have the right game! The characters in the game are sometimes a little one-dimensional, but some are just so weird that you quickly focus on them instead.   The gameplay is simple and the story is quite straight-forward, though you can explore a lot and I advise you to do so. Especially some conversations are hilarious and worth listening to. The narrator of your story is quite the sarcastic basterd at times, which is a lot of fun!  The only thing that bothered me was the ending, though I won't tell you anything about it. And there are a lot of: ''what the hell am i supposed to do now!?'' moments in the game. You really have to keep exploring all the options. Though it gave me a lot of frustration.   So in short: a challenging game with a lot of dark humour and funny characters. I definitely recommend it!   ",
            "review_score": "1"
        },
        {
            "review_text": "This was a very witty and humorous game. The argument between the narrator and the dungeon master especially cracked me up. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I do recommend this game if ur into puzzles/point and click adventures. well i would enjoy this if i didnt break my game at the point i cant hear any talking :| but its still a good game tho",
            "review_score": "1"
        },
        {
            "review_text": "Oh dear oh dear how to put this...this game is fun. Enjoyable well made but very german. What do I mean by that? Well the country of orgin shines through with little things. The police wear green, your character finds an unexploded bomb from ww2 (a common problem in modern day germany) annnnnd ITS DARK AS ♥♥♥♥. Seriously this one is the game that made me uncomfortable in what is suppost to be obviously humor. Its just lucky Ive studied German and understand where the dark humor comes from. This comes in the same vein as the old faerie tales that come from the land of autobahn and tell of what happens when you suck your thumbs (they get cut off by the talor) or when you play with fire (you die!). Its fun don't get me wrong but...well if Ive been able to run people over in gta, blow up buildings in sr2 and operate on people in medical games without flinching and -this- is the one that makes me squirm with a child hanging herself? Might want to consider if you'll be able to get through it",
            "review_score": "1"
        },
        {
            "review_text": "I lvoed this game. It was very challenging and cute. My only complant about it was the ending was a bit dumb (it was funny but a little too soon) and the puzzles didnt make that much 'logical' sence and so they were much harder than they needed to be. I did enjoy this and I recomend it to anyone who likes point and click games. (ONLY BUY IF ITS UNDER $10)",
            "review_score": "1"
        },
        {
            "review_text": "Hella twisted, slightly disturbing, and yay for multiple ending. I really enjoyed the puzzles, even tho some of them were a straight up ❤️❤️❤️❤️❤️ (I'm looking at you mother superior). Btw ty devs for covering everything that would've been too graphic in pink goo. 10/10 would burn pigeon with firecrackers again.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting animated indie point and click game with a dark side. Very enjoyable so far.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very cute yet slightly morbid game. ^.^ Anyone who likes games with slight twists here and there and puzzles should definitely play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Definetly an improvement from the last game graphics wise, and just as good!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, lots of fun, and kinda twisted... It was not scary for my 10 year-old to watch me play, but I did need to explain a lot to her. The puzzles were challenging but not too hard, the achievemets (once they started working - read the patch notes), were accesable if sometimes tedious. Got it on sale and was very happy with the purchase! Now I will have to go back and play Breakout...",
            "review_score": "1"
        },
        {
            "review_text": "Great Game",
            "review_score": "1"
        },
        {
            "review_text": "this has to be the BEST point-and-click adventure game i have played thus far. despite it's childish presentation, Harvey's New Eyes manages to create an expirience of pure comedy and tragedy. Despite being a sequel to the first game, its able to keep everything in order, meaning even if you don't get the relation or references to the first game it doesn't truly damage the experience. And no matter what happens, you will find you can never hate your character, Lilli, because she seems so lovable and innocent, even when she does thing that make her seem...dislikable. The narrarator's voice perfectly fits anything the game offers and retains a comedy style that is simple but amused me on many levels, all the while showing small bits of just how dark the story really is. How dark IS the story, you ask? Play it and find out.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of my favorite Adventure games of all time.",
            "review_score": "1"
        },
        {
            "review_text": "One of the funniest and cutest adventures i've ever played! It's realy enjoyable, just try out the demo or read some review.  It also features very good german voice acting. I went with english voice for now, probably going to replay the game again in german though! :)",
            "review_score": "1"
        },
        {
            "review_text": "Good game. But overall the mood is rather dark.",
            "review_score": "1"
        },
        {
            "review_text": "A cynically amusing story that sticks a middle finger on the first installation, but that would be a spoiler. If you somehow manage to reach the end, I recommend the contradiction ending as that should be the true ending.",
            "review_score": "1"
        },
        {
            "review_text": "Funny point-and-click adventure. Definitely a thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "Just finished - 12 hours game time for me.  The best morbidly funny adventure game ever. Just as good as the 1st Edna &amp; Harvey.  Charming music, cute voices, funny dialogue - not a flaw to be had.   Love it &amp; I will miss playing it!",
            "review_score": "1"
        },
        {
            "review_text": "I'm delightfully taken aback by how much better harvey's new eyes is compared to the breakout. Compared to the pequel this game reeks of polish and really shows that the developers are stepping forward. Even with all the improvements the sequel still maintains everything that I liked about the first and even uses it in creative ways, manipulting what you thought about the ending in The Breakout to keep you on your toes. The biggest downside I can name is that the plot is quite dependant on events of the first game which had it's flaws.",
            "review_score": "1"
        },
        {
            "review_text": "As far as dark humor and gameplay goes, I love this game. Although if you have a mac (I know... I know...) or atleast I think it's because I'm playing on a mac, you will tend to get crashes every 2 minutes or so. Please keep this in mind when buying the game.   If you have a PC, I think you will fully enjoy this cartoony dark adventure. It's funny and unquie. Mini-games and a large game of mail man and scavenger hunt.",
            "review_score": "1"
        },
        {
            "review_text": "It's a cute, short (if you use walkthroughs), dark, point and click game. I haven't really played many of these kinds of games but I've found this one enjoyable. If you're into dark, cartoony, point and click games with some humor thrown in then this game is for you. The game did glitch a little during my play through like I got weird german (I think?) subtitles. Also, the achievements weren't working either. Not totally sure how to fix it but I think there is a fix out there somewhere. So other than that it's a pretty decent game. I'd recommend to pick it up when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Edna &amp; Harvey: Harvey's New Eyes is one of the best games I've played in a while. Got it on sale, but it's worth the full price! If you want to try it out first, the demo is well-done and represents the full game perfectly. No unpleasant surprises or packing all the good stuff into the beginning, like some other demos do.  I honestly can't think of many types of gamers who wouldn't appreciate this game. It's funny, it's messed up, it's cute, all in healthy doses. As far as difficulty goes, it's pretty simple but there are a good number of puzzles, all of them commanding some amount of thought. Unless you just hate point-and-click, there's very little chance that you'll dislike this game.  It's fully voice acted, and said actors' performances perfectly suit their characters and the overall mood of the game. The morbidly upbeat and often cheeky narration lends a lot of charm, putting a fun and quirky spin on the 'edgy' theme so prevalent in games today. The narrator himself is one of the game's best assets, the other being its sense of humor in that it embraces its dark subject matter, but doesn't take itself too seriously. There is truly a lot of charisma to this game.   Bonus: despite being a sequel featuring several characters from the first game, you don't have to play the first game to understand what's going on. It's written in such a way that those who played the original will enjoy the references, while those who didn't won't feel lost.  One caveat: Some of the puzzles are absolutely nonsensical, or at least require thinking that is outside the box in a 'so stupid it might actually work' sort of way. That, or I'm just bad at games. You should probably have a walkthrough on hand anyway, just to be safe.",
            "review_score": "1"
        },
        {
            "review_text": "I played this before the first one and really liked it. It definitely kept me entertained all the way through. The destructive naivety of the main character is really charming. Yes, the achievements are broken, but I am one of those scrubs who play for entertainment and fun. And funnies I had. A lot. The music could do with a bit more diversity, the theme song has been stuck in my head for days. Halp...",
            "review_score": "1"
        },
        {
            "review_text": "I must say, This game is really beatiful, i did not know what to expect. the beginning got me thinking of a childrensgame, but the sarcasm and dark humour got to me. i loved it.",
            "review_score": "1"
        },
        {
            "review_text": "After 10Hrs and 100% trophys in the game i gotta say. Its an Daedalic game so what are u expecting. Amazing game. good Humor. good laughs. So far there wasnt a Single game from Daedalic what i didnt like personaly. If you like Point and Click adventures with an good humor grab it u wont regret it.  I give the game a well deserved 9/10. This game has Multiple Endings but idk 2 Ending are kinda weird and 1 was an rather interesting one.   ",
            "review_score": "1"
        },
        {
            "review_text": "I'm actually enjoying this game. It's something about a game that makes you think of creative ways to kill people LOL but then compared to games that actually have kililng, this is a 'cup cake'. And when I say cupcake I mean the art in it is cutsey, which makes the game so interesting to me because you wouldn't think the premise would be what it is. The only thing I don't get is the purple blood. Just make it red lol",
            "review_score": "1"
        },
        {
            "review_text": "Good, one of the best point and clicks I have ever played.   Would reeceomed waiting for a sale tho.",
            "review_score": "1"
        },
        {
            "review_text": "This game does not contain any violence. DO NOT PLAY WITH FIRE. No one dies. OBEY THE ADULTS. Its perfectly for children of all ages. DO NOT LEAVE THE CONVENT. Just ... just ignore the pink stuff sometimes. I mean ... it-it looks harmless, doesnt it ?",
            "review_score": "1"
        },
        {
            "review_text": "DON'T WATCH THE TRAILER!!  It spoils the whole thing dammit &gt;.&lt;  Luckily for myself saw it only after playing the game.   Any way were enjoying point and click adventure with dark humor and relaxed athmosphere.   Animations are bit clunky and characters very simply stylised but you get used to it and good characters do cover it.",
            "review_score": "1"
        }
    ]
}