{
    "app_id": 220090,
    "name": "The Journey Down: Chapter One",
    "release_date": "2013-01-09",
    "developer": [
        "SkyGoblin"
    ],
    "publisher": [
        "SkyGoblin"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Point & Click",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 902,
    "negative_ratings": 129,
    "price": 5.99,
    "description": "The first chapter in the three-part The Journey Down saga, a classic point-and-click series with an Afro-Caribbean twist. Get ready to embark on an epic journey of laughs and brain-teasing adventure!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/220090/header.jpg?t=1553610349",
    "minimum_requirements": "OS:Windows XP SP 2+, Windows Vista, Windows 7 Processor:1.8 GHz CPU Memory:1 GB RAM Graphics:Direct X 9.0c compatible video card DirectX®:9.0c Hard Drive:1 GB HD space",
    "recommended_requirements": "OS:Windows XP SP 2+, Windows Vista, Windows 7 Processor:1.8 GHz CPU Memory:1 GB RAM Graphics:Direct X 9.0c compatible video card DirectX®:9.0c Hard Drive:1 GB HD space",
    "reviews": [
        {
            "review_text": "Quite good, and even better now with the reduced price. I love the graphics, I love the music, and the gameplay is decent classic adventure fair. And the story is quite good, but really seemed to only give you a hint at what you will discover in episode 2.",
            "review_score": "1"
        },
        {
            "review_text": "good game, good story but... i finished it in UNDER 2 hours.. so....... for that full price... and the fact that it seems they were already pre-planning part two.. not worth it.. get it at 90% off though..",
            "review_score": "-1"
        },
        {
            "review_text": "Good traditional point n click graphics adventure, reminiscent of some of the LucasArts adventures. Entertaining dialogue, great voice-overs, pretty cartoon-style graphics, and atmospheric music. Good, fun exploration and medium difficulty puzzles that all made sense (i.e. no weird inventory combinations and other such random solutions to puzzles). Definite buy!",
            "review_score": "1"
        },
        {
            "review_text": "So I hear you like Grim Fandango.  Not to say that it only lifts its veneer from that most revered of point 'n' click idols (it does), but that it also could be just as great.",
            "review_score": "1"
        },
        {
            "review_text": "It is really hard for me to decide weather to recommend this or not, but I'd say that I am rather more inclined towards a negative feedback.  Positive side: Very nice artwork, music and atmosphere. This is really what got my my attention. The humor is moderate, couple of laughs here and there, but it gets a bit exagerated at time. Cool in over all. The puzzle are simple and positiverly silly at best but if you just play for entertainment, not taking it too seriously (it's not Myst), you'll have a good time.  Negative side: Ok, this is the only negative thing I have to say about chapter one. It was way, WAY, too short. You could probably finish the game in less than 15 min. I just started to warm up and really enjoy the game when the end credits just popped up. Shocking! I just couldn't believe it, I thought it was a prank.. but no, that was it, right to my face! That really killed all the appreciation I had for the concept.  The fact is that the chapter one is nothing more than a teaser to get you to buy chapter 2. I bought both anyway simultaniously, but I do not appreciate such manipulation from story tellers, it really left me with a bitter after taste.  I haven't played chapter 2 yet, and I am not as enthusiastic as before to start it, as it might be just another teaser... Eventhough I got both of them on sales I still feel like I got a bit ripped of, at least for chapter one. For such a short story it's not even worth 1€. The developers offer a free (low res) version of Ch1 from their site, i'd probably recommend that one instead. I could say at least that for the artwork it could deserve some slack, but I'm still recovering from the shock so, NO!",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty neat but short adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "If you like point and click games you might want to check this game out. It's kinda short but if you get it for a low price it is totally worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "Really good game. If you liked Monkey Island 3 and games like that then you may very well like this one aswell.",
            "review_score": "1"
        },
        {
            "review_text": "The journey down is a classic point and click adventure game, it has really interesting and well designed characters, very nice art inspired from central african art, an interesting plot with well written dialogue and lots of humor. The game dialogue is fully voiced and has HD graphics, a big improvement of the freeware version. The first chapter is quite short (took me 3 hours and i am not good with adventures) but its really entertaining and has a good diffuculty level.  Its worth a try. ",
            "review_score": "1"
        },
        {
            "review_text": "I have to say that I couldn't stand to play much of this game. While it harks back to a better time of Point-&amp;-Click adventure style games, the voice acting int this game is just cringeworthy. The dialogue ruins this game, makes it barely enjoyable.  While the 'puzzle' aspect is good and the graphics are none too shabby, I just didn't feel as though I could get on with this game. Sorry, not in my books.",
            "review_score": "-1"
        },
        {
            "review_text": "Basically, Grim Fandango with Jamaicans. 8.6/10",
            "review_score": "1"
        },
        {
            "review_text": "Two brothers Bwana, and Kito are approached one day by a woman, Lina, from the University. She's looking for information about the brothers adoptive father, who mysteriously went missing one day, and a lost book that he may have. Furthermore, a company seems interested in this same book that holds some kind of power. Bwana's tasked with first trying to get his plane to work before flying off so that he might help Lina.   First, the atmosphere in this game is one of my favorite components. It's a Jamaican/Carribean theme that's on a water front. It has some nice music playing the back, and I love the accents on the characters. The scenery is really amazing, giving it a bit of a noir feel as well. Characters Bwana and Kito are hilarious in their interactions, especially Bwana who seems hesitent of getting into any trouble. Can't say I blame him....  The gameplay is your basic point and click game, with puzzles that you must figure out to progress. This is one of the easier point and click games, as I have not had to look up any walkthroughs to get by. That's not a huge complaint, as it is still mildly challenging.   SkyGoblin actually has a free version of this game listed on their website in low res. Although, as they are using kickstarter to assist in continuation of the series I heavily recommend just paying for it. Its a great game, and smaller companies need our help for making awesome games like this. Keep in mind the rest of the series isn't out so if you want to wait just buy the game and wait for the final chapter before playing them all. It might be awhile though. Honestly, I have several games in my inventory I'm waiting for completion so its not a big deal for me because I have plenty of other games to keep me entertained.",
            "review_score": "1"
        },
        {
            "review_text": " The Good : Absolutely wonderful setting -- character designs based on pan-African sculptures, locations inspired equally by big-city noir and Afro-Caribbean urban life, with a fitting jazzy soundtrack. The world-building is not quite as unique as  Grim Fandango , but it comes close. There's definitely a  Double Fine  or late-period LucasArts vibe to the game, which really appeals to me. I'm invested enough in the story to consider buying  Chapter 2  at full price.    The Bad : The gameplay is as simplified as point-and-click gets. No SCUMM parsers or clue-matching or   The Cave  -style special abilities. While this makes it ideal for relative newcomers to the genre, veteran players may find it derivative. Most puzzles feel like variations on time-tested scenarios: getting past the hostile guard animal, tricking the snooty doorman, collecting MacGuffin parts (in this case, restoring a plane).   The Ugly : Believe me, I prefer shorter games, but the play time for this felt kinda ridiculous, at just under the 4-hour mark. I'll let it off the hook, since it's meant to be part of an episodic narrative, but it really left me wanting more.",
            "review_score": "1"
        },
        {
            "review_text": "The Journey Down: Chapter One is a good looking, but terrible to play point and click adventure. The game's artstyle is appealing and all the backgrounds and characters are well done, but thats about all the praise this game will get. The story itself is bland and the delivery is atrocious, the 'puzzles' are so easy and unchallenging a monkey could probably do it. Additionally some of the characters are extremely annoying as they try to play it off as funny (I am not even sure if this game has a target audience based on its subject matter). Now given the above I'd almost be willing to count this as a good feature, the game is also insanely short, you can clear it in literally a couple hours. I do not recommend this game to anyone, there are good point and click adventures out there that offer challenge or a good story, this has neither of the two essential elements.",
            "review_score": "-1"
        },
        {
            "review_text": "The dream ground between Grim Fandango and Casablanca, no fan of adventure games should be without this one.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome point and click game....do purchase both chapters before playing :D You gonna love it :D Highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "Background art and music are great. Animation and charactere modelisation are horrible. (Charactere are 'masks' so it's very hard to create facial expression) Voice is okay. Need more inventory item and harder puzzle. Sorry dev, truth hurt.  6/10 .. Meh",
            "review_score": "-1"
        },
        {
            "review_text": "Fun but a bit short.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. You can finish the game for 2-3 hours. 10/10",
            "review_score": "1"
        },
        {
            "review_text": " The Journey Down  oozes with style through its beautiful hand-painted backgrounds and pleasant color palette, excellent soundtrack and voice acting, engaging story, hilarious dialogues and original characters, coherent puzzles and just plain brilliant fun. It reminds me about everything that makes point-and-click adventures one of my long-term favorite genres, without any of the annoyances that plagued it along the years.  The first chapter offers approximately 2 1/2 hours of entertainment, including a few nicely produced cut-scenes, dialogues and gameplay, and is clearly meant to be followed by the second and upcoming third chapters. In many ways this has all the winning characteristics of a good Monkey Island, especially the humor and overall positively carefree vibe, with all the piratey bits replaced by African-inspired culture set in a more modern setting. Kudos to a very creative team! Looking forward to play the rest of the story.",
            "review_score": "1"
        },
        {
            "review_text": "I could make a nice long review wasting a ton of your time reading it.  Generally it would say: Great P&amp;C game, good story, written well, includes a lot of minor details that make it so polished. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I instantly fell in love with this game. Amazing music, atmostphere, voices, story and characters.  The best Point-n-Click I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A very short, albeit very fun first chapter of this interesting graphical adventure that winks its eye to Grim Fandango. Great voice acting and music and high level of detail for an indie production. The gameplay is very old school: you solve a series of puzzles (definitely harder than the average today, but not too hard), while the main story moves forward. Recommended to all the fans of old graphical adventures.",
            "review_score": "1"
        },
        {
            "review_text": "Atmospheric and funny point &amp; click game. Well I got it for free but its fun and interesting. But its not really worth 9$ I think :/ ",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit, we don't see too much of fantastic point and click games nowadays, but this one turns out to have a great storyline! The Journey Down has a great story and me just playing this game brings back those days when LucasArts released a bunch of point and click games, and this turns out to be amazing. After 2 hours of gameplay, this game turns out to be short, but it's gonna take long to figure out the puzzles that pops out around the storyline though xD. Even though, the first chapter turned out to be very good, i'm totally going to get the second chapter sooner or later.",
            "review_score": "1"
        },
        {
            "review_text": "Bit of fun as a cheap game (first ep was only £1) but forget it at full price, sorry.",
            "review_score": "-1"
        },
        {
            "review_text": "No. Amateurish. Puzzles are meh. 'Chapter One' followed by 'Two' a YEAR AND A HALF later - for only a few hours of gameplay. Remember where you left off? I don't, and don't care. Don't.",
            "review_score": "-1"
        },
        {
            "review_text": "what the ♥♥♥♥ is this ♥♥♥♥.  waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "Funny point and click. But as a Chapter, it's too short :-)",
            "review_score": "1"
        },
        {
            "review_text": "a real cool gme, like i haven't seen seen since the curse of monkey island! can't wait till the game is complete!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome. Brilliant. Fantastic. All words that describe the wit and dark humour behind this great game. And, I haven't even mentioned the the truly amazing soundtrack yet.  I havent played many adventure games at all, so I had some reservations about buying TJD. The trailer got me interested enough to put this into my fav's list, and when it came up in the summer sale I took a chance and bought. TJD is a lighthearted game but with some stunning visuals and fantastic music. The gamplay is no walk over however, or maybe I am just a bad adventure game player but some of the puzzles had me stumped for a while. The story is shaping up nicely and I'm looking forward to chapter 2.  Definite BUY.",
            "review_score": "1"
        },
        {
            "review_text": "A nice little game. I really, really enjoyed it, and now that Chapter 2 is finally out, I think it deserves even more attention. :)  At times it feels somewhat stumbling in execution and puzzle design, but overall, it never ceases to be entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Great characters, amazing audio soundtracks and I love the voice acting too. Plenty of puzzles to solve, would reccomend this game to anyone that love point and click adventures.",
            "review_score": "1"
        },
        {
            "review_text": "If you're after an adventure game that isn't too challenging then look no further. Nice art-style. A little too short and ends on a cliffhanger.",
            "review_score": "1"
        },
        {
            "review_text": "Made me laugh quite a few times, a real successor to Grim Fandango, well worth the price 9/10",
            "review_score": "1"
        },
        {
            "review_text": "If you are into quest, you may like it. It's okay.",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought that game is not worth my time, but after fifteen minutes I really liked it. Very unusual storyline. Great atmosphere. Interesting and challenging logic puzzles. I would recommend to anyone who likes unusual games.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful old-school point and click adventure game with great music, atmosphere, characters and story. Also the puzzles are reasonable and logical and not absurd at all.",
            "review_score": "1"
        },
        {
            "review_text": "This game brings me back to my early gaming days of click-adventures with games like Pajama Sam and Spy Fox. but this game has the rich characters and emotional storytelling that compels me to play now in my 20's. The characters are funny and relatable, the game isn't too hard or too easy (just takes some wacky logic to figure out what to do next sometimes), the setting and music both are nostalgic and fresh, and there is some subtle social commentary throughout as well. The only thing I have against this game is how short it is (Chapter 2 is longer and even better in my opinion). 9.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "So far, this game is pretty interesting. A really fun art style, some genuinely fun characters and a mildly dark sense of humor all wrapped around an old-school point and click adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "Thoroughly enjoyed the humour and setting after a few minuites in, the scene setting didn't take long, but as this look and feel is new to me i didn't feel taken by the game from the get go. I am happy i took the time to persist, as short as it was for the game to get good.  The music was absolutely phenomnial, i found myself jiving in my chair the entire way through (aside from one or two scenes), i had gotten to listen to the composer before hand and already had a clue on what score this game could provide. To have the backgrounds and scenes change to match each music score, gave me an enjoyable ammount of immersion.  The puzzles, whilst not too taxing on the grey matter, were fun to work through. I had myself laughing at outcomes and clicking my fingers in realization as things came together. Only draw back would be, one or two puzzles did feel a little 'Oh i know how this goes' kind of style.  The voice acting was very good, nice mix of accents. But, the only thing that let me down, the entire game, was the levels and quality of a few lines. The audio sounded like it was changed later and added in, or the overal quality was changed mid line. (Don't let that put you off, as it's the only draw back)  The art, well it speaks for itself in the screenshots, fantastic all around. Lots of attention to detail for me. Certain parts felt like a throw back to older Adventure PnC games, which gave me great nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "Fun PnC adventure game with a unique aesthetic. A little short, but the fun puzzles and the promise of future chapters has me hooked.",
            "review_score": "1"
        },
        {
            "review_text": "funny game,great atmosphere,nice graphics,relaxed music,though the puzzles could be a little more complicated.For a Chapter one its a great start.On itself its far too short.For the full price i would say,wait till the other chapters are there...if they come.For a Holiday sale price its very ok",
            "review_score": "1"
        },
        {
            "review_text": "An adventure game made by people who love classic adventure games. Great voice acting and a good sountrack. Interesting visuals. fairly short. A solid effort that really needs another chapter or two to be excellant.",
            "review_score": "1"
        },
        {
            "review_text": "This point and click adventure game wont be stealing your $6. The story draws you in quickly and makes you want to know and understand more. Music if fantastic jazz that wouldnt be too weird to listen to when not playing the game. Art has the fantastic 2D, 3D look. the only bad thing i would say is the voice acting AUDIO. it seems it was all recorded with differnt micorophones. at times the audio would be low and gradually turns up immensly. Of course that doesn't matter, because the crocky puzzels, the music, and the characters is what you will be falling in love with in this game. Buy now!",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun little point and click gem.   Pros: Superb voice acting, beautiful graphics, and a good amount of humor.  Cons: No hint system, I had to look up the solutions online when I got stuck. Some of the solutions I came up with that game didn't allow.",
            "review_score": "1"
        },
        {
            "review_text": "I really love this game! The art style is really cool, and provides just the right vibe for the mystery. The only disappointment was how short the first episode was.",
            "review_score": "1"
        },
        {
            "review_text": "The Journey Down (Chapter One) is a short (part of a) game that basically unfolds on a really standard plot in an unusual atmosphere. Think of it this way: the world and the characters do let your imagination think more than what the story and the dialogues will actually do. That said, it's filled with humor and non-sense and puzzles resemble this attitude in a way that most of the time will make things harder, not because you're going through an hard-to-solve puzzle but just because the solution is totally non sense! To be fair, there's a bit of a path, but solving some puzzles will require you to look for the 'hidden object' around' or do the last thing you'd think of.  Overall the game is fun. But basically there's just a few places you can walk through, and you'll have to go through each one over and over and over again. Really, it's not just about backtracking, it's just that it feels physically cramped to some point Regarding the interaction, you have a decent amount of things you can interact with, but a lot of em will simply be plane objects with no use for either the story or the gameplay.  What saves this game in the end is how the hand drawn visuals work with the audio part, to make an atmosphere where the humor can play its own part: it's a fairly decent game you can relax with, chill while listening to the soundtrack and solving these wierd puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Short but very funny adventure",
            "review_score": "1"
        },
        {
            "review_text": "short but good and original adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "Sweet little adventure game with some stunning visuals and quirky puzzles. The first episode is only a few hours long but I look forward to playing the next episodes.",
            "review_score": "1"
        },
        {
            "review_text": "Just wonderful. It's short and sweet, but it is the greatest cyber-gangster rasta tiki game you will ever play. Great characters, great music, great fun.",
            "review_score": "1"
        },
        {
            "review_text": "just finished the first chapter, and loved it from beginning to end. can get a bit frustrating at times, but be sure to check for some really small details is all, that are kinda easy to miss. alot of the puzzles tend to make sense, unlike a lot of other adventure games where you spend half your time clicking everywhere and trying to make an item do something in an enviroment or mix it with another item. a problem that seems to persist in many adventure games, where logic kinda goes out the window for some things.  awesome dialogue, great setting, music, etc. loved the first episode, and starting on the next one.",
            "review_score": "1"
        },
        {
            "review_text": "The Journey Down is the kind of an adventure game that Lucasarts would have made if Lucasarts still made adventure games. Or existed. And there's really no higher praise than that. Also, I provide the voice of Sabo and Hungry Man in this game!",
            "review_score": "1"
        },
        {
            "review_text": "Game gives hints on how to solve problems/puzzles (rare, only remember 1 time) in game by main character telling how I don't like that if you dont manage it first. So it's bad design in that way. otherwise nice point and click game.",
            "review_score": "1"
        }
    ]
}