{
    "app_id": 22000,
    "name": "World of Goo",
    "release_date": "2008-10-13",
    "developer": [
        "2D BOY"
    ],
    "publisher": [
        "2D BOY "
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "Indie",
        "Physics"
    ],
    "achievements": 8,
    "positive_ratings": 3455,
    "negative_ratings": 237,
    "price": 6.99,
    "description": "World of Goo is a multiple award winning physics based puzzle / construction game made entirely by two guys.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/22000/header.jpg?t=1447351487",
    "minimum_requirements": "Supported OS: Windows® XP or Vista Processor: 1GHz or faster Memory: 512+MB RAM Video: Any 3D graphics accelerator less than 5 years old DirectX® Version: 9.0c                     Hard Drive: 100MB",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " 'Gooey drops want to get back into the tap'",
            "review_score": "1"
        },
        {
            "review_text": "This is just one of those indie games everyone needs to play at least a bit of. Its a very well thought out physics puzzler where you use your goo-balls to build structures under different rules depending on the level, and the balls at hand. While the graphics are cute you should not be fooled to think the game is very easy, it actually gets really challenging at times and requires a lot of skill, patience and luck to fully beat. Strong recommendation.  If you just play through the game you wont be getting very many achievement from this game as most of them are tied to the games OCD flags which are a more challenging way of beating all the levels in the game. This will be a very challenging task and something that might very well pull your hair out. Be ready for quite a challenge and look forward to that great feeling of unlocking some proper  achievements .   Time to 100%:  15+ hours ",
            "review_score": "1"
        },
        {
            "review_text": "  -Quick Review-   World of Goo is an Indie-Physics-Puzzle Game developed in 2008 by 2D BOY. World of Goo is one of those quaint games that you would probably prefer to play on a mobile or smaller electronic device (with touch screen capabilities); in World of Goo you create bizarre contraptions with Goo to get to the end of the level.    -Detailed breakdown review-    Story:  You progress through the game being guided by 'Signs'  (or the 'sign painter'. But I always thought the signs were the side painter) , you'll want to read every single sign in the game because they are quite humorous. The game is broken down into Five chapters, and each chapter would usually have 10-12 levels within the chapter.   Game Play:  Being a puzzle game, you need to spend a fair amount of time thinking, and once you get into the farther difficult levels, at times you'll need to restart the whole level because of one mistake. There is a requirement of how many 'Goo Balls' you need to save at the end of each level to pass. So that means you can't use all your Goo on construction, you need to be as minimalistic as possible in your building. The game starts out very easily and simple, but quickly gets complex and difficult. To construct, you click and drag a Goo Ball to a certain location near the starting structure to 'add' to that structure. Generally after using that Goo you cannot reuse it... but some Goo has special properties that lets you reuse them, or have other special effects.   Achievements:  World of Goo has 8 Steam Achievements, all of which are pretty rough to obtain.  (They went with Quality, not quantity)  I only have 2 of those achievements at this time, most of them require perfect scores on each level... Getting all of the achievements will require a great deal of determination.   Price:  World of Goo is priced at $9.99, I spent 6 hours playing through the game once. So for me that's not a fair price.... However, I picked up the game on a 90% off sale, so I've actually gotten my monies worth, and then some.   Conclusion:  I recommend this game to people who enjoy puzzle and/or indie games, World of Goo was a very fun play through, and it only took one afternoon to get through it, so it's a nice quaint little play through. Depending on how good you are at puzzle games World of Goo does get pretty tough at times.",
            "review_score": "1"
        },
        {
            "review_text": "  A true classic! Easily accessable to players of all skill levels and incredibly difficult challenges for perfectionists. The physics are fun just to play with. The art an story haven't aged a day since the game came out.",
            "review_score": "1"
        },
        {
            "review_text": "Where to start with this... I originally played this on a Powermac G5 when it first came out around the end of 2008, I remember that I originally got it sometime around the 2008 election. My attention was focused on this game the whole time.  It's one of those games where it seems extremely simple at first, but then the complexities and depth of it gradually shine through. The puzzles are neat, and I never had to use any skips until the last part (and I normally sucka t puzzles) but they don't feel easy, they feel satisfying regardless.  The visuals are nice, and they're crisp and good looking, and most importantly they do NOT resort to trying to look like pixel art. However, the game does run at a low resolution and there is no way to change it.   The soundtrack... Well, let's just say it's one of the best soundtracks in an Indie game ever produced. It is well performed, it is entirely originally composed, and it doesn't resort to sounding like chiptune or 16-bit stuff to try and manipulate nostalgic nerves. One of the best parts of the game for certain, and even better is that all of the soundtrack (the full versions, not the shortened versions in the game) can be found right on Youtube. Very memorable soundtrack, I can say that about very very few games.  Buy it? YES! It's on sale frequently anyways.",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the finest examples of recent gaming innovation. It's one of those games you pick up every once in a while and play through again. I don't think I'll ever stop being amazed at the creativity that went into making this game.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game. statics and dynamics!!!",
            "review_score": "1"
        },
        {
            "review_text": "A really brilliant puzzle/building game. hope it releases more chapters in the future!",
            "review_score": "1"
        },
        {
            "review_text": "I started playing a funny little game about a bunch of goo balls going somewhere.  I finished the story I joined them on, on an epic quest, adventuring with them through challenges, defeats, and triumps.  I'll never be able to look at goo the same way again.  Amazing gameplay. Fantastic music. Interesting graphics. Great story.  ( P.S. I played this game way before it came out on Steam. Then played it some more. )",
            "review_score": "1"
        },
        {
            "review_text": "Fun game to relax while eating cheetos",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games. The level design is fantastic, the music is excellent, and the overall asethetic is very good. I would recommend this to anyone, even if they aren't a fan of puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "This game has the best mouse cursor ever!",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting game...  Not only you've got to figure out how to build a less than steady structure to bring as many goo balls as possible to the exit, but also keep in mind that the free goo balls themselves won't stop moving and may bring down your structure with theirs incessant motion... Do you think your structure could reach the Exit with what you think is the minimum amount of goo needed or should you add a few more goo to solidify your structure, meaning a less than perfect score?...  And how about a bonus level asking you to build the highest possible structure, with a limited number of goo balls, knowing all too well that all free goo balls will be attracted to the top of said construction and risking (and all too often succeed) in collapsing your carefully planned masterpiece...   A relaxed, but not easy puzzle game that have a undeniably charm...",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those rare games where you actaully have to use a greater capacity of your brain (in critical thinking and problem solving) to get to the next level and actaully have fun doing it.",
            "review_score": "1"
        },
        {
            "review_text": "very nice game",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥! Buy this game! NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Sort of old but still good, very good. Gooey goodness.",
            "review_score": "1"
        },
        {
            "review_text": "Unique, Adicting, and ♥♥♥♥ IS IT HARD(at least to get 100%)  Overall: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A game for all you people out there with a burning passion for static structural engineering.  The artistic style is also a bit unnerving in a weird Eastern European cartoon sort of way.",
            "review_score": "1"
        },
        {
            "review_text": "The first Indie game I ever played and certainly one of the best! Very addictive and lots of fun!",
            "review_score": "1"
        },
        {
            "review_text": "||NO STEAM CLOUD SAVES|| Really fun puzzler who’s connectivity physics really make it stand out. There’s been “bridge builder” type games before but the blob’s elasticity makes for an interesting twist. Great game to take a break from work with a level typically taking about 3 or 4 mins.",
            "review_score": "1"
        },
        {
            "review_text": "IS THE BEST GAME EVER! MAKE A SECOND ALREADY!",
            "review_score": "1"
        },
        {
            "review_text": "Albino Goos are Ayesha's favourite Goo.",
            "review_score": "1"
        },
        {
            "review_text": "Cute, adorable, beautiful, challenging.  This game brings awesome music with a aweseome game design. Stack your little helpers, the Goo's, to build constructions enabling you to reach the goal. 4 Chapters and a Epilogue await you. Compete with others players in a special region where are all extra Goo's are stored, to build the highest tower in the Gooniverse! A perfect indie game for old and young, challenging until the end, with awesome music await you for only a small amount of cash. Even if you cant afford it, the demo is worth trying. And who knows.....maybe well see you in the Gooniverse soon to, building a higher tower than everyone else...",
            "review_score": "1"
        },
        {
            "review_text": "buy or eat ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Its damn fun, and you will love it if you have any interest in problem solving games.  The music is good, and so is the artstyle. I've played it with no bugs. Its got a bit of political/social/economic commentary in it, but I'll let you figure that one out (or go view a walkthrough or something, the commentary isn't necessarily sublte at points).  Its important to note that, yes, the game is by default in 800X600ish, but you can fix that in the settings (there are several guides, and its not rocket science). Also, the game is a little short for some.  Also, I did play more than 4 hours, I spent the majority of a summer playing this game. Didn't know of Steam at the time so it doesnt show here.",
            "review_score": "1"
        },
        {
            "review_text": "Fun physics game, save the goo!",
            "review_score": "1"
        },
        {
            "review_text": "Love the music, love the graphics but the game itself... I guess it's ok. No, it's pretty good actually. I just hate it when you build a whole tower of Goo balls and it somehow manages to selfdestruct in the end. I just don't have the patience to start all over again, hehe. Just so you know; the goal is to get as many Goo balls to end of the level. Easier said than done. Like cute puzzle games ? Look no further.  [Rating: 88/100]",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic time killer this one. Basically a giant physics puzzle game.  Well presented and should run decently on even the lowest spec computers.",
            "review_score": "1"
        },
        {
            "review_text": "World of Goo is uniquely interesting, but not my cup of tea. A great game for a tablet or for younger kids with IQs above the average adult.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a good soundtrack and also has something about stacking up little girder things to build towers. It's not really bad to play, just lacklustre.",
            "review_score": "1"
        },
        {
            "review_text": "played this a ton on the Wii version  love WoG &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Finished pirated version. Bought it after that because the game earned it.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun but very challenging on certain areas.  You don't want to miss this gem.",
            "review_score": "1"
        },
        {
            "review_text": "It was my favorit game then I was little. Still has a place in my heart. One of the best games of its time. Pritty nice graphincs as well.",
            "review_score": "1"
        },
        {
            "review_text": "I'd call this a fun little puzzler... but it's more than that. The gameplay's highly addictive, and the little gooballs are pretty cute, but it's this game's story which makes it special. And as for the music... it's absolutely stunning. I could listen to the soundtrack to this game (which, by the way, is available for free) for ages. I can easily reccommend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, challenging and easy. I have bought this game for every platform from iOS, android, Wii and now PC. Its addicting gameplay is fun for short sessions and the art style is great. Top that off with great music and some snarky humor and you have one great game.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "I would've expected this game to be more erotic. But it is still erotic enough.",
            "review_score": "1"
        },
        {
            "review_text": "this game not fount please give my mine money",
            "review_score": "1"
        },
        {
            "review_text": "That's an indie puzzle game I can totally recommend.",
            "review_score": "1"
        },
        {
            "review_text": "This game. I am horrible at this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's an ok game.",
            "review_score": "1"
        },
        {
            "review_text": "An atmospheric physics puzzle in which you need to build precariously balanced constructs out of cute goo balls to reach the 'hoover' on each map. Good to learn about friction and structural stability :) I also love the music and sound design. The resolution could be a bit larger. Made by mostly the same developers as Little Inferno.",
            "review_score": "1"
        },
        {
            "review_text": "Like Skyrim with anti-consumerist subtext.",
            "review_score": "1"
        },
        {
            "review_text": "Picked this up for a buck the other day great game you guys. Fun challenging cool lots of wow moments. Pick this up at any price very pleased would have been worth 10 bucks considering I have spent 60 on some which I like far less.",
            "review_score": "1"
        },
        {
            "review_text": "the goo is black.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely suggested. One of the most beautiful indie games ever made. Nowadays it's rare to see such beauty and poetry. I've bought it for 99 cents, and I'd have payed even more for this pearl.",
            "review_score": "1"
        },
        {
            "review_text": "The first few levels were ok. Probably I am not the kind of person who this kind of game is made for.  Its very positive, the gamemechanics are so easy to understand but for me its too 'realtime' to handle. I like it more chilled and strategic.  So i recommend it 4 ppl who are into this hectic click and drag stuff. For ppl like me I cant recommend. Sorry, there is no thumb 'middle'.",
            "review_score": "-1"
        },
        {
            "review_text": "A mobile game that's too hard.",
            "review_score": "-1"
        },
        {
            "review_text": "Boring and ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is kinda entertaining, but as I did not see any mention on the store page, there is no option in game to increase the resolution beyond 800x600. I'm guessing there's probably a way to edit the config files, but it reeks of laziness and honestly looks like ♥♥♥♥ on a 1080p display. Do they even make monitors with a 800x600 native resolution any more? I also couldn't find an option for a windowed mode, which while not ideal, would have at least let me view it without stretching every thing. If I had wanted to run games at smaller resolutions than my monitor natively supports, I would have stuck with an integrated GPU instead of dropping $300 on a video card.   I guess it's worth the .99 I paid for it, but I'd be furious if I payed full price for what seems like a half-♥♥♥ PC port. As is, I'm going to uninstall and play a game with an actual options menu. I wish I could get my money back just to make a point that laziness should go unrewarded.",
            "review_score": "-1"
        },
        {
            "review_text": "It's been a while since I played it but all I can remember is being a little bored about halfway through.",
            "review_score": "-1"
        },
        {
            "review_text": "its a game i can run on my browser",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of money, Waste of time, Do not buy",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent game, ♥♥♥♥♥♥ PC port.   Not worh 10 euro normally, not worth 1.50 euro in steam sale. If you wanna enjoy this game, get the iPhone or Android version.",
            "review_score": "-1"
        },
        {
            "review_text": "boring",
            "review_score": "-1"
        },
        {
            "review_text": "Doesn't run well on steam.",
            "review_score": "-1"
        },
        {
            "review_text": "Hope you like adorable goo balls who like to stick to things when you try to drag and drop them. The gravity isn't much help, as the constant moving of the goo balls seems enough to collapse even the most painstakingly prepared structures. Not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "More like Mound of Poo.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a rather interesting aesthetic to it. The best part about this is that you have this sandbox area to build anything you want and how many goos are available are all the ones you were able to save throughout the campaign. The campaign itself was also quite an interesting ride by changing it up here and there while adding new elements to keep you entertained. I do have to say the OCD challenge is quite tough, but I wouldn’t have it any other way. If you’ve got that structural engineer spirit in you I’d say it’s at least worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun indie game. I dont think its worth $10 but anything under that is worth it. If its on sale buy it.",
            "review_score": "1"
        },
        {
            "review_text": "World of Goo Awesome gameplay. One of the best indie games I have played. Only downside is that to change the resolution you have to go into the games files and change it there. Apart from that, I give it a 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good game and it comes with an amazing sountrack. ",
            "review_score": "1"
        },
        {
            "review_text": "This Game Really is great, i remember playing a smaller demo version of it some time back and i had almost forgotten it, but steam had an amazing deal for it so.....boom! i have it now and its really fun i play it all the time. challenging yet fun. the art style is very cute. and the physics are amazing.",
            "review_score": "1"
        },
        {
            "review_text": "No matter how many times I play this from the start, I still never get around to completing this game. Would be nice if they have a 2nd World of Goo",
            "review_score": "1"
        },
        {
            "review_text": "Got it from the steam summer sale for like 2.50 and Iam glad that I did. It is a amazing and fun game :) I say everyone must play this game at lease once.",
            "review_score": "1"
        },
        {
            "review_text": "Super short and not that hard, but fun all the same.",
            "review_score": "1"
        },
        {
            "review_text": "super fun addicting game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This Game is really fun, creative, and gets me thinking. I played through it pretty fast, but was very fun. I'll keep playing this game, although, it will never be quiet as fun as my first run-through. It is very addictive, and sometimes a little frustrating (although that might just be me because I'm not too good at this stuff). I do recommend this game, I think it is very unique game, and is really fun.",
            "review_score": "1"
        },
        {
            "review_text": "I've bought this game on three diffrent devices so far. Have you?",
            "review_score": "1"
        },
        {
            "review_text": "Superb! Yeah, that's right, superb. One of the best indie games I already played, World of Good is perfect in every single detail. We have a great art direction, a great soundtrack, great physics and clever puzzles. At the very beginning I was very upset because I didn't know how to build that damn tower, but ALL the puzzles are amazing. Great job 2D Boy, I'm already looking into 'Little Inferno'. Hyper recommended.",
            "review_score": "1"
        },
        {
            "review_text": "New puzzle 'objects': living 'Goos' with misc characteristics that can build constructions to reach a pipe to escape. Funny graphics, voice and very cool music!",
            "review_score": "1"
        },
        {
            "review_text": "this is a damn great game, perfect timewaster. the music is fantastic, the gameplay while simple is simply amazing",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, good gameplay and the graphics are absolutly brilliant! Pick it up!",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite indie games of all time. Although when I first played this game from steam the game resoulution was horrable!! I was able to find and fix the resolution to display 1080p '1920,1080' instead of the standerd '600,800' resoulution. Now the game looks better than ever.",
            "review_score": "1"
        },
        {
            "review_text": "Good builder puzzle game, fairly challenging. 10 - 15 hours of play time, worth it for $10 or less.",
            "review_score": "1"
        },
        {
            "review_text": "7/10",
            "review_score": "1"
        },
        {
            "review_text": "look at all this glueee",
            "review_score": "1"
        },
        {
            "review_text": "This game is great...   BUY IT AND BE HAPPY!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Buy this damn game. Seriously. It's incredibly atmosphereic, soldily designed, engaging, challenging, just downright good.",
            "review_score": "1"
        },
        {
            "review_text": "Hauntingly beautiful, for reasons I cannot comprehend. Also challenging as all hell. Simple mechanics, difficult puzzles. And one of the best soundtracks in gaming. Even if you wont buy the game (you should) then just go out and get the soundtrack. Very pleasing to listen to.",
            "review_score": "1"
        },
        {
            "review_text": "I played this on the Wii with crappy motion controls and I still loved it.",
            "review_score": "1"
        },
        {
            "review_text": "This game has no way (other than editing files, i guess) of changing settings, you cannot change volume for certain things, or for anything for that matter, in game. No graphics/resolution settings either, so for example, in my monitor it looked quite blurry but i had to stick with it until i changed via changing the config file. Couldn't put it on widowed or anything either, I think a settings menu is a must for a game, but in this one it does not even exist. The menu contains just chapters, credits, and exit button.  The gameplay is fun for the first 40 minutes or so but then it becomes quite repetitive and tedious because of a few things: Striking for OCD sounds and can be quite fun, but every time you re-try a level, if there was a cutscene, you have to watch it because they are unskippabe and play every time you replay the level. The lack of a retry level button after all the goo has gone inside the sewer thing is also a miss, going to the map/watching intro/do things/fail ocd/watch outro/if there was one, watch cutscene/repeat becomes annoying after a few tries. Maybe a count of non-used gooballs would solve the tediousness, since you can retry level anytime before the gooballs go inse the sucker thing, but yeah that's kind of missed. Sign man has humour on point tho.  It can be a 'fun between games' game, but 9,99 seems a little excessive for what this game offers, so i advise you to get it on sale if you really want it.",
            "review_score": "-1"
        },
        {
            "review_text": "World of goo is a fun and sometimes challenging puzzle game. You drag and drop these little gooy guys as they speak a cute and unintelligible language. The graphics has its own unique charm. All around great design for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "Great game to just kill some time! Would be awesome on a touchpad!",
            "review_score": "1"
        },
        {
            "review_text": "Got this out of nostalgia for 5th grade, where my English teacher would let the class play it on the SMART board on Fridays. One of the best 2-D physics puzzle games, and a must have!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing puzzle game! Seriously, when you have the money then you should buy it! 8.3/10",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly charming game which keeps suprising you with unique puzzles throughout. I thought it would get old, but it never did. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Never gor into it. Not my type of game.",
            "review_score": "-1"
        },
        {
            "review_text": "Out of all the physics puzzle games World of Goo is probably one of the best.",
            "review_score": "1"
        },
        {
            "review_text": "If you like challengin games, I definitely recommend this!",
            "review_score": "1"
        },
        {
            "review_text": "Just beautiful in every ways, a unique gaming experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great logic game with great soundtrack and great goo ^^",
            "review_score": "1"
        },
        {
            "review_text": "I WILL SHOW YOU A WORLD OF PAIN",
            "review_score": "1"
        },
        {
            "review_text": "No matter how old and outdated this game may seem, this game always holds a special place in my heart. This game will truly be around forever.",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun and creative puzzle game. Building a bunch of gooballs in certain ways to proceed to the next destination. There's even a tower-like game mode were the object of the game is to build the tallest tower. Highly recommend this puzzler game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun little puzzle game that can be played through in single day without becoming a nervewreck. Puzzles are mostly similar and generally consist of building a marvelous architectural display out of something with structural integrity of a puddling. A bit too short perhaps, but the competive metagame will give it couple extra hours. Suitable for kids and people with short attention span unlike most building type puzzlegames.",
            "review_score": "1"
        },
        {
            "review_text": "Style. Style. Style. Maybe I'm a pretentious ♥♥♥-clown that enjoys appearance over substance, but it seems World of Goo has both.  Cute levels, hard levels, minigames, and physics processed through a stylish lens and humor that all come together well.  Then again, I just love puzzle games, and World of Goo was really good for that.",
            "review_score": "1"
        },
        {
            "review_text": "The best indie you never heard of. Featuring an unique puzzle-based mechanic and a wonderfully fleshed out world, World Of Goo deserves to be atleast tried. The little blobs of goo are instantly loveable and i swear they yell 'UNATCO' in one of the weirdest tribute to Deus Ex i ever heard. Your goal is to unite them together to form structures to get them to the pipe to escape their fate. Different goos have different stucture types they can make, but in the end, you need to get as many out as possibile. The story is a beautiful weird tale of love, conspiracy and greater good, and the game transforms itself everytime you think you might be getting your fill, making you play for just one more level. It's beautifully polished and an amazing experience overall which sould not be missed by any self-respecting gamer.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this game. Solid game play, such a cheese story line that it is really good.",
            "review_score": "1"
        },
        {
            "review_text": "veary nice game almst completid ",
            "review_score": "1"
        },
        {
            "review_text": "An alright casual game for when you need to let off some steam from getting ♥♥♥♥♥♥ off at games like All Points Bulletin.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, challenging. Brilliant",
            "review_score": "1"
        },
        {
            "review_text": "Come on. It's WORLD OF FREAKING GOO! You already know this game is amazing unless you've been living under a cave for several years.   If you haven't played it and have ever liked any puzzle game ever, you need to get this.",
            "review_score": "1"
        },
        {
            "review_text": "A puzzle game where you have a certain number of goo-balls and you must get a certain number of goo balls from point A to the extraction pipe. Some goo are resuable other's are a 1 time use but regardless every goo ball has their use for the puzzle that you are solving. Each stage has a normal and an OCD goal so even if you beat the level once you can try beating the stage with less moves or less goo used.",
            "review_score": "1"
        },
        {
            "review_text": "Decent little puzzler. Not too frustrating either, and it manages to keep things interesting for the whole game.",
            "review_score": "1"
        },
        {
            "review_text": "This is lots and lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. You should go try it",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game and has the most brilliant soundtrack ever, a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game to anyone who loves the classic bridge builder stuff. This game is will inspire your creativity while challenging your wits. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable enough, but I would prefer not to have to edit a text file to increase the resolution.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game so much I bought it again on steam (when I already owened a copy from when it first came out) just to try and get the achievements! So much fun, goo and quirky humour ALL IN ONE GAME! :D",
            "review_score": "1"
        },
        {
            "review_text": "Abusing physics has never been this much fun :D!",
            "review_score": "1"
        },
        {
            "review_text": "This game has goo that blobs around and stuff.",
            "review_score": "1"
        },
        {
            "review_text": "It is a very nice casual game that anyone can play. It has several puzzles with blobs of goo and thats about it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is perfect for you if you like physics/puzzle games with a slightly humourus side",
            "review_score": "1"
        },
        {
            "review_text": "Much fun. Such goo. Wow. They stick like glue. Wow. Adventure awaits yous.",
            "review_score": "1"
        },
        {
            "review_text": "Simple but challenging. I love it!",
            "review_score": "1"
        },
        {
            "review_text": "Fun Good Better Great! End Of Review! Wait.................. This has so much puzzles all the creating using these cute characters to do all of these puzzles! A bit dark at the begining well black and white is basically colors but gets brighter!  9/10  99cents IS CHEAP ",
            "review_score": "1"
        },
        {
            "review_text": "A novel puzzle game with a funny if incomprehensible story-line. I thouroughly enjoyed it and would recommend.",
            "review_score": "1"
        },
        {
            "review_text": "*Gnome Seal of Approval* This is one of the first 'art games' in the indie puzzle genre. Basically the game consists of building a molecule-like grid of balls of goo in order to reach the exit where you get points of unused goo.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, entertaining and addictive. You can't stop building goo-bridges until you finish it, you just can't!",
            "review_score": "1"
        },
        {
            "review_text": "A creative and whimsical puzzle game that is outright entertaining and makes me come back on a pretty regular basis.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Soundtrack, Relaxingly Frustrating Gameplay, and an all around Wonderful Concept. If you still don't own World of Goo, what are you waiting for?! a sale?!?!",
            "review_score": "1"
        },
        {
            "review_text": "Everyone and their mother probably owns this game already but I don't think it can be repeated enough just how awesome it is. Bizarre but cute art style, great music, and just the right level of difficulty - plenty of challenging sections that might require some extra thought and a few tries but nothing that makes the game nigh-unplayable. Probably one of the best indie games out there, so if you for some inexplicable reason don't own it, go buy it, and if it's rotting on your backlog unplayed, get to playing it!",
            "review_score": "1"
        },
        {
            "review_text": "It's an interesting game with limited replayability. The OCD flags are quite hard to get, the tower of goo 'multiplayer' allows you to get an idea of how your skills are compared to other players, but in the end it did not interest me much. I do recommend it because it's worth its price and gets discounted quite heavily and quite often.",
            "review_score": "1"
        },
        {
            "review_text": "One of the finest Puzzle games i have ever played.....The story, Graphic style and music are fantastic. Play this game and get hooked!!",
            "review_score": "1"
        },
        {
            "review_text": "Its great, simple cheap and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Haha! Goo. harder than it looks... more fun than it seems... :)",
            "review_score": "1"
        },
        {
            "review_text": "World of Goo is one of those great faster paced puzzle games and a game that helped bring the 'indie' games into mainstream acceptance. The goals are simple but allows for the player to come up with their own solutions while working under the pressure of the game physics.",
            "review_score": "1"
        },
        {
            "review_text": "Quite an excelent indie game. I know it didn't start the genere but I think it sure brought attention to it. VERY fun.",
            "review_score": "1"
        },
        {
            "review_text": "I played the demo from PC Gamer always wishing I had the full game. Now I do, and it's awsome!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting puzzle game that is fun and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "So simple and so awesome. Everyone should play this game at least once.",
            "review_score": "1"
        },
        {
            "review_text": "probably the most straight up fun and enjoyable puzzle game ever made (besides portal I guess).",
            "review_score": "1"
        },
        {
            "review_text": "A surprisingly smart, creative and diverse game",
            "review_score": "1"
        },
        {
            "review_text": "This game was pretty cool. Once I beat it though I didn't want to keep obsessing over it. It's really easy to get hooked into this for hours. Oh it has a crazy good story also, which didn't make sense how goo can have a story but they managed it.",
            "review_score": "1"
        },
        {
            "review_text": "I don't need to comment. A must-have. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Never touch this game!... it's poison!... stole the last 3 days of my life ;)  OCD tendincies and OCD mode don't mix lol",
            "review_score": "1"
        },
        {
            "review_text": "60% of the fun in this game - is music, twenty percent - is reading the in-game signs and the last 20% - gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Just so awesome!",
            "review_score": "1"
        },
        {
            "review_text": "This is a puzzle/physic game, okay. Not only will you be surprised by the ideas for each new challenge, but you will also be amazed by the storyline and the world atmosphere that might even put this game at the level of Portal.",
            "review_score": "1"
        },
        {
            "review_text": "Gooey awesomeness from start to finish. A fantastically fun puzzler with a mean sense of humour and plenty to keep you playing over, and over.  Must. Build. Higher. Tower.... What's up there anyway?  Dangerously addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Simple mechanics, addicting gameplay, great backstory, sounds and visuals...",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant design loaded with gameplay depth, a quirky, surreal sense of humor and a fantastic, atmospheric soundtrack. If you haven't played this game, your life is incomplete.",
            "review_score": "1"
        },
        {
            "review_text": "Anya likes to help me play this strange puzzle game. ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool game. Funny story. Weird, quirky. Fun puzzles. Little replay value though. But I would say, if it's on sale at $2.49 like when I got it, then buy it. It's kinda worth it.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say. You build stuff to complete your goals. Very invative and creative for a simple physics engine based game. There was one for the smart phone... but I recomend the PC, you are less likely to flip out because the mistakes a touch screen can make and the precision of a PC's software to the phones. Overall, very good game with a very funny story line. Short, simple, and sweet to the bitter end.",
            "review_score": "1"
        },
        {
            "review_text": "World of Goo is an excellent game (primarily) about building triangular-based structures by stretching Goo Balls. The goal is to use whatever utilities possible to get a certain amount of Goo Balls to a pipe. And the game introduces QUITE A LOT of goo ball variations (from balloons to flingy Goo Balls). The game's story-telling via the Sign Painter and atmosphere are little things that leave an impression. The soundtrack is also amazing and fits perfectly with the setting you're put in. I've only had a few problems with the game. The first being its reset system. You're only given a couple of chances to rewind time, and most times you have to do it twice since the first sends you to a time when your structure is still falling. I've found myself restarting levels when I was at the end and made one mistake often. The second is the difficulty spike during the end-game. It's possible (I did it, after all), but the first level of world 5 must've taken more than an hour and halted my craving to play for a while. Also, OCD goals (getting the maximum amount of Goo Balls possible to the end)...I'm not touching that. But if you like a really tough challenge, go for it! Finally, the game takes dominance of your screen, so don't expect to do anything else on your computer without leaving the game. Overall, World of Goo is great due to its consistent freshness of mechanics as well as its nerve-wracking and sometimes emotional gameplay. It's one of those indie games that isn't as recognized as it should be. Go give its creators a sale at whatever price you think is worth it ($10 isn't bad for the 6 or so hours it took to beat)!",
            "review_score": "1"
        },
        {
            "review_text": "An interesting, challenging, and unique game. If you like puzzle games you will like this. The music and atmosphere are great. A little short but still good.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to help crap find it's way to a tube, then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice puzzle game. My only grievance with this game is that you can't turn off the in-game music.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really a lot of fun, if you are a fan of puzzles and logic, which I am. I was advised against this game by a well-meaning and generally intelligent friend who found it too challenging. For me, it hits just about the right balance between mindless platforming fun and challenging brain-tease. Special credit for the narrative layout and for the sounds; they are aptly quirky.",
            "review_score": "1"
        },
        {
            "review_text": "This game has provided me with endless entertainment since i first started playing it and still continues to!",
            "review_score": "1"
        },
        {
            "review_text": "F&amp;F. Fun and Fustrating; the makings of a good game.",
            "review_score": "1"
        },
        {
            "review_text": "World of Goo is a port of the famous and popular smart phone app. The game is simple and fun. However, the port is very bad.  First, I got a Direct3D error the first time I started it. Second time the game worked, but I don't know why.  The game does not offer any graphics options. You can't change the resolution or window size. There's also no options to switch to full screen mode. The game window itself is about 900 pixels wide. A bit small for an average screen of 1920px wide.   The small window makes scrolling very difficult. Scrolling requires you to move the mouse pointer to the edge and won't scroll if the mouse moves outside the window.   There are also no options to balance the sound and music, or turn it off entirely.  Although the game play itself is amazing, the PC version is not worth buying. Get it for your phone or tablet instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun little game, music is an odd mix of catchy and hypnotic.",
            "review_score": "1"
        },
        {
            "review_text": "The best indie game ever made, 2Dboy is a GOD!",
            "review_score": "1"
        },
        {
            "review_text": "chills",
            "review_score": "1"
        },
        {
            "review_text": "A very simple game with a lot of heart and style. It takes the classic bridge builder format and breathes new life into it, making for a veryy fun experience.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fascinating games I've ever played. Well thought out, and the challenges totally rock.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic gateway-game to the indie gaming scene -- easy to pick up, fun to play, easy controls, and really well written and drawn. Most of the game is pretty nice, but the first level (*all* of which you can play in the free demo) and the soundtrack were my favourite parts of the game.",
            "review_score": "1"
        },
        {
            "review_text": "World of Goo is a revolutionary and independent game that uses creativity to take advantage of the physics engine. A stunning, beatutiful title that will allow you to experience the true power behind the most elastic creatures ever seen in the videogame industry.",
            "review_score": "1"
        },
        {
            "review_text": "Such a cute yet challenging lil game. The goo balls are full of character and you can't help but love them and their little story. But each level is filled with new and interesting challenges, not to mention you get to build a big winding tower of goo balls and hope it doesn't fall over! It's a great game to kill some time with.",
            "review_score": "1"
        },
        {
            "review_text": "A fun gooey puzzle game. Don't get stuck in the goo!",
            "review_score": "1"
        },
        {
            "review_text": "This is just one of those games that I find would be better suited for Android and IOS only, instead of PC. The problem I have is that it because you have to use a mouse (unless if you have a touchscreen PC) and a mouse is a lot more different to use than your hands, when having to use your reactions. This would be fine if the gameplay was altered to make up for this issue, but it isn't and therefore, I can't recommend this on PC, but perhaps on any touchscreen device.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun puzzle game. Some controls are annoying. Would be a good cell phone game.",
            "review_score": "1"
        },
        {
            "review_text": "It's very likely that you have heard about this game and how good it is. I also confirm it. It's a construction puzzle game, where you use different types of balls to create paths. The physics work well, the puzzles are well designed and varied, the graphics and music are cool, and it also has a backround story. Beating the game isn't that hard, but you can get better in each level, beating the bonus requirement and above. The game is really that good. My only critic is that sometimes, when you have many balls close to each other, it can be hard to chose the one you want, because once the mouse locks on a ball, you need to move it a bit to aim freely again, and the ball you want may be in between. One of the best puzzlers out there.",
            "review_score": "1"
        },
        {
            "review_text": "Cute puzzle, and I like building stuff in the endgame sandbox and playing jenga with it.",
            "review_score": "1"
        },
        {
            "review_text": "BUILDAN, CUTEAN, SADDAN, STRUCTURAN. Not to be understimated, tons of personality, tons to enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, you must figure out how to get the goo's out of the level. I reccommend playing it if you havent already.",
            "review_score": "1"
        },
        {
            "review_text": "Funny and enjoyable physics puzzles. Great for killing time while you wait for a download to finish.",
            "review_score": "1"
        },
        {
            "review_text": "World of goo is, simply put, a game of hundreds of millions og gallons of goo building the worlds bridges and towers. In World of Goo you control blobs of goo that want to get to a tube at the end of the map, but sometimes that means building extravagant towers and bridges just to get there. But make sure to watch out for dangers like explosives and sawblades other than that have fun!",
            "review_score": "1"
        },
        {
            "review_text": "If you ever find yourself in an argument with someone over whether or not video games qualify as art, THIS game will win you the argument. Hands down, World of Goo is one of the most fun and most fabulously creative games I have ever played. I honestly love everything about it. The level design is varied and the gameplay is challenging. The music and sound effects are spot on and my god the ART in this game is quirky and fun and some levels are just too beautiful for a game with such a simple premise. Provided, of course, you dig the game's slightly surreal overtones.   My only regret in buying World of Goo is that I did it seven years too late. If I and others like me who took their sweet time had bought their own copies when WoG was new, we might have a sequel or something else equally amazing by now.  In conclusion, I urge everyone even SLIGHTLY interested in World of Goo to try the free demo and if you like that DON'T HESITATE to pick up the full version either on Steam or from the 2D Boy website (where you can get it on every platform, ever DRM-free for just 10 bucks more!) Please support these mad geniuses in their current projects by picking up a copy of the best indie game made in the last ten years.  You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game and keeps you thinking :)",
            "review_score": "1"
        },
        {
            "review_text": "No need to present World of Goo. You already have it, right ?",
            "review_score": "1"
        },
        {
            "review_text": "Cheap but not a bad game",
            "review_score": "1"
        },
        {
            "review_text": "A physics puzzler where everything feels just right. When i failed it was always because i am an idiot, and my successes were absolutely because i am a genius.",
            "review_score": "1"
        },
        {
            "review_text": "World of Goo is one of those games where as soon as you start playing it, you'll want to try to be perfect - and you'll soon lose hours to it fun, challenging levels; awesome elfman-like soundtrack; and smooth aesthetics. This one was a real surprise for me, and it's well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic little game with lots of charm. Stick with it until the later levels and you won't be disappointed. Shame there's not more levels. :(",
            "review_score": "1"
        },
        {
            "review_text": "YES, but if you are oversensitive like me and cry at anything getting hurt.... I mean anything... play it when you are feeling emotionally strong.  puzzels where interesting and the ability to skip was like.... goooddness especially the amount you could skip increase with each level. didn't use it much because completing things feels better but it being there was nice",
            "review_score": "1"
        },
        {
            "review_text": "Guide the goo. GUIDE THE GOO! I'm a big fan of tommorow corps games. In world of goo, you guide a variety of goo balls to the level exit by using them to form a structure that the others can traval along. This game feels like it should be played on a tablet but the mouse interface still works just fine. I finished this a couple of times, it's a class act.  Good - everything - cool leaderboard thingie  - soundtrack is excellent Bad - feels like it would be even better on a tablet - except where getting an A+ result needs pixel perfect precision, those are annoying enough already  Recommended to young and old alike 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Easily one of the most fun games I have ever played. Do you remember when Portal first came out and how everyone raved about how good it was? Same thing here, hits you out of nowhere. The music and storytelling is absolutely top notch as well. Get it, get it now.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzles.  Nice on phone.  Ok on Pc  Bit repetitive  Slippery",
            "review_score": "1"
        },
        {
            "review_text": "A great game with unique puzzle solving gameplay that allows the player to learn and evolve in a rewarding way as the game progresses. Great presentation and atmosphere. It's possibly my favorite Indie game so far. Definitely worth the $5 I spent to purchase it!",
            "review_score": "1"
        },
        {
            "review_text": "Quite enjoy Goo. Sort of a puzzle physics sim. High on a unique style, and not too difficult. Can make you think how best to build. 4/5",
            "review_score": "1"
        },
        {
            "review_text": "Wow, I can't believe that this game is already 8 years old...  I originally discovered this game in a very unique way. In 2008, I was homeschooled, and we bought a computer for me to use with the schooling program. As the studious little boy I was, I searched on the computer (which was not connected to the internet) for ways to procrastinate, and one item I found was a compilation of hundreds of game demos, which would allow a limited amount of times that you could open it, 2-3 times I think. While playing the many games that were offered, I eventually stumbled upon this one, and I was drawn to it. I did everything I could to be able to continue to play it, including keeping it open for days, on end, and even creating new profiles on the computer to open it again (loophole!). Eventually, I finished all I could with the demo, with all of the levels of Goo Filled Hills beaten with OCD, and the highest tower I could build completed, I set it away the game and forgot about it.  4 years later, in 2012, I was given a Nook tablet to use for school, and one day as I was browsing through the apps, I saw this game on the app store, and bought and downloaded it as fast as I could. I played the game for hours, working to build a higher tower, or just beat that next level with OCD, and I can safely say, this is a game that I will never become bored of. A few more years later, I became more interested in video games, I downloaded steam, and discovered and bought this game straight away, both for my personal enjoyment, and for the support of the developers of this amazing game.   Alright, enough about me, lets get to the review!  World of Goo is a game where you build towers and structures with goo balls to reach a pipe with a certain amount of goo balls left to be sucked up by it. The challenges begin simple, but as you progress you face more difficult and unique obstacles. This game also contains one of if not the most beautiful soundtrack in all video games, with fitting music for each level. The visuals and graphics of the game are very nice, and it runs very smoothly, even on lower end computers. Finally, the story is very interesting and creative, and it ties the game together beautifully. I highly recommend you play this game!",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game!",
            "review_score": "1"
        },
        {
            "review_text": "A fun puzzle game you can always come back to.",
            "review_score": "1"
        },
        {
            "review_text": "If you like puzzles / engineering, you'll enjoy this game!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely loved this game. It's interesting and challenging. You just start loving these little dudes right away and regret every decision you ever made as soon as one of them dies. :'( I'm sry, you cute little bubbly things!",
            "review_score": "1"
        },
        {
            "review_text": "Like building a house of cards but with blobs. Strangely rewarding.",
            "review_score": "1"
        }
    ]
}