{
    "app_id": 220660,
    "name": "StarDrive",
    "release_date": "2013-04-26",
    "developer": [
        "Zero Sum Games"
    ],
    "publisher": [
        "Iceberg Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "4X",
        "Space"
    ],
    "achievements": 0,
    "positive_ratings": 547,
    "negative_ratings": 729,
    "price": 22.99,
    "description": "As a space bear, human or any other race, venture forth into the galaxy, create custom ships, conquer new worlds, build new colonies and defend your very existence against those who would take what is yours.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/220660/header.jpg?t=1447356594",
    "minimum_requirements": "OS:Windows XP Processor:Intel® Pentium® IV 2.4 GHz or AMD 3500+ Memory:3 GB RAM Graphics:NVIDIA® GeForce 8800 or ATI Radeon® X1900 Hard Drive:2 GB HD space Additional:Please Note: integrated Intel graphic card/chips not supported",
    "recommended_requirements": "OS:Windows 7 Processor:2.4 GHz Dual Core Processor or Better Memory:4 GB RAM Graphics:NVIDIA® GeForce 8800 or ATI Radeon® X1900 or better DirectX®:9.0c Hard Drive:2 GB HD space Additional:Please Note: integrated Intel graphic card/chips not supported",
    "reviews": [
        {
            "review_text": "Bought the game in the early days for full price, was listed as Multiplayer and promised many features. Multiplayer was NEVER added and none of these features we were told would be implemented, made it in to the game. The Developer secretly worked on the second game behind the scenes, using our money to fund his work rather than finishing the first one and then even having the cheek to Kickstart the second game for even more money? Only to then sell this second game back to us again, at full price! Complete rip-off. Now we're left with nothing but a broken demo. I will NOT be buying the second game and funding such a dirty, cheap money making scheme and I'd advise that others do the same. The only way these developers will learn NOT to cheat their customers, is if they have no custom. As bad as EA as far as I'm concerned.",
            "review_score": "-1"
        },
        {
            "review_text": "I cant believe the dev. would leave his original game and create a stardrive 2, Why would you create a game abandon it and expect us to buy another failure?!?",
            "review_score": "-1"
        },
        {
            "review_text": "A fun, aesthetically pleasing space strategy game that is simply awesome!  Or atleast it would be if crucial game elements were fixed.  As it stands, 02-02-2014, several game features are severely lacking in polish and there are some design flaws that really jump out - such as any unmonitored battle being auto-calculated without taking into calculation such things as ship armour or shields, etc. which essentially makes the elaborate, fully customizable ship designing pretty much redundant. Or the way that the AI can win the game without warning due to building a late-game Wonder-style building, which you recieve no notification of until it is already built and the game has ended with your defeat (though this building can be disabled by modding. But it's supposed to be a feature-complete, finished game, right?).  The game still do not feature alterable gameplay options, leaving you with only the options of adjusting video and audio.  The game's features such as customizing races are great, and the shipyard ship-designing is really fun - but if it doesn't matter in the slightest, it isn't really that much of a draw, is it?  I don't really think that I can recommend this game as it is at this stage. It has a lot of really cool stuff going for it, but when crucial elements of the game remains broken, that's really just bad. When (hopefully) they have been fixed or have become toggable (as indeed some of the problems seem to stem from the developer's design decisions), the game is definitely something to recommend. But not in its current stage.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the reason i never buy early access content anymore.",
            "review_score": "-1"
        },
        {
            "review_text": "The developer's a lying sack of ♥♥♥♥, which I suppose has never been entirely uncommon in the game industry. Unfortunately, it's not like the days of old where a game like Big Rigs would simply cause an entire company to go under, and hopefully many of those people went on to work on real games, or committed suicide.   No, this is the glorious age of crowdfunding, where ♥♥♥♥nuggets like the guy who made this game can tell you that a feature will be included, then not only fail to do so, but obtain enough support to create a second version of the game. Not even a sequel. A second version of the game that will be sold at full retail price.  So what happens if you own this version of the game? You get like, a 20% discount on the new one. That way, if you're actually ♥♥♥♥♥♥♥♥ enough to buy it, you can have two different versions of the same game in your Steam library: one unfinished, the other with the promised features for the first(maybe; I wouldn't hold my breath). It's like if every patch for every game were released as a separate version of a game and you had to pay for all of them.   There isn't even an entire company behind this game. It's just like one dude. Jesus. Let it go under so he'll go back to accounting or whatever the ♥♥♥♥ he did before he became a professional thief.",
            "review_score": "-1"
        },
        {
            "review_text": "Save yourself the money and buy Master of Orion 2...a game released in 1996 that works better than this one though it is not quite as pretty.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was abandoned unfinished. The AI is too stupid to put up any sort of fight, and there is no multiplayer to make up for it. This game could have been great with some more work, but the developer started work on Stardrive 2 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "game is very unfinished and they decided to make a sequel before finishing the first one.",
            "review_score": "-1"
        },
        {
            "review_text": "Could have been great... but the dev team just told the people who bought it to go screw themselves and refuse to make it at all playable on larger maps",
            "review_score": "-1"
        },
        {
            "review_text": "Steam should really implament a refund system for games that are left unfinished.  EDIT Yes, Steam does have a refund system now But I can't refund an unfinished game I bought two years ago R.I.P. my money",
            "review_score": "-1"
        },
        {
            "review_text": "It makes me sad to say this, but as the game is no longer being updated, it is not worth it. It is obvious that half of the feature are unfinished. It had great promise, but the game was never finished. If you want to play a great game like this, I recomend Stellaris.",
            "review_score": "-1"
        },
        {
            "review_text": "A scam. Developer developing another game, but it's all just rip and run. Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy this game the 1 man dev team stopped working on this unfinished game to work on stardrive: unity (basically transfering the game to a different engine), giving the middle finger to anyone who was dumb enough to preorder for beta or by the game after release. Promises made with no follow through. Dont waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "just another 4X each race has like 1 unique line of dialogue",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy Stardrive. This game is an unfinished product. It is, at best, “glitchy”. It's an “early access” with no chance of being fixed. Apparently, for reasons beyond the developer, he isn't allowed to work on the engine of the game any more, or something.  This is rather sad because the game needs optimization, badly. The controls and interface of the game aren't adequate. It makes an obtuse game with a steep learning curve even more convoluted. Basic RTS controls, like finding idle workers or rally points aren't implemented. At least one technology in the science tree doesn't work as described. Ships, especially freighters, lack a good path-finding, making them delay deliveries of vital goods, but it happens to offensive fleets too. Trading technologies requires you look up, -or know the cost by heart-, of everything in the science tree or risk the ire of the IA. The planet managing screen lacks clarity and the possibility for quick changes. The ship building interface refuses to show critical information, like the rate of fire, the global ammunition consumption per second or the global energy consumption. While it can be nice to figure out this puzzle, you have to recalculate everything as soon as you improve your design with new technologies. Having to look up the wiki for vital weapon-data is also unforgivable for a game that requires such precision in its main mechanic from the player. Personalising larger ship becomes a tedious chore. Speaking of ship building, while it is nice to modify them depending on your style, it doesn't take into account how the game works as a whole. The IA isn't a big threat later on in the game as much as it is in the beginning, and that can be circumvented as soon as you realise what variable the computer uses for it's moves: the size of your fleet. Just build a big fleet, and you've won. You don't even need to research, or spend hours personalising cruisers. In the end, it is completely pointless, because you will already be winning by the time you get to bigger spacecrafts, making their puzzle-like personalisation moot and time wasting. Worse, this system isn't as open as it pretends to be: you cannot build viable ships if you deviate from a certain type of fighter. If you are thinking of building a huge flying fortresses which shoots at everything in all directions, think again: one ship attacks one ship. Sure, the area of effect damage might hit others too, but that's leaving it up to chance, or worse, the IA. The attacks your ships employ are always the same: charge! There is an option to turn on a “broadside” tactic but it doesn't work according to the forums.  When you get right down to it, the changes you make to your ships are quantitative, not qualitative. You decide the weapons and the defences, and how much of each, and then try to figure out the best way to power the whole thing and keep sufficient ammunition. In essence, this more open system is just more complex than the one in Endless Space, replacing the straightforwardness of it with inconvenient and pointless creation tools. Also, Endless Space has more tactics  during  the combat phases, with three different phases, defining tactics for each, heroes and hero abilities. In Endless Space, the ships are not just flying towards each other like a Middle Age jousting competition.  It's a shame since Stardrive sounds good on paper. A better IA and path-finding across the board would have gone a long way. An IA that changes tactics depending on difficulty, rather than giving it a boring bonus to resources to compensate for it's inadequacies, would also give a more organic and challenging experience. Being able to annexe other civilizations peacefully by building a federation is great but removes diversity from the game world, by having the player taking control over the planets and fleets of the ally, making end game seem even more without challenge when you suddenly control half the map.   Finally, on a positive note, the aesthetic of the game, the design of the races and the ships, are very pleasing and enjoyable even thought there are basically references to other media (like the Wing Commander series, the mythos of Cthulhu, the Asari from Mass Effect, etc.). The mixture of all the references kind of creates its own style. The rest of the game though needed a lot more polish.",
            "review_score": "-1"
        },
        {
            "review_text": "Feels Unfinished. Best part of game is the ship designer.",
            "review_score": "-1"
        },
        {
            "review_text": "still an unfinished mess after so long, this guy is abandoning ship and making a sequel. don't give him any money for a half done game or a half done sequel. had lots of potential which is the saddest thing",
            "review_score": "-1"
        },
        {
            "review_text": "game is not finished (and it will never be) dev lied about features he promised to add. he deletes post in the gameforum that are poiting this two problems out.  And now he is creating stardrive 2, that has not any big improvments in it (it has just more lies). So don't expect that sd1 will be devolped any further.  Don't buy this game or the new one. it woulde be a complete waste of time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "Not a bad concept as this game is quite different than traditional 4x games, but honestly this game just feels too 'small' to be anything other than a bargin bin, $5 time waster. Here's why:  1) You can discover the entire galaxy with literally your first scout ship with almost no impunity. No need to develop a drive or anything.   2) You can seemingly spend your time waiting on research building way points that connect virtually everywhere (seemingly no drawbacks or economic penalty for doing this).  3) Economy is ENTIRELY population based. Expanding your empire's economy relies on you NOT building any actual buildings (at least early). Maintenance costs on buildings that are designed to increase food, defenses, or production ALL drain more out of your income than actual ships, so it's better to just colonize and send colonists and food to the planets for seemingly forever till they have enough people to grow. Just a bizarre concept that doesn't feel rational to me, there really is no option to have a small, but robust empire. It's zerg expansion or die.   4) Conquering enemies, likewise, involves nothing more than zerg tactics (i.e. spamming smallers missle ships and troops). All you have to do is land more troops on the planet than the enemy has and it's soon yours, you can actaully do that by flying right past their defense fleet and zerg landing while a small number of attacks ships keeps their fleet busy. Very silly strat but works easily.  5) Diplomacy is haywire. People either love you to death regardless of your actions or they want to murder you out right. Then they simply want to join with you or your enemy, effectively taking the diversity out of the galaxy and matching one big against another big. Really saps the interest in the game.   6) Ship design is convoluted and seemingly pointless. You don't know what you need to put and where and there is no manual whatsoever to figure it out. Simply putting a power source on a ship isn't enough, you need to add wiring that connects the guns or the shields or the bridge to that power source....at the expense of things like armor. It's like a really terrible game of minesweep to be honest and I like complexity in games, I play 4x games and Paradox games like EU, CK2, and Hearts of Iron....but this ship design leaves me baffled.  All in all, this just feels like a very incomplete game that could have been much better if things like the economy and diplomacy had been fleshed out. The battle system is fun to an extent, but it boils down to zerg tactics. Bring enough cheap to produce missle frigates and focus fire for the win, leave the tactics at home.   I can't recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is buggy and unfinished, incomplete, akin to an alpha version. This could be such a cool game but I guess they rushed it.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥s this game and its Devs.",
            "review_score": "-1"
        },
        {
            "review_text": "Do not feed indie developers, who behave like EA. Game is clearly unfinished, and before they finish it they announce second part. Lame science tree, lame engine, space battles, AI, diplomacy, everything. The only good thing is race design and ship design, but even here great balancing issues. I would recommend it for 1.99 as a game for a pair of evenings, nothing more.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was playable in beta, but was unfinished. At release, not all features were delivered. Rather than fix up those outstanding issues, the developer went ahead and developed a second game instead of finishing this game.   You could play Star Drive, but it really isn't ideal without extensive modding on your end to make the game a bit more playable.  It's a bit of a shame, the game had promise for a 4X but it just wasn't finished.",
            "review_score": "-1"
        },
        {
            "review_text": "Still needs work. You can spend hours designing ships, planning fleets, and in the end... It won't really matter.",
            "review_score": "-1"
        },
        {
            "review_text": "It does not matter what anyone else tells you: this game is not finished and has been abandoned by the developer. It will never be finished nor its bugs fixed. Some of these bugs are game-breaking and there are many features that are either incomplete (to name but one: game mode. You can choose it when you start a new game, you get to choose only one option, though -_-) or inexistant.  Now to the game itself, it is an ok game that appears to be a rip-off of a lot of games, but the ship designer as well as space battles are genuinely fun. I would almost call the initial ships being crappy a stroke of genius since it gives you a nice challenge to build good ships for each faction and possible tech configurations etcetera, this part is really fun. The automation of building them is ok, and putting them in fleets is very nicely done with the fleets manager.  The gameplay itself, not so much. You initially start with one planet, and the one whom colonizes the most suitable planets the first is generally the first to win. If your race has improved metabolism that is every planet with 0.8+ fertility. Mind you those planets tend to be rare (10-15% of all colonizable planets I think?), which only makes it worse that you can also choose to make your race cybernetic. Combine that with industrious and improved metabolism and suddenly your requirements have changed to all planets with 0.8+ production instead (assuming 20-25% tax rate). This basically means 75% of all colonizable planets, most of them being uninteresting to other races except the Opteris (cybernetic), mainly for this reason, that race can actually pose a challenge in the hands of the ai. Granted, you can research stuff to make all planets viable for colonization or bother with crappy food transportation, but that goes against colonizing fast.  So combat: by default, you are at peace with every race. If you have troops/fleets in orbit of each of their planets cabable of annihilating them in a few seconds they will not care. If they intercept one spy they are likely to declare war, but with war you get space battles! Still, if you choose the best possible strategy, there will be no space battles: as long as your military strength is higher than your opponents', only the Opteris will ever dare attack you. And even when it is not, half the ai players will generally just seek peaceful relations (pacifist/cunning/honourable ais). There are also planetary battles: capturing planets through troops. Troops cost no maintenance, though, so flooding each of your planets with troops is a sure way to win: the ai will never bomb your planets.  Remember the game-breaking bugs? One of them involves unlimited production! It involves having shipyard, you spend 10 spare production on a ship, get 13 invested, cancel it, and now you have 13 spare! The shipyard effect even stacks with multiple shipyards, so I don't think I need to tell you how horrible it is to leave this bug in the game.  Overall I give this game a 4.0/10 Kicking dumb ai asses does make me feel better, but you are better off with something like Distant Worlds.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game when it was in development. Now it is finished, but nothing really changed. Author promised so much, made this project sound so promising, but abandoned it. When his fans (me including) tried to force him to fulfill his promises, he made some adjustments, bringing the game to the state 'Shut up! Now you can`t sue me!'.  He promised 'quest system' - now we have 1.5 quests. That`s not a joke, that is exact number. One complete quest and one that can be started, but can not be finished.  He promised multiplayer - there is no such thing.  And the list goes on... and on...  Now he is making 'new' game. Which is the same game, for a full price, once again...  People like him undermine reputation of crowdfunding. All because of him, some really good developers won`t be trusted... ",
            "review_score": "-1"
        },
        {
            "review_text": "Good ideas but lacks a good AI as well as good tutorial.  Too expensive for what it is.",
            "review_score": "-1"
        },
        {
            "review_text": "So i sunk about 20 hours into this game comparing it other games in the turn based/semi realtime space expanding empire genres. A genre i really enjoy.  At first I thought the game mechanic and themes could be good and was enticed by the ability to find, explore and colonize new worlds.  I was impressed by the level of scripted automation and the feel of some of the game.  Unfortunately for me it fell short on the gameplay side of things and many aspects seemed to be very similar to other games of its genre.  Unfortunately I did not reach the compelling and addictive gameplay I was looking for andI think some areas were on the right track but did not quite make it to the punch the developers were potentially looking for.  Dont give up just yet, maybe a followthrough on the detail and gameplay in the sequel?  3.5/10 . frustrating once you finally get a handle on things. Sorry. ",
            "review_score": "-1"
        },
        {
            "review_text": "I did enjoy the game for quite a while, but it seems that the dev gave up on it. Still quite a few issues with it to where it almost is unplayable now.",
            "review_score": "-1"
        },
        {
            "review_text": "Non-intuitive interface.",
            "review_score": "-1"
        },
        {
            "review_text": "while there are bugs in the game, they don't really affect the gameplay itself. Unless you're really strict about having to complete a game. This game is still very good and I enjoy playing it",
            "review_score": "1"
        },
        {
            "review_text": "The game can be fun for a little while, but rapidly gets boring due to how generic and derrivative it is. Recently I played through Masters of Orion 2, and honestly, if you are considering this, you should go play that instead. All of my concerns are forgivable except that, instead of fixing the problems with his game, the developer seems to have decided to release improvements as a 'sequal'. The fact that his new race is a blatant rip off of the Remans from Star Trek does not help his case. There is a difference between giving nods to well established scifi and blatantly plagerising content.",
            "review_score": "-1"
        },
        {
            "review_text": "although it started out very promising, the game never progressed beyond beta stage, and it seems the developer abandoned it after a quick cash grab  technologies are missing, missing ships and titans for some races that were supposed to be added, countless bugs  the only thing rewarding about the game in its current state is ship building and design, since all other aspects of the game are horribly broken or imbalanced.  its a prime example of why 'pay for beta/alpha, influence the development' style of funding doesnt work, as the developer has repeatedly ignored the fanbase, and has simply cashed out after making enough shmuck bucks. in the time the beta was made available on steam there has been scant amount of updates, and zero has simply slapped a sticker on the game saying its complete, when it is clearly not.  alot of people feel cheated, and really, they should. theres so much potential here ruined by laziness and greed.  i hope the developer will get the stick out of their ♥♥♥ and get to work on finishing the game, but that seems unlikely at this point. I would go as far as suggesting legal action should be taken, as it is blatant false advertising that sold this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed the vanilla version of this game and was looking forward to downloading the updates. It is now a ruined game. It had it's flaws before but rather than fixing those flaws the developer chose instead to play around with the parts that weren't broken to begin with. For example homeworlds always used to have 2 richness and 2 fertility. now every time I start a game the homeworld only has 1 richness which makes an already long game take hours longer. Furthermore I have never been able to properly install a mod (wanted a sudden death version where research only took 1 turn). My advice: this game is no longer worth buying. It was on it's release but it's been broken.",
            "review_score": "-1"
        },
        {
            "review_text": "Artistically, this game is wonderful: the aliens are cute and funny, the ship designer system is very satisfying.  However, the AI is quite passive, barely even invading when they're at war, and crushing them into dust one system at a time is actually remarkably tedious.",
            "review_score": "-1"
        },
        {
            "review_text": "Not impressed, to have a game not complete, 'release' 1.0 STILL not complete, and then take the money to develop the sequel. Do not buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "LOL Finished tutorial *( &lt;5 minutes)  Game Froze and crashed.",
            "review_score": "-1"
        },
        {
            "review_text": "Some good ideas in a half-finished totally unpolished package. Glitchy and without even the most basic features (like any victory condition besides conquering every single tiny planet of your enemy which could be dozens).",
            "review_score": "-1"
        },
        {
            "review_text": "This game was never finished.",
            "review_score": "-1"
        },
        {
            "review_text": "Good ideas undermined by laziness and an unwillingness to follow through to the end. So many halfway story threads, half-developed concepts, and unfinished features plague this game from back to front, not to mention unfixed bugs throughout. If you haven't checkd into the whole fiasco surrounding, I suggest you at least read through the summaries before you decide whether or not you want to put any money into this unfinished game.   As well, I would say caveat emptor to anyone considering the sequel as well, considering the track record of the developer to abandon games once they get the money from the sale. Unless you think that the first release of StarDrive 2 will be a perfect, flawless game, don't count on any real effort for improvement after version 1.0.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow. Stardrive. So sad. Early access is a double-edged sword. On one hand, you get to watch a promising game grow into something really special. On the other, you have Stardrive: A great concept lead by a thief. We were promised bug fixes, more content, and multiplayer. Instead, the dev took our money, discontinued development on this game, and moved on to Stardrive 2. He promises a 33% discount on the sequel for everyone who bought into his scheme. He will not be getting anymore of my money. It's a shame really as the game had a lot of potential.   As it stands Stardrive is okay. Not great. Not good. Just okay. A real-time 4x with fully customizable ships? Sounds awesome! It totally would be if it wasn't for all the game-breaking bugs, stupid AI, performance issues, and lack of multiplayer. All of which were promised to be addressed before the dev took our money and ran.   For around the same price you can grab countless other 4xs that are worth your time and are made by people deserving of your money. Let this game be a lesson to always be wary with early access titles. ",
            "review_score": "-1"
        },
        {
            "review_text": "For someone who has played both Sins of a Solar Empire and Galactic Civilizations, this game was a terrible disapointment. I would not recommend this game in anyway and would take the aforementioned titles over this one. Stardrive introduced no new ideas, and in fact, left out some of the very things that gave these games their appeal.   It's obvious that Stardrive was modeled after Galactic Civilizations. Why the creators felt a dumbed down and uncreative version would be acceptable is beyond me. I spent the money. Don't make the same mistake I did.",
            "review_score": "-1"
        },
        {
            "review_text": "tl:dr There are no credits anywhere in StarDrive. I'm not surprised. I wouldn't want to put my name to this crap either. And don't buy StarDrive 2 either.   I've read a lot of the reviews for this game and they all read much the same, that it was the product of a lone developer who took the money and ran before the game was finished, but not many actually talk about the game beyond 'it could have been great!' So to give some insight into what StarDrive is really like:  * Path-finding is appalling - Use alt+click to override if you want your ships to get anywhere as fast as possible. There is also such as a thing as too fast. Keep the FTL under 100K unless you want to watch your ships play ping pong around each destination. * Accuracy of weapons that use munitions is appalling - You can either use beam weapons (and suffer appalling lag) or spray the battlefield with ordnance (and suffer appalling lag) to increase the likelihood you'll actually hit anything. * Ground battles are appalling - Have more troops in orbit than there are tiles on the planet, land them all at once and then let the AI take over and forget about it. Do not bother trying to micromanage the ground battle, it is a waste of time and takes too long, so just wait for the notification saying you have taken over the planet. * Manual ship control is appalling - There is no point of reference when you take manual control of a spaceship, the mini-map does not zoom in to help you navigate and the only way to get some idea of which direction you are travelling is to fire forward facing munition weapons and see which way they drift. It is truly horrific trying to fight using manual control, most of the time you'll just be turning on the spot hoping the enemy ships really will fly into your gunsights. That is if you can even get your ship to stop. * The AI is appalling - Nothing can be done about this, although you can abuse it. You can bombard a planet into nothingness and then leave at least one bomber continually dropping nukes because the enemy will continually try to recolonise it until you have wiped them all out of existence. Also, the AI does not send more than four ground troops at once for a ground assault, so just make sure each of your planets has as many hard troops as will fit. * Diplomacy is appalling - Just make sure you buy alliances before someone else gets there first. * The interface is appalling - There is no way to delete save games from within the game. When I did finally find them the first time I did a manual search of the hard dirve they had consumed over 4GB of storage space. * The lag is appalling - By far the worst problem is lag. You won't notice it at first, but the longer a game lasts the worse it gets (and not always because of large numbers of ships). The most impressive lag I've seen is when the final game stats run. I just get the impression it's replaying the game in the background all over again because how else can you make the final game stats lag so atrociously? It's just a map with three bar charts!  There is loads more wrong with this game, this is just a shortlist of the ones I can remember, but there must be a reason I pumped 78 hours into this monstrosity? Well, I got it in a bargain bin from an actual shop, so didn't see the reviews initially. But, the main reason I wasted so much time on it is modding. People complain about the crappy tech tree and the cookie-cutter planet development. Then just mod it. Literally everything can be modified. I had whole new branches of technology, new ship hulls (most notably the Borg and a smiley face), new artifacts, new ship modules (from armoured reactors and reactors that were armour, to guns that never ran out of ordnance and armour that was a gun and provided power and never ran out of ordnance), ships that could travel the universe in seconds, new planetary buildings, and so on. Literally everything can be modified, and once you learn how it's not that hard to make a change and then test the effects. Unless you make a mistake, then the game fails to load. Even then, with a little practice, you begin to learn how to read the error message. It is even possible to modify armageddon and have a game that never ends. (Which actually means ends when it crashes.)  So given all that potential for making improvement why do I not recommend this game? Because once you start rooting through the game files to make changes you begin to notice strange files and folders that hint at missing features and you begin to understand just how much was left unfinished by the developer and the fact they couldn't even be bothered to remove all of this before releasing the game as a finished product. Like a hint at just how much you are missing out on. But worse than that, even though you've modified every single aspect of the game so you can effortlessly hold off armageddon indefinitely, it only works if you micromanage every single battle because the AI is appalling. I did try imagining my ship commanders were just drunk bullies because they always go after the smallest, weakest enemy ship (fleet orders reset to defaults as soon as you close the fleet setup screen), expertly missing them even though you've modified the Vulcan into a minigun-shotgun with the range and fire power of a sniper rifle, all the while oblivious to the enemy capital ships playing turkey shoot with them, but I couldn't hold that thought for long because it really is a just crap programming and a crap AI. And indefinite ends when the game decides to crash from out of memory (which is impressive when not even a quarter of the 8GB available on this machine is being used) or you just can't stand the lag any longer and know that the lag in the endgame stats is most likely going to crash the game anyway.  And then you read the reviews for StarDrive 2 and see the pattern repeating and you realise the developer is never going to learn so long as people continue parting with the cash for unfinished products.  Actually, there is one final point to make about this game. I've never before come across a game that didn't have credits somewhere. The credits might run when you complete a game or be hidden somewhere in the menu, but they are always there somewhere. There are no credits anywhere in StarDrive. I'm not surprised. I wouldn't want to put my name to this crap either.",
            "review_score": "-1"
        },
        {
            "review_text": "Peice of trash did not even save my ship design - 10/10 IGN",
            "review_score": "-1"
        },
        {
            "review_text": "Sadly this game would be great if the dev was actually supporting it, it is plagued with bugs and will never get multiplayer, I recommend waiting for Star Drive 2",
            "review_score": "-1"
        },
        {
            "review_text": "realtime in this genre was an Interesting idea, but poor execution, I'll stick with my turn based spacing games for now",
            "review_score": "-1"
        },
        {
            "review_text": "Extremely fun game. Fun to watch epic space battles, easy to get a hold up, and can still be complicated! Excited for StarDrive 2 coming out next week! 33% Discount for StarDrive owners, so if you can't wait pick this up!",
            "review_score": "1"
        },
        {
            "review_text": "I don't recommend buying anything from this developer. They promised multiplayer, and have completely backed out. They didn't finish this game and went on to make the sequel which has they have also not completed.",
            "review_score": "-1"
        },
        {
            "review_text": "Star Drive has a lot of potential.",
            "review_score": "1"
        },
        {
            "review_text": "This game had major potential, too bad the developer doesn't. Zerosum games is dead and will never be perceived other than a deadbeat dev. GOOD dev's don't abandon their games.",
            "review_score": "-1"
        },
        {
            "review_text": "There FINALLY is a great MOO2 replacement! I like it!",
            "review_score": "1"
        },
        {
            "review_text": "Creator never delivered on promises and took my money to work one the second game. Won't be buying star drive 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of time. Nice idea but unfinished and left to rot by the dev.",
            "review_score": "1"
        },
        {
            "review_text": "This game had so much potential but the game has been dropped by the dev so he can make stardrive 2 I do not reccomend that you buy this game. the most recent update has rendered the game unplayable and the dev will not fix it. stay clear of any game made by this dev you will get screwed over.",
            "review_score": "-1"
        },
        {
            "review_text": "It isn't finished and neither is Star Drive 2. Don't buy this game please, please don't encourage this kind of game development.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't even bother buying this unfinished, buggy mess.",
            "review_score": "-1"
        },
        {
            "review_text": "True gamers will always want to play a strategy game deep within. But this game? I think a politician will give up otherwise. The whole management game is so tedious and difficult to calculate, even it you have the auto manage feature, it becomes like a radar screen.",
            "review_score": "-1"
        },
        {
            "review_text": "Patch 1.15 completely has ruined my 70 hours of gameplay on second hardest mode. simply sontinues to give me fatal error messages of all shapes and sives. mno matter what i do, even down to deleting content under browse files tabs, i simply cannot get the darned thing to work. Advie to stardrive developers dont screw ppl over who have devoted SOOOO much time to one single endevoeor",
            "review_score": "1"
        },
        {
            "review_text": "It's like CIvivlization. In space, with customizable spaceships. Top view only.....cheating AI and a seriously..tough tough time to dig into. And it's totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I'm giving it a positive review because up until the game crashed, I absolutely loved nearly every second of gameplay. Unfortunately, it does seem to crash late into the game and I could't get around that. I definitely wouldn't pay full price for this game, but if you can get it on sale like I did (75% off) I'd buy it again without question. It plays like Masters Of Orion 2, the graphics for the ships are pretty good, the gameplay is awesome. The Tech Tree could be a little more extensive, but I didn't have a problem with it.",
            "review_score": "1"
        },
        {
            "review_text": "Quite simply one of my favourite 4x space games.. Have have spent hours playing this game and enjoyed al lof it..  Basically if you like this type of game then its a must have its as simple as that.",
            "review_score": "1"
        },
        {
            "review_text": "It's simply not a complete game.",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a space-sim and 4x addict, but this crude and clumsy game just didn't do it for me. Look elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly i played the ♥♥♥♥ out of beta, i thought it was awesome! i bought the game and only played 3 hours.... a year later maybe? the game is still unfinished? it seems the game was toss to the side",
            "review_score": "-1"
        },
        {
            "review_text": "Captains log: It is Stardate 1000. If you like strategy games and space you'll like this game. It's not very fast pace though. More along the lines of a turn based game to be honest. Awesome game considering everything, just a shame that it was single player only with no co-op or multiplayer options.",
            "review_score": "1"
        },
        {
            "review_text": "This game is far too overambitious for its developer and suffers from a long list of minor (and bigger) issues that makes for a rarely entertaining experience in the long run.  There's also a humongous amount of drama over recent censorship moderation on their forums, essentially banning anyone who has any criticism for the game or its updates - whether constructive or not. Add to that censorship of the Steam review system and you've got a developer you probably don't want to put your money towards unless you really - really love 4X games and have grown tired of every other one in existence.",
            "review_score": "-1"
        },
        {
            "review_text": "Diplomacy is a bit simple but otherwise a great 4X game, if you dont mind every game devolving into warfare victory",
            "review_score": "1"
        },
        {
            "review_text": "I love building my own ships and making alliances or war with the other races, and watching my own ships demolish theirs, it's so satisfying to see a fleet YOU built tear apart the AI's.",
            "review_score": "1"
        },
        {
            "review_text": "Unfinished P.O.S.",
            "review_score": "-1"
        },
        {
            "review_text": "A brilliant real time take of the Space Empire series, feels and plays similarly to those old classics. Did I mention real-time?  Sadly, dropped in favour of developing Stardrive 2. Product remains unoptimised and buggy, but is still enjoyable. ",
            "review_score": "1"
        },
        {
            "review_text": "Well I got sucked into this one. There's no other ship customization like it. Not only does what you put on your ships matter but where you put it does too and I've had a lot of fun with that. It's a game that lacks a few things, but what it does it does very well and manages to capture that classic 4x epic space strategy with an RTS feel.",
            "review_score": "1"
        },
        {
            "review_text": "If you go into this game knowing it's more akin to Gratuitous Space Battles than to Master of Orion, there's a lot of fun to be had.",
            "review_score": "1"
        },
        {
            "review_text": "I know there are a lot of negative reviews about this game but i can't see why ,StarDrive is a great game and very addictive, I prefer it over it's sequel which is basically endless space plus the ability to watch ships get boarded, which is pretty cool. I'd say StarDrive is a mix between endless space and supreme commander, there's a kinda turn timer and you have to build your units in real time.  However, fair warning it will lag your computer a lot when you eventually get to having big battles and if you ever activate the in game story (It's kind of a story) and you don't have cruiser class ships everywhere you will die horribly.",
            "review_score": "1"
        },
        {
            "review_text": "Developer calls an unfinished game 'released' then begins work on a sequel without delivering core features which buyers have been told they'd get. As a 'finished' game with little chance of further significant updates, not worth the price.",
            "review_score": "-1"
        },
        {
            "review_text": "Space combat is exceptional due to the ship design and research systems. A must have for shipbuilders. And, it's real time strategy, no turns here.  Ground combat is terrible, I hope they leave it out of StarDrive 2 alltogether. It just gets in the way of space combat!  Diplomacy is straightforward; AI will either friend you, or declare war right off the bat. Makes things interesting. Although, the only way to win is to kill everyone. Even your friend, Mr. Treesong.  Racial graphics look very nice, sort of a high quality Flash display with artistic flair. Space weapon effects are pretty good, especially the laser turrets. I always make sure to spam those. XD  I'm not sure why it's still priced at $30. Buy it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Video looked interesting. But.... you are given a fixed amount of time to explore this proceduraly generated galaxy... Each play through takes a max of 15 minutes. the Galaxy that is generated is actually quite tiny. The enhancement of your ship is pathetic. Don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't bother with this. The Dev gave up and has moved onto a sequel, just wait and see how that goes rather than wasting money on this.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is obviously out of date, so my review is obviously too late as well. However, I've bought the game, and now played the game, and so I review the game.   It's too damned slow.   It takes hours to get your single-player, one-shot empire going, and then it takes even MORE hours to prosecute any wars you get into. The ships take a week and a half to turn around and most of the time they ignore orders or at least show no sign of receiving said orders. I'm forced to constantly click them towards any planet I want bombarded, and then they ignore anyway, and attack useless enemy ships that will affect NOTHING in the game. I just ended up CTRL-ALT-DELing the game to close it because it also takes hours to open and close. I'd delete it from the system, but that will probably take hours too, so I'll wait until I go to sleep to do that.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this in the Humble Bundle for $3.63. It's a very good game, and I have yet to run into a bug like everyone says that have. It's a pretty complex strategy game, but once you get the hang of it, it's very addicting. I recommend this if it's on sale for $10 or less.",
            "review_score": "1"
        },
        {
            "review_text": "Most people dislike this game since the developer abandoned the game and that it feels incomplete but this in no way makes it a bad game. If you love 4x games like me then this is one you should at least try out before skipping over it and going nope. I would recommend this at a discounted price though since 30 dollars is just stupid xD.   Oh and if you all wanna make the game feel more complete there are plenty of mods out there that do just that.",
            "review_score": "1"
        },
        {
            "review_text": "No real tutorials to speak of.....barely playable game.",
            "review_score": "-1"
        },
        {
            "review_text": "As others have said it would be a thumbs up if the bugs were being worked on, but they aren't and your left with the shell of a great game. Real shame had lots of promise.",
            "review_score": "-1"
        },
        {
            "review_text": "was fun for a time, but has since been abandoned in its horribly unfinished state",
            "review_score": "-1"
        },
        {
            "review_text": "Very enjoyable game. Mods greatly increase replayability though. Would recommend for sure",
            "review_score": "1"
        },
        {
            "review_text": "From the brief time of early access to the first release of the game, there was no new update, since then, it has only been minor tweaks, few and far between. Before early access, there was promises of a fully fleshed out experience. During early access, those promises remained. A few moments after first release, the dev stated that he will no longer be working on this game, so he may have time on his newer game which will be almost exactly like this game, only in a different engine, and hopefully better. He has also said that he plans to give all those who have bought StarDrive a discount on his next game, whenever it's released on Steam. Who knows how much of a discount that will be. Take a risk, buy this game discounted heavily in hopes that it will make the next game cheaper than the full priced original. Play this as the alpha that will never be finished. Don't buy this as a finished game, or even one that you expect future development on.",
            "review_score": "1"
        },
        {
            "review_text": "Enter your own space opera, let your empire management &amp; ship design fantasies become real, and then watch them turn to dust as you encounter implacable alien foes.  This is the most ambitious 4X game I've ever played!",
            "review_score": "1"
        },
        {
            "review_text": "A very cool strategy game, If you enjoy designing your own ships.",
            "review_score": "1"
        },
        {
            "review_text": "Lost way to many hours in this game.",
            "review_score": "1"
        },
        {
            "review_text": "I truly enjoy the game's 'free to do as you please' concept you can be a Mighty Concourer, a Nobal Leader of peace, or an Impereial minded colonizer, the gameplay is smoth and streamlined and fun to play for hours on end!,  I give this game five out of five stars !",
            "review_score": "1"
        },
        {
            "review_text": "I know this game has bin slamed by a lot of pepole but you now what this has bin one of the best space games i have played loved the fact that you had troops on a planet to help defend it becuse most of the time in other space games you feel like you lake something to help deffend your planet, loved building factores and other things on a planet and the reserch tree. true it is hard to beat the game becuse the ai keeps colinizeing every single planet but that is why there is a small or tiny galaxy to help with that. all in all i got this game when it was a huge discount and i feel that it was not a waste of 4.99 but 20$ for it is a little much look forwerd to the 2nd one that one looks more like what stardrive 1 was sopost to be",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game if you have some time. The tutorial is not super helpful though.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Interesting 4X, feels like more recent additions, but cheaper, and it just feels more tactile. Probably because of the 2D playing field.",
            "review_score": "1"
        },
        {
            "review_text": "I found this game to be alot of fun its very similar to many of the 4x genre games but with an rts feel. My favorite feature no 'Next Turn' button to push.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't even figure out how to play :/",
            "review_score": "-1"
        },
        {
            "review_text": "get this game!!!",
            "review_score": "1"
        },
        {
            "review_text": "Soooo many haters, when i see that there's nothing to hate over Its a single player game thats made very well and something that is really fun and really intense.",
            "review_score": "1"
        },
        {
            "review_text": "5/10 Reminds of CIV Gal 2, has quite the bugs in it. Cant access the Menu, game crashes while i tab alt.  ",
            "review_score": "1"
        },
        {
            "review_text": "Well it looks nice. The big emphasis on combat makes it a ♥♥♥♥ benchmark for the '4x space strategy genre'. Galaxy looks and feels lifeless, exploration doesn't feel as rewarding. Combat is good though with lots of pew pew pew. Think of it is a nice bigger scale RTS with some planetary development/colonisation attatched. Ship design is okay but because of a modular design based on visual schematics you are limited in what you can make. This is not the grand epic galaxy brought to life 4x game. This is pretty but no real depth or real sense of scale.",
            "review_score": "1"
        },
        {
            "review_text": "Great time-waster, a must buy.",
            "review_score": "1"
        },
        {
            "review_text": "it's alright, but master of orion 2 was better as are some of the newer ones",
            "review_score": "-1"
        },
        {
            "review_text": "Realtime 2D Space 4X.   Ship customisation is awesome, planet micro is not. The AI can handle a lot for you which is great (and a must). Ship/Fleet management is overwhelming and not very necessary given Stardrive's game mechanics - which is disappointing. Research tree is unnecessarily complicated (i.e. it is poor but not as bad as Sins of a Solar Empire).   Did you understand all the jargon and enjoy MoO2? - then this is your game. Endless Space is better than Stardrive in all aspects but Endless Space has a completely different ship combat mechanic and is turn-based. If combat is the make or break choice: choose Stardive if you want to control swarms of 2d ships, choose Endless space for battle strategy and awesome combat visuals.   Get it only on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Takes days to wins but its fun doing it.",
            "review_score": "1"
        },
        {
            "review_text": "Stardrive is one of the better 4X style games i've played. It's got a fluid 'turn-based' system which keeps you informed and able to calculate, without slowing down the game. I find it a good blend of the 4X and RTS genres, retaining some of the better parts from both. Every 4X game i've played has had its flaws, and Stardrive is no exception. But out of the games i've played, i find it my favorite. Definitely a good buy.",
            "review_score": "1"
        },
        {
            "review_text": "I personally love this game. A good real time version of say Mastor of Orion III combined with Galatic Civilizations. I'm not sure why people are saying this game is super buggy and crashes all the time. I have played it for many hours and have never had any game breaking bugs. A good buy for space civilization game lovers. Some features are lacking and others are glossed over, but the important ones are still there: good ship and empire designing and building. I would give it an 8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Buy it as soon as it has MP",
            "review_score": "-1"
        },
        {
            "review_text": "While it still feels incomplete, it's a 4X space game where you can build your own ships like you could your units with Alpha Centari. It's use of XNA means simple mods are exceptionally easy to build and run, so the Modding community's taken off. Once Stardrive's really complete, it's going to be an exceptional game.",
            "review_score": "1"
        },
        {
            "review_text": "Now that it's been officially released, I am going to recommend to everyone who sees this and enjoys 4X games to give StarDrive a test.  StarDrive is a game of immense depth. You are provided the option of designing your entire fleets to your specifications -- you can create ships using a variety of weapon types and defenses. The game even facilitates some very interesting and not inherently obvious strategies surrounding your ship construction.  The gameplay itself is basically a 4X RTS/TBS hybrid. 'Empire' related things, such as economy, diplomacy, and colony management are done in timed turns where each turn is something like five seconds. 'Ship' related things, such as flight, combat, and eventual destruction are handled in real time.  This game sucked away more than 100 hours my play time before it was even released. It can do the same for you, too, if you would like it to.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a really steep learning curve. Unless you are ready to micro manage the economy, agriculture, science , ship building, weapons, armor....   I wouldnt recommend it for people looking to just jump in and start shooting and blasting everything. This game will require a whole new level of strategizing, diplomatic relations, conquering worlds for resources, going to war etc. I think if you can get the hang of it, it would be really fun. It defeinitely takes a person who is above average intelligence to really understand the game mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "It's been a long time since I have played a good game of this genre. This is probably my all time favorite. Better than Sins of the Solar Empire and Endless Space. It truly is the best of it's kind.",
            "review_score": "1"
        },
        {
            "review_text": "Don't mind the ♥♥♥♥♥♥ reviews. This game is amazing and the author is adding new features every week. Sure it was released to early but it's still an amazing game.",
            "review_score": "1"
        },
        {
            "review_text": "I was hoping for a good MOO reboot, this is too RTS for that and gets boring. Unless you like endless ship modding.",
            "review_score": "1"
        },
        {
            "review_text": "I really wanted to like StarDrive. It reminded me of the old Stars! game for Windows 3.1, where you would define your alien race, expand, conquere, research and design new ship layouts. It sounded like a great modern update. But after playing for a while, expanding a lot, and making a large fleet, I tried to attack a small faction and lost for no good reason. It feels like there's a 'correct' way to play this game and they never tell you anything about how to play it. For instance, to conquer a planet, you have to take out the ships guarding it, and then send colonists over in separate transport ships to fight on the ground, which is heavily favoured to the defender. You have to outnumber them like 10-1 to have a hope of taking the place. So after spending an untold effort in trying to take ONE planet from a small faction, my faction gets into a civil war and my homeworld gets heavily attacked, at which point I lost all interest in this game.  The mechanics are clunky and not at all expained. To top it off, it seem like a lot of features where left unfinished in favour of working on the sequel, so overall, I would say avoid. I mean really, 75% of the 4x games on steam are space based like this. Search games by tag and find a good one to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Closest thing to MOO on a post Win95 system. Love it!",
            "review_score": "1"
        }
    ]
}