{
    "app_id": 220700,
    "name": "RPG Maker VX Ace",
    "release_date": "2012-12-10",
    "developer": [
        "KADOKAWA"
    ],
    "publisher": [
        "Degica"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Steam Trading Cards",
        "Steam Workshop"
    ],
    "genres": [
        "Design & Illustration",
        "Web Publishing"
    ],
    "tags": [
        "Game Development",
        "RPG",
        "RPGMaker"
    ],
    "achievements": 0,
    "positive_ratings": 3372,
    "negative_ratings": 210,
    "price": 52.99,
    "description": "RPG Maker VX Ace improves on every aspect of creating your very own epic adventure. An extremely powerful editor, Ace supports multiple tilesets, offers full control over autoshadow and has a very flexible features system.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/220700/header.jpg?t=1533615156",
    "minimum_requirements": "OS:Microsoft® Windows® XP / Vista / 7 (32-bit/64-bit) Processor:Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory:512 MB RAM Graphics:1024 x 768 pixels or higher desktop resolution Hard Drive:400 MB HD space",
    "recommended_requirements": "Processor:Intel® Pentium® 4 2.0 GHz equivalent or faster processor Memory:512 MB RAM",
    "reviews": [
        {
            "review_text": "This is a solid tool that will enable you to create JRPGs with relative ease. And I would love to recommend it because it really IS a good and solid piece of software. Putting together a small game is a breeze- maps are designed in a WYSIWYG editor, there is a good default library of graphics and objects. And everything works just fine. Random encounters, multiple characters, shops, turn based combat, it's all there right out of the box and even a newcomer will quickly see his idea turn into something playable. In addition, you're free to release your game whichever way you see fit, even a commercial release is possible. There is a lot to like here.  Still I find it hard to fully recommend RPG Maker VX Ace. This is why:  1) It is very expensive. 60 Euros are a lot of money, especially if you're just curious and maybe want to make a small freeware game. The program has been on sale quite regularly though, dropping to 15 Euros, and that is a good investment indeed. But before you shell out even THAT money, consider getting the freely available 'limited' version, which has everything the commercial release has, and only limits the number of objects that can be used. It's still absolutely possible to make decent games with it.   2) It is highly restrictive. You can make 'classic JRPGs' with ease, but as a newcomer, you're truly stuck with the template RPG Maker provides. The interface, combat rules and attribute system are very, very basic and apart from a quick paint job there's not much you can do... until you're ready to dive into Ruby scripting.  3) Scripting is a pain. On the pro side, the Ruby SL is powerful enough to change virtually every aspect of a project. You can create your own combat system, you can create your own attribute system, you can create new interfaces and really make something unique. But the editor is so barebones that you can't really do it comfortably, and especially if you have ever used a more advanced code editor you'll soon wish you could write your code THERE.  4) It doesn't take advantage of ANYTHING. Multiple resolutions should be a standard these days, but here you're stuck with a relatively low native resolution that looks charmingly retro or crude depending on your personal opinion. Large games tend to stutter occasionally. And what about a decent options menu? Not to be found.  So that's the gist of it. If you like JRPGs, see RPG Maker VX Ace on a discount and feel you can live with the limitations, I daresay you won't be disappointed. It's really fun to make a plot-driven game and see your ideas walk around the screen. Then there is the vast amount of resources available; if you put some effort into it your game can look downright stunning. And there clearly IS a lot of quality in the product- it's not been around for so long for nothing and the Steam version with its Workshop support will defenitely prove worth your while.  But it could, and should, be so much better, more accessible, more comfortable to use- and that's where the tool lets you down.",
            "review_score": "-1"
        },
        {
            "review_text": "RPG Maker is a great entry tool for those who just want to play and try their hand at story making, this comes premade with character art and tiles so all you really are doing if you dont know how to script is making the story, I highly suggest that if your going to be buying this to not go into it thinking that you will make a game to sell, in order to make anything that is worth putting on the market it would require a complete rework of the engine and alot of custom art. In the end I have enjoyed working with it and would suggest it, but not to those who are trying to make a dollar out of it.",
            "review_score": "1"
        },
        {
            "review_text": "I made a crazy man in paint and put him in as the superboss. He attacks with nukes and lasers from his cocaine eyes. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "  Do not let anyone tell you this software is unfit for game development.   That is simply not true.   Written in ruby, RPG Maker VX Ace is a very powerful tool, not just for RPG making either.   With a very active community and dedicated forums, you can get the advice and help needed to make your dream game come true?   Now will you make the next final fantasy 6 with this?   Well thats up to you!   With enough dedication and effort anything is possible in this engine,   Believe me on that one.",
            "review_score": "1"
        },
        {
            "review_text": "-Bought this while on sale -Had no programming knowledge whatsoever -Made my character move into a door -Door didn't open -Watched a couple of Youtube tutorials -Able to make my character go through a door -Made a treasure chest -Got potion inside  -Tested it -Treasure chest had unlimited potions inside -Watched tutorial about Switches and Variables -Wasn't able to comprehend it much -Stopped making games until I fully understand everything    Best Procrastination Simulator ever!!! 11/10 would procrastinate again!!!  ",
            "review_score": "1"
        },
        {
            "review_text": "RPG Maker VX Ace is a piece of software to make your own old school role-playing games along the likes of the Super Nintendo, GameBoy Advance, and original NES days. This is the 5th generation of the RPG Maker series and there is none better, nor will there ever be. In fact I'll tell you right now its worth the $70 and worth even $100. Now I'll tell you why.  You make your own game, your own actors, your own armors, weapons, classes, skills and so on, but with RPG Maker VX Ace there is a much better handle of things that makes it far less tedious than previous versions. There is even more customization without making your head explode or needing plug and play scripts made by the community. You can give your actors weapons skills. It gets detailed from there, because you can make skills need weapons. Give armors stats.  From there, create enemies, put them in groups and make them use skills based on turns. You craft the enemy intelligence to what you want it to be. Either random chance, specific needs like if an enemy has 50% of its health, then attack, use a skill or run away.  The real difference between RPG Maker VX Ace and previous versions is the depth without using scripts made by the community. There is also a graphics generator like a paper doll maker that lets you get some real diversity in each character's sprite and faces. Its all so easy now and I can't stress that enough.  RPG Maker Ace is so easy to use and quick to map with. Just like painting with titles. Battles and stats are easy to manage in fact the program has a pre-made maps, stats, enemies, weapons and everything you need to quickly make your own game.  You can pour hundreds if not thousands of hours into this and have fun doing it. I know people that have quit their job to make RPGs using this program and have been doing it successfully for years now.  The only big catch is the program comes with stock art, stock music and so on that is quite lacking compared to previous years, but really that's why you get someone to make it for you or you just import content into the game. Want to fight Zelda? Import her into the game.  With scripts the game can really be tailored to make it your own. If you don't want to make a Dragon Quest or Final Fantasy style of game... get a script to make a Zelda game. I've even seen people make space shooters with this game. The Ruby scripting language offers some good versatility.  Now that I've said the good, its time for the bad. The engine itself is starting to feel dated. Not only is RPG Maker VX Ace the sequel to RPG Maker VX, but the engine as a whole feels a decade old. The maximum resolution is around 640 x 480, even when you program it to be changed, the compiler won't allow it to be the size you want.  There needs to be a search feature. As an advanced user, I need this. My in game scripts, dialog and events become horrifyingly complex. There's an easy find feature for scripting, but not the events, which is everything on a map or in the game. Its been over 15 years and RPG Makers still don't have it. More complex things like lighting and even a lot of moving sprites at once become an issue and cause slow down when playing your games.  In all if you're a creative person, this is a great outlet for you. In fact you can have a lot of fun playing your own RPG and adding to it as you progress. I'm usually the person that says wait for a sale to buy things, but $70 - $100 is well worth it, but since this is Steam wait for a $35 sale :-)",
            "review_score": "1"
        },
        {
            "review_text": "this is an amazing piece of software. the developers are definitley right about the simplicity of RPG maker VX Ace. I love this software, and I am planning to put a game made with this software, on greenlight in 2015-2016.",
            "review_score": "1"
        },
        {
            "review_text": "Great software for making RPGs and it's easy to use for beginners!",
            "review_score": "1"
        },
        {
            "review_text": "RPG Maker VX ace an engine that is desigend for 9 year olds to create their fanfics.. and an engine that is designed for developers to create awesome RPGs in no time This Engine helps you to make awesome games withn hours without writing a single line of code and for you ruby programmers out there.. RPG Maker VX Ace is for you  ",
            "review_score": "1"
        },
        {
            "review_text": "After having used this software for over a hundred hours, the best piece of advice I can offer anyone is to scale your expectations back - and I mean way, WAY back. No words can describe how disappointed I am with RPG Maker after spending countless hours watching tutorials, reading guides, experimenting with concepts, editing with GIMP, all to create nothing useful or something just barely functional. I simply did not realize how limited the software was. Even after I discovered what it could do (or more accurately, could not do) I scaled back my expectations constantly only to hit a roadblock again and again. By far my biggest critique of the software is the bare-bones nature: you can make a Final Fantasy game with it, and by that I mean the FIRST Final Fantasy, aka the one that is probably older than you are. The mechanics are all at least 25 years old, resulting in:  -No in-house method of creating a game map (as in, a reference map you can press a button to show where you are in the world) -No in-house method of editing Sprites or Tiles (I had to use GIMP software for that) -a mystifyingly limited number of tiles you can use to build a map with (after using GIMP to put together a custom tile set, I exported it to the game only to discover i could only use a fraction of the tile set because Enterbrain imposes a limit on tile sheet sizes…when I discovered that, I swear a small part of me died.) -Needlessly complicated methods to get around the tile limit (like parallax mapping and some outside scripts) -No in-house clock -Way, way too heavy reliance on outside scripting to do even the most basic of things that RPG's have already been using for decades. -Arbitrarily small limits on things such as stats or item amounts (true, you may not use every slot to create items, but why take the chance to limit the developer? Go ahead and set the limits sky-high, it is not that hard)  Think of an RPG, any RPG: what mechanics did you like about it? chances are, RPG Maker cannot do that. Did you like the Psynergy or Djinni system of Golden Sun? Too Bad. Did you want to make a game with multiple skills in it to level up without the use of scripts, as per Runescape or the Elder Scrolls? Nope. Did you hope to implement a monster capture system like Pokemon? Not Happening. Did you like the flashy Summons from the early Final Fantasy games this software is failing to live up to? Not a chance. Do you like to actually watch your characters on the battle screen fighting the enemy like in…almost every RPG ever made? Without scripts, you will be stuck in a soulless first person mode and will never see your characters sprites in battle. Are you awed when your enemies use your own nuclear attacks against you, or unleash their own unique abilities to show you that you are not the only person with show-stopping special effects? Enemy sprites are static and use utterly no animation when they attack. Want to change the default walking or running speed?... Actually, I still have not found a script that could let me do that.   This software may be useful for veteran programmers, but for those new to the field, stay far, far away. Now, admittedly the community has made incredible scripts that dramatically improve the experience, but fans had to do that, not the developer. I might even go so far as to say that I think some of the fans put more effort into improving RPG Maker than Enterbrain itself did actually making it. Ultimately, I cannot recommend RPG Maker VX Ace to anyone.  TL;DR  Do not buy (or at least wait for a sale), you will be disappointed.  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Used multiple trial versions of this program and loved every second of it. The simplicity of the program is by far superior to other programs I\\'ve tried for creating RPG games. I used to use Stencyl, but now I\\'m RPGM-VXA all the way!",
            "review_score": "1"
        },
        {
            "review_text": "This software is amazing!Let me start by telling you that i am 15 years old and i am making a game using this software!This is very easy softwer,of course you will have to watch few tutorials how to use it and use it,but once you do that you will be good with it.You don't have to know anything about scripting!Your games will work fine with just basic scripts that are already there when you create a new project,of course you can download few scripts from internet which i would highly reccomend doing.Master it and make a game,good luck! :D :)",
            "review_score": "1"
        },
        {
            "review_text": "I have a hard time recommending this product. That's why I'm going to select 'Not Recommend' as an option. I wish Steam had a 'Maybe' option. The biggest problem I actually have is with the resolution this engine is locked at. It is locked at 800x600 I believe. I also believe the assets are locked at 32x32. It's a good introduction engine for those looking to get into game development, and it's a cool tool to mess around with if your bored and just want to make some place neat that you can just screw around in. I don't know what you like to do in your free time, man. I don't judge. Now, I have to say, if you're a seasoned game developer and using this software, you need to step up your game. If you plan on using this engine, and exclusively this engine, to develop games, I can't say that's the best decision. Often in the gaming community, people see an RPG Maker title and assume it's just another throw-away, mediocre RPG with a sub-par story and premade assets. Sometimes, they aren't wrong, but there are some good, and somewhat successful, games for this engine. Take 'To the Moon' for example. The engine is certainly flexable, but you can really only flex so far with the assets that you are given to work with. Sure you can install plugins, and make your own things (which I recommend you do), but this engine can really only go so far. It really does have limits, and very significant ones. Sure this engine is flexible and it gets the job done for an amatuer developer, but you need to ask yourself 'How professional can I look while using this engine?' In all honesty, if you're planning to sell games from this engine, you, most likely, won't make your money back. So if the money doesn't matter, and you make games on this engine because you enjoy it, good for you. Don't worry about the money. The engine is definitely fun to use, and it's reasonably simple. I'll give it that. Honestly, if you ever want to be taken seriously as a developer, step up your game. If you are looking for an alternative, go to Unreal Engine or Source Engine. Those are both reliable and solid engines. I'd easily recommend those two over this one any day. Buy this with caution.",
            "review_score": "-1"
        },
        {
            "review_text": "Have you guys ever played Sims? Minecraft? Any game where you can test your imagination by building?  This one's for you. I'm hesitant at first to buy it, well I had plans. But with the 90% sale, man that's no question, it's freaking worth it.   I've been playing this game since yesterday and I'm already hooked.   If you're a programmer you'll even be more hooked. You can play this sh*t while studying at school. Lol   11/10 would invite my own Programming teacher to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great tool for making an RPG! Easy to learn and use.",
            "review_score": "1"
        },
        {
            "review_text": "Kind of hard to get used to at first but once you read some manuals and take a look at some examples that are freely available online at Youtube and other sources you can pick this one up pretty easy. It's not for everyone though. It does do a good job however replicating that SNES 16 Bit experience. You can't create masterpieces like Chrono Trigger or Final Fantasy but you can come close to it. This one is more for a rainy day or a day where you have lots of free time on your hands because your going to need it.",
            "review_score": "1"
        },
        {
            "review_text": "thanks for letting me create the greatest of adventures",
            "review_score": "1"
        },
        {
            "review_text": "Easy to use. Fairly easy to understand. Plenty of tutorials available.  If you're a complete beginner at making games, this is a great place to start.",
            "review_score": "1"
        },
        {
            "review_text": "Tired of getting in a game and thinking that some stories would be better off with this and that in it? Told this and that way?  Whatever the setting, if you like to share or trow it down somewhere else than table top RPG ruleset when no one have time to sit around a table in a determined time thoses days. RPG maker's versatility is the right tool for you. Sure it won't help you with your originality and story-telling... Just remove you the hassle to learn complex game mechanics, graphics and programmation for a bit whenever you have a good story to tell or make playing.  It is plain and simple old school, but at least it is a start and it also has a GREAT supporting community. And as you are helped with game mechanics along the way you might learn up a thing or two like importing/exporting your very own music and graphics along (if/when what RPGM provides is not enough personalized for you anymore).  I yet have to know how to get video sequences in it and I would be all done! (But hey, to that point this is minor when we see all the rest of what we can do with it.)",
            "review_score": "1"
        },
        {
            "review_text": "Potentially Great Games will be made by imaginative people who hold a powerful engine to create...   ah who am I kidding. This is for weebs who want their own Final Fantasy creator to create the Mary Sue self-insert game they ever wanted and easily make themselves an overpowered god character.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the easiest things i've used to make games, so great to easily make a game, working on my own that will be released in a few months thats a whole story i'm still working on.",
            "review_score": "1"
        },
        {
            "review_text": "A great learning tool or a fun platform for making rpgs. The UI can be a bit overwhelming at first but once you learn to poke around you'll find plenty of neat tools inside.  And for those who have a bit of coding experience under their belt, there's still plenty underneath that allows you to tinker with the fine details. It's kinda funny really how RPG Maker turns coding into a game of itself: easy to learn, tricky to master.",
            "review_score": "1"
        },
        {
            "review_text": "only good for making chris chan rpg, kanye quest, or anything similar.",
            "review_score": "1"
        },
        {
            "review_text": "RPG Maker VX Ace is my go-to tool for creating games. Easy to use, novice friendly, and there's always more stuff to add.",
            "review_score": "1"
        },
        {
            "review_text": "Nice, simple engine for creating 2D JRPG's, too bad the max resolution the engine allows is 640x480 which isn't very acceptable if you're planning on releasing a game commercially. Games can only be exported to a portable exe file that can be run on any windows system, so you won't be able to create a browser based JRPG or export your RPG for mobile devices.  I still recommend RPGmaker VX Ace though, you can create a great JRPG without having to script, although if you want to make your game really unique you'll have to spend some time to learn Ruby. The RPGmaker assets are fine to start out with and theres a large community that provide free tilesets, sprites, animations, anything really for you to work with.",
            "review_score": "1"
        },
        {
            "review_text": "A team and I are making a parody RPG called Sixth Empire with this software, and I gotta say I am extremely happy with it. Does not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing tool I use everyday! Perfect for any adventuruer wishing to share the scenarios that run through their mind with the rest of the world!",
            "review_score": "1"
        },
        {
            "review_text": "Make your own games with whatever you want Many kinds of game you can make by this Cool system, easy to use, big library of resources  11/1  Cheap tho, bought it for 1 dollar on humblebundle",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic program and very easy to get to grips with. Would highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "I'm an idea guy for video games and my RPG will be better than the trite you see on steam! It will have good writing and interesting characters and a plot involving time travel and alternate universes - rather than a good foundation of actual gameplay. It will also feature a socially progressive message and will be more about pushing an agenda rather than being a labour of love and the language of video games.",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE IT! &lt;3 Simple and fun to use. Being new to the software I do find myself sitting and thinking about if i have things in the right order for a planned event to play out like i want but once it does work you have a great feeling of accomplishment! There are some great tutorials and guides around to help get you going. Planning on making a game based on mine and my fiance's text based RP's we have done over the years, so excited to get stared! There are 100's of tiles to start with and there is literally everything you need! I bought a couple of the extra sets at the same time I bought this and couldn't be happier! As well as tile sets there are all the sounds too. I can't recommend this enough to people who wanna give game creation a try!",
            "review_score": "1"
        },
        {
            "review_text": "I love this software it is so much fun and it's easy I love it!",
            "review_score": "1"
        },
        {
            "review_text": "I really love this.... I have some problems as for when it goes to the fight like the background gets all twisted like a tornado seen from above. But I love this program, I have so much freedom to do what I like.  If you gonna buy this, have in mind that if you want to make the game JUST the way you want, like ALL the details, you need to know how to script. By the way I don't know how to script, but im learning bit by bit.",
            "review_score": "1"
        },
        {
            "review_text": "Great tool for everyone, even if you have no experience in RPG/Game making. After a few basic tutorials it's easy to start playing around and teaching yourself more. Enough tutorials out there to learn you everything, but playing around and finding out stuff yourself is great too.",
            "review_score": "1"
        },
        {
            "review_text": "I have lots of fun in this game and realy like it. I think 'you' should try it! Here is what events do: they start or stop certain things you tell them to do. Create game and if you like, post it when complete on workshop so others can try it! I'm currently working on something witch I don't know what to name, and it will be in the workshop! Fun rate: EXTREME",
            "review_score": "1"
        },
        {
            "review_text": "A good engine to start off with, but it does not do very much. I would reccomend only buying it when it is under $20 on sale. With scripts by people such as Yanfly, the mechanics get much deeper. But at face value there are little to no options in your gameplay, and you are very limited without knowledge of coding. However, it is a great program for beginners to game design, specifically RPG's, and then you can move on to things like Unreal 4 (as its now free)",
            "review_score": "1"
        },
        {
            "review_text": "Overall it is very good! you can make your own maps import your own content and theres very good dlc! i like the database theres alota stuff to mess around with.  whats good about this game:  1) the massive selection of the dtabase 2)good events and scripting  whats bad about this game is you cant get any other formats but the 1st person styled  but overall recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Saw RPG Maker VX Ace 'bout a year ago. Cool, eh $70 is too much though.  Saw that it was $15.  Got it.  Played it for four hours straight.  I cannot stop playing on this.  Seriously.  I'm addicted.  Please, call someone.  I seriously need help.  Here, I'll give you my address-  HAVE TO PLAY MORE RPG MAKER!!!!!  No, but seriously this is a great software. It's so easy to use! It's not like those other game makers you see that say 'No programming required' but get in and you're staring at the screen wondering what to do. In this, you get in and see stuff that you can actually do. Then you get confused. You look it up. Can't find a solution. You ask for help on the forums. Then you find out your solution on the internet. Then you delete your discussion with a facepalm.  GOOD GAME M8",
            "review_score": "1"
        },
        {
            "review_text": "This is literally my life. Rpg maker vx ace provides everything a rpg developer needs. It's easy, it's powerful, it's fun, and my project folder is so messy because I start working on like 2 games everyday. I would have written a long review, but there isn't much to say about vx ace without just saying how awesome it is.",
            "review_score": "1"
        },
        {
            "review_text": "is a game maker - If you wanna make RPG games, get this software  Otherwise, don't.  Am I done here?",
            "review_score": "1"
        },
        {
            "review_text": "One of the best and easiest programs I have ever used. Anyone that wants to make a game I recommend using this program.",
            "review_score": "1"
        },
        {
            "review_text": "Awsome gamemaker. It's simple but powerful.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to use, and becoming increasingly popular- don't buy it at full price, though. I suppose, however, that if you had excessive money, this'd be worth it, considering it's capabilities",
            "review_score": "1"
        },
        {
            "review_text": "Excellent for RPG games! Love it. A whole bag of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome and easy to use!!! Anyone can make a game with this! go try it!",
            "review_score": "1"
        },
        {
            "review_text": "If you have an idea and you want to make it into a game, then buy this RPG maker. But, I recommend you get this with the game's start, and end in mind. Without these 2 facts, your game will go nowhere. I started mine with just the end in mind, make it a pot twist to maybe make another game (of course this is just the summary of it, for the sake of my recommendation), and with that and some help from some guide, I was able to make my game. I am half way through it, with about 45 minutes of gameplay. I went into this with no knowledge of how to make a game, even code. With time, testing, and some guides, you can learn how to make your game, your way, with your twists, with your characters, and with your kind of ending or plot twists. Thanks for reading.",
            "review_score": "1"
        },
        {
            "review_text": "A great little tool to make old school JRPGS. I got the Humble Bundle version which only cost $12.01 and I am having a lot of fun so far in making a little game. Simple and effective to use. The only down side is that there is a bit of a steep learning curve and there is a lack of any useful tutorials. Saying that however, it is pretty easy to pick up and you will learn a lot through trial and error. Highly recommended for anyone wanting to try and make a game. Also get it on the humble bundloe sale while you can. The price is so insanley low and it comes with a an unbelieveable amount of DLC as well",
            "review_score": "1"
        },
        {
            "review_text": "First off, I want to say that RPG Maker Vx Ace is a great software that has already gained plenty of attention and has a great community. I only have about 8 hours put into it now, and I can honestly say that around half of that has been troubleshooting. I've had two major problems (With background music and cutscenes), each of which has taken me around two hours of googling and messing around to fix.  Pros: - Easy to use with next to no knowledge of programming and minimal knowledge of how games work - Great community and, with the attention it has, there are tons of user-made tutorials - Plenty of tile sets, character models, and music, with the ability to import more - A built in character generator -An easily accessible help sections with search function -Comes with contract for releasing games for public use (Not sure about tiny details, though) - tons of free user-made content (Graphics, music, etc.) online and in steam workshop. Cons: - Not easy to learn at first, with some confusing terms - Pricey  Overall, this is a great software for anyone interested in making a game, whether for personal or commercial use. If you are planning on purchasing it, however, I would wait for it to be on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Love it. It's a great and fun program, and it is very easy to learn. It's perfect for all ages who want to make a simple RPG game. I highly do recommend using this software. There are tons of content to choose from, or simply make your own from other programs and import on here. Only downside I don't like about it so far are the DLC's, but other then that, it's a good software for new beginners.",
            "review_score": "1"
        },
        {
            "review_text": "As a long time RPGMaker fan (since the day it was on Playstation) I have used every single tool set Enterbrain put out. I was super excited when they stated they would be putting out a mobile exporter for Android and iOS that would work with VX Ace.  My SO bought me the VX Ace pack (valued at over $100) which I didn't actually want, but when I learned of the intention to release the mobile exporters (via official press release from the publisher/developer) I was understandably intrigued.  Fast forward to a year later and there's a new RPGMaker again!? Unless I'm mistaken, there's an RPG Maker VX and a VX Ace and now there's an MV, and what's this? MV has an exporter for Android and iOS but every other RPG Maker owner gets the shaft.  Would I recommend this software? I dunno. I'm saying no for this review because I have to pick one or the other, but the truth is that MV being the latest edtion, has cool features I want and am ♥♥♥♥♥♥ about not receiving even though the company made press releases that I would. So in short, get it on a Steam sale.",
            "review_score": "-1"
        },
        {
            "review_text": "This is pretty good! And if you put your mind to it you can make some pretty amazing stuff! Sure most of the DLC costs money but there is a whole lot of people that have content for free on various websites and even on Tumblr pages.And you can easily experiment with the pre installed content. The only con however is it may take a while to get the hang of. But otherwise-    Buy It",
            "review_score": "1"
        },
        {
            "review_text": "This program is great :) I'm loving every bit of it.",
            "review_score": "1"
        },
        {
            "review_text": "Make's it pretty easy to create little games and whatnot but honestly this is from one of the worst scripters ever. Aka me.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to use, fun, and with help of all the tutorials on the internet you will be up in no time!  Note : but you better wait for discounts if you are going to buy all those DLCs... seriously. 489$",
            "review_score": "1"
        },
        {
            "review_text": "This software is quite amazing. It makes creating an RPG very easy and allows for a lot of customization. There are also dozens of add-ons to get that can help broaden your games and set them apart from others. There is a slight learning curve but a little reading and/or experimentation will help you get through.  Be aware that the battle style is similar to the Dragon Quest/Warrior series as opposed to Final Fantasy, and that the volume seems to be set quite high by default. Otherwise, this software is an excellent piece of work and I would highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "HELL YES I RECOMMEND THIS SOFTWHERE.  Guys. I know next to NOTHING about scripting, so I shouldn't be able to make ANY kind of game, but THIS program. THIS program is the greatest thing since... That last great thing... Yeah... With this, even people like ME can create awesome video games! Within the RPG genre of course. xD; Which I really can't complain because I LOVE RPGs. Now I can make my own!   Granted the character generator could do with some MAJOR upgrades, but generally it's great for making unique characters that'll play in your story. Not to mention all the premade characters (I use them for simple things like shops and inns. :'D).   The wide variety of BGMs, BGSs, MEs, and SEs are fun to play around with.   Not to mention, EVERYTHING is custumizable, and that is fully AWESOME!  If you're going to buy this program, NOW IS THE TIME. Get it while it's still 75% off because you won't get any better deals. For what is usually a $70 program... I'd say it's well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Great tool for making games only downside being all the DLC... I am a bit biased since i got it on sale but I would say this program is totally worth it! I never had experience with game making and now I would say i'm pretty decent now thanks to this xD Anyways if your planning to make classic styled games then give this a try. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on sale at the very beginning of this year, when I wanted to experiment with making games and thought it would be a good idea, however, the base software comes with the most minimalistic assets and MAKES you pay for everything else. I would definately not recommend purchasing any of the RPG Makers if you don't have a great interest in RPGs or want to become a profressional RPG developer, and especially don't buy these pieces of software at full price, it's not at all worth it. I wouldn't even recommend buying it on sale either, unless you are what I mentioned above, not unless you have over one thousand dollars to pay for every single asset. I realized my calling was not to make RPGs until it was too late, so please, really consider this purchase, if you are not a fan of RPGs or making games in general, DO NOT buy this software or any other software in the lineup and really don't buy any of the expansions. These softwares are for people who have at least some experience in how programming works, because if you don't understand how games work internally then you are going to have a massively large time being confused or looking at tutorials. I am going to school to learn how to program and trust me, it is very a long, complicated and precise process. The tagline of there being no programming required may be true to an extent, but there are still many instances you'll be confused because your game isn't working right. Games take time to make, and I learned that the hard way. So please, really think about what you want to do with your time in game creation and with your money.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun software. If you are interested in creating JRPGs from the 90s era then this is the program for you. ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, power yet simple engine. Gets you really involved in the creation process.",
            "review_score": "1"
        },
        {
            "review_text": "with this software...you can make it over 9000! or you can turn it into a bunny instead.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to use, an improvement compared to earlier versions, and overall fun. If you like creating things and have enough time to make them, I would get this. It has a great community that submits everthing you would need to create what you want, and also the purchaseable DLC is worth their price tag. Music DLC is amazing and top-notch, while art for characters and designs are superb. The preinstalled music and art shuold be mostly all that's needed for small-time projects as they are quite diverse in what you can use.",
            "review_score": "1"
        },
        {
            "review_text": "(NOTE) [If you dislike rpgs in general. Don't bother with this then.]  If you like to create storys and have no limitations except your imagination(and scripting skills) then this is a good sfotware for you. I havn't used it much but it does seem very fun. It was hard at first to figure out some things but thanks to the community(videos) I was able to figure things out. If you want to create rpgs then I recomond this. If your unsure though. there is a demo and if you enjoy the demo, get the full version then.   I can't recomond it at full price since I got it on sale but it was worth the 18$. I can just let my imagination go wild here.  Also it will take time to create a good rpg but thanks to this, you can probably do it without knowing how to code, you just need to be able to write a good story since the combat wont be a good selling point and yes, buying this software gives you the right to keep the money you earned from your creation if it sells.   ... Why still reading this? Try the demo out and see if you like it, type in search bar. RPG Maker VX Ace Lite and download demo. Hurry before sale ends.",
            "review_score": "1"
        },
        {
            "review_text": "I got some ideas for some FF2 style game and story, this takes all the UI coding out of the effort and I just have to do custom quests, stories, and some special unique graphics I want. It works very well.",
            "review_score": "1"
        },
        {
            "review_text": "I got it for free 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the best thing since computers in the first place! It's easy and fun, and learning how to use it is really exciting and makes you feel very intelligent! :) I love it! I give it 10 out of 5 stars! :)",
            "review_score": "1"
        },
        {
            "review_text": "Ace is a great way to dip your toes into game development without the complex instructions or coding like in the other game dev programs like Unity or Unreal. If you want to see some of the great examples that use this engine I suggest trying out LISA, Amber Throne and Machina of the Planet Tree.",
            "review_score": "1"
        },
        {
            "review_text": "It's easy to use Buy it when it's on sale  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Really help me !! THANKS",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game creator. It is a bit difficult starting out, but once you figure out how to change tilesets and open scripts (witch isnt that hard, I'm just a bonehead and didnt want to experiment for risk of screwing up), its quite easy. The stats may be a bit hard to figure out at first due to the creator having its own set style of a battle engine, but in the end if you can, it is completely worth it. If you're having trouble, theres a few tutorials on youtube that can help you out. My only real problem with the game, is how difficult it is to find tilesets people have uploaded so you can download. I feel that is the reason this needs its own Steam Workshop page. Other then that, thats the end of my complaints. Now to the good parts. The character creator is quite good, it gives you a decent variety of custom hairstyles, skin tones, eyes, noses, mouths, clothes, and other things to use. The script editor is easy to figure out once you start using it, the tilesets you start out with are decent, and if you dont like what it supplies you with, you can create your own and import them. There are also several enemies it supplies you with, most of them already coming with a custom stat set in case you dont want to design your own enemies. There are also default playable characters you can use. One of my favorite things about this game, is that unlike most other RPG creators, the scripting isnt to limited to make something great easily. The price is a bit high, but in the end, if you're a huge RPG fan and always wanted to make your own game, it's completely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "The RPG-Maker series as always Great software!!!  Did you ever played a RPG game in the past on (example)the Super Nintendo like secrets of mana And thought to yourself i wane make a game like this?. Well with RPG-Maker VX Ace this is possible.    Potential buyer: But Janos I’m not some kind of wonder kid.  Janos: No problem at all with this software you can easily make a game yourself, without any special education in game development.  All you need is imagination and a little bit of knowledge you can easily learn on the internet by watching like 10 min of video tutorial footage.   Potential buyer: Are you sure janos? Seems a bit over reacting to me.  Janos: Well I’m dead serious my friend!!! The interface of RPG-Maker VX Ace is really user friendly And very clear.  Also if you not sure what the function does you can keep your mouse point on it and it will shows an explanation about the function, data, events, etc.  Potential buyer: Ok, but I don’t like the assets they give me, also don’t like the battle system.  Janos: Well You can make a complete RPG game with the assets they give you.  But if you don’t like them you can also make them yourself and import them easy without problems. not feeling like making your chipsets, face sets , etc. Yourself.  No problem you can find them on the internet and import new data easy.  Potential buyer: Ok but what about the battle system then?.  Janos: Well you can go full geek mode a type yourself a complete new script or change some things in the original script. But you can also search on the internet for the things you need for in your game  Some examples  1. Day and night cycle script  2. Equipment requirements script 3. Action battle System script (Zelda /secrets of mana battle style)  Potential buyer: Thanks for the information Janos I’m going to think about it now.  Janos: My pleasure   ",
            "review_score": "1"
        },
        {
            "review_text": "It's okay, but don't expect to make stellar games without putting in /effort/",
            "review_score": "1"
        },
        {
            "review_text": "It's okay, but don't expect to make stellar games without putting in /effort/",
            "review_score": "1"
        },
        {
            "review_text": "- Be me - be making game during college school year - make a decent game that was almost in beta stage -end of school year comes - update the cloud on RPG - hand in school laptops to be completely wiped cause thats what they make us do - go home - boot up home PC -ready to start designing game in complete ZEN - cloud had error updating when at college. - game completely gone.  10/10 would lose game files due to bad college wifi/connection again.",
            "review_score": "1"
        },
        {
            "review_text": "First off, i'd like to point out a major issue you need to know before buying this game.  RPG Maker VX Ace runs in an extremely small 640x480 window that's hard to see on most large computer screens. There is a hidden fullscreen option but it stretches everything to fit your screen, has an awful framerate, and just overall looks bad. While that may not seem like such a bad thing, once you buy the game and are stuck leaning towards your screen just to see your character sprite, i'm sure you will change your mind.  This is just the beginning of the problems with RPG Maker: VX Ace.  Another large problem with this game in my opinion is the lack of in-game custom tilesets and sprites. Don't get me wrong; you can create your own characters and tilesets, but hence the word 'in-game'. If you were expecting RPG Maker VX Ace to be that easy, then you are wrong. There isn't an in-game tile creator so in order to import custom tiles and sprites you have to make them inside of a photo editing software, which not everyone has. Even then, RPG Maker requires sprite sheets and tilesets so you can't make individual graphics; They have to all be an exact size in an exact order. This makes downloading a template almost required for every graphic in your game; and it gets pretty annoying.  The level designer is not bad. You have some tiles that you can click to select and place on a square grid and it feels alright. The action mode is surprisingly fun and easy to use that adults and children of all ages should be able to easily understand.  RPG Maker VX Ace is both efficient and inefficient. Most of the program is easy as it looks, but some of the most vital parts in creating a great RPG game does not follow that same efficiency. If you don't mind having to squint to see your finished game, and are willing to download a few templates and plugins for photoshop, maybe this game will be good for you. But what I know is for sure, is that it came close to being a fantastic RPG creating experience. It just didn't quite make the cut for me.",
            "review_score": "-1"
        },
        {
            "review_text": "This Program is not bad I love it :)",
            "review_score": "1"
        },
        {
            "review_text": "If you ever want to screw around with a programming software that actually teaches you stuff, this is the one to do it in.",
            "review_score": "1"
        },
        {
            "review_text": "A Great Program for creating your own game, after you finish create an exe file to share created Games with your Friends",
            "review_score": "1"
        },
        {
            "review_text": "This software is really, really good. However, the limited amount of resources and its learning curve sort of drags it down. Proceed with caution",
            "review_score": "-1"
        },
        {
            "review_text": "VX ACE was the front runner for RPG making the last 5 years or so, there's a lot of games that came out made by it! :D",
            "review_score": "1"
        },
        {
            "review_text": "Updated version of RPG 2003, etc. Sadly to say (even though it has many more entities), it's just not as   good   as it's predecessors. That is, unless you take the time to re-skin EVERYTHING to look like the cool old RPG maker. These sprites are wide and have horrible looking designs. That's a   lot   of stuff to re-skin. I don't truly recommend it, reason being the high price. Get it when it's on sale, at least that's semi-worth it. My Rating: 7/10",
            "review_score": "-1"
        },
        {
            "review_text": "Options One and Two: One - Look up a few youtube tutorials on how to use this. Two - Learn C++ and get a team of visual and story designers.  Perks of both?  They both work for this, and they both yield great results. Many people have bought this, and many people use it. This engine allows unbelievabley easy and simple construction, to down-right in-depth coding and visual design with any level of complexity you would like it to have. RPG Maker VX Ace is an incredibly powerful engine that will accomodate from noobs to experts in many fields, and the ingenuity of the creators deserves a high credit of respect. Used it for nearly 2 actual days. It's just fun to work with.",
            "review_score": "1"
        },
        {
            "review_text": "It's time consuming!",
            "review_score": "1"
        },
        {
            "review_text": "its a good program",
            "review_score": "1"
        },
        {
            "review_text": "This is great good software for game making has started to be avalible I like this one and one other this is a fantastic tool.",
            "review_score": "1"
        },
        {
            "review_text": "RPG Maker is a very fun and useful utility. While I do recommend it to anyone who's interested in making a short, casual game, be warned - even with a utility like this, you're going to have to spend alot of time on it.",
            "review_score": "1"
        },
        {
            "review_text": "If you are considering to buy this, consider the following (+ and -):  + a great allround package for any type of RPG game and (with scripts) even more + customizability with scripts is almost limitless + commercial games can be created without additional royalty payments + tons of high quality art and music included  - resolution max is 640x480 (can get higher by rescaling with scripts) - map event trigger feature is there but broken (you can script around that though) - at least 100 times slower flow than it should be with modern PCs (but still ok) - when closing it often crashes so you need to force close steam before using again (created games are stable)  Anyway, even though it has its obvious issues, this is a brilliant package for game making. The community is huge, the available DLCs are beautiful, the scripts you can get for it (I advise you google 'yanfly') can customize anything and the absolute best: I managed to learn to do just about everything in a matter of a week. Yes, seriously. If you really spend time with scripts and tutorials and try stuff out, you can master this piece of software in no time.  Unless you are now so pumped that you just HAVE to get it, you might want to buy it when it's 75% off though (since that happens often). Have fun!",
            "review_score": "1"
        },
        {
            "review_text": "I can't emphasize how useful this is! If you have ever wanted to make your own RPG you need to buy this.",
            "review_score": "1"
        },
        {
            "review_text": "This is the first software i've ever used, which means that I really have no experience in making games.....or using any type of software for anything. I may not be the best person for this, but i have been using this software for a while now. There is a manual for how to do things, but to be honest i didn't use it, not because i'm impatient or dumb, but because i wanted to leard through experience. It's very easy to learn and grasp the concept, plus they give you a bunch of average RPG elements to show you the basics (Characters, skills, weapons, etc.). The only thing i had trouble figuring out was because of my own fault. This is a very good engine, escpecially if you're just starting to make games. If you're interested, buy it. It's not bad at all.",
            "review_score": "1"
        },
        {
            "review_text": "Its probably the best software i can find. you can code but i never have to for my games, havent submitted a game though, (because its 100$) i made a game that took me only 30 or more minutes, im not going to tell you what its about, i dont want anyone stealing it. but then im so happy i made my first game! untilli i relized its 100$ for greenlight. but if you have 100 USD you can submit your game to greenlight. but i do really like Rpg Maker VX Ace.",
            "review_score": "1"
        },
        {
            "review_text": "CANCER",
            "review_score": "1"
        },
        {
            "review_text": "*BEFORE YOU CONTINUE* I've been in Games Dev for a while now, so everything in this review comes from an industry-grade perspective. I'll try to be as objective as I can, so you can decide for yourself whether or not it's worth it.  If a classic top-down RPG is your goal, by all means, get this. It has all you need to get started - the default build even comes with a main AND pause menu!  So, let's play pros and cons: Pros: - Simple to navigate UI - A LOT of pre made stuff to make prototyping quickly - Documentation for the programmers - Reasonable price (when I bought it) - People make stuff for this game in Workshop - Some cool stuff in the workshop Cons: - It's easy to tell when someone has made a game with this program - Most of the community made graphics conform to the grid of RPG Maker - making most of the stuff look 'generic' - Want to make a turn-based strategy? Best you find something else. - learnerFirendly = preMadeCode ? No : Yes (programmers will understand this);  - Documentation isn't as in-depth as some of the meatier engines out there - People make stuff for this game in Workshop - Pre-made events make it easier, but what if you wanted to make a game in a different engine?  TL;DR Good for top-down RPGs, not so much for other games - but not impossible",
            "review_score": "1"
        },
        {
            "review_text": "This Is Awesome to make you own rpg games but 70$ not worth it i got it when it was 14$ so buy it when its on sale!",
            "review_score": "1"
        },
        {
            "review_text": "Really hard to work with at times, takes a TON of time and patience. if you don't have that, its kinda useless. in the end though, good things can come out of it. well put together, fully customizable made a few characters, coding is just not my thing 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice. Would like to have few more options but still nice.",
            "review_score": "1"
        },
        {
            "review_text": "easy to use",
            "review_score": "1"
        },
        {
            "review_text": "simple, easy for using.",
            "review_score": "1"
        },
        {
            "review_text": "I dont even make games but you know what i do, do? Thats right farm for trading cardsd while sipping on some purp",
            "review_score": "1"
        },
        {
            "review_text": "Verdict: Buy it if it's on sale.    Review: RPG Maker is simple to get started and to use, however it is at times a bit too simplistic. While you can easily create an Final Fantasy clone it's much harder to create the game accordance to your own imagination. It's very much like Bethesda's approach towards their games, let the modding community flesh out the irks and qirks that nags them. In this case it's extending RPG Maker, so while you may have seen titles such as Lisa and think you could easily re-create it, it won't happen unless you heavily extend it with libraries/your own coded scripts.  For example it treats everything as an event, as such you have extensive freedom in deciding what npcs, objects and effects are suppose to do, but it makes debugging and backtracking a nightmare, especially when dealing with non-native language games.  It's script editor and event editor is very clunky and outdated. The script editor does not parse the code to check for errors, instead you have to run the game for the Ruby intepreter to print it out, thus coupled with the fact that you can not make the textbox (i.e. where you write the script) bigger, can't search for keyword cross files makes it very time consuming when debugging.  The event editor has a very Scratch like feeling to it, in that you put chunk of programming logic to create game logic, however as said before the editor suffers from poor design choices such as:      The amount of lines can indent past the 'event textbox', making you guessing if you want to edit the correct line.     If you double click it simply assume you want to add more logic, even if you intent to edit the current line.     You can't edit an condition statement via either double clicking or right clicking the correct statement you have to backtrack to where the condition began.     If you want to do create certain events, it has to be done in a certain way unless you get around it via scripting, such as animations.     The event editor is also very, very limited, it can do what it was designed to do, create simple events with the possibility to be extended via scripts.   You are limited by about 5-6 tile set per map, where all the A sub tiles has to be of a certain type: A1 -&gt; Terrain A2 -&gt; Roof A3 -&gt; Walls ... ...  Also the lack of debugging and game testing mode, while yes it does exist, it is very, very, very basic. The only thing you can change via debugging is the switches and variables but there is no way to spawn certain enemies, no teleportation, god mode without scripts or even to test the current map, instead you have to see it load the game, start the game as normal (again you can't skip the intro or do anything different than from a normal playthrough without scripts) play through the game as normal to get to the location you want to test and then you have to make sure you save it there to make sure you don't have to do it all over again.   In the end I do not know what to give it, it's annoying when it doesn't work as intended but rewarding when you start to understand game design and game logic.",
            "review_score": "1"
        },
        {
            "review_text": "Because you should!",
            "review_score": "1"
        },
        {
            "review_text": "great tool for creating. currently working on a project!",
            "review_score": "1"
        },
        {
            "review_text": "Way overpriced to little content really only should be about £2-£3 even if it comes down in price when its on sale its still overpriced,   Pros -quick loading/testing because of it being 2D graphics -easy to add own artwork and grapics with a simple importing system -mapping can be simple when using there premade maps -experienced ruby editors users can make biggest additions to a game -share thru steam workshop both with content and releases -familar pokemon/ff battle system -simple system to expand the database and add charaters , classes , skills , enemys , events and items  Cons -not much to work with unless you buy the dlcs! -hardcoded max level of 99 cant really customize this! -if you think that you bought a tool that makes it easier to make rpg you are wrong! -you have edit the core scripts or add extra scripts to make simple changes i.e adding enemy health bars or having more than 4 party members! its should exist as a yes/no or global setup option. -no built in tutorial and the online official tutorial is not easy to follow! -sort of rigerous click an select event creations too little game impact and really longwinded -no real rpg elements to switch out forced to use there builtin battle and level systems -no local/networked mutliplayer  -finally the dlcs which are out now probably make up the actual intial product which means this puts the cost up to £516.60 that includes rpg maker plus all dlcs some of which are way so over priced you might as well buy game maker!  2/10 for being just too overpriced with little content plus having too many limits.",
            "review_score": "-1"
        },
        {
            "review_text": "At least it has high quality MIDI files to use for other game engines... Oh wait (&gt;_&lt;)",
            "review_score": "-1"
        },
        {
            "review_text": "i dont reccomend because i got it and now i cant use it",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like this tool, but the system was far too complicated, in contrast to what it claimbed to be.",
            "review_score": "-1"
        },
        {
            "review_text": "well imagine pkemon graphic meets your imagination let riot",
            "review_score": "1"
        },
        {
            "review_text": "complete garbage. tried it out for a good hour or so. never touching it again.",
            "review_score": "-1"
        },
        {
            "review_text": "As intricate or simple as you want it to be. Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Where do I start with this... 'thing'. The best you get is the screenshots, anything beyond that and you are plunged into downloading stuff off websites, this engine lacks so much to make an RPG that you will need to get its sequel, RPG MAKER MV, to be able to do the basics such as side on battles, which have been in existence since Final Fantasy I and yet they hadn't got their head around it until more than ten years later.  Lets move onto scripting, thats a pain in the ♥♥♥ because it uses 'RGSS3', don't know what that means? Ruby Game Scripting 3', The language that is awfully powerless, slow and unknown, its sequel uses Javascript, so you at least have a chance of knowing how to code in it.  The better alternatives to this poor engine? Theres nothing that simplifys the process as much, but you are better off learning LoVE 2D or PyGame instead, an RPG is not even that hard to make from the ground up, it will only take a couple of weeks to get the basic set up then you can do what you want from there.  But yes, I will still be using this because I don't want to waste 15 bucks that I spent on it, and thats the most its worth, Don't even dare click the purchase button when not on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "D-  Produces programs that run in a tiny window and crash in fullscreen. ",
            "review_score": "-1"
        },
        {
            "review_text": "IT'S NOT GOOD AT ALL!!! FIRST, YOU DON'T EVEN CODE CRAP!!! NEXT, IT SETS OUT A OUTLINE THAT'S GENERIC!!! Nobody wants to launch a game that looks the exact same as fifty million other games used by that same app! It takes the joy out of making video games... it takes out the fun of coding in, making and designing your own charaters. The app itself has 'meh' graphics for a RPG maker. I recommend using Game Maker Studio if you don't know how to code.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a testament to why you should never get drunk during a summer sale",
            "review_score": "-1"
        },
        {
            "review_text": "Needs Mac port... bought this when it was released... now it is worthless to me. Thanks.",
            "review_score": "-1"
        },
        {
            "review_text": "This program looks great. I definitely don't own it, and don't know why I can write a review for it.. But I would totally love a free copy of it and would be using it right now if I had it.  I know the RPG Maker franchise is really great, from experience.. but again, I totally don't own this one and have no idea why i can write a review for it..   10/10!!",
            "review_score": "1"
        },
        {
            "review_text": "IT SAYS RTP NOT INSTALLED HELP",
            "review_score": "-1"
        },
        {
            "review_text": "Thank you for making me pay $70 when i could get it for $7 on ♥♥♥....     oh and i suck at scripting so this was a usless software for me :)",
            "review_score": "-1"
        },
        {
            "review_text": "the game is pretty easy to work with once you know how to do some things, i'll admit it can be a bit rough to get into if you're not determined but once you get started the game is wonderful and i'm so hyped up for all the epic games i can create. i would recommend this program to anyone ad even more i recommend picking up some packs to go with it. it's worth it to have that extra wiggle room to enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "The first time you get your hands on this product, you'll be like 'Holy ****! am I playing Dark Souls?' Don't worry, because when you actually take some time to play around with rpg maker, you'll be like 'Pfft, what is this? Final Fantasy VI?'  In all seriousness. This product becomes so easy to use once you get the hang of it! And it's so simple too!  Want to make an NPC? No problem! Just create a new event, select the sprite, make the script for the character (right-click dat big empty space), and edit the dialogue. Easier done than said!  Random encounters? Yes! Very easy to make!  Wait, wait, what if I want to make a jumpscare game? No problem. You can make images appear! Just don't get your hopes high on a FNAF rip-off  Can you sell the games you make? Hell yah! Why do you think it's called RPG Maker? And There's no catch! Royalty free!  Pros  -Easy to use -Recommended for people who want to sell their first game -Recommended for devs who are just starting out -No complicated scripting required for a good game -Importing your custom content like sprites is a walk in the park -Legit fighting system -Asking price isn't as high as compared to other engines like Cryengine or UnityPro  Cons  -Resources you get when you buy RPG Maker is actually really limited unless you buy some of the DLCs -DLC bait (although the DLCs are really great) -Not the engine you'll want to use if you want to make the revolutionary, next gen, 2D RPG game -You can easily make visual novels here, but not recommended. It'll end up being bland  What are you waiting for? Go buy this now!  Still don't believe me? Just look at One Way Heroics. Yes, it was made using RPG Maker",
            "review_score": "1"
        },
        {
            "review_text": "It is a powerful tool. It seems very complicated, but it is just as hard as learning a new instrument. You can make a full on epic game, without it telling you what restrictions you have. You can litterally almost make anything, but you just need to decide when to do it!",
            "review_score": "1"
        },
        {
            "review_text": "Software so good for create game!!",
            "review_score": "1"
        },
        {
            "review_text": "Update: They seem to have now fixed the workshop, at least for me, can't speak for other people though.  As of this Review, the workshop functionality is heavily bugged at best. HOWEVER, this is still a wonderful tool which even comes with a commercial license allowing you to make money off of anything you create in it. Even if you can't do exactly what you want to with the base tools they give you, with the help of scripts that you either get from other people or make yourself, you can make anything a reality. Just be sure that if you use ANYTHING from other people that you read their terms of use for their scripts, resources, etc. and credit them in your game somehow.  When you dive into the scripts, it's actually quite amazing what you can do with this game. Lots of ways to change things up, create items, armor, weapon, create anything you would ever want to toy with in an RPG. This is a true CREATION kit. Even me, a person who normally isn't creative can end up making some interesting things in here, and once you learn the ins and outs, the limit truly is your imagination and as said before, if you're hitting limits with the creation tool, just look online for scripts to help or if you're tech-savy enough, make your own!  All of that being said I honestly think that this tool is truly the greatest tool of it's kind, there is a learning curve, but it's really not that big at all, especially if you're naturally somewhat good with programs on a computer. Overall, I would have to give this tool a 9/10 on steam. Once the workshop and steam cloud stuff works properly, I will edit this review and give it the 10/10 it deserves.",
            "review_score": "1"
        },
        {
            "review_text": "Simple enough for a child, powerful enough for commercial game development. Fun, Rewarding and Highly recommended!  Press F1 once you install and launch the software to read the manual and make sure to checkout all the great community forums out there.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for an easy to use platform to make 2D JRPGS this is the right place to start. Great for beginners and you'll find yourself improving your level design skills as well as story design skills. Of course, if you branch out to the third party plugins you can do even more amazing things than what was advertised. Great platform for those interested.",
            "review_score": "1"
        },
        {
            "review_text": "I was getting bored of playing video games and one day saw this software go on steam sale (while back), and this is to create your own rpg, which imo is pretty sick. The pack comes with everything you need to use to create an 8bit rpg of your own.",
            "review_score": "1"
        },
        {
            "review_text": "Hard as a crumpet to use and will question your sanity.  10/10 would do again",
            "review_score": "1"
        },
        {
            "review_text": "Seriously good fun",
            "review_score": "1"
        },
        {
            "review_text": "The most easiest game maker i ever seen! (HUMBLE BUNDLE RULES 1$)",
            "review_score": "1"
        },
        {
            "review_text": "At first I didn't really understand it but now that I have used it for a bit, I am an alright creator. Just take this in mind when buying but otherwise it's an amazing game creator and you should get it. No seriously. I'm not lying. Your children will pay if you do not buy this. BUY IT NOW OR THE WORLD WILL IMPLODE EXPLODE AND COMPLETELY DESTROY EVERYTHING ON THIS PLANET AND YOU WILL NOT HAVE BOUGHT AN AMAZING GAME CREATOR!!! BUY IT!!!",
            "review_score": "1"
        },
        {
            "review_text": "I love it. You can make it from like the The legend of Zelda 2 map screen where you can run around the world, to a screen (like in a cave) you using Link to jump and fight. I do admit, I got a little lost when I tried making a RPG Maker game because I didn't know what to do. I highly suggest this if you guys have the patience to watch youtube videos on how to do it and have enough money to buy: Game Character Hub. Game Character Hub, helps you build your character (instead of generating it in VX ACE) and you can make assessories + tiles! Back to Rpg maker Vx Ace, you can test your game!! You don't have to save it and compile it, and then play. YOU CAN PLAY IT RIGHT THEN AND THERE. You can do things almost like Age of Empire game editor sort of! So technically my (personal) requirement for this is: 1. RPG Maker VX ACE (The Game to make your RPG) 2. Watch a few youtube videos on how to make some games (Patience) 3. Game Character Hub (Make tiles + Character + assessories) 4. and the willingness to make a game without giving up. (Draw your game down before making something) Thanks for reading my Review. (sorry, I'd should say this is a tool... not a game, lol)",
            "review_score": "1"
        },
        {
            "review_text": "Get a nice art team and a few writers, and this program will basically print out games for you. Very easy interface and no programming language needed",
            "review_score": "1"
        },
        {
            "review_text": "Great software, really time soaking",
            "review_score": "1"
        },
        {
            "review_text": "I tried the trial a while back and had no idea it was available on steam, but yea I would recommend it in a freaking heartbeat! ^_^ A word of advice for new users though, YouTube has an excelent selection of tutorial help (such as event building, map creation and character/character battle events) and most are very easy to understand, so definitely check it out if you buy this program and enjoy the world of RPG Making.",
            "review_score": "1"
        },
        {
            "review_text": "It is a Wonderful Software for players who want to start off small with there large imaginations.",
            "review_score": "1"
        },
        {
            "review_text": "Fun if you have time to spend. Finding help with controls is a must unfortunately.",
            "review_score": "1"
        },
        {
            "review_text": "Even though I don't have many hours using this product, it is definately a product I recommend you buy. It has everything set up for those who have no clue what they are doing, aswell as having things that are complex for the more advanced users. Definately worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "So I downloaded this and thought eh...it might be ok but after only five min I had a game made that I could play...albiet super simple but a playable game none the less. I love this so far and I dont for see any issues with making a game and publishing it but should any arrise I will edit this.",
            "review_score": "1"
        },
        {
            "review_text": "it's good",
            "review_score": "1"
        },
        {
            "review_text": "I absolutly love this software, it works perfectly for all my needs!",
            "review_score": "1"
        },
        {
            "review_text": "It's an awesome piece of software that let's you bring any game you want to make to life.  Would definitely recommend to anyone who has any interest in making a game.",
            "review_score": "1"
        },
        {
            "review_text": "easy enough for almost any one to use but it cost a bit much. wait for a sell to start",
            "review_score": "1"
        },
        {
            "review_text": "Ah! the application that I am using to create Zhraco Knights. But GOD it is not easy. To get everything you need to make a game, it will take time. effort. and dedication, i havent even finished my game. And im still working on it. But this RPG Maker is the simplest of the lot. but my personal favourite is RPG Maker XP. but we all have personal preference. But i do like this one alot more though. since there is alot more you can do now. There is a great community to help you out though to get what you want, you are going to have to work for it. put your foot in deep, and give it a go. There is a Lite version, great to try it out. no trial, no expiration date. just a limited version of VX Ace.  Now do i reccomend this? Only if you want to try game making, if not. Dont waste around £50 for it. Get it on sale, if your intrested.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game making software",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful programme for budding and experienced game developers alike. Lets you import your own content (provided you credit your sources of course) and export anything you want to tweak. Easy to navigate once you've got the hang of it. I've been using this software for just a few days and have already made my own demo, AND posted it online. Massive thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "While it seems very intimidating at first, RPG Maker VX Ace is actually a lot of fun to work with and the results are always pleasing. I've only clocked in a little over 60 hours of playtime and I haven't regreted a minute. There are some tedious things that go into the game-making process, but I definitely recommend this product.  P.S. With RPG Maker games (assuming you don't use 13,000,000 scripts [well that was an oddly specific number]) It's probably best to work on story or gameplay mechanics over graphic quality, textures, and the like. A lot of games will be similar in look due to the core engine and base sprites and whatnot, so make your game unique in other ways ^^",
            "review_score": "1"
        },
        {
            "review_text": "wonderful sysytem a little less effects that rpgmaker 2003 had(ie no easy ff style combats). Also less graphic effect than rpg maker xp. but more versitility than any other version in EVERY other aspect. Better script that are way easier to program.",
            "review_score": "1"
        },
        {
            "review_text": "What I love about this program is that even if you don't actually publish anything with it, at least you could make your own fantasy come alive in the way you want it. I've already put in 200 hours into it and I more than likely will never finish my project, but that's alright at least I'm putting my own story into something I can work with.",
            "review_score": "1"
        },
        {
            "review_text": "I got it for a dollar from Humble Bundle. Can't complain about that. It gave me some trading cards.",
            "review_score": "1"
        },
        {
            "review_text": "very nice engine to make games on you can input so much of your own stuff its great, even just using whats in the package you can make some great games",
            "review_score": "1"
        },
        {
            "review_text": "Very good software, although dlc needs a little work to import. The software can be confusing and hard to learn, but once you have, it opens many opportunities. Highly reccomended for first timers and experts. *****",
            "review_score": "1"
        },
        {
            "review_text": "One of the best RPG game makers. Its fun to use but the price is a lot. I still like it and its easy to use.",
            "review_score": "1"
        },
        {
            "review_text": "As a casual developer beginning to grasp the concept of creating games, this software has served me well. The program is simple to learn but difficult to master and by that I mean it's not hard to learn how the event system works or how to work with tile sets but once advanced enough you are able to import codes (that you've made or that you've found on the forum..with permission of course!) to use, you are able to use custom tilesets, and basically set the game up the way you intended it to! My only complaint is that the built in sprite generator feels limited but there's a great companion program on steam that you can use. Definitely recommend buying this, especially when it's on sale!",
            "review_score": "1"
        },
        {
            "review_text": "Such a good game programming software! If your a beginner at programming, start with this. You can make thousands of differant enemies, items, weapons, armor, you name it! There are also differant battle scripts that you can use for differant battle systems. So if your a starter at programming, and want to start simple, use RPG Maker Vx Ace, you won't regret it!",
            "review_score": "1"
        },
        {
            "review_text": "I like of how I set my mind on one idea, take so much time just to make the items, enemies, etc., just so then I can get another idea and start the whole process again, and again, and again.  It's so simple to use that you can quickly make one for/with your friends, or if you feel like you really like your idea, you can even put it on steam!",
            "review_score": "1"
        },
        {
            "review_text": "RPG Maker VX Ace is a very nice game creator, and I strongly reccomend it to those who cannot code.  PROS:  Very nice character customization. Easy to script and fun to use NO CODING!!! Easily used Item/Weapon Creation  CONS: Frontview battles only, unless you take the time to find a SideView Plugin (If your looking for SideView then check out RPG Maker MV) Tiles used for maps tend to get boring and repetetive. Some Events are not working correctly Hard to use (for begginers) plugin system. ",
            "review_score": "1"
        },
        {
            "review_text": "this is a fun RPG game making software. it has a lot of customization. i just wish that it could make games for Linux.",
            "review_score": "1"
        },
        {
            "review_text": "RPG Maker VX Ace is a great way to get into game making. You can complete a game without needing to know how to script. I made a Christmas themed game for my little brother and sister, and my girlfriend's dad in two days. It was simple but they all enjoyed it. My game had a plot, a puzzle, some jokes, and some battle sequences. At the end of the game, steam codes were revealed as their rewards, so my game was basically an elaborate gift box with steam games inside as a surprise. These were the best gifts I have ever made or given.",
            "review_score": "1"
        },
        {
            "review_text": "It's very easy to use even gives you default assets so you don't have to do all the artwork yourself so now I can only blame myself for not being able to make anything good with it. :D",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: DO NOT BUY IF YOUR SCREEN RESOLUTION IS UNDER 1024x768. IT WILL NOT RUN.  RPG Maker VX Ace is a simplified application that you can utilise very easily to create basic RPG games. It is intuitive, clear, refined and so simple to use, which makes the program fantastic for amateurs who are easing in to game making. It is so smooth to run, so much more experienced game makers can use it to great effect with such quick ability to navigate the program, (as previously stated, it is intuitive as a program and knows what you want done when you click; it knows the rules it was coded with,) which is great because running paragraphs of code gets very old very fast. (*Note: As a game maker I have often found I end up loathing games I make because all the lack of mystery of exploring a new game melded with the angst I acquired during construction of the game; hassles with coding can be a massive stand still, and to be honest I have never really got in to using any engines at all that require more than a few lines of coding.)  BUT for you coding afficianados out there, do not belay yourselves.... there is still plenty of opportunity of coding behind the iron curtain if you so desire!  The best part about RPG Maker in general is that you acquire all the rights to your IP made through the program upon purchase. If you make your own sprites, then they are yours. Your story will be yours. Your content will be marketable by you and no one else; you own the rights to that copy of the program too.   The program does cost alot, and many people are reluctant to purchase it in full, especially before it was on Steam, because of the price; but really, when you think about it, if you plan on marketing your own indie RPG game, (Cthulu Saves The World, anyone?) it is a great, cheap program. If you are planning on getting it for hobby fun, I can understand your reluctance as you will never get reimbursed the costly price tag, so to those gamers, I recommend getting it on sale, (I got it in the 2013 Holiday sale for around $30.)  Now I barely game anymore, but having recently acquired a small netbook I have been up and running in the Steam community again, (good to be back, I miss everyone I do not talk to, lol. I digress,) so I thought I would give RPG Maker a go again, because I had not touched it since around 2009-2010. I was very sad to see the program can not run on certain netbooks. I would have expected a piece of program like this to have had someone design a small fix to make the program run on a bit lower screen resolution, but no need when the person has already paid for the game, right? Maybe I am ignorantly commenting there, or maybe I am spot-on; as Meowth says, 'Who knows?' right? The reason it does not run is because a netbook, especially older smaller ones, do not have the required screen resolution; very sadly. My current netbook has a scrn res. of 1024x600 and the program requires 1024x768, so for now I will not be playing it until I can be bothered figuring out a way to fake the resolution, (for anyone looking for a solution to running RPG Maker, my first recommendation would be to acquire a DESKTOP monitor to connect the netbook too, and that screen will be capable of running the required resolution. But who wants to do that right, so clunky.)  In closing, RPG Maker is a great, simplistic, in-depth program and I highly recommend it for all users, but especially for beginners, as it is good at hand holding, (but times will come when you will need to use your brain to resolve an issue not told, or research coding to do certain actions states.)   - great intuitive program - costs alot, but that is redeemable if you successfulyl market your game/s - do not buy if you can not run the screen resolution  7/10  EDIT:  DLC: The extra DLC is disgustingly dear.",
            "review_score": "1"
        },
        {
            "review_text": "Great for making simple turn based RPGs. What more can I say about it? It's fun, fast, and useful.",
            "review_score": "1"
        },
        {
            "review_text": "This is absoloutely awesome managed to lose myself in this for hours on end Totally recomend it for anyone who wants to try their hand at making their own games",
            "review_score": "1"
        },
        {
            "review_text": "RPG Maker VX Ace is the perfect software for beginner game designers. NO experience with coding or anything is required to have a mediocre to good game out within a couple of hours. There are TONS of resources and tutorials to help anyone and everyone with their needs. Grab it now!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing software!",
            "review_score": "1"
        },
        {
            "review_text": "Good easy to use software with the ability to easily import your own assets with a large store of assets also available.",
            "review_score": "1"
        },
        {
            "review_text": "I never thought I'd have so much fun cobbling together a game like this, but this software is truly amazing, the level of difficulty/customization is literally whatever you decide to make it, it comes with a good variety of assets and maps or you can make up completely new content! I love it!",
            "review_score": "1"
        },
        {
            "review_text": "It really is just a better, more powerful version of RPG Maker XP - which I used before getting this - and I've had a lot of fun messing around with the tools it provides.  Definitely recommend any one of the RPG Maker series if you're feeling creative.",
            "review_score": "1"
        },
        {
            "review_text": "Got it on sale for 6$... At least I didn't spend 60$ on a game engine I probably will just screw around in. 11/10 most distracting software ever. ",
            "review_score": "1"
        },
        {
            "review_text": "Bought it on sale for 5£. Wait for sale to end to use it officially so my friends will think i've spent 50£. 10/10 never gonna use it again.",
            "review_score": "1"
        },
        {
            "review_text": "Very, very good.... but what is up with the thumbnail of the first trailer video on the steam page? It's a wee bit odd.",
            "review_score": "1"
        },
        {
            "review_text": "This software is one of the dankiest, quickscopingest, radical-est, swaggiest mcjaggiest tools you could ever have.  11/10 get this in your library right now.",
            "review_score": "1"
        },
        {
            "review_text": "Best game creator for an RPG game and it makes it easy to do also!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game makng engine and easy to use! ",
            "review_score": "1"
        },
        {
            "review_text": "If you have the patience to sit down and devote to your creative side, and of course allow a large amount of time to learn how to use this. It's brilliant",
            "review_score": "1"
        },
        {
            "review_text": "I've been using it extensively. Although it can be tricky making custom resources VX Ace offers more coding options than older titles.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Wow. This software is amazing! I find myself going 'well I will just make one more map, event, etc.' and an hour passes then I tell myself the same thing.",
            "review_score": "1"
        },
        {
            "review_text": "RPG Maker VX Ace studios is a well orientated game-development program that allows you to express the usage of programming, creativity, and literature all compacted in this software. Despite its pricing, it's well worth it if you are able to master the program fully.",
            "review_score": "1"
        },
        {
            "review_text": "If you really need to make games, hey, this can be somewhere you can start!",
            "review_score": "1"
        },
        {
            "review_text": "Epic Epic Epic  Really good quality takes a while to get the hang of but after that its really fun",
            "review_score": "1"
        },
        {
            "review_text": "Made Some Sweet Games On Here Ey, before it was on steam havent been using it much atm because busy standbying for titanfall",
            "review_score": "1"
        },
        {
            "review_text": "I definitely recommend this software to anyone who has a passion for game creation and/or wants to learn any basics on creating RPGs. It has a JRPG style, but the user can also import different scripts, tiles, facesets, ect. to make an RPG the way they want it to be. It is limited as far as functions, but it still has a LOT of different features to play with. I've put a good bit of time into the software and I must say, it's time consuming. Especially on your own. It's easy to use, but can have a bit of a learning curve for some people who are less familiar with creating RPGs. Over all though, I'm very pleased with this software and I am glad I purchased it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this program, used the Gen 1 of it and did some awesome stuff cant wait for some time to sit and make something even cooler on here.",
            "review_score": "1"
        },
        {
            "review_text": "Do I like this software? Heck to the yeah do I like this software! A lot of budding game developers have been wondering if it was easy to make games by themselves. If those games were included in the RPG department, then buddy let me tell you, there's no better place to start than with RPG Maker VX Ace!  The software itself is a bit pricey, yes, but I must direly recommend that you try out the TRIAL VERSION at the original site. It gives you 30 days to tinker with the system and figure it all out. That's where I began, and it was incredibly helpful.  But onto the specs! This game is truly incredible by itself, with plenty of pre-made things to choose from. After a while, you'll start to want more, since the pre-made bits and pieces are getting a little over-rated. Indeed, more is better with this game if you want to reach out to different genres, such as sci-fi. The Store provides several unique downloads as well.  Figuring out the system is a bit difficult at first, but it gets easier as you progress. It took me a little under a week to correctly work events. Scripting comes along a little harder (I haven't, nor do I dare, tried it yet.) But there are plenty of users who have made scripts for you to use in your game.  All in all, this is a great place for wannabe programmers and such, and I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "super easy and fun to use",
            "review_score": "1"
        },
        {
            "review_text": "It's easy to use for anyone new to creating their game.",
            "review_score": "1"
        },
        {
            "review_text": "Rpg maker vx ace has a lot to offer anyone who is interested in designing your own rpg game, its interface is very friendly to  people that really want to start understanding scripts. it has loads to offer from making or designing your self how your game should look, it has some very nice DLC's and some other nice programs that can be brought to complement software. And with a 75% discount this weekend anyone should make take a opportunity to buy this great program.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant. Got this and a heap of expantions on the Humble Bundle.",
            "review_score": "1"
        },
        {
            "review_text": "This software is great, iv'e had a fun time making various maps on RPG Maker VX ace, but i would suggest looking up some tutorials on how everything works",
            "review_score": "1"
        },
        {
            "review_text": "This is a great peice of software, if you have ever wanted to put an idea of any sort of adventure from paper to a digital game, you could probably do it here. Every time I use it I discover new things to do, and I am very much an amature at this, someone with some skill could do wonderous things!",
            "review_score": "1"
        },
        {
            "review_text": "I was a complete beginner at making games, this soft were is great for me and any who would like to make games but aren't good at the art of making tiles and other stuff like that.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely easy to use, and greatly rewarding once you figure out how everything works.",
            "review_score": "1"
        },
        {
            "review_text": "So many projects, so little time...",
            "review_score": "1"
        },
        {
            "review_text": "The software is amazing, and very simple, it is fun to learn by experience, but having people test your game helps too, I have a few people testing my games, and helping me fix a few smaller errors, and a few larger ones. It's just truly amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This program might be rather expensive, but it's features are completely worth it. Already very beginners in the field of Game Development can use this program easily. Using it does not require much skill, the graphics, music etc can be modified external to add some tracks that can make your game unique. Professional developers (Ruby only) can also modify the game script itself to make their game stand out amongst the others by modifying the way the character moves, which system will be used during battle etc. The built-in character generator might be a pretty awesome idea, but I'd not consider using it. It could still be improved by far by adding more possibilities on clothing, face details etc. Also they could improve it by adding not just more resources, but more features, like creating a full FaceSet filled with different expressions instead of just one facial image. They could add a feature to create a special stance at the CharSet, like making the character be in some kind of fighting, fencing or shootout stance.  Personal rating: 86% Worth the money: For sure Worth the money you pay for this program, but the additional features should be improved by far. Maybe could also add a BGM Creator tool, but that'd be too much to ask for.",
            "review_score": "1"
        },
        {
            "review_text": "Easy To Use RPG Maker, Good Game Mechanics and easy to edit and customize your own characters and create new games",
            "review_score": "1"
        },
        {
            "review_text": "A great software with amazing possibilities.",
            "review_score": "1"
        },
        {
            "review_text": "In terms of a game developer the $70 price tag is insanly cheap. Especially when you are free to sell your games you create with it. Just make sure if you do find resources online you have the owner's permission to use it for a commercial project. Also little to no programming knowledge is necessary to build a fully functioning RPG.  Also with the engine coded in ruby, if you know ruby you will be able to customize your game in any way you see fit. It is just an exceptionally versitile tool to have if you are a budding game developer.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome editor for your favour. Create RPG games you imagine, create wonders! Really beautiful Japanese Manga style and the event system is simple and effective. Also supports scripting!  But one feature I want to be added in future: version control. Yeah, you can do this with GIT or SVN, but an implented feature for that would be very nice.",
            "review_score": "1"
        },
        {
            "review_text": "Not a game, but very fun software!",
            "review_score": "1"
        },
        {
            "review_text": "This is an impressive piece of software. If you ever wanted to make your own JRPG this a great tool to do it with. However you should do so with the right expectations up front otherwise you might be disappointed.   First, there's a lot of depth here. Expect to spend a fair amount of time just learning how the software works. I found an excellent tutorial on the web that was ~170 pages long that walked me through creating a small RPG including a world map, town and buildings inside the town, mobs, NPCs, items, shops, etc. Even at 170 pages, there were a lot of pieces of the program that were skipped or only mentioned briefly. Everything that you'd want to have or would see in a typical old school JRPG is possible but there is a learning curve so expect to put some time into that.  Second is the time required to create your own RPG once you know how the tool works. Classics like the original Zelda were not made in a day, so if that's your ambition then plan on spending a lot of time to get there. The tool is fantastic as it takes care of the technical aspects of rendering the screen, handling input, playing audio, tracking game states and dealing with more complex things like how character levels progress, building a shop or handling combat. It's still up to you to paint the world, write the story, the dialog, add the event triggers, define how characters progress, what items and spells do, what they're called and how much they are work as well as defining the monsters and bosses and then assembling this into a coherent game.   Bottom line is if you have any interest in making a game like this, or just want to see what's involved in making a game like this then this is a great tool to do that with. I'd suggest that if you get it, don't get any of the DLC until you've had some time to go through a tutorial and had a chance to try it out to see if it's for you.",
            "review_score": "1"
        },
        {
            "review_text": "great software lots of fun",
            "review_score": "1"
        },
        {
            "review_text": "So much fun, I havent even gotten into the depths of it all and im just enjoying it, all the tiny details coming into place of an RPG that I get to create. It's fun and addictive to see what kind of things you can come up with. From various skills to enemies, dialogue, story, all of it. It truly is a wonderful and I highly recommend it for anyone who wants to make their own game either for real or for fun.",
            "review_score": "1"
        },
        {
            "review_text": "While I've barely even scratched the surface of this software's capabilities, it has already been a great experience. The tools are simple and easy to use, and there are plenty of online guides to teach you how to use certain tools. The sheer amount of customization for everything, from the world to characters, is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I always wanted to get into programming - while I haven't actually used this yet, it looks like I can finally make a game of my own :) Worth it in every way, from what I can tell.",
            "review_score": "1"
        },
        {
            "review_text": "A little pricey, but highly modular, and not too difficult to use once you get the hang of it. Thankfully the forums for the software are still quite active, and it's easy to find lots of user-created scripts to make the game work the way you want.",
            "review_score": "1"
        },
        {
            "review_text": "Very simple to use. Drag and Drop to create something unique.",
            "review_score": "1"
        },
        {
            "review_text": "So easy a caveman could do it",
            "review_score": "1"
        },
        {
            "review_text": "its not a bad game.",
            "review_score": "1"
        },
        {
            "review_text": "Been using the BOXED version of the software for over a year now. This is a must-have program for anyone wanting to get into 2D RPG making.   Sure, some people say the system is limited, but they're not taking advantage of scripting. YES, scripting is hard. But thankfully, SEVERAL FORUMS exist to help out with that-people teaching you scripting, people writing scripts FOR YOU, people offering scripts that have already BEEN written...  Still, even WITHOUT scripting, 90% of what you want to do can be done with eventing.   Point is, this is some damn powerful software, and is WELL WORTH every penny-even at full price!",
            "review_score": "1"
        },
        {
            "review_text": "Great software if your looking to be a game developer or if you just wanna make a game for fun i'm definitely going to be useing this for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "This program is great, i hadnt ever done programing before this but i found that rpg maker ace was a great gateway drug into the skill. Though dont get me wrong, it was hard to get into and understand, but once you get over the learning curve, the skys the limit.",
            "review_score": "1"
        },
        {
            "review_text": "This softwear is pretty cool you can create your own rpg and its really easy alot of known horror rpg maker series has been made with this tool some titles are: mad father, Corpse party and more so i definetly recomend you buying this program 9/10 and PEACE!",
            "review_score": "1"
        },
        {
            "review_text": "Royalty-free. You can sell what you make. Remeber to test every once in a while.",
            "review_score": "1"
        },
        {
            "review_text": "Temporal Flux with jpegs",
            "review_score": "1"
        },
        {
            "review_text": "Great software and easy to use!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing peace of Software this thing is! Easy to learn how to use! If your looking to start making an Rpg game and don't know how to code/or do know how then I would recomend this! Although the price should be lowered on the dlc's or the base game price should be 50$ 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Great for people like me who cannot script to save their lives. Also really fun to mess around with even fi you do not have a game in mind to make",
            "review_score": "1"
        },
        {
            "review_text": "fine tool as long as you know how to use it id only buy it if it was on offer though, i wouldn't say it was worth £50 though",
            "review_score": "1"
        },
        {
            "review_text": "it is a good software that allows you to make a good game and have fun ,but does not give you a tutorial.",
            "review_score": "1"
        },
        {
            "review_text": "So far, so good! RPG Maker looks like good value for the money, even if you didn't get it on sale. Very flexible, and probably one of the few pieces of software where lots of DLC is a good thing. I've mucked around with some basic experimentation but I can already see where one can make an experience as deep or as simple as one would really like. Definitely worth a look -- having an I.T. background will help a lot, but it's not required.",
            "review_score": "1"
        },
        {
            "review_text": "simple and amazing :D",
            "review_score": "1"
        },
        {
            "review_text": "An amazing creation tool that will let you design your dream RPG. Easy to use with many tutorials available, creating games is easy, fun, and simple. I don't buy RPG's any more, I make my own. The only down side to this tool, is that DLC instillation is not user friendly - though, oddly enough, the actual program is easy to use.",
            "review_score": "1"
        },
        {
            "review_text": "Yes. It's very good, but confusing.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing piece of software. Its really easy to use, and i would recommend it to everybody.",
            "review_score": "1"
        },
        {
            "review_text": "Easy and fun to use! Just be careful, plan your games out before making them! Not worth $70 but on sale, it is an excellent buy. Totally would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Very good tool to make fun little RPG games",
            "review_score": "1"
        },
        {
            "review_text": "simple and fun!",
            "review_score": "1"
        },
        {
            "review_text": "Addictive",
            "review_score": "1"
        },
        {
            "review_text": "Using this to make maps for DnD.",
            "review_score": "1"
        },
        {
            "review_text": "This tool is excellent at reproducing that mid-90's JRPG feel (think Final Fantasy 2-5), with a surprisingly deep toolbox that enables some serious story-telling. Definitely spring for Ace if you plan on importing or creating any serious number of assets, though, otherwise you can be painfully restricted by the program's default limits.",
            "review_score": "1"
        },
        {
            "review_text": "It's cool to be able to play an RPG you created, but you have to be able to invest real time and effort into making a game. Otherwise, you, like myself, will find yourself screwing around with the Database for 300 hours. It takes many hours to make a good 15-30 minutes of gameplay, and the resources given to you won't be enough to make it professional-like. After awhile, you will need a great amount of patience because it can get tedious and frustrating to get everything just right. You may have to be good at graphic designs in order to make the game into what you want it to be. It's a shame that there aren't too many people who devote time into putting resources and posting it online for other people, though I can't complain because I have never done so myself (EDIT: I meant to say that there's a lot of great people with lots of great resources, but sometimes the selection of things feel a bit limited, mostly if you are searching for a specific thing. If you can't find it, your best hope is to request it and hope someone takes a look at it).  If you're really, really, really determined to create an RPG, then give this one a try when it's on sale since it goes down drastically from time to time. You must be crazy (or rich) if you're thinking about getting it for the full price.",
            "review_score": "1"
        },
        {
            "review_text": "You can make any you have ever wanted to make. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "It's good.    11/10",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to create the RPG of your dreams, but suck at both programming and drawing? Then RPG maker Vx Ace is perfect! This awesome and powerful game maker comes with all the things needed to create your game, including; a custumizable script, a character generater hub (for people who don't want to use the sprites provided), tons of tilesets to create open fields, dungeons, castles, etc., and an easy to use event maker. If you want a program that can make tons of quality games, you'll want this one for sure!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best, if not the best game maker of all existence.",
            "review_score": "1"
        },
        {
            "review_text": "At first glance someone would say 'This is stupid. Who would buy a game maker like this for $70?' Let me put you at ease. This game creator is amazing. That being said, GET IT DURING A SALE. You will save loads, and have an amazing 2D game creator for roughly $20. I recommend this to anyone trying to make a nice old fashioned RPG. I personally enjoy the pixelated graphic style, and the ability to create your own graphics. There are so many things you can do with this. Buy it. You'll like it.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game if you want to start programming and you can make great games out of it is a very powerful engine for game creation . but they should have made battles more customizable for example side view battles  but you can still find custom scripts online for that sort of thing . i would give it 4/5",
            "review_score": "1"
        },
        {
            "review_text": "Don't be put off by the sickening amount of DLC, this is truly a good piece of software.",
            "review_score": "1"
        },
        {
            "review_text": "its on my top 10 list of best game makeing programs",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely great for beginner. Easy to learn, but deep enough for advanced programmer. I like this programm a lot and can absolutely recommend it for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good game builder that comes with plenty of resources. While it doesn't come with a tutorial, it does have helpful windows that pop up when you have your cursor over something. The price might be a little high, but the power of this program is pretty good. There is even a workshop for this program, which is a nice bonus. This program is meant for beginners. If you want something that is more advanced, try a full production program or code your own game. I recommend holding off on this program for when sales are around. $70 is a bit much, but it's worth the grab when a sale is happening.  I bought this during an indie sale from Humble Indie Bundle. That was literally the cheapest bundle I ever saw with games and DLC. Having already bought it from their website during a sale, I bought it again because it came with games and content. The big winner was that you even got Steam keys for the program, games and DLC. I couldn't refuse such a bargain.  If you are looking for a free way to make a game, Game Develop is out there with video tutorials and can code in different formats, but comes with very little resources to build a game on.  The other optin is Blender, a 3D rendering program that can do videos and games. There are tutorials, but finding an up to date tutorial is a challenge since the program tends to update faster than the tutorials can be completed. It's free, so you can give it a try if you want. Keep in mind that you have to design everything from scratch or download other people's work, which you have to make sure you have permission to use in a game you plan to license in the future.",
            "review_score": "1"
        },
        {
            "review_text": "easy to use",
            "review_score": "1"
        },
        {
            "review_text": "I think this software is absolutley amazing. My coding skills are close to zero (I have spent some time on Code Academy) and I was able to make a simple game. I didn't really have to use what I know about coding and I learned most things from one day of watching youtube videos (it really is very simple). My first project was a Valentine's gift for my girlfriend. I made a small game filled with references of us and a funny storyline and even though it took quite a long time the end game was short but pretty fun. My point is that its easy to use and that you do not have to be very serious about game making to use this, I wouldn't know about its potential for making good commericable games, but there are a bunch of games on Steam that were made using RPG Maker so I assume it can also work for people serious about making games. I recommend this software to anyone even remotley interested in making an RPG, you will get addicted.",
            "review_score": "1"
        },
        {
            "review_text": "This Software is great. I have a alot to learn since i am new to all of this. i got this part of a Humble Bundle deal long time ago. But i would wait for it to go on sale.",
            "review_score": "1"
        },
        {
            "review_text": "really easy software and fun to mess around with. can import own things in if correct sizes and import own music no problems with it and dlc are great is worth the buy but rpg maker mv is coming out so this will probably end up on sale soon or something.",
            "review_score": "1"
        },
        {
            "review_text": "Makes RPG games and stuff.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not too good at making games but even this is really easy to understand. Now all I have to do is come up with game ideas!",
            "review_score": "1"
        },
        {
            "review_text": "It's an awesome way to make games and easy too !",
            "review_score": "1"
        },
        {
            "review_text": "Not as intuitive as advertised, but powerful and flexible once you learn how use it. Luckily there are well made tutorials and a very helpful community to help you get started.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome program to create your own rpg style video games. Easy enough for the simple use, but advanced enough for those who like to hash it out on scripts and programming. Great community with new ideas coming out every day",
            "review_score": "1"
        },
        {
            "review_text": "Trapped kids inside fence. 10/10 would W0W again",
            "review_score": "1"
        },
        {
            "review_text": "For someone like me who has no idea how to code anything, it's fantastic!  A bit confusing to get started with but when you know what things do it just opens up so many other possibilities, I definitely recommend getting it f you've always wanted to atleast try and make an RPG.  There's a 30 day demo available on their main website, you should check it out before deciding whether or not to pay, it'll give you more than enough time to learn the ropes :D",
            "review_score": "1"
        },
        {
            "review_text": "Awesome program to use. Pretty easy to figure out and plenty of information online for additional assistance.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun and it's not too hard to learn to use. What more could you ask?",
            "review_score": "1"
        },
        {
            "review_text": "I have spent SOOO meny hours using it creating games, playing games, and offering textures for others to use. for me the money (though expencive) spending countless hours refining games and offering tutorials to those who need it. simple to use and easy interface any newcomer can learnhow to use this in 30 mins - 1 hour. I greatly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amaning software, I can make anything I want and however I want to do it.  The only limit is your imagination.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible ! A game creator that is easy to use and quick to testplay .  Pros- Easy to use   Fast  Great Community Cons-Hard to edit  Scripting is neccesary to make a good game",
            "review_score": "1"
        },
        {
            "review_text": "Was your childhood dream to one day make your own snes game, but it never came true? Now, you have the chance to fulfill that dream! RPG Maker VX Ace lets you create your very own snes game in a super simple way. You can create your own world, characters, npc-s, quests, with your own story and own adventure! The program presents so many opportunities, and lets you customize everything from a large scale to tiny details. My mind was blown away by how ingenious this program is, and how simple and easy it is to use! I recommend this game to everyone who loves snes games and wish to create their own.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say that if you're wanting to make your own game, and you have A LOT of patience, then this is it for you. I've made a game with it already, and I've received very positive feedback.",
            "review_score": "1"
        },
        {
            "review_text": "Good is not the correct rating one should give this. RPG Maker is a good program to make rpg games or visual novels, but  this one have a character creator and support to modifications.  Beside this one's modifications are not as powerfull as XP and VX, and the characters are again  small, this program can allow you to make a game with less the effort you would make creating  one programming it from zero.  The only downside currently, is that the battle system may make one sick if played for too long.",
            "review_score": "1"
        },
        {
            "review_text": "It has some good improvements compared to RPG Maker XP what I did use before.  For those of you that can't decide which one to play, I'll list this up very easy:  + You can use Facesrpites next to your text messages to make it clear who is talking - This should also be possible on XP with scripts ++ You got thet sweet character creator to make Overworld- and Facesprites. For those of us who can't sprite that's an awesome feature to use whenever needed. + It's easier to play around with database, events and scripts  + There are some epic scripts out in the world to increase fighting, features (skilltree, daytime, HP bars and everythig else you can imagine) +/- XP probably got those too, but they wont get updated anymore becuz most focus on the newer ones - The mapping is rediculous. It's harder to create tilesets (till you get used to it), if you deleate a chunk you have to restart that bit, becuz there are no more (cant find the english word) ... eh... XP was devided into A, B, C and you could edit them without deleating the other layer(?) - The price is stupid - The DLCs cost even more and got no good / not much new content (from what I read in the forum, I did not try myself)  -&gt; Just in case VX Ace goes down to 7 Euro again - that's when I bought mine - it is totally worth it's money. In all other cases I would say: Get yourself XP, it got almost all features that VX ace got, easier mapping and doesnt cost that much.",
            "review_score": "1"
        },
        {
            "review_text": "Great software to create a RPG",
            "review_score": "1"
        },
        {
            "review_text": "  A friend of mine originally purchased this for me and I have been playing arround with RPG maker VX Ace for afew mounths now. This program, while it does have it's limitations, is great for what it sets out to do. It takes a person with much less programing language than me and allows them to design a game that they will be able to be very proud of.  While I have heard you need no experience with coding, I have found that to be an area of grey. Designing your game does still require limited coding, though this is kept to an extreme minimum, and is well documented and easily explained. The RPG VX Ace community is very helpful with many scripts out there to help you further customize what your game is capable of. Most of these scripts have been around for afew years now and have their bugs worked out.  I personally had not worked on a line of code in probably a decade when I recieved this and had absolutly no trouble working with it's controals. With my first game about to be released in a complete'ish' alpha state, probably within the next few mounths. I would definatly say I am hapy with this product and would easily recomend it to others.",
            "review_score": "1"
        },
        {
            "review_text": "The software is easy-to-use and has a lovely art",
            "review_score": "1"
        },
        {
            "review_text": "I purchased RPG Maker VX Ace so that I could develop (and hopefully publish) an attractive, distinguished RPG over the Summer break. I found the price to be somewhat discouraging, especially as there are other free programs - such as GameMaker - which are capable of producing the same type of game. That being said, however, I found this software to be far superior to its competitors and easily worth the money.  RPG Maker VX Ace offers several powerful components that simplify the lengthy process of developing an RPG. When you first create your game, you will have unrestricted access to the built-in map editor. This is where you will use your graphics (or the ones that came with the software) to design your world maps, exteriors, interiors, and everything in between! Your map is where you can create, delete, and modify events. Everything that the main character talks to, fights, or receives quests from is controlled by an event, as they are the subject matter of your game. Lastly, the database editor is where all of your game data is stored. Here, you can create NPCs, classes, and anything else you can imagine!  RPG Maker VX Ace provides pages of royalty-free graphics for anyone who legally owns a copy of their software. Most users won't find themselves worrying about importing their own graphics, but there is an option to do so in the database editor. One obstacle that I was unable to overcome, however, was the fact that compiled games can only execute in an extremely small, fixed screen resolution. The window can not be made fullscreen or enlarged beyond 544x416 pixels, and the only solution is hacking the game's executable file - which is a direct violation of the EULA.  Overall, I found RPG Maker VX Ace to be an excellent piece of software for home users who want to develop a game, and potentially share it with their friends or upload it to the Steam Workshop. People looking to develop a commercial game may want to look elsewhere, though, as the locked resolution and generic menu graphics would be a major turnoff for PC gamers with high expectations.",
            "review_score": "1"
        },
        {
            "review_text": "this game is great i love it! but all of a sudden it wont work anymore. whenever i start the game up it freezes my computer for a bit and closes the game and steam. please help ;-;",
            "review_score": "1"
        },
        {
            "review_text": "Great tool for game development, it's really easy to use and the interface is great",
            "review_score": "1"
        },
        {
            "review_text": "Interesting engine, a lot of stuff is hard coded in it or not easily adjusted, if your trying to do something other than a classic rpg you might want to look elsewhere or at the newer version.  If you just want to be able to make a simple classic rpg for yourself and don't know much about scripting/coding/art/animation/etc this is really easy to setup and get started.  As for scripting in ruby. I made a couple simple puzzle playtests and a stealth system for it without knowing any ruby before hand, its pretty easy to pickup if you have some coding experience.",
            "review_score": "1"
        },
        {
            "review_text": "I think my hours used say it all- this is the best tool out there for creating old school 2D RPGs. It's tons of fun to drag and drop stuff onto the map and create your own enviornment, add special effects and create your own enemies and battles. It's very easy to create basic things but at the same time there are many ways for more advanced developers to create professional-grade games. There are many games here on Steam made with this and the other RPGMaker engines.   The reason I like VX Ace more than the other ones, including the newest one 'RPGMaker MV' (which I also recommend) is that it uses Ruby as its scripting language. Ruby is a pretty easy language to learn and it's my favorite language to use. Using Ruby you can create just about anything you want in this engine, and there's a text editor/ script manager built right in.   There are tons of graphic resources included with this engine and there's a character generator that allows you to make your own characters. Overall tons of fun to use whether you want to create a commercial game or just make stuff for fun. And if you do want to create a commercial 2D RPG, there's no reason to re-invent the wheel and program everything from scratch. This engine will do most of the heavy lifting for you so all you have to worry about is creating your game content, and you can easily upload your own graphics into the resource manager.",
            "review_score": "1"
        },
        {
            "review_text": "Getting the storyboarding done and then I'm going to utilize the crap outta this :D",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on sale for about 7 bucks. You can do pretty much anything with this game, totally worth. I recommend getting this game on sale.",
            "review_score": "1"
        },
        {
            "review_text": "it's good",
            "review_score": "1"
        },
        {
            "review_text": "I am coming up with my new RPG GAME, im so ready for it and working hard! i loved this software that giving me chance to make my own game! RPG Forever! keep in touch to know about my game!",
            "review_score": "1"
        }
    ]
}