{
    "app_id": 220820,
    "name": "Zombie Driver HD",
    "release_date": "2012-10-17",
    "developer": [
        "Exor Studios"
    ],
    "publisher": [
        "Exor Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Stats",
        "Steam Leaderboards"
    ],
    "genres": [
        "Violent",
        "Gore",
        "Action",
        "Indie",
        "Racing"
    ],
    "tags": [
        "Zombies",
        "Racing",
        "Action"
    ],
    "achievements": 103,
    "positive_ratings": 2050,
    "negative_ratings": 381,
    "price": 6.99,
    "description": "Insane mix of cars, speed, explosions, blood and zombies! Fight through an epic narrative campaign or test yourself in the Slaughter and Blood Race modes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/220820/header.jpg?t=1491410895",
    "minimum_requirements": "OS: Windows 8/7/Vista/XP Processor: 1.5 GHz dual core processor Memory: 1 GB Graphics: 256 MB DirectX 9.0c compatible or better video card with pixelshader 3.0 DirectX®: DirectX 9.0c Hard Drive: 2 GB Sound: DirectX 9.0c compatible sound card",
    "recommended_requirements": "OS: Windows 8/7/Vista/XP Processor: 2.0 GHz dual core processor Memory: 2 GB Graphics: 512 MB DirectX 9.0c compatible or better video card with pixelshader 3.0 DirectX®: DirectX 9.0c Hard Drive: 2 GB Sound: DirectX 9.0c compatible sound card",
    "reviews": [
        {
            "review_text": "This is a strange little game really - it's kind of like super sprint and micro machines but in a sort of open world setting where you do missions which involve driving from A to B and you have to kill as many zombies as possible. Its a great little mish mash of genres to create something a little bit different and it works. It even has boss fights too.   It also has a racing career mode too and the races are kinda nuts really as you try stay in front, kill zombies and win to earn more money to buy better cars, upgrades and weapons.   The only real con to the game so far is the poor voice acting but then I didnt buy this for the voice acting or immersion really. I just wanted a fun little game to go between other games that didnt require me to amass an encyclopedias worth of knowledge about builds, techniques startegies etc but would let me rip loose and feel like a boss. This game does that.  It aint no FORZA but then you don't get to kill zombies in FORZA. brought it on sale - totally worth the money.  ---- edit --- and still loving it a few weeks later. Ace game to go to everynow and again for thoughless violence",
            "review_score": "1"
        },
        {
            "review_text": "Look like GTA top down style view but it's still very interesting! :'&gt;",
            "review_score": "1"
        },
        {
            "review_text": "How many ways are there to kill zombies now? A lot more than there needs to be, that’s for sure. I was socially inept enough to jump on the zombie bandwagon before it was cool, back before 28 Days Later and the Zombie Survival Guide brought them back from their long post-Thriller twilight. I’ve cooled on them enough that zombies as a bullet point is more likely to drive me away from a game, so keep that in mind while I explain just how much I enjoy Zombie Driver HD.  The main draw of Zombie Driver is the story mode, posing you as a nameless motorist in a city beset by the undead plague. Every mission takes place on the same wide-open GTA-style map, sending you to different areas to rescue survivors, destroy zombie strongholds, or defeat enormous bosses. Ramming is sufficient to splatter most zombies but for bigger targets there are weapon pickups scattered all over, giving you machine guns or flamethrowers to cull the hordes with. You’ll also find repair pickups (which you will need because damage can come in huge bursts) and money, used between missions to upgrade your cars. And that is cars plural, because you unlock sports cars and limos and police cruisers over the course of the campaign. There’s not a lot of variety in the missions and the characters are all voiced so badly it’s funny, but they make simple excuses to run over thousands of zombies.  The driving really is the best part of the game, appropriate for a game called Zombie Driver. Your vehicles are different degrees of responsive but all are fast and all make satisfying messes out of the undead. You’ll fight different kinds of zombies including dogs and giant exploders and worse, and they all erupt into fountains of giblets and leave crimson streaks on the pavement. It’s a viscerally satisfying game, even if the sound effects aren’t always up to the task of capturing the slaughter. Weapons do tons of damage and clear out crowds, and you get mounting monetary bonuses for long streaks of carnage. Much like in Carmaggeddon, It’s easy to lose track of mission objectives just because you’re having so much fun roadkilling things.  The HD in the title does indeed mean this is a remaster of a previous Zombie Driver, but with more going for it than just prettier graphics. The campaign is longer, with a full 31 missions and several new bosses to battle. There are new vehicles as well, which can also be used in the game’s Blood Race and Slaughter modes. Blood Race is, again, much like Carmaggeddon where you race against other cars, crushing zombies and blowing up your opponents to progress. Slaughter is you against mounting waves of zombies with its own progression system of weapons and upgrades. You’ll find plenty to keep you busy as long as you enjoy plowing through zombies, and when it’s done this well there’s really no reason not to.",
            "review_score": "1"
        },
        {
            "review_text": "Its mindless fun, just go kill stuff. Great to pass time or just play when you dont feel like anything. But I only reccomend it when its like 75% off or more.",
            "review_score": "1"
        },
        {
            "review_text": "Zombie Driver HD. well first of all this game is not 3D but its sooo Awesome because its also same like L4D2 or Dead Island but this time its with Cars!, and i have to say This game actually made my day if im feeling a little bored for some reason and yes i Recommend that game to play.    Rating:9/10",
            "review_score": "1"
        },
        {
            "review_text": "[NOTE: All of my reviews are based off of value for money/comaparison to price. I purchased 'Zombie Driver HD' for 69p with a 90% off voucher.]  To start. This is one of those fun little games that you would play when you don't have enough time to play a missoin on a bigger game but want to play something. (Damn those poorly timed meetings.)  Story: A zombie acopalypse strikes. You are a taxi driver in a large city who is saved by the army. However, the army is limited and you are needed to assist in rescue efforts and clearing zombies out of certain areas. You car can be outfitted with various weapons and armour types. You can unlock new vehicles by completing secondary mission objectives.   Gameplay:  There are powerups/healthkits/weapons that you can collect around the map in a mission to make it a bit easier. You can Run over, Burn, Shoot and Blow up as many zombis as you can. There are also minigames such as races and wave survival. It is fun to play for those timess you are bored and want to play a full campaign.",
            "review_score": "1"
        },
        {
            "review_text": "Stupid amounts of fun, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I actually really like this one. Not sure if there's anything bad to say about it. It's not your Triple-A title with a rich plot and surprisingly innovative gameplay but I don't think that it intends to be that. If you want to let off steam, this is it. Kinda like Nation Red, only in a car.  Quality is also very good, visually and technically. Oh, and good controller support; playing it with a Xbox 360 controller.  One of the few games I like to get back to now and then and still enjoy it. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Very entertaining game. Has 3 game modes and multiple vehicles. Story mode has 31 missions and they are kinda short. Race mode is a little difficult on my opinion, but fun as well. Slaughter mode is great but a little exhausting. The gold score is high and you get points very slowly. But you get used to it and actually don't even pay attention to the score while playing. Really enjoyable. Better than I expected. Great addition to my library.",
            "review_score": "1"
        },
        {
            "review_text": "it's alright.",
            "review_score": "1"
        },
        {
            "review_text": "7.5/10 What an awesome little game. Easy in, easy out... I enjoy little bursts of this while waiting for friends to come online to play + I only paid .99c for it. Supper Value!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the biggest example why graphics isnt everthing.",
            "review_score": "1"
        },
        {
            "review_text": "The title of this game basically tells you all you need to know about the gameplay: run over zombies with your selected vehicle. You run over zombies or kill them with weapons attached to the vehicle while completing primary and secondary objectives in the story mode.  The story mode has a basic plot that is very typical for zombie based games, not ground breaking. It looks like another apocalypse. Your mission begins with a briefing from General Blofeld that you must clear out an area filled with zombies or rescue certain people who are being overwhelmed by zombies. As you go about your mission, you run over zombies while your vehicle gets covered in blood and earn combo bonuses. These combo bonuses continue to multiply if you continue to mow down zombies in a bloody mess, something like chaining your matches in Audiosurf. The top-down perspective looks like the first 2 Grand Theft Auto games and the action looks like the Carmageddon series since you are constantly causing a bloody good time around town.  The weapons are scattered around town and all are pretty useful. They include flamethrowers, machine guns, railguns, rocket launchers, and nitro. All weapons can be upgraded using the cash you earn from each mission completed. The nitro really speeds up your car and helps you reach your destination faster, but it is also useful in getting out of a tight situation when being overwhelmed by large numbers of pedestrians that could potentially make your car explode.  Vehicles are varied and range from taxis to buses. Some vehicles are more useful than others in some missions. The military may ask you to rescue 8 people in a given mission, so the best vehicle could be the bus because it has a carrying capacity of 48 people. All vehicles can be upgraded for more speed and better ramming ability. Even with the variety of weapons at your disposal, ramming zombies with power slides and using nitro to go full speed ahead is still more common than shooting.  The zombies range from regular zombies to exploding zombies. The regular zombies are small or medium in size and there are many zombie dogs run over. The real challenge comes in the form of exploding zombies. Exploding zombies are the fat zombies who can detonate themselves when they get near your vehicle. You can be earning great combos while killing 300+ zombies, only to be ruined by a group of 3-4 exploding zombies who commit suicide next to your vehicle, causing it to explode.  There are a few bosses to battle in the game. These bosses can only be defeated with enough firepower using the various weapons in town. It is also necessary to use defense by running away from them when they are ready to attack. A lack of defensive moves will lead to certain death. In addition, the zombies will never leave you alone during boss battles. So, while you are running away to restock ammo the zombies are chasing you. When you are firing away at the bosses the zombies are still attacking you.  There are other modes in the game that add to the zombie splattering fun. There is the blood race mode and the slaughter mode. The blood race mode is about tournaments that require you to compete in different events such as races, eliminator, and endurance and have bronze, silver, and gold medals available. Races require you to finish 1st for gold and you can destroy vehicles by ramming them or with your weapons. Eliminator events require you to cause as many wrecks as possible while going through checkpoints to increase the time remaining. Endurance events require you to drive around with a bomb stuck to your vehicle going through checkpoints to increase the time remaining. The trick in Endurance events is to kill zombies and destroy as many objects as possible to contribute to the time remaining. The slaughter mode is a good old fashioned zombie killing, splattering entertainment. It is all about killing as many zombies as possible from one wave to the next until your vehicle explodes.  The graphics are decent and, while not dazzling, they provide a well-detailed environment. The death animations look cool and make you feel like it is so much fun making your vehicle all red in blood and guts. You can hear the zombies writhe in pain very loudly when you splatter them all over your vehicle or when you blow them away with your weapons.  The vehicles handle well, as the physics feel realistic during the times you have to turn and perform power slides. They also feel realistic according to the type of vehicle. The muscle car feels very fast whereas the bus feels slow, but very powerful for ramming zombies. The super car feels like it is both fast and powerful since it combines all the great attributes of speed and power.  Some may be disappointed by the fact the Zombie Driver HD has no multiplayer. True, there is more replay value after playing the story mode because of the blood race and slaughter modes. However, those who love multiplayer action will not have any opportunity to compete in multiplayer mode.  I think Zombie Driver HD is a lot of fun to play. The story mode feels a little bit short in length, but it is still entertaining enough. The blood race and slaughter modes provide more entertainment and replay value for a low price of $9.99. All the zombie crushing and splattering fun makes this game worth your purchase.  My Score: 7.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Nothing innovative, nothing impressive, but it managed to give me the thrill and excitement of driving around a decently rendered city in a badass vehicle and killing ♥♥♥♥♥♥♥♥s of zombies while doing it, for me, that's simply enough.",
            "review_score": "1"
        },
        {
            "review_text": "Only get this game if you have a gamepad game has keyboard controls but it's not precise enough in my opinion. also of note is that keyboard controls can't be configured although I worked around it by using autohotkey.  recommended because I can't say I'm not recommending it with the very little I played (yes I'm missing a gamepad)",
            "review_score": "1"
        },
        {
            "review_text": "Ive finished the main story now. Almost a good game... Some fun, but the Cut Scenes are the MOST ANNOYING I have EVER seen. You cant skip them, even when repeating a mission. I cant believe that they would put such a stupid restriction on the game (and from what I have heard, they WILL NOT change it, despite many complaints). They are TERRIBLE. The voice acting is poor (it comes across as cheesy / fun the first time or two), and the cut scenes ruin the pace of the game. Not to mention the stupid difficulty changes in each mission. And Im SICK AND TIRED of every ♥♥♥♥ing mission being timed in one way or another. Create a game that is potentially fun, then not allow you to actually enjoy it (except in other game modes maybe). Would have gotten an 8/10, but I have to give it a 6... it does its best to ruin the long term (replayable) enjoyment of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for carnage fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, worth my 3 bucks, killing zombie is fun",
            "review_score": "1"
        },
        {
            "review_text": "Very lucky get it in promotion price very nice to play, challenging and recommended to play.",
            "review_score": "1"
        },
        {
            "review_text": "Have player through the campaign. My review is: Absolutely fantastic!!!! 10 out of 10 as a platformer. Addicting gameplay, good graphics, great variety of missions and adversaries. I could not wish for more. This game is simply a must buy for everyone who likes zombies and racing.",
            "review_score": "1"
        },
        {
            "review_text": "Nice game",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth the money. Very fun game. Love killing zombies.",
            "review_score": "1"
        },
        {
            "review_text": "Simple mindless fun.  Just drive around and mow down zombies.  Car mechanics are well made and fun. Objectives are decent enough. Not much to the game but does it well enough for the price.  Figured i needed a game like this for when the mood stikes, would recommend for others in need of a top down arcade game like this.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic improvements over the original game; day/night cycle, weather system, longer campaign and missions, new weapons, new mobs + bosses and new awesome vehicles like the tank (which kicks ♥♥♥ ofc) and the firesquad car... If you liked the first game, this is definitely a must buy and even if you never heard of the original, still is a must buy (cheap @ IG for 1$ atm)",
            "review_score": "1"
        },
        {
            "review_text": "So I got this game because I got a coupon for 50% off and thought why the hell not. It's been a pretty fun game so far but I have to say the gameplay is not that versatile. The missions u have to do are pretty much the same the entire time. You either have to pick up some survivors or destroy some zombie nest. And at times it feels more like your just focussing on collecting health and ammunition for most parts of the mission. The game on the other hand reminds me a bit of the very first GTA, and who doesnt like a bit of nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "If you like killing the undead with cars that has gun on the hood, YOU! will love the shooting cobo, you will love Zombie Driver HD",
            "review_score": "1"
        },
        {
            "review_text": "This game perfectly blends old school top down GTA with brutal mass zombie slaughter. You drive cars equipped with machine guns, flame throwers, rockets, shock weapons nitro boosts and more. There are plenty of weapons, vehicles and game modes to choose from. The great thing is that for those that grew up with GTA 1 and 2 on the playstation 1 there actually is a 'retro camera' mode where the free camera will fix itself just as the good old days.  The game is only 10€ and when on sale it goes down to 3€ INCLUDING all the DLC. This game is dirt cheap even at 10€. The story mode is well thought out, voiced, filled with multiple giant maps and a wide variety of different missions. On top of the pretty extensive story mode there are a ton of challenges, zombie killing combo modes and even races! The death races are crazy fun and brutally hard and those alone will keep you busy for quite a while. What's even more incredible is that for that small price tag, you don't only get a game jam packed with content, it actually looks really damn good too! Better than most more expensive games.  It's seriouslt almost a crime not to pick this up, especially when you are running into it when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Zombie Driver HD's relatively low price point and reasonable replay value make it easy to recommend, so long as you aren't expecting something of full retail quality.",
            "review_score": "1"
        },
        {
            "review_text": "it scary",
            "review_score": "1"
        },
        {
            "review_text": "cars, zombies and weapons!",
            "review_score": "1"
        },
        {
            "review_text": "very funy when driver over car in the city of zombie",
            "review_score": "1"
        },
        {
            "review_text": "A mindless zombie killing game. Best described as lizard brain porn (you don't need to conciously think about it, but it still is pleasing).",
            "review_score": "1"
        },
        {
            "review_text": "This is a very addictive game, buy it play it. You won't be sorry!",
            "review_score": "1"
        },
        {
            "review_text": "it is a great game, i recommend. every missions is diferent and i don't geat bored of playing this game.",
            "review_score": "1"
        },
        {
            "review_text": " Bottom line:  An enjoyable and attractive, if somewhat frustrating, top-down driving game in the vein of the original GTA games. Has less complex missions, however spices things up with seriously large hordes of zombies to brutalise with heavy weapons!   Pros:    Video and audio are generally pleasing. The maps and vehicles have a lot of gritty detail and weather and lighting effects are put to good use. The particle and gore effects are suitably over-the-top and make firing rockets into zombie mobs a very satisfying experience.   Multiple game modes provide a great amount of content for the price and also offer a variety of experiences. This is a good thing, because the story missions generally feel much the same. In particular, I found the Slaughter mode (arena) to be challenging and required both tactical and strategic thinking to reach round 20 and beyond. Racing includes a variety of different events, in which the aim is either racing, destroying opponents, or driving as far as possible with a bomb attached to your car! Sadly, I found all modes spoiled more often that not by the difficulty in identifying 'hard' obstacles and the unpredictable handling of the vehicles during collisions.   Weapon variety is decent and effective, but fairly uninspired. Power-ups are all incremental improvements until the last level, where power is doubled. Specialisation usually plays second fiddle to whatever happens to be lying around your general vicinity at the time.   No crashes in the ten or so hours spent in game (Windows 8).    Cons:    Unpredictable behaviour when hitting walls and other obstructions; sometimes you bounce, sometimes you stop dead, sometimes you instantly spin 180 degrees. A little frustrating in the main game, immensely frustrating in the race events! Came close to rage quitting a few times in this mode... Apart from this, the controls are fine (used M&amp;KB).   What 'story' there is remains utterly predictable throughout and voice acting is excruciating. I am sure its tongue in cheek, but its still horrible.   Performance drops and wavers noticeably once there are a  lot  of zombies on the screen. This is mainly an issue in arena mode, where huge hordes are a common occurence. This is on an i5 3570K with an AMD 6950.     DLC:    Mostly forgettable...   The included vehicles are overpowered and spoil the progression of the story mode a little.   If you are still looking for more of the same  after  completing the game, you won't be disappointed with the additional race and arena maps. If you are expecting something different, don't bother.  ",
            "review_score": "1"
        },
        {
            "review_text": "I Picked this game up on sale.  Lots of fun and works nicely with my xbox controller! I enjoyed playing it when I'm board of all my more time demanding games.  I recommend this it for its price and entertainment level it well worth the buy! ",
            "review_score": "1"
        },
        {
            "review_text": "Good game! UPG racing ... alot of dead people there, survival mode and story mode.   Rate: 8.4",
            "review_score": "1"
        },
        {
            "review_text": "Simple yet addictive guilty pleasure, Worth the 10 bucks (5 if you own the non HD version).",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful Game , Insane mix of cars, speed, explosions, blood and zombies!",
            "review_score": "1"
        },
        {
            "review_text": "Fun arcade style shoot 'em up game. Better with a controler IMO as the controls can be kinda twitchy with a KB/Mouse setup. Very fun romp.",
            "review_score": "1"
        },
        {
            "review_text": "Fun remake of Zombie Driver and more stuff and vehicles to play and more achievements great game :)!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "this is the love child of Carmageddon and Grand Theft Auto",
            "review_score": "1"
        },
        {
            "review_text": "buy this game cause its good.",
            "review_score": "1"
        },
        {
            "review_text": "Can't stop playing. Worth more than what I paid for.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome game i love it and hope you all buy it get it so awesome thanks so much makers of it wish i had the money to buy it right now but thanks to family share i can play it thank you so much",
            "review_score": "1"
        },
        {
            "review_text": "This game was fun. I finished the story mod in 8 hours, so it could be longer. But there are other mods to try.  Missions are very similar, drive to escort someone or kill something. But the cool HD graphic and the satisfying feeling when you drive through the big horde is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Reminiscent of the original GTA. With zombies.  Also reminiscent of the old 1980s DOS game Autoduel, but in color. And with zombies.  Flamethrower ftw.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Extensive content, variety in gameplay objectives (though simple), and overall good execution of devlopment. Fair value, too, and honestly the only time I've ever wanted a game that Steam gave me a coupon for! I have two complaints, however: the controls take a bit to get used to, and those who aren't familiar with any sort of top down driving game may have trouble adapting to them, and second, the voice acting is just an abomination. I digress, as this game is very fun and can provide many hours of gameplay and many millions of SLAUGHTER FODDER! :D",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this game is not great but its not bad either. If you just want some mindless top down driver combined with zombies, go for it. It will get tedious over time so I ended up playing a few missions and then coming back to it months later. There are a few different game modes: story, races, etc. each of them are quite good but you will find yourself playing a few hours and getting fed up.",
            "review_score": "1"
        },
        {
            "review_text": "The camera is a bit dizzying at times and the controls take some getting used to, but the graphics are great and the arcade gameplay is bang on.   It took me two years to figure out that since the game requires you to manually select your video card model from a drop down list in order to wok, upgrading or changing your card after you've installed the game will cause it to break. I manually selected my actual graphics card, and voila, after two years the game finally works. Nobody got back to me and the forums came up dry on this issue. Gave it a bad review at the time because of this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simple to play, there are three different modes to try it works well with a controller and has plenty of achievments to get not mention trading cards, just a little repetitve but still a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "If you like twinstick shooters you should like this, up there with renegade ops.  Worth grabbing with all DLC and its not expensive.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad game but the trading cards have horribly price.",
            "review_score": "1"
        },
        {
            "review_text": "It funny, When i kill zombies with machine gun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, and I enjoying to play it from time to time. Beware that this game is CPU Bound, and to get decent framerates you will need a decent CPU.",
            "review_score": "1"
        },
        {
            "review_text": "This game is still good",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, a lot really! It's just... ZOMBIES! What else can I say tough... It keeps you in constant seek of achievements, 100 achievements to unlock and do all possible to get them. It's a bit annoying some of them and also throughout the story, but far from that, it entertains you for a lot of time. I recommend it to those that are patient and wants to complete everything! Good luck unlocking all achievements!",
            "review_score": "1"
        },
        {
            "review_text": "This game is briliant fun and that's the key word- FUN!  I didn't know much about it, but bought it during a Steam sale for £1-09 sterling, very cheap including all the DLC.  There is a campaign mode, a slaughter mode and a racing mode. So far, i've only played the campaign mode.  I use an XBOX One controller under Windows 10 without issue.  The gameplay is frantic, yet easy to deal with. Plenty of gore, pickups and great visuals. The overall presentation, including the music reminds me of an AAA release.  If you want an immediate, fun game for not much cash, then take a look at this game.  Thanks.    ",
            "review_score": "1"
        },
        {
            "review_text": "Right, well it's miles better than the first one anyway! Which is to say, it's not a great game by any means, but it's certainly... playable.  Basically, y'know Micro Machines: Military Madness? What's that, you don't? Oh, it's this really great (as I remember it) Mega Drive tank racing game! Well anyway, this game is like that game... but not nearly as good. Go play that instead.",
            "review_score": "-1"
        },
        {
            "review_text": "ZOMBIES ARE NOT THE ENEMY. THE CONTROLS ARE.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is more of an arcade type of game with not very many upgrades. Also the gameplay wasnt even that great. Honestly the only slightly cool thing in my opinion is the zombie bosses. This is more of a game for people who like a challenging driving game and pick up upgrades on the side of the rode. Personally I dislike it and I didnt know what I was expecting when I bought thankfully I got it when it was on sale for a cheap price but I still wouldnt suggest it to anyone of my friends though.",
            "review_score": "-1"
        },
        {
            "review_text": "Gave it a shot- it was $2.49... its ok. cars handle differently, and hitting zombies with them has impact. Racing mode was fun (single player only). i didnt try the arena mode. Story mode has zero variety, but thats forgivable i guess, you drive around killing zombies and pick up powerups and upgrade your car. the thing that makes me NOT recommend - is that i break out into cold sweats from getting dizzy while driving. i think this may be due to the camera... if i played this for an hour i think i would throw up and need to lie down. i dont know - that may be just me... but other top down games like Nation Red or Gatling Gears, did not make me feel this way. too bad. it had some things going for it. maybe playing a mission once in a while or playing a race when waiting for a download or something would be cool. i also liked that it had full controller support, thats always nice to have in a game. But overall - if you are sensitive to cameras spinning without your input- i would avoid.   EDIT: OK i went back and tried 1 more mission - with the 3rd and last camera option.... Free Camera mode is a little better. And the game threw a Defend this Area type mission... but its still made me dizzy a bit. I think the camera is too close and has to adjust itself too often since you can be driving quite fast. so yea.... i still would not really recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "Stopped playing due to the awful camera-movement. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Don't buy this game. It has its fun moments, but there are way too few of them and most of the time you're bored while playing it. The levels have no gimmicks, no variety, nothing. Just skip it.",
            "review_score": "-1"
        },
        {
            "review_text": "not really that great of a games. So many better options out there. Design is really lacking. Doesnt create a desire to keep playing.",
            "review_score": "-1"
        },
        {
            "review_text": "As I write this review I'm on the verge of vomiting. Not because I'm being over dramatic, but because I'm literally nauseous from playing this game. I thought it was just me until a read another reviewer suffering the same symptoms. The graphics, theme, and content of the game are fine. But it's the gameplay that made me sick which consists of you driving endlessly round, and round, and round... Oh gosh I'm making myself sicker just thinking about it.  Perhaps if the maps were bigger and had a better layout, I would have no complaints. But because of my negative experience I say stay away from this game if you get car sick easily. It's too bad because I was looking forward to this game. At least I only paid something like $2.  By the way I just took a pill for motion sickness and I hope it kicks in real soon.",
            "review_score": "-1"
        },
        {
            "review_text": "My Playstation 2 called from the garage and wants it's ♥♥♥♥♥♥ game back.",
            "review_score": "-1"
        }
    ]
}