{
    "app_id": 2210,
    "name": "Quake IV",
    "release_date": "2011-08-04",
    "developer": [
        "RavenSoft / id Software"
    ],
    "publisher": [
        "Bethesda Softworks"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Action",
        "Shooter"
    ],
    "achievements": 0,
    "positive_ratings": 891,
    "negative_ratings": 171,
    "price": 12.99,
    "description": "The latest chapter in the Quake series is now on Steam!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/2210/header.jpg?t=1543499387",
    "minimum_requirements": "Operating System: Windows® XP  Processor: Intel® Pentium® 4 2.0 GHz or AMD® Athlon® XP 2000+ processor or higher Memory: 512MB RAM Hard Disk Space: 2.8GB of uncompressed free hard disk space (plus 400MB for Windows® swap file) Video: 100% DirectX® 9.0c compatible 64MB 3D hardware accelerated video card required Sound: 100% DirectX® 9.0c compatible 16-bit sound card and latest drivers DirectX® Version: 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Semi-Nostalgia distant planet fps, that turned out to be quite decent, Quake 4 brings you a terrific game with graphics from the early 2000s, and gameplay at it's finest. You are Corporal Kane, and here brings you this mission: drive the strogg, your enemy, back to hell!  I first got this game in 2006 (not on steam), after my dad showed me the quake series with him. I thought the game was truly one of the top-dogs back then, the storyline was actually very well detailed, combat seemed smooth, and difficulty seemed well played (despite that those spider enemies make me want to kill myself half the time). The weaponry you are given seems very well flexible, the machinegun wasn't very useless, the shotgun didn't seem useless, and balancing your ammo with every gun seems very thorough. Quake 4 also has multiplayer (but noone really plays that anymore).  The few boss encounters in this game seemed very difficult at first, but after a while, it isn't really that bad, considering a few enemies late in the game have the same complexity as one or two bosses. The ways to kill every boss seemed interesting (noticing every boss in the game has a health bar, so I think there is 3 or 4? There may be more, but those are enemies you'll never see a lot as you walk around on the battlefield) and the final boss was the most interesting, along with the story that went with it.  Yet, I could see a little improvement, since I'm told there might be a new Quake (there is a new Doom coming out), I did see some slight errors with the game. The game's AI that are on your side seem to be a little wonky at times, sometimes they'll be overpowered, sometimes they won't. The enemy AI rarely screws up, and when it does, you'll sometimes need to literally restart a checkpoint, which could get frustrating. All-in-all, I didn't see that many glitches/bugs/exploits in the game.  The level design for almost every level seem very organized, balanced, and smooth. Early in the game they don't throw that many obstacles in your path, but later in the game, they'll toss in a hefty amount of enemies, spiced up to hardcoreness. As I mentioned difficulty earlier, there are four difficulties to the game (pretty simplistic, right?), Private for the easiest level, and General for the hardest. I've only played on the mid-tier difficulties, Corporal and Lieutenent (Normal/Hard). Both of the mid-tier seem very easy to play after you've had a chance to deal with every enemy. Fighting each boss on the easier difficulties, you'll know what to do on harder difficulties (bla bla bla).  Is this worth the price tag? If you really want to wait for a sale, I'd wait for a seasonal sale, or quakecon sale. It's definitly worth the twenty dollars if you're looking for a decent challenge, and a game that's somewhat old, but actually feels smooth.",
            "review_score": "1"
        },
        {
            "review_text": "For people who liked Doom 3, but don't like using a flashlight. I hope you like killing alien mutants because you're going to be killing a lot of them. And it will never get old.",
            "review_score": "1"
        },
        {
            "review_text": "Quake 4 took me by surprise. As soon as I started the game, I was immersed in my role as Kane. A certified Bad ♥♥♥ marine. The only odd thing about this game is that Kane never says a word, lol. Everyone just keeps talking around him as though he was a mute, he he.. A seasoned marine, and always determined to complete his mission; Kane goes through a very painful (you better believe it!) and cruel transition at the hands of the Squids while captured. However, that didn't stop him from completing his mission. As it turned out, Kane's new body was a blessing to his superiors. Kane would be able to infiltrate the Stroggs defenses and ultimately destroy the heart of the Nexus, which controls all Stroggs and all valuable information sent to them, thereby, creating confusion. With an arsenal of unique and powerful weapons, Kane along with the rest of the marines set out to destroy the Strogg and their never ending torture against mankind.  The graphics look great. The voice acting is also great. There's lot of action and of course, different modes for you to choose from. If your choosing hard, remember to *fast save* whenever you can. A great feature, which is a big PLUS. I hate repeating the whole level over and over again. Use Xpadder or other program for controller support. I played this game on the Xbox many years ago and I can honestly say that this game deserves a well thought out sequel. I highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the best singleplayer campaigns I've ever played. Loved this game since when I was 10.",
            "review_score": "1"
        },
        {
            "review_text": "Configured properly this game still looks good in 2016.   Q/4 ",
            "review_score": "1"
        },
        {
            "review_text": "A really great game! I love the very epic and scary story, it's way better than the Quake 2 story. While the quake 2 story had a lot more hero feel, this has the more realistic war feel. Both are good. I personally like Quake 2 as a game more, but like the story of Quake 4 more. Awesome enemy designs, awesome weapons designs and ♥♥♥♥ING awesome music. So yeah, a really great game. sad that there probably won't be a Quake 5. But if you like SCIFI games and kinda old school gameplay, then I recommend it for you.",
            "review_score": "1"
        },
        {
            "review_text": "Not the Quake we were hoping 4  As a sequel to Quake 2 the story is very good. The gameplay, level design and voice acting however leaves a lot to be desired.  Lets mention the bad.  The vehicle and turret sections are just garbage. There's just no other word for it. Luckily they are usually quite short when they happen. Theres some sequences where you walk around base listening to other people. Something that was done quite well in the Half-life games and Doom 3, not so wellmade here. I just felt like they were holding me back from actual gameplay. Exposition in other parts of the game was done over radio, they should have kept it all that way. This game also has a sneak button rather than a run button. In a game without stealth this is completely useless.  Lets mention the good. No reloading health. Thats actually one of the few modern FPS tropes this game did not use and thank all that is holy for it. The parts where you just walk around and shoot thngs are pretty good. The settings and mood is overall really well executed. It's very much a mix of Quake 2 and Doom 3 going on in the looks department.  I don't regret playing it but I'll never play it again.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game, awesome gameplay, I just don't like the part where you drive the mech. I mean I do like mech games/robot games but the part where you drive the mech is really hard to stear. Must get game.",
            "review_score": "1"
        },
        {
            "review_text": "One of id software's best games.",
            "review_score": "1"
        },
        {
            "review_text": "I know that is the weird graphic. But I have felt the Quake atmosphere from that. I can't tell more about that game.   Good things:   -Low hardware require.   -Enough horror + sci-fi atmosphere and story.   -Easily find the way forward.   Bad things.   -Too short Single-Player.   -Too less play in Multilayer.   -I guess there was too dark, but I might that was the concept of the developer.   I recommend this game all those who liked the Quake series, because there are many of Quake feelings.",
            "review_score": "1"
        },
        {
            "review_text": "Background: I'm a big Quake fan, lot sof time spent in Q1 and Q2 plus their mission packs. I first got this game in 2006 when I bought a new PC. I actually got 2 copies. I bought one on DVD, then got a CD copy when I bought my video card :P I started the game but rage quit/bored quit as the game was slow to load and just boring. Years later I got a copy on Steam and as part of a challenge to play my backlog, I finally finished the game this year.  This game has a bit of a slow start, and years ago the game just ran slow. On newer computers the latter isn't as annoying allowing you to move into the more interesting parts sooner. This game was built from the Doom3 engine but it feels like the runt of the litter in some ways.  The game doesn't really shine till the 2nd half. I started off having to force myself to push on, but later I wanted to push on. I wanted to see where the story was going to go, I wanted to see what the next big guns would be .. what the next massive baddies would be, and even where the story would go! Lets be honest, this is a Quake game, people don't get into it for the story :P  Later on your various weapons get some useful upgrades as well as upgrades to you making you move faster etc. As I look back at the screenshots I took in January I see so many colourful scenes, I see a lot of gore and a lot of cool scenery waiting to be admired.  This is a game which went from thinking .. I'll finish it one day to thinking that I am definitely going to replay it, and soon!",
            "review_score": "1"
        },
        {
            "review_text": "Kinda brief but entertaining enough campaign. A bit Halo-esque, but def Quake. MP is still up and kickin if thats your thing. These guys make good shooters. Play on.",
            "review_score": "1"
        },
        {
            "review_text": "Old but still awesome!",
            "review_score": "1"
        },
        {
            "review_text": "An older game that I still particularly enjoy after starting it up again, recently. I used to have it hard copy, but not sure where it is now. If you like id Software, you'll likely enjoy this game, especially if you've played the Quake games before.  Be careful with newer systems and check out the forums for help with the graphics. You'll need to set up some options so that everything isn't ultra-low quality as the game is glitched a little. Somebody should do something about that.  But Quake IV is a fun FPS game. It can be pretty scary at times, and it even scared me more than Doom 3 did in many places. There are some scenes that are just... wow, like the Stroggification.  Check it out!",
            "review_score": "1"
        },
        {
            "review_text": "propper classic ya gotta love this game.",
            "review_score": "1"
        },
        {
            "review_text": "The game is good. People keep calling it the black sheep of the Quake series, but that title is taken by Quake 3.  This game is the sequel to Quake 2, it has a greaat story, great atmoshere and really good gunplay (I say really good, because I don't really like the shotgun all that much), and overall, it is a really good old-school shooter. In short: BUY IT.",
            "review_score": "1"
        },
        {
            "review_text": "This game will please fans of Quake 2 more than the original Quake. Gameplay is an improvement over the Doom 3 formula. Weapons are king here. Enemies can be slightly frustrating on higher difficulties, though. Overall, a worthy succesor to Quake 2.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game on xbox so i just bought it for my laptop, but i can't run it because it can't 'initialize opengl'",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would Get Yelled At By Extremely Ugly Looking Graphics Again  But in all seriousness, Quake IV has some of the worst graphics ever to grace a video game. I am running a ASUS PG279Q G Sync 2560x1440 IPS 165hz monitor and it only supports 1920x1080. This is also me playing no the highest settings, and it still looks like ♥♥♥. Also, the game doesn't support Steam Hub. I tried Shift + Tabbing a lot hoping it would do something but it never did. But that doesn't mean it's a bad game.  No, This is a really good game! Having played through Quake II, I really enjoyed what the game had to offer. Although this game is much less Quake and more Doom 3 Meets Military Shooter in Space with Quake Weapons. If you don't mind the change, I think you will absolutely enjoy it. I did. The weapons are there, your character gets a badass surgery that makes him even look more cool plus you get upgrades later.   I haven't tried multiplayer as I do not know if it is still supported. But Quake IV is a really good game. So here is the million dollar question. With Doom 4/Reboot coming out, when's Quake V/Reboot?",
            "review_score": "1"
        },
        {
            "review_text": "Well... this is a game with an identity crisis. Or with a bold vision of what it wants to be...but the experiment failed. Here's what Quake 2 would have been if it was made with the Doom 3 engine: more about the visuals than the gameplay. That saddens me, because the visuals haven't aged well and the game is left with nothing of value or note.   Quake 2 did frentic fast paced shooting with one-man-against-the-odds better, Halo and GoW did the 'chumy space marine' angle better. Countless other games have provided a better shooting feedback loop -- Turok, Halo, Half-life, you name it.  Quake 2 has so much more... heart, and it upsets me that what was meant to be a spirtual successor failed to point me towards any touchstones or even remind me of the earlier game at all. ",
            "review_score": "-1"
        },
        {
            "review_text": "I played this game a long time ago, and for some reason, I thought this would be more fun if I throw in some mods into the mix so I bought this game again on Steam.  It definitely doesn't live up to the legend of earlier Quake games. Hell, I can even say that this is Doom 3.5; it's too dark, too metallic and too slow.  Don't buy this, buy Quake II instead and blast sh*t on singleplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "A poor mans half life.  Imagine a game mixed with half life 2 and Call of Duty 4 with all of the good things taken out.   A bunch of cringe worthy military dialogue, a very disconnected story, a single marine doing EVERYTHING, boring weapons, boring enemies, you can only have a flashlight on your machine gun, and the frankly laughable options menu.  I imagine this game was a 'good enough' game back in 2005, however it just doesnt work in 2015.",
            "review_score": "-1"
        },
        {
            "review_text": "Seriously? No Controller option? Why would I want to go back to playing keyboard/mouse controlled games? What year is this? Definitely not good. Also, have a high-end workstation machine, somehow the graphics always reset to lowest quality. Very dissapointed.",
            "review_score": "-1"
        },
        {
            "review_text": "By far the worst FPS I have ever played. I can't believe this is part of the Quake series.  It starts off okay, but quickly the enemies become bullet sponges and your weapons are weak as hell. Pair this with the snail-paced movement speeds, and you have an extremely boring and tedious game.  It's a real shame because if they fixed the combat and movement (KIND OF IMPORTANT IN QUAKE), it could have been a respectable sequel to Quake 2.",
            "review_score": "-1"
        },
        {
            "review_text": "Quake 4 was one of the first games I played on my Xbox 360 around mid 2006. I wasn't expecting much out of it, even though Quake 2 is one of my favorite games of all time (but for its multiplayer, not its singleplayer). Plus the reviews of the 360 version of Quake 4 were pretty bad.  Even though it was indeed a bad port, I really liked the game. It was a good shooter with a nice weapon upgrade mechanic and a sweet story twist around the halfway point of the game. But now, in 2014, I'm afraid that it just hasn't aged well. I played Doom 3 before trying my hand again at Quake 4 PC, and Doom has aged much better. Quake 4's graphics look good from a technical standpoint, they don't have the crazy intense atmosphere of Doom 3 but they also don't have Doom's muddy textures. However from an artistic standpoint they're just...flat. Everything feels very generic, very 'been there done that.' The shooting feels like a relic from another era, your weapons feel powerful but you need a ton of bullets to take down your enemies and there's a lot of them, so in firefights all you do is shoot at everything that moves until they drop. No real tactics here, just shooting. What made those 90's shooters so satisfying is the crazy amount of stopping power you had at your disposal. The double barreled shotgun in Doom 2 can take out a whole room of low level minions if aimed correctly. THAT'S satisfying. Needing 5 shotgun shells to down one guy while his two or three buddies use you for target practice? Meh.  So, yeah, leave this one in the past.",
            "review_score": "-1"
        },
        {
            "review_text": "11 hours worth of 'meh'.  Would NOT recomend.",
            "review_score": "-1"
        },
        {
            "review_text": "I like Raven. Lost a bit of their touch around Q4, but still: I like what they do. You like gettin' yr FPS pew-pew-pew on? You'll enjoy Quake 4. The Doom 3 engine still looks stunning today, too.",
            "review_score": "1"
        },
        {
            "review_text": "I like Raven. Lost a bit of their touch around Q4, but still: I like what they do. You like gettin' yr FPS pew-pew-pew on? You'll enjoy Quake 4. The Doom 3 engine still looks stunning today, too.",
            "review_score": "1"
        },
        {
            "review_text": "Cool as ♥♥♥♥ and very under rated. You do nothing but kill ♥♥♥♥ the entire game. Hell yeah.",
            "review_score": "1"
        },
        {
            "review_text": "The alternate to DOOM, only in this game, they were able to afford more electricians to keep most of the lights still working.  It's time for another Quake, not another DOOM.  Good gfx, sound, weapons, level design is ok. Setting is nice (and like I mentioned earlier, a lot more of the lights are working compared to DOOM!!!) You get to use mechs and tanks; for me, these are the more difficult parts for me (I'm more for traditional fps, not vehicle combat). Some levels can be difficult at times, you get to a save point or have to quick save to save yourself from having to replay a longer section of the game over again, but now maybe your stuck with less ammo and health to take on a challenge. In these situations, you just have to play that challenge slowly and methodically, practice, make your shots counts (memorize the AI behaviors, anticipate them). Unless you've royally screwed yourself, then you may need to restart.  If you liked DOOM, you'll like this. It's basically a lighter (literally) sci-fi alternative to DOOM. DOOM was dark and demonic and it worked well for that. This is more fighting disgusting aliens (  &amp; becoming one,   an ugly duckling for sure) in a slightly more military themed environment, still heavy on sci-fi, though, and I like that. No health regen, just health paks. No ADS/iron sights (can we have another quake that has this, please?). This is more of a run (dogde vs. cover) and gun like the traditional/older FPS games.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Advise going straight in on hard as gives you quiet a challange.  Also bot ai is some of the best i've ever seen. Your squad mates are actually good (on hard any way ) and actually saved me a few times from things i didnt even know where there. Great game, great story and a really nice long campain that has lots of things to spice it up. Greatly recomend.",
            "review_score": "1"
        },
        {
            "review_text": "Great single player campaign!! Multiplayer is a bit boring though...",
            "review_score": "1"
        },
        {
            "review_text": "Like Doom 3 except with more shooting.",
            "review_score": "1"
        },
        {
            "review_text": "Great single player campaign!! Multiplayer is a bit boring though...",
            "review_score": "1"
        },
        {
            "review_text": "quake 4 the revengening please have mercy",
            "review_score": "1"
        },
        {
            "review_text": "First Quake game Ive played in 12 years. Not a bad little shooter game. Graphics are way out dated, but that is to be expected as this is an old game. Typical quake game, puzzle solving and bad-guy killing. Thumbs up considering it's age. Has multiplayer available, and surprisingly enough, ppl are still running servers for it. Have always liked the Quake series as it has always been the building block of today's shooter games",
            "review_score": "1"
        },
        {
            "review_text": "Quake 4 uses the same graphics engine as Doom 3, though it is arguably a better shooter (at least where the actual shooting is concerned). Not groundbreaking by any means, but great fun -- a real treat for FPS fans.",
            "review_score": "1"
        },
        {
            "review_text": "Better than Doom 3 in that it still focuses on rip-snorting gameplay with short bits of lore/story jammed in between. While I still prefer Quake 2 or 3 to this, its still a nice additional to the franchise. Wish it had better multiplayer, but still ok.",
            "review_score": "1"
        }
    ]
}