{
    "app_id": 221180,
    "name": "Eufloria HD",
    "release_date": "2014-10-14",
    "developer": [
        "Rudolf Kremers & Alex May",
        "Tuna"
    ],
    "publisher": [
        "Omni Systems"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Indie",
        "Relaxing"
    ],
    "achievements": 20,
    "positive_ratings": 351,
    "negative_ratings": 35,
    "price": 10.99,
    "description": "Experience “Eufloria HD”, the new edition of Eufloria, an incredibly addictive ambient strategy game that anyone can play! Explore a beautifully realized universe rendered in a style that is unique and compelling.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/221180/header.jpg?t=1447356646",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8 Processor: 1GHz Memory: 512 MB RAM Graphics: 128MB 3D Graphics Card with OpenGL support Storage: 400 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The original was already worth buying. Enjoyed every second completing it.  Surprisingly, after almost 2 years passed by, the game still can offer something plus that's worth discovering one more time.  Nevertheless there are new functions, abilities, and the game looks better than before.  Defo worth trying it if you never heard about it, and defo worth reinstalling and replaying if you already owned it!",
            "review_score": "1"
        },
        {
            "review_text": "Due to the downgrade of the control mechanics, I dont consider this an upgraded version of the original. However, its still as good as strategy can get. Clearly an underrated game, even by its own developers (took them over 2 years for the upgrade, no multiplayer...). This game deserves much more attention from the general public and its own developers.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Very mellow, if you're not careful you'll play it until 4am and not even notice.",
            "review_score": "1"
        },
        {
            "review_text": "Loved Eufloria. And now they have made it even better with Eufloria HD.  Great little space strategy game. ",
            "review_score": "1"
        },
        {
            "review_text": "I played the old eufloria;  It's an extremely simple RTS that can be surprisingly addicting and calming. It's not hard to learn, but some stages are difficult to figure out and took me several tries. If you like that, then it's definitely worth your money; the game is definitely not for everyone, if you're a mega-hyper child who can't sit down for 2 seconds, I doubt you'll enjoy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Simply Fun,  They added a few things since i last played its original version, and that adds to the already amazing gameplay it has. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "It's the exact same game as the regular one and it looks exactly the same too. Additionally, it has a new waypoint feature that makes it stupidly easy.  5/10  Doesn't help the exact same strategy works for 95% of the levels.",
            "review_score": "-1"
        },
        {
            "review_text": "Eufloria is an interesting, and often enjoyable game that could have been so much more. It's evocative visuals and haunting soundtrack make it a true sensory delight and the design concept behind it -- a mellow, minimalist RTS with an arboreal motif -- is inspired stuff. That's why its shortcomings, including abundant downtime and no multiplayer support, feel so frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "I love the way this game plays!",
            "review_score": "1"
        },
        {
            "review_text": "Stop upholding “fun” as the universal, ultimate criterion for a game’s relevance. It’s a meaningless ideal at best and a poisonous priority at worst. Fun is a neurological trick. Plenty of categorically unhealthy things are “fun”. Let’s try for something more. Many of the alternatives will have similarly fuzzy definitions, but let’s aspire to qualities like “edifying”, “healing”, “pro-social”, or even “enlightening”. I encourage you to decide upon your own alternatives to “fun” in games (while avoiding terms like “cool” and “awesome” and any other word that simply caters to existing, unexamined biases).",
            "review_score": "-1"
        },
        {
            "review_text": "Beautifully ambient RTS with consistent pacing. Basic but not too basic. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A slow and challenging yet rewarding little game. It is rather addictive to spread my seed ;-)",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game. Simple, yet challenging and very beautifully designed.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely relaxing. Not very difficult for the first few hours but some levels are very time consuming.",
            "review_score": "1"
        },
        {
            "review_text": "I've spent well over 100 hours playing this on console back in the day. I'm a little rusty at it now, but I have to say that this is one of, if not THE best, strategy game I've ever played.   It's not particularly complex; you are in control of seedlings looking to colonise asteroids in some distant future. You use seedlings to fight enemy seedlings, scout out out unknown asteroids and grow trees that allow you to populate your seedling army, or protect your own asteroid. Each asteroid has 3 traits that determine what attributes your seedlings will have when they grow; energy, strength, and speed.  That's essentially it, but with these basics rules the game becomes heart pounding. The first few sections are basic tutorials, but after a couple of hours you are waging wars against hundreds and hundreds of enemies, wars of attrition and patience. Holding key asteroids on the front lines, and managing which asteroids will become seedling producers and for what traits, becomes crucial in large battles. I've had games last for hours because of the attrition warfare, and because of how relaxed the game is. Timing is also key; do you rush an enemy asteroid in an instant to secure a quick victory, all the while leaving another asteroid unguarded? Or do you slowly build your force, moving from asteroid to asteroid, claiming each for your own in a slow but secure campaign?  The art style is a huge draw for this game. It's something I can't quite describe. With simplistic but vibrant colours, and a beautiful soundtrack by Milieu, the game lies somewhere between a surreal nature documentary and some kind of 1970's late-night cartoon fever-dream. I spent many gloomy days being absorbed into a kind of trance because of the visuals and sounds.   Overall I'd very much recommend this title if you are even a passing fan of RTS or somewhat relaxing games. One thing I will say is that I personally prefer using a controller for this, but it's equally as playable with a mouse",
            "review_score": "1"
        },
        {
            "review_text": "fun and simple",
            "review_score": "1"
        },
        {
            "review_text": "I really, really enjoy this game. It's relaxing but somehow still satisfying, even though the 'strategy' is pretty simple. I also *love* the soundtrack. I listen to Milieu outside of the context of the game it is so good. Really, really enjoy it and highly recommend the experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game magically appeared in my library (I think it's because I own the non-HD verson?) and its pretty fun. However for 15 bucks, maybe wait till it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I luv this game soo much ..   PLEASE .. I need something like Eufloria 2 !! :'D    Great work..   it looks awesome, the soundtrack is the pure relaxation, its very challenging from time to time but never too hard .. i just love any aspect of this game   best wishes from germany",
            "review_score": "1"
        },
        {
            "review_text": "I've played Eufloria classic and Eufloria HD to completion. This is a game that I enjoyed playing on my lonesome, it's simply beautiful and fun. For an indie game, I would say this is one of the most well made indie titles. The story is very lacking, however, Eufloria is, moreso, about relaxation and art. I would recommend this game for those who wish to complete all the achievements as it will leave you with about 8-12 hours of time spent well.",
            "review_score": "1"
        }
    ]
}