{
    "app_id": 22130,
    "name": "Hearts of Iron 2 Complete",
    "release_date": "2009-01-23",
    "developer": [
        "Paradox Development Studio"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player"
    ],
    "genres": [
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Grand Strategy",
        "World War II"
    ],
    "achievements": 0,
    "positive_ratings": 220,
    "negative_ratings": 48,
    "price": 9.99,
    "description": "Includes Hearts of Iron II plus the two expansions, Doomsday and Armageddon When Germany is defeated in 1945, the Allies and the new Soviet alliance fight for supremacy. World War III is drawing closer. Play as the ruler of one of 175 countries through World Wars II and III.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/22130/header.jpg?t=1447351672",
    "minimum_requirements": "OS: Windows 2000/XP                    Processor: Pentium IV 1200 MHz                    Memory: 256 MB RAM                    Graphics: 4 MB video card DirectX compatible                    DirectX Version: 9.0 or higher                    Hard Drive: 600 MB                    Sound: DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "My first ever Paradox game and I am glad that I got to play it and became a Paradox zealot!",
            "review_score": "1"
        },
        {
            "review_text": "Pfffffft geography tests.... HA!",
            "review_score": "1"
        },
        {
            "review_text": "Hearts of Iron 2 Complete + Kaiserreich mod = loads of fun.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun is playing as Luxembourg.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, sadly i updated to windows 10 so it doesnt work anymore and i have tried every compatibility mode and have tried to change resolution and downloaded resolution editor but no. Doesnt work anymore :(",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game with an interesting concept.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. Love it",
            "review_score": "1"
        },
        {
            "review_text": "I started a game as Republican Spain, determined to bang nationalist, fascist pigs on every hill, forest, mountain, plain, city in Iberian Peninsula. When that ♥♥♥♥♥♥ Franco rebelled, I took a look on his armies and saw Milicias POUM and Milicias CNT there.  This game is clearly made by a Stalinist scum, Stalin and his ball jugglers please stop ruining history.  P.S as a history lesson.: Trotsky banged Frida only because her moustache looked very similar to Stalin's.  0/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, but not for the faint of heart. It does so many things well, its easy to overlook any flaws. You'll run into plenty of 'bang your head on the keyboard' moments, but usually I find that it was caused by my strategic blunders. It does lack certain aspects of depth added in HOI3, but personally I love this one more than the sequel. It just seemed so much more fun, and struck a better balance between realism and accessibility.",
            "review_score": "1"
        },
        {
            "review_text": "Best of the Hearts of Iron series thus far.",
            "review_score": "1"
        },
        {
            "review_text": "start as italy in 1938 dont join axis gets land from yugoslavia win invades greece and bulgaria world domination steamrolles turkey  1941 vichy government realese syria and lebanon soon they will fall to the empire syria and lebanon gets destroyed by 21 v1 rockets and tank land invasion persia freaks out and declares war on me soon to be battered with 41 reserved v1 rockets and infantry invasion switzerland is next  gather my italian guard on the swiss border italy declares war on switzerland switzerland is gone withing 8 months afghanistan declares war the italian army in persia wrecks the afghan militia thats where i am in 1943 ",
            "review_score": "1"
        },
        {
            "review_text": "The game is good and all but you dont get any form of customer support. You will undoubtebly run into troubles with this game, i had to reinstall it several times just because it wouldnt start properly. This is where their ♥♥♥♥ customer support comes in, their idea of support is you having to sign up to their forums and post a comment. Then cross your fingers/pray for dear life that they bother to help you. Spoiler alert, they wont. This is very quickly turn into you wasting your money on a game you cant even play.",
            "review_score": "-1"
        }
    ]
}