{
    "app_id": 221810,
    "name": "The Cave",
    "release_date": "2013-01-23",
    "developer": [
        "Double Fine Productions"
    ],
    "publisher": [
        "Double Fine Productions"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Platformer",
        "Puzzle"
    ],
    "achievements": 27,
    "positive_ratings": 1702,
    "negative_ratings": 266,
    "price": 9.99,
    "description": "Assemble your team of three from seven unlikely adventurers, then descend into the mysterious depths to explore The Cave!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/221810/header.jpg?t=1522685753",
    "minimum_requirements": "OS:Windows XP SP3 Processor:1.8 GHz dual core CPU Memory:1 GB RAM Graphics:256 MB GeForce 8800, Radeon 3850, or Intel HD 2000 Graphics DirectX®:9.0c Hard Drive:1.5 GB HD space Sound:DirectX Compatible Sound Card",
    "recommended_requirements": "OS:Windows 7 Processor:Intel Core 2 Duo at 2.2 GHz, or AMD Athlon 64 at 2.2 GHz Memory:1 GB RAM Graphics:512 MB GeForce 220, Radeon 4550, Intel HD 3000 Graphics DirectX®:9.0c Hard Drive:1.5 GB HD space Sound:DirectX Compatible Sound Card",
    "reviews": [
        {
            "review_text": "I only review games I think are good, and I think this is Good. 9/10.  This is a platform puzzle adventure game that takes about 5 hours to complete, but you should play through several times to get all the charactors to the end. and its on the second+ playthrough you start to notice little changes to the maps, story ect.  Pros... Story ( if you pay attention ). Graphics. Sound + Music. Animation. Voice Acting is excellent.  Cons... Lack of a Hint system ( you may want to use the Steam Guides ). May seem repetitive trying to get all Charactors to the end.   I am glad I bought it and would buy again, Hoping they make The Cave 2.",
            "review_score": "1"
        },
        {
            "review_text": "It looks great and the puzzles are nice, but OH GOD, SO MUCH BACKTRACKING!!!111   You spend like 95% of the game just going back and forth very far away points to collect items, going though endless stairs and banal jumps that add nothing to the game... and worse, sometimes you have to do it with all 3 characters just to pull 3 simultaneous levers...  Playing it once already gets you tired of all that walking, I can't imagine the strenght of will necessary to beat it 3 times to see all characters.",
            "review_score": "-1"
        },
        {
            "review_text": "Rating 7.5/10 Overview: 2d Puzzle Platformer  The Good  + The main premise is that there are 7 unique characters, you choose 3 to control as you make your way through the cave. Each character has their own unique level associated with them. This provides some level of replayability.   + The levels themselves are fun to play and each one provides its own unique puzzles to solve which makes the game interesting.   +Nice graphical art style  + Game controls nicely with gamepad  The Average  Like most games that focus on humor, the dialogue can be very hit or miss.   It can be a short game if you don't bother to replay it with the other characters.    The Bad  - Because you have to switch between 3 characters to solve the puzzles in the game, this creates a lot of needless backtracking. A lot of the puzzles themselves revolve around you going to one side of the map picking up an item and having to go back to the other side. Over time this starts become very tedious.   Conclusion  This is a very charming game, something you would normally expect from Ron Gilbert and Double Fine. If you get this game, you are playing it to experience the different scenarios each character has to offer along with the puzzles that come along with them.  ",
            "review_score": "1"
        },
        {
            "review_text": "'The Cave' is made by that guy at Double Fine that everybody loves, and has you traverse The Cave attraction, an interactive Cave which has you explore the inner desires of the adventurers (3) that you take control of.  The Cave is brimming with personality and humour, and for the first playthrough (4 hours) if an absolute treat. However, afterwards is where it falls flat.   The game provides you with 7 heroes, each with a different story. Your first playthrough, you can complete 3. Your second you can do another 3, and then you have 1 left over.  Now, a second playthrough has you play 3 more heroes in several identical zones, with no change of Act 1 or 3, just Act 2, meaning the majority of the game is the same as the first run. The last run is even worse, as you need to perform only 1 scenario different with 1 new hero.  This math problem, and poor level/game design, leads you to completing it once with absolutely no desire to do it again, which is a huge shame!  The game is fun and bright and whimsical, and I'd love to complete it again, but I refuse to force myself through recycled content for the sake of completion. I look forward to patches/new DLC (hopefully?) which might improve/resolve this.  Is it worth it for 4 hours? I thought so, but you might disagree.  Nilesy",
            "review_score": "1"
        },
        {
            "review_text": "The Cave is a very nice example of how to make an adventure game. It doesn't require you to rub every item in your vast inventory against every other item in the hopes of finding a solution only to realise you have to travel all the way back to that other area to get something or other. No, The Cave has fairly modest and self contained areas, and it doesn't even give you an inventory so you don't have to worry about vast item combinations. You just hold one thing per character, and once you move onto the next area you can pretty much just drop anything you're holding and not worry about having to go back to a previous zone (because you can't). It's just light-hearted and humorous adventure gaming with some platforming thrown in to keep you engaged. I did find one of the puzzles to be poorly designed, and the Knight seems to have a few clipping issues where he gets stuck in the ground (albeit a rare occurrence), but overall it's a very enjoyable game to play. 7 out of 10, would spelunk.",
            "review_score": "1"
        },
        {
            "review_text": "So much irony, &amp; nice artwork  a bit short, still    (i personnaly bought it on steam sales)  ",
            "review_score": "1"
        },
        {
            "review_text": "The 'Cave' is a sarcastic son of a beach that kept Insulting me. The characters are phycotic and probably they will end up in the serial killer wing in a high security prison or in an asylum. Some of the Puzzles are really Hard. The game has a lot of replayability since each different set of 3 characters will give you some unique experience. And......♥♥♥♥ THE MONK CHAPTER THIS THING IS UGHH I would 10/10 pay again 13 bucks to have an inanimate object such as a Cave insult me like that while me and those 9 sociopaths Destroy the lifes of everyone withing the vicinity of the cave",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun puzzle game. In the beginning you chose 3 characters, from 7, whom you are going to play the game with. There ars different stages which you can only open with a certain character. So when you finish, you did net get everything that is in the game, you can just start over with different characters. This makes that the game stays a challenge, even if you have played it once before, just because it is different everytime you play with different characters. I like this game a lot.",
            "review_score": "1"
        },
        {
            "review_text": "Dark comical adventure/platform game. The 3 out of 7 characters you play with open different paths which will mean there is more re-playability here than a straight up adventure. It's a more adventure game led Trine.",
            "review_score": "1"
        },
        {
            "review_text": "Greatly designed, easy to pick up, fun to play and thoroughly enjoyable experience. The down-side is obviously the repetitiveness and some minor bugs that can drive achievement hunters absolutely crazy. But what do I know? I'm just a talking cave.",
            "review_score": "1"
        },
        {
            "review_text": "I have an opinion on the The Cave, but I'm having a hard time deciding exactly what it is. It isn't a bad game, but it's quite a long ways from perfect. If I were a teacher and The Cave was an assignment somebody had handed in, I would give it a passing grade, but it certainly wouldn't get a very high mark.   Having said that, I seem to have put a fair amount of time into it, and I do plan on finishing off the rest of the acheivements. So there is something to be said about it.   At its heart The Cave is a puzzle based adventure game. The controls are simple enough, and it's rare that you need to do anything particularly precise with them. You control three characters, each with their own story and one special ability that generally acts as a key to their area that other characters can't access. So every time you play you pass by the spots where a given character's story is to be told, and if that character is in your group you can go in, if not you carry on past.  Each area is a collection of puzzles. Some you can solve with one of the characters, some require you to position multiple characters and perform actions nearly simultaneously from across the map. You never need to aim at anything, and there isn't any combat as such. There is one logic / math sort of puzzle, but they have a way of getting the solution if you can't figure it out. In all honesty, I found that puzzle a lot more clear than many of the puzzles in this game. There is a lot of your typical adventure-game-logic where you need to think outside the box to come to the solution. The 'box' in the last sentence would refer to normal human experiences and behaviour. So, to use a hypothetical example, you might be required to use a slice of bread to open a door to keep your finger-prints off of it. Something you probably wouldn't think of otherwise.  So what does The Cave have going for it? Well, the puzzles are generally fun, the narration is pretty much top notch, and it was nice to see the adventure game format return. The story was pretty good, and while I have criticisms of it, they tend to be nit-picky sort of things. A slight inconsistency of tone here, a lack of sympathetic character there.  The fun part of this though is what The Cave does wrong. The number one thing, and this is a glaring issue from my perspective, is the repetition. This game repeats its repititions. It has loops inside loops. I can't believe anybody would develop a game with this much repitition in it. Have I said repitition too many times yet? If you think so, you're going to get very annoyed at The Cave very quickly.   Right off the bat there are seven characters, seven stories, and you can only have three characters in your group at a time. If you can follow along with my advanced calculus, that means that in order to see every character's story, you will need to play the game to completion a minimum of three times and repeat two characters. In addition, each play through has you puzzle your way through six areas. Three that are character story dependent, and three that are there every time. The puzzles never change anywhere, so if you play through the game the minimum number of times to see each character's story, you will still have those three sections mastered.But that's not all. Each character has two possible endings. So if you want to see the entire story for any given character, you need to play through twice, and the only difference is one decision right at the end.   Moving away from the repitition, this is one of the buggiest games I have played in a long time. It's not that uncommon, especially for a PC gamer, to see a game that crashes from time to time, or that has one specific graphics glitch. The Cave is constantly tripping up, failing in some weird way or just acting funny. It's like they didn't play test it all that much. For instance, there are many places where you need to stand beside an object, like a crate or something, and push it around. Well, frequently when you try and do so the character will start jittering around instead of pushing. On one occasion I jumped a character onto the bottom step of a porch only to have her ghost through the step so she was standing inside it. It took some doing to find the right set of moves to get her unstuck. I've had the game just decide to stop listening to the keyboard (except for the escape key interestingly). After my first time playing I quit the game and when I started it back up again, it had lost my saves and any connection to steam. No acheivements rang in, I couldn't access the steam overlay, nothing. But every other game worked fine with steam. The next time I started the game, steam was back again, and any progress I had made in the intervening session was lost.  All in all I do recommend this game, but I do so with a lot of hesitation. There's fun to be had here, and I do enjoy playing it, but at the same time it really isn't very polished. If you have no other games that you want to play, and some money burning a hole in your pocket, then this might be a decent way to spend some time. However, if you have other titles that you are interested in, pick them up first.",
            "review_score": "1"
        },
        {
            "review_text": "Caves are awesome. They can contain just about anything. Sadly, this one contains a lesson about what happens when you bring a great narrative, and forget about fundamental design. A great idea is wasted with terrible platforming, klutzy level design and tedious puzzle solving. The Cave probably would've worked as an adventure game, but instead it becomes another chapter in Double Fine's struggle to create some worthwhile gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was a ton of fun, and I really enjoyed playing it. The dialoluge, character designs and art direction of the game works really well.   I have only three complaints about this game: - Puzzles are far to easy, even at the end of the game - Most of the puzzles require a ton of running around the same area  - No banter bewtween the three characters you choose (not a huge deal, but I enjoy funny banter between party characters)  This game a lot of replayability if your into getting all the achievments and endings. It takes bout 5 playthroughs to get everyone's good/bad ending and all 27 achievements.",
            "review_score": "1"
        },
        {
            "review_text": "It's interesting to see each character's story unfold through a series of themed puzzles. Unfortunately to learn about all the characters you'll have to play through several times.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know, I just liked it. Actually, I didn't really know what was this game about, but you can choose three characters at the beginning of the game (three of seven playable characters) and you'll learn their unique histories. Each of them has their own special ability too.  I struggled a lot at the beginning, going back and forth, compleeeeeeetely lost. But I learned and it became faster to play (finished 2 times already, but I'll try until I get all achievements!). Really, it's not that complicated, you only need to get used to it.  Well, I liked the graphics, the gameplay, the characters, references and, obviously, the narrator. That's how you use sarcasm.  Some cons is that the game is relatively short, but you'll need to play a lot of times if you want all the *'SPOILER' ALERT* endings *END OF 'SPOILER'* and the achievements. Sometimes you can be tired of going up, down, getting lost or stuck, but you'll get used to it too. I think.  Sorry about my Engrish aaaaaaannnnnddddd, remember, sometimes, the faster and only apparently way is really the best, only and rewarding way~ ♪",
            "review_score": "1"
        },
        {
            "review_text": "The Cave is a really cute platformer from the creator of mythical past adventure games like Monkey Island and Maniac Mansion. There is some humour and funny characters indeed, but the game is a bit short and simple (10 hours and I already did three complete playthoughs with all characters), even though I can assure graphics and level design are really good for this kind of product.",
            "review_score": "1"
        },
        {
            "review_text": "Oozing Doublefine/Lucas Arts charm, you can feel Ron Gilbert's influence very deeply in this game. I was hooked on it from the very first trailer I saw, since The Cave as a narrator is quite a fun gimmick, and his dialogue is quite amusing. The gameplay is a cross between old school adventure games Ron Gilbert is famous for and a sidescrolling platformer. It can get a little frustrating at times thanks to the adventure game tropes (back tracking, obscure puzzle solutions, etc.) but the pay off is worth it to see the histories of these dispicable characters.",
            "review_score": "1"
        },
        {
            "review_text": "It's just awesome, i really don't have the right words, just get it and see, it's kinda difficult sometimes but it is a puzzle game",
            "review_score": "1"
        },
        {
            "review_text": "This game is as funny and imaginative as you would expect a Double Fine game to be. It's a adventure game disguised as a platformer. The game requires replays and that's where things fall apart. With the exception of the character-specific levels, the game repeats itself. Despite how clever and funny the dialogue, it can't cover up the fact you're doing a lot of tedious jumping and item placement all the while switching between three characters you have to navigate individually. And you'll have to play through the game at least three times (six if you don't save before getting the bad endings) just to unlock all the character's cave paintings and see both endings.",
            "review_score": "1"
        },
        {
            "review_text": "Manic Mansion for the 'Modern' era (Cliché I know)  Items required to perform tasks actually makes sense, unlike the majority of 80's and 90's Adventure games and the platform element is a nice twist.  Be warned, lots of going back and forth until you know what items aren't / are needed, etc.. so patience required to begin with.  You'll also only get 15hrs+ of gameplay if you're going for all the achievements, reckon on at least half of that if you only go for 'Good' endings or 'Bad' endings.  Overall another enjoyable Ron Gilbert game.. now get on with a NEW Monkey Island! =)",
            "review_score": "1"
        },
        {
            "review_text": "The Cave is a light-hearted platformer with a lot of dark humor and isn’t nearly as deep as my title suggests. You start off with a choice of seven characters and you have to choose 3 to go spelunking the depths of The Cave. By the way it’s a talking cave. The only other voice being the salesman of The Cave’s gift shop.  You start off mildly enough, just a small quest for the gift shop. Grab three trinkets and return. Here you get a small taste of the quests The Cave has to offer. There aren’t any enemies in the cave but everything can kill you. Fall from too high you die, stay underwater too long you die, get blown up, etc. However, the game is very forgiving in that it automatically respawns your character close to where you were before you died.  When you finally descend the depths the experience is tailored to the characters you chose upon starting. The Cave says that it explores the depths of each of the character’s hearts to find out what they desire most. What that entails is minor explorations of a major event of each chosen character’s lives. There are also paintings highlighting all the character stories you will encounter during your playthrough.  It will take a number of plays to get through every character’s story and since each character has a different ability how you approach a puzzle will differ slightly according to your party. For example, the Time Traveler’s ability to phase through walls is incredibly helpful in skipping a couple of puzzles but if you don’t have her in your party you might have to think of another way to get the item you need. Each ability will have some use during your journey so you’ll never feel like you’re relying on one character or the others aren’t pulling their weight.  As for graphics and settings the Cave’s environments are quite diverse. One section you can be on a deserted island or a carnival to a top secret Bond like nuclear missile facility. Every time you reach a new depth you get a different setting. The puzzles are terribly difficult and the narrator and other inhabitants provide small hints in speeches. The game took me about 4 hours to get through the first time. And since there are 3 standard quests that occur regardless of your party you can use the same approach for the non-character specific parts. You can even carry certain objects into other areas allowing for you to completely skip one section.  There are 2 endings per character so it will take about 5 plays to get the complete story but it was fun each time although changing up the characters didn’t affect how I approached the puzzles drastically different. Overall it was a cool, quirky enjoyable experience. It wasn’t as deep as I thought it’d be but also not so shallow that I felt unfulfilled.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this game reminds me so much of the good old days, where adventure games were fun and challenging. Maniac Mansion, Zak McKraken &amp; The Alien Mindbenders, Monkey Island, Day Of The Tentacle. If these mean something to you, go and get The Cave. If not, try a complete different approach to gaming. The Cave reveals as gem little by little. Tim Schafer and Ron Gilbert were behind this.",
            "review_score": "1"
        },
        {
            "review_text": "LOVEEEEEE THIS GAME!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Great stories for each character. It's kind of tricky and makes you think, but it's soooo much fun.",
            "review_score": "1"
        },
        {
            "review_text": "Ok, I've just finished The Cave, which took me around 4 hours in total. It's... alright. Not great, not bad, just alright.  You have a choice of three from seven characters to choose from for your adventure. I took the Knight, the Hillbilly, and the Adventurer. Each playthrough starts the same way and ends the same way, but you have three small 'story' sections bespoke to each character, which makes specific use of that character's special ability (the Knight has a shield ability, for example). The story sections are amusing enough and some of the puzzles got me stuck for a while, but overall it just feels a bit... undercooked. It's like it could've been just something a bit more.  The style is cool, it's reasonably funny in places, it's just not as good as I wanted it to be. Maybe I've misjudged it and I'm not their target audience, it does have a certain charm to it, I just felt like I was playing through it to complete it rather than to see what the story did.  Unless you're absolutely dying to play it - in which case you've probably already bought it - I'd really wait for a 50-75% off sale (probably the latter).  TL: DR; there's better Double Fine games available. It's not bad, just not as good as it could've been.",
            "review_score": "1"
        },
        {
            "review_text": "For us oldsters it's Earthworm Jim meets LucasArts adventures like Day of the Tentacle.  Lavish production, hilarious cartoon logic all set in an allegory of... Hell. Can't really be anything else considering... well that's a spoiler, which shows that there's some fun wriing. The cartoon logic is impeccable, e.g. you need the bananas to enable the guidance system... Because the guidance system is a monkey. Take care to inspect everything highlighted, because in all likelihood it will be essential to the plot. Sometimes several layers deep...  All too brief (7 hours first run) but there's replay sort of forced on you. You only get to use three characters per adventure, but each of the seven have their own dedicated level.  Good for achievement grinding, but starting to lap in about two hours; how many laps to get the last few achievements.  I love it, but possibly because of the nostalgia factor, 8/10",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of the Monkey Island series and are looking for another great Ron Gilbert game, you may be quite disappointed. This game isn't too great, and it has very little in common with those classic adventures, not even the humor.",
            "review_score": "-1"
        },
        {
            "review_text": "The Cave speaks, so it introduces it self and presents seven characters that are about to enter it, but you can only choose three of them. They are: The Knight; The Cientist; The Adventurer; The Twins; The Monk; The Time Traveler; and The Hillbilly. You'll be taken on a journey to find what they desire most and what they would do to get it. The cave is divided into seven character themed stages and three unchangable stages that are interconnected. So whenever you play you'll go through three stages based on each of the characters you choose at the start and three that will aways be the same. The Cave is filled with puzzles, interesting stories and a funny narrator. The only problem I have with the game is the fact that to play with three new characters I had to go through the other three unchangable levels and there was still one character left to play with, but this one I watched on Youtube. Overall the puzzles are really good, but some are better than others. I would recommend you to play with the Cientist, the Time Traveler and the Hillbilly, because they have the best stages. Then play with the Adventurer, the Twins and the Monk, which are ok. The Knight has the worst stage, but it is on the start of the cave so you can easily play it as the last character and then watch his endings on Youtube.",
            "review_score": "1"
        },
        {
            "review_text": "Nice style, funny coop puzzles :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is a platformer puzzle, but fails in both styles. There is nothing challenging in the platformer part, no dexterity is required. The puzzle part is like those point-and-click games. But you are faced with only one challange at a time and there are only a couple of items available so the solutions are quite straightforward.  For me the real issue was how multiplayer works. Yes, the game supports couch multiplayer, but actually it does not work well. It is part of the puzzles to do something with one character while you leave the others do something else. This means characters can, and often do get off-screen. The result is that your buddy is just watching you as you walk, and walk, and walk, and walk... My daughter was totally bored and quickly abandoned me.  All together this is not a bad game but not a good one, either. I, at least, had no joy when the characters reached to bottom of the Cave and had no inspiration to try a different set of characters which would present me some different parts of the Cave.",
            "review_score": "-1"
        },
        {
            "review_text": "As enticing as another double fine game made by the same person who brought you Maniac mansion sounds, I would only recomend this to people who are completly starved for another adventure game. You can take control of a group of three quite unique and well desighned characters from a pool of seven as you lead them to face their dark secrets and gain the one thing they truely desire.  The problem with this game come in three factors. One, while the characters look interesting at first glance. you quickly realize that the only view into what make them up is literaly a seven page comic that you find pieces of alonge the way. None of them will say anything about the things and events around them which is a heavy staple in any adventure game. Having differnt people observe the same places that you have to go through every playthough in seperat ways would drastically cut down on the monotonus parts of this game which leads to...  Factor number two which is that several of the puzzles while clever are hanpered by long hallway and slow ladders seperating each puzzle piece. This is also compounded by the fact that each member of your group can only carry one item at a time neccesitating constant back and forth even well you do find out what to do. One play through was hard enough which leads to.....  Factor number three which is that if you want to get all of the ending comic panels you HAVE to play the game from start to end SIX TIMES. you have seven people to play as each with a good and bad ending which is decided by one final choice and a hidden one at that. Also you would think that playing as new people would change the game drastically but eachs person's dark deed moment is sectioned off into a different stage. I could see which ones I was missing as I passed the themed enterance down the cave.  It pains me to pick this game to pieces because I really wanted this to be good. It had a good consept from under used genre. I was even reminded of a lighthearted silent hill as wierd as that sounds because both are about people with dark pasts venturing into a location that changes itself to force that dark secret into the person's face, But it's held back by bad use of the three person mechanic, shallow characters, and tedious puzzles.",
            "review_score": "-1"
        },
        {
            "review_text": "Some of the puzzles are not intuitive so this game will be frustrating if you're not comfortable with hours of guess-and-check. The humor isn't bad but nothing great. Also, I highly recommend a controlled as I was experiencing over a second of input lag with keyboard.",
            "review_score": "-1"
        },
        {
            "review_text": "I personally did not enjoy this game. The clunky gameplay, weird storyline (didn't make sense), and almost pieced together is seconds gameplay struck me as a game I should not like. If you are a fan of Sega, get this. If you have a powerful PC, get this. If not, avoid at all costs.",
            "review_score": "-1"
        },
        {
            "review_text": "Double Fine pulp. A company to expect little from, it seems.  Very little instruction. Unresponsive, poorly defined movement most likely developed with a port to mobile in mind. Uninspired challenges. Lacking polish to the extent it feels unfinished. I could go on but it's wasted enough of my time.",
            "review_score": "-1"
        },
        {
            "review_text": "6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "cool game",
            "review_score": "1"
        },
        {
            "review_text": "The Cave Is The Best Game Ever, Woot.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to like this game but floaty jumping and clunkey controls ruined this game and no matter what the control sytem I tried I could not escape the bad controls and floaty jumping it broke my enjoyment of this game",
            "review_score": "-1"
        },
        {
            "review_text": "A masterpciece from the creator of Monkey Island. Witty, dark and funny.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Nice game! Interesting story and characters! :)",
            "review_score": "1"
        },
        {
            "review_text": "It's a puzzle-adventure-platformer, but the platforming is boring and the puzzles involve a lot of backtracking with all three of your characters. Compounded with the fact that there is no map means that this game is a chore to play. It is aesthetically very pleasing but the game would have been better as a traditional point-and-click instead of a platformer.",
            "review_score": "-1"
        },
        {
            "review_text": "The setting, characters, and writing are all there, but the gameplay really isn't. I found it way too unweildy to get very far. Maybe it's better if you have friends with you to do local multiplayer with, but it really didn't work for me solo. Too much character switching and moving around to progress. Trine was a good example of how that mechanic should be done solo.  Honestly, I'd suggest watching a high quality LP instead of buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "Vast underuse of the premise. I cannot recommend this unless you really like Tim Schafer games; try Psychonauts instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Falling with angel wings, knight you made my day",
            "review_score": "1"
        },
        {
            "review_text": "You can stand by as two small children kill their parents  10/10",
            "review_score": "1"
        },
        {
            "review_text": "great game but it will be better if there is coop, not local coop",
            "review_score": "1"
        },
        {
            "review_text": "Finished with the first group and, honestly, uninstalled feeling no desire to play through again with the next group. Its a charming game, but the puzzles are really the low point of the game, they are more annoying than anything with their back and forth and no inventory to hold stuff.",
            "review_score": "-1"
        },
        {
            "review_text": "Only recommended to nostalgics of that genere.",
            "review_score": "-1"
        },
        {
            "review_text": "Made by Ron Gilbert, formerly of Double Fin studios, this is a game of 7 adventureres in a talking cave. Pretty funny game thats for sure, the puzzles can be a bit tricky at times but overall the game is great",
            "review_score": "1"
        },
        {
            "review_text": "Do not try to play this without two friends, controlling all the characters is pain in the ♥♥♥.  Especially when you need to walk back and forth, slowly climbing on ropes and dying to fall damage...",
            "review_score": "-1"
        },
        {
            "review_text": "A very disappointing game. Tedious and unfun. This is definitely not one of Double Fine's best.",
            "review_score": "-1"
        },
        {
            "review_text": "After few games by them, I always look up to new titles by Double Fine. I have high expectations, as well. The Cave fulfilled them all. It's a very well-told, not so easy story (7 stories joined into 1, in fact), set up in a clever setting of beautifully crafted cave, with a tip of dark humour. Must play - 10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend buying The Cave for several reasons?  1. The story of the game were made by Ron Gilbert, for that reason only you should expect an awesome game and you got that with The Cave.  2. The Cave is funny, not only the game but The Cave itself.   3. There are so many good references and jokes.   4. The joystick control works fine, making the game highly enjoyable playing on a TV.   5. Every group of 3 characters you choose (from a pool of 7) has its own story and powers to help you solve the puzzles in the game. That guarantees a good replayability, since you have to beat the game several times to get all the character stories.   The only bad thing is that the game is short, but that makes more interesting in trying distinct groups of characters and see its end story.",
            "review_score": "1"
        },
        {
            "review_text": "Filled with humor and creativity. great replayability.",
            "review_score": "1"
        },
        {
            "review_text": "Good, but kinda short.",
            "review_score": "1"
        },
        {
            "review_text": "Tried to play this, wanted to like it. The Controls just feel so clunky, and if you are playing coop you're fighting with your partner for screen space. It's a very pretty looking game, but the game play is very clunky.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a good puzzle game for anyone who likes to challenge themselves!! It is highly entertaining as well. The Narrator is very amusing. If you want something out of the ordinary, this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "Really good platformer. Great graphics, music and story.",
            "review_score": "1"
        },
        {
            "review_text": "This game is whitty and fun and a great source of entertainment. I recommend this game for anyone and only wish there were either more levels or more games like it on the net. Thanks so much for the hours of enjoyment. It's been a while since I found something like this to play.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderfull adventure game from Ron Gilbert! If you are a fan you need to play it :) It is worth it!",
            "review_score": "1"
        },
        {
            "review_text": "It is hilarious, especially with the witty and sarcastic narration. *note to self: 1. lock dragon gates and 2. jump ON the ferris wheel; don't play LEAPFROG with it*",
            "review_score": "1"
        },
        {
            "review_text": "Has Ron Gilbet ever put out a bad game? So far with his new masterpiece, The Cave, I'd have to say 'No.'",
            "review_score": "1"
        },
        {
            "review_text": "Amazing visuals, great game play, different ranges of puzzle complexity, sound everything is great in this game. From the mind of a master!",
            "review_score": "1"
        },
        {
            "review_text": "used to play on xbox, so i bought it for pc after i sold the xbox. very creative game and i like how each character has its own story/skills.",
            "review_score": "1"
        },
        {
            "review_text": "The entertaining narrator and decent art style are the only two things this game has going for it.  Controls were slow to respond or did not respond at all in some cases.  Using ladders or ropes is painfully slow even when holding the quick ascend/descend button. There is a lot of backtracking, which is made even more fun by the aforementioned rope/ladder problem. While it is nice that falling was not killing my characters it felt like a pointless waste of time to go through the respawn animation. Forcing a slow walkthrough of areas I have seen several times already is not the way to make a game entertaining.  Multiplayer seems extremely poorly done. Players are able to assume control of any character even if another person was already controlling him/her/them. The screen also does not zoom out to follow a player when they go off screen. ",
            "review_score": "-1"
        },
        {
            "review_text": "A short but mildly enjoyable experience. But it has zero replay value.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun, charming, and creative. It's definitely good for a few playthroughs, if only to get every character's story.",
            "review_score": "1"
        },
        {
            "review_text": "Funny little puzzle game with great replay value, because if you choose different caracters in a new game, the cave will be pretty much different with some completely new levels. The puzzles are very easy and obvious, but funny.  The atmosphere is very good and the narrator ( the cave itself ) is also very funny.",
            "review_score": "1"
        },
        {
            "review_text": "As a whole i enjoyed the game, it's funny, dark humour is my fav, the characters have interesting stories and i love the artwork. Money well spent.  Some problems though  - switching between characters in an endless game of catchup is annoying.   - some animations are incredibly slow i.e rope climbing.  - repeating the same stage for each playthrough is just tedious  That said, i did enjoy the game, and was thoroughly entertained",
            "review_score": "1"
        },
        {
            "review_text": "Great game, nicely narrated good art style etc",
            "review_score": "1"
        },
        {
            "review_text": "clever and fun, I've great time playing it.",
            "review_score": "1"
        },
        {
            "review_text": "I started my first play through by myself and had someone join before I was half way through. It was pretty fun. Some of the puzzles were a bit nerve racking, as they lacked good enough hints or explanation. I did kind of like the challenge because it felt more rewarding to complete them. I thought that it would have good replay value with the handful of characters available, but the game doesn't change enough with different characters and it became stale on the second go. I would recomend it at a discounted price.",
            "review_score": "1"
        },
        {
            "review_text": "As a whole, enjoyable. However... there are 7 characters and each of these has their own personal level to play, but you can only pick 3 at a time. Then there are 3 or so levels that you also have to play alongside these no matter who you choose. So in order ot play all 7 characters, you have to repeat the game THREE times and not only endure these generic levels THREE times EACH, but repeat two of the character levels! I did it twice and then stopped (i missed out the Monk). However, the game looked fantastic and played well. The puzzles were fairly simplistic and more tedious than anything as you had to move very slowly up and down ladders and ropes to get to where you need to be - but that's adventure/platform games for you. The ability to call all characters to your current position would have been very handy. Overall, I enjoyed it enough to play it twice - so I can't sit here and bad mouth it too much - I certainly enjoyed the style and the narration that sets it apart from the platform games of the 90s. Iit is not without its shortcomings, but I would still recommend it. I also wish I could put paragraphs in this box - listen up Gabe!",
            "review_score": "1"
        },
        {
            "review_text": "Didn't finish this. Don't remember anything from it. Starting to wonder why anyone likes Tim Schafer. Never played Grim Fandango. ",
            "review_score": "-1"
        },
        {
            "review_text": "Fun adventure game! Control three characters through a series of situations where each member of your team serves a specific function. With so many character combinations you can come up with, it makes it so you want to play it over again. Definately worth a look.",
            "review_score": "1"
        },
        {
            "review_text": "As I played the game for the second time now, I want to write a short review about it. I will make comments about: game type (category) / gameplay / graphics&amp;sound / puzzles / story / overall (replayability).  First of all, this game is not a jump and run game or platform game and not trying to be one. It´s a straight puzzle game with an own story for every one of the seven characters, that can be picked before entering THE CAVE. If one should pick a game-category for THE CAVE, surely it would be an adventure game. You can pick up items use them on something or combine them to find solutions for tasks &amp; quests throughout the game. Only that every character can pick up just one item at a time. This makes it really a fresh and easy puzzle game not as complicated as some classic adventures with a fast gameplay and a rewarding story.  For THE CAVE not being platform-game/jump&amp;run, the gameplay is great. It makes a lot of fun jumping around and hanging from cliffs, climbing up ropes and ladders while finding solutions for the puzzles. I played with keyboard which works great. You could also use the mouse or both. Characters are able to walk or run and every one of them has its own special ability. This means you can jump, use things, pick items up or drop em and use your special ability. Of course your character needs a little bit of time to completly stop out of a move, but you´ll get used to it. I don´t see no bad gameplay here! (many reviews say this, but I really can´t verify this at all)  The graphics are really amazing on this one: Characters, items, backgrounds, sequences and effects are simply beautiful and go very well together with the comic drawings you find throughout the game, that are part of the characters story. Also the sounds and the music are wonderful. A very pleasing atmospheric soundtrack suiting the situations very well. The Voice of the Actors truely are fantastic and make you laugh out loud. It´s actually great that the characters don´t talk, as THE CAVE does the talking as an all knowing epic narrator. Literally EPIC!  The puzzles are fair and not to hard, sometimes you are stuck, but mostly because of missing a path or trying to solve puzzles all alone instead of using 'a little help from your friends' like the beatles told you already. Teamwork is really important in this game, so if you stuck try changing more often between your teammates. Sometimes pulling is better than pushing in some occasions but you should be able to solve any puzzle without further help, of course there is the internet, what even the programmers tell you at one point in the game. But you really won´t need it, use your brains and be proud of your cleverness!  I think the story is really nice and well told. It is separeted between the characters, like THE CAVE says 'It´s about them'. But it's also about THE CAVE itself, what it is and does with people, that enter it. But, see for yourself... (MUUUAHHHA HA HAAA HAAARGH).  Overall: A great adventure game with good puzzles and a lot of dark humor, a nice story with interesting characters about virtues &amp; vices, inside a beautiful programmed and animated talking/narrating CAVE. Even if you know some puzzles already, it makes a lot of fun to play them again, being faster and more familiar with the puzzles and the gameplay. This is really a game you will have fun for a longer time than playing it through once. (Even after knowing almost all stories, I will try to unlock all the achievements, as I´m really somehow stuck IN THE CAVE. I just like it down there!) So in my opinion the metascore is really not representative, but every good gamer knows what he´s looking for best for himself, anyways. So if you like good puzzles while running, swimming and climbing through a mysterious world full of neat creatures and various rooms of action, in one game that you can play through in an evening or two. Look no further!",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious! From the Cave whose ability to talk 'makes dating Hell' to the extremely comical characters (The twins, the hillbilly, etc.), this game takes you on a comedy filled ride to find the deepest desires of your selected three, count 'em, three characters. You should definitely get this game, no question about it.",
            "review_score": "1"
        },
        {
            "review_text": "Dark secrets live in every soul. True with this one. This almost casual game can be played with multiple players on one screen and with the humor of the cave (e.g. Ron Gilbert) all turns out pretty... dark. Adventure meets Jump and Run.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty to look at and amusing to play. A different platformer that is not frustrating but entertaining. With just enough puzzle solving to get you thinking but not frustrated. Brilliant and hilarious narration. Ron Gilbert + Double Fine = Awesome sauce. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun, also incredible hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "Hello once again. Alright I think it's time to shed some light on this game that's gone unnoticed by many gamers.    The Cave is one of those funny, indie puzzle/platformer types of games. It immerses you into it's story with different characters you can pick. You find pictures, or you can go scavenging for them. These pictures will tell you about the character. It is quite grim in the sense that the stories are all of hatred and darkness, and just sins. Yet still it is a fun game that is narrated by a quite talented narrator. The comedy is nice and I love it for that. So what are you waiting for? Get your asses over here and buy this damn game!  ",
            "review_score": "1"
        },
        {
            "review_text": "Wanted to play this game. Installed, tryed to play. My framerate started at 30 and in under 2 min was at 4. So i start looking up fixes. Turns out some USB devices cant be plugged in while playing. While i was trying to play this with my wife with two controllers I eneded up playing with mouse and keyboard and her on controller. So we are off and running after hours of setting this up to play. Everything is good, then 10 min in BAM crash to desktop. That was the last straw. The forums are full of bugs and glitches and this game has been out for a while. Im thinking that the developer has forgot about this game and it is what it is.",
            "review_score": "-1"
        },
        {
            "review_text": "The Cave is the game you most desire. It will set you on a path of sin, madness and destruction, up until its very bottom. Oh, and if you see a clown down there, tell him the search and rescue team is on its way. Then wait for them too.",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzle sidescroller with a twist, one of the best puzzle games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "One of the bests Indie games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome gameplay. Awesome visuals. Awesome 'cave voice'. Totally recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun and witty and a really good puzzle game ",
            "review_score": "1"
        },
        {
            "review_text": "The game has an excellent visual ano plot however the controllers could bê dificult to use",
            "review_score": "1"
        },
        {
            "review_text": "Great fun. Rather short, reminds me of the old school platformers, especially with the voice over! Well worth a play.",
            "review_score": "1"
        },
        {
            "review_text": "Growing up, I was always a fan of the old LucasArts adventure games; especially the Monkey Island series. In my opinion, they're some of the funniest, smartest, most entertaining games ever written, even if they sometimes leave you wanting to throw your computer out the window in frustration while trying to figure out exactly why you've had a rubber chicken with a pulley in the middle in your inventory for game hours.  The Cave, having been developed by Ron Gilbert and Tim Schaffer's studio, Double FIne, manages to capture some of that charm in a simple yet challenging puzzler. One playthough takes right around 4-5 hours to complete (depending on how good you are are solving adventure-style puzzles, I guess), and is different depending on which mix of characters you choose to lead through the cave for that session. Throughout each playthrough, you'll experience a mix of both 'common' areas (areas that you may encounter regardless of which characters you choose), and character specific areas with puzzles that require the use of that character's special ability to solve. There is a dark, sarcastic sense of humor that weaves a thread through the entire game, and these character areas, which serve to flesh out the characters' individual back stories (sparse as they may be), are no exception.   Fans of the adventure genre, especially the LucasArts games, will find lots to love here. Aside from the puzzles themselves, there are a ton of small touches throughout the game that pay homage to Gilbert's earliest titles, especially Monkey Island and Maniac Mansion. The puzzles are, in my opinion, fairly straightforward, though they may take a little time to figure out. Some other reviewers complained about the lack of direction in the game regarding how to solve the puzzles. I don't get it--this genre has always been about making the player figure out what to do without too much help from the game itself. In my opinion, that's always been core to the experience of playing these types of games. The feeling of accomplishment is much greater when you figure out a particularly challenging puzzle on your own, rather than relying on a cascade of hints. But, I digress.  Having only completed one playthrough so far, I can't comment yet on the game's replayability. It seems to be there, as different mixes of characters provide a different experience, but I can see how replaying the same common areas over and over again could get old.   All in all, I'd give the game an 8/10. The style, art direction, and writing are excellent. At the current Summer Sale price of $7.49, it's well worth a purchase if you're a fan of adventure games, or even looking for something that's a little different that can kill a few hours here and there.",
            "review_score": "1"
        },
        {
            "review_text": "This and the Stanley Parable made me enjoy narrators. We need more narrators like them.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant puzzle-like adventure. Truly funny, cool visual style and great gameplay ideas.",
            "review_score": "1"
        },
        {
            "review_text": "'The Cave' is a amazing game (as I am used to from Ron Gilbert) with hilarious characters and great gameplay. It sadly is not too long but if you plan to replay with the other characters to unlock all secrets you get to a few hours. The riddles are not too complicated but they keep you in the game. All in all it is a great game that i recommend to everyone who loves to play some adventure games every once in a while :3",
            "review_score": "1"
        },
        {
            "review_text": "This was an enjoyable play.   Graphics are well done and narrative is humourous &amp; whimsical. Although there are times where dialogue with in-game characters can get annoying when you're running back and forth trying to figure things out.   Puzzles were unique and challenging. However, the time travel level, I found, was a little far fetched so it took me a while (and some hints) to get through that one. There were some levels too, that became monotonous &amp; time consuming due to backtracking by having not chosen the appropriate character for a particular task or just simply trying to find clues on what you needed to do.   I do like the fact you had to choose the character best suited to solve a particular part of the puzzle and that you can get through the most levels with whichever 3 characters you choose. Some levels aren't available if you don't have the characters to get through them, but you can always go back and replay with new characters - which is nice.   All in all, I would definitely recommend playing. It was fun!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome black humour, adventure mixed with platformer, nice graphics and voice acting... what to want more? &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "nice graphix... and very funny lines :)",
            "review_score": "1"
        },
        {
            "review_text": "Heavy on humor and story while light on insanely impossible tests of dexterity, this multi-character adventure game is fun from start to finish.",
            "review_score": "1"
        },
        {
            "review_text": "Neat day of tentacle like graphics and the dark, grim and morbid humour is fantastic. Plenty of third-wall jokes and even a GROG machine! Get it on sale and pay a dollar per hour for a unique perspective puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable graphics and sound (+effects). A quite nice variety of characters to choose. Though I would prefer a few more to be added. Decent riddles and puzzles. Not too hard or too easy for me but just right.",
            "review_score": "1"
        },
        {
            "review_text": "When I realized that my character had been jumping to his death instead of using the item this whole time only because I wasn't standing quite as close to pit as the game wanted me to, I was pretty much done. I just cannot get into it. The characters don't do anything and have no substance. The Cave is trying too hard to be funny. You can play 3 characters at a time, but there are 7 in total, so what gives? It's not a horrible game, but I would never recommend it to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "Ron Gilbert's original game, very character driven with individual story elements to discover. It's a puzzle platformer characterised by humour, has a cool art style both in 2D and 3D parts of the game, and has a classy, wry narrator. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game for those like me who are just starting out in gaming. The Cave allows you to play 3 out of 7 characters. Each character has their own level where you have to solve certain puzzles in order to resolve their story line. I enjoyed the narrator and the dark nature and wit of the entire game. I didn't find the puzzles as easy as some of the other reviewers but the game was still enjoyable. It's also great that the game has replay-ability just by choosing different characters. I played single player and my nieces played local co-op.  Local co-op mode kept them from fighting over the controllers. I recommend and can't wait to play the other story lines.",
            "review_score": "1"
        },
        {
            "review_text": "This game has its faults. Tremendous faults, actually; but I legitimately anjoyed the absolute hell out of this game. The core function of The Cave is puzzle solving, and that's where this games' faults begin. First off, the puzzles are absolutely annoying unless you instantly understand each characters' special abilities and where you can employ them. For example: on my first playthrough, I chose the Knight, the Monk, and the Time Traveler. I was stuck on the Knights puzzle for, I ♥♥♥♥ you not, half an hour before I realized that the Knight even HAD a special ability, and I had to use his invincibility to drop through gates of fire. The puzzles are incredibly obtuse if you don't get where to go and what to do, and once you do realize where to go and what to do, they're tedious. There is so much backtracking in this game. Thankfully I grew up playing Zelda, so I have the patience for that kind of thing. Secondly, remember that thing I said about the puzzles being tedious? Well if you're at all interested in completing this game, or even seeing the cave paintings for every character, you're going to play the same puzzles over and over again. Ad nauseum. Thankfully, the character puzzles are still fun, the dialogue is funny and well written, and the narration is pretty entertaining. I just wish that the narrator knew that the Twins' story isn't all that disturbing. Everyone can tell what those ♥♥♥♥ing kids are up to.",
            "review_score": "1"
        },
        {
            "review_text": "I love most of the Double Fine games, but this one missed the mark for me.  My main issue is that you will spend 90% of your time just backtracking to pick up a different item. The game limits any given character to holding only one item at a time. This often means you might walk all the way from one end of a level to the other, only to realize you need the item you left at the complete opposite end. Many sections only allow you to control 1 character at a time, so there's no real way around this issue. Yes, without the 1 item limit the game would take WAY less time, but it would also be WAY more enjoyable. I'd much rather have breezed through the 'possible' 3+ playthroughs for each character than be annoyed to the point I didn't even want to finish the first one.  If that doesn't sound like something that would bother you, there's a lot to enjoy here. Classic Double Fine writing, interesting enough characters, and a few clever puzzles that spark that classic adventure feel.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun game! I ahve not yet played with all the characters but I will surely come back to it. Funny and entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "It's been a couple of years since I played this game, but I still wanted to write a review for it because I thought it was great and still have strong memories of playing it.   The Cave is a puzzle scroller underscored by a dark playful humor as it uses the common environment of 'the Cave' to tell the individual stories of the sins and tragedies of seven mysterious figures. Each character has a special ability and many sections of the map can only be accesed with these special abilities. The means that despite being all contained on one map, the route you take through the map is determined by the characters you play. This creates great replayability as you revisit areas with different skills and discover entirely new areas. On top of that, the routes themselves are themed around the character stories thus giving the playthrough a linear storybook quality that unfolds as you complete puzzles. In fact the puzzles you complete tend to echo the character background stories. Each play through is about 2.5 hours but expect to play the game at least 3 times. The concept and execution are well married making this a fantastic game.",
            "review_score": "1"
        }
    ]
}