{
    "app_id": 22180,
    "name": "Penumbra Overture",
    "release_date": "2009-03-06",
    "developer": [
        "Frictional Games"
    ],
    "publisher": [
        "Frictional Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Captions available"
    ],
    "genres": [
        "Gore",
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Horror",
        "Adventure",
        "First-Person"
    ],
    "achievements": 0,
    "positive_ratings": 1660,
    "negative_ratings": 164,
    "price": 0.0,
    "description": "Penumbra: Overture is a first person survival horror game, emphasizing on survival and problem solving instead of mindless violence and gore.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/22180/header.jpg?t=1532609691",
    "minimum_requirements": "OS: XP/Vista                     Processor: 1.0 Ghz                     Memory: 256MB(XP)                     Graphics: Radeon 8500 / Geforce 3(MX4 Not supported)                     Hard Drive: 800MB Free Space                     Sound: Soundblaster compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "One of the best games of the genre i have ever played.  Great History and Investigation.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Penumbra: Overture is a first-person survivor horror game with problem solving puzzles implemented in the gameplay which focuses more on survival and eerie atmosphere rather than action and gore. It is also the first episode of the trilogy.  The story centers on Philip, a 30-year old physicist, who gets a strange letter from his supposedly dead father shortly after his mother dies. This gives Philip the inceptive to follow his father’s clues, leading him to an abandoned mine in Greenland where he eventually gets trapped in after the mine’s entrance collapses behind him. From then on, Philip ventures through a series of events which turn out creepier with each new discovery he makes. Soon he realises that the mine is not just any ordinary mine. More importantly, it is not actually abandoned. The mine is in fact the habitat of ferocious mutated dogs, “rock worms” and spiders. Creepy crawly spiders.  Surprisingly, the game has an intriguing story even if its premise of searching for your lost father as a plot device has been done numerous times before. Perhaps that is due to the fact that the story, or maybe its narrative, is actually pretty well-written. Generally, most of the story is being unravelled as the player discovers more lost documents and journals from various people who worked in the mine but died in the end in various circumstances. This may require quite a bit of reading to understand what and why things are happening that way (although some things are still left unanswered by the end), so it is important not to have a short attention span. Additionally, when a particular survivor by name of “Red” makes his first appearance, things seem to get even more interesting from a plot stand-point, in a way reminiscent of Andrew Ryan’s debut in Bioshock.  The game’s mechanics primarily focus on point and clicking with some 'mouse swinging' when solving puzzles and small occasions of combat mixed in. Although some puzzles may require a lot of thinking than others, they are by and large well implemented. Unfortunately, there are times when backtracking is required which may or may not become annoying in time. Furthermore, the game does allow you to hide behind objects and block doors to prevent hostile enemies from seeing or approaching you respectively, thus creating a pretty basic but functional stealth mechanic.  Penumbra: Overture also boasts a great sound design with its spine-chilling ambient music and close attention to details such as foley sounds, as well as having a memorable soundtrack -- the title soundtrack shall always remain a favourite of mine. Sound design is crucial for horror games like Penumbra: Overture, and it is reassuring to see that the developers did a fine job here.  Graphically, while the art direction is commendable, the game did not age too well by today’s standards. The animations are rough and stiff most of times, particularly for the dogs. But in most parts, the aesthetics do achieve in creating the spooky environment the developers envisioned.  The major downside of the game is its combat mechanic. Just like the way you have to approach the doors, drawers or switches in the game, the combat here requires “swinging” the mouse which is extremely clunky and requires a lot of practice before getting the grips with it. Sadly, the experience generally ends up being always infuriating for every single hit stupidly missed by your pickaxe (arguable the main combat weapon). This is why any combat should be avoided as much as possible in this game, at all costs. On top of that, there seems to be a lack of variation in enemies too.  Conclusively, Penumbra: Overture is a game which excels in creating an authentic horror experience with genuine eerie atmosphere and plenty of mystique, along with well thought-out puzzles and an unexpected interesting story, only let down by its combat mechanic and roughness from a technical perspective. Being a relatively short game (so long as you do not “waste” time standing in one spot due to fear), it has the perfect length and pace. It may not be the most impressive horror game out there on the surface, but it is one which horror enthusiasts must try thanks to its unique approach and emphasis on atmosphere and less on combat which differentiates itself from the masses of generic and/or action-oriented horror games; in addition to paving the way to future superior, if not the best, horror games such as Amnesia: The Dark Descent or even Overture's follow-up episode, Black Plague.",
            "review_score": "1"
        },
        {
            "review_text": "VR mod is available for the HTC Vive....Game play is really good...put you right in the middle of suspense....",
            "review_score": "1"
        },
        {
            "review_text": "I'm only two hours in, but I'm already having a blast.Philip excels at every form of entertainment, let it be beating dogs to death with various household items, or having witty quotes about his own health or maybe being overly proud of a fuse he made.Now at the cost of a very ♥♥♥♥♥♥ lunch, available at Steam.Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game from Frictional Games. I played it after Amnesia and really enjoyed the story.  A word of advise, don’t rush trough the game. Read every note you found and enjoy the story and atmospher of total despair.",
            "review_score": "1"
        },
        {
            "review_text": "Penumbra is a enjoyable experience for gamers who like puzzles and exploration. Dark, Dank, Dissused mines with Vicious dogs roaming around. Spiders, slugs and worms... urgh!  It has a great atmosphere about it and areas are small and quick to progress through. Not too much back-tracking.  The Combat isn't great but then it can be avoided with stealth. If you must fight, then use your nogging and find a way to make it easier for you and harder for the enemy. plenty of stuff lying around to make combat quicker and less annoying. The story gets alot more interesting the further in you get, So don't give up! Oh! and play this game with Headphones as it adds to the spookiness.",
            "review_score": "1"
        },
        {
            "review_text": "Very spooky game. More spook than Amnesia. Very spook.",
            "review_score": "1"
        },
        {
            "review_text": "Penumbra Overture is an absolutly incredible game. This is the first installment to the Penumbra series and it's one of the best (right next to Black Plauge of course :P)   Rich in story: This game just makes you keep wanting to play it just to find out how the story pans out!  Scary and Heart Pounding: The Atmosphere is amazing, it's dark, creepy and mysterious. The game is also super heart pounding. When you're finally hidden from an enemy you just wish you never have to leave the hiding spot you're in to run from the terrifying creature chasing after you!  The feeling of isolation: The only contact you'll make with someone is through a radio to a character known as 'Red'. You'll never see another person, but you'll have the knowledge that someone else is in the same facility as you, and to get to that person is your final goal. It feels lonely walking around the facility, even with that final goal in mind...  I could go on and on but we'll leave it at that.  I give this game a 10/10 - my third favorite horror game and maybe even one of my favorite games in general!",
            "review_score": "1"
        },
        {
            "review_text": "It may be a bit old, but this game was outstandingly brilliant! Great story, brilliant atmosphere, and an amazing but eerie survival horror game. If you're a survival horror fan, then I'd definitely recommend it to you.",
            "review_score": "1"
        },
        {
            "review_text": "The puzzles are challenging and the plot seems interesting. One of the best survival horror games I've played.",
            "review_score": "1"
        },
        {
            "review_text": "You'll Nervously Wonder  Penumbra: Overture; an eerie survival-horror bolstered with an excellent sense of atmosphere and accomplished physics.  Will you jump in fright? Perhaps…  You’ll enter mysterious hatches, open mysterious doors, and shine your flashlight into mysterious darkness.  As you play you’ll nervously wonder if something might be down in the darkness with you.  What if you run into something?  If you do, will it be something that can kill you?  So you’ll often crouch and hide in the dark from everything because you’re actually scared.  Then something will make a sound nearby and you’ll promptly fill your pants. ",
            "review_score": "1"
        },
        {
            "review_text": "You may like the Penumbra trilogy if you loved Amnesia. Same Lovecraftian undercurrents, but everything feels much less polished: awkward combat, bad puzzles, etc. Overture and Requiem are still worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you like tricky puzzled, I get so ♥♥♥♥♥♥ off on this game yet I come back because I'm curious about the story.  Recommend that you play this before Amnesia serie, you will notice a huge bettering in the controls. Controls feels a bit tricky in Penumbra.",
            "review_score": "1"
        },
        {
            "review_text": "A good puzzle solving game with horror elements.",
            "review_score": "1"
        },
        {
            "review_text": "Weird, completely atmospheric game. Combat is terrible, though, so do yourself a favour and avoid the more mandatory bits by renaming the dog files in your Penumbra steamapps folder.  A little clunky and odd, but completely worth playing, even if just to see how far the makers of Amnesia have come. Has some great sound effects as well as a surprisingly good story.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! mind boggling puzzles with good mechanics make this game so special. The atmosphere in the game can also crush a persons mind very fast.",
            "review_score": "1"
        },
        {
            "review_text": "hey who's this guy - HGHJgasfjksdgfksdfg",
            "review_score": "1"
        },
        {
            "review_text": "Penumbra is a horror/adventure series by Frictional Games, the developers of Amnesia: The Dark Descent. While not nearly as good as that horror masterpiece, there is still a lot to enjoy in Penumbra. In fact, it's very easy to see how Amnesia eventually came to be what it is - its elements are on full display here, albeit in early forms. While the games do have some scary bits, overall the fright-factor is not quite where it could be. This is mainly due to the somewhat dated graphics and easily thwarted enemies (which, unlike in Amnesia, can usually be killed). The puzzles are generally pretty decent, with only a few solutions being particularly obtuse. So, while not perfect, the series is still worth a look for horror/adventure game fans, especially those who enjoyed Amnesia and are interested in seeing the roots of that game and supporting its developers.  Penumbra: Overture is the 1st game in the series. It's decent, but has some rough edges and doesn't quite come together fully.",
            "review_score": "1"
        },
        {
            "review_text": "Frictional Games has come a long way since this title, but this remains a superb example of what a horror video game should be, and is an excellent adventure game as well. This game single-handedly redefined my expectations of horror video games.",
            "review_score": "1"
        },
        {
            "review_text": "Prelude to Black Plague. Also good, but not quite as good as Black Plague. Still, might as well figure out how the protagonist wound up there, right?",
            "review_score": "1"
        },
        {
            "review_text": "you run around a shape and then you pick up the thing and you say great that's great and then you go to the next shape and then you say fug xddd what do to an next and then you to an guide on the web and then to fug xddd I have forgotten something previous! Then to return then to do the thing and then it ends It has it's moments ",
            "review_score": "1"
        },
        {
            "review_text": "Okay,yes,this game is old - well,lets not say 'old',lets say,it's a 'classic'...yeah thats it ,this game is a classic and for a classic,I've got to say its still a great looking game ! In my humble opinion,this is one of a handful of games that has deeply inspired a lot of the present day games of the genre. . . The game has an overall atmosphere of dread. . . It does a wonderful job in the fright department without resorting to cheesy,un-needed jump scares and gore. . .  We play as Phillip,a 30 yr old man searching for his presumed dead father. . .Phillip talks to us throughout the game and the voice acting is above par I think. . . The story unfolds by way of notes and letters,journal enteries and our own thoughts,voiced again,by Phillip and Red,that talks to us over a PA system and walkie talkie. . . I need to say something about Red (no spoilers) ,he is stupid-funny ! ! I sat at my laptop and honestly laughed out loud so much from what he says to us ! ! Don't get me wrong,Red is an annoying butt monkey,but he does it with humor or at least I think so. . .  The game is set in Greenland in an abandoned mining research/living facility and,like I mentioned earlier,we find various notes,journal enteries,research papers and so on. . . And thats how we find out what the hell happened to all the people that used to be there,including Phillips father,where they went,why they went there and just what in the world could have gone oh so wrong that they're all long gone. . .  There is lots to do,explore,learn,find,solve and run from. . .We even get to do a little killing,but the controls for the combat system are somewhat sucky and should be avoided if at all possible,except when you absolutely have to and there are times you have to.  So,in my opinion,I must say I really loved this game and it had a story that I was invested enough in,that I thoroughly looked forward to finding the next clue so I could advance the story and find out all of the who,what,where,when and whys . . .  I 100% recommend this game and the rest in the series,as they only improve upon what I think is a great story. . .  I give this horror/survivor game an 8/10,   Happy Gaming Everyone !!",
            "review_score": "1"
        },
        {
            "review_text": "would you like to ♥♥♥♥ your pants of fear. Be my guest",
            "review_score": "1"
        },
        {
            "review_text": "A great horror game! If you've played and loved Amnesia, then play the series made by the same makers!",
            "review_score": "1"
        },
        {
            "review_text": "It's not Amnesia, but still gives the jump scares!",
            "review_score": "1"
        },
        {
            "review_text": "Not that scary once you get used to your enemies however the story is indeed rich and is filled with emotions. I recommend buying this and the other two parts in the game.  Very good horror/adventure game. 8/10 Oh and...♥♥♥♥ the spiders.",
            "review_score": "1"
        },
        {
            "review_text": "This is a horror game made by the company Frictional Games (same ones who made anmesia). This game is scary at some parts and really makes you tense such as when theres a monster coming around a cornor and you have to hide quick. Its not the best horror game around but it's worth the look.  The graphics in this game arn't the best but are not bad though it quite an old game released in 2007 so it will not have the best graphics out, it dosn't run particualy well on low power machines, but runs fine on medium to high power machines I have a 650 and I can have it on max setting with around 50-60fps which is to be expected on more powerful machines.  The story is quite vague but does hold some element to it.  So I do reccomend this game if your looking for a horror title.",
            "review_score": "1"
        },
        {
            "review_text": "This game will make you crap your pants. It was made by Frictional Games which is the same company that later went on to make Amnesia. There's small, hard-to-hit spiders in the game and they will mess you UP. There's also dog/wolf things scattered throughout the whole game but once you figure out how to kill them, they'll be a breeze to run through. Although the game is scary, it's very well-made and has an environment-interaction that I don't think I've ever seen before",
            "review_score": "1"
        },
        {
            "review_text": "The atmosphere in Penumbra: Overture is great. It's dark, creepy, lonely, and cold. The physics engine is okay, with some flaws here and there, but nothing worth seriously complaining about. The moving of objects and melee actions can take getting used to, but once you're comfortable with the physics engine, it works okay, although far from perfectly. The game flows through the story smoothly without any frustration or senseless puzzles/problems to be solved. Everything is logical and upfront, requiring a realistic approach and a reasonable amount of thinking to proceed. The save system is unfriendly. It seems to save your progress when you update your personal notes, or when you interact with a certain object within the game world, which the player has little control over when this occurs. This means that you will often have to do certain portions of the game over and over until you get it right. The voice acting is superb. The accent and tone are outstanding and adds to the storyline greatly. All of the texts you will encounter in the game are well written, interesting, and adds plenty to the plot. The controls can be awkward at times in order to accomplish some actions the game requires. Penumbra: Overture is not a scary horror game. Most of its interesting emotional influences on the player comes from the theme of being almost completely solitary in an unknown place that is far from civilization and darkness. There are some instances in the game that requires the rapid change of items in conjunction to platforming and running, which I had to do many times to get it right. There is also a surprising amount of platforming as a whole for a primarily adventure game. Some parts of Penumbra: Overture are really cool, there is no denying that, but it does have a feel of an unpolished low budget title. With that said, this is probably one of the best adventure games I have ever played. It is logical and tense at all the right moments. I am not entirely sure for how long the main character is inside the mine, but the glow stick lasts for the entire duration of the game. You are not forced nor expected to use the flashlight nor the flares, which have finite longevity. I found melee fighting to be clunky and awkward, but this did not detract from the overall gaming experience. The ending is very creepy and will keep you glued to the plot, even though there is much left without explanations. The only major downside is the game's length. It is somewhat short and leaves you with a feeling of unfinished business with a cliffhanger.  Penumbra: Overture is good.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so the best thing about this paranormal/survival horror game is the one thing many games out there don't have and which is my biggest peeve: ENVIRONMENTALLY INTERACTIVE. Yes, Finally, a game designer had a brain. I hate when there are things in the room and they are just made to look pretty and not be messed with, like part of the building's structure. If you see a book, you can pick it up. If you see a mattress, you can toss it, use it for a puzzle, launch it over a cliff. Glass can be broken. Hell, throw a barrel at your enemy and watch him stumble. How control how you pick it up and where you want it to go, Go play jenga with barrels and bags of garbage. XD  As for that, the rest of the game is very enjoyable in a very dark and strange way. The lighting, the atmosphere, the game dynamics. Very nice. Never had an issue with the game, including gameplay, puzzles, exploring. The game's sequel Black Plague is also just as enjoying, but not so much as the expansion Requiem.  I highly recommend this game.     NOTE: This is my opinions and thoughts of the game and not an overall view if the game for general audience. As with many reviews and opinions, take this with a grain of salt and do your own research.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished it and I gotta say this is one good horror survival game. Though it's now more than 7 years old, it's not bad looking. Not pretty but good. The controls take a little time to get used to but they're not awkward. The atmosphere of the game is just awesome. The music though there's very little of it also helps to create the feeling of tension. The story is mostly told by notes you'll find but it keeps you interested.   The only bad points I could say are some annoying parts where you're chased and need to find your way before getting killed. They can become frustrating......damn spiders! Also sometime the cursor won't appear yet you need to click on an item to do something. It will work if you click but if someone waited for the Icon before clicking they could miss something. These are minor things that should not keep you away from this great experience.  My advice is to save often with the strange artifact (glowing orange lights on it) or you can rely on autosaves. Get the Collectors Pack which has this game, the second part (Black Plague) and it's expansion so when you finish one you can jump straight in the next part. Really worth every penny. ",
            "review_score": "1"
        },
        {
            "review_text": "Control method sucks. In this game you don't hold objects they kind of hover below your hand. After about 30 minutes of trying to open that fecking hatch in the snow I gave up out of frustration as the rock kept dropping willy nilly and I was not able to control its height or position with any accuracy. Why do developers have to mess with tried and true control methods i.e. grab something and securly carry it until needed. Oh and make use of the laws of physics and allow you to throw or drop an item with at least a little accuracy. Just....frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "The torrent version works better than this, it keeps crashing after this one bit and everytime I exit the game it changes my monitor brightness to the max, It's like a constant flashbang had to turn my pc off and on just to fix it.",
            "review_score": "-1"
        },
        {
            "review_text": "OH HAI WE HAVE A ♥♥♥♥♥♥ AND COMPLETELY UNPREDICTABLE 2007 UI, LET'S MAKE ALL OF OUR PUZZLES EXTREMELY COMPLICATED!!!!!!!!  NONE of the puzzles make any sense. Every single different one I have had to use a walktrhough BECAUSE the interactions with items are NOT PREDICTABLE AT ALL. Sometimes you can pick up shovels, but in the next level you cannot. Why? I don't know, probably because the makers of this game wanted to make all the puzzles complex, but had to save space. I do not recommend this game for anyone who does not enjoy having to use walkthroughs and tear out their hair trying to figure out ♥♥♥♥♥♥♥ levels. I've been stuck on a level for THREE WEEKS. This is absolutely ridiculous.   Don't make your puzzles so complex and elaborate IF YOU DON'T HAVE ANY FORM OF STABILITY IN THE INTERACTIONS WITH YOUR ITEMS, JESUS CHRIST.",
            "review_score": "-1"
        },
        {
            "review_text": "Visually, this games lacks, but the game is older. The story, music, and atmosphere are pretty good ad the games certainly gives u the creeps. The problem I had was the game doesn't want to load in properly and would make my screen start twitching to the point where it was unplayable. And the save points were horrible. Several times the game would save right in a bad spot where it would load, and u would be dead 5 seconds later.  Maybe an older computer will have more luck, but not recommended by me.",
            "review_score": "-1"
        },
        {
            "review_text": "It's the first commercial release from Frictional Games, the guys who made Amnesia: TDD. There are a few high points in the game, like the good voice acting of the character named 'Red' and also unsurprisingly the atmosphere is great. But on the other end of the scale the 'combat system' is completely broken and the game has very loose ties to the personal story of the main character, because the whole game focuses on this 'Red' guy who in the end is very unimportant.  The sequel Penumbra: Black Plague is far superior, and at points is even better than Amnesia in my opinion. I know this is supposed to be a recommendation, but I quess I can also recommend people to stay away from games, so this one right here is definitely one you should skip.",
            "review_score": "-1"
        },
        {
            "review_text": "What a piece of ♥♥♥♥ of a game. This might have been really great but the gameplay mechanics is just so stupid and frustrating that I can't take any more. Try swinging a hammer...Come on, was this made so clunky on purpose? If so, then it's a lame way of making the game harder. AVOID unless you are some kind of a masochist and like reloading because a bloody basic thing like using a hammer makes you wnat to pull your hair out. The story seems so interesting, but the way controlling your character is made is just totally unacceptable.",
            "review_score": "-1"
        },
        {
            "review_text": "I finished the game ... and i finaaly can recommend this game .... its a very good game wid the tym of its release the graphics is good .. wel vcant comapre to now a days ... well a gamer lyk me who heavily belive in stroy lines and gameplay i really amazed by the presentaion as well as the gamelplay... some jump scares here n der but the most postive thng is its story n puzzle solvings ....some are very easy but it took tym to figure out ... i dnt belive in revealing the story .... its for those who play n discover by them selfs ..... all in all a great game .. the only hetd thng for me is its control to attack or distroy by using axe or anythng is annoying...... love frictional games ...well cant wait to play its sequel black plague..... its actually continue to the next game so i suggest u sud buy all collection",
            "review_score": "1"
        },
        {
            "review_text": "Great horror game. Its only negative is the clunky combat interface.",
            "review_score": "1"
        },
        {
            "review_text": "these games are AMAZING!! dont expect insane cutting edge graphics, but the atmospher, the sounds, everything keeps you on edge. by far one of the most impressive horror survival games out there. puzzles are alot of fun, and pretty realistic   absolutely hands down worth the money",
            "review_score": "1"
        },
        {
            "review_text": "The Penumbra Series is BRILLIANT!!! The graphics hold up even almost 8 years later. The story is amazing! There's good scares and great puzzles that make the series challenging. The best part about these games is the gameplay mechanics. The physics puzzles are great and even something as simple as opening a door is immensely satisfying and adds greatly to the realism and immersion into the creepy, frigid underground world. If you like the Amnesia games, get the original!",
            "review_score": "1"
        },
        {
            "review_text": "This game becomes automatically less scary once you realize you can kill the monsters with a cool but poorly executed combat system. Thankfully the puzzle designs make up for that. If you're looking to see how Frictional got their start, check this one out.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, really fun",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. As someone who played Amnesia before Penumbra, it was nice to see the precursor to Amnesia. The controls are identical, the atmosphere is terrifying and it's quite fun to imagine yourself in the protagonist's place. The main thing I'm slightly iffy about is how the story starts off. The warning that is shown when you first open the game is vague, but it makes you want to know more.    Would play again and again and again.",
            "review_score": "1"
        },
        {
            "review_text": "Generally I'm not a big fan of horror and/or adventure games. But Penumbra definetely got me. I won't call it a horror, but it's example of brilliantly done dark atmosphere. After finishing Penumbra Overture I felt not scared but rather depressed. Which games rarely suceed for me.  I suppose you should check it. Penumbra Overture is worthy gem.",
            "review_score": "1"
        },
        {
            "review_text": "A zombie dog saw me so i jumped on top of a box, and hit it with a hammer till it died I opened a door and a gigantic worm tried to eat me A gigantic horde of spiders tried to eat me when i climbed in a tunnel  Then i played this game 10/10 would almost die then play this game again",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the first Horror games I ever played. If it had been any other, I may never have fallen in love with the horror genre itself. I believe a good horror game needs buildup: A proper story, atmosphere... any game can tell a story; it takes a hell of a good game to make you feel like you've lived it. I reccomend this game, and give it a 9.5/10. It set in stone a standard that many games would follow after, such as Outlast, and it's own successor, Amnesia, with it's surivival/psychological elements.",
            "review_score": "1"
        },
        {
            "review_text": "This game went largely unnoticed, but if you want to experience fear like you've never known you must try this game.",
            "review_score": "1"
        },
        {
            "review_text": "there arent any shotguns in this game!  FAIL  3/10",
            "review_score": "1"
        },
        {
            "review_text": "Had to hide from these dogs most of the time, then I'd wack them when they were distracted, and the spiders got me paranoid ♥♥♥ f***, but were fun to kill   7.8/10 too many dogs",
            "review_score": "1"
        },
        {
            "review_text": "got no idea what to say,well this is amazing game its not even a horror couse you got weapon and you can protect your self,there is also no scares (jump scares or monster jumping at you) and that is very disappointing for me :( , but still the story is amazing + its an a hard game just like the second one-The Black Plague.  and its got one bad thing about it(controls tottaly s*cks balls), hitting key with a pickaxe or the hammer-you have to like move you hand from left to right to hit, k this game totaly s*cks balls but the story is amazing if you want a real horror expirianse you should play the Penumbra:Black Plague and its an a great deal to get this 2 cool game only in 10$. :)  The Rate about the game is = 8/10 and The Black Plague = 10/10  very recomend to buy this 'Penumbra Collectors Pack'.",
            "review_score": "1"
        },
        {
            "review_text": "Sure I've only played an hour of this game, but I've already learned everything there is to know about it. It's lame! Your character doesn't have enough motivation for me to actually care about him. Plus his voice sounds really weird, so yeah. The creatures are just kind of there. I mean, a dog? Did they market this game to a community of mailmen? But seriously it's actually pretty alright.",
            "review_score": "1"
        },
        {
            "review_text": "The mouse is really buggy in the Mac client and renders the game unplayable. :(",
            "review_score": "-1"
        },
        {
            "review_text": "Shadowy, creepy, unsettling and has a great atmosphere...",
            "review_score": "1"
        },
        {
            "review_text": "Overture actually aged fairly well! Explore abandoned mine shafts with fearsomely mutated creatures. Taking them head on is not advised, so you must use stealth and physics to defeat them. Defeatly worth a play, especially if on sale or in a humble bundle!",
            "review_score": "1"
        },
        {
            "review_text": "A nice immersive horror games that doesn't rely on cheap scares and relies on atmosphere and immersion to make the player feel like he is really hopeless and fighting for survival, the game is fairly short in length which is a bit disappointing but the areas are well thought out and for a game that doesn't have a big budget i think they have done the best with what they had i give it 81/100 and my own personal hooray!!!",
            "review_score": "1"
        },
        {
            "review_text": "A gamed stacked with lots of clever puzzles and horror elements, Penumbra Overture is guaranteed to give you an amazing experience.  ",
            "review_score": "1"
        },
        {
            "review_text": "great immersive gameplay that is bone chilling",
            "review_score": "1"
        },
        {
            "review_text": "Was pretty good, asmopheric and a little scary! The audio makes it kind of obvious when you should be sneaky though...",
            "review_score": "1"
        },
        {
            "review_text": "If you don't play this game we cannot be friends and I will not respect you as a proper human being.",
            "review_score": "1"
        },
        {
            "review_text": "classsic scary game , stealh and puzzle in a strange twist! play with lights off and headphones on",
            "review_score": "1"
        },
        {
            "review_text": "A shaky start to the series, but still has its moments.",
            "review_score": "1"
        },
        {
            "review_text": "There is nothing more captivating knowing each step you take may lead to danger or another piece of the larger puzzle. Striving to keep forward, travelling deeper into the abyss and it's creatures... No way out. You must carry on.  Unlike it's newer cousin Amnesia: The Dark Descent, Penumbra Overture is a different kind of scary. Different, but good.",
            "review_score": "1"
        },
        {
            "review_text": "A spirtual precursor to Amnesia. I found the Penumbra series had great atmosphere, and a hopelessness that Amnesia couldn't replicate.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, I loved every minute of it, terrifying, good puzzles, gretest atmosphere ever. Definitely one of my favorite game so far !",
            "review_score": "1"
        },
        {
            "review_text": "Dude... This game is awesome. Well, it's awesome, if you like to get scared. This game ACTUALLY made me go 'Oh god, wtf... oh god... OH GOD! GET AWAY FROM ME! GODOGDODGODGODGODGODG JESUS CHRIST HOLY-- holy... jesus.' Then there was this time where I was running and way like 'GOD OH GOD!' and screaming and stuff, then my friend decided to say in my ear in that creepy a** voice of his 'Run, run, as fast as you can! You can't escape me, I'm the gingerbread man!' and I was like 'SHUT THE HELL UP!' This game... is... in my opinion... SCARIER THAN AMNESIA. Amnesia is more of the psycological horror, and there are those zombie things, but it's just... unsettling. Penumbra, is that, PLUS a freaky a** dog that is HALF MAULED, AND creepy notes everywhere that say things like 'I came down here with four of my colleges and learned a few things...' then later it says '...and humans are tasty.' And you know what is next to that note? A big stain of blood... alright?... And two pairs of BLOODY BOOTS! NOT COOL MAN! And when you read this note, guess what you're hiding from? THE FREAKING DEMONIC HALF-EATEN DOG!! So yeah. Creepy atmosphere, freaky scary creatures, and it ACTUALLY managed to scary me. ME! I'M the one, who laughs at people when they say that Slender is scary. I'M the one, who reasons with people to say that Amnesia isn't very scary, but it's pretty startling. The devs knew what they were doing. The story is pretty good, too. The graphics... They're good for what they use it for, and for 2007, but it's really not that great, and I notice texture glitches everywhere. Bottom line is, if you like to get scared, this game is for YOU.",
            "review_score": "1"
        },
        {
            "review_text": "Worth playing even though there are some design issues. My main complain is the combat (or what's there of it, at least). I know it's suppose to be a stealth game but there are times when you have to fight and the controls are just a mess. Still, worth checking out for the storyline, which is intriguing.",
            "review_score": "1"
        },
        {
            "review_text": "Great atmosphere with controls that enhance the atmosphere. If nothing else, admire its game design. If you want a scary game, do it.  Very point-and-click adventure kind of mentality. Puzzle, find the maguffin, use maguffin, GET SCARED, proceed.  There is combat, but it only hurts the game, I think. It is my only complaint. So if you'll let that slide, it's a great buy.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of the old survival horrors like the Resident EVil series (before 5) and Silent Hill then this game is a must. Immerse yourself in this awesome world. Have to warn you tho there are a few minor glitches if youre running a old comp. And its best not to go for head on combat in this game. Run, hide, use your wits in order to survive this horror.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game for people who like horror",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing. The best terror game I have ever played, and I have played a lot of them. It requires some serious thinking, but I consider that a plus.",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking at this game, it's most likely because you've heard of or played the famous Amnesia: The Dark Descent made by the same developers. Penumbra: Overture is Frictional Game's first game and it definitely shares characteristics with Amnesia.  The mood and style of the game is similar to Amnesia. The lighting and eeriness of the locations set the tone of places you'd rather not be at. Notes are scattered throughout the game, providing background history of the places you travel through. The game is also physics based, but unlike Amnesia, you are allowed to have weapons, which does suggest that there is some form of defense. However, the physics nature of the game requires the player to manually swing melee weapons by moving your mouse back and forth. Nothing quite as fun as swinging in panic! In addition to these, there are quite a bit more puzzles to solve, but nothing that is frustrating and some have satisfying complexity.  If you're buying this game thinking you'll get the same experience as you did when playing Amnesia: The Dark Descent then you will be off the mark. While it does share Amnesia's atmosphere of horror, its level of execution isn't the same. A play through the game shows that a lot of thought went into finding ways to instill fear into the player, but it's unable to maintain the same pressure throughout the game. If you want to get the same scares as one would get playing Amnesia, then you'll be disappointed. But if you're interested in playing a horror game or seeing Frictional Game's earlier works, then it's worth picking up this title.",
            "review_score": "1"
        },
        {
            "review_text": "the first horro game series by frictonal games and I was scared at the first time",
            "review_score": "1"
        },
        {
            "review_text": "I don't care that they give you a hammer. Run. Run away from everything.",
            "review_score": "1"
        },
        {
            "review_text": "Considering it is a low budget game, I gotta say it's a pretty darn good game. But the puzzles are hard and your not left with alot of help either. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "i loved the game. i have played penumbra requiem, black plague and overture but this one is the best and most interesting. is there a chapter/episode 2?",
            "review_score": "1"
        },
        {
            "review_text": "I have seen several let's plays of this game and now that I have played it myself I have realized a few things. -Compared to Amnesia: the Dark Descent the controls were a little sloppy (for me at least), if not, it was at least not the most efficient set up. (Now this isn't so much as a negative system, but it might be too efficient causing to no longer be efficient). -The only story of this game is: get through the mines. Now while you traverse the mines and caves you get hints at what the next game will hold. Red also explains what has happened and what is still happening. Now ... to actually get or say this has any plot to it: you have to read the notes, and listen to Red. -Another comparison to Amnesia: the Dark Descent is in this game you almost never have a time of absolute darkness to where you cannot see in front of you.  -Although the puzzles were good and some were very easy; unless you have seen someone else, have maps of the game, or even have a walkthrough ... there are no initiatives for directions of how to work the puzzles (although Red does help a little it is very easy to miss his times of speech especially when being chased or if you are in hiding). There or the 'To Do''s but unless you have clicked on something that requires reminding, it is very unhelpful/useless. -Now this game is the first commercially released game that Frictional Games has done and therefore deserves a high rating of amazement from an avid gamer to the company. I definitely recommend this game to others who are looking for a game to play.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting horror and exploration game.",
            "review_score": "1"
        },
        {
            "review_text": "this is a very fun game to play at night really scarry",
            "review_score": "1"
        },
        {
            "review_text": "What a scary and sometimes cheesy little FPS horror puzzle game. I recommend.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game because someone suggested I play it and they told me it would scare me. And it did. and I had fun. So get scared, have fun and get this game",
            "review_score": "1"
        },
        {
            "review_text": "Rough around the edges but still amazing .",
            "review_score": "1"
        },
        {
            "review_text": "As a librarian, I love to see how things evolve into different forms overtime. I am an avid fan of horror games, and it was a treat to see how modern gems have stemmed from these classics.",
            "review_score": "1"
        },
        {
            "review_text": "I've tried playing but there's a bug in the game! I can't seem to move the shelves ! Can someone help me please ?",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game before, at least I think I have. I don't know if there's a glitch or it's me but I cannot get the contol panel in the Refinery to work. I get no hand icon. Would I recommend it, yep if I can figure out what I'm going wrong.",
            "review_score": "1"
        },
        {
            "review_text": "I swear to god, this is the scariest series ever, the only reason it didnt scare me as much as black plague (Which is less scary), is because i got stuck on many of the puzzles, also it's not as creepy in the beginning, it gets scarier and scarier... and then you tense up so hard you become constipated for a week. [true story]",
            "review_score": "1"
        },
        {
            "review_text": "Perhaps not as scary as Amnesia, but still contains a creepy atmosphere and the music is sick. Worth playing for fun in a dark room ;)",
            "review_score": "1"
        },
        {
            "review_text": "Overture and Black Plague are two halves of the same game. Overture is part 1, Black Plague is part 2. The second part is a direct continuation and has the same game mechanics/gameplay (except a few minor differences) so this review is for both games.   First of all I rate this 9/10. Part 1 has terrible combat and that's the only reason it's not a 10/10. Luckily the devs seemed to realize how bad the combat was and completely axed it in part 2, so like Amnesia you must run from or outwit monsters instead of engaging them.  Overture is primarily a puzzle solver. It's not too scary, but it does have a creepy atmosphere. What I love about Frictional Games is that their puzzles are very sensible, although there were a few here that had me really confused. Part of the problem is that you have to destroy your environment sometimes, but there's no indication which objects are destructble and which aren't- and sometimes you have monsters on your heels, so it's hard to look around and search the environment to figure out what to do before you die.  Black Plague is where the game starts to get really interesting. It has an AMAZING story, and in addition to good puzzles (less environment destroying in this one) the setting is truly horrific. Amnesia didn't scare me, but this game did. It doesn't even use cheap pop-ups, (well a few) instead relying on music/sounds and unsettling atmosphere. Psychological horror at its finest.  The story is intensely engaging. You will care about the friends/family the protagonist (Phillip) encounters in his journey. There are many sad moments. But the true meat of the plot lies in an ancient mystery you will slowly unravel as you discover the many notes, books, and strange artifacts strewn throughout the mining/research facility. The ending is satisfying in that it gives you the answers you seek and doesn't leave you hanging, although I was somewhat disapointed that you appear to be presented with a choice, yet your character can only make one in the end.",
            "review_score": "1"
        },
        {
            "review_text": "Really ♥♥♥♥ing good horror/puzzle game, like Amnesia's son.  But you will probally end up Googling some ♥♥♥♥ up to be completely honest; or i'm probally just ♥♥♥♥ at puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "Penumbra Overture is a great little horror game. It is plain to see that it is a predecessor of Amnesia: The Dark Descent. There are many similarities within the imagery, gameplay and storytelling. For Amnesia fans seeking more content, this series is definitely worth playing.   The setting, an underground mine, allows for a certain amount of isolation and otherworldliness. I am not claustrophobic at all and didn't find the envrionments particularly scary, but I can appreciate that it is an eerie setting. I enjoyed the feeling of being deep within the ground.  At times the game reminded me of John Carpenter's The Thing, one of my favorite films.  The game would have benefited from far fewer enemies. They can be easily killed but the controls make it time consuming and frustrating. Killing enemies became repetitive and felt like a chore, but it was a necessary evil... it didn't make any sense to waste time sneaking back and forth repeatedly in the hub environments when the enemies are so easily killed.  The storytelling was very well done. Most information is gathered through found writings. The writings were extremely effective at building the world and adding tension to the game. Generally I was excited to find a new note to read, with a morbid curiosity of what information I would discover.  The controls are somewhat clunky and finicky. For the most part it doesn't affect gameplay because you can explore at your leisure. Perhaps it adds to the fear when you are fumbling around in a hurry.  There are scripted sequences where it becomes a problem. This is because a certain amount of precision is required and the clumsy controls don't allow for that easily. Add to that a healthy dose of guesswork. I was disappointed when I had to replay scripted sequences 4-5 times trial-and-error style. That type of frustration is the fastest way to break immersion and remove all fear from the situation.  There is no manual save and the auto-saves are far apart considering how easy it is to die. I have been spoiled by newer games, but it was really annoying the few times I died and lost a bunch of progress. Minor gripe!  I came to the Penumbra series as a fan of The Dark Descent, looking for a similar horror experience. Overture is obviously not as polished as The Dark Descent but it is well worth playing. I am glad I was able to do a blind playthrough and have another great experience courtesy of Frictional Games.  Replay value is not really there for me. This is only due to the controls and the repetitive enemy encounters. The game itself isn't something I will soon forget. Great ending! I'm looking forward to the next game, Black Plague. From what I hear it's even better than Overture.",
            "review_score": "1"
        },
        {
            "review_text": "Too spooky for me",
            "review_score": "1"
        },
        {
            "review_text": "there's some bad bugs/exploits in this game, but this game is pretty much superior to amnesia in every way 10/10 go play this right now",
            "review_score": "1"
        },
        {
            "review_text": "Like zombie-dogs and giant spiders? You sure won't after playing this game.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game! Everything is amazing and beautiful! I just can't describe it... just play it!",
            "review_score": "1"
        }
    ]
}