{
    "app_id": 221910,
    "name": "The Stanley Parable",
    "release_date": "2013-10-17",
    "developer": [
        "Galactic Cafe"
    ],
    "publisher": [
        "Galactic Cafe"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Captions available",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Comedy",
        "Narration",
        "Indie"
    ],
    "achievements": 10,
    "positive_ratings": 31538,
    "negative_ratings": 2846,
    "price": 9.99,
    "description": "The Stanley Parable is a first person exploration game. You will play as Stanley, and you will not play as Stanley. You will follow a story, you will not follow a story. You will have a choice, you will have no choice. The game will end, the game will never end.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/221910/header.jpg?t=1465254276",
    "minimum_requirements": "OS: Windows XP/Vista/7/8 Processor: 3.0 GHz P4, Dual Core 2.0 (or higher) or AMD64X2 (or higher) Memory: 2 GB RAM Graphics: Video card must be 128 MB or more and should be a DirectX 9-compatible with support for Pixel Shader 2.0b (ATI Radeon X800 or higher / NVIDIA GeForce 7600 or higher / Intel HD Graphics 2000 or higher - *NOT* an Express graphics card). Storage: 3 GB available space Sound Card: DirectX 9.0c compatible",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Laptop battery died and I thought it was part of the game.  11/10.",
            "review_score": "1"
        },
        {
            "review_text": "At it's core, it's a playful mockery of video game storytelling themes. The writing is clever, and the narration is charming, while also managing to be just a little unsettling. It's a game, so much in that you control movement and press buttons. But there isn't any combat, and the freedom of choice is just an illusion (which is kinda the point). It's meant to be played over and over again, just to see the different reactions you can get from the game. And there are many many reactions to find.  And if this doesn't sound like something you'd want to spend any time with, you can always treat it like a really obscure easter egg hunt. Because there's a ton of those too. If you are like me, and you try to break a game just for fun, you might find out that this game considers it a legitimate storytelling branch.  And if that doesn't sell it to you either, you can consider it a narrator annoyance simulator. It's something for everyone, provided you like these three things.",
            "review_score": "1"
        },
        {
            "review_text": "What a cute little gem. Never has a game broken down the forth wall this much and I embrace it this willingly. And the achievements are some of the most creative and amusing ones to unlock. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Stanley decided to write a review for the game, unfortunately the review was neither helpful nor informative. It failed to cover both the linearly non-linear gameplay and narrative techniques used. Perhaps he was writing it just for the steam badge, he certainly hadn't reviewed nearly as many of the games in his library as he should have.",
            "review_score": "1"
        },
        {
            "review_text": "This game left me with a sense of emotional insecurity like a hole in my heart. With that being said, this is one of the most creative and incredible plots that I've ever had the privilege to play. It pulls you into an ever changing relationship with the narrator that becomes the most important part of the game. Put simply, fear+humor+sadness+beauty+confusion-everything you know about gaming=The Stanley Parable.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't know what to write about in my review, so here's a recipe for pancakes instead:  1 1/2 cups all-purpose flour 3 1/2 teaspoons baking powder 1 teaspoon salt 1 tablespoon white sugar 1 1/4 cups milk 1 egg 3 tablespoons butter, melted  1. In a large bowl, sift together the flour, baking powder, salt and sugar. Make a well in the center and pour in the milk, egg and melted butter; mix until smooth.  2. Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.  ~ I'd also like to thank Shaz Cited",
            "review_score": "1"
        },
        {
            "review_text": "A walking simulator done right. A game that's extremely aware of itself and the player, and uses its meta narrative in clever, inventive and enjoyable ways, unlike 90% of indie trash. Humor, horror, drama - it does it all and does it well. Has surprising amounts of replayability.  Update: Nominated for the 'Whoa dude' steam award.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't know anything about this game when I first loaded it up and started playing. My son had watched videos of it on Youtube and told me it was a game I had to play...and to avoid spoilers. So I bought it and took a chance.  I managed to kill myself in less than a minute...and I didn't stop laughing for at least half an hour. The voice acting is fantastic and so is the crazy, winding, bizarre story.  I absolutely love this game.",
            "review_score": "1"
        }
    ]
}