{
    "app_id": 22230,
    "name": "Rock of Ages",
    "release_date": "2011-09-07",
    "developer": [
        "ACE Team"
    ],
    "publisher": [
        "SEGA"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Racing",
        "Strategy"
    ],
    "tags": [
        "Comedy",
        "Indie",
        "Strategy"
    ],
    "achievements": 19,
    "positive_ratings": 2604,
    "negative_ratings": 244,
    "price": 6.99,
    "description": "A rock-solid combination of rock-rolling action, deep strategy, and captivating art and music from different ages of history, this is a game of crush or be crushed!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/22230/header.jpg?t=1554202877",
    "minimum_requirements": "OS: Windows XP/Vista/7 Processor: Dual Core 1.6 GHz or better Memory: 1.5 GB or higher Graphics: 256mb video ram or better (GeForce 7 series or higher/Radeon HD3000 series or higher) DirectX®: 9.0c Hard Drive: 1.2 GB Sound: Windows supported Sound Card Internet: Online play requires Broadband Internet Connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "A surprising little gem of a game, Rock of Ages is one of the strangest games I've ever played, and can be best summed up as Monty Python meets Super Monkey Ball meets bowling.",
            "review_score": "1"
        },
        {
            "review_text": "Roll your way through history as Sisyphus and his boulder. Flatten historical figures and classical concepts. Rock of Ages has a great art style and is a robust tower defense game that offers a different twist on the tower defense genre. You have to both protect your base and attack the enemy’s fortifications as a boulder that can be upgraded. Rock of Ages also has a great sense of humor which is highlighted in its cutscenes featuring both modern and historical references. Overall, it is a rock solid game that is worth playing both for its fun story and gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Comical but short, Rock of Ages is an fun little game filled with humorous jokes and scenes about various historical characters and time periods. It won't take you long to complete (it took me roughly six hours in total playtime, some of that just mucking around), however the way in which it combines traditional tower defence elements with intense rock-rolling action leads to a fresh and unique gaming experience.   So, should you buy it?  Hard to say. While you don't get much 'bang for your buck' in terms of hours compared to other games, it's nevertheless a unique experience - you'll have to make your own mind up on this one :P",
            "review_score": "1"
        },
        {
            "review_text": "Do you like rocks? Do you like towers? Do you like  rocks attched to towers (if you know what I mean...)  rocks smashing through towers?  Then, BOY do I have the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "You have to shoot Appollo in the ♥♥♥♥ with cannons, you can play as Bachus, patron of the half-naked, drunk fat people  Now that's out of the way, let's review. The game is best summed up as 'Monty Python Bowling'. It has a phenomenally executed art style. The 2d cutscenes and menu screen look like something John Cleese would've designed himself.   As for the gameplay, essentially you have to set up a tower defense on your side of the mountain (there are over 20 maps) and get through your opponent's defence using a rather inert boulder, similair to those platformer bowling games. Your workers make a new boulder every now and then and it takes a while to smash the enemy castle. The gameplay is somewhat balanced, although cow defences are sadly underpowered.   The game itself is worth buying for the sole reason of how climatic it is. It has a fair price for shooting Appollo in the ♥♥♥♥. With cannons",
            "review_score": "1"
        },
        {
            "review_text": "If you want originality, this is probably the game for you. Just think about this :   It's a mix of action platformer and tower defense, which is quite a start   The most famous pieces of art in history are used as assets   Cutscenes are Monthy Python-esque movies parodying hisctorical figures   You can crush Leonardo da Vinci as Napoleon. And that's just an example   Michelangelo's David statue is a boss, and it scratches its butt when bored  This is just a few examples of the crazy things that can happen in this game. And it's not just about the humor : the gameplay is also interesting.   To summarize it, it is a duel between two players (using crazy historical figures avatars) who both are on one side of a symmetrical map. The game alternates between a phase where you buy traps to set on your opponent's side, and a phase where you try to roll your boulder down your side of the map. Your opponent obviously has set up traps on your side (as you did on his), and you have to try taking as little damage as possible from them in order to damage the door at the bottom and eventually break it.  All of this in real time so you have to be quick as well.  It's a bit of a shame that the AI is fairly easy to exploit (a wall with catapults behind will usually wreck it). The AI also isn't the best at laying down the best trap combinations on your side of the map. Because of this the campaign will not resist you for long if you are a veteran gamer. Casuals should like this relaxed experience, though.  If you can find a friend to play with online then the true potential of the game mechanics shines through.  The game isn't very expensive anyway, so I still recommend it if you don't have a human opponent : the few hours it'll take you to see all the jokes and complete all the solo games modes are well worth it already.",
            "review_score": "1"
        },
        {
            "review_text": "A very goofy game from the Zeno Clash people.It's sale price is easily worth it. It's kind of like....bowling warfare with Monty Python transitional humor. Closest thing I can think of to this game is Odama on Gamecube. I didn't actually finish it, as I found it to have too many stages, and the same strategy works for almost all of them, but it was definitely fun for a few hours. It has a neat skiiball minigame too.",
            "review_score": "1"
        },
        {
            "review_text": "Boom bam, shatatah, you're a beautiful boulder. ( ͡° ͜ʖ ͡°) Roll down and kill that dude, already. THIS IS SUCH A FUNNY GAME, good on ya, devs. ",
            "review_score": "1"
        },
        {
            "review_text": "It's like Monty python with giant rolling balls. A really fun game. picked it up on sale and i don't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Rock of Ages is a charming, humorous, and highly original game.  The basic premise is this: you control a boulder rolling across a twisted battlefield of ramps, obstacles, and enemy traps. Your aim is to destroy your opponent's gate.  As you destroy your opponent's defenses, you accumulate money to spend on building upgrades. These upgrades can be either single-use power-ups for your boulder to make it stronger or more deadly. Or, you can spend the money on defenses like elephants, dynamite, and catapults that can knock your opponent's boulder off the map. You get to place these obstacles wherever you want on the map.  So, on one hand RoA is like a wacky driving game, but on the other it is like a tower defense game. The balance between these two is perfect -- it is fast-paced and really executes the central mechanics well.  Where the game really shines is the campaign and art direction inspired by Art History. Each level has you progress from ancient Greece, across Europe and through various artistic styles. In Italy, the levels have a High Renaissance art theme. There is Rococo in France and a Romantic (Goya-inspired) theme in Spain. And each level unlocks a new type of defense (dynamite, flying machines, ). for you to place in your. Perhaps the only issue is difficulty: it may be too easy as the AI is good at placing defenses but not so great at driving its boulder. But if you want more of a challenge there is always the multiplayer or the time trial mode (with scoreboards), so the game does not get old.  Basically, if you like the look of the game from the trailers -- get it! It delivers.",
            "review_score": "1"
        },
        {
            "review_text": "This game was just pure enjoyment for me from beginning to end. It's fairly short and even if you do all the content you'll still probably be finished with the game in less than 20 hours. It's just a very silly and fun game though.  It controls kind of like Marble madness. It's a racing game where you control a giant boulder and have to try and make it to the end of the stage without getting the boulder damaged. This is harder than it sounds because while you are trying to make it to your opponent's castle to destroy it, they are trying to make it to yours.  You can place traps down to mess up the other boulder. These are things like giant fans to blow it off the stage, elephants to crush it, and canons to blast it off track.  This game has a great sense of humor and makes countless references to classic artwork and history.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like the cartoon sketches of Monty Python? Do you like smashing things like houses, poeple etc.? Do you like classical music? Do you like the Rolling Stones? (Oh, the puns)  If all those questions are answered with a yes, then you should consider buying this game.  However, this game is short. I completed the main story in a weekend and collected all 'collectables' in 2 weekends.  But the humor of the game really outweighs the fact that it is so short.  In conclusion, I rate this game 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "One of best and artistic games i have ever played. This game is so wierd and creative in it's design, there is nothing to compare it to in games. Looks like Monty Python plays like awesome mix of tower defence and bowling. A game this unique can only come from indie devs.",
            "review_score": "1"
        },
        {
            "review_text": "This game is as solid as a rock.",
            "review_score": "1"
        },
        {
            "review_text": "this is hutdfhfhugjgjgjjfffffyihiphip[hipc uiuyiu y",
            "review_score": "1"
        },
        {
            "review_text": "Good fun for a few hours. Multiplayer seems dead though. Worth it for $5 or less I would say.",
            "review_score": "1"
        },
        {
            "review_text": "A beatifly funny games from he-goats to Steven Hawking saying ridiculus things, 9/10",
            "review_score": "1"
        },
        {
            "review_text": "They see me rollin, they hatin",
            "review_score": "1"
        },
        {
            "review_text": "Recommended if you were looking for some hilarious game",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun, the TD mechanic is fun as heck! Rolling is so fun!",
            "review_score": "1"
        },
        {
            "review_text": "I genuinely never believed that I would feel sorry for the Plague, then proceed to smash him and his cows with a boulder.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game. good music, interesting (sometimes 4th wall breaking) story with funny references to for example 'lord of the rings' and '300'. amazing boss battles and a cool versus mode. 8/10!",
            "review_score": "1"
        },
        {
            "review_text": "  A really fun game to play with friends, with a funny campaign to go along.  Purchased the game when it was like 1 euro on sale, and it was the best euro I've ever spent. The online connection never seemed laggy to me, we had great laughs with friends, I couldn't ask for more.  The campaign is actually really well made for you to learn the maps, and getting all the keys is not that easy.  I would recommend to buy it with some other friends, you won't regret it",
            "review_score": "1"
        },
        {
            "review_text": "Some of the most unique and humorous play in 'Ages' this is one of those games that will keep you playing just one more level.   You play as a giant stone ball (with various faces inscribed) and you must roll through the levels while avoiding opponent laid obstacles to stay intact enough to smash into the enemy fortress gate. Each time your stone ball is destroyed and must be rebuilt. You use the downtime to purchase and place defenses because your enemy is rolling his/her giant ball at your gate. The first person to break the gate and roll over the tiny person inside wins.  Interspersed throughout the game are massive boss encounters such as the giant winged baby head or a giant Michealangelo's David statue (which you must of course smash in the fig leaf). This helps break up the gameplay a little with unique experiences often involving some laughs.  It's a great little title that smashes art history, mythology and humor together for great fun. Can't recommend this enough at sale time. You'll always get your value's worth.",
            "review_score": "1"
        },
        {
            "review_text": "Obligatory header to the review: I focus on four primary areas whenever I review a game: gameplay, story, graphics, and sound/audio/general things that go into your earholes. Gameplay and Story get a rating scale from 1 to 10, and the AV stuff gets a rating from 1 to 5. My philosophy on this is that there are some instances in which a game may not necessarily have that much in the way of gameplay (take Amnesia for example), but the story/atmosphere/whatever it may be is reason enough to pick it up. Also, take the cumulative score with a grain of salt; it's just a numerical feeling about the game as a whole. That's part of why I do these subscores. Also, keep in mind that I'm not going off of school grade based rankings. A 5/10 denotes what I feel to be an average game. Likewise, 7/10 is a game that I think is pretty cool, and something that gets a 2/10 is near-abomination level. Pinning scores to an even further obfuscated rating scale is kinda senseless, but for the sake of my backloggery, I'll repeat again that 1.0-2.7 is a one-star game, 3.0-4.7 is a two-star game, 5.0-6.7, 7.0-8.7, and 9.0-10 are three, four, and five stars, respectively.  Gameplay: Man, Atlus sure does publish a lot of weird games. This game is no exception to that. Rock of Ages is a game where you roll a boulder down a hill at a tower gate and try to break in; most commonly requiring three boulders; although requiring four if any one boulder gets particularly roughed up. This roughing up comes from the placement of towers in the pre-rolling phase that both you and your opponent go through. Yes, this is a tower defense game technically, but don't think you can win on strategy alone. It certainly helps; especially in a resistance-based setup involving the world's supply of Ballistae and stone towers, but there's more often than not a crafty way of bypassing these cheap setups with some crafty platforming.  One of the things that you'll learn while playing this game is that keyboard control is only half the story. Your main method of steering the ball is with the mouse, which feels quite natural and works well. The boulder, as one can imagine, has quite a bit of inertia to it, so you have to plan accordingly for harsh turns. You can see a mirror reflection of the stage on your side, but you cannot see the enemy's side apart from when you are rolling. While I would've liked an outline map of the other side, it's not too big of a deal. The stages themselves can either be as simple as a straight line or a simple one turn spiral down or as complex as a multi-leveled complex of paths. There are some shortcuts that you can take throughout the stages; some are easy to defend against, while some are more difficult, if not impossible. Nevertheless, you have access to the same shortcuts, so it remains fair.  This is one of the easier Atlus games that I've played, and the average player will find a reasonable difficulty curve to it. I have noticed a weird AI bug that came up a couple of times where the opponent got stuck in a reset loop, thus throwing the match. I'm not too sure on what causes that, as I have tried to replicate the bug, but to no avail. When the AI doesn't throw a match, however, you'll find that they are pretty decent at setting up their defenses and breaking through yours. There are boss fights in this game, but they're definitely not highlights. I've talked in the past about games that don't really need boss fights but still have them, and this is one of those games. They're not bad by any measure; they just feel out of place.  Overall, I can recommend this game well enough on the gameplay alone for providing an interesting take on the tower defense genre as well as being a pretty fun strategy game. It'd definitely be even more fun with a friend. 8/10. P.S. cool kids use the Block of Ages  Story: This game has roughly the storyline of a Terry Gilliam sketch, which is basically a sentient rock and his buddy travel through the years to become the best rock. Each stage has their own intro, which can be a groan-worthy reference to a meme, a very loose reference to an historical event, or just a general bout of silliness. Nevertheless, the ones that weren't solely based on predictable memes did get a laugh out of me. The cutscenes are worth a watch; that's for sure. 7/10.  Graphics: The comedic nature of this game certainly does not stop with the writing. Remember the Terry Gilliam comparison? Pretty much all of the cutscenes in the game are done in Gilliam's style. The stages themselves have a very 'painted' feel to them, and the skyboxes can be absolutely gorgeous with the lighting working with the paintings in the skybox perfectly. All of the characters are basically ripped from classical paintings, but it all feels consistent in the very weird (and very good) visual design of the game. Regarding the technical aspects of the game, it does run with minimal impact on my system at 1080p max settings at 60FPS. Shadows do that weird thing where it looks like blinds have been cast, which can be a bit distracting at times, but other than that, the game runs well enough. I'd imagine that a low end graphics card or maybe even one of the newer integrated graphics chips could run this game perfectly. 4/5.  Sound: I'm not an expert on classical music (nor do I claim to be), but I do recognize a couple of songs in this game, and that leads me to believe that the soundtrack is almost entirely non-original. That's not a bad thing, though; it fits very well and is often comically overdone for the scenario. The stage music does feel like something from the period that you're in, so that's something. There's no voiceacting, apart from some random mumbling and comically cliched screams. Again, the audio helps propel the very silly nature of this game. Even though it's not all original music, it fits well enough that I can still give the audio a 4/5.  Overall scores are 8/7/4/4; cumulative score of 7.7/10. Definitely worth the buy and definitely worth playing with a friend. You're sure to have a good time.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most fun game ever made. It has a hilarious Monty Pythonesque style in its artwork and comedy, the gameplay is fun and racing your friends as the BLOCK OF AGES is the best experience you could ever have.  Buy eeet.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly unique and silly boulder racing game. Some of the mechanics they chose to go with need far more depth, preferably in a sequel, but as it stands this is certainly worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Made Leonidas scream like a little ♥♥♥♥♥ before I crushed him. 11/10 Would buy again  Made Napoleon even smaller with a big boulder 12/10 Would play again  Threw a rock in the face of God in Heaven 13/10 Why are you still reading this? go buy it!",
            "review_score": "1"
        },
        {
            "review_text": "░░█▀░░░░░░░░░░░▀▀███████░░░░  ░░█▌░░░░░░░░░░░░░░░▀██████░░░  ░█▌░░░░░░░░░░░░░░░░███████▌░░  ░█░░░░░░░░░░░░░░░░░████████░░  ▐▌░░░░░░░░░░░░░░░░░▀██████▌░░  ░▌▄███▌░░░░▀████▄░░░░▀████▌░░  ▐▀▀▄█▄░▌░░░▄██▄▄▄▀░░░░████▄▄░  ▐░▀░░═▐░░░░░░══░░▀░░░░▐▀░▄▀▌▌  ▐░░░░░▌░░░░░░░░░░░░░░░▀░▀░░▌▌  ▐░░░▄▀░░░▀░▌░░░░░░░░░░░░▌█░▌▌  ░▌░░▀▀▄▄▀▀▄▌▌░░░░░░░░░░▐░▀▐▐░  ░▌░░▌░▄▄▄▄░░░▌░░░░░░░░▐░░▀▐░░  ░█░▐▄██████▄░▐░░░░░░░░█▀▄▄▀░░  ░▐░▌▌░░░░░░▀▀▄▐░░░░░░█▌░░░░░░  ░░█░░▄▀▀▀▀▄░▄═╝▄░░░▄▀░▌░░░░░░  ░░░▌▐░░░░░░▌░▀▀░░▄▀░░▐░░░░░░░  ░░░▀▄░░░░░░░░░▄▀▀░░░░█░░░░░░░  ░░░▄█▄▄▄▄▄▄▄▀▀░░░░░░░▌▌░░░░░░  ░░▄▀▌▀▌░░░░░░░░░░░░░▄▀▀▄░░░░░  ▄▀░░▌░▀▄░░░░░░░░░░▄▀░░▌░▀▄░░░  ░░░░▌█▄▄▀▄░░░░░░▄▀░░░░▌░░░▌▄▄  ░░░▄▐██████▄▄░▄▀░░▄▄▄▄▌░░░░▄░  ░░▄▌████████▄▄▄███████▌░░░░░▄  ░▄▀░██████████████████▌▀▄░░░░  ▀░░░█████▀▀░░░▀███████░░░▀▄░░  ░░░░▐█▀░░░▐░░░░░▀████▌░░░░▀▄░  ░░░░░░▌░░░▐░░░░▐░░▀▀█░░░░░░░▀  ░░░░░░▐░░░░▌░░░▐░░░░░▌░░░░░░░  ░╔╗║░╔═╗░═╦═░░░░░╔╗░░╔═╗░╦═╗░  ░║║║░║░║░░║░░░░░░╠╩╗░╠═╣░║░║░  ░║╚╝░╚═╝░░║░░░░░░╚═╝░║░║░╩═╝░",
            "review_score": "1"
        },
        {
            "review_text": "You Roll a Rock Through Ages and Kill People that are historic and stuffs. Buy this game and get a genuine on TF2 called lol jk but this game is good. 3/-00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001",
            "review_score": "1"
        },
        {
            "review_text": "fun at first to roll over things with a giant dumb boulder but the joke starts to wear thin and so does the game half-way through. too much tower defense ♥♥♥♥♥♥♥t and not enough 'smashing things with a giant rock'. the art style is awesome and while some of the jokes may be....dated at best, it's still worth a play. ace team has come a long way since Batman Doom and ZanZan.",
            "review_score": "1"
        },
        {
            "review_text": "you can kill sparta and Gandalf 10/10",
            "review_score": "1"
        },
        {
            "review_text": "20 OUTTA ♥♥♥♥IN 10 THIS GAME IS THE BEST COULD NOT STAHP LAUGHING.",
            "review_score": "1"
        },
        {
            "review_text": "I don't have this game, I have no idea why I can write a review for it. It looks cool.",
            "review_score": "1"
        },
        {
            "review_text": "In all my years of playing games, I have never encountered one quite like this. Rock of Ages is a really unique game that takes you throughout parts of european history and pits you in a bowling match against many famous characters. Sounds...bizarre, right? Well, that's because it is. If you haven't picked it up I would definitely recommend that you do (especially on a sale.)   Pros: +good sense of humor +interesting story +Bowling! +very unique gameplay  Cons: -does seem to get somewhat repetative -other game modes provide a minimal amount of fun -boss fights are too simplistic   Overall: 7.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Fun little game that combines strategic placement of obstacles with racing-like plattforming. Great to waste some time with, and the Monty Python-esque humour is a big plus.  I haven't had the chance to try out Multiplayer, so I can't discuss it, but the Singleplayer campaign will keep you occupied for a couple of hours. The levels are varied enough to keep things from going stale and the strategy aspect meshes rather well with the racing aspect. Every once in a while, there is a boss level with different mechanics. The unique, historically inspired aesthetic also spruces things up nicely.   Pick this up when you got a couple of bucks to spend, it's worth the look!",
            "review_score": "1"
        },
        {
            "review_text": "Great concept with Monty Python art style and humor.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game to kill some time",
            "review_score": "1"
        },
        {
            "review_text": "This game rocks ( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Short game.",
            "review_score": "1"
        },
        {
            "review_text": "love it, its really fun",
            "review_score": "1"
        },
        {
            "review_text": "It took me ages to rock this of.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game! Very fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "'Fun time whit game no for free' Silver Loiv President of Estonia P I M P",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "It's a rock. Not much more to say.",
            "review_score": "1"
        },
        {
            "review_text": "I knew this game was 10/10 when I figured out that in one of the boss levels, I have to fire myself into David's (The famous sculpture by Micheal Anglo) ♥♥♥♥♥ in order to win....  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Kinda one sided. It's fun to play (Wish it had controller support), but in multiplayer it's a game of who launches first.  Worth it on sale, but not full price.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would roll rocks down hills again.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game lol you just have to try it :)",
            "review_score": "1"
        },
        {
            "review_text": "Unique and whimsical. What more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "Kinda one sided. It's fun to play (Wish it had controller support), but in multiplayer it's a game of who launches first.  Worth it on sale, but not full price.",
            "review_score": "1"
        },
        {
            "review_text": "This game is original and fun for the first few levels, but if you are going for 100% achievements then the developer's trolling placement of the keys on some levels gets increasingly rage inducing as you are forced to try over and over again to fluke trick shots by smashing into edges to abuse the janky physics engine.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the wierdest and most fun fps games ever! Some people call it hat simulator and I can see why there are tons of hats from strange hats to unusual hats this game is all about hats!",
            "review_score": "1"
        },
        {
            "review_text": "It's the only set of balls I like to play with besides my own",
            "review_score": "1"
        },
        {
            "review_text": "This game rocks. Literally...",
            "review_score": "1"
        },
        {
            "review_text": "*HAHAHAHAHAHAhaha ha ha... it's very funy in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would ragequit again",
            "review_score": "1"
        },
        {
            "review_text": "♥",
            "review_score": "1"
        },
        {
            "review_text": "This game caused my computer to crash every single time that I attempted to play it. I tried numerous times, and on each occasion, the game would freeze and I would be incapable of exiting it, going to task manager, or even shutting down my computer. I uninstalled it so as not to waste time. I'm sure that if the game actually works for you, you'll have a good time, but I couldn't recommend a game that didn't function as intended.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks like a game no one ever gonna play, but its actually not that bad, good time consuming",
            "review_score": "1"
        },
        {
            "review_text": "Are you guys ready to Rock?!",
            "review_score": "1"
        },
        {
            "review_text": "If you spent money on this Mountain of Cardboard crab ♥♥♥♥. Then you should ♥♥♥♥ING KILL YOURSELF. This game is just rolling a stupid ♥♥♥ Hot ROUWK into cardboard cutouts of DIllWeiGhtS and Greek ♥♥♥♥♥es (beetches). ♥♥♥♥ BULbY!",
            "review_score": "-1"
        },
        {
            "review_text": "Fart sounds.",
            "review_score": "-1"
        },
        {
            "review_text": "2/5  The cinematics are uniquely stylish, but the gameplay is bland and quickly becomes repetitive.",
            "review_score": "-1"
        },
        {
            "review_text": "If you looked at the videos, you've basically seen everything that's good about the game. The gameplay is fun for a while but gets boring and dull half way thought - so much so that I've quit.",
            "review_score": "-1"
        },
        {
            "review_text": "One of my first Steam games. The game has a really unique art style and storyline. I can really appreciate that about this title. It certainly feels like an 'indie' title built from passion.  I tried playing this several times by myself, and with friends. I always ended up scratching my head trying to figure out the game mechanic and why it is alluring. It really isn't that fun. It is like extreme bowling or something lol. Everybody seems to get bored after a round or two.",
            "review_score": "-1"
        },
        {
            "review_text": "A silly game where you roll boulders against your opponent's castle. You can try to put obstacles so his boulder does not get to your castle first. Whoever hits the castle three times first wins the game. Yes... that's all there is to it. 5/10 Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "A nice game for $3 or less, you will only play it for about an hour or so.",
            "review_score": "-1"
        },
        {
            "review_text": "Crap Game !!! 1. the control with keyboard and mouse so badly 2. The game is Cheating 3. Waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "Hard to control yourself.",
            "review_score": "-1"
        },
        {
            "review_text": "  I do not know why but please do something about it      ",
            "review_score": "-1"
        },
        {
            "review_text": "Smash your enemies. Rock out to a great soundtrack. Get stoned and laugh at the corniness. I'm running out of rock puns...but...it's a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game",
            "review_score": "1"
        },
        {
            "review_text": "Rock of Ages is a fun arcade game. I lament the fact that I still haven't played it in mulitplayer; it seems like the kind of game where playing with friends should be the main draw!",
            "review_score": "1"
        },
        {
            "review_text": "The game is worth its money although I finished singleplayer mode within 3.5 hours. But these 3.5 hours were full of fun and as you progress the game develops as well (more items, new cool maps...).  It is a mixture of a jump n run dexterity and tower defense game where you have to destroy the enemies gate with a big stone you are controlling through the map while your opponent does the same with his stone. To make your oppenents life harder you can buy some tower defense items, such as aggressive cows, and place them in front of your gate. But the whole game is pretty easy to understand.",
            "review_score": "1"
        },
        {
            "review_text": "Ever wanted to play as the boulder in Raiders of the Lost Ark? You're welcome. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Superb game. Good fun and funny in a classical style. You cannot go wrong. 9/10 for me!",
            "review_score": "1"
        },
        {
            "review_text": "A strategy game where you control a stone rolling down a hill the goal being to smash the enemies gates. It's simple yet very fun. The artistic value of this game is probably what I prefer most, though. ",
            "review_score": "1"
        },
        {
            "review_text": "Marble Madness crossed with Tower Defense, mixed in with Historical Pictogram Comedy, and you get Rock of Ages. It's a fun game with great, strategic mechanics that forces players to both think on their toes as well as give them the satisfaction of crushing their opponent's buildings and defenses - with a rock that has a face on it no less.  Besides, what other game let's you literally squish historical characters like Leonidas, Plato, Aristotle, Bacchus, Napolean, and etc.?",
            "review_score": "1"
        },
        {
            "review_text": "This was an unbelievable amount of fun - absolutely brilliant! A crazy idea, done very well indeed.",
            "review_score": "1"
        },
        {
            "review_text": "DEFINITIVE / GALLERY  POSITIVES: - hearty chuckle worthy mini scenes at the beginning of every level.  - lots of visual, weapon, and level variety.  - though challenging/frustrating at first, the inevitable thrill of momentum and mighty destruction is unparralled and worth the endurance/patience.  - lots of replayablility because of the multiplayer features.  Seemingly silly, the experience is surprisingly epic. Though we all have certain times we like to reflect on respectfully, this is a great reminder that on the grand scheme of things, everything is ridiculous.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious game, very fun in multi",
            "review_score": "1"
        },
        {
            "review_text": "I would not say I am any good at this game, having poor hand-eye coordination and all. It's funny enough that I will keep playing it. Recommended if you enjoy bowling for humans.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game and it has a sort of childish humour but it kept me entertained for about 3 hours and I would gladly recommend the multiplayer mode to any LAN parties which fails to entertain its members.",
            "review_score": "1"
        },
        {
            "review_text": "its rock hard ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Wow. What an amazing little game for the $0.99 paid. Waaaay too cheap for hours of fun. I'm too tired to continue, but we stayed up until 3am playing this absurd title.  Great work to the team who made it.   My only comment is that some levels seem like they're too open, so you should start with more money and time to build it up or it's a bit of a waste.  Other than that, what a blast. I love the little animations. I would like to see some more polish here and there, but maybe that can happen with some DLC, or a sequel, which I would be more than happy to pay for!  Buy this game!!!   9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game changed my life, I now look at things more negative, because nothing is like Rock Of Ages, I see myself always trying to relate things to Rock Of Ages..But nothing comes close, One day I hope Rock Of Ages visits me In my dreams and gives me my first wet dream!1!!!111!1!!1!!",
            "review_score": "1"
        },
        {
            "review_text": "Great funny freakin game, that'll make you laugh even in bad mood.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and funny, this game is a nice twist on the tower defense/ball rolling genres and it works very well. Whole heartedly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! I loved every mintute of it!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Go get your balls to the wall man. It's a satirical game where you control an upgradable ball that smashes into cows, elephans and screaming cardboard people in an attempt to reach the gate at the end of the track, break it down, and squash the enemy player, usually represented by some historical or mythological figure, hiding behind it. If you are not entirely sure if you understand what I just said, that's fine - means you don't do drugs. If you do happen to look upon this game while under the effect of LSD or other hallucinogenic drugs, I am sure it will all make sense to you.  The game mechanics are quite clever. 2 tracks, each with some branching. A gate on each end. Behind the gate - the player. Each player has a ball they must roll through the enemy track and hit the enemy gate with as much force as possible. Defence structures on the track damage the ball, breaking off it's mass. When the ball is destroyed or reaches the gate at the end, the player has some time before a new one is built to reinforce their track with defensive structures. A game ends when one player crushes another's gate and rolls over their avatar behind it.  This is a fun game to play at parties, especially if you are short on weed or value your health yet still want to f*ck with people's minds. Also if you think a 4 ton stone boulder can squash a cow - you are wrong. Cow&gt;stone.  OOOOOOOOOO/10 (those are balls) If this game was an accurate representation of history, it would be a pretty good representation.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just awesome. So simple in it's idea, but executed so well. It's got some strategy, some racing, some tower defense, and tons of humor.  Games can be played in under 10 minutes, and it's so much fun multiplayer with friends.  Just buy it.",
            "review_score": "1"
        },
        {
            "review_text": "It's Monty Python's Monkeyball.",
            "review_score": "1"
        },
        {
            "review_text": "What it is:   -An Accurate depiction of how disputes were settled over the course of History  -A Tower Defense/ Bowling Hybrid  -A very clever looking game  -A very lazy (Intended Style) looking game  -A good way to kill time  -A Splitscreen PC game (Yes you can play with just one computer)  What it isn't:   -An Accurate depiction of how disputes were settled over the course of History  -The Broadway Musical  -The official video game of the Broadway Musical  -A waste of your money",
            "review_score": "1"
        },
        {
            "review_text": "This game is wicked fun  why?  Ever wanted to be a giant rock that destorys buildings and rolls over people?  LIVE THAT FANTASY NOW!  10\\10 would roll over the plauge again",
            "review_score": "1"
        },
        {
            "review_text": "Fun game with a really fun concept. Will be especially appreciated by monty python fans ;)",
            "review_score": "1"
        },
        {
            "review_text": "This game is wicked fun  why?  Ever wanted to be a giant rock that destorys buildings and rolls over people?  LIVE THAT FANTASY NOW!  10\\10 would roll over the plauge again",
            "review_score": "1"
        },
        {
            "review_text": "GET THIS GAME RIGHT NOW! JUST DO IT!! 11/10!!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing to play splity screen co-op. Single Player is a tad empty. Wait for a sale",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that's hard to compare to others, because what makes it worthwhile isn't really in the mechanics necessarily. it's the presentation and the package. It's quirky and very Monty Python-esque, with a lot of personality. The gameplay is enjoyable if not rather easy, though occasionally frustrating when it attempts to be difficult. It's not a game you're likely to play through more than once, but it's a memorable experience.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing good time if you have someone to play this with for the 2-player multiplayer mode.",
            "review_score": "1"
        },
        {
            "review_text": "Good, silly, fun. Want a game you can play for 10 minutes? This is your game.",
            "review_score": "1"
        },
        {
            "review_text": "Score: 8/10  This is essentially a bowling game merged with tower defense. Your goal is to break down the door on the other side of the map with your giant boulder and crush your opponent who is beyond the door while your enemy attempts to do the same. You can upgrade your boulder as well as put up defenses to protect your door. The boulders can be knocked off the map as well as destroyed causing you to have to remake the boulder and send it on it's merry way again. This game also has local co-op so it makes a great party game.",
            "review_score": "1"
        },
        {
            "review_text": "I don't need instructions to know how to rock!",
            "review_score": "1"
        },
        {
            "review_text": "I was not expecting very much going into this game, but i was pleasntly suprised. The gameplay is very enjoyable if you are a fan of TD type games, or just silly action in general, and it is very well made in terms of style and actual gameplay.  Overall, I would recommend for just about anyone.",
            "review_score": "1"
        },
        {
            "review_text": "You'll Like This Game If You Like To Eat Rocks",
            "review_score": "1"
        },
        {
            "review_text": "this game rocks 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You are a rock that smashes things. I think I have said enough.",
            "review_score": "1"
        },
        {
            "review_text": "fun base game, but incredibly painful, repetetive, and boring boss fights.",
            "review_score": "1"
        },
        {
            "review_text": "I change my vote about the game. The first time I played the story mode. the game was like a torture to me. It was really painful playin' it. No kidding so unbearable to the point I left it unfinished for weeks. (Honestly, I don't know exactly why, maybe because the humor doesn't suit me, or the way the rock move annoy me, or the sound when the rock move, or when the rock fall, or all the high-pitched screams, the obstacles, the gameplay, or maybe all of them)   Time passed. I gave the game another chance. and the results: [+] I enjoyed playing the time-trial mode, [+] I also enjoyed collecting keys, and the achievements, [+] more than 30 unique levels to be played   [-] I still didn't enjoy playin the story mode,  [-] &gt;30 levels in the story mode, [-] no multiplayer online,. [-] =/= 100%  Overall actually the game is not that bad. Buy it only while on sale.",
            "review_score": "1"
        },
        {
            "review_text": "if you're familiar with the host of other, samey Rock-based titles like 'The Rockford Files' 'Rock band' or the abysmal 'Rock around the clock 2: Reqium', then you'll find yourself well at home with 'Rock of Ages'   Game play wise. Eh. Its alright. Its a little off beat, sort of like a Monty Python animation mixed with tower defence and boulders. But its the story you're here for.  You, Frank Rockovage, and your partner, Sysaphis McKowski (of American Gladiators fame), are hot on the trail of a mysterious gang land king pin who killed your wife three years ago and you're not about to let anything get in your way. Together you'll roll your way through the mean streets of history, wrecking the absolute ♥♥♥♥ out of everything you see so you can finally reap hard vengeance.   As the tag line suggests, 'Crimes about to discover its trapped between a ROCK and a hard place.'  three and a half boulder-based puns out of five.",
            "review_score": "1"
        },
        {
            "review_text": "Simple, yet very clever.",
            "review_score": "1"
        },
        {
            "review_text": "I really fun game. Roll a giant boulder to destroy the enemy's castle. While your workers build another one, order your soldiers to build defenses against the enemy's giant boulder.  Really really funny and very entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "You roll a big ♥♥♥♥ rock around, killing troops and animals, bashing down buildings, all to bash down the enemy's castle door and squish the historical figure you are battling against in each location/period.  I really loved the historical references, classical music, and... simply rolling my rock around like a boss. They see my rolling, they hating!  Unfortunately the online aspect is not so stable, but the single player alone is worth the price tag, and if you and a friend have decent internet connections it should work for some multiplayer fun. I only managed to play multiplayer with both computers running it in my house; it never worked with friends.",
            "review_score": "1"
        },
        {
            "review_text": "Humorous combination of strategy and knocking crap down, through the ages of course.",
            "review_score": "1"
        },
        {
            "review_text": "A superb, silly game. A good way of describing it is Monty Python meets Super Monkey Ball meets a small part of Tower Defence. And for the price it's at, even without a sale, it is well worth your time. Littered with history jokes (The 300 Spartans, Vlad The Impaler's level starting with a Castlevania reference and such) this game is good for a laugh, and the gameplay is solid too.",
            "review_score": "1"
        },
        {
            "review_text": "It takes a highly original concept, and makes the most of it. Really nothing I can think to criticise about it.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly my new favorite racing game, and I don't even like racing games! Er, well, Rock of Ages is a humorous title with some stellar art (the use of classical pieces does in fact remind me of [and I know others have said this] Terry Gilliam's work) and fun gameplay. The multiplayer shines especially in obstacle course mode, which is essentially a race, and war, which mixes in a little strategy. Thus far into the game, the only irritation is that the obstacle course multiplayer only allows two players; I could see this being ridiculously fun with more players! I do recommend this game, especially if the price is low.",
            "review_score": "1"
        },
        {
            "review_text": "Stupid fun. Definetly get it! This game is amazing and very well priced! Just get it. Get it. Naow!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so quirky. Imagine 10-pin bowling meets tower defense. The art style is really crisp with hilarious Monty Python style cutscenes. Essentially you roll your boulder down a hill to smash it into the enemies gates. whilst yor minions are making you a boulder, you can set up defenses to try and smash the enemy's gate.   It's a lot better with a controller, which I have still yet to buy, but I'm really enjoying it so far.",
            "review_score": "1"
        },
        {
            "review_text": "Good, I watched lots of LPs , now I finally have it. Great game to play with friend on multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "A silly, irreverent and funny game. Travel through history with a combination of Tower Defense and Super Monkey Ball gameplay. Trust me, it makes sense. At least, the gameplay does. The story luckily does not.",
            "review_score": "1"
        },
        {
            "review_text": "You are Sisyphus with your big rock (who has a smiling face). You run out of the underworld and start rolling-rocks battles with other mythological or hystorical figures. ...so nonsense, crazy and funny. Somewhat challenging, too.",
            "review_score": "1"
        },
        {
            "review_text": "A strange mix of tower defense with a racing game. Its fun, different, and hilarious. Why isn't this game more loved? No really, it's an awesome game that I haven't seen anywhere else.  Pros: Its a two sided war where each player starts off with the same money. You quickly have to build a defense to protect your castle. Then after a period of time, you become the boulder to smash the other player's castle. The faster you smash the castle, or die, the faster you can build more defense to defend your own castle. I also liked the different themes the game has, and numbers movie references (Such as 300, matrix, and monty python). Also, it is funny. Very funny. I love this game.  Cons: There isn't enough people playing this game. This needs to be fixed immediately. Need a pretty decent computer. Older models might struggle a bit.",
            "review_score": "1"
        },
        {
            "review_text": "I've never really played anything quite like it. It's kind of like Super Monkey Ball and tower defense but in a one on one versus game. The style is reminiscent of Monty Python but also wholly unique. The multiplayer gives this unique game staying power.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Age of Empires + incredibly visuals + First Person view + A very fun tower defense game, now blend it all together and BOOM... you have Rock Of Ages",
            "review_score": "1"
        },
        {
            "review_text": "This was an unbelievable amount of fun - absolutely brilliant! A crazy idea, done very well indeed.",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game. the humor is brilliant and the gameplay is so fun. buy it.",
            "review_score": "1"
        },
        {
            "review_text": "this game is legitamately awesome, solid gameplay and quirky sense of a humor",
            "review_score": "1"
        }
    ]
}