{
    "app_id": 223100,
    "name": "Homefront®: The Revolution",
    "release_date": "2016-05-19",
    "developer": [
        "Dambuster Studios"
    ],
    "publisher": [
        "Deep Silver"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Captions available",
        "Stats"
    ],
    "genres": [
        "Violent",
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "FPS",
        "Open World"
    ],
    "achievements": 74,
    "positive_ratings": 6396,
    "negative_ratings": 5102,
    "price": 24.99,
    "description": "Homefront®: The Revolution is an open-world first person shooter where you must lead the Resistance movement in guerrilla warfare against a superior military force.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/223100/header.jpg?t=1534942604",
    "minimum_requirements": "OS: Windows 7/8/10 all x64 Processor: Intel Core i5-4570T (2.9 GHz) or equivalent or AMD FX-6100 (3.3 GHz) or equivalent Memory: 6144 MB RAM Graphics: GeForce GTX 560 TI (1024 MB) or equivalent or Radeon R7 260X (2048 MB) or equivalent Storage: 38 GB available space",
    "recommended_requirements": "OS: Windows 7/8/10 all x64 Processor: Intel Core i5-2500K (3.3 GHz) or equivalent or AMD FX-8320 (3.5 GHz) or equivalent Memory: 8192 MB RAM Graphics: GeForce GTX 760 (2048 MB) or equivalent or Radeon HD 7870 (2048 MB) or equivalent Storage: 38 GB available space",
    "reviews": [
        {
            "review_text": "Warning!: This review will be in depth, and I will not include a tl;dr  After spending 13 hours with the main campaign, and finishing it, Homefront: The Revolution is easily one of the worst games I have ever played, but unlike most of the negative reviews for this game, I am going to give legitimate reasons as to why I feel this way  Before I get into the review, I would just like to say that before I purchased this game, I was one of the naysayers who defended it, beliveing that the game wasn't as bad as everybody said it was, but after buying and playing it, I hate to say that I agree with (most of) what people are saying  Onto the review   Pros 1. 2 Characters (Notice how I said 2, and not characters in general). Only 2 characters throughout this entire game were above the level of 'bareable'. Jack is the buddy/dudebro of the game, the guy that cracks jokes, kicks ♥♥♥, and is just fun to be around. Dana is batshit, but the good kind, the kind that makes the inner psychopath in you say 'I would totally do that!'. The rest are outright boring and flat, and when characters die you don't feel anything for them  2. The setting: Dambusters recreation of Philadelphia feels alive, and is bursting with personality. You actually feel as if there was a huge war, and that the KPA is a formidable force to be reckoned with, although I found the minimal refrences to historical monuments/figures odd for a city full chocked full of them  3. Alternate future: Since this game is based in an alternate future, it is plausible that the North Koreans were able to take over America, unlike the first game  Cons 1. The story: convoluted and uninteresting. It isn't easy to follow, nor do you feel very invested in it 2. The gameplay: combat is extremely clunky, (you get used to it over time), and because of this, it makes slogging through the games campaign all the more painful 3. Braindead AI: The AI is extremely stupid, the only way you get killed by them is if they swarm you, and this happens more often than not 4. Stealth is a no go: Killing a KPA soldier, even with a silencer, sends off an imediate alert that, instead of making nearby soldiers investigate your position, instantly spawns in enemies that start drilling you with bullets. Stealth is essentialy a terrible tactic, and the whole system needs an overhaul 5. Rinse and repeat objectives: So essentially to finish the story, you need to capture different points within the hub worlds, which then unlock the next mission in the story. The problem with this is, that is literally what you do for the entire game. It boils down to: Go here, clear and capture all of these points, then do the story mission(s), repeat. This gets extremely repetitive, and even borderline annoying, coupled with the fact that the gunplay is terrible makes it all the more dreadfull 6. Bugs galore. Whether it be floating pedestrians, stuttering or un-capturable points, this game is filled with a ridiculous amount of bugs that will end up frustrating you to the point where you don't want to play the game anymore 7. Phantom 'Open-world'. This games is NOT open world, like Fry Cry is open world. It is filled with 'hub worlds'. Think Dragon Age Inqusition type hub worlds.  8.Brady do this, Brady do that. BRADY, BRADY!: The games characters rely on you WAY too much, making you feel like you are the de-facto leader, and/or errand boy, when you are just another soldier fighting with the resistance. I get that you are playing the protagonist, but the game doesn't present you as anyone special, just another soldier, so another resistance fighter could easily do what you do 9. Resorting to Call Of Duty tactics: The game tries its best to paint your charatcer as a guriella fighter, and in the beginning of the game it does that. You will have low ammo, low health, and have to scavenge to craft items like molotovs or RC bombs that give you an edge. But by mid-game, you will have upgraded your character enough to where all of that gets tossed out the window, and you can essentially go rambo and just run in and gun soldiers down. Yes, you could 'role-play' as a guriella fighter, but the annoying AI doesn't/won't make you want to 10. Same-y enemies: It's essential the same enemy type over and over with no variation, and this really emphasizes that feeling of boredom you will eventually get 11. Moral argument: This one is personal, but I found the moral arguemnt discussed by a ceratin character in the game to be extremely annoying. His argument is basically 'see, this is what happens when you cause trouble!' I'm sorry, I didin't realize that a revolution was going to be PEACEFUL, when we are stock pilling weapons, ammo and materials for a godamn war. 'People get hurt' Well no duh, it's a freaking war for freedom, don't like it? Shouldn't have signed up in the first place.  12. Phantom 'Customization'. The 'on the fly' gun customization intially shown for this game is a ruse. There are few weapons to choose from, your setup will most likely end up being an SMG, Assault Rifle, and an RPG. There are few upgrades/attatchments that make each weapon feel unique, although there are some interesting conversions, maybe 2 or 3, but you will always end up switching back to the setup stated above 13. Compensation for braindead AI will make some missions difficult: In certain missions, the game will spawn endless hordes of enemies to compensate for their lack of good scripting/coding, and more often than not this makes missions a pain, especially missions where you need to defend something, or you have resistance fighting with you and they get mowed down 14. Poor character animation and lip sync: The characters animations are absolutely atrocious, espesially for a game released in 2016. Mass effect, yes the original, has better animations than this 15. Game breaking bugs: I haven't experienced this, but I know some people who have run into a bug during a certain mission that does not allow them to progress at all, making the game basically unplayable, besides co-op 16. Side missions: A complete waste of time, and unrewarding 17. Graphics: Graphics are generally good (that's cry engine for you) but some low res textures are pretty noticable  Things not mentioned: Multiplayer: didn't bother to try it, didn't feel like it would justify a 60$ asking price Season pass: not sure what they will include, but I know some people enjoy this game, so I won't tell you not to buy it  Final verdict: 2/10 Purchase recommendation: Do not pruchase, at all, not even on sale  I really wanted to like Homefront: The Revolution, I was part of the minority who didn't write off the game, and wanted to give it a chance, but sadly, that didn't happen. This game would have honestly done better as a linear shooter, because the main missions were easily the best part of the game. Sad to say, but in terms of overall game design, the original Homefront was leagues better than this game. Say what you will, but the original had better writing, an interesting story, great characters, great mechanics/gunplay, and included a Battlefield/CoD like, PvP centered multiplayer that gave it longevity and spawned a cult following. Dambuster essentially butchered that, and I fear this is the end of the Homefront 'franchise' (if it was ever one) and should be laid to rest",
            "review_score": "-1"
        },
        {
            "review_text": "Things I can say for Homefront: The Revolution:  Please note this is from  Single Player experience   - Poor Graphics Optimization - Poor Lip Sync - POOR Storyline - Limited Weapon Attachemnts (I'm talking to you rifle silencers...) (even though cool Weapon Customization) - Side Missions are bad - Finished main story, unable to finish the remaining side missions - Poor Waypoint Optimization! *rage flips table* - KPAs not searching hiding spots (Year 1990-1995 game?) - Arcade game,   Time Splitters 2, found in restricted area (Prisoner Zone)   has better gameplay - Sudden freeze in between cutscenes and ammo refilling - Bad RC consumable movement &amp; collision - Cannot use bikes to shoot  Is this worth $50 or $70 (with expansion)?  North Koreans may even think this game's a joke...",
            "review_score": "-1"
        },
        {
            "review_text": "I am a man of positive thinking. I don't like exposing hatred towards everything. Well, let me start writing something about this game. This game, if i say overall, is an average. Its neither so good nor so bad. I wont talk about the mainstream topic about this game which is bug.    Pros",
            "review_score": "1"
        },
        {
            "review_text": "I have never written a reivew before because I generally feel like the community or the critics get it right. This game is a different case. This game is so underrated it hurts. I cannot speak for how it played at launch but I can speak to how it plays now. It honestly does something other games dont't, and thats give me a ton of tools but at the same time make me feel like an underdog. In my opinion the shooting is very crisp and strategic. Also the weapon modding is awesome making one gun so much more versitile. Also the story seems decent with a very good setting to boot. The graphics are good but demanding. Because of this if you don't have current hardware you should wait to buy this. so far I am only a few hours in but this feels like a more focused and difficult far cry game. Because of the launch issues this game experienced I think it's reputation got ruined. This is definetly one of those games that needs to be given a second chance because it's to much dang fun not to. To give you an idea I have an FX 8350 OC 4.5 and a GTX 970 and am getting between 35-50 fps on high settings at 1440p. Although these are not great number the game does not stutter at all (except when saving). I would say buy this from a key site or on sale just to be safe because others are still experiencing issues. After playing more I realize that the game is good at first but by the end becomes less alluring. I would still recomend it on a sale  graphics- 8.5 Optimization- 5.5 Story-7 Gameplay-8.5 Atmosphere-9 Fun factor- 8.5 Overall- 8  Even though this game is fun as all hell I would say steer clear unless you meet the recomended system requirements.  As a frame of reference some of my favorite games are the The Wiitcher 1-3, Bioshock 1-Infinite, Dark Souls 1-3, GTA 4-5, and the new wave of Fallout games. I would compare this game to Crysis mixed with Far Cry where you have more tools at your at hand but are also fighting agianst greater odds.",
            "review_score": "1"
        },
        {
            "review_text": "A flawed but ultimately enjoyable game.  I love the North Korean space ships that are flying over, looking for resistance.",
            "review_score": "1"
        },
        {
            "review_text": "At the beginning of the launch, the game was 'somewhat playable'. The performance issue was annoying, but still playable, there were moments that initiated huge FPS drops.  After the latest patch that the team was working on has finally made a game - the game. The game runs nicely on Ultra. They also updated a lot of other things and added GearScore (basically to show other players how 'advanced' of a player you are). The graphics of Cryengine is as always pleasing to the eye, and the textures in this game (guns, gloves, equipment etc.) look amazing.  With a on the move weapon customization you don't need to be worrying for bringing the wrong weapon to the field, as you can customize your gun in-game, just make sure you choose the right right class for yourself before initiating the mission.  They also added 2 free maps which are really nice, and pretty big size with of course new missions and objectives.  From this day on, do not let the 'MIXED' reviews to bother you. The game is great and surely needed sequel to Homefront series. And always make sure before buying games that your PC can handle it.  *Feel free to add me for coop or helping you to start up.",
            "review_score": "1"
        },
        {
            "review_text": "Great open world game with a gritty atmosphere, runs pretty smooth on my machine (NV760, quadcore haswell cpu from 2014, 16 gb ram). If you liked Far Cry 3 + 4 (I did, although FC4 did not add enough to the formula compared to FC3) and Mad Max, you might like this one, too. Don't immediately believe what people are saying, go have a look at some of the lets plays and decide for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "1 HOUR PLAYTIME  Now I write this first review with no hatred whatsoever (unlike everyone else)  The game started with a great opening, the story line is exciting and the opening scene gets you in the zone... My first walk around the neighbourhood was slow... the textures look great, the environment is wonderfully detailed with many unique objects around to complete the immersive experience making the environment feel busy and alive. The main characters so far are all unique and have different personalities... the ambient NPCs are cool too however there is an issue with the rigging as their necks look like they are possessed by a demon... There is also an issue with the NPCs interaction with their environment and other NPCs as I seen 2 of them walking into eachother and continued walking on the spot.  Sounds used in the game are excellent however the fades/crossovers need work, as sounds are often clashing with one another, overpowering or even turning off other sounds altogether. Now I'm not like these other morons out there that say a game has optimization issues because they aren't getting 120FPS, we all know anything over 35 is excellent for gameplay... however this game does have optimization issues, but it's due to the environment being so detailed and RAM consuming... but it does need work because as soon as i got into battle, I couldn't play it... let alone ride a motorbike at full speed... it ruined it for me... I'm yet to turn all my settings to LOW and see how it goes... FYI I'm running Alienware with GTX680 and 32GB RAM... I play the division on mostly high with a couple ultra settings with no slowdown...  Player movement feels very stiff like me on a Saturday morning, interaction with objects and climbable areas sometimes takes a few times to register...  The weapon custimization options are exactly the same as Crisis which I dont mind at all as it's a cool looking system... The graphics are beautiful the plot is excellent and I'm really liking where this is going, as I haven't played a good UPRISING styled game since half Life 2... but right now, where it is... I CANNOT give it a thumbs up... in fact I am very disappointed I purchased this as in Australia, this game costed me $70 AUD but I'm not sure if I want to refund or not... I'm holding the hope that this game will be rescued...  I was a big fan of the first Homefront when noone else even liked it, because it was too linear and short... but it was a good game... I will update this review after a few bug fixes, but right now I just cant play it...   IN FUTURE DEVELOPERS... BE SURE TO QUALITY ASSURE YOUR PRODUCT BEFORE YOU SELL IT... DON'T BE LIKE SO MANY OTHER COMPANIES AND SELL AN UNFINISHED GAME AND THEN HAVE THE CHEEK TO SELL DLCs...  3/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "I thought they'd try to improve the franchise and make it into a better game. But sadly homefront the revolution suffers from the same problems as the last game such as poor optimisation, controls, AI and audio quality. However it is a solid first person shooter when it runs. Hopefully they patch this game soon so i can actaully play it",
            "review_score": "-1"
        },
        {
            "review_text": "In advance sorry for bad english  Bougt the 80 Euoro pak.... totaly not wort it! only good was the weapon thing it felt nice and sort of new. graphichs were decent.  but got what a mess and I dont need to list them all. just look at any and i mean any review on youtube or anywhere. its terrible ;( witch make me sad , becuse I was really looking forward to it Btw I have a good pc i7 at 4.6ghz hexacore , 34gbddr4 ram, 2x gtx980 strix and only ssd´s  Thank god for Steam Refound &lt;3&lt;3&lt;3 (Saved my ♥♥♥ this time)",
            "review_score": "-1"
        },
        {
            "review_text": "Really enjoying this game. Played both co-op and single playeer and have had zero issues with the game. Am I lucky I didn't buy it when it first released? Probably. I've followed the game for awhile and finally decided to make my purchased. I'm quite sure others that posted problems about their experience was valid. It is a risk we all take, and it is something we all will experience ourselves on making game purchases. The game-play for me feels a bit in-between Dying Light and Metro. The graphics are on the side of Metro and the play feels like Dying Light with on the climbing and looting for componants. Bots are a bit dingy. Not much help, and more in the way. They are not scripted to the story so there you go. Par-for-the-course. Sounds are good. Weather is awesome. I love seeing the rain begin and start to dampen the sidewalk. That detail was something I don't ever recall seeing in a game before. Usually it just begins raining and tada!, its wet! Story and acting is primo! Very well done. UI is simple and has most of what you need in regards to tuning your game right. Like with most games the story doesn't seem to be that long, but you add-in the side-quest or just (like me) going for that 'completionist' set' the game will last for awhile. I would say get it if your unsure. Make sure all your drivers are utd. Enjoy! No regrets and I'm happy with my purchase. Rig is; CPU i7-5930@ 3.5ghz, mobo Asus X99 Deluxe, 16g Corsiar DDR4 LPX 2666, 1T Samusung TLC EVO SSD, Corsair i1200AX psu, EVGA 980 GTX.",
            "review_score": "1"
        },
        {
            "review_text": "After less than 2 hours of gameplay, I must say this is a game you DO NOT want to play. The story is somewhat interesting though I found a game breaking bug that not only ruined the game but brought to light other issues. Singleplayer Only!  The Pros: Graphics are pretty good Custimization is ok but nothing too great except the modification change.  The Bad: The bugs are too many to really even count.  The game feels sluggish with a 980ti - poor optimization Game breaking bugs that end the storyline/optional side misisons Enemies don't drop guns or give ability to pick up guns, instead ammo for whatever gun you use. Game is not unique at all. It feels like they tried to make a hybrid of several games but failed. Terrible voice acting.    ",
            "review_score": "-1"
        },
        {
            "review_text": "I had some high hopes for this game after playing the first one. I was expecting multiplayer like battlefield but instead It's co-op mission based multiplayer. Single player was under whelping, I stopped the campaign within 1 hour, I couldn't force myself to play anymore. I would pass on this game, definitely not worth $60. If you think this will be a fun game I'd wait for a price drop, at least 50% off.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is not worth playing. You feel like you are doing the same thing over and over again. Do not buy this game, save your money for another game. It is not worth the 60$.",
            "review_score": "-1"
        },
        {
            "review_text": "Call me a sucker, for expecting much more from this pile of sh..! If you like unfinished games, than this game is for you...  -Really bad Optimization, almost all players experience FPS drops, and to be blunt this game doesn`t look really that pretty! -Chunky Controls, sometimes unresponsive, pretty hard to aim w/o the aim assist (and I`m never using this) -Horrible Lightning, Glitchy fire particles but man, does the shadows look bad and glitchy...awful. -Audio glitches, peeping the whole mission the hiddens stash, after I found and looted it, well it`s not my idea of a FUN! And there is no music at all - Just some ambient loop crap! -Repetitive Gameplay, not bad but nothing new. Side missions are really easy, playing on the hardest btw..There are at least 10 games with better gameplay. -Story sux hard! Pretty dumb, bad acting...audio mash-up from radio msg, 'main story' and some random people deciding to speak some uninteresting bullcrap.  It is really a shame, because I was expecting this game to be in my top Games this year.  I`m still playing it thou, but we`ll see how much more I can endure this abbomination.",
            "review_score": "-1"
        },
        {
            "review_text": "So this game has been getting many many bad reviews because of its 'terrible frame rate' and 'clunky gameplay' maybe its just my computer but this game has FANTASTIC gameplay!! it feels so good to just walk! and to run and climb and shoot. the gunplay is a bit sluggish but that is more because the game is going for a more realistic take on gunplay. its not like call of duty. its not my favorite type of gunplay mechanics but for what it is its fantastic. Not to mention the amazing graphics, story, and how gosh darn likable ALL of the characters are! the characters are all great! even people you just see on the street. they all feel so real! it really gives the entire game a different feel than most shooters! also the world is massive! it feels so open and free even when youre running through crowded alleyways. the weapon customazation is also really neat! you can see your character take apart your pistol and install parts to turn it into an SMG right before your eyes! it really interesting!! so overall i say this game is GREAT. maybe the framrate is actually pretty crappy for a normal computer, my computer is an absolute monster so...  well i freaking love this game. id definatly suggest giving it a try especially now that steam will let you refund games! id honestly give this game a solid 8/10. its pretty much all i expected and i am quite pleased with my perchase.",
            "review_score": "1"
        },
        {
            "review_text": "...sigh I had this on my radar for a long while now, and when I saw the 'free weekend' offer I knew I had to try it. I've sunk a lot of hours into this game this weekend and feel I have enough experience in it to make a judgement on the game. If you played the first Homefront, there's not much in common here other than it's the rag-tag US vs. THEM gameplay from the first. But the first game may as well not even existed because nothing from the first story carried over. Maybe the name of the 'main' leader you are trying to rescue, but that's about it. Simply put, this is a first-person shooter where you are an American rebel fighting a guerilla war against an occupying Korean Military force. That's about all the 'story' you get. You get thrown into the fray pretty quickly without hardly any hand-holding. This can be a good thing for mechanics that anyone familiar with playing a fps should be used to, but the game needs to have a much deeper tutorial on the aspects of the game that are different from the generic shooter. The game is severaly lacking in telling you how to use the map correctly, which 'opprotunities' are more important than others, and explaining why you can't modify your weapon into the cooler choices or why so many of the upgrade choices are greyed out and not even attainable until you are halfway through the game and have meet a certain story mark (ie scripted section). I learned that I could recruit AI rebels to assist me, but they do much more harm than good. First of all, you can't give them any commands what-so-ever and secondly they do nothing but get in %$&amp;@#*(%! way. I have died several times because AI GI-Joe would push me out of cover as they stole my position. They also will lock you in behind objects, walls and doorays and the only way I could get the idiots to move out of my way was to kill them or sometimes disbanding them. Since you have no control over them, you don't get to choose who they shoot at or when. Trying to sneak up on the an enemy base with them is pointless because they start shooting (very badly I might add) at the first bad guy they spot 2000 yards away. Even that is pointless because for some reason the enemy they shoot at become super bullet sponges that seem to take round after round from my AI guys but they can take my guys out in 2 shots. They don't use cover, except to push me out of mine, they don't use tactics, unless you consider running out in the open past multiple cover spots, screaming patriotic ♥♥♥♥ and firing (and missing) at a group of enemy AI that outnumber them 10 to 1 and getting killed. Not only are they ineffective, but their actions cause the enemy to pursue me all over the map because the idiot rebel AI doesn't understand when it is losing. They never retreat, which is odd because the enemy AI will use retreating and flanking actions when they come under fire. The game is also very brutal with the deaths. 2 to 3 shots and you are dead. This would be fine and great if the game modeled everything else related to infantry combat realisticly, but in this case the 2 to 3 hits and your dead is just annoying. When you die you spawn at the nearest friendly area, loose all valuables you picked up and any work you may have put in.(I guess none of your valuable 'recruits' would have thought to retrieve and of your things). Say you wiped out 25 guys and a couple drone machines and got killed with one half-shot up bad guy left... You run back to the area not more than 10 seconds later and everything is 'restocked' with full enemies. Oh, and back to 'your' friendlies, they don't offer medical help, they don't offer ammo, they don't engage anyone killing you, they just go off in Rambo mode in their own little world and just do their thing. Story wise the game is just boring and so cliched it hurts. You become like a God to the rebels just for pulling off a few missions. I seriously heard a brain dead AI female rebel gushing over with her friend as if I smiled at her or not. These are supposed to be hardened rebels who have been at war and endured a hard-♥♥♥ life for some time now, not a bunch of teenage pop-star fans who get starry-eyed at the new guy who completed one mission successfully. It just feels fake and overly pandering to the player. I can't put my finger on what feels so wrong with the actual mechanics of the shooting gameplay, but it just feels weak. Weapons feel like BB guns, killing a bad guy just feels really ho-hum and nothing you do seems to matter because you have 'HQ' screaming in your ear ever 5 damn seconds to go support this AI group or that AI group. How about letting me concentrate on my actual objective you said was so darn important instead of sending 10 miles in the opposite direction to secure a pointless magazine of bullets? So 25 innocent people dying from a bombing is less important than 30 rounds of ammo some idiot left behind? According to AI/HQ and their 'Strike mission' mentality, yes. Early on I believed them and would hustle to the area where the AI was supposedly getting run over and people would just be hanging out talking about the latest gossip. Then once I would get within a 'trigger' area, suddenly the bad guys would show up. So it's all scripted BS made to feel like it's dynamic. Oh, here is another nag. You are given a phone. On said phone is a mission roster, a map, a camera and a thing I call the 'beeping annoyance from hell'. You are given the minimal instruction on the functions, not anything about the camera. The camera is sopposed to automagically identify bad guys, and you are supposed to be able to take pictures I assume to send to HQ. Not once have I been instructed or told what the camera does, or how to get the photos to actually do anything. I did take a 'job' offer posted on a bulletin board that said I needed to take photos of an enemy convoy. No waypoints, no idea where said convoy might be. I ran all over the place for a solid hour looking for this supposed convoy... Never found it (Yes I checked the map). So, I thought maybe if I sneak up on an enemy base and take some photos that will help HQ? Hahahaa. Apparently the camera function only works for very scripted missions. Since I took the job 'too early' in the game, the convoys were showing up yet so I couldn't complete the job anyway. And the beeping transponder? It's supposed to show you where a cache of supplies are, but several times I would get to said cache, and take as much stuff as I could, but either through a glitch or poor implementation, if I didn't pick-up every single cache item there was, the transponder would keep beeping every few seconds and not 'clear' that I had gotten to said cache. A few times I would find a 'journal', basicalyl a wall of text that shows up on your magic phone, and that would clear the transponder, but at least twice I went to a cache and there was no 'journal' to pick-up so the darn thing would never shut-up or clear the location.  TL:DR Game is a scripted pile of crap that pretends to be dynamically played out. An 8-year old can see through the fake scripting in 15 minutes. Your AI are an annoyance who do not help, actually they do more damage than good, and have the emotional maturity of a teenage pop-star idol girl.  I give this game a 5 out of 10. A big fat 'Meh' It's been awhile since a games broken mechnics have actually made me mad. Well done Homefront, you ♥♥♥♥♥♥ me off pretty good.",
            "review_score": "-1"
        },
        {
            "review_text": "I've really enjoyed this game. I was looking for a fun FPS to play and it delivered. Sure the story could be a bit better and the gameplay got somewhat repetitive closer to the end, but overall, I loved it!  I would love to see DLC content from the Homefront team.  So many negative reviews of this game made me reluctant to get it in the beginning. I'm glad I finally did.  I can see myself playing this again on a harder difficulty level. I just wish the stealth was more developed.",
            "review_score": "1"
        },
        {
            "review_text": "It is fun. Die very fast. Lots of bugs. Txt msgs that wont go away. Hard to get to strike points. Id wait for the bugs to get shot over the wall.",
            "review_score": "-1"
        },
        {
            "review_text": "Much like Farcry, but without uplay and Ubisoft. Pretty dank game if i say so myself.",
            "review_score": "1"
        },
        {
            "review_text": "  Played this game during the free weekend, and I made through the whole main story in 24 hours. I'm not saying it's bad but it's also not good, just mediocre. The story is predictable and repetitive in several ways, the enemies are just a bunch of idiots running around, and there seems to be some kind of a weird bug that sometimes make some NPCs disappear into thin air. At least I didn't put 60 bucks into this game went it first launched.",
            "review_score": "-1"
        },
        {
            "review_text": "  Thank god it was free to play. Do not waste your money on this piece of ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Considering the state at which they released this 'gem' to have this many DLC 's available so soon after release is a punch to the gut.......   dont buy this and please dont support this new business model of push crap to release and filling your pockets with dlc's",
            "review_score": "-1"
        },
        {
            "review_text": "  I've just downloaded 40 gigs of meh. I would like to comment on the main story but I kept getting distracted by 'reestablish that radiostation' or 'reclaim that house'. I liked the female sidekick - that is all. Jesus Christ, thanks God for the free wkdn game because I was flirting with the idea to buy this game. It's not a BAD game, it's just painfully avarage.   I would advise only buying if seriously discounted.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Played it during the Free Weekend period. The game looks beautiful and ran pretty well, so the updates the developers have been pumping out seem to be working based on launch problems we've all read.  The shooting itself felt a little lifeless and the A.I. can be dodgy sometimes but the gameplay it solid and the atmosphere great.  They did a great job of showing you a war-torn Phili and the oppressed lives of the Americans that live there. Voice work was top notch and I can't wait to buy and jump back in once I get tired of Legion.  The Multipler Co-op mode is pretty neat with lots of options for customization and character building. If you have 3 other friends that are willing to pick the game up, I highly recommend checking it out.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure how much staying power the game has, but as an in-the-moment sort of the game, it's very fun. There are still a few bugs present, but if you wait even longer than I did, and the developer continues to refine their game, it wouldn't be unwise to purchase it for even full price or on sale.  As for the game itself, think Far Cry gameplay filtered through Call of Duty and Metro, visually stark and atmospheric but tonally fatuous like an action movie. Can't say I approve of the overt jingoism either, as it turns to inanity a few times. Guess it's an American thing, like that guy running for governer, firing a minigun in his campaign ad.",
            "review_score": "1"
        },
        {
            "review_text": "I dont really understand why there was so much hate for this game. I mean when the game launched it was full of bugs and performance issues, so was fallout but nobod complained. The only thing diffrent would be that this game was ok. Doesnt really do anything special so it kinda feels like a knockoff farcry but farcry was fun and so is this. So i would say is to wait for a sale and buy it and see for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "  Hmmm, what to say about this......Well the game looks pretty (but we all know that good graphics do not necessarily make a good game) the shooting mechanics seem solid and fun but there doesn't seem to be much structure to the gameplay. After the initial getting to know everyone stage, the game sends you on a mission and then BAM all of a sudden the map is filled with so many things to do you forgot what you were supposed to be doing, so you head towards the nearest marker thinking that is where you need to go to finish your current mission only to find that you have just started a new side mission instead...  I don't mind games giving you loots to do but not before you are familiar with a few mechanics first.  I am still going to recommend this game but only if you love being swamped with things to do before you have enough knowledge about how to accomplish anything.",
            "review_score": "1"
        },
        {
            "review_text": "  Seems like it could be fun but shooting mechanics and combat are so simple, uninspired, boring and depressing that I had to uninstall it.",
            "review_score": "-1"
        },
        {
            "review_text": "It took a while for patching to make the game playable, but after 1.7 it went from unplayable to very playable. It's not a perfect game by any stretch, but I highly recommend it.   Note that i am a fan of the core Far Cry series, FC 2,3,4 as well as Arma. Those are the kinds of games I like to play.  Here's why Homefront The Revolution is a good game, for me... and maybe you...  1. They nailed philly and post invasion occupation. If you ever wanted to star in your own 'Reds' movie, this is it.   2. The whole premise, which starts with the Military in the US being disabled via hacking, is within the realm of possibility, say 30 years down the road.  3. The technological advanced machines the Koreans have in the game, if you project say 20-30 years ahead, are entirely plausable.  4. The enjoyment of this game, the immersion of it, went way up when I shut the Mini-map off. Recommend you do the same. It's all in settings and is easy to do.  5. The sound in the game is pretty good, sounds of occupation. It grows as the population is stirred up. Really adds to the immersion. I like to shut off the music unless I am really feeling 'cinematic'. But normally, I like the music off which adds immersion IMHO.  6. I have not finished the game but I am several hours into it. DON'T JUDGE THE GAME BY THE FIRST YELLOW AND RED ZONE you work. The game gets increasingly more exciting after a while. You will feel like you are a fugitive from justice.  7. There are a ton of side missions to do along the way, or stick with the main thread. I started my playing with medium difficulty and hud on, focusing on the main mission 'cause I was getting my butt kicked. Then I stopped the game, and began a new one, this time on hardest, no mini map (love it off!), and pursue all teh side missions.    And so this is why I enjoy playing this game.  There are some things I wish were better however: a. You can upgrade your guns, bombs etc... but the way you obtain them is by accumulating cash (or something called 'KPA points').   The whole thing about using cash for weapon upgrades just strikes me as totally non-immersive. Look, you're in a rag-tag group of resistance fighters, where you and your copatriots live in poverty... and you will become a big deal in teh resistence.,.. but you need money for weapons? I'd rather they use something like the 'renown' system found in silent hunter... if ya know what that is... they do use something called KPA points, but they can onl;y be used on certain items and not your main weapons.  This is not a fatal flaw, but one that just strikes me as silly each time I purchase an upgrade....  b. As a fan of the far cry series FC 2,3,4, the protagonist speaks a few words here and there in those games. Not a lot, but enough to feel like your character is a human. In Home Front, you are always silent, even when you woudl expect something to be said (I won't spoil it for you....).  This is not a major flaw as most of the time you are doing what freedom fighters do so well... and I suspect it was about budget, why we don't have that in the game. But just a little character talking on even rare occasions would have made the story more real.  Some have been critical of the story.. and it doesn't quite equal what you get in Far Cry ... still it plays a part in the journey and glues together the pieces in to a whole. I give the story a B.   ====================  Conclusion - as I said earlier - if you want to be in your own Reds movie (the original, not the sucky newer one...), and want to experience the feeling of taking back your community and your nation from an occupying force, I highly recommend this game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Edited to include control method**  I always struggle to decide whether or not to pre-order. This is one of those times when I wish I hadn't.  The gameplay is actually fun if you're not looking for insane Action RPG style life ruining immersion, and it's a pretty great shooter with some fun mechanics (hacking, and modding weapons comes to mind in the first 2 hours I've so far played).  The trouble lies in what everyone else is saying too; which is that it's thus far very poorly optimized.  Running at 1440P.  System Specs: i7 6700K OC'ed to 4.7ghz EVGA GTX 980Ti FTW 6GB 16gigs of Vengeange LPX RAM at 3000mhz Controlled with M+KB (Corsair K70 RGB / Razer Deathadder)   And this game stutters and stumbles it's way through almost every graphical setting I've tried thus far. Maybe it will perform better once a patch or two is released but for now, for the price, it's a title that I think has a lot of promise. If you know what the game is going to be about. It might impress. Just wait a week or two to buy it.",
            "review_score": "-1"
        },
        {
            "review_text": "worst pre purchase i've ever made ,  and i've pre purchased games like watch dogs ;(",
            "review_score": "-1"
        },
        {
            "review_text": "Well I am going to absolutely honest here I have accessed so far the 4th part of the city into the game within the 2 hours (slightly over 2 hours actually) of gameplay I have actually played in this game.   I firstly must say I been looking forward to this game since it was first announced and I played the first Homefront. I have read the reviews from others and other major sites. I can honestly say the only negative thing I can personally find in this game is optimization.  Gameplay and graphics were spot on in my opinion and even though I set my expectations low because I didn't expect it to even release after waiting so long with no news. I am extremely appreciated of the fact they brought everything I honestly expected in the game. Story is pretty good so far and I have no complaints and the gameplay and the feel of the game is very good.  Optimization as I mention is the only downside of this. I did update to the latest drivers in hopes for SLI to work with this game since it was provided in the latest drivers by Nvidia, but it seems SLI does not work for this game. So I am only able to get on high settings across the board (nearly maxed settings, but not quite there) and I achieve a stable framerate around 90 FPS constantly through my playthrough of the game. Of course when I attempted max settings the frames were so unstable and plummeted to nothingness when it is maxed out. This would be the only downside, but the game only just released so I am not going to gripe about it because of that and will wait and see for future updates.  As for other negative reviews and the reviews from IGN, etc. I honestly would suggest others to take it with a grain of salt. I would honestly give this game an easy 8.5 for the quality gameplay, story and experience this game has given. Which I personally find very enjoyable right now and I like the game and for those who enjoyed Far Cry or any type of shooter game this is great.  I love how many options this game gives you for upgradability and changing out your weapons which is a great feature to the game and a pretty decent game changer. I also enjoy the challenge it brings and how you can roam the world without a gun always on your screen. I look forward to unlocking further 'yellow zones' and other things. I was also a huge fan of 'Freedom Fighters' that came out during the good Playstation 2 days. I personally find this game a good successor of both it and the Homefront series and hope to see more like it in the future (with better optimization and graphics).   As I said don't take negative reviews of this game to seriously. Take this game as it was advertised during E3 and your expectations because it truly delivers and offers a good experience for a open world first person shooter.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I dont believe it should be getting as much hate as it is. Never once crashed for me, no bugs, runned smooth and the entire idea of the game was just really neat and interesting. I enjoy every bit of it and Had a good time blowing the ♥♥♥♥ out of the KPA and starting the crowds of people to get all wild. There is some downsides though, I never felt SUPER attached to the campaign or story for example when a big character would die Id just be like,' welp ♥♥♥♥.' It wasent like gears of war, red faction, arma 3, and bunch of more attached feeling campaignes. Other then that I enjoyed it all and if your looking for a cool story, fun gameplay to burn time, then I recommend buying this. 8/10  10/10 would whatch guys face get bashed with hammer again 10/10 would whatch that guy who bashed the other guys face in get his face bashed in 10/10 would whatch that guy who bashed the guys face in who bashed the other guys face in get shot in the knee. ",
            "review_score": "1"
        },
        {
            "review_text": "Like Red Faction, without destruction of buildings, but with MUCH better feeling of guerilla warfare. Noticed a few minor bugs, but luckily nothing game-breaking.",
            "review_score": "1"
        },
        {
            "review_text": "  I enjoyed this game. Even though that's apparently a carnal sin to some people on the forums of this game. Got it for the free weekend and honestly, if I'd have had the money I would have bought it in the sale to replay it at some point. The game's actually solid, even if the weapon system is restricting (Not a fan of the games that give you one type of assault rifle and have that whole kit swapping thing). The biggest draw for me was that you felt like an actual revolutionary, using hit and run attacks on KPA officials in their convoys, subtly killing lone soldiers dumb enough to walk on the back streets with no backup, and dismantling the propaganda machines. I loved using the molotovs in the game, observing KPA patrols and then tossing a molotov into the middle of them and bolting before they figured out what'd happened.  I enjoyed it, I'd recommend it while it was on sale.",
            "review_score": "1"
        },
        {
            "review_text": "  I recommend it if it is on special.",
            "review_score": "-1"
        },
        {
            "review_text": "i just learn about how to be a freedom country, its start from bottom, make an chaos situation, then boom , REVOLUTION !!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, but with all the issues it is not worth your time. Thankfully I didn't pay much for this game. Buying any game you should not have to deal with frame rate issues, game crashing and much more.",
            "review_score": "-1"
        },
        {
            "review_text": "  This is definately a step up from the first Homefront game. It reminds me of Red Faction: Guerilla, the Saboteur, and maybe a little GTA.   The world is open but manageable. The look and feel are spot on and the gun play is as good as any other current shooter. It came across as a little to predictable for me so don't expect much from the story. I was plesantly amused by the upgrades to the guns. Maybe all weapons should be so easily swapped out with parts to make other bigger weapons.   I initially loved the idea of hoping on a motorcycle until I tried it. Too much debri on the streets and using the keyboard to drive made the experience a hectic motorcross nightmare.   Claiming locations to free up the map was a bit too easy also. Simply activate the console, laptop, pressure valve and the area is yours. All the enemies vanish and your own troops take up residence.  It's a good run around game where you get to shoot at guys or drones for a bit. Not the best game ever and certainly stuff we have seen a time or two before, but much better than the original.",
            "review_score": "1"
        },
        {
            "review_text": "So I played this game for a few hours on and off for a few weeks. I was not really a fan of the first one but I really like the concept that the homefront story line has to offer. When I first started playing the bugs and the system slowdowns really, really, really killed the game for me and stopped playing it (got to the game breaking bug were I met some random dude before the armory got raided). On a whim I decided to pick it up again after fallout 4 and because of the patching the game is FAR BETTER and actually worth playing.  The game is not the game I wanted Homefront TR to be but it is ok and a good way to kill a few hours. By far my biggest issues with this game is two fold...  1. The lack of weapons, in the first Homefront there were tons of different weapons from several types of HMG, MMG, SMGs, pistols, AR/AK variants, ect. In this game there are maybe about 12'ish weapons that are diverse but you get the one or two that work with your play style and generally keep them. With the last homefront you felt that need to pick up a new weapon every few mins because you felt the need to try this M4 with the EO Tech, oh look a AK with a CCO, OMG a Shotgun with a ACOG!!!!!!  2. This game suffers from the Farcry outpost capturing bug. Once you clear a sector it is sort of rinse and repeat, there are sectors that are more fun to libreate such as the one where the KNA supporters live but once again there is little variety.   TLDR: Good game (NOW), pick it up on sale, waste a few hours that god has given us and move on with your life. Wish they used the weapon variety that the old homefront had.  ",
            "review_score": "1"
        },
        {
            "review_text": "Here are just some ideas i thought about the game while playing. its the first review i've written so many words! 1. i bought this game on winter sale so the price doesnt matter so much to me. 2. the game run well on my pc but abit laggy on co-op mode. 3. the game itself could be quite repetitive as in looting bins, dead bodies and taking down enemy towers but the atmosphere was so well done. i died several times cuz it was very easy for soldiers to find and kill me but it felt very realistic. taking down the facilities on normal mode was extrmely hard but there is a sense of achievment, like, sky high. 4. looting is something i do so that i could sell it for money but whats the difference between, for e.g., 'canned food' and 'children's toy'? is something worth more than others? 5. the lighting on characters was dark on darker characters....i have to turn on the torch to see their face clearly.,, and with the torch on, moving makes me feel dizzy. 6.resistance mode/ co-op is separate from story mode and the missions are quite challenging on normal mode. 7. the anime for customising guns look so so cool, but the options are still limited to 3 custimisations for each gun. 8. the RC cars made me think of Watchdogs 2, but in this case they expode!",
            "review_score": "1"
        },
        {
            "review_text": "Games is pretty fun, but as of right now it is worthless. I wan't to say im about 40-50% through the game and I am glitched to where I can't even progress to the next part of the mission. That's a big definite fail in book. Until this game is fixed, which I doubt it, I would pass and wait for a sale, but be forwarned of this glitch.  The gameplay is ok and the story kind bores me. Just seems so random that both enemy and friendly coexist within the same blcok. It's like the DMZ, but in the US. Takes the realism away for me. Weapon modifications are different , but more fantasy. Voice acting is bad as well. I kind feel like I was starting to dreage through game at this point, but I would have at least liked to get my moneys worth before it crapped out.",
            "review_score": "-1"
        },
        {
            "review_text": "Better than previous game, but still not enjoyable and monotonous. It had potential but...they ruined it.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't play it, Can't return it. Took a chance since the game came out in May, maybe they fixed everything. Nope, everytime i run there's constantly lag. I am running i5 4690k and 1070 FTW",
            "review_score": "-1"
        },
        {
            "review_text": "This game has one big problem: It feels mediocre in many ways.   There is nothing particulary bad about it, sure there are some bugs, mostly visual, sure the AI has some hiccups here and there and sure the story isn't super engaging but none of that makes the game bad, none of it really disturbes the flow of gameplay all that much.   Yet the game doesn't really have anything great about it, nothing you are going to remember 2 years from now, no amazing stories to tell your buddies and thats what makes this game... well mediocre.    Still it's worth a buy and thus i'm giving it a thumbs up. Surely not at full price but if you see this in a sale and want to have an entertaining open world FPS that borrows heavily from the Far Cry series then Homefront is certainly worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "Was and avid player of the first homefront, unfortunately this game does not live up to the hype that was created for it, and did not reach the potential of the story that its predecessor gave. I would not recommend this game to anyone who is looking for an open world game as it is marketed it to.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought it for Guerilla Warfare, Insted I got a the opposite with face to face combat...  That and This game is unoriginal and consists of caputing points, The Ai is crappy coded and the aiming just sucks....  I preorderd this game off ♥♥♥♥♥♥♥, If I had got it off steam I would of asked for a refund as this sucks really Badly.",
            "review_score": "-1"
        },
        {
            "review_text": "Now with extra bugs... a short one-hour DLC broke the multiplayer, hope it will be patched soon...  Only recommended for fans of open world shooters if on sale at &gt;50% off.   The bad: - Rushed release with all the bugs you'd expect: Poor detection, crashes, getting stuck in the interface in-game, regularly falling through the floor, failing to trigger melee takedowns and being gunned down as a result... I could go on and on and on. - Campaign with a generic story that packs very few emotional punches. - Rushed multiplayer and really lackluster matchmacking... probably the reason why so few people are available for matches.   The good: - Brutal start to the campaign, very atmospheric and dark, has that oppressed vibe like City 17. - The apocalyptic warzones / red zones are the highlight of the game and feature some fantastic level design (especially for the multiplayer missions). - Decent shooting mechanics and creative weapon animations.",
            "review_score": "-1"
        },
        {
            "review_text": "I loved this game. It took me 45 hours to finish, so I feel like I got my money's worth. Those people who complained that they finished it in six hours just cheated themselves. Played properly, it's quite enjoyable. There were some minor bugs, but I had only one that was substantial and prevented me from completing a zone, but it didn't impact the storyline. The game did have some stuttering issues, but they were fixed the first day.  A lot of people are complaining that it's not Doom, but I don't think it was intended to be. You can't just run in guns blazing and expect to survive. I played it as a stealth game and had a blast. It requires you to use your NPC comrades to create a squad. They would pin down the enemies and I would run around behind and pick them off one at a time.  Played the way it was intended, this game is a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "NOTE: I am a singleplayer gamer, so I'll only be reviewing the singleplayer portion(s) of this game.  TL;DR - Great game, and I do recommend it for others. But since you can't play past the ending, it's not a game I'm going to play more than once. Thanks for the free weekend so that I didn't end up regretting a purchase.  Now that that's out of the way...  Played through story mode from beginning to end. Story itself had potential to be really great through-and-through, but certain climactic moments were full of cliche and uniformity (especially the end bit). While I was quite disappointed that it didn't follow the original concepts of the original Homefront (esp. because John Milius was a consultant for the original Homefront story) it ended up being capable of standing on its own feet, as it were. I did rather appreciate the constant fear of betrayal, and even being on the receiving end of suspected betrayal, but I didn't like how the KPA took over the US via waging economic war. I much preferred the original story, and this one would have been great as a game of its own, without sharing the spirit of another.  With all that said however, it broke my biggest rule in 'open world' gaming; in Homefront: The Revolution, you can't play past the ending. That, in itself, is normally a dealbreaker for me. There have been a few exceptions to this (especially Fallout: New Vegas since you can just 'fix' that with a mod). But unfortunately, this game is not the exception, but the rule. Sure, it has other 'modes' you can play in singleplayer, but if I can't get the story out of the way so that I can freely muck about in the worldspace(s) without that main mission marker making me avoid certain areas and/or safehouses, then I simply won't play it again. This is functionally a quasi-clone of the latest Far Cry games, and both FC3 and FC4 let you play past the story. And before anyone suggests it; NO, reloading the checkpoint from before accepting the 'Point of No Return' mission is NOT acceptable.  Now, if they ever release a 'free roam' DLC where the story bit is removed from the entire worldspace whereby all the yellow and red zones are unlocked, and you can continually do random jobs, I might consider purchasing the Freedom Fighter Bundle when it's on sale again. But until that happens, no sale. By the way, yes, I am indeed suggesting I'd buy it as a DLC.  Aside from that... Even though they released the 'performance patch,' I still got quite a bit of lag playing through the story. My rig only just barely exceeds the recommended requirements, but even still, I don't think they're quite done with their optimisations. Either that, or they may want to up their recommended requirements to match what is actually required to not have the game completely freeze for a few seconds upon entering a new zone.  At the end of the day, I do like the game. I just don't like it enough to support devs who make open-world games yet keep the ending closed. So while I greatly appreciate the free weekend that allowed me to make a well-informed purchase decision, I won't be buying it until that huge mistake is corrected.  I already know a lot of people don't care about the whole 'open world; closed ending' thing, and [sarcasm]good for you[/sarcasm] if that's the case. But shut up, this ain't your review, nor your wallet.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I admittedly didnt play it until after it was patched but the game was very stable for me. Never had a crash or anything gamebreaking. Found a couple spots where I could leave the map and then you would fall under the map and die. But you have to be looking for these and they arent common.",
            "review_score": "1"
        },
        {
            "review_text": "Plain awful. No plot, no gameplay, no nothing. How could they fail original Homefront so badly?",
            "review_score": "-1"
        },
        {
            "review_text": "It's 'ok'...  ... I guess.",
            "review_score": "1"
        },
        {
            "review_text": "Forget what people say this is a great game great game! Dambusters kkep up the hard work and keep making the gen move. The game has so much going on that its a shame no one gave this game a chance. If you love or like half Life one or Two get this game it's the modern day Half Life.9 out of 10. but i also hate number ratings if you like games then just play this game!",
            "review_score": "1"
        },
        {
            "review_text": "Only positive I can say about this game, is that you can play as a grandma in resistance mode :)",
            "review_score": "-1"
        },
        {
            "review_text": "Homefront: The Revolution is an open world first-person shooter video game and has some great aesthetic devices and a cool concept, however, the game felt repetitive, unpolished in my opinion. Also, I had some issues with it detecting my mechanical keyboard, which has RGB backlighting for some weird reason it kept on changing the color of it and I think the game engine didn't like the corsair software which was strange. I would recommend this game, however, isn't worth the asking price of £29.99 which it was before the steam sales.",
            "review_score": "1"
        },
        {
            "review_text": "So... I know why people were alittle mad about the game as the AIs still were idiotic when in combat, you die way to fast, have a limited amount of weapons plus expansion mods of said weapons. But overall the graphics are awesome, I like shooters and being able to craft so that was a plus, and the storyline was well I havent finished yet but right now its good a little bland and also bull at the part I am on. But otherwise I would recommend this game very open world with different styles also I like the fact that the redzones arent has hard as the yellow zones",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, when I first started playing this game I was not very impressed - every time I encountered the KPA a huge gunfight would ensue and I would die pretty quickly (also partly due to my average shooting skills). I forced myself to play on, and the more I played, the more I loved it..... As you gain the hearts and minds of the locals, and get some better firepower, defeating the KPA is much more of a fair challenge than early-on. I have played almost 50 hours and don't really have any idea how far through the story I am at the moment, but the game grows on you and I am really enjoying it now... The story is great, graphics very nice - I am getting over 90FPS with a 6600k and a GTX 970 on highest settings - and most of the mechanics and game-play aspects are good, no complaints. I love how you can run (sprint) infinitely and the gun mods and upgrades are all great too  After a rocky start, I would give the game 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good for single player. I thoroughly enjoy the righteous Merica mentality of it all. The open world aspect can be off putting but i think it allows for great emergent game play moments, ex, i took over a small appartment rooftop in a controlled contested area of a high security section of the city, and i started sniping the N. Koreans and started this huge battle, running roof top to roof top, like 5 star level GTA type crazy response by the NorKs but it was awesome because the resistance was joining the battle, oppressed civilians started attacking the NK soldiers and the whole thing felt really organic. It's a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "At least level design is decent so you can enjoy what is it looks like when america city in ruin (?  gameplay is mediocre, it's not really interesting but not ♥♥♥♥ either  about A.I sometimes enemy working as intended, sometimes dumb as hell  maybe pick this game when it's cheap",
            "review_score": "1"
        },
        {
            "review_text": "Okay I'm about 7 hours into this game and I can't understand where all the bad reviews come from. Is it a perfect game? No, it's not. But for $11.99 I really can't complain one bit.  I'm playing the game on medium difficulty and it can still be very challenging. You must strike and move otherwise you will get shot up very fast.  Every once in a while, I try to climb into a hole in the wall or window and the game won’t let me. This usually leads to death or wasting health packs. This is my only complaint. But it doesn't warrant the bad press this game has. Maybe earlier version were less stable? I can't really say, because I bought the game during the winter sale of 2016.  Honestly if I bought this game earlier for around $30 I still would probably be happy with it. Go ahead and give it a try, it may surprise you.",
            "review_score": "1"
        },
        {
            "review_text": "As many reviews here show, gamers these days have mutated into a bunch of cry-babies.  This game has some technical flaws but is no way a bad game.  Just a few minutes into this game and i love it already.  ***UPDATE: After spending 3h into the game i must say, despite some technical flaws of course, this is one of the best shooters i played lately. I love the graphics, the atmosphere and the way how missions progress. On hardest difficulty you really have to carefully use stealth-tactics, every rambo-style gameplay works as well....that means if you dont have a problem with dozens of mission-restarts until you finally made it.  Its really a miracle to me how this game gets such bad critics and when it comes to the technical flaws i have to say i actually play with FXAA and everything else on highest setting, and all i get is some slight stuttering at certain surroundings which never became annoying enough to make me stop playing it.",
            "review_score": "1"
        },
        {
            "review_text": "This game wasn't too bad. This is based on my gameplay during the free weekend.   Graphics: The graphics wasn't too bad. I didnt recieve any FPS drops like other reviewers and I have a GTX 760. The detail in facial features, wet vs. dry was pretty good.   Gameplay: The gameplay wasn't the worse but it did lack storyline other than 'fight the government'. Basically you're the resistance fighting against the government thru most of the game. Each new section or you can call them chapters in the game is pretty much the same. Capture this area for communication or destroy this area to limit government supplies, etc.   Bugs: The AI was ocassionally glitchy. I was able to hide in a dumpster while KPA agents were shooting me. The AI that follow you would also block you in a corner and wouldn't move no matter what you do.... unless you reload from last checkpoint was really annoying. Certain areas of the map you could glitch it where you can sometimes get up to the next floor without going around or basically fall thru the map. There was also many times where I get stuck and wouldn't be able to move (like getting stuck between the stairs and a wall) I personally find this as a bug but it may not be but the AI can not really detect you when you're above ground level. Such as chests or radio spots above ground level.   Multiplayer: I was only about to get into 1 game. There doesn't seem to be a matchmaking system and if there is, well then people just were joining multiplayer mode.   I would rate this game 4/10. It would have to be at least 80% discounted price for me to buy it. After playing a few hours (in which like 15 was afked) I wouldn't recommend or discourage people from buying this game.",
            "review_score": "-1"
        },
        {
            "review_text": "  A lot of people are saying this game is bad, and I can see why, there a lot of bad elements to the game such as the horrific AI. But, in my sight I think its a fine game, gameplay was fun. The story was great, and the soundtrack was amazing. If only they worked a little harder they couldve made the game better, hopefully future updates will fix the game's issues and such.",
            "review_score": "1"
        },
        {
            "review_text": "I dont know why people dislike this game so much. I wanted to buy it when it came out, and didnt because of the reviews. Now, with the free weekend...I realize I should have listened to my gut and bought it.  It has great graphics and atmosphere.  It doesnt resonate as a rugged shooter feeling you get with other blockbusters. Much more of a Clean and Steady Axis.  I like Feeling Clean. Anger doesnt lead me and rage is detrumental to gameplay. Thats something the blockbusters might learn from Homefront.  Players look for esteem and accomplishment when they play games... I dare to presume that the negativity is simply because the gamers arent clean within themselves, their own spirit and identity...and more of any, lack a sense of patriotism, drive and deliverance.  Ive played only 2 hours and my opinion might change , but homefront is an enjoyable and challenging game. One where the gamer decides if he wants to banter, destroy and pummel...or rather cultivate and build.  Its a well made game...and im pretty sure I will purchase it when I can. If I dont finish it this weekend when its Free ;)  GG",
            "review_score": "1"
        },
        {
            "review_text": "Based off of the free weekend I tried, The only thing wrong I see about this game is that the performance is balls.   Other than that, its got a decent story with nice cutscenes, even the voiceover is good like you can tell the devs put a lot of effort. The graphics are really good too. It even plays like your typical Far Cry game but the setting is what really does it for me.   Set in Philadellphia where North Koreans have treated Americans like dogs, you must rebel and start resistances throughout different parts of the city to ultimately overthrow the 'Norks'. That is so sick! In Far Cry, you are just getting signals and revealing parts of the map!   Trust me, if this game was the original Homefront, people would LOVE this game. I think the reason why people hate on it hard is because of two things.  1) Poor optimization = I personally get 40-60 fps on a gtx 970, amd 8320fx and 16gb ram. I get that, that sucks but it does NOT warrant a negative review UNLESS the devs are not putting out patches.  From what I understand, they have been pumping patches and actually have a pastebin where they want people to submit their dxdiag logs to see what causes the issue.   THAT IS EFFORT. THEY ARE TRYING. WHY DONT YOU BECOME A DEV AND SEE WHY YOUR GAME LAGS ON DIFFERENT BUILDS. DO YOU SEE HOW IT COULD TAKE TIME TO DIAGNOSE THAT?  2) Unoriginal 'Far Cry 3' gameply - It has that 'scavenge, resource, and take over base' gameplay thats been replicated a lot. I dont mind it. That is all I did the first 3 hours and enjoyed it. If you dont likE that gameplay, that is also fine. It just suits different people well.  Overall, I plan on buying the game since the free weekend help me form an opinion on it.",
            "review_score": "1"
        },
        {
            "review_text": "Homefront: The Revolution is an excellent game. While it brings virtually nothing new to the table, it combines various elements of game series known and loved by many, including similar social stealth elements reminiscent of Assassin's Creed, and the enjoyable gunplay and customization of Crysis. It also bears tribute to Far Cry in the capturing of various outposts and 'towers'. What really makes this game shine, however, are the stunning visuals, which really bring the battered city of Philedelphia to life. The game especially shines at nightime, and if it's raining. There are some bugs, mostly related to AI Pathfinding and some animation errors (Characters getting stuck in T-poses) but overall, it's a fairly polished game with acceptable optimization. Creds to the developers, as this game was in development hell for a long time. A solid 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "I remember how Homefront was advertised as coop story game. Finally, I bought the game aaaand... THERE IS NO STORY COOP. It has extremely sh**y resistance mode coop with absolutely independent missions. Moreover it is impossible to find any1 for coop missions. SO if you dont have a friend, never buy the game for coop!  I'm dissapointed, sadly, cant return the game as I left it working in background for todays night :(",
            "review_score": "-1"
        },
        {
            "review_text": "Not as bad as I have heard. Gameplay felt like Dying Light but with North Koreans :D  I didn`t have any performance issues and could run the game on max settings on a 3 years old GPU.",
            "review_score": "1"
        },
        {
            "review_text": "I don't understand why this game has such a bad rap. Sure, the intro is 30 minutes long and unskippable, but the game plays like an urban Far Cry title with weapon and character / gear customization, vehicles, stealth, lock picking and 'hacking'. The gunplay is decent, nothing special but it's fun enough on it's own. The ability to drastically modify your weapon mid-firefight is pretty cool. I haven't paid any attention to the story, so I can't really rate that, but all in all, the game is at least fun. I understand it had a terrible launch, and it was a sequel no one really wanted, but if it wasn't called 'Homefront' I think this game would have done a lot better. Not worth $60, but $30? Maybe. $20, definitely.",
            "review_score": "1"
        },
        {
            "review_text": "For a $60 game, this is not okay. Graphics are bad, repetive gameplay, and no real choices. Little varity in the world. There are two types of enemies that you come across. NO VARIATION in them. Just not a very good game.",
            "review_score": "-1"
        },
        {
            "review_text": "Ok so let's talk about this game, this won't take long.   I was a big fan of the first Homefront even if it was a little generic. When this game was first announced I thought it had promise but as things progressed I started to get worried. In any case I picked it up and have played a few hours and I just can't play  anymore...why?  Is it bad, is it glitchy? Well no to the first question and maybe a little to the second question.  The big issue is that it's just soooooo generic and repetitive. The graphics are ok and I need to give the rain kudos for being some of the best rain in gaming, honestly the rain actually makes individual drops on the ground and things get wet in real time, it looks amazing! However when the best thing you can say about the game is the rain effects then you know it has problems.  The story makes little sense and gives you no reason to care about anything or anyone, the level designs are hollow boring sandboxes and the shooting is intially weak and wimpy. Things get better as you upgrade weapons but the problem is other than some strong enemies the gameplay never varies. It is like a standard sandbox game where you go to 'X' and press 'Y' to capture an area. Rinse and repeat over and over. There is some mindless catharsis in this but after a couple of hours it gets boring. Part of me wants to keep playing because there is a little fun to sniping enemy patrols but when you go from one generic city block to the next that fun quickly evaporates after 20 mins or so.  I didn't get any major bugs while playing but there were a lot of clipping errors during cutscenes and generally rough edges.  All in all it's an average shooter with bland level design and a ♥♥♥♥ poor story that makes it difficult to play for longer than 15-20 mins at a time.  5/10",
            "review_score": "-1"
        },
        {
            "review_text": "OK, I recomend this game - with reservations. Only giving thumbs up for balance.   I loved old Far Cry games. 4 wore on me. I liked primal but despite the change up it still was jungle far cry. This despite not being 'far cry' is far cry in a city and I am actually enjoying it a lot.   Heres the reservations after only a couple hours in, and I will update.   Runs 60 fps for me on gtx 760 but have to turn a few things down. Still amazing atmosphere. I have had a random black screen freeze up and crash to desk top so it needs work on the optimization side. So, yeah seems rushed tbh.  Yet, if you liked Far Cry 3 but might enjoy it in a burned out city this may be for you. I suggest finding on sale. It does mix things up a bit and far cry in a city is almost falloutesque at times. Definitely reminds me of Dying LIght without the zombies.  I DGAF about the short freezing when it auto-saves. All in all the game seems rushed but it's OK. I think the critics were a bit harsh though. 7/10 (so far)",
            "review_score": "1"
        },
        {
            "review_text": "  Terrible view distance, objects pop in 30-40 feet away, game takes a severe graphical dip after the intro, stiff and lifeless facial animations, terrible stupid and non threatening AI (even on the hardest difficulty), lazy urban Farcry 2 gameplay. Unoptimized, uninspired, unworthy of your money. Even for free I could only stomach a couple hours.",
            "review_score": "-1"
        },
        {
            "review_text": "one word to sum up the game (CRASH) start the game crash get it go 5 mins crash swich in to lowers setings run fine for 10 mins crash shut it off come back to it 10hours later crash get ♥♥♥♥♥♥ off ask for refund so i dont punch my pc  AMD FX 8320 3.50 GHz EVGA OC GTX 980 tuned up  so ya it looks like it wound be a good game if u can keep it running for more than 10 MINS   ",
            "review_score": "-1"
        },
        {
            "review_text": "Refunded; a stuttering mess!",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Cry-Engine based game ever -.-",
            "review_score": "-1"
        },
        {
            "review_text": "a waste of 37.9GB runs well until you get into the open then it lags like someone tased my pc combat is boring and repetitive looks okay but its hard to admire the same dark wall and average lighting when youve seen it 20 times and your game lags whenever it renders more than a road sign, i couldnt even get out of the tutorial without my game jittering and freezing even though the fps counter said 50 overall, it is a boring and poorly made game with dissapointing combat and gameplay but has an okay weapon customization system.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I expected nothing and I'm still let down",
            "review_score": "-1"
        },
        {
            "review_text": "The optimisation... The glory optimisation, it's so good!  (sarcasm)",
            "review_score": "-1"
        },
        {
            "review_text": "I was intrigued from all of the early word on this one, decided to wait it out for the patches - grabbed it on the free weekend to give it a spin and bought it an hour later. This game has gotten some hard raps, mostly not deserved from I've seen. 11 hours in and this is one of the better titles I've played this year. It's gorgeous, well realized. Excellent sound design and weapon action. Great open world, does its own take on the Stalker/Dying Light/Half Life feels. Definitely the best Far Cry ever... Good writing, excellent acting, some musing on war what is it good for, interesting setting.  Absolutely ♥♥♥♥ story though :) All in all a solid game, executed well, with some interesting design and slick minute to minute gameplay loops. Highly recommended. ",
            "review_score": "1"
        },
        {
            "review_text": "The first two single player levels are based on the premise that you need to avoid the enemy and not kill them (because killing them calls in reinforcements). However, the game doesnt give you the normal tools of an avoidance game; i.e., no sneaking, no crawling, no means to kill without setting off alarms (e.g., radio jamming). They do give you the standard run and gun tools, which backfire here. So, this game (at least in the first two levels) appears internally inconsistent, making it more difficult than necessary.",
            "review_score": "-1"
        },
        {
            "review_text": "I actually don't mind it, better than a large chunk of early access trash I've played and on sale costs much less.",
            "review_score": "1"
        },
        {
            "review_text": "Hugely underrated game - not without its flaws, but has excellent graphics, great gameplay (think Far Cry 3 in urban settings) and performs well after the updates.",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ing love this game, it is mainly about territory which is so fun and that you have to hide and be stealthy about it just makes it even more exhilarating",
            "review_score": "1"
        },
        {
            "review_text": "  Homefront: The Revolution is a mixed bag, but I think it ultimately prevails as an above average open world FPS. I played this game a good bit through its free weekend, and I enjoyed it. There's many reasons why its a mixed bag, so lets get to those reasons, shall we?   Positives",
            "review_score": "1"
        },
        {
            "review_text": "Bought a Marksman rifle. getting ready to snipe. get a new addon for it. its now a rocket launcher. okay. sure.   I must say that this game is not the best game i have played. but it is entertaining and i find it fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "░░░░░░░░░░░░░░░░░░░░░░ ░░░░░░░░░░░░░░Me░░░░░░  ░░░░░░░░░░░█▀▀░░█░░░░░ ░░░░░░▄▀▀▀▀░░░░░█▄▄░░░  ░░░░░░█░█░░░░░░░░░░▐░░  ░░░░░░▐▐░░░░░░░░░▄░▐░░  ░░░░░░█░░░░░░░░▄▀▀░▐░░  ░░░░▄▀░░░░░░░░▐░▄▄▀░░░  ░░▄▀░░░▐░░░░░█▄▀░▐░░░░  ░░█░░░▐░░░░░░░░▄░█░░░░  ░░░█▄░░▀▄░░░░▄▀▐░█░░░░  ░░░█▐▀▀▀░▀▀▀▀░░▐░█░░░░  ░░▐█▐▄░░▀░░░░░░▐░█▄▄░░  ░░░▀▀░▄▄▄▄▄░░▐▄▄▄▀░░░░  ░░░░░Negative Reviews░░░░░ ░░░░░░░░░░░░░░░░░░░░░░",
            "review_score": "1"
        },
        {
            "review_text": "I was really excited when Homefront:the revolution was announced as an open world game. I didn't play the first game in the series more than a few hours for a plethora of reasons. I even waited when reviews were somewhat spotty at best on this game. This new itteration of the Homefront series has some good quirks and some bad. Let's start with the pros shall we? On the list of pros Homefront presents a somewhat large open world for you to bring freedom to. It seems to breathe, it seems to move and be legitimately animated. When I first started playing I was absorbed into the world and excited to explore it. The next pro would definitely be the weapons. Although there isn't a large variety to be had with this game, what it does let you have are a few archetypes that can be customized to your liking (pistol, shotgun, assault rifle, sniper rifle) and each of these weapons has a feeling that it is scrounged up and hastily put together for a fight with a better equipped enemy. There is also crafting of implements of destruction here as well, mostly just your run of the mill grenades, molotovs, mines... and then you also have a few cool rc bombs and drones at your disposal. I feel like these are the main things the game does really well. On the bad side however I will open up to a list of the cons. The game feels rushed , even with the patches out for it so far (6-7ish months after release). Framerat can stutter at times even on a higher end rig. There is also the problem of render distance for the ai. I've seen many times in game where enemy ai can just suddenly disappear, even while you are looking at them. As you can imagine this hinders players who like to use sniping as their main playstyle. This has even happened up close in many tight quarters firefights. Next up is the gunplay, now to me , the gunplay can seem very blocky and almost robotic feeling. It's nice to have interesting tools of the trade, but if they all feel very robotic or almost clunky to operate that takes away part of the fun of having them. One of the final cons I'm going to touch on is the fact that the ai is very poor. The enemy ai seems to be able to predict where you are at instantaniously and almost without warning at all. They also seem to be able to hit you as soon as you start engaging them, I have very rarely been missed by an ai ever in this game. The health system does little to nothing to help this as when you are playing on the hardest difficulty , if you get hit once you're already dead pretty much. That wouldn't be a big deal if the ai weren't all competition grade shooters. Anyways, if you are looking for a fix on an insurgant like game. I suggest you pick up a game like Red Faction Guerilla instead. I had such high hopes for this game and was disappointed by what I had actually recieved.",
            "review_score": "-1"
        },
        {
            "review_text": "I played and thoroughly enjoyed the original Homefront, so I was eagerly anticipating the release of Homefront: The Revolution. In total I've committed about 13 hours to it, and I have completed both the campaign and most of the strikepoints. The length of the game is far shorter than many have claimed, but it still is longer than average for most AAA titles. Whilst I enjoyed what I played, I can't recommend the game until the AI and optimisation are fixed, as these two are critical in holding it back.  A few things worth noting.  Graphics - Although it may be poorly optimised, the game is quite aesthetically pleasing. The environment has quite a lot of detail, and is fairly immersive for an open world game. AI - is broken and needs a full overhaul. The AI suffers from pathfinding issues, and is generally dumb in combat often charging in wrecklessly. Optimisation - Througout my playthrough I had my settings on Ultra (aside from AA) and was playing at a resolution of 2560x1440. Unfortunately the game lacks an SLi profile (attempting to use Nvidia Inspector to force it creates a broad array of graphical issues). Forgettable generic characters",
            "review_score": "-1"
        },
        {
            "review_text": "Meh just far cry 4 with a few more features, nice graphics and poor optimization, Could've been better but i think it's okay.",
            "review_score": "1"
        },
        {
            "review_text": "The game looks very nice, the atmosphere is great, I enjoy this kind of game. I love STALKER, Farcry 3, etc, so I know I could really dig this. If it ran. I get a CTD every time I try to play. I've tried many tweaks and changes to try to get it to work. I've tried the affinity fix, the multithreading fix (I don't have MT anyways), I've tried different cfg file edits. I do hope that someday I can play it, maybe then I can change my review.",
            "review_score": "-1"
        },
        {
            "review_text": "its ok, a bit laggy but i bought half price at amazon on disc! So buy on sale or after next patch!",
            "review_score": "1"
        },
        {
            "review_text": "  FREE WEEKEND TRIAL  Positives: -Visuals  Negatives: -Shallow characters -Mute hero -Firearms lack 'oomph' -Marksman like enemies -Liberating gets very old very fast -Horrible AI -Bugs ",
            "review_score": "-1"
        },
        {
            "review_text": "The amount of time says how entertaining this game was",
            "review_score": "-1"
        },
        {
            "review_text": "For nomination of 'Game within a Game' award. Finding timesplitters in this game caught me totally off guard. Was so engrossed I forgot I was playing homefront.  For the game itself, it had a lot of potential and played surprisingly well. I didn't ever get the feeling that I could take on the world, which is exactly what I wanted in a Guerrilla warfare type game.  However, the gadgetry could do with being a bit fleshed out. Plus the enemy AI could've used a bit of work. I think I actually enjoyed the story of the first homefront more tbh.  With respect to multiplayer, as much as I liked the multiplayer in the original homefront, I'm not particularly bothered its gone.",
            "review_score": "1"
        },
        {
            "review_text": "  This game suck   IT WON'T LET ME LAUNCH THE GAME  IT SAYS press enter to begin   I KEEP SPAMMING ENTER NOTING HAPPENED  PLEASE TELL ME",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy like hell. Low framerates, its like Arkham Knight all over again. Game needs to be patched otherwise it is waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "uhm..dont buy it now, just wait for update. the game still buggy, got fps down even on lowest settings  i bought this game only 28$ so its worth a try",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks the sweat off a dead man's balls !!!!! I pre purchased the game and installed it when it became available. This was my worst mistake. From day 1, I could not get started due to the extremely slow and choppy framerate. No matter what I did, I could not get it to run correctly. All I can say is be warned....... This game is a real Piece of ♥♥♥♥ !!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "CAUSE OF LOW PERFORMANCE IS: WINDOWS 8 AND WINDOWS 10 Users with weaker systems but Windows 7 have higher performance than High end systems using any version of Windows that is higher than Win 7....There you go. That's the culprit...If your windows version is higher than Windows 7 ...you're gonna have problems. Devs need to work on optimization for Windows 8 and Windows 10    If not, this is the cause: 'Don't see what the problem is... I'm running it with a stock GTX 970 at 2103x1314 (Nvidia DSR). Performance is 50+ FPS in combat and stable. I don't see what all the crying is about. Probably the same thing as always. People blindly turn all the graphic settings to the max like idiots. Keep in mind that , just like any game, some graphical settings make absolutely no difference in visuals but reduce FPS immensly and more importantly, also keep in mind that some settings not only reduce your FPS by a lot, they also downgrade the visuals. Settings like post processing for example that just make everything look blurry and remove 20 FPS from your performance. You can have the game look amazing and run great with the right settings..... Max Graphical settings does not equal max visual quality...as I said. Turning up / enabling certain settings will reduce visual quality ( and FPS) in this game just like any other game.... NOOB: ' OH, if I want the game to look as good as possible, I have to turn up the settings to the max' Nope, that's a fallacy.   As for gameplay it's an enjoyable game. I think that people are having their experience ruined and calling this game trash because of their poor performance that they cause because they don't know what each setting really does and blindly try to turn everything to the max like idiots..'",
            "review_score": "1"
        },
        {
            "review_text": "My personal opinion is that i like this game, at the beginning it didn't seem very exciting and i have to admit it got a little bit boring but from halfway throughout the story i enjoyed it.  Ingame there are very cool options like transforming your assault rifle into an LMG, your pistol into a submachinegun, etc. Driving is not that bad but it's not the greatest, map is big but objectives and missions aren't very far and the max. time that you'll need to 'run' to them is probably 2 minutes.   Other than that graphics are fantastic and story can be nice and immersive if you pay attention to notes and other random stuff that you get by exploring.  Performance is not great, with my setup i have huge fps gaps that go from 110 to 30 but NEVER under 30. I thought about it and i recommend it.  Until half story i would give 5/10 From halfway to the end and even after 7/10",
            "review_score": "1"
        },
        {
            "review_text": "!!!!!DO NOT BUY THIS GAME!!!!!  The story is okay, but everything else is terrible. The gunplay is janky as hell, the movement controls are terrible, it's super glitchy, and it doesn't run very well.  If you do buy do not pay full price.",
            "review_score": "-1"
        },
        {
            "review_text": "Development hell do I need to say more?  Pros- Graphics are good Great idea  Cool on the move gun modification voice acting is ok?  Cons- Story is boring  They just throw you into the open game expecting you to just find it all out on your own Animations are ♥♥♥♥  Gun play is ♥♥♥♥ Ai is ♥♥♥♥ Theres not alot of diffrent voice lines so alot of npc repeates the same lines over and over again   This is another case of development hell a good idea moved from developer to developer that eventualy just got released when it should have been worked on for another solid year.",
            "review_score": "-1"
        },
        {
            "review_text": "one of the worst game i've ever player -_-  But co-op is too much fun man &lt;3 fall in love with the co-op but if u dont have co-op partner then dont buy the game it will not worth the money -_-   *-too much problem with the story  *-repeative missions  *-fu**ing bugs(now fixed myb)  *-worst combat  --  +good grapics  +good sound  +good weapon customization  ~_~",
            "review_score": "1"
        },
        {
            "review_text": "  I loved the first Homefront. This sequel is a shameful attempt at continuing the series.  I've barely played it in co-op and I can already tell it suffers from some of the telltale signs of a bad game such as: -Even on Easy it's too hard (you die in a few shots, that's not easy) -VoIP with no push to talk is enabled on by default -Generic menu that looks like a Call of Duty/F2P ripoff/clone. -Generic Mission-Style coop system -Dropping my coop partner and I into combat not 5 seconds after the mission began (no time to take in mission objective or surroundings) -Guns using generic sound effects instead of the unique ones that the first Homefront presented  I suppose it's not horrible, it's just same old same old with a lot of problems. Meh. It's a really poor follow up to the original game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "In all seriousness, the developers ruined this game..... I rather play a game where the screen are just black and white wavelengths, and the goal of the game is not to play Homefront.",
            "review_score": "-1"
        },
        {
            "review_text": "its a good game but the devs realy need to fix the issue where you do the police station liberation before it comes up in the storyline ( it makes it impossible to re rescue micky for the storyline )",
            "review_score": "1"
        },
        {
            "review_text": "Good but the real problem with it now is that there is not enough guns. Please add AK47 and more variants.",
            "review_score": "1"
        },
        {
            "review_text": "  Easily one of the worst games I've played, ever. And I've played Brink.   The AI are like ♥♥♥♥♥♥♥♥ children, (Running all the time, trying to run through a solid wall, talking needlessly all the time.) The game suffers from frequent frame drops, the guns feel weightless and have absolutely no character to them, the characters themselves are easily forgettable, not relatable, and serve no purpose other than to create a 'story' which you as the player most often feel un-attatched to.   Apart from the awful gameplay and awful characters, the setting itself is alright, the usage of cryengine really allows for beautiful lighting, and very atmospheric settings.  I rate this game a 3 out of 10, for beautiful environments, but absolutely horrendous gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Played the game from start to finish on Deathwish difficulty during the free weekend. I'm glad I waited, because it's fantastic.  I know the game was off to a troubled start, and so I waited until the invetible free wekend after the latest (as of Sep 11, 2016) patch to try the game out.  Finally, after all these patches, the game is now complete. And it's pretty good.  The combat is rock solid - I love the feel of the weapons. Some of them aren't really viable, but they're fun to play around with anyways. The story seems to jump around a lot towards the end, but it was overall coherent and emotional. Not Oscar-level, but good enough to keep me interested.  You really do get the feeling of a desperate, scrappy urban combat. The difficulty ramps up nicely and I always felt challenged. Being able to recruit up to 4 resistance members to chum around with takes the game from good to great - the game is nearly impossible on the hardest difficulty without support and knowing when to just run.  Overall, I would say this game is as good as Far Cry 3 - maybe even better, since I prefer the urban combat.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but still crashes once in a while.",
            "review_score": "-1"
        },
        {
            "review_text": "For players: I loved the gameplay videos so i was excited when i saw 'free weekend'.  My excitement died after i launched the game. Video setting was not saving itself and i spent like 30mins to find out why - no success. Lets try on high setting then - my laptop is not superior but game ran pretty well even on high settings. First 30 minutes were pretty good (FPS low but nah, who cares). After my hope was partially restored, last nail to the coffin appered - after i got beaten by two unknown guys, loading screen appears, game frozen and crashed. OK, maybe bug... lets try it again: Bang, another ♥♥♥♥ appeared. Load save was 5 minutes od because, you know, checkpoint save system(what a stupidity). So, i did all again and... yes... it happened again. For demo/beta its a pretty good game. For 40€ product... you kidding me? Waste of money. Its for free and i cant even play it (at least without wasting hours to googling solutions to bugs). Wasted 40€ and 40GB. First impression is good, game looks nice. But with all the bugs and glitches, i understand why ratings are so low... i would rather buy far cry 3 for me (and for my brother... and for my best friend... and for another random person) than buying this wannabe game for 40€.  For developers: Look, next time dont waste money on Denuvo - people wont be stealing this crap. Trust me, its free weekend and i am uninstaling this 30 hours before it end. This 'product' is not even worth the stealing...",
            "review_score": "-1"
        },
        {
            "review_text": "Cool",
            "review_score": "1"
        },
        {
            "review_text": "  just played it i m just dissapointed  it has wasted potential  -Grapichs looks amazing but FPS drops Are real i7-4790 GTX 1080 Strix OC 16 GB Ram  -AI is just absolute garbage spawn points are are joke most of the time they spawn in the area where you cleared seconds ago frustratingly broken as ♥♥♥  -Open World is Ok but doesnt giveu the feeling of a open world its just paintjob...  The areas you have to liberate has 3-5 enemies u just kill em and press E on a valve or just blow up some tanks then press E on something else to liberate the ♥♥♥♥♥♥ thing no effort what so ever  Hell even when u do %100 Riot and broadcast a massage to whole city it shows a pre-made cinematic wherre some citizens scream and ♥♥♥♥ like wtf you cant even hear wtf u saying.  this game is just a paintjob of a horse with its grapichs but has the gameplay of a sht  it just doesnt justifty the money for me maybe grab it with %60 or %50 sale",
            "review_score": "-1"
        },
        {
            "review_text": "I hate to downvote this game because I like it AND it is fun....until it ♥♥♥♥ing crashes, freezes, loses sound or whatever ♥♥♥♥ing bug you will encounter among the numerous ones.   The whole concept of the game, the settings, art direction, and idea of semi-open world built on advancing and controlling territories (goes well with the revolution theme) are very interesting; the game has a lot of potential. It just needs better quality control, more patches, more content and adjustments with its ideas and mission structure.",
            "review_score": "-1"
        },
        {
            "review_text": "this game i very like but 80% black on screen n blurr at the begining of part 1 ,, cannot play ??? very sad",
            "review_score": "1"
        },
        {
            "review_text": "Look in the dictionary for the word 'underrated' and you will see a picture of this game. Nothing more needs to be said.",
            "review_score": "1"
        },
        {
            "review_text": "no good to buy, is pirate yes",
            "review_score": "-1"
        },
        {
            "review_text": "As of September 2016, it's well playable well on GeForce 1070; I got 60 fps with maximum video settings. The story isn't too attracting, but it looks well and its FarCry-like gameplay is good, for the first hours at least. It's much more interesting video game than the predecessor.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Not bad.. a bit confusing at first but only played it for about 2 hours.",
            "review_score": "1"
        },
        {
            "review_text": "This game is nasty, the reviews are ♥♥♥♥♥♥♥♥. Sometimes the AI gets stuck on corners, breaks immersion a bit, but this is still a nasty game.  Molon Labe.",
            "review_score": "1"
        },
        {
            "review_text": "Like The Division.. maybe next time i will buy that game.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly not that bad of a game. The story, gunplay, customization and freedom that this game has is very good. It reminds me of Far Cry 4. The only downside I can see is poor optimization and for some people driving ceratin vehicles. Also, now it is on sale and will most likely be on the Steam Holiday Sale so it is fairly cheap.",
            "review_score": "1"
        },
        {
            "review_text": "  From what ive played in the free weekend the game is good and it runs well. Most of the older reviews are from when the game crashed, ran poorly and just didnt work but it seems pretty stable now. Dont listen to the older reviews since they are irrelevant now",
            "review_score": "1"
        },
        {
            "review_text": "I want to be brief and open. This game was not as good as I hoped it would be. I still recommend it if the idea excites you. I loved the first Homefront. This was not as good. I have not played it since the first month after it came out - it was glitchy, but fun. I had fun playing this game. That's what games are for.",
            "review_score": "1"
        },
        {
            "review_text": "  Homefront: The Revolution is a game I've been interested in since it was originally announced. After playing the first game in the series in 2011, I was impressed by what I initially saw in the sequel. Although the game is a huge improvemant over the original game in terms of ideas, it's still not a good game. The main character's are sort of cookie cutter and not very well developed. The story is shallow, not well thought out, and in the end feels unimportant. The world design is boring and doesnt feel alive or real. The A.I. in this game is terrible. Strange scripting, like npc's hitting walls with melee weapons for no reason. The gameplay is 'ok' but feels outdated, the gunplay could have been a lot better. I really believe if this game came out 10 years ago (minus the modern graphics obviously) people really would have liked it. Sadly this game doesn't meet todays standards.  The optimization leaves a lot to be desired and I experienced frame drops/hitching/stuttering throughout my 10 hour playthrough of the game. This was on a 980 Ti mind you. I understand performance used to be worse before the latest update, but in my opionion it's nowhere near where it should be. I have seen worse though. Your experience may vary.  This game does have things I really liked. The graphics in some environmonts were great. The game also features a great gun customization resembling the one featured in the 'Crysis' series. There was some great character design throughout the game. I was very impressed by the way faces looked in this game as well. Besides the terrible animations, the characters looked real. The game does have a lot going for it, just not enough...  Overall I really think this game should have had A LOT more work. I know people don't like to hear this, but this game really should have been pushed back farther for optimization and gameplay improvements. I really feel this series and game have/had a lot of potential. This series and gamers deserve better.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a hard review for me. On one hand, Always have been a homefront fan, Compelling story, Sense of urgency, and great graphics. Since being taken over by another dev, I DO believe this game is great. Thats why I would recommend it, however, take not of my cons CONS: Open World is clunky, and doesnt feel as open as you'd think Only 1 vehicle ? wtf Disconnected Storyline lined with random on the spot sidequests Limited Guns PROS: Great graphics Moderate Difficulty Somewhat smooth combat a HUGE improvement from the 5 hour long original Homefront ",
            "review_score": "1"
        },
        {
            "review_text": "So far this game is pretty awesome! The game plays alot like an 'urban warfare' Farcry. The graphics are awesome, gun customization is amazing (so are the animations of it). So far I have no complaints, i'll update the review when i've beaten the game, but i'm happy with my purchase :D.   Ps. The game is getting alot of bad reviews, mostly seems to be because of optimization issues (or just people hating on new release games with the other cool kids). While the optimization could be much better, this game has incredible graphics and i'm running it fine at 4k. Hopefully Dambuster will keep the game updated and maybe add some cool stuff to it like the devs of dying light did. This game is pretty awesome already but with some love and care from the dev's could become a 9/10 or so. So, if you are having problems running the game, these issues should hopefully be fixed soon.   980ti i7 4790k at 4 GHZ 16 GB of ram Game installed on a 1tb SSD",
            "review_score": "1"
        },
        {
            "review_text": "To anyone who loves a true single driven story mode game, this game is honestly not for you. The beginning of the game fools you at first with its nice intro but then completely loses its edge when it goes upon your first mission and goes down hill from there... if you want a game that is a clone of 'the division' go on.... keep playing or buy this game...if you want something more fun...look someplace else and save 60.$ of your hard earned money.",
            "review_score": "-1"
        },
        {
            "review_text": "From what i've played of the game so far it seems to be pretty decent, It's not gonna win any game of the year awards, but the world is gorgeous and very atmospheric. The gunplay is borderline exceptional IMO. There are a few glitches,but nothing ground breaking. I'm playing on the hardest difficulty and it seems this is how the game was meant to be played. It's not SUPER hard,but instead makes the AI pretty competent for the most part. The story is what you should be buying the game for. If youre a fan of single player story campaigns give this game a shot. I would probably give it like...UMMM 6.7/10 something like that. its worth buying,but once you finish the story your unlikely to play the game again.",
            "review_score": "1"
        },
        {
            "review_text": "I am having a lot of fun with this game - I don't think there's any point considering it alongside DOOM, as they're both entirely different propositions.   The open-world is great, full of loot and the gameplay features plenty of weapon and gear upgrades to chase. The weapons themselves have been fun, and the on-the-fly modding is fun. It's possible to recruit several AI followers to help you with quests, and you have to think a little bit before attempting to tackle them - it's not always possible to run in guns blazing. There's verticality in the environment that you have to use, and more than one kind of stealth that is necessary.  My main complaints would be that the enemies are capable of killing you within a few shots, which has led to a few frustrating moments where I've been sent back to square one. It's not always clear which way is the best to tackle missions and quests, but having said that, I'm still playing.   I think this is a way better game than what the reviews have been saying. I haven't had any performance problems, though, which would probably change my opinion of the game if I did have them.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for about three hours on medium setting and have only experienced a few glitches and latency problems. There are all these people here complaining how they have these good systems and the game is 'super glitchy'! I notice how none of them even metion checking their graphics drivers even though they can have a huge affect on gameplay quality. I updated my drivers the day before I installed the game and have only had a few, small problems. I honestly don't know why these people are so eager to give this game a bad rating, It came out only 3 days ago, of course there will be problems. No game is problem free right out of the box. I believe anyone expecting them to be is just setting the bar too high. ",
            "review_score": "1"
        },
        {
            "review_text": "Random crashes with no patch in sight. Rip off. Waste of Money.",
            "review_score": "-1"
        },
        {
            "review_text": "Lack of technical polish (a beta release?) and cheesy main characters (and voice acting in places) let down some strong world building design and inventive gameplay - difficult to recommend at full price (£40!) but definitely one to look at in the sales....",
            "review_score": "1"
        },
        {
            "review_text": "RIP money gameply seems to be old style shooter except a few things like to cover system is really cool but thats it the shooting,momvment the AI are stupid  ",
            "review_score": "-1"
        },
        {
            "review_text": "Alot of people were saying that this game was bad and not worth it. Personally no Homefront will beat the first one but this one was good i enjoyed the story line and all the new gadgets/upgrading trechniques, To me the best part about this game is the ability to customize your guns , buy diffrent type of nades,stuns ect. RECOMMEND IT",
            "review_score": "1"
        },
        {
            "review_text": "Short version, it's a solid game that is fun to play, has mediocre at best voice acting, a semblence of a plot and a few graphical glitches. While fun to play it feels like it needed another month or so of play-testing before release.  (For reference, I'm running an i5 3770k with two 660Ti in SLI, on lowest settings it was perfectly playable, anything higher gave input lag of up to .5 seconds. FPS was constant except for ~.5 second freezes when saving, which were never at bad times.)  Long Version:  Pros; -Fun map to explore -Beautiful environments -The weapon customization system gives you options, and due to the time it takes to change the weapons it asks the player to think about the combat situation before entering it -Dodging between buildings in a 'red' zone while avoiding Nork patrols and the Airships (robot sky whales, no, really) is very fun -Moving through an occupied 'yellow' zone while dodging patrols and cameras is also fun -Seeing the 'effect' that the player character has on the environment is nice. It goes from dodging patrols and hiding to walking down the middle of the road over the course of liberating a zone.   Cons: -Very mediocre voice acting -Unoriginal/predictable characters and plot -Rare minor graphics glitches (a few people floating 1-2ft off the ground, etc) -Variable AI, sometimes dumb sometimes ok. The flying drone AIs were very poor and would sometimes try to fly into a building and get stuck or run into walls and explode, but to be fair I've worked with real life drone autopilots and our real world ones aren't much better. -The motorbike is super glitchy and not very useful in the environment. I found several bikes embedded in objects and died twice just getting off the bike.  Overall: I liked the game. The story and characters were meh but the fun of running through the city and liberating the zones was why I got it, and for me it was worth it. The glitches were never game breaking and easy for me, at least, to overlook. I'm ok with the $60 price tag since I got much more play time from this than a call of duty title (I mostly do single player stuff), but it's up to you if you want to wait for a sale or not.",
            "review_score": "1"
        },
        {
            "review_text": "when you look down you can see your legs",
            "review_score": "1"
        },
        {
            "review_text": "britty good",
            "review_score": "1"
        },
        {
            "review_text": "I honestly believe this game is really good! I do not know why people are complaining about it having a lot of bugs, frame rate issues, brain dead AI, and bad story. Well...... some of that is true but Dambuster Studio have indeed manage to fix some of these issues as they promised. My only problem with the game right now is that the story could have been better, (a little bit cheesy), The AI does need some fixing, and for some reason there are times when i start the game and when i get into the optimization is ok, but sometimes when I start the game again the performance it awful. Cannot tell if this is a bug or its just me  overall I do recommend this game, but be aware its not for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "  Tried this on the free weekend. After sitting through the tedious, unskippable intro/cut scenes and boring tutorial sequence, I finally got to the resistance base and had to sit through obnoxious handholding and more dialogue. Made the fatal mistake of accidently exiting the area without crafting the molotovs as instructed, now I can't progress with the mission and the game won't let me go back into the base or load an earlier checkpoint. This left me with two options - waste another 10-15 minutes by starting again or quit out and uninstall the game. Have a wild guess what happened next.",
            "review_score": "-1"
        },
        {
            "review_text": "20 minutes into it I discover bad platforming , infurating puzzles and lacklustre gameplay. SOOOO glad I didn't actually pay for this.",
            "review_score": "-1"
        },
        {
            "review_text": "Even though the game itself seems pretty fun (albeit cheesy), I have constant freezes during the gameplay in totally random places.  And after a few small freezes game just hangs and can only be stopped using Task Manager :\\",
            "review_score": "-1"
        },
        {
            "review_text": "Mostly negative Really??   I know you're entitled to your opinion but come on mostly negative for this?  This game is amazing. I'm loving everything about it!!   The story is great, the gameplay is great, the weapons are great, the performance is great, the AI could be a little bit smarter but still this is a great game!  I have not witnessed any flaws I don't what the hell people are talking about bugs, I have not encountered any.   Btw I purchased this game full price and I would not complain about anything. Its worth every bit!",
            "review_score": "1"
        },
        {
            "review_text": "Ran into a glitch at one of the beginning missions. But was fixed with a reload. All the performance issues that all the neg reviews are citing are gone. Game is still kinda 'meh' but it runs quite well now.",
            "review_score": "1"
        },
        {
            "review_text": "  Far Cry meets Koreans in Philadelphia.",
            "review_score": "-1"
        },
        {
            "review_text": "think u are a north korean, and fight for your independence against us or its some corporation， that would be more reality, and that's the game, that's the revolution.",
            "review_score": "1"
        },
        {
            "review_text": "Not worth anything over $15 It's not a terrible game, but there is some bad points. gliching through enemys when driving anything, the gunplay is pretty bad, mediocre 'crafting' system, badlyt optimised with no sense of direction in the story that also was boring as hell with the chain of events leading up until you get your first gun making no sense. I'm not saying this is a bad game, just not worth how much it isn being sold for. If you can look past all the stuff listed above it's actually a very pretty game with some good lighting effects etc. Overall though, would not reccomend this unless it's on at least 70% sale.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst made games i've ever seen. If you can't pick this up for under $10 then don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "What a disappointment. This must be the most generic Open World FPS ever made. Not only is the plot uninteresting and the gameplay dull, but there is virtually nothing new to this game. I loved the first entry to the series but this one is a major letdown. I'd recommend to skip this one.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just plain bad. I am running a i5, 980ti, with 16gb of DDR4 ram and the frame rate drops like a lead brick when things get busy. The audio is terrible as well, walking through the town my ears are assaulted with a cacophony of garbled murmurs and what I assume was supposed to be backround noise. Bugs, bugs and more bugs; I had to restart the game 3 times because for some reason i would get stuck on 'auto-walk' after I concluded dialogue with an NPC. Hands went through doors, interaction were unavailable, enemies walked through/saw through walls... I could look past the technical garbage too with the hope that patches and updates could solve these issues, but only if there was a story and characters I cared about. The writing and characters are archtypical, trite re-hashes of ♥♥♥♥ we have been seeing in action films since the 80s. Don't expect anything original or compelling. The enviroments and NPCs are boring and uninspired, playing this game is akin to playing counter-strike in a server full of bots.The lore is interesting I suppose, except for the fact that the US would never purchase weapons from an enemy state, that's just absurd to me...   Graphics (when the game runs properly, which is about 35% of the time): 8/10 Sound/Audio: 1/10 Gameplay: 3.5/10 Story/Characters: 2/10 Overall: 2.5/10  I requested a refund, I am tired of getting burned with paying for premium titles and getting flaming dog turds in return... i.e. Farcry: Primal BLAH.",
            "review_score": "-1"
        },
        {
            "review_text": "Completed it on the hardest difficulty and - well - i've enjoyed it. Most of the times i had to think before an ancounter or completely avoid it, like in a guerrila. Sure it has many tecnhical flaws but the game still looks nice. The setting is fantastic.  Homefront: The Revolution is way different than the first one though, this has different open areas of the city where you have to complete missions (in a sandbox way) and conquest every outpost on the map, to let the rebels secure their position inside the city and get rid of the filhty NKA (North Korean Army). Look at it as some sort of Far Cry mixed with a (this is subjective) STALKER feel, but here instead you do feel like a real rebel fighting for his own people's freedom.  My performance weren't great but still better than what people are yelling around. Considering that i'm on a GTX 980 Ti i got 54-68fps on @1440p.  In short, it's a fun - and beatiful - game that even with its flaws (bugs and some animations) doesn't deserve all this hate.   Grats to the devs for finally delivering it, despite all the issues tha they've had during the development.  Just don't buy it right now, wait for the next 50% sale.   About the co-op:  I managed to play 10-11 missions in co-op at normal and hard. It's really fun but may be bored pretty soon. There are A LOT of unlockables and skills to buy but only 6 missions (that you have to repeat). Anyway it isn't the main focus of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Have to say this game has already given me some memorable moments.  After the prologue the first two times i found a bike i drove it like i have never driven any vehicle in a game, and proceded to nearly run over the koreans and my allies while barely missing buildings and vehicles. I don't use them anymore.  But honestly the game has enough flashy parts to keep you interested and the game has a nice difficulty so that i can't just grab the marksman rifle or assualt rifle and treat this like the coop missions in CSGO.   The characters are detailed, better than than that one game..... Division..... so you can easily like or hate people.  Honestly i was expecting something more like this from The Division.   My biggest gripe is that the campaign is not co-op, i enjoy even bad games if i can bring my friends with me, and this isn't bad.",
            "review_score": "1"
        },
        {
            "review_text": "ive played about 7 hour and am gonna review Homefront now... Im running a GTX 960 4gb and an I5-4690K  i clock in with about 50 fps on High settings with 1080p graphics. its not 60 but its still higher than HITMAN... The game looks beautiful and the movement is super fluid (movement is like a river that is super beautiful to look at and handle) If youve never played Homefront i suggest that you get this game when you can because its really fun. if you are like some people however and like to ♥♥♥♥♥ about not getting 60fps then you should wait to get it... I give this game a 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Homefront holds up pretty well, plays a lot like a “capture the base” game, but on the medium difficulty mobs are a bit bullet-sponge-y while the player dies super quickly. Also, there is almost zero bullet-tracing so tracking shots is very hard. Crossbow bolts get stuck on all sorts of invisible things :(  Also, when you get spotted by the zepplins you have about 20-30 seconds to get into a safe-haven or else you will certainly die, plus even if you get back to a compound you own, it will still be under assault (though the enemy will never re-capture it)",
            "review_score": "1"
        },
        {
            "review_text": "game is sweet , runs smooth",
            "review_score": "1"
        },
        {
            "review_text": "LATEST AND FINAL UPDATE: I finished the game, 30 hours all told, and I really enjoyed it. I had one lockup after 27 hours, but that was it, otherwise it was great and mostly glitch free, one small bug that prevented a minor side mission from being completed, but nothing that effected the campaign. So, as before, I give the game a definite thumbs-up.   UPDATE: I now have over fifteen hours in and I'm still enjoying the game. The game world gets even more interesting when you reach the Ashgate Yellow Zone (which is the third Yellow Zone, if you include the first one you see at the start of the game). There is color and a whole different looking environment than the first couple of Yellow Zones.  And in those fifteen hours no crashes, no glitches and most smooth 60fps gameplay. It has slowed down at times, but the only way I knew was via the Steam fps counter, otherwise I never would have even known it's was doing 60fps. And damn, it's a really pretty, very detailed game.  ORIGINAL REVEW: I have in just under eleven hours on the Steam version and I’m really enjoying it. It does have some rough spots, but it’s a lot of fun to play. I like open world games and Homefront scratches that itch. I think combat is a lot of fun and the modular weapon system works great and is a nice change. The plot is rather thin, but really so was the plot in Watch_Dogs and it didn’t bother me. The game map is fantastic. I don’t have any issues with the “greyness” of the Red Zones, there is a lot of color and objects around all that concrete. And there are tunnels and high catwalks and all sorts of paths to use.  I do have issues trying to access some of the harder to reach locations, the game doesn’t make them easy. However the designers included a clever system of using blue paint or flags to let the player know that there really is something to find and gives hints on how to reach them.  Some people have faulted the AI, but I’m finding them a challenge. They do seek cover when fired on, call in reinforcements and will flank you. And in the Yellow Zones, your stealth techniques really do get a workout.  It’s not a perfect game, but it is fun. And if it doesn’t break new ground in some areas, it’s better that the recent Assassin’s Creed games and as interesting (in a different way) as Far Cry 3 or 4. Fair warning however; it does take a good half-dozen hours before you really experience the complete gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Game has slugish movements and is just a bad game overall",
            "review_score": "-1"
        },
        {
            "review_text": "5/10  Pros + Graphics + High tech drones + Weapon customisation  Cons - Visual glitches - Motorcycle control - BORING storyline",
            "review_score": "-1"
        },
        {
            "review_text": "✓If you liked Crysis, you will Enjoy this Game. ✓If you liked Far Cry, you will Enjoy this Game. -If you liked any Open World Game, you will either Hate or Enjoy this Game. -If you liked the First Homefront Game, you will either Hate or Enjoy this Game. ✗If you like Games with Good Story and Characters, you will not Enjoy this Game. ✗If you are bothered by a Few Bugs or Glitches, you will not Enjoy this Game.  Current Score: 7  This Review is Heavily WIP, Please Rate Fairly.",
            "review_score": "1"
        },
        {
            "review_text": "  atm its not running smoth for me. it dosent feel like a AAA game atm. Lets see what hotfixes are bringing",
            "review_score": "-1"
        },
        {
            "review_text": "Its not as bad as these reviews. It has problems, but its stil better than most FPS's out there. If you can get it at a discount, then wait for a deal.",
            "review_score": "1"
        },
        {
            "review_text": "Clunky. Clumsy and Uninspired.   I was really looking forward to playing this game. I was excited to hear that it was open world and you were playing a resistance fighter. Cool setting. Running around free running blowing stuff up and generally and kicking ♥♥♥♥.... well not so much of any of that…  You can only climb certain buildings at certain points so there goes the whole jumping around (it takes about 5 tried to jump over a f###ing railing) The ‘Open World’ is just quarantined cells that you cut between with some tunnels. Gun fights felt underwhelming, I couldn’t aim for ♥♥♥♥ with a controller. The controls just feel off to me. Not a good game. If you can get it under £20 then by all means give it a try. But to me this game is horrible.  You start locked in a cinematic opening that really had no f###ing point what so ever. You get introduced to some guy who seems to be the main leader but had absolutely no back up. Like he is the main inspirational figure and he had a pistol. Like not even a guy with him that gets shot in the head. Nothing. A pistol and then he gets shot in the leg. It just happens to make you try and give a sh##. I felt absolutely no emotional attachment to the man and then you are expected to run around and try and save him.  You spend half your time killing guys armed with some awesome guns but you cant pick em up and use them? Why? It was never explained. You don’t see them on the ground. I mean you even have friendlies that get shot and drop rifles and all kind of stuff. Can you pick them up? No. I saw a backpack for sale at the store and then came across a backpack in a shipping container. Can you throw it over your shoulder and use that instead of buying one? No. This game is seriously bad.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Got it release day, still cant play it. Have GTX 670 SLI and even on lowest settings max i get is 45FPS. And i can play Battlefield 4 on High settings around 110FPS, and Crysis 3 on Medium to HIgh settings around 80FPS.",
            "review_score": "-1"
        },
        {
            "review_text": "Idiotic and cliche plot\\characters. Disguisting and awkward gunplay. Don't recommend it even for free.",
            "review_score": "-1"
        },
        {
            "review_text": "it's a fun game, feels pretty clunky at times with a cover system that works 50% of the time  Runs perfect on 650Ti Boost, all on Very High with 40+ FPS. Meanwhile it won't even boot on a 960 ",
            "review_score": "1"
        },
        {
            "review_text": "Im 4 hours in and so far I like it. Ive done time on both single and multiplayer. There is a brutal occupation going on, and you get to go out into urban areas to blow people's heads off. The graphics are great, the bugs are just like every other game, and the controls and game mechanics are the same as far cry ... which is why I like this game so much. I loved blood dragon, and this is its meaner, grittier cousin. I give it 4 out of 5 stars. Higher to 4.5 if the modding community gets ahold of it for episodic multiplayer events. Sooner or later someone will mod some zombies, but maybe something new will be out there this time for these ♥♥♥♥ing Norks.  *9 hrs in and the game keeps getting better. I can see why people that only invested 10 mins give horrible reviews. The first mission takes awhile, so it will soil the experience for some.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game but needs more content.",
            "review_score": "-1"
        },
        {
            "review_text": "  culd someone get the game working",
            "review_score": "1"
        },
        {
            "review_text": "its really good but yea,dont buy if u want to play multiplayer without friend(hard to find player in multiplayer)im playing homefront from PS4",
            "review_score": "1"
        },
        {
            "review_text": "Beginning seemed interesting, but the open world concept is already boring in a few minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "I was one of the lucky ones. Somehow the hardware gods smiled upon me, and I got zero lag and artifacts. However, buyer beware, the majority of people are getting heavy lag issues. The reason i recomend, is that it is a very enjoyable game, but you might as well wait for patches and a sale. I wish there was a middle of the road button, it just didn't feel right giving it the thumbs down. I'm really enjoying myself.",
            "review_score": "1"
        },
        {
            "review_text": "Part Fary Cry 4, part dying light.   So far, my only regret was not starting on easy mode. The game is hard. Or i suck. No, it is hard.  The game plays fine on my system (gtx 780 4gig, i4770k). Solid 60 frames with everything cranked up.  The only time the game hitches for me is when i complete a mission or get a new one. Even when it does, it is brief and doesn't affect gameplay.  Fun so far, it has my attention where doom does not.",
            "review_score": "1"
        },
        {
            "review_text": "GTX 970 and I7 4790 3.6GHz at High resolution runs great (80-100fps) only some bugs with the civilians while walking (not that many just like in Assassin's Creed Unity) ! The performance isn't that good but was something already expected by me... It's a good game for guerrilla tactics, and for testing your patience (don't try the hardened it's really hard)   10/10- shoot the drones it's the best part of it !",
            "review_score": "1"
        },
        {
            "review_text": "did anyone actually look at the system requirements? running all settings except aliasing maxed - no stuttering, game looks nice, runs nice, and is rather interesting so-far. maybe people just don't like the idea of the norks being in charge?",
            "review_score": "1"
        },
        {
            "review_text": "I was promised a virgin by 'DUMBster' Studios :(",
            "review_score": "-1"
        },
        {
            "review_text": "This is more matter of opinion especially ruling over the pros and cons. So far the game is amazing although I played the first one, this is definitely a step up. I personally don't have too much of a problem with this and would recommend it the second someone asks 'Jimmy. Should I buy this game' I'd say yes because gameplay with this game is amazing and with friends is definitely even more fun. This isn't a professional review but for the standard gamer like myself, this game is pretty well done in my personal opinion.",
            "review_score": "1"
        },
        {
            "review_text": "So I went into this game almost completely blind, my friend and I were looking for a game to play together and didn’t find anything until I found this game. We waited until this game came out and bought it on release. We were reading the comments about how optimization was poor and how it was slow and lagging and etc. We both have very good computers and both of us were able to successfully load the game. As with many newer games you may need a decent computer. The graphics are impressive, and neither him or me experienced major issues concerning it lagging. This game has a really promising multiplayer although the story fell a bit flat. The multiplayer, in my opinion, is the best part of the game and I loved it for the first four(ish) hours. The small amount of maps limits the playability of the game since there isn’t a lot of different ways to play each map. Let me just say that this is a really fun multiplayer game with some interesting missions. The problem is there are what six maps, maybe seven? Half are based on offense and the others are defensive. I already payed $60 for this game, why do I have to pay about $6 for more maps that probably are the same type of missions. A lot of people are complaining about the bad AI, I disagree. The AI is pretty good at spotting you (and killing you). We only encountered a dead body glitching through a wall. In the multiplayer the enemies aren't always positioned in the same space when you start, and I really enjoyed that added challenge.  What I really don't enjoy about multiplayer other than the limited maps and somewhat repetitive missions, is that ♥♥♥♥♥♥♥ lady on the coms. 'What's the hold up!' 'What's the hold up!' Oh, I don't know? Maybe the two tanks that just rolled in? Constantly annoying me when I don't speed through a level. She is the Navi of Homefront. This also brings up another point, the game doesn’t want you to stealth. The knife killing animations are awesome, like oh my God watching another player knife an unsuspecting soldier is cool. So naturally, we wanted to try to do missions in stealth. After trying to sneak, we realized something: this game doesn't want you to sneak. Sure the snipers are easy targets for your knife, but on the ground, where you are most of the time, you have limited stealth options. No sneak rolling/running or anything that's common in games that want to provide a stealth option. Well you may be asking, 'well Guy Fieri this game isn’t meant for stealth, it’s about guns!' To that I would reply with saying that the game wanted to provide a guerrilla style warfare that is common in American war history. A part of it is sneaking. Also, in your skill tree you can pick up several sneak related skills like not being seen as easily by enemies. Why give me that skill when I can't get a silencer until I buy x amount of crates (which I suggest focusing on getting weapons and armor before attachments) and as soon as I fire every single enemy in the entire universe knows exactly where I am? This limits the ways to play their small selection of maps. Also another problem, that i'm sure a little later won't be a problem, I can't seem to find any servers? There is a story, and admittedly I haven’t played a bunch, but what I have played is average. Unskippable, boring cutscenes giving me unwanted explanations of the situation are the first ten minutes of the game. Then*spoilers* the two people you are with die. Walker gets arrested, and you go to the main resistance in the area. They get mad at you when you fall into their well marked tunnel and start beating you up before asking for authentication? No, i’m sorry you are the worst tunnel keeper in history.*end spoiler.* Again this is just the beginning maybe it gets better later, there are better people to talk about the story than me. I do recommend this game though, like I said the multiplayer is fun. One thing I find very impressive is that for the multiplayer to feel fun you don’t need another friend. Your mic is always on which I think gives a realness to the game. After taking away the good graphics, there is a good game. The gun mechanics are good and I really like the skill tree and the way you obtain weapons and gear. I think what would make the multiplayer better is obviously adding more maps for free, but also opening up areas for mass multiplayer games like a team deathmatch and capture the flag. Also I wish that in multiplayer and the main story we were able to customize our character, and I don’t mean picking from a few female characters and a few male characters. Overall 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "At 100% lived up to expectations !!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is made out to be a terrible and worthless game. I do agree, the graphics and gameplay could be better but the story and atmosphere is excellent! This game is totally worth purchasing, although do not buy if you have Windows 8/8.1! The game will not work unless you have Windows 10. I recommend this game to a casual to moderate gamer. It is fun to play when you have some free-time or on the weekend. PLEASE IGNORE ALL OF THE NEGATIVE REVIEWS, most of them contain stupid and irrelevant information. This game does have its faults but overall is great!",
            "review_score": "1"
        },
        {
            "review_text": "such a good concept but such a bad game",
            "review_score": "-1"
        },
        {
            "review_text": "Had very high hopes. loved the last homefront. this game falls so short with its programing. Fallout 4 had less launch day bugs. first door i opened my hand went through it. unstable frame rate and i have the fury x. game looks horrible textures are bad. 0.4 hours into the game and im asking for a refund. DO NOT PURCHASE PLEASE.",
            "review_score": "-1"
        },
        {
            "review_text": "Note that at the time of this review I had only played the campaign and therefore this review will focus on that and no this will not have any spoliers in terms of actual story.  Pros: Good weapon customisation  Very good campaign in terms of detail and story  Runs reasonably well on my PC and only had a couple of drops during the campaign (I know that some people have had problems with fps drops)  The easy difficulty is not a I win option in terms of difficulty and still offers a good challenge.  The health system is very good and definitiely adds to the challenge of the game.  Mixed (Things that were good and bad)  Good overall background story although disappointed that it was changed from the story in the original Homefront but I understand why it happened.  Although free to explore in the zones, I thought it would be truely open world like GTA V and that it seems to feel linear even though you can take over strongholds etc.  The A.I aren't idiots but they are not exactly the sharpest tools in the box either.  Cons:  Last part of the game becomes linear and back to the original homefront and other FPS games  Use of the RC car is quite bad and can be troublesome on things such as stairs  Campaign is quite short but longer then the original. I completed this campaign in about 15 hours.  Overall rating: 63/100  Not going to win any awards but it is definitely better then the first Homefront. I would get it when it is on sale if you don't want to pay £40 for it.    ",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the worst shooter of 2016, and easily one of the worst shooters I've ever played. Right off the bat, I knew something was horribly, TERRIBLY wrong with this game. But, I guess that's just what I get for thinking that the sequel to the most mediocre game in history was actually going to be worth a damn.  For starters, the enemy AI is stupid beyond reason. Most of the time playing had them running into walls, shooting in the wrong direction, clipping through objects, or shooting one way while the bullets go another. I haven't seen AI this bad since RIde to Hell: Retribution. Frankly, though, this isn't much better than RTH, anyway.  The writing is some of the most incompetent ♥♥♥♥ I've ever witnessed. Every line of dialogue was cringe-worthy, every character a shell, every NPC an idiot. I thought Halo 5 had writing, but this is straight up incompetent on every level. The mission design is lazy, simple Point A - Point B run and gun shooting, taking buildings, 'talking' to NPC's, and after you claim a new stronghold, it immediately is decked out with American flags and sprawling with rebels. It's so jarring that I actually thought I was teleported to a different area of the map on several occassions. On one occassion, I had to take a stronghold with a Korean tank inside. The tank, out of nowhere, exploded, without any warning or reason whatsoever.  Kill me now. Please, put me out of my misery!  The multiplayer is an absolute joke. A series of co-op missions (of which encompass and grand total of TWO GAME MODES!) have you do the same exact things you were already doing in the campaign. The absurd nature of the plot does nothing to assist in the game's setting, the player customisation is an absolute joke, your body clips through objects incessantly, friendly NPC's clip through objects even more, and the freezes and stuttering in this game is ABYSMAL. I can run just about every modern game on Ultra and still pull off 45+ FPS (depending on how demanding the game is), so it's absolutely unnacceptable that this game, on MEDIUM SETTINGS, still freezes constantly. Movement is jerky and awkward, the gunplay is hit or miss, and half of the objectives in the game don't even work!  Seriously, no joke, at the beginning of the game, you have to set off a trap that includes explosive barrels. You have to simply press a button to detach the barrels and have them fall on the North Koreans and blow them up. One of the barrels (I couldn't make this ♥♥♥♥ up if I tried) actually got stuck, and it blew me up instead.  This is the ♥♥♥♥ing travesty of a game that this abortion of a company delivered.  I don't know why it happened, but Crytek apparently sold the rights to this game to some other developer I've never heard of, and it's clear that they have NO CLUE how to make a game. Do not play this. Do not rent it, do not purchase it, do not borrow it. It is the worst FPS I've played in years. This makes the last Homefront game look like a masterpiece. I actually enjoyed Major\\Minor, the dumbest game of all time, more than this game. Refund it if you were suckered into buying it.  ♥♥♥♥ this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Oh I'm sorry I thought this was a game about takin' back 'Merica from North Korean communist scum but turns out it's a game made to simulate, by way of bugs and horrid gameplay, the utter hopelessness and despair of life in a North Korean death camp.  10/10 would get tortured by shoddy game design again",
            "review_score": "1"
        },
        {
            "review_text": "I dont understand why people hate this game so much, for me it's something worth trying AI sucks but overall gameplay is good :)",
            "review_score": "1"
        },
        {
            "review_text": "Its a diamond in the rough, if and I can't stress this enough 'if' the developers are commited to bug fixes and post launch optimization it will be able to claim a place as an 7.8/10 game. The game itself is good and you will enjoy the time spent while playing, it is just mared by either gameplay bugs or graphical artifacts that distract you from what is basically  'Skyrim with guns' in america  Pros: - Gun Custimization feels fluid and allows quick adaptation. - Graphics look good with well defined styles for each area - Well designed world layout - Multiplayer is a fun co-op experience if you have friends to play it with, think Mass Effect or Dragon Age Inquisition.  Cons: - Bugs aplenty - Voice acting is similar to most other Deep Silver games, decent but not great - Story is very short in terms of how much time you actually spend doing the missions - Unskippable Cutscenes",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Poor optimization on pc, graphicall and technical bugs from the very first moment. High, medium, low settings - does not metter - game lagging. I could finish my first battle - was killed because the game lagging. When I start to play I found that this game looks similar to Metro, Stalker...  Going to return. Don't need this.",
            "review_score": "-1"
        },
        {
            "review_text": "ill say it right now: they had a line to reach, and they missed it. not by much though.  pros: guns sound and handle well (by sound i mean reasonably realistic) graphically pleasing- there is a con ill talk about later fairly large map funny AI- another con ill talk about the co op mode is fun af, specially when you realise that you can kill yourself and your mates with one well timed bike dismount you can make a co op squad of old people (female and male) and kick ♥♥♥. Norks minimal gameplay bugs- bar the AI ones. yet to see any micros- remember reading about them being in game but seem to have disappeared.  cons: optimisation is needed hardcore. AI, both friendly and enemy, can go full potato- stuck on random objects, block doors, teleport, randomly spawn/despawn infront of you etc hoping for more co op content. even main story co op (maybe) very minimal realism in death (guess they didnt want to up the rating)  would i recommend this game? not at full price. worthy of a steam sale purchase.  season pass is up to you, id recommend just getting the bundle- ON SALE.",
            "review_score": "1"
        },
        {
            "review_text": "Almost 11 hours worth of story and I thoroughly enjoyed it. It played a lot like what little of the Assassin's Creed series I've played in regard to the capturing strikepoints and controlling more of each zone, while the rest of the game feels like Dying Light with less parkour.",
            "review_score": "1"
        },
        {
            "review_text": "  Homefront bad.",
            "review_score": "-1"
        },
        {
            "review_text": "lots of bugs",
            "review_score": "-1"
        },
        {
            "review_text": "This is a really fun game single player and multiplayer, I just love it, I dont mind the graphics, bugs, glitch cause for me this is a really good game cause its still new and the gameplay are fun",
            "review_score": "1"
        },
        {
            "review_text": "The game is a lot of fun, despite some issues with bugs and glitches here and there. Once they have been patched, I reckon it will be an extremely solid, fun semi-open world shooter.   The story is patchy, and pretty bland, but it's passable for a shooter.",
            "review_score": "1"
        },
        {
            "review_text": "Poor man's Far Cry.",
            "review_score": "-1"
        },
        {
            "review_text": "Well I rarely write Reviews but since we apparently have found the whiners with the release of this title I figured I'd contribute! So this review goes out to the True gamers who have a custom Rig!   I haven't had any lag issues @ max settings on this game. No mystic black blocks appearing as someone mentioned. Audio is perfectly sync'd with mouth movements. Haven't tried online side yet as I like doing story first generally. A Glance @ my PC: Asus Crosshair V Formula-Z  AMD FX-9590  EVGA GTX 980 Ti Classified 32gb Corsair Vengeance Creative Recon3D audio 256gb Samsung 850 Evo SSD 3Tb WD Black 'Game is installed on this drive'",
            "review_score": "1"
        },
        {
            "review_text": "Well I feel I must explain, there is alot of bad reviews and mixed reviews on this game, but it isn't from the gameplay it all has to do with the optimization, This is what I have to say ' The game looks beautiful, voice acting is awesome, cutscenes are awesome, having the option of going stealth or guns a blazin is a nice touch. I have played just over 2 hours now and I can see that it might get a little repetitive but what quest based rpg's don't at some point. I think the bike is a little hard to drive with mouse and keyboard, but pirfect with controler, there is a lot of moments that make you feel like a bad ♥♥♥, so I would rate this (10/10 would kill NORKS again), lol no I would give it an 8/10 though. Keep in mind this is a mostly single player experience, and has co-op play as well but I haven't tried that out, there is no competitive mp. as far as performance goes,   Specs:  i7 4790k OC 4.7GHZ 16gb ddr3 ram 1600mhz GTX 780 reference card Stock clock  I have all settings on very high except texture quality is at High, anti aliasing is off, and anisotropic filtering is at x8, runing 1080p of course, and super sampling is disabled as well, and I am getting 60 fps out of combat and about 45 in combat. It plays smooth and only have a couple of frame drops when switching between scenes that dip to like 15 fps for a breif second. So I don't know how everyone else with 980 ti's are experiencing worse fps than me. but great experience for me. also guys remember it just came out so it will take a little time to be optimized better but I have hope but for me runs great.",
            "review_score": "1"
        },
        {
            "review_text": "In my personal opinion this game is horrible...It feels like its trying to be like metro last light and dying light... the gameplay dosent feel right, Im runinng two gtx970s and i74790k cpu so i get 60 fps at 1080 no problems but when you look at the characters you can see that there feet arent touching the ground, they walk like there two different body sets like the top half and bottom half.... I will say you wanna see something really funny and wierd just look and the faces of everybody and how the expressions change and glitch just ahhh man this game is so bad",
            "review_score": "-1"
        },
        {
            "review_text": "The Game is Bugged bad can't even get passed the first mission you jump on the van go to jump through the window and you cant it is like you get stuck in the wall such a huge disapointment.",
            "review_score": "-1"
        },
        {
            "review_text": "This game makes me want to join Korea and kill this nation.   -11/10  First one was better.  Gonna KMS after this gg no re",
            "review_score": "-1"
        },
        {
            "review_text": "Looks like Watch_Dogs in first person so really great &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR This is an OK game. You would think that mixing Crysis2 and Farcry3/4 would give you something stellar, but the game is held back by technical aspects. I am think that if the game gets some patch love this game would be worth 60 bucks. At launch though its worth 40 bucks IMO. 15 hours if joe blow plays, maybe 25 if you 100%. No NG+. Farcry3/4 with a 'face lift' and no fetch quests.  I have two 780's, this game doesn't run SLI. This seems to be par for the course however, SLI support has sucked for the past year. I have to run this game at low settings to get this to run at 60fps on my 2560x1080 monitor. This game runs like cold molasses, uphill, in january, on pluto. When I did have my settings jack way up the game did look fairly nice, but it seems like you need a 9xx or R9 3xx card in order to play it like that. There was also quite a bit of popin when I was playing, I'd like to say thats due to my low settings, but this being a console port leaves me wondering.  I have heard that there are a number of glitches, I encountered maybe 2 that required a 'restart from checkpoint' both were doors not opening. All the other glitches I saw were few and far inbetween, and also resulted in a chuckle. Nothing game breaking was encountered but buyer beware, others have had issues.   'Trigger warning: I played ♥♥♥♥♥♥♥♥ easy mode' Gunplay is fairly diverse and enjoyable. There is a usable cover fire system, but it only allows fire from chest high walls, no corner shooting. I found myself switching between the whole selection of guns though my game. Though there are only 6 guns, they have 3 modes. Meaning you are always equiped for any situation. Some modes are worth more than others however, battle rifle outclasses the sniper, auto/pump shotties are better than blunderbuss, etc. I found myself using all of them at least once however. The upgrade system leaves something to be desired however. After beating the game I had only upgraded 6 of my 18 guns. This can be done if you play this game like a Just Cause achievement hunter, but joe blow will likely upgrade the 4 modes he likes the most and get the the end before other upgrades happen. Gun attachments feel like crysis, so theres that. Also, not taking guns from the baddies.  Stealth. Its in the game? Don't get seen, use suppressor(pistol only)/crossbow, get lucky and kill the guy shooting at you without tripping the alarm, hide like its asscreed. The game tries to come down like a ton of bricks if you are seen, but the generous hiding spots negate this quickly. Honestly if you want Stealth play the riddick games. This has servicable stealth.   I got into multiplayer once, it seems to be CO-OP only and my game musta had a 700 ping. Good concept though, lets hope there are players for lobbies, as you need 2 to start.  Over all, ignoring my having to play at low settings its a good game. 60 bucks? ehhhh, if you and a few buddies like to play online sure. Campaign is 30-40 bucks, none of the characters are noteworthy or memorable. The worst one does kill themself so thats a plus, even if it is in the name of freedom.",
            "review_score": "1"
        },
        {
            "review_text": "Got trapped in a corner by npc women, calls me an ♥♥♥♥♥♥♥, real life simulator",
            "review_score": "1"
        },
        {
            "review_text": "I came into this thinking it was going to be bad...   instead now I can honestly say I enjoyed the few hours on it so far. Varied , plenty to do, the format reminds me of UBI games like fary cry and ♥♥♥ creed,  side missions and pinned jobs like bounties.  the general character, movement and weapon choices and the 'crysis style' weapon mod 'x' is cool turning a battle rifle from a sniper rifle into a rocket launcher  its a pity there is no multiplayer, but it does have coop.",
            "review_score": "1"
        },
        {
            "review_text": "Most of the early comments being so negative were unjustified, dont know what happened there. There have been ALOT of games that came out in a much worse state that didnt receive this kind of flak.  That being said, it does need some polish, there are technical imperfections and all that.  But they havent really bothered me in the slightest, im actually enjoying the open world vibe alot ! The shooting is nice, it looks great, the vibe of revolution is there and i just like how the kpa guys look and their high tech stuff feels like a threat.  UPDATE: the patch adresses non issues for me, i notice the slight stutter but i only experience them at the shops. I would much rather see some stronghold fixes, two of them are bugged out in my game and cannot be captured.  The AI issues people have spammed the discussion boards with are out of proportion, yes, there is silly behaviour... propaganda trucks trying to drive up a trashpile into a wall etc, but in al honesty i have not seen this alot. Maybe it doesnt catch my attention like it did in fallout 3 and 4.  Also, i am enjoying this game quite alot, the score it received is absolute nonsense. It should be around 75 imo (still not finished with it). Theres alot more to do and atmosphere than most triple A shooters, it even runs WAY (WAAAAAAAAAAAAAYYYY) better for me on high/highest settings than far cry 4 which i had to run on medium settings to be able to shoot something.",
            "review_score": "1"
        },
        {
            "review_text": "Having played the first Homefront on PC, I had to get this one before its launch. I must say the open world game play is amazing you can recruit resistant fighters to fight with you in the battle to reclaim the fallen America from the clutches of the Korean Agressors. weapons can customised to your fighting needs. Taking over strongholds would help the resistant side immensly in the war for Aamerica. This is one action packed game you must own. It is very addictive and cutting edge. The first game was more story driven whereas this game focuses more on the open world fighting aspect.  I still have a fair way to go with this game. If you love taking down the oppressor, But love Samsung phones. This is the game to get.  The scary reality is that the North Korean war could happen in the distant future. What you see in the news today is a scary reality. It could happen to us in real life.  We must stand up for what we believe in and to always KEEP ON FIGHTING.   10/10 MUST HAVE ON PC.",
            "review_score": "1"
        },
        {
            "review_text": "Don't get why people keep destroying games that's come out after milions problem while in develop. Wtf did you expect?  Anyway, the game is funny, it's not CoD style 'go in kill everything' you will be forced to destroy something important than RUN AWAY before something bigger come to kick your rebel ♥♥♥. That's how revolution work.  It has tech problems, however i'm having fun while playing it.   Search some cd keys around and it will be worth the price  ",
            "review_score": "1"
        },
        {
            "review_text": "It's ♥♥♥♥! The story, the gameplay, the shooting, the looting, the trading and the A.I.",
            "review_score": "-1"
        },
        {
            "review_text": "It's cool...graphics may be a litte bit outdated but overall it is fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game, much more enjoyable then the 1st game.  The game does use Denuvo though so not recommended  1.5/10",
            "review_score": "-1"
        },
        {
            "review_text": "So after playing the game for a bit I have to admit i actuely really enjoy it. i have a mid tier gaming pc and i can run the game at high settings getting a constent 60 fps. The graphics are also stunning. make sure you download the drivers and your all set. i look forward to playing more!",
            "review_score": "1"
        },
        {
            "review_text": "Have to say playing it for 10 hours it;s not that Bad what thoes Trolls make it out to be, Yes the fram rate is not that great But who cares its a fun game . Great Job DEPP SILVER",
            "review_score": "1"
        },
        {
            "review_text": "I cant play this dumb game because the whole screen is black i just fixed the black screen and i am editing this the review.But now it is laggy now after the black screen went away and the whole game overall is not good right now i hope they have an update to help with the fps problem :).",
            "review_score": "-1"
        },
        {
            "review_text": "Housefart the raviloi is a game where America skips rent on the Korean ipads so Korea moves into America and people with blue clothes on fight for their right to party. Then kevin spacey is a bad guy and the automatic paper airplanes die at the end when you DDOS them and you have to choose to save your son or nuke Boston.",
            "review_score": "1"
        },
        {
            "review_text": "This is exactly what Homefront should've been, however there are some weird stuff with the game  - Playing the game on Recruit difficulty is still a challenge, I don't get it that you die so easily - North Koreans depicited here are weird looking almost cyborgs like - On the PC version the frame rate drops aren't constant, while on the consoles the game runs at 15-30 fps - There just isn't so much stuff to do and the game becomes abit of a chore rather than fun  But still it's worth to checkout if you like alternate history games :)  It's a 6/10 for me, could've been better if they'd let it be in development more time :(",
            "review_score": "1"
        },
        {
            "review_text": "WTF The game!!! I don't buy next new The Dambuster Studios Game.",
            "review_score": "-1"
        },
        {
            "review_text": "For a new studio to develop this game and with such a small team I have to say it is very impressive what they achieved. As for the game itself I really liked it I know critics are giving it bad reviews I would say most of them have never played the game and just judging it based on what they see. Yes there are a lot saying fps dips and what not but remember this game is running on Cryengine 5, the new Crytek engine. Remember in 2007 when Crysis launched? Most computers could barely run it I would say the same thing here the engine is to advanced for what current hardware is capable of doing that most people would have. Their would be few exceptions those who run triple or quad CrossFire/SLI, but most people probably. Run a single gpu or duo gpu's is it a good story that is something I feel yes and no the idea of the whole series is great. Story could have been maybe another hour or two but I would not knock, a star off for it because it is an open world game and if I wanted the story element and not an open world I would not have bought it. Visually this game is very impressive minor details are there that lack in other AAA games now a days but. Used in exist back when the cod series was becoming popular before it became a yearly cash grab release franchise. As for recomending this game I would say yes because I think if Deep Silver, had a bigger budgement in the next series then I think they could defintely make a better game and spend time working out a really intriguing story. Their is even mention about what happened to Koas Studios, and this franchise changing hands to Crytek, then being sold to Deep Silver. That is something I did not expect since most developers for games if they change studios there is no mention about that anywhere in the game itself.",
            "review_score": "1"
        },
        {
            "review_text": "  When you play this game,you'll instanly unlock a secret steam Achievement:'Worst Game In History!'",
            "review_score": "-1"
        },
        {
            "review_text": "Dont understand while its getting all this hate i dont really care bcuase all i spent on this game was half a ham sandwitch",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing idiots after last pach black screen only !!!",
            "review_score": "-1"
        },
        {
            "review_text": "The game has a very limited multiplayer, only the 12 coop missions. I can only compare them to mw2's spec ops, they are short and for me personally have little to no replayability. 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Highly recommend this game. It has some flaws but can be fixable in the future updates. The game makes you feel like you are an actual american taliban fighting against the north koreans, out numbered, outgunned and hopeless. This game is a 9.5/10 for me. I would recommend buying it. And the visuals are really good too.",
            "review_score": "1"
        },
        {
            "review_text": "Could have been a good game, but at very best a meh",
            "review_score": "1"
        },
        {
            "review_text": "I have a 970, amd 8370 and 16 gigs of ram and I'm getting 60 frames steady don't listen to the negs the game is pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "So i got it played if for maby two hours and returnd it. if it was $20 i would buy it but it felt like a bate.",
            "review_score": "-1"
        },
        {
            "review_text": "19hrs ingame and i finally manage to jump off a bridge to kill myself , just wanted to forget why i bought this game at full price in the first place. As i got to the bridge i see everyone is waiting in line for the same ♥♥♥♥ing reason and it took me 19hrs for it to be my turn.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ this",
            "review_score": "-1"
        },
        {
            "review_text": "It's ok     (Update) Beat the game 7.5/10 Assassin's Creed 2 part 2 - If you beat AC2 you know what I mean...          Actual review  This game is critized due to its predecessor, which is why people who cant access or own the game give so many dislikes to this game. Running this game on an Alienware X51 R2 the graphics were set on high and the game still had shading errors and 'head loss' for random characters. After changing the setings to medium or low this shoud be resolved. Gamplay wise, everything can be killed with bullets, shooting at the back of an armoured car blows with up with 1 mag. The A.I sucks the rarely runs for cover (and or) charges straight into battle, they stand and shoot. The storyline is interesting, but in 2 hours I have made little effort to pursue it, due to the fact that there is no connection between the characters and little to no interaction with you. I dont enjoy the game saves my progress, but im sure I will get used to it.  Putting all that aside, the gun modification is 'Revolutionary' (compared to fallout) considering I can turn a pistol into a Uzi. The 'sleath mechanic' is in working order, I personally love sneaking behind Norks and preforming a takedown rather than a gunfight. As for cover, peaking all work well for stealth, as blindfire keeps you in the game in firefights, aslo gotta love the Day/Night cycle. There is a slight desire to save Walker but, what is FAR more ineresting is the massive map, far larger that skyrim(with guns). It will take hours/days to explore the whole thing. The Districts are divided by color, red, yellow, and green. Each of these districts will determine if you get into a massive firefight or if you can walk to your destination. I found that being able to form a 'Strike Squad' by recruiting rebel A.I.s is a feature I have not seen since Assassin's Creed Brotherhood. I imagine as I progress in the story more and attempt the multiplayer/co-op you will start to feel like a 'Revolutionary.'   As the game sits now, its buggy, but not unplayable, the people in the USA will deal with it for 3 days while the Devs work on a patch in time for the May 20 release. Its problems from the first game can be overlooked by this new addition into a plagued series.  If I had to rate it as it is now... 7/10 - would recommend",
            "review_score": "1"
        },
        {
            "review_text": "Just like far cry but in an urban area. nice visuals too",
            "review_score": "1"
        },
        {
            "review_text": "A bit cheesy and dodgy here and there but performance is solid, it looks fantastic and the gameplay is fun.  The DLC is good but awfully short at about 3h a piece, so unless you bought the season pass on sale don't bother.",
            "review_score": "1"
        },
        {
            "review_text": "The new patch runs fine.  The game isn't hard but it is a fine Far Cry-ish shooter. After an overlong opening, you are let loose in a big shooty Far Cry meets Stalker style map and tasked with going to all the icons, shooting people there, and turning red stuff blue. All while collecting more stuff for upgrades.  So basically, Far Cry. Only with some great graphics... so still Far Cry. The AI is pretty weak... so STILL Far Cry. But at least it doesn't require Uplay.",
            "review_score": "1"
        },
        {
            "review_text": "played it for a few hours and gave up, crashes every 20 minutes very annoying, the gameplay is ok the story ok, not worth the price by a million miles, overall i can't recomend it",
            "review_score": "-1"
        },
        {
            "review_text": "GREAT GAME, first of all i have waited a few months now for the patches to kick in! but man the wait was totally worth it.i've heard of the game's glitches and bugs,etc... but at this state i can asure you it is amazingly fine and well balanced,the fps is also balanced no more game crashing bugs,the overall experience was worth it. HF:TR has everything a open world game need and it really lives upto the 'open world' genre,a decent story with bunch of decent characters like moon jesus she's crazy, however there were some cons to it like the weapon customization was very limited i mean VERY limited for each weapon and there was nothing exept kust bikes wich were all the same! jesus,u could at least add more variety to bikes right?! no color customization for anything not guns nor bikes,but the pros are more than the cons and beside the stuff i said, i really had a fun experience throught the game though i havnt yet finished it. i vote 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "  Finished the single player during the free weekend, which for all the claims of being 'fixed' still suffered from several serious technical issues such as:  *Horrendous mouse input lag (200+ms) until I turned off supersampling (despite flawless frame rate thanks to my 1080GTX) *various GUI errors, keyboard prompts being replaced with joypad ones for no apparent reason for the duration of a mission *hard crash between missions that caused save corruption (clicking resume at the main menu after restarting the game did nothing, had to manually reload the previous autosave to continue)  Still, while the single player was mediocre at best at least I got through it.   Co-op on the other hand is completely broken right now. Cannot join a single game, so there is no reason to buy it after the free weekend ends.",
            "review_score": "-1"
        },
        {
            "review_text": "Now, i enjoy playing this game, but its filled with bugs. I enjoy the combat, the takedown animations and the gurilla style warfare. But damn, so many flaws. There are points in this game, where you think 'What the **** is going on?'. It can be from the AI bugging out, not spotting you, the fact that you are the only one required to wear a gasmask at a certain point and so on.... Logic has been thrown out the window completly with this game. But still, i enjoy the game. Even though its rage inducing. I dont recommend buying it!",
            "review_score": "-1"
        },
        {
            "review_text": "  I downloaded and started playing Friday night, Septemeber 9th, 2016. It took several minutes to find a full party of 4. I have a strong internet connection (V.Fios), which meant nobody was online. I played online for about 4 hours with the same 3 guys.  Saturday, Septemeber 10th, I played the campaign. They throw you right in the middle of the action but fail to make me care about the frequent and tedious cutscenes.  This played very similarly to Far Cry and Dishonored with elements of Assassin's Creed and Fallout 4. I did not notice a single unique feature in this game that wasn't borrowed from another popular game. Because of these, and the lackluster storyline, I was disappointed with how familiar it felt.  tl;dr Don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "  --- TL;DR SUMMARY--- PROS: - Nice open world design - Good graphics - Variety of guns - Good ideas for a game...  CONS: - ...Good ideas that go poorly executed. - Mute player character - Flat characters and near meaningless interaction - Story that doesn't deliver. - 4 hours in, and i'm too bored to continue.  ---Prerequisite system info--- I'm playing on a 980ti at 2560x1440 with everything (including temporal AA) maxed and I'm averaging 85fps with adaptive gsync. It's steady and I have no real issues with the performance. Great job devs.  ----DAY 01--- I like the graphics and sound. The game has a good atmosphere, especially at night time. The guns are servicable. As others have commented, they do lack punch. Gameplay is a little repetitive, but the action is solid so its not that bad. Overall, for my first two hours I would say that the game is stable, fast and enjoyable. I just hope the gameplay opens up a little bit and expands on what you do as the player, because after taking over all the areas of the starting zone, you realize how large the map is and wonder if the gameplay will be repetitive throughout that whole experience. We'll see! Recommended.  ---DAY 02--- I've returned to the game and it's obvious there are some possible issues. First, the game is constantly streaming data. This makes sense given the open world nature, however I would go so far as to say this is borderline trashing the hard drive. The data streaming never really interferes with the gameplay, but it does result in some texture and geometry popin. Given that I'm on a fairly powerful rig and using a 6TB WD Black, the amount of IO needed to sustain the world is somewhat surprising. Suggest that you run this one from SSD or NVME if you can spare the 40 (!) TB.  As far as the game itself, I have to admit the world is starting to feel kind of flat after only 3-4 hours in. There is an abundance of good (mostly) VO work to help things along, but the mute player protagonist just seens to have nothing to say in a world so full of things to comment on. The missions and orders you receive all start to sound the same. After capturing the entirety of the first section of the map, I felt that there just wouldn't be much else to do. Its like Farcry, only less open and more modern. Maybe the most damning part of it all is that after roughly 4 hours, i'm just too bored to continue playing. There are not enough mechanics or story hooks to keep me going. It's just one mission after the next. Shame, this game has good ideas for what it wants to be, it just fails to execute them into something that is compelling to play.",
            "review_score": "-1"
        },
        {
            "review_text": "Now, i enjoy playing this game, but its filled with bugs. I enjoy the combat, the takedown animations and the gurilla style warfare. But damn, so many flaws. There are points in this game, where you think 'What the **** is going on?'. It can be from the AI bugging out, not spotting you, the fact that you are the only one required to wear a gasmask at a certain point and so on.... Logic has been thrown out the window completly with this game. But still, i enjoy the game. Even though its rage inducing. I dont recommend buying it!",
            "review_score": "-1"
        },
        {
            "review_text": "  I got this game on the free weekend (sept 2016) and it was a BLAST!   Steam's review system should document if the reviewer's system meets specs and has up to date drivers (or at least if the reviewer claims they do), because I think a lot of people grabbed a free game hoping it'd run on a sub-spec system and they lashed out at the game when it didn't. Why else would someone make a complaint that isn't even legit... 'too few guns?' It has at least pistol, pnematic pistol, smg, crossbow, blunderbuss, AR, battle rifle, LMG, shotgun, limpet gun, and RPG. Add to that 4 types of thrown weapons (incendiary, explosive, hack tool, distractor) each with 4 subtypes, total 16. Plus knife, bolt cutters, flashlight...  With the difficulty on recruit mode it was non-stop action. I'm sure more stealth is needed at higher diffuculties. Free-running though controlled zones looking for targets of opportunity like equipment sabotage targets and lone soldiers to silent-takedown... jumping from scaffolding to rooftops and through upper floor windows, looting valuables... frantically looking for a dumpster or portapotty to hide in... what's not to love? It's like Mirror's Edge meets Far Cry. Plenty of side missions can be done in any order or ignored as you like. It took 16 hours for the main mission and about half the side missions, none of the job missions, and very few of the flash missions (optional missions that appear without warning).  I love the game's moral choices... imagine you are an operative in an occupied zone on an important mission and you get an opportunity to save some civilians getting a beatdown from bully occupiers, but only by blowing your cover. Take the chance or sacrifice them... clock's ticking! Will you use remote explosives blindly with the possibility an innocent will walk by them?  The characters are well fleshed out. Dana's a complete psychopath, the doc has his own priorities, reasonable characters all have different outlooks on the occupation, the NPC chatter is diverse and on topic, and I didn't see the game re-use any faces for different people, very well done. The graphics are amazing - at one point while hiding behind a dirty old dumpster next to a chain fence with ivy growing on it I felt like I was looking at a real photo.  I had 2 crashes to desktop during the my entire 16 hour campaign. Core i7, 16gb, GTX970.",
            "review_score": "1"
        },
        {
            "review_text": "  Alright so, let me give full disclosure to start, I played this game in the free weekend that Steam offered on the 9th-11th September.   First of all, there were things to enjoy about this game. The gameplay wasn’t too bad - Far-Cry esque in an occupied city where the underground revolution (you) has to take down the occupants he can, destroy their equipment and earn his freedom. It was almost Terminator 2 like, popping out of a ruined building to lob a pipe-bomb at a passing mech and quickly get back down to snipe a few soldiers advancing towards you.  The exploration, taking over districts by doing a variety of different tasks (Strike Points through hacking, killing soldiers stationed there, finding HAM radios, etc.), helping civilians there, and a number of collectables (radios, propaganda speakers, fuel storage tanks) - all of this was fairly enjoyable. I like open world gameplay where you start off outnumbered and hopeless and become the main force by the end of the game - standard linear progression yes, but it makes for a fun experience of being the hero.  The story is an interesting concept. North Koreans started up the tech giants, Americans flooded to buy their gear (computers, tablets, phones, and even military equipment) only for it all to have a backdoor allowing NK to easily invade. The large zeppelin airships that watch over cities, looking out for trouble with their spotlights which you have to avoid (or be faced with endless soldiers until you get to safety/hide somewhere), patrolling armoured vehicles and mechs, it was all pretty cool and eerie.  Graphically, this game looks pretty good. Textures are nice, effects are pretty good, once you get into an area that’s been gassed you get to see all the particle effects of toxins in the air and all the dust from the dilapidated factories and structures that are in the area.  Though of course, this is a negative rating I’m giving. And it’s probably expected. The performance.  The performance can be pretty abysmal at times - even on a pretty good machine (i7-6700k, GTX 980ti, 16GB RAM). It started off alright, but frame drops can be frequent (be warned, CLOSE ALL BACKGROUND PROGRAMS. I had YouTube open on my other monitor to watch some stuff whilst I took over districts and my framerate tanked hard - dropping to unplayable rates and stuttering every 10-20 seconds sometimes). It gets worse the longer you play - I recommend restarting the game now and then whilst you play so it doesn’t tank as hard.  The game also gets glitches. One strikepoint was unavailable to me (chop shop) and it appears to be a common occurrence according to the Internet. I had to download a trainer to allow me to float upwards (cheat my way basically) up and through the side of the building as the garage door refused to open once the generator was running. I also spawned once in a mission with no resistance soldiers with me - facing a few dozen NK soldiers, the game then gave me a game over screen as my “resistance soldiers had died” when they never even spawned in game. Achievements are also pretty glitched. They stop tracking when you play, so there are quite a few I am missing which I clearly achieved (I liberated all Strike Points, free’d every district yet apparently I barely got over half of them according to the Steam achievement tracker. Several other ones didn’t unlock either).  If this game got fixed - polished up a bit with the performance optimised and the glitches buffed out I’d buy this game no problem. It seems alright - it’s not too long but it’s long enough and doesn’t outstay it’s welcome at all and is what you’d want out of this style of game. Too long and it drags on. The devs seem pretty honest people, with the credits opening with some story about the development problems that plagued this game, and even after all the disasters post-launch they are doing things to progress it a bit at least. Time will tell, if the problems do get fixed then this will change into a positive review for sure.",
            "review_score": "-1"
        },
        {
            "review_text": "so far no bugs and a ton of fun to play",
            "review_score": "1"
        },
        {
            "review_text": "Homefront: The Revolution was a lot of fun. The playstyle was what I was expecting and the game has entertained me to this point. There are bugs here and there, but nothing that will break the game. It looks visually pleasing and plays smooth during all points of the game. Simple fun that is totally worth the SALE price.",
            "review_score": "1"
        },
        {
            "review_text": "Uninspired gameplay and graphics that are on-par with other titles but don't stand out hamper my enjoyment Homefront: The Revolution. Unfortunately, it doesn't compensate by capitalizing on its somewhat novel story: America is now subject to rule by North Korea, and you are part of an insurgency fighting them. The game tries to pass off what you're doing and people's suffering, but just fails. I never felt involved with the characters. Attempts to portray Americans in the ghettos as oppressed fell flat, just the developers trying to inject emotion. The worst were the constant radio updates from resistance members that sounded just so chipper to go out scouting when they're supposed to be pariahs suffering at the hands of this dictatorship. Ugh, just the worst.",
            "review_score": "-1"
        },
        {
            "review_text": "They finally fixed some issues.  still, the game is noat as good as expected.",
            "review_score": "1"
        },
        {
            "review_text": "At first glance, this game holds a lot of promise... looks like it will be heaps of fun for people who enjoyed the Far Cry franchise. Sadly, it completely fails to live up to expectations...  1. There are a heap of clipping problems. Enemies see you through walls. In some places, enemies walk through walls. Things and people sink into floors. Some items you need to gather are unreachable because the buggy clipping stops them from falling into your reach. 2. Weird AI. Its like it was engineered to be annoying. You know those enemies that somehow miraculously know to duck when you target them with your sniper rifle? And then jump out of cover if you turn your back on them - when you're completely behind cover and they can't possibly see that you've turned your back. After a couple of hours, I started to use this technique to draw enemies out of cover. Its kind of funny making enemies dance by pointing a sniper rifle at them - watching them lurch from side to side to avoid the sniper's line of fire. 3. Scripting glitches. Some of the missions become impossible to complete because of some lazy scripting on the part of the programmers. 4. Infinite enemies. I've always been challenged by whether a game should have reasonable 'reinforcements' mechanics - but in this game, well... its just more lazy coding. Enemies randomly spawn infinitely. The programmers tried to cut some code so that enemies don't spawn where you're looking - but they screwed that up too.  After many hours of persisting in the hopes that things would get better, I'm abandoning it.",
            "review_score": "-1"
        },
        {
            "review_text": "Game was not worth when it initially came out. Now they patched a lot of the issues.  Gameplay is a bit repetitive, but has that Far Cry feel to it.   TL;DR Good terrorist simulator.",
            "review_score": "1"
        }
    ]
}