{
    "app_id": 223430,
    "name": "Miner Wars 2081",
    "release_date": "2012-11-28",
    "developer": [
        "Keen Software House"
    ],
    "publisher": [
        "Keen Software House"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Captions available",
        "Partial Controller Support",
        "Stats"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie",
        "RPG",
        "Simulation"
    ],
    "tags": [
        "Action",
        "RPG",
        "Adventure"
    ],
    "achievements": 12,
    "positive_ratings": 110,
    "negative_ratings": 212,
    "price": 3.99,
    "description": "Operate an advanced mining ship in a fully destructible and open-world environment!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/223430/header.jpg?t=1447843660",
    "minimum_requirements": "OS:Microsoft Windows XP, Vista, 7 Processor:CPU: 2.0 GHz Memory:1 GB RAM Graphics:NVidia GeForce 6 series or better, ATI Radeon R520 (X1300-X1950) or better, Intel GMA X3000 or better. Requires at least Pixel-Shader 3.0.  DirectX®:9.0c Hard Drive:3 GB HD space Sound:DirectX 9.0c Compatible Other Requirements:Broadband Internet connection",
    "recommended_requirements": "OS:Microsoft Windows 7 Processor:CPU: 2.5 GHz Memory:2 GB RAM Graphics:NVidia GeForce GTX 460 or better Hard Drive:3 GB HD space Sound:DirectX 9.0c Compatible Other Requirements:Broadband Internet connection",
    "reviews": [
        {
            "review_text": "Miner Wars 2081 promises epic space battles, but instead gives you a frustrating game of resource micro-management. Every amenity on your ship - from ammunition to oxygen to fuel - is limited, and runs out rather quickly. Even if the vast, bland environments were actually worth looking around, the game simply wouldn't allow you any exploration due to your limited resources. When you finally actually do get to fighting, the balance is atrocious, with some enemies barely leaving a scratch on your hull, while others in the same area annihilate you as soon as you get in range.  I was hoping for a spiritual successor to the Descent/Freespace series, as those remain among my favorites of all time, but sadly this is nowhere near pulling it off. Stay far, far away.",
            "review_score": "-1"
        },
        {
            "review_text": "Miner Wars is a shoddy, half-done mess whose developer realised at some point in development that they couldn't deliver on any of their promises, and rather than doing right by their community, decided to cut and run by shoehorning in a half-baked story campaign and calling it a finished product. That they still dare to refer to it as open-world is a farce. Avoid, and be wary of the developer's other products.",
            "review_score": "-1"
        },
        {
            "review_text": "A waste of money. Apparently early alpha = full game now. The most likely scenario would be that the creators all died from a lack of oxygen from being too stupid to breathe and thus, this garbage made it here.     May GabeN have mercy upon thee, for we will not.",
            "review_score": "-1"
        },
        {
            "review_text": "dont buy this pile of shii no updates no patches no refunds and all promises broken wish i could poke there lying eyes out",
            "review_score": "-1"
        },
        {
            "review_text": "Good idea, poorly executed. There is alot of idea thrown together but without a tutorial. I really want to like this game but it just seem like a waste of time I could be playing better games.",
            "review_score": "-1"
        },
        {
            "review_text": "Look, Simply I just can't recommend, I just can't. They wanted to do alot, but it just did not get off the ground, something happened. Wether it was selfish greed, or a breakdown in some area of there company or finances I do not know.  What I do know is that this games development has come to a standstill, I don't believe it will every be put on track to deliver what they stated they intended to make. Sad but true.  I do feel it is a blemish on KSH but Im not quite ready to drop them entirely, I do enjoy space engineers, and they have done better by that game and it's community. But not enough to support this game.  Sorry KSH.",
            "review_score": "-1"
        },
        {
            "review_text": "This game, well how should I explain it. The gentle way, or the rough way. Why not both. Gentle way, this game is just not fit for steam. It lacks components in all ways. Rough way, THIS GAME SUCKS AND SHOULD OF NEVER BEEN MADE. SCREW THIS GAME. WITH SCREWS AND A DRILL. DRILL THE SCREWS INTO THIS GAME, IF THAT IS EVEN POSSIBLE.",
            "review_score": "-1"
        },
        {
            "review_text": "The purchase was all on promises which were never delivered. The only purchase I've ever regretted, especially at $25.",
            "review_score": "-1"
        },
        {
            "review_text": "Many good ideas, but poorly implemented. Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "This review is long overdue for a game I consider to be worth the $4 bucks it's on sale for now. Dear reader, you've probably seen the overwhelming negative reviews for this game. Take the time to read mine. Let's talk about positives.   * If you like 6DOF like Descent, or some of its clones this game does the job nicely.  * Environments are fully destructible (this can be in issue on some missions, like if there's a terminal checkpoint you have to access but it's been blown away)  * Weapons for the most part are ballistic, and energy based weapons like lasers are non-existent.  * Levels are 'sandbox' in nature. One example I'd use is, you can attack an asteroid base through the front door with all kinds of defense turrents coming at you... Or you can fly to the other side and blast through the asteroid, and knock out the power generator from the back disabling all the turrents. * Very cool game engine. Graphics are pretty tight, sound is good, levels are big. I don’t have crashes on my hardware Voice acting is top notch. We have to do some focus here. Steve Blum, Beau Billingslea, Wendee Lee  Most people aren't going to know these names unless they're super Otaku and into anime. It's the cast of the English version of Cowboy Bebop. Either that or it's some very good impersonators (it's not) (You should watch it if you never have, amazing) After realizing who the voice actors were, the games overall feel and tone took on a whole new meaning to me. Your character is Spike. Negatives. A community hell-bent on saying the entire game is ruined on a few added features. At one point the dev’s tried to put online DRM into the game, and it seemed like that’s when the brigaiding of negative reviews began (coming from reddit) The feature was removed, but the community is still jilted. This is perhaps the biggest negative about the game. You might not even buy it at $4 bucks, because of the bad reviews.  OK now for some actual negatives.  * Angry Video Game Nerd professes his love for “Megaman X” because of how the first stage teaches you how to play the game. I don’t think there’s enough of that in Miner Wars. The first level *should* be a little slower. Instead it’s “BAM!”, and the player has no time to learn the controls, or how to use the weapons properly. * Too destructable sometimes. There are key terminals/checkpoints that need to be used at places in the game that can get destroyed by NPC fire.  *Multiplayer is a ghosttown * Development has somewhat ceased.   Advice to Keen. You’re doing good on your other games. You *might* want to revisit this one. Maybe tie it into the Space Engineers universe.  Advice to gamers. Don’t expect this to be anything more than a 3d platformer get key open door 6dof game. If you enjoy the genre, the game is worth it. ",
            "review_score": "1"
        },
        {
            "review_text": "Very laggy, so much that the game is unplayable. Also unable to change the video settings.",
            "review_score": "-1"
        },
        {
            "review_text": "Uninstalled after 20 minutes of playing. This game is broken in every imaginable aspects. 2/10 for even trying to make a Descent clone.",
            "review_score": "-1"
        },
        {
            "review_text": "The story looked good but it's way too hard. You're always heavily outnumbered and it only takes a few stray bullets to kill you. The 'loot stuff to pay for upgrades' mechanic is much bigger than the video suggests. If I'd known that I wouldn't have bought it.",
            "review_score": "-1"
        },
        {
            "review_text": "Is ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "so many peopole are saying this game is not worth it. I LOVE it.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a really pretty, updated version of Descent with very bad, even HORRIBLE voice acting and a crappy plot. Come for the 6DOF flight and tunnel shooting, stay for the crappy sci-fi movie.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beyond boring. I thought it would be much better. Blaaaaaah. Guess I had high expectations. Save your $",
            "review_score": "-1"
        },
        {
            "review_text": "This Game has promise. Just finish what you started. It sayed 360 controler compatable, Just one problem ..... NO ITS NOT. You cant even map the buttons. Graphics are pixilated, Just not what you led me to believe. Very bad use of my 20.00$",
            "review_score": "1"
        },
        {
            "review_text": "It is a cool game but if you do not really reallly really like space games do not buy it. It is not worth buying it when you are not in to that space sh!t.",
            "review_score": "1"
        },
        {
            "review_text": "I have 2 kids and a saxaphone",
            "review_score": "1"
        },
        {
            "review_text": "Great controls, a little short, but the graphics keep it interesting enough to get into. The secret rooms are the best part of each level so go to the guides for that, otherwise I can even remember how I got this game but it was on sal e and stupid cheap, so if that ever happens grab it for about 8 hours of Star Fox style combat.",
            "review_score": "1"
        },
        {
            "review_text": "The game was short, decent mechanics and somewhat interesting idea. It's jsut sad to see the devs kind of abandon the game. The game had potential but in the end they flopped it good.  If the devs had taken thier time to nourish this game I'm sure it would have ended up being a pillar within the spaceship sim community. But like I said, they forgot about the game and in the end just took the money and dumped on the people.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was short, decent mechanics and somewhat interesting idea. It's jsut sad to see the devs kind of abandon the game. The game had potential but in the end they flopped it good.  If the devs had taken thier time to nourish this game I'm sure it would have ended up being a pillar within the spaceship sim community. But like I said, they forgot about the game and in the end just took the money and dumped on the people.",
            "review_score": "-1"
        },
        {
            "review_text": "Great idea, not that great of a game. if diffrent developers picked this up it would be amazing. But its not polished and does not feel that open. 3/10",
            "review_score": "1"
        }
    ]
}