{
    "app_id": 223410,
    "name": "Perpetuum",
    "release_date": "2014-10-17",
    "developer": [
        "Avatar Creations"
    ],
    "publisher": [
        "Gamestorm Ltd"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "MMO",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Massively Multiplayer",
        "RPG"
    ],
    "tags": [
        "Massively Multiplayer",
        "Mechs",
        "RPG"
    ],
    "achievements": 34,
    "positive_ratings": 455,
    "negative_ratings": 194,
    "price": 3.99,
    "description": "Perpetuum is a persistent, sandbox, single server, massively multiplayer sci-fi rpg (MMORPG). Control huge robots and mechs to gain access to an alien planet's resources and knowledge, amass huge wealth, or even claim part of the world for yourself using terraforming and complex infrastructure.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/223410/header.jpg?t=1517160119",
    "minimum_requirements": "OS: Windows XP Processor: 2 GHz Intel or AMD processor Memory: 2 GB RAM Graphics: NVIDIA or AMD 3D graphics card with Shader Model 3.0 support DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3 GB available space Sound Card: DirectX compatible sound card Additional Notes: Integrated graphics processors like the Intel GMA series might work but are not officially supported. The ATI Radeon X1000 series is not supported because it does not fully comply with Shader Model 3.0 standards.",
    "recommended_requirements": "OS: Windows 7/8/10 Processor: 2 Ghz multicore Intel or AMD processor Memory: 4 GB RAM Graphics: NVIDIA GTX260 or higher / AMD Radeon HD 4870 or higher DirectX: Version 9.0c Network: Broadband Internet connection Storage: 3 GB available space Sound Card: DirectX compatible sound card",
    "reviews": [
        {
            "review_text": "This is mostly EVE, with robots instead spaceships, no monthly fees, player driven market, skills development with time...  If you enjoy EVE, or can't afford it... this is you only alternative for EVE Online without monthly fees",
            "review_score": "1"
        },
        {
            "review_text": "November 2014 review: Never got off the ground, market based game with no market. 2/5- dont play it unless you have a small group and are willing to play with the broken economy.  Gameplay: Its like eve with robots, go watch a video, not the most exciting thing but the robots do play differently.   This is a game that is pretty much eve, but the market has nobody really buying or creating on the whole.  Same wait for your skills style progression, not really a problem there but what this thing really lacks is content  Things you can do in this game:  Missions: -Incredibly boring, only 4 or 5 missions per level. Skip these once you have the cash to.  Beacons: -go in small groups of 2-15 and fight stages of NPCS, this was fun but does require a group to do, do these instead of missions for fun.  Industry: -You will need to build 90% of your own things. Because there is rarely anything for sale locally. Also not a lot of people buying things. Not too bad to build all your own stuff, I had fun doing this for a while until I got into medium robots and the curve would take too long to get more interesting things.     Exploration: -Kind of like eve explo content except scanning is done through triangulation. Good way to make money but gets boring pretty fast because there are only 2 or 3 site types worth anything due to the market status.  PvP: -This is supposedly a big draw of the game, but through my 10 or so hours wandering through the low sec of the game I only found 4 fights. Three of which either I was afk watching something else because I hadn't seen anything in 30 minutes or the other guy was AFK presumably doing the same thing. Last one was a 5 man group, but at least it was something!  With the market so dead, it just isnt a game you can play the way it was meant to. Sad but its not happening. If you have 5 or 6 friends interested in exploring this game with you, you can probably get your moneys worth- but as it stands just not enough content to be worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Overall this is a great game. It is Eve done better.    If you're familiar with Eve, then...",
            "review_score": "1"
        },
        {
            "review_text": "If you're the kind of person who enjoys empire building and large scale team play where you're in an open unforgiving environment setting your own goals and making your own fun then this game is for you.  Perpetuum doesn't hand you victory. It doesn't take you on a stroll through a beautiful theme park like most MMOs. You have to work, fight, and build every inch of success you make here. As a result the highs are incredible and the lows are quite low. I personally love it. This game is very much in the hands of the person playing it. It's hardcore for the hardcore type of player.   Many have compared it to Eve Online circa 2004 except with mechs.",
            "review_score": "1"
        },
        {
            "review_text": "tldr; I'm a nub, and so far the game is ^^^ with lots left to learn - but the early game is a sharp-ish learning curve.  --  Disclaimer: At the time of this writing I am 6 hours into the game; this review is written from a very nub perspective.  My first impression of this game from the trailers was, 'This could be what a Mechwarrior/Battletech MMO could have been...' Well, it turns out, not exactly; while the game view is notably more like Mech Commander than anything else I've played, the rest of the game play is very reminiscent of EVE, complete with things that sound hard to do, until you do them. Once. That's all it takes.  The tutorial is very detailed (and for good reason) but moves quickly as you go step-by-step through learning the interface, which is largely accessible by visible buttons on the UI. The mech bay view (where you get your missions, store your unused-but-not-sold items, store materials you will eventually sell/use for crafting, research, skillgain, buy/sell, and configure your mechs [called robots in the game, since your pilot is remote rather than within]) is fairly easy to adapt to, and is one of the reasons I mention EVE. Cargo is nearly identical in terms of access, repairs, movement between bays, and unit configuration, and market access and use it all but the same as I recall it (from about 4 years ago), but skill gains are different, almost opposite. Where in EVE you would select a skill and a timer would start and count down to completion of study, this game accrues skill points daily at a set rate (which can be increased with ingame functions); when you login you get your allotment of points, then for the next 2 days you gain points again, whether you login or not. If you don't login after the third day though your skillpoint gain stops, and will begin again when you login next. Said points are then spent for an immediate gain of a skill on a scale from 1-10, with difficulty/complexity ratings that modify skill gain (again, same as EVE did) to cost more points the more complex the skill is rated.  Combat is fairly straightforward. The one thing that I do not like is that there seems to be no 'shooting from the hip' at all, ever; you wait until your guns lock on, even if you're at point blank range, then engage them and they fire on a timer, automatically quitting when the primary target is out of range or destroyed.  You can loot containers while fighting. You can lock several targets at once, provided they are in range of your gear/skill. You can reload guns in combat.  There are non-combat focused missions as well as combat missions, and you can toggle PVP on/off.  In base areas there are tiles placed to speed movement; very helpful.  The chat community seems friendly so far, and is knowledgeable and helpful when asked clear questions.  Completing the tutorial was an area of boredom, until I realized that I actually did need to know 'all this crap.' DO the tutorials, but don't stick around trying to farm easy loot from drones, or using your materials to gain research, or anything else; you all but full reset once you join the real world via choosing a faction.  I advise that you want to budget ~2 hours for the tutorial.  That's LONG, and don't be in doubt, it can be done much faster, but use this time to learn the game as far as you can, given no true baptism by fire.  This is a serious game for serious gamers, but can be enjoyed by teens on up to graybeards. There is some number crunching, and I have yet to PVP, but so far... so good.  Bottom line: I reckon I can get a couple hundred hours out of this game in its current state.  8/10 would buy game on sale again. For the time I expect to put in, paying full price would still be a good deal.  Nice job, Avatar Creations!",
            "review_score": "1"
        },
        {
            "review_text": "If you like EVE you will like Perpetuum!  Pros     Easy to get into if you played EVE     Dynamic tactical action packed combat (compared to EVE)     Great community of players  Cons     Graphics     Small Indie Dev team   For the reviewers that don't like this game I notice 2 main things, They haven’t played EVE and the steep learning curve and UI that this game and EVE share turn off a lot of people when they expect it to be an action game from the trailer. Or the reviewer has played EVE but believes Perpetuum to be inferior. Mainly because of graphics but also the game is different in some ways.   What made EVE a success wasn’t the graphics, but the dynamic player driven gameplay, and I believe perpetuum captures that same feeling. At first it’s hard to adjust to crawling around on the ground, instead of cruising through space. But the fact that you interact with terrain gives the combat in this game a level of depth and interaction EVE will never have.   When I grind combat missions in EVE, I warp into a “room” target the enemies and then fire my weapons to destroy them keeping an eye on my shield bar and slow boating around in the meantime like a blimp, if I am in a battleship. In Perpetuum, I travel to the combat site and target the enemies from afar and then run in to engage them, while firing at them I can run around the terrain as will the enemies, using cover to block weapons fire.   The shields in perpetuum are very dynamic, while you have your shield enabled it consumes your “capacitor energy” directly to absorb damage, meaning as long as you have capacitor energy you will basically be invincible. The tradeoff is of course while your shield is up your weapons cannot fire back, but they can reload! This gives another level of depth and management to combat, having your shield up while reloading or when you anticipate enemy fire, and lowering it to counterattack. The shield also seems very useful for industrial ships, as they can activate it to by time while they run away from whatever would be attacking them, having no need to return fire.  In my own personal experience the people in this game are fantastic. I was concerned about playing such a team and cooperation oriented game without my usual group of gaming friends and going into the world solo. But after a few hours of playing I and several other new players in the starting area received an anonymous donation of in game money from the individual who had been answering all the questions in the help channel all morning. I only found out who it was because of my experience in EVE I could find the sender of the money in the transaction window. When the other newbs asked who it was in chat he never said anything or took credit.  Needless to say, after talking to him for a bit, I’ve joined his corp (ETHOS) and couldn’t be happier. I was already starting to enjoy the game more and more as I got into it and it became more challenging, but now that I am part of a great community it is 100% better. Some of the people I talked to have been playing for 5 to 3 years!. Most of them tell me they have quit Eve because the community on this game is much nicer and I have to agree. I haven’t seen a single negative person or anyone spamming dodgy money doubling schemes in chat. And so far, no one has cheesed a way to destroy my robot or grief me in the non PvP areas. The amount of time I’ve lost a ship in High sec in EVE to a player without willingly engaging in PvP is staggering. (for reference, I have 925 hours on EVE and have been playing off and on for years)  Bottom line for the price point this game is 100% worth it if you know what you are getting into. The people that play are dedicated and it isn’t hard to get involved in the action and community.  ",
            "review_score": "1"
        },
        {
            "review_text": "It is dead game. Online is about 120 players on top. Lack of content, bad graphic.  Good concept, that can't get the proper care of its developer team. Sad, but only a miracle can save that game from being killed.",
            "review_score": "-1"
        },
        {
            "review_text": "Firstly this game is awesome. Now you most likely want to know why, well I'm going to tell you.    Perpetuum gets referred to as being like 'Eve Online' alot. Well there are similarities but It's not quite the same deal. In Perpetuum you get to costomize the fit of your robot or mech and run around the world doing as you please. Literally you can do whatever you want. You are going to be making the most fun for yourself, there's nothing that guides you through areas like a quest line.    Secondly it's a sandbox so having a goal in mind is a good idea although the missions and npc fights are fun. The bread and butter is the pvp which is a high risk/reward system. There is somewhat of a learning curve but It's not that bad. The amount of freedom and choices you get for customization is enough to keep you interested especially if you like robots and mechs. It's fun experimenting to see what works and doesn't.    Next is the Industrial options. I think everything in this game can be made by the players. It's quite in depth and I had to read into it a little but after getting the hang of it, industry is alot of fun. I'm having fun with industry even though I primarily pvp. Gathering materials and kernels to make items, robots and mechs is the simpliest description of industry I can make. The Market is player driven. Which also gives players options to 'Buy low and sell high' if you're into making NIC that way. NIC is the in game money.   Lastly the community is great and willing to help, just make sure you join the general chat as well as the help! chat. I've already learned alot from the community and there's quite a few corps currently recruiting. If you like games with depth and appear to be 'more than meets the eye' this game could be for you. This review has hardly scratched the surface of Perpetuum.  ",
            "review_score": "1"
        },
        {
            "review_text": "I fully recomend this game as a lower quality eve clone. Eve with robots. Has the same concept, similar player driven economy, combat, mining...etc. As a former eve player i adapted easily to this new game. Major downside for me so far BUT i havent played long , would be it seems i only see 16 insland with 6 of them apearing safe. Maiby im wrong and there are more . Worth 7.3 E ? YES worth more....im not too sure. If you dont like subscription based EVE and want a more casual game but with similar concepts Perpetuum is the answer. Pay once 7 E and have fun. I personaly spend 6 hours mining for a new robot while watching some movies online. Similar to what i did in EVE :D The combat is fun too. Meaning its the same as EVE very dependent on gear and ur choices of expertise. NOt reflexes well at least not that much. BUT i havent pvp ed yet. Well long story short its a smart well made eve online clone that i fully recomend for the winter sale. FUll price no. not yet.",
            "review_score": "1"
        },
        {
            "review_text": "Eve-online but with mechs is the best way to describe this games controls. However it does lack alot of the depth and playerbase when compared to eve. The lack of player base is a big issue as the PVE get boring and repedative quite quickly, but they are trying to address these issues now.  The game has never fully grabbed me and kept me for more than a month or so but I still enjoy playing every now and again and now its a pay once game thats not really too much of an issue.  I hear the price is going to be dropping, and for £10 you gotta give it a go, even if it only grabs you for a month or so you've got more than you moneys worth.",
            "review_score": "1"
        },
        {
            "review_text": "Where to begin as many people have said this is like eve the set-up and layout to the way you pilot the mechs is nearly the same.  So down to what I think, as normally I don’t write reviews but this is worth one as it is a game that has gone under the radar for most, me included.   My cons are greater than my pro list. But there not gaming breaking con’s more a wish list on how somethings I feel should work or could be improved a little but there current state does not ruin the game for me.  Pro:  Quick and easier to pick-up the mechanics are easy if you have played eve before.  Good intro guide in part for new players to get there head around the game before jumping in, see con for bad part of guide.  Dev’s are in-game helping people.  Con:  UI needs to be update for example Landmarks windows needs to let you break it down in to other windows like for missions only items or for drones only this would be of great benefit for pve and pvp.  No way to skip training guide it seems and it can get boring if you just want to get in and play felt very long and could get boring for someone who has played a lot of mmo before. However as stated as a pro it is good for someone who has never played this type of game before.  (Edit the above can be skipped by going to the teleporter it turns out but right away. This should however needs to be made clear for players who are bored with the training.)  They do not explain extensions very well in training or what you would need to get started properly, maybe they should offer templates after finishing the training area for what you would like to specialize in. For example a bounty hunter template will give you the basics for pvp\\pve Template or a harvesting\\mining Template and so on as this took a bit of time to read what I needed to get the most out of a basic pve setup.  World feels a bit empty not player wise but Npc\\AI bots wise  Hate having to keep going back for quests one at a time and would like to take 5 combat quests at a time and just go out and do them instead of only being able to take one level 2 combat quest.  Need more mech’s to choose from feels very limited on the choice of what to go in to battle with?  Overall great game and worth the money and from reading the forums and seeing new and old screen shots of the game the dev’s are continuing to improve the game making it better.",
            "review_score": "1"
        },
        {
            "review_text": "Eve-online but with mechs is the best way to describe this games controls. However it does lack alot of the depth and playerbase when compared to eve. The lack of player base is a big issue as the PVE get boring and repedative quite quickly, but they are trying to address these issues now.  The game has never fully grabbed me and kept me for more than a month or so but I still enjoy playing every now and again and now its a pay once game thats not really too much of an issue.  I hear the price is going to be dropping, and for £10 you gotta give it a go, even if it only grabs you for a month or so you've got more than you moneys worth.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy EVE, you will like Perpetuum as well. No subscription is a plus. Plenty of things to do to keep you occupied.",
            "review_score": "1"
        },
        {
            "review_text": "This game has potential but I have absolutely no Idea how to play this game.  7/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Had experience with Perpetuum couple years ago and decided to return back. First impressions are that they improved tutorial alot and made the start easyer for newcomers. If you liked EVE and like robots you should try this game",
            "review_score": "1"
        },
        {
            "review_text": "A new players first impression  After chewing threw the Tutorial and then doing a few missions, I've summised that Perpetuum is very similar to EvE Online, albeit you control a robot rather than a spaceship. The targeting systems, menus and general gameplay are mostly similar.  This is both Positive and Negative.  The positive side is that you can quickly familiarise yourself with the basics and flow of the game.  Negative being that it doesn't feel different, and a lot more 'rough' than its comparable partner.   I'll just reel off a few impressions: - The tutorial is very informative, which is often overlooked and gives you a great start. - Outside of the tutorial the game gives you nothing. Other than here are missions, go.  - Graphics are pretty basic, and generally not pleasing.  - Game provides a great time sink aswell easy to dip in and out of - with things not requiring large investments of time, due to the EP system.   Overall, its a fairly solid game - a good F2P alternative for people who are interested in EvE or no longer wish to play subscrition based games.  I will give it a 6.5/10  Down to the empty player base and the fact that once you finish the tutorial you are given no direction",
            "review_score": "1"
        },
        {
            "review_text": "I play this game with pauses since October 2010. It had some falls and dawns, but this is definetely a game for people who like hardcore full loot sandbox games. Even though Gamma were repeatedly wiped and closed, I think it is a great game.   EVE fans must DEFINETELY try this game!  P.S: I play PERP via steam with my 4-th account, therefore game time on this acc might seem... small ))",
            "review_score": "1"
        },
        {
            "review_text": "I've been keeping a close eye on this game for the past couple of months, as I took an eager interest into the MMORPG aspect being combined with mechs - a deep passion of mine. Needless to say, as the Christmas sale came on and the price dropped, I grabbed myself a copy.  My first impressions is that the game is very intimidating, there's so many aspects to the game - from being careful in what skills (extensions) you purchase out of the hundreds to use robots and get an edge in combat, to simply purchased ammunition or robots, as the price of them fluctuates from area to area.  However, the community in this game is amazing, and the tutorial makes the game much easier to understand. I have had no issues playing the game so far with the outstanding support I've recieved in chat for any of my questions (no matter how noob-y they sounded).  Overall, I'm very satisfied with this game and look forward to playing many more hours.",
            "review_score": "1"
        },
        {
            "review_text": "not what i expected before i got it not for me personaly after trying it but it is a quality game that deserves a recommendation",
            "review_score": "1"
        },
        {
            "review_text": "Perpetuum in my eyes is a perculiarly interesting game, I've played some EVE online and definetely see the similarities that some people make, but to be completely honest, I much prefer Perpetuum, it's a little bit simpler, whilst still being very involving and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very sandboxy MMO which forces you to think for yourself. Once out of the tutorial, you are completely free to do what you decide and the only limits are your choices. The devs are dedicated and while the game has a small community, it is what makes it so exclusive and enjoyable. The tutorial is extremely helpful and teaches everything you need to know, but different parts of it are completely optional. Give the game at least 2 hours and you will understand enough to enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Keep in mind, this game is very E.V.E.-like, and I am not a fan of that type of game.  I knew this game was E.V.E.-like. I bought it anyways because some of the gameplay looked fun. It honestly does look, and sound, fun. It's just executed so poorly.  The tutorial takes about an hour, there is way too much to learn at the beginning, It's overwhelming, and that turns off a lot of players, including myself. The UI is bad. It's like playing Tetris, not with your inventory like Diablo, but with all the windows you have to manage. Not 2D tetris, either. 3D Tetris, so you have to know what window is behind what. The fighting is simple and boring, though LOOKS interesting in gameplay videos. You just click on a gun, and that weapon fires. Or, press Space to fire all weapons.  The animations and textures are one of the more disappointing things about this game. It looks like a game that my Grandma could play on her 5 year old store-bought PC. Unfortunately, it runs like Crysis 2 would, on said store-bought, 5 year-old PC. The animations are poor. Watching a robot walk around makes me cringe, because they don't step... They slide. Their feet might make the motion of stepping, but they just slide across the floor...  The movement is worse than anything else. You don't FEEL like a robot. You can go from facing right to facing left INSTANTLY. No side-stepping, no turn animation, you just snap to that direction and go. It's horrible! I want to feel like I'm a powerful robot, or a nimble robot, or a big, heavy mining robot. But, no. You just snap directions, and go about your day. No matter what design you have, the robot's movement is poorly animated and feels way to fast to turn directions.  Overall, I'd give this game like a 3/10. It seems like it would be fun, if things were executed a bit differently. A game like HAWKEN got the movement for mechs right. The stomping, the independent movement of the torso, etc... I just think this game needs more work.  I'll never be coming back, to play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Purchased the game at a steal during the winter sale for $21 less than it normally would have costed. This is perhaps the best deal I have ever personally seen on steam in terms of value and satisfaction.   I have played EVE Online in the past which is remarkably similar to Perpetuum (for over 8 years) so I will be making cross comparisons in this review between the two games.  ---------- RATING: 90/100 ----------  PROS:  [] A very large open world. While not necessarily as large as the world of EVE-O, Perpetuum does seem to have a lot less transition loading between areas than EVE does. Loading sequences happen between different regions and upon entering terminals only (terminals==stations), whereas in EVE-O there is wait time between hundreds of solar systems that comprise a single region of space. Short version: EVE-O you have to wait anywhere between 5-25 times to transit across an entire region. In Perpetuum that degree of tedious does not seem to exist.  [] Has a time-based progression system in the form of 'extension points' (EP) that accumulate provided you log in at least once every 72 hours. EVE-O has a similar system that uses skillpoints as well. While there is slightly less flexibility with Perpetuum's EP system versus EVE-O's SP system, it is a godsend to players who hate level-based grinding and may or may not have the time to commit to being online constantly in effort to avoid falling behind others.  [] Complex player-driven market with a versatile selection of equipment and supplies that can all be built by the player from the ground up. EVE-O has this as well though their market is much larger and more developed than Perpetuum's in part to being a older game with a larger player base at current. On the other hand, Perpetuum's market is young enough to where it is currently easier to make a living. Competition on the market is at a minimum in comparison to EVE-O's, and there is still time and room for a person of ambition to make a stake at becoming a production magnate with less effort and risk that would be required in a game like EVE.  [] Varying levels of risk and player interaction does exist in Perpetuum. You have the choice to enter more dangerous regions to take advantage of the rich frontier, or to simply go look for a fight if that is what your aim is. On the other hand, you are not forced into this choice and may play it safe as well. EVE-O has a similar system, but there is one defining difference I have come to notice very quickly: You cannot suicide bomb a player in safe territories. That being said, you can be completely safe while doing your business in Perpetuum, provided you are in the right region, while in EVE-O there is technically no place that is 100% safe outside of being undocked.  [] Community is much more friendly and a lot less cutthroat than the majority of EVE-O's tends to be. Players and corporations in Perpetuum tend to be a great deal more helpful and friendly, whereas in EVE-O the community is so cutthroat and survival driven to a point where players/corporation would appear very self-centered and paranoid to a outsider who is new to these kinds of games and does not understand the nature of the game play. In the very nature of what EVE is it has weeded out virtually every average/casual gamer that may have existed within the player base over the years, leaving only the most die-hard, obsessive, elitist players behind, some more snobby than others, which is one of the bigger things that personally compelled me to stop playing EVE. This is a large part of why EVE has a infamous reputation for being such a harsh game with a community that can be very cutthroat (PvP/Indy alike). This is bound to happen when you have a game based on the quest for PvP/economic supremacy with at little boundaries as possible. That being said, Perpetuum's community has not yet started to rot into what EVE-O's has become today so it has more appeal over EVE's at current in terms of being a more pleasant social-gaming experience for any kind of game. This could end up changing in time but for now the atmosphere has not yet reached the point where Perpetuum has become just like 'Spreadsheets Online: Your Job Away From Your Job'  [] Hands down, the biggest perk fo this game is NO SUBSCRIPTION REQUIRED. This is a godsend to me personally.   CONS:  [] The player base is currently smaller than it could be. From what I've learned it used to be larger but had stagnated at some point. This can easily change and I'm pretty sure it most certainly will, but there are times when the game feels kinda quiet, but not ever empty.  [] Design and graphics are a good deal behind modern engines, but not in such a way that overshadows the excellent mechanics and game play. Even still, the graphics are not up to spec and may turn cheek for those who hold the visual experience in high regard over everything else.  [] UI is very similar to EVE-O's and can come off as boxy and old fashioned, especially to younger generations of gamers. While it may boast better control and be far from short of providing all the tools a player needs to play the game, it can be hard to understand for some people.  [] Tutorial needs work. Could be condensed, simplified, and streamlined a great deal more but at least is not a process that the player is forced into. Not recommended for the highly impatient, easily frustrated, more or less AD/HD gamers. Stick with CoD, this wouldn't be for you.",
            "review_score": "1"
        },
        {
            "review_text": "Just started. Intresting ideas and complex for an mmo with Rock-Paper-Scissor combat. Leveling (if you call it that) is done on an account per day basis, so it does not punish people who play just a bit. But that means if you binge play you are not going to fly through the levels, just get a lot of stuff. I would really like to see a more streamlined loot system.   Overall positive. But not a fast paced game from what I see so far. More of a sandbox mmo so far. I will try to update this as I find more.  Pros- -Sci-Fi -Combat is not Rapid fire button mashing. Tactics matter to some degree. -indepth systems for equipment, market, crafting, and research. -Tutorial is decent.  Negs- -Looting is slow. Double click to see. Hit loot all button or key, Repeat for all targets. (Not terrible, but a loot all in the area would be nice. -So many windows, interfaces, and menus. This gives a lot of information and options, but is not friendly to new players.  -Graphics are not bad, and decent for the cost. But not going to blow anyone away.",
            "review_score": "1"
        },
        {
            "review_text": "Eve with stubbed legs and no monthly sub fee.",
            "review_score": "1"
        },
        {
            "review_text": "I have been a long time fan of EVE. Played it for years and years.. But I have to be honest, it just didn't do it for me anymore. I needed something new. Insert Perpetuum!   I have been playing it for 10 hours now and as a new player I have to say it feels and plays great. Most people say it has a huge learning curve and they would be correct in that aspect. But I do have to say, if you take the time to go through the tutorial area it really helps in getting started with the game. It's clear, to the point and it gives you nice bonusses for your new life in Perpetuum.  This game is by no means an EVE replacement, but it feels and looks similar to it. The community is great and helpful but battlespirited and I feel like I will have a great time going forward with this game!   I will post a more up to date review once I get more into this game!",
            "review_score": "1"
        },
        {
            "review_text": "At first i thought this was like a better mechwarrior mmo but then i realized quickly that there is a lot more. The GUI is not intuitive and the resource system is poorly labeled. unless you are willing to spend HOURS learning the system and the nuances of the map/resources/market only to discover that combat is lock on and attack...",
            "review_score": "-1"
        },
        {
            "review_text": "The game, it's amazing! nothing else to say. *muah*",
            "review_score": "1"
        },
        {
            "review_text": "Can be fun but needs more players!",
            "review_score": "1"
        },
        {
            "review_text": "It's way to difficult for most people to get into it. Please look up gameplay videos before buying this game, and deciding if it's worth it or not.",
            "review_score": "-1"
        },
        {
            "review_text": "ZZZZZZZZ..... it's like an eve clone without the fun or awesome spaceships.",
            "review_score": "-1"
        },
        {
            "review_text": "pros: - pretty fun - extremly complex - tons of choices - good time waster  Cons: - The game is dead, noone plays it, and when you do find someone they want to kill you",
            "review_score": "1"
        },
        {
            "review_text": "MMO? No subscription? Robots? You got me hooked!!!  The only sad thing is ,there arent many players.. Lets change that!",
            "review_score": "1"
        },
        {
            "review_text": "This game is dead. Just shut it down and don´t extend this misery.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent game with complexity to keep an active mind busy with the long term play.",
            "review_score": "1"
        },
        {
            "review_text": "Even the Tutorial is painful to play what a horrid game. Why would steam put a game on thier service that is total garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Very confusing game. The UI is TINY and there is no way to scale it that I can see. About half way through the intro tutorial that I had to READ, I reached a task that could not be performed. So I quit.",
            "review_score": "-1"
        },
        {
            "review_text": "I would lOVE to play this game but the tutorial is ♥♥♥♥ and I dont feel like spending 30 plus hours on youtube to figure it out .",
            "review_score": "-1"
        },
        {
            "review_text": "EVE on land with robots.",
            "review_score": "-1"
        }
    ]
}