{
    "app_id": 223750,
    "name": "DCS World Steam Edition",
    "release_date": "2013-08-02",
    "developer": [
        "Eagle Dynamics SA"
    ],
    "publisher": [
        "The Fighter Collection"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Captions available",
        "VR Support",
        "Partial Controller Support",
        "Includes level editor"
    ],
    "genres": [
        "Free to Play",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Flight",
        "Free to Play"
    ],
    "achievements": 0,
    "positive_ratings": 5083,
    "negative_ratings": 1534,
    "price": 0.0,
    "description": "Feel the excitement of flying the Su-25T &quot;Frogfoot&quot; attack jet and the TF-51D &quot;Mustang&quot; in the free-to-play Digital Combat Simulator World!DCS World is a vehicle combat simulation game created by an inspired development team. DCS World uses a powerful engine that delivers realistic gameplay.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/223750/header.jpg?t=1554910046",
    "minimum_requirements": "Minimum system requirements (LOW graphics settings):   OS 64-bit Windows 7/8/10; DirectX11; CPU: Intel Core i3 at 2.8 GHz or AMD FX; RAM: 8 GB (16 GB for heavy missions); Free hard disk space: 60 GB; Discrete video card NVIDIA GeForce GTX 760 / AMD R9 280X or better; requires internet activation.",
    "recommended_requirements": "Recommended system requirements (HIGH graphics settings):  OS 64-bit Windows 8/10; DirectX11; CPU: Core i5+ at 3+ GHz or AMD FX / Ryzen; RAM: 16 GB (32 GB for heavy missions); Free hard disk space: 120 GB on Solid State Drive (SSD); Discrete video card NVIDIA GeForce GTX 1070 / AMD Radeon RX VEGA 56 with 8GB VRAM or better; Joystick; requires internet activation.  Recommended VR systems requirements (VR graphics settings):  OS 64-bit Windows 8/10; DirectX11; CPU: Core i5+ at 3+ GHz or AMD FX / Ryzen; RAM: 16 GB (32 GB for heavy missions); Free hard disk space: 120 GB on Solid State Drive (SSD); Discrete video card NVIDIA GeForce GTX 1080 / AMD Radeon RX VEGA 64 or better; Joystick; requires internet activation.",
    "reviews": [
        {
            "review_text": "After a long week blowing up ISIS in my A-10, I revel in the relaxing feeling of blowing up virtual ISIS in my virtual A-10.",
            "review_score": "1"
        },
        {
            "review_text": "This game, or more accurately, simulator, is one of the best games I have played in a VERY long time. No matter what your taste in aircraft or flying may be, there is fun to be had in DCS.  You can purchase aircraft from a wide number of time periods, from WWII, The Korean War, and even modern battlefields. There's also some very nice helicopters to purchase, but I can't comment on those, as I don't have any.. ;-;  If you like CAS, BVR, Dogfighting or just screwing around with friends in fast aircraft, DCS World is most certainly worth trying. The free aircraft you get, the SU-25T and TF-51 give you a pretty good feel for what you can expect in DCS, but I definitely reccomend picking up a full fidelty module if you like it, great fun learning what all the alarms mean... ._.  One quick note though, getting the game directly from the developers is a better choice than Steam, as the version from ED's site gives you earlier access to new modules, updates, and let's you buy modules from sales on ED's site AND Steam, which cannot be done with the Steam version ;D  tl;dr : BUY IT AND YOU CAN CRASH TOO :D",
            "review_score": "1"
        },
        {
            "review_text": "Outright the best aircraft and helicopter simulator on the market. The only negative part: You can never fly any other simulator again. (Because you will miss the fidelity of DCS)  A small warning though: This is a simulator, not a game. So expect to invest many hours of learning how to handle your craft. If you are willing to learn, this simulator will be immensely rewarding to you.",
            "review_score": "1"
        },
        {
            "review_text": "I saw this 'game' on steam one day, and was like 'meh it's for free let me try it'.  A week later.....  *while printing ~300 pages of manuals and charts* Friend: What are you doing? Me: The closest thing to an airforce pilot I can do",
            "review_score": "1"
        },
        {
            "review_text": "An amazingly well done flight sim. Sure, if you're in reality a terrible pilot with bad habits it's going to be really hard to retrain yourself from the hand holding of other well known flight sims. Reality check #1, you can't expect to land at full speed. #2 Your 20, 000 pound Su-25 or A10 won't turn on a dime unless you know how to make the beast obey your wishes.#3 this is a very unforgiving and realistic sim. You WILL be shot down a hundred times before you learn to actually evade enemy fire.   Also, you really can't blame the developer for the user being too lazy to actually read the manual provided/available to each aircraft. I mean, if somebody's too lazy to read the mission briefing that describes the campaign progression why would you expect them to read the manual?   In conclusion this game isn't for the lazy or weak willed. It's for those that want the satisfaction of seeing an a10 at the local airshow and knowing you could start that sucker up and off the runway and navigate anywhere you want to go. While using any and all real world equipment in that airframe.  For me 10/10 for this high quality sim, DLCs as DCS definitely worth every penny",
            "review_score": "1"
        },
        {
            "review_text": "Just sitting in the cockpit on the runway in VR mode with HTC Vive is enough to give this a thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Just bought it today, I don't have the slightest clue what I'm doing, but the game is great in just about every way from what I've seen of it.  The learning curve is very high in this game, but it's well worth the time and effort!  It even comes with an ARMA style mission editor! Though this one is a bit more complicated, there is so much potential!!  The fact I have work in the morning makes me sad.",
            "review_score": "1"
        },
        {
            "review_text": "One of the Best Flight Sims I've ever played. Just wish the Price of the Aircraft came down abit",
            "review_score": "1"
        },
        {
            "review_text": "That feeling when I got my first muliplayer kill in the MiG-21, and with guns, is something I can't explain with words. And it was only an A-10C.   The satisfaction when, after tons of hours of practice, of mastering an airplane, its systems, weapons, etc, you get to use it properly and succeed, that kind of satisfaction I haven't experienced it in any other game, even when playing team vs team tournaments in tactical FPS games.   I can only say: if you are into flight simulation, into fighters, attack aircraft or helicopters, go for it. The simulation of most of the modules is superb.     Yes, I know it can get expensive, but actually I wouldn't recommend getting a lot of modules when starting. Get a module you think you will like and start invesing hours in it, and learning the aircraft and to be able to fly it as if you've been doing it for years. Then go to multiplayer and show what you are worth. First it will be all frustration, but after some time and experience, when you start acomplishing your objectives it will be extremely rewarding.     One last thing to say, and being an X-Plane 10 player I noticed really quickly, the clouds on this game are extremely optimized and look fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Super good graphics. Nice HD Models. Can't get enough!",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the most realistic flight simulator out there (with the non FC3 aircraft). In this simulator it is no game, you have to learn how to fly, operate avionics, radios and weapons. Even though the learning curve for the advanced aircraft might seem big there are interactive tutorials that will teach you, which is better than reading some of the multi-hundred page manuals (which should be read when wanting to know how to operate something in the plane if the tutorial missed something). The world in this game is huge, mountains, ocean, towns/ cities. You can achieve long range flights with the map size. Also there is aireal refueling (only with the A-10C and most FC3 aircraft) which caters even more to long range flights. As some of you probably knew before you read this, that DCS is a combat simulator. So on top of having planes with realistic flight characteristics and avionics, you also have the ability to use that planes' weapons. The weapons are just as realistic as the planes, and yes, bombing with planes like F-86F is just as hard as it always was for the real pilots.  The only thing that is missing from DCS is more modern fighters that are not like FC3 aircraft, so far the A-10C is the only modern plane (but it is only a A/G aircraft) and from what I heard the F/A-18C is coming to DCS so hopefully it will expand the variety of planes and helicopters in the future",
            "review_score": "1"
        },
        {
            "review_text": "1:1 simulations sound like your thing? Do you like spending 20 minutes just to get through the start-up process (that is also 1:1 simulated) of your aircraft? Do you reallllllly want to find out what that red button does in the corner? Then this game is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Was going to play IL-2 Sturmovik Battle of Stalingrad, bought an X52 non pro to do so. Decided i'd try DCS WORLD and see if it really was that great.   Spent 27 hours this last week playing it as a SU 27 pilot. So what am i saying?  This is a great game, you need to give it a few hours to learn the aircraft and set the controls but when you know everything this is so much fun. I can't get enough of this game and i've only played the SU 27 so far.  Thank you DCS!",
            "review_score": "1"
        },
        {
            "review_text": "&gt;Flying &gt;♥♥♥♥ yeah I got this &gt;Quick Turn like I do in FSX &gt;BEEEP BEEEP BEEEP  &gt;Undiscernible Russian &gt;Maybe I need to speed up &gt;BEEEEEP BEEEEEEP *more russian but louder* &gt;Aircraft shakes violently &gt;What the fu- &gt;Spinnign out of Control &gt;Heading to the ground- Crash! &gt;11/10 would listen to unskipable dialogue again!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing simulator with insanely detailed DLC aircraft. The game includes 2 free aircraft to try out and get your feet wet. If you are interested in combat flight sims this is as good as it gets.",
            "review_score": "1"
        },
        {
            "review_text": "For years I've liked flight simulators and this (especially the A10C DLC) is fantastic if you really want to get into what at least feels incredibly real.  It's daunting at first and some of the tutorials are not as useful as I'd hoped but stick with it and check out youtube for good how-to guides and you'll be flying in no time.  Multiplayer is another step up but flying missions with other players is fantastic fun!",
            "review_score": "1"
        },
        {
            "review_text": "I love this Simulator. Im addicted to DCS World because of the quality and realism of both the Sim and the Module´s (DLC). i recommend using a joystick or HOTAS, even a cheap one is good enough. the prices of the Module´s maybe seems high but in my opinion worth every cent because of the high quality of them. I recommending this Sim for all flight sim enthusiasts.   I give DCS World 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Best simulator game EVER. I am waiting for F-14 Tomcat and F-18 Hornet ! Full simulation please !!",
            "review_score": "1"
        },
        {
            "review_text": "got the plane started finally got it to move rolled it over n exsploded 11/10 would do again",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Need to put the time into it to fly correctly and learn all of the modules.",
            "review_score": "1"
        },
        {
            "review_text": "Best modern air COMBAT simulator you are going to find.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic simulator and game. I've spent many hours before the steam integration and have bought a flight stick, rudder pedals, and track ir because of this sim. If you love hardcore simulations that require patience and a little bit of study then this is for you.  There aren't as many planes as other simulators, but what this simulator has over ALL others is quality. Both free modules (SU-25T 'Frogfoot' &amp; TF-51D 'Mustang'), and the full modules (A-10C, Ka-50, Huey, Mi-8, P-51d and others) have very detailed flight models (physics) and fully interactive cockpits (for you button/switch lovers out there). You can fly all the modules this sim has to offer without a keyboard; as long as you have a mouse (to interact with the cockpit buttons/switches) and a flight stick/throttle for your HOTAS (hands on throttle and stick).  Once you're comfortable in single player, you absolutely must try out multiplayer. I still remember my first couple experiences joining a multiplayer server in the A-10C (my favorite module so far). I joined their teamspeak channel and had a commander barking orders, ka-50's shouting rifle left and right, and the whole time I had an f-15c fly beside me who I thought was escorting me, but later I realised he was simply practicing his sortie/formation flight.  The reward you feel for learning how to start, take off, fly/operate, then land an aircraft with this level of detail is an amazing experience. I warn you though, this is a simulation first and a game second so be prepared to put in time (around 10 hours) and effort towards the steep learning curve before you expect to have fun.",
            "review_score": "1"
        },
        {
            "review_text": "Keen on reading pages after pages of manuals on radar systems, auto pilots, flight controlls and what not? Feel the urge to be shot down time after time again by enemy SAM stations and fighters? Do you have a desperate need to struggle with control mapping, button possitioning and horrible flying weather?  If yes, continue reading. If no, move on.  Because if you get past all of the earlier mentioned struggles and frustrations this simulator is fantastically rewarding! The feeling you get when you land your first bombing run spot on or shoot down your first enemy fighter with a AMRAM missile is absolutely superb! If you choose to put in the hours requiered, this simulator is absolutely breathtaking!  Do keep in mind that this is a simulator much more than it is a game. Therefore it is not for those who is not willing to lay down the time and effort to get it just right. Furter more you ABSOLUTELY need a joystick and throttle. Preferably a seperated joystick, throttle and peddals. I use the Thrustmaster HOTAS Warthog setup along side the Saitek PRO rudder pedals, and this works wonderfully.  I am curently awaiting my Oculus Rift and can not wait to pair it up with this sim!",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game to anybody!!! I love this game!! I would recommend that you download it from the DCS website. They have faster updates then Steam can get.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for a flight combat simulator...this is it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, stunning and realistic. Very high learning curve, and I liked that. Friendly community towards noobies. Just... epic.",
            "review_score": "1"
        },
        {
            "review_text": "If you want to be a pilot, this is the game for you. And if you dont like it, just remember at least its free!",
            "review_score": "1"
        },
        {
            "review_text": "Got engines started, started rolling after trying to figure out how to start the engines for about 5 hours. Wing collided with a building Exploded  11/10 would fly again :D",
            "review_score": "1"
        },
        {
            "review_text": "Great game for any one wanting a bit of realism without going for all out realism like Falcon BMS. Also I call for a rename of this game. It should be called Button Simulator!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing sim! Very complex and you will need a joystick!",
            "review_score": "1"
        },
        {
            "review_text": "It's the best flight sim in the world. There simply is no substitute for CAS aircraft simulation. Falcon BMS provides a great F16 simulator. However, for everything else DCS is superior in every way. The A10C is the most faithfully recreated aircraft in their line up. But you can still have a great time flying the Russian black shark. The feeling you get when you successfully start an aircraft from a cold start is amazing. You also get to try out the SU25 for free (and the modern version for a price). it's not nearly as fun as the A10C, but it still lets you learn the basic weapon systems. It's VERY IMPORTANT to remember that the A10 is NOT the same as the A10C. the A10 will get you a more forgiving 'arcadey' aircraft (but still more realistic then something like say ace combat or battlefield, think of the old Jane's flight sims level). the A10C will give you the real deal. The A10C package does include basic tutorials for things like learning how to properly fly/start/land/engage in an A10. But things like working with JTAC will not be explained. So quite a bit of reading is required on your part.",
            "review_score": "1"
        },
        {
            "review_text": "Stunning military flight simulation, especially that A10 module. So indepth it has literally taken me 50hrs just to learn the controls :-) enjoying every second of this game! :-) ",
            "review_score": "1"
        },
        {
            "review_text": " DCS World: a great flying simulator, and it's FREE!",
            "review_score": "1"
        },
        {
            "review_text": "DCS happen to be 'the' flight sim developers right now, and their numerous flyable aircraft offer a high degree of detail and realism that is unsurpassed in the military flight sim genre. The Ka-50 Black Shark helicopter, and the A-10 C Warthog for example, are two highly detailed aircraft that will take most budding pilots weeks to get to grips with, let alone master. Fortunately, DCS World provides a more immediate introduction to the flying module without the extremely high learning curve in say the A-10C, and with a reasonable joy stick, you'll be flying fairly quickly. There are several aircraft to pilot, including the F15, Su27, Su33, Mig 29S, and the Su25. The flight modeling is exceptional and level of world detail extremely high. I would recommend having a fairly high end PC to really enjoy the physics and visuals in the game - it is processor heavy. Ideally, you probably want to invest in a joy-stick and possibly flight pedals down the road, if you really want to immerse yourself in the art of combat flying. I've been playing for several weeks now getting to grips with the Su-27, and it's been suitably challenging, offering a lot return playability. Cranked up to full realism, and this quickly becomes a very, very challenging simulator - which of course is where a lot of the joy comes from. Be prepated to be truly immersed in the flight environment.",
            "review_score": "1"
        },
        {
            "review_text": "DCS World is one of the few games I can really enjoy at any time of the day.. Its communities (eg hoggit) tend to be quite welcoming and friendly to all types of players, and that is huge plus.. DCS of course, has a variety of aircraft, mostly purchased ones for around $40, I would recommend picking up A-10C ASAP. Graphically, the game is quite nice (in the air), but ground textures are lacking in certain aspects, but EDGE should in theory fix this, along with some performance problems on older rigs. Overall, 10\\10 gud gume 60 fps no crash",
            "review_score": "1"
        },
        {
            "review_text": "It's kind of like dust II but different.",
            "review_score": "1"
        },
        {
            "review_text": "So I just finished downloading this game today and found out how to take off in the SU-25. After spending 15 minutes in a mission thinking 'I'll just throw myself into the fire' and dropping my landing gear, deploying flares and using my parachutes without getting off the ground once, I decided to use the tutorial. In the next 45 minutes, I learned how to take off, but not after running off the runway twice, overcorrecting while turning to get onto the runway and rolling the plane, and crashing into one of the trucks driving into the taxiing area. 10/10 Would recommend to anyone who doesn't mind trial and error. I know I'll be playing this for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "The graphics are great. Everything from creating missions to playing online is endless hours of fun. A little hard to learn the controls at the beginning, but definately worth it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "WOW! This flight sim is over the top! I just can't get enough of it. The flight models are superior to every other flight sim I have tried. The details of the planes and cockpits are beautiful and having the freedom to click every button and switch, just adds to the experience. The cockpit layouts are spot on. Every item is where it should be as in real life. Flight mechanics are awesome as well. As real as it gets for a flight sim! Learning how to fly these aircraft can be a challenge, but most modules have 'training exercises' to help you figure out what to do. Flight manuals can also be found online, on steam or at the DCS website. There are also traning videos on Youtube. I personally enjoy the A10-C Warthog. The experience in the A10-C is intense and it is such a spectacular flight model. The other aircraft are awesome as well. Flying the Russian birds and hearing the Russian radio chat is great! There are so many positive things to say about this title I would be here all day, but I would rather be gunning down soldiers or blowing stuff up on the awesome missions or campaign! See you in the skies, pilots!",
            "review_score": "1"
        },
        {
            "review_text": "Best Flight Sim on planet Earth.",
            "review_score": "1"
        },
        {
            "review_text": "By far the greatest combat sim you can get your hands on. First module you should get is the A10C then get yourself the TM Warthog. Its the closest you'll get to flying the real thing.  The A10C is one of the most complex aircraft in DCS. If you sort of know your way around the A10C the other modules become a lot easier to learn and figure out so its defintely a good module to start with and one of the cheapest.  DCS takes time so if thats not your thing than its probably not for you. The manual for the A10C is 671 pages to give you an idea of how complex it is. This is the reason these aircraft are 'expensive'. You are basically flying the real thing  I have a lot more than 83hrs as I dont use the Steam version",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing. I found this game browsing Steam and decided to give it a try. Given that the SU-25T module is free, I figured that it would be low quality and very limited in its playability. The complete opposite is true! The plane proved a pleasure to fly and I thoroughly enjoyed the challenge offered in mastering the plane. The first time I was able to take off from an airfield, find a tank convoy, attack it successfully, and return to base, I was sold. The game sucked me in and I knew I had to buy some new modules. I decided on the A-10A, F-15C, and SU-27 modules. The planes are beautifully modeled and each one offers a unique approach to their specific role. Although the learning curve is steep (especially steep for the A-10C, I hear), the reward of mastering an aircraft is unmatchable in comparison to any other game I've ever played. The game offers fantastic gameplay for those who are into heavy ground-pounding aircraft like the A-10 or SU-25 and for those of us who dream of being the Top Gun and dominating the sky. I haven't tried any of the helicopter modules, but they're next on my list. Those looking for a challenging game and are military jet fans should definitely try this game. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "I climb into the pilot seat of my Bell UH-1. After following start up procedures and insuring everything is in working order I slowly raise the collective. My bird starts to steadily lift off the ground though it wants to spin to the right. I rudder till it is straightened out and continue to ascend, wobbly. I leave the confines of the airfield I took off from and make my way to a nearby city, making long sweeping turns as I go. This isn't so bad I think to myself. I've seen videos of people trying to fly and hardly getting off the ground, I guess ArmA3's advanced flight model actually payed of! After a flying around the city for a few minutes, turn my attention back to the airport. Is that a C-130 I see? Surely it is. I have to go get a closer look. I make a beeline for the airport, my instrument panel shaking violently as I proceed at dangerous speeds. As I approach the plane, seeing that it is indeed a C-130, I spot a C-17. I've got to check that out too, I pull back on my stick and to the left, lower the collective a bit and rudder into the most beautiful turn I've ever seen. Across the flight line I spot a 707 chasis. I wonder if that is a KC-135! I take off in it's direction. As I approach from the front I realise that I am going to have to make a near 180 in order see the rear of the aircraft to see if it is infact a KC-135. I pull the stick hard to the right, but I was coming in too fast and forgot to correct my collective. Panic sets in as I watch the altimeter rapidly tick lower and lower. Now is not my time. I hammer up on the collective and continue to bring the helicopter around. An alarm goes off, I assume it to be alerting me to the rapidly approaching ground, no such luck. The helicopter lurches upward at an alarming rate, the alarm doesn't stop. Suddenly I hear a loud *CLUNK* I think to my self, 'What the hell was that?' I then realise that it suddenly got a lot quieter, the sound of blades cutting through the air no longer a constant droning. Infact it isn't their at all. Alarmed I look around and spot my blades hurdling through the air. I quickly apologize to my stoic faced co-pilot, he seems to have resigned to our fate. Nonetheless I punch at the controls to no avail. In a short moment we slam into the tarmac, exploding in a fireball of glory behind the aircraft I was so eager to check out. I never found out if it was a KC-135 or not.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Let me see... We could write for hours how amazing this game is but we dont have time for that. It's an awsome simulation air combat game. If you want to try it please you must have an open mind a be mindwilling to overcome the hard knowledge of each and one of the aircrafts from the simple commands to the advance ones. Need to put some hours in it. need to have proper equipment since track ir5 important need to have a proper joystick. overall top game and with the new update arriving soon awsome sim ever made. Fly Safe",
            "review_score": "1"
        },
        {
            "review_text": "A few of my friends have been playing this for a while, and I've been dying to get it. I recently built a decent computer and decided to take the plunge into throwing hours of my life at the screen. I bought the F-15 module just to try it out, and although disappointed the F-16 has not been modeled (Yet), the Eagle is a stellar combat platform. Coming from a background in civil aviation and being type rated on Cessna 172XP, I can vouch for how realistic the flight model feels. It really (to the extent that my controls can convey) feels like you are being buffeted by wind at low speeds, you can 'feel' the aircraft as is starts to lose lift, and after a few hours you start being able to read the aircraft, when it is about to stall, the best roll to turn, AoA for climbing at the edge, you become one with the aircraft. Switching from one plane to another really throws your head for a loop. They've really got the effect of feeling what the aircraft is doing damn near perfect. I don't think even FSX models ground effect as realistically (read: scary as F***) as this game does. It truly is a simulation. Pull the stick back and cut the throttle, as the aircraft starts to shake and the wing starts to dip, adrenaline kicks in. It is unreal. I've never gotten such a physical response from a game before. The weight of the weapon and fuel payload is completely dynamic. I found myself flying touch-and-go landings for hours, working towards getting my glide slope and flare *just* right, only to restart and realize my pitch angles and approach speeds had to be entirely different from when I ended the last time, due to being fully loaded again.   This is not a game you can pick up and start dominating in within a few minutes. You need to dedicate hours upon hours learning the airframe you want to excel in, and stick to it. It will frustrate you, it will make you never want to hold a flight stick again, but once you get your first kill, or the first time you successfully take on fuel from a flying tanker, the amount of excitement you feel is incredible. Getting sweaty palms from holding the aircraft perfectly in formation so as to not get a fuel boom in your turbine is great. Getting a radar contact at 80 miles, and have to watch his blip get closer and closer, until finally entering the weapon effective range had me on the edge of my seat. I find myself running through my last sortie in my head while I'm at work, thinking of what I could have done differently, better tactics to use, strategies to try. It is amazingly addicting.   I've logged 14 hours over the last few days, and I see myself putting in quite a few more late nights, flying hundreds of sorties. I haven't even delved into the online world yet. I am hesitant simply because I know there are thousands of people online who would make me look like I've never even flown a paper airplane before, and I don't want to make a fool of myself. Yet. :)  I think the only downside to this simulator is quite simply how steep the learning curve is. I'm sure there will be quite a few people who can't take off, get angry and say this game is broken. Take it slow, do the lessons, and most importantly, READ THE MANUAL! Yeah, most of them are close to 200 pages, but like I said earlier, your first kill will make that completely worth it.  I would highly suggest that if you are an aviation fanatic, like a challenge, and want to get as close as you can to pushing the throttles to the forward stop in a variety of combat aircraft without joining the military, get this game. I can only sit back and wonder how they are going to improve DCS:W in their second iteration, because from my perspective, the mechanics of it are spot on.",
            "review_score": "1"
        },
        {
            "review_text": "This is not a game. This is a way of life",
            "review_score": "1"
        },
        {
            "review_text": "If you are interested in military flight sims why not take a look at DCS World. Considering its free you can try it and realise first hand how hard it is to actually jump into an aircraft and figure out whats going on.  DCS World also includes a mission editor much like Arma 3, fully customizable and scriptable.  Great study sim for the experienced, or even causal flyer who want to sit up in the air. Would recommend the A-10C module (DLC)  Beautiful game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a Sim not for those who simply want to jump in and fly arcade style.  On my computer I can only run it at MEDIUM settings and get arroung 17 - 20 FPS it's playable but I've only played free flight and some of the training, so not sure how it would go with more happening.  My specs: Windows 7 Home Premium (64bit)SP1 Intel Core i7-2670QMCPU @ 2.20GHz, 16GB Ram, Nvidia GTX 560M 2GB  I have a few bugs when I first try to load it up it tends to freeze running 'Task Manager' (CTRL ALT DEL) then going back into the game without closing it down seems to get things going. I have no idea why that works.  There is a very large learning curve involved here with so many keyborad combinations and my old Microsoft Sidewinder joystick really is not up to the task, if you are serious about this sim you will need a decent joystick to fly with.  Personally I enjoy games that are much simpler to fly IE Wings Of Prey but that is just me.  I can see there is a lot of entertainment to be had with DCS, especially if you team up with some friends.  In conlusion. Yes it's a great game. Lots to remember, decent computer to play a full graphics.  Will I play it? Most likely not. To much else around offering the simpler game play I enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Great sim, especially if you are into military aviation. Lots of modules, lots of content, and lots of time spent in manuals trying to figure out what the hell that random switch does.  Go try it, you have nothing to loose. Hundreds of hours can be spent mastering the Su-25T alone. Have some fun, you deserve it.",
            "review_score": "1"
        },
        {
            "review_text": "Great 'hardcore sim'. A simulator without compromises. Spent 100 bucks for the modules and 700 bucks for hardware (Joystick, Rudders, TrackIR..) Would do it again 10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "I love this game! Has great damage models and the best AFMs I've ever seen. There is no other combat flight sim. out there that you can compare to DCS with it's new Engine that's soon to come only the skies will be the limits to this simulator with amazing planes and helicopters to come out in the future there will be endless amounts of knowledge to learn it takes time but when you shoot down that first f15c or su27 you nearly jump out of your chair with excitement. see you in the skies...",
            "review_score": "1"
        },
        {
            "review_text": "Used Autopilot on landing  99/10",
            "review_score": "1"
        },
        {
            "review_text": "Started flying. Hit A on accident. #thxbasedautopilot Turn auto pilot off and start flying. Make some turns. Attempt to make a sharp turn. *SCREEN GOES BLACK* Wtf, did I crash? Yup. Passed out from G Forces  10/10 would pass out again.",
            "review_score": "1"
        },
        {
            "review_text": "Great sim, but I'd recommend downloading the version from their website. More deals, and not all planes are sold on steam.",
            "review_score": "1"
        },
        {
            "review_text": "If you're into combat flight simulators look no further. DCS offers a chance to step into a legendry aircraft with unparalleled precision and accuracy true to its original design. Granted you may be reading a book for about a month until you're at a minimum proficiency with the aircraft but the payoff is worth it. The sense of achievement that you get when you learn any of these aircraft is amazing as it's not just a case of pumping the throttle to maximum to take off like other plane games.   The future is very bright for this simulator as it is ever growing with more developers creating different aircraft for different theatres of war i.e. WWII / Korea / 80's/ Modern.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome simulator... do yourself a favor and get a set of X52 Saitek Pro's and TrackIR, it is an amazing experience!",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun to play if you have nothing to do. This game is fun without haveing to buy any of the planes. The tutorial are all a little hard to understand but once you play a while you will get the hang of it.",
            "review_score": "1"
        },
        {
            "review_text": "A very good Simulator. It has no meaning without Joystick.It simulates the real Dogfight. A must to buy for ppl who like simulators .",
            "review_score": "1"
        },
        {
            "review_text": "this game is perfecet ....  ",
            "review_score": "1"
        },
        {
            "review_text": "Not only aviation, you can take command on ground forces. Driving tanks and fire from the tunguska! And you can be a General! Controlled every unit at a battlefield. Super Realistic simulation and grand strategy wargame. Honestly, too much work needed for perfect gameplay as strategy.",
            "review_score": "1"
        },
        {
            "review_text": "This is a highly detailed SIMULATOR more then a game. if you want the simples of cockpits then the FC3 is where it is at with the F-15 or SU-27 and A-10A, if you want that full on clickable cockpit then the other modules is where its at but there is a large learning curve like about as close to learning to fly/operate the real thing as you can get.",
            "review_score": "1"
        },
        {
            "review_text": "expensive as hell, harder than hell to set up an learn, one hell of a game when you get it working.",
            "review_score": "1"
        },
        {
            "review_text": "It is the most realistic air combat simulator game.(my opinion)",
            "review_score": "1"
        },
        {
            "review_text": "Very detailed sim and a joy to fly using a flightstick, a big drawback is the inability to skip the guy talking or to restart the tutorial, so every time you fail you have to sit through ten minutes of talking again.",
            "review_score": "1"
        },
        {
            "review_text": "Very, very realistic and detailed flight simulator. Been playing it for about 2-3 years, just recently got it on Steam. I recommend most people to at least try this game, as its free and you get the SU-25 to start with, which is actually really fun to fly after you learn it. If your not a big, 'Flight - Simmer', you can always get the Flaming Cliff 3 pack, which is more arcadey. This is by far on my top 3 favorite simulators list. Always a joy to play and have fun in.   If you end up trying the game, I highly recommend a joystick, or else it wont be as fun. Track IR as well, but only invest in that stuff if you really enjoy the sim.  10/10, Excellent Simulator!",
            "review_score": "1"
        },
        {
            "review_text": "The most fun you will have learning proceedure to fly a plane. And then learning to do it damned fast.  Also not over-G'ing the Sabre. That tends to be bad for everyone.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, its free too so why not just give it a try. however you will want a joystick or yoke to play this game and the planes may be a little bit expensive they are definatley worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Takes some time to get used to and master it.....but its all worth it ! The pvp kills of all type (CAS , dogfight ) all feel so rewarding and dont forget this is the best military fighter jets simulator",
            "review_score": "1"
        },
        {
            "review_text": "A true flight sim for any pilot enthusiest, especially if you are considering a military career. this isn't a game that u just jump into and expect to start flying. you need a basic understanding of flight instruments. if u get an add-on with a clickable cockpit, you will have to spend hours going through the training courses just to know how to start and operate the aircraft systems. you really cannot claim to master any aircraft without putting at least the standard of 40 flight hours into each aircraft. The sense of accomplishment as u struggle with one apect, then turn it into an easy task, is what keeps me playing. When u get that perfect 3-point touchdown with the p-51, then start doing it over and over, u really feel like its a major acheivement. At this point, i only have 50 hours on the game, and i still feel like a noob. im very confident with the p-51 now and ill be going into the A-10 add-on next. As to physics, i cannot say whether they are absolutely realistic or not, but i am highly impressed. If u put the time into the game and really try to learn how to fly, thats when u get the entertainment factor out of it. It greatly helps to buy a dlc with clickable cockpit also and i will tell any pilot enthusiest to get this game. ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing simulator. There is nothing like it on the market today. Takes a lot of buttons, time, and effort but it's worth it once that first Hellfire hits it's target 8km away. :P",
            "review_score": "1"
        },
        {
            "review_text": "Hello, this is my DCS World Review ^-^  Before I get started, I am a huge jet and ww2 aircraft fan This game puts my Knowledge of aircraft to shame  Pros:  Super realistic damage and flight models  Active players  Beautiful graphics (even on low, as my computer isn't the best I run it on low)  Updated often  Legendary planes such as the Bf 109, P-51, Fw 190, F-86, MiG-15bis, MiG-21, and even the F-15  Cons:   Optimization could be better  Very steep learning curve  Confusing tutorials  Prices for extra aircraft are very expensive  Pull 1G in the Su25 'Frogfoot' and get complained at in Russian   Requires lots of patience, time and effort  Practically requires a joystick  All in all, amazing game, if you've got a beast computer, I highly recommend this game!  9/10 would rip my wings and catch fire immediately in a Tf-51 (P51D ground attack variant)",
            "review_score": "1"
        },
        {
            "review_text": "DCS was a rocky start for me, but once I picked up a cheap Joystick I got hooked.   I've racked up most of my hours from this summer alone, Everything from Flaming Cliffs 3 to the Ka-50 Black Shark and the classic A-10 with so much more content on the way. If you like Military Flight Simulators this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Really good flight simulator if you have a controller but I don't have that.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. The simulation is precise, Must have things: Mouse for interactive cockpits, Joystick, Rudder pedals(for helicopters), Keyboard for Flaming cliffs 3, beast pc.",
            "review_score": "1"
        },
        {
            "review_text": "Very realistic simulation and a lot of fun once you get the hang of it. Expect to spend atleast 40-50 hour on just learning the basics though! Even more if you are not used to combat sims.",
            "review_score": "1"
        },
        {
            "review_text": "Aesomely realistic. You can't get more fun out of a modern day flight simulator than this. Although the multiplayer doesn't have the biggest community, it's still a blast, and really, watching your missile blast an enemy aircraft apart is simply . . . awesome.  The free version with the Su-25T attack jet is fun, and if you can pick up Flaming Cliffs 3, well you're all set. Fighter jets make DCS way more fun.  The fighters are quite realistic, even if DCS only calls FC3 a 'mid-fidelity' sim. The F-15C, Su-27 and Su-33 Flanker are a blast to fly. Launching missiles from over 10nm away from the E/A is just so satifying, especially for a veteran of WWII sims. Speaking of WWII sims, DCS is releasing DCS: WWII soon, starting with the Fw-190 D-9 this August, and adding the Bf 109 K-4, Spitfire Mk. IX, and P-47D soon after. The WWII Normandy theatre map is getting released in Q1 2015.  Download this sim, and remember, the additional modules are all the fun.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, very hard being a simulation but I enjoy it a lot.",
            "review_score": "1"
        },
        {
            "review_text": "after many hours of playing on bolth my accounts i have learned the following  if you ever step foot in a plane you WILL explode  11/10 would bang",
            "review_score": "1"
        },
        {
            "review_text": "10/10 for the A10C i am currently flying",
            "review_score": "1"
        },
        {
            "review_text": "Best graphics of any flight sim ive played. Good game but takes a while to learn controls etc.",
            "review_score": "1"
        },
        {
            "review_text": "it is an amazing flight sim  also give me the best options to maximize my flight xperience. ",
            "review_score": "1"
        },
        {
            "review_text": "it is an amazing flight sim  also give me the best options to maximize my flight xperience. ",
            "review_score": "1"
        },
        {
            "review_text": "The Ultimate combat and flight simulator. Very happy I purchased.",
            "review_score": "1"
        },
        {
            "review_text": "TOP GUN",
            "review_score": "1"
        },
        {
            "review_text": "Nice Sim game. go into a server taking off ram by a humvee front wheel destroyed plane on fire eject pilot got rekt by the humvee 10/10 will do it again  and... the best community player, not like CS:GO we're going 5v5, on a PUBLIC server and then they ask me to become the leader, so I agree... we take off together and really really really play strategic when dogfighting, not like csgo they always have a c*nt teammates. and of course, im the first to die.. i said im sorry, and they said 'no, we're sorry for not keeping you alive' damn thats a very nice community, and when I said fallback or split, or do some high G manouver, they listen!!! very nice community 10/10",
            "review_score": "1"
        },
        {
            "review_text": "one of the best realistic simulation game",
            "review_score": "1"
        },
        {
            "review_text": "Unless you have deep pockets, this game is a no-no for you.",
            "review_score": "1"
        },
        {
            "review_text": "THE combat sim. If you like Sims, download this ♥♥♥♥ right now.",
            "review_score": "1"
        },
        {
            "review_text": "I am just drooling being able to fly in the helis and planes, in the game.   I am no pilot, no nothing, but just flying in DCS makes me feel good! I am not really sure whether it's realistic or not (well it is harder to fly and plenty of things to take note just to fly, so I guess it's more realistic than the others.), but how each plane is structured to its details just makes the whole game/sim really cool.  Note: Not for those who wish to get on and just fly. (You can with some of the planes but even then, you won't start doing really special things in an hour or two. You might even have trouble landing even after 1 week, depending on how good you are. At least I am more on the casual side.)  Don't follow my steam time here.. I switched over to use the official launcher for the game.",
            "review_score": "1"
        },
        {
            "review_text": "Super steep learning curve, but incredibly rewarding once you get it right. Other than a couple tutorials, there is almost no hand-holding at all. I wish it were a bit easier to play through, but can't really blame the developers as this is a 'simulator' more than anything.  I played most of this in VR on the Vive; and is the closest I've come to the experience of flying in real life from any game. The translation of the interface to VR has much to be desired, but can easily be overlooked by everything else that shines in this game.",
            "review_score": "1"
        },
        {
            "review_text": "tfw cant get off the runway this game makes me feel dumb, and hterefore i dont like it myself but it makes me feel dumb because its so ♥♥♥♥in simulatory  so if that's what you want then this game should be dope as hell",
            "review_score": "1"
        },
        {
            "review_text": "I love the game and the F.86!!!&lt;3",
            "review_score": "1"
        },
        {
            "review_text": "  Love it, insane realisim and graphics but my computer is to rubbish to run it ):",
            "review_score": "1"
        },
        {
            "review_text": "The best combat flight simulator iv'e ever played, This game is absolutely amazing and completely immersive, my suggestion is, Get the game, Buy all the DLC's and get ready to have an epically great time, this game is my absolute favorite !!!!",
            "review_score": "1"
        },
        {
            "review_text": "good game but the aircrafts is old",
            "review_score": "1"
        },
        {
            "review_text": "exilent flying simulator.",
            "review_score": "1"
        },
        {
            "review_text": "Great game its like a better version of the Janes USAf. Love the sound affects I just wish they had made the cannon on the A10A just a little bit more POWERFULL! Did a straifing run on a tank 6 times and the tank was still alive",
            "review_score": "1"
        },
        {
            "review_text": "My head hurts",
            "review_score": "1"
        },
        {
            "review_text": "I've Played lots of Airplane Simulators like FSX, Microsoft Flight, X-Plane 10 and Nothing beats DCS World even though you have to Buy the planes individually I find it worth the Money. the Wings flex, the weapons work like the real thing. I really felt like i was in the plane. If you Love Flying and are looking for something that Feels Real I recomend this to you!",
            "review_score": "1"
        },
        {
            "review_text": "Best flght sim game known to man kind.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best vehicle sim out there.  Don't expect to get in and just kill , learn your vehicle and use the right stuff Joystick is a must.  Overall 9/10  ",
            "review_score": "1"
        },
        {
            "review_text": "when are the 70% sales i go chcek steam on the day and time there suppost to happen and there not here... ?!??! please help :( says it sends thusday at 10 am",
            "review_score": "1"
        },
        {
            "review_text": "If I had one word to describe DCS it would be rewarding. You start off knowing nothing but eventualy with a lot of studing you start to figure things out, you learn how to start the aircraft, how to fly them, how to fire weapons, and how to dodge missiles. This game is not for the faint of heart though, you have to study ALOT for the more detailed aircraft in order to even be able to get off the ground, but if you dont mind studying and you love flying I would suggest you try this game IMMEDIATLY.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but lacks f-22",
            "review_score": "1"
        },
        {
            "review_text": "It is an amazing military flight combast simulator.  If only I could just fix the settings so it wouldn't lag on my computer.",
            "review_score": "1"
        },
        {
            "review_text": "Games very beautiful but I have a problem which is of me out when I play and when I play Alaah saliva others operate and there is no problems",
            "review_score": "1"
        },
        {
            "review_text": "Great game good physic engine and over all an amazing game great graphics and good combat",
            "review_score": "1"
        },
        {
            "review_text": "it wont work for me, it alway says DCS world.exe stopped working? ",
            "review_score": "1"
        },
        {
            "review_text": "Best   Combat   flight sim",
            "review_score": "1"
        },
        {
            "review_text": "This game without a joystick(trackir optional)will make you kill yourself....at first, before I had a Hotas X ($50.00) and trackir ($100-$200) I did the tutorial on how to fly it sucked but the reason it sucked was becase the controls for a keyboard are ♥♥♥♥, I changed the keyboard controls and learned to like the game with the keyboard, now I certainly would not say it's better then a joystick as a joystick has very precise movement but if you think you ABSOLUTELY need a joystick and trackir, you dont. If you do plan on downloading the game. I would recommend the $10 for the F-15C one of the easiest planes to fly with a keyboard it's also faster then the SU-25T and TF-51D (F2P P-51)",
            "review_score": "1"
        },
        {
            "review_text": "Great game with amazing combat and flight simulation. Haven't gotten around to purchasing DLC yet but it is an amazing game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Not that bad but u might need a joy stick ",
            "review_score": "1"
        },
        {
            "review_text": "I cant quite get this thing to fly straight, things are beeping at me, I can only fire 3 weapons and only 2 go remotely where I want them to, and I love every minute of it.",
            "review_score": "1"
        },
        {
            "review_text": "Great Flight Sim, and it's free without the add-ons which you don't need too terribly.",
            "review_score": "1"
        },
        {
            "review_text": "Best Walking Simulator i really enjoy taking strolls through the land of georgia",
            "review_score": "1"
        },
        {
            "review_text": "DCS: A10-C is Best flight simulator out there.",
            "review_score": "1"
        },
        {
            "review_text": "two words TOTALLY AMAZING ",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game for 4 months, it was great untill i got a problem .. now i cant start the game i dont know whats the problem",
            "review_score": "1"
        },
        {
            "review_text": "spent 30 mins practicing taking off with my friend just so i could accidently shoot him down. i love DCS",
            "review_score": "1"
        },
        {
            "review_text": "It's a REALY REALY good game................. But.......... ♥♥♥♥ MICROTRANSACTIONS!!!!!!!!!!! THIS IS THE MOST EXPENSIVE GAME IN THE ♥♥♥♥ING WORLD!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This went from being one of my favourite games, and best flight simulators, to a total mess.  The devs are rolling out updates that just seem to make the game progressively more buggy and unstable. MP servers are dying because of this. Just now, the game ended up using all the RAM in my 16GB system due to a memory leak... It also takes years for every little plane module to be added in the game. I'm guessing the studios doing the devving must be doing it as a part-time or hobby thing...",
            "review_score": "-1"
        },
        {
            "review_text": "DCS is my favourite anime.",
            "review_score": "1"
        },
        {
            "review_text": "This game looks beautiful. (Except for the explosions)  However, why is the DLC so darn Expensive?!",
            "review_score": "1"
        },
        {
            "review_text": "10 out of 10! LOVE IT!",
            "review_score": "1"
        },
        {
            "review_text": "really unrealistic 8.5/Spongebob Squarepants™ Sitck Together Sticker Book",
            "review_score": "1"
        },
        {
            "review_text": "UN MARE CACAT",
            "review_score": "-1"
        },
        {
            "review_text": "Tested on HTC Vive/GTX1080   The ergonomy is terrible, nothing is simple and evident at start, prepare for hours of settings and headeach (I'm used to all the sims available since 20 years)  The flight model are very basic, I had to check three time that I disabled the simplified model and all flight help, I never saw any sim behave like that with the 'complex' flight model.  The demo mission (empty world) run well on my Vive, no problems at all and smooth FPS. But once you start even a quick mission with only a few ennemy I have horrible jerkiness it's unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a terrible game it makes no sense you just choose a vehicle and do nothing except some dumb stuff. But i would not recommend this game. There is $609 of DLC, and why dont you just add the vehicles in without havin to pay? So dont get it, it is a waste of space on your pc.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst user interfaces ever conceived for a game, most certainly. It is completely counterintuitive as far as setting up a joystick goes. This game fails to bring gamers in, and that's probably why it's relatively underpopular.",
            "review_score": "-1"
        },
        {
            "review_text": "I can´t play it.. If I want to start a mission, the game crashes. 'DCS World has stopped working' ",
            "review_score": "1"
        },
        {
            "review_text": "I can not recommend sorry. War Thunder is better for both the beginner and expert. It also has some awesome areal dog fighting.  PROS: -Nice graphics -It does the job as a flight sim  CONS: -Greed. I could never endorse a game which charges over $600 for DLC. I understand the base game is free. However, lets say you purchase the P-51D Mustang. $29.99 invested in the game. Not bad for a flight sim. But for you $30 you can fly 3 planes. Thats it. Pretty poor for a flight sim. Say you want to fly a MIG 21. The game is now an $80 investment. This is simply not good enough. If you want dogfighting go play War Thunder. If you want a better flight sim experience go play FSX or even better...X-Plane.",
            "review_score": "-1"
        },
        {
            "review_text": "very crashy and you cant really change many of the controls",
            "review_score": "-1"
        },
        {
            "review_text": "can't get the game to start, wants user and password but not able to create them in the first place. ♥♥♥♥ program",
            "review_score": "-1"
        },
        {
            "review_text": "This game's a little over my head in terms of detail. The controls allow you to manage far too many different aspects of the plane for my taste. I did finally get the hang of flying, but after trying and failing to arm and use my weapons for the 30th time, I know this game is not the one for me. Maybe I'll try again sometime when I have some hours to memorize the keys and their modifiers, of which there seem to be a couple hundred.  This is not a game for simple people like me.",
            "review_score": "-1"
        },
        {
            "review_text": "very buggy too complacated",
            "review_score": "-1"
        },
        {
            "review_text": "I can't even play the game, when I click any button that would take me to the gameplay, it hides the window and tries to open another one and steam won't allow more than one instance of the game run so it takes me back to the home screen! How do you guys even play this!? HELP!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just simply Flamming Cliffs 2, with better graphics. Some of plane models are low-poly ones that were simply taken from LockOn. Basically flying other planes requires buying another pack, this game is certainly not for me. If you wanna fly planes with a bit worse graphics, get Flamming Cliifs 2 - costs as much as 1/2 of plane pack.",
            "review_score": "-1"
        },
        {
            "review_text": "absolute waste of 50 bucks ive been playin heli sims for years and this is one of the crapest games ever buyer beware",
            "review_score": "-1"
        },
        {
            "review_text": "I downloaded and attempted to run this game with the occulus rift. Boy was that a mistake.  The menu and HUD ignore head tracking, so you can't rebind any of your keys, or even see what they are already bound to because your eyeballs are not meant to see and read text at the very top of your vision. You were meant to move your head so that it enters your field of view.  The game itself is completely unplayable in VR. Everything has its own complicated keybinding ( Ctrl + Shift + Del = turn on power, F5 + num9 + roll your face on the left half of the keyboard is turn power off)  I'm sure plenty of basement dwellers enjoy that kind of immersion but it is COMPLETELY IMPOSSIBLE while you are wearing a VR headset. Why? Because you cannot see the keyboard to execute the overly complicated commands. Duh.  Maybe this is a revolution in gaming. I will never know.  Don't bother with this if you were hoping for an engaging VR experience.",
            "review_score": "-1"
        },
        {
            "review_text": "DLC's cost to much, controls are WAAAAAAAAAAAAAAAAY to diffiult not original flying buttons AT ALL. i mean ♥♥♥♥ing pg up and down to accelerate and decelerate? u try flying with those. turning you need to use ♥♥♥♥♥♥♥♥ buttons that you never ever use. just about everything requires Shift R or whatever. way to compicated. do not waste your internet on this ♥♥♥♥. jesus crist calm down in the comments. just my opinion sheesh",
            "review_score": "-1"
        },
        {
            "review_text": "The game crashed when I open it! I have i3 16 GB RAM and Nividia GTX 660",
            "review_score": "-1"
        },
        {
            "review_text": "this is a really hard game!!!",
            "review_score": "-1"
        },
        {
            "review_text": "My plane crashed",
            "review_score": "-1"
        },
        {
            "review_text": "can not get dcs world to launch so i have lost my money via steam and steam do not answer my problem ,this is not the first time I have had a problem when i have purchased a game and then I could not run it and have lost money so I think I will quit Ateam forever",
            "review_score": "-1"
        },
        {
            "review_text": "The game looks beautiful in VR, the feeling of sitting in a cockpit ready to fly is awesome... but sitting is all you can do because you cant see the keyboard to hit the thousands of correct keys to get the plane off the ground and the partial controller support isnt enougn to even get though the training",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't been able to get this game to work in two years!",
            "review_score": "-1"
        },
        {
            "review_text": "This game consists of image ! They talk about reality but full of errors.Ai flying with russian su25 at 150 knot but my plane crashs at same speed.F15c landing ILS system shows airfields position completly wrong.İf you fly with A10A your wingman when RTB , load weapons and second take off wingman crash all time no reason.When fly with Su-27 in hard maneuvers engines stop.5 bought module, even though they mislead even a single question.I feel sorry I gave you money.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is really good.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks youo get nothing and need to buy everything. DO NOT GET THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics is good. Bad joystick support. Atleast 3 of the DLCs are in beta but are being sold at full price",
            "review_score": "-1"
        },
        {
            "review_text": "flanker 2.0 was better than this. the UI is horrible and feels as the rest of the game mindlessly thrown together.",
            "review_score": "-1"
        },
        {
            "review_text": "i cant even fly the helicopter it wont let me use the pratcies at all $15 for this crap. im upset it will play the videos but wont let me train on how to fly it. i want it fixed. dont get this game",
            "review_score": "-1"
        },
        {
            "review_text": "This game was a complete dissapointment. Took over night to install, which is fine because I thought it would be worth it. I load up the game and I press training as i am completely clueless of what the controls are. Then it kept throwing back and forward trying to load the first training mission, in which it crashed 6 times. Finally I got onto it only to find that the graphics were poorer then expected and the control of the plane was shocking. Eventually I got the hang of controlling the plane. In which I finished the first tutorial and decided to do a quick mission. I go in to the mission only to find that none of the controls that I was using on the training actually work anymore. So I had to see what the controls were to fire up the engines. But no there was to many controls to even find what i was looking for. Eventually I found it only to have the game completely crash and forcing me to close it. I launch the game up for the last time to give it another chance. But then I notice that you have to pay money for other planes (or should i say another 'PLANE') So I then pressed campaign only to wait 20 minutes before it crashes. What a painful and annoying experience. I thought this game was going to be the next better Combat Flight Simulator. But no its the next money making World of Warplanes. Definately not worth the wait for this lifesucking game. Uninstalled*",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game ever! I love Reasearching about planes! ww2 planes and jets! But this game will only good for those nerds that never ever played a proper game/simulator before! This game is like a slow motion effect on the steering! When i go down and pull up its like if the person cant even pull the handle! it takes him about 10 second to only pull up the handle to proceed with your manuever! I personally play a lot of simulators and never was as sad as this! It not only wasted my whole day (after school) but also made my computers resolution become 2x less and made my esc button stop responding making it impossible to quit the game! This game made me very sad beause i wasted my whole freaking day downloading then realizing that this is a s***y game! i will give a 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "A horrible game, when it loads, and when it doesn't you can't close or tab out.",
            "review_score": "-1"
        },
        {
            "review_text": "Far to complicated for the average person, you have to be ♥♥♥♥in trained like a pilot to work out some of the ♥♥♥♥ on this flight sim. Graphics are poor as well.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate pay to win. Personally, I’d love to pay money for a game upfront and then get the entire package. Unfourunetly, this is not quite the case with games nowadays. It's become the norm to release a game for “free”, only to find that once you download the game, you are unable to use many features within the game unless you pay a premium.  This applies to DCS World.  The simulator I played prior to this had been War Thunder. The key difference between War Thunder and DCS world is that War Thunder features aircraft from World War Two, whereas DCS World seems to focus on the modern era.  The main reason I stopped playing War Thunder was because of the horrendous “pay to win” style of the game. I was truly excited about trying out DCS World, but my excitement was shattered as soon as I saw how much the aircraft packages cost.  For a moment, I put this aside. DCS World comes with two free aircraft, so I gave the SU-25T a try. I loaded up the “target practice” mission. A helicopter spawned somewhere infront of me, so I thought that it might be a nice idea to shoot it down. But, no matter what I did, I couldn’t get my weapons to fire. So I went to the internet to try and find out what was wrong.  So, I look online, and I find many different guides on how to fly the SU-25T. I open up a YouTube video and I look at the duration of the video; 20 minutes long for part 1/10! So not only do you have to pay a premium price for the planes in this game, but you have to spend hours just learning how to fly a single aircraft. I would be okay with this if the developers added a tutorial, but they seem to be too lazy to do this.  I am truly sickened by this product, and I am getting very tired of these cooperations taking advantage of their customers. Steer clear of this game, if you are looking for a free to play aircraft simulator, give War Thunder a try (if you can put up with the pay to win crap).",
            "review_score": "-1"
        },
        {
            "review_text": "This game was so plain and it was hard to control the plane! I was very disapointed in it!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "horrible game. dowload dora the explorer instead.",
            "review_score": "-1"
        },
        {
            "review_text": "bad. crashes during loading screen on any and every mission.",
            "review_score": "-1"
        },
        {
            "review_text": "Take a pass on this one.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS GAME IS TERRIBLE no further explination needed",
            "review_score": "-1"
        },
        {
            "review_text": "Not a video game - it's a game where they make it so hard to fly that unless you are doing it as your day job you cant get off the ground. The training is a joke as well.",
            "review_score": "-1"
        },
        {
            "review_text": "a good game for RPG players in to planes",
            "review_score": "1"
        },
        {
            "review_text": "This is the free taster module that Eagle Dynamics are offering around, and as free samples go, this is a big one. All the functionality of the paid modules is included, with HOTAS and TrackIR 6DoF support. You get hundreds of square kilometres of terrain in this package, and access to one plane, the Su-25T. This is an updated version of the Su-25 (also available as DLC, £11.99 as of writing) with an incredibly wide range of potential loadouts for almost any sort of mission. The bundled editor lets you set up your own missions and weapons loadouts, or you can just jump straight in with the ready-made flights.  Of course, the reason that all of this is offered up for free is to get you hooked, there are many other flyable aircraft available for a price, with two distinct levels of complexity. The free Su-25T is the lesser of the two, which slightly reduces depth and immersion, but greatly increases accessibility. Also available as DLC at this level are the A-10A and Su-25, both competently designed CAS aircraft. If you want to take things up a notch, then there is a selection of aircraft with full cockpits that take many hours to learn. Furthermore, there is a DLC that allows you to control ground units including tanks and JTACs for guiding in airstrikes, if that's what floats your boat.  In conclusion, this is certainly worth the effort to learn about, if you are willing to put that effort in. For the action junkies, there is a ‘game mode’ that puts the training wheels back on and just lets you have fun, so pretty much anyone can enjoy this product, at whatever level you choose!",
            "review_score": "1"
        },
        {
            "review_text": "Very detailed, very realistic, and very rewarding. Can be a bit frustrating at first, but it is very much worth it to put in the time.   10/10 game, best sim i've ever played",
            "review_score": "1"
        },
        {
            "review_text": "Good FPS, good game quality (Graphics) Love the style of the planes, love how it embaces WWII plane sto the present day into the game. good to play and easy contorls.",
            "review_score": "1"
        },
        {
            "review_text": "Hello ...  Nice - One of the best Combat flight simulation (Combat flight simulator) (and more) up till 2015 .. . (and it's getting bigger and bigger)  Best Greetings Balmer1   Switzerland",
            "review_score": "1"
        },
        {
            "review_text": "My very first steam . Lurning curve is more like learning cliff but I love it !",
            "review_score": "1"
        },
        {
            "review_text": "This game is great for anyone looking for realistic combat flight simulators. With the DLC the number, and type of planes are almost limitlss!",
            "review_score": "1"
        },
        {
            "review_text": "The most realistic simulator out there. Make sure you have flight control sticks to play this one guys (I use Saitek X52). Rudder pedals would also be nice. This game has it broken down to a multitude of buttons that are confusing, but setting up the sticks to the more important ones works fine. Very tough, but very realistic. Fly around in A-10 Warthogs, Hueys, P-51D Mustangs, and even play as JTAC.",
            "review_score": "1"
        },
        {
            "review_text": "The DCS series are the best combat simulators out there, and this module is free so you've got nothing to lose. Don't be scared, you might have seen those A 10C startup videos and thought that was too much for you but there's a series of aircraft with simplified systems that are super easy to srtat flying (you start them pressing two buttons) but hard to master.   The world module is a perfect initiation in the DCS series as it offers those two experiences, the Su 25T has simplified systems while the TF 51D features all the real aircraft systems and clickable cockpit. If you are interested in the Flamming Cliffs 3 DLC I recommend learning to fly the Su 25 as it is a similar experience and of course if you are interested in the P 51 or the other WWII fighters try the TF 51.  My only complain would be some of the training missions for the Su 25T (the TF 51 doesn't have), they are very low quality videos from FC2. This isn't a big deal because it does feature a lot of interactive training missions, but the FC3 DLC planes only have those low quality videos which are a bit of a pain to watch. The rest of modules I have (A10C and P 51D) doesn't suffer from this and come with lots of step by step training missions.   Couple of suggestions:   - Play with a HOTAS or at least a Flight Stick, a gamepad works but it's not recommended.  - Do the training missions and pay attention, it's easy if you follow the instructions.  - Start with the Su 25T, flying the TF 51 requires experience.  - Create your custom keybings, mapping whichever buttons you feel you are using more to the Joystick.   - At the begining you might feel overwhelmed by the controls, focus first on flying the aircraft and leave the weapon systems alone until you can take of, land and navigate without problems.  - If you still feel this is too much, theres a GAME MODE under options, which gives you arcade style controls and radar, check the manual for further instructions on how to use it.  Overall amazing sim, 10/10 would crash again.",
            "review_score": "1"
        },
        {
            "review_text": "Great sim combat game. Needs somes hours for tweaking / optimization. A must to play A-10's with HOTAS warthog from thrustmaster !",
            "review_score": "1"
        },
        {
            "review_text": "DCS made me realize that I'm not hardcore enough for DCS. True story.  It suffers from all the usual simulator stuff- Absurd learning curve, a real need for serious hardware (trackir, a good stick and pedals and perhaps a throttle quadrant, maybe even a switch panel.) and a somewhat cold/clinical feel.   But, if you want to experience any of the modeled aircraft, and I mean experience, it's the best thing going right now. If you NEED to know how, EXACTLY, to crank over the V1650 Packard Merlin in a P-51D, or how to kill a T-72 with a Maverick AGM, this is pretty much how to do it.  Flaming Cliffs is a little simplified, the individual aircraft DLC's are hyper detailed. Give it a shot if you like sims.",
            "review_score": "1"
        },
        {
            "review_text": "The most realistic combat simulator in the world from the authors of Flanker, Lock On and professional simulators (during the Soviet period), now with almost High-End graphics, clickable cabins and still more advanced flight models. What's more to say? 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game, real fight and flight experiance Make sure your computer has met with the specs before buying though or it will be very laggy",
            "review_score": "1"
        },
        {
            "review_text": "DCS sets the standard for air combat simulation on a level yet to be duplicated. Plus, you can fly the extremely rugged Su-25 Frogfoot for FREE. What's better than free?",
            "review_score": "1"
        },
        {
            "review_text": "my pc cant run this even on lowest settings but great sim",
            "review_score": "1"
        },
        {
            "review_text": "One of the best flight simulation games I have seen.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutly astonishing the game only keeps getting better. Despite the fact that the game runs on a 10 yr old engine it is really fun but do not let this deter you, a completely new engine is coming out for this game in a few months with better performance,graphics, and physics.",
            "review_score": "1"
        },
        {
            "review_text": "help me 10 hours later I have mastered the art of take off and flying for a few minutes. Tried to do a combat mission.I exploded.",
            "review_score": "1"
        },
        {
            "review_text": "Initially you'll spend most of this game on runways. Because there is no such thing as saving. But it's possible to get used to it.",
            "review_score": "1"
        },
        {
            "review_text": "DCS World is that kind of game where you have to press every button in order to properly fly or move. It's not that kind of game , where you hop in the pilots seat and start up by pressing a button, and shoot some guys down. Its way different. in my opinion is the best flight simulator(except those ♥♥♥♥♥♥ DLCs, where you pay for planes. Yes, you heard right).   PLAY THE GAME. 9.8/10",
            "review_score": "1"
        },
        {
            "review_text": "Awesome but too hard for me  10/10 Who likes hardcore flightsimulators just get it!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, with a lot of knowlage around the whole essence. I don't have good PC tho so I have trouble to play it but it's not the game's fault. IF YOU WANNA FLY (not like in War Thunder &lt;pfff&gt;) LIKE A TRU ♥♥♥♥IN PILOT buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best combat flyight sim ever",
            "review_score": "1"
        },
        {
            "review_text": "DCS World is, at least in my opinion, the best (combat) simulator out there.... It has so much variety, os pretty realistic and is all in all still a complex and very enteraining game in its own way. Even though the game has a very flat learing-curve, DCS World has a wide-spread community of people who are ready to help you learning this game due to YouTube Tutorials, via forums or just through the in-game chat function. Talking about a chat function the game has, for a simulator, a very good multiplayer where you can fly PvP, PvE, Coop,(...) missions or just join a squadron where you can enjoy this game with other players. Due to all that complexity ( and one of my favorite part: clickable cockpits) i can easily forgive the developers for having a DLC-driven policy ( the game itself is 'Free To Play' !!!). To play this simulator I heavily reccommend using a HOTAS Joystick (' Hands On Throttle And Stick') because you will not come really far by just using your keyboard. On thing i learned is that the community in this game is very mature so there are almost NO Trollers nor Flamer.  I really hope the community of this game will keep expanding ( as the game is further developed) and that i can see some of you in the air...",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, requires a joystick, some friends who know this game, and a brain.",
            "review_score": "1"
        },
        {
            "review_text": "Game is great. DONT :stop: Donwload it on steam! DONT DONT DONT! you'll have problems, chashes and alot more ♥♥♥♥ in it! download standalone version of the official  dcs-world.com  ALSO! (its pretty untouched and outdated but still)check out my guide for this game, even you don't really play this game you can read it",
            "review_score": "1"
        },
        {
            "review_text": "As far as sims go, DCS World is currently the market leader, and the best at ensuring that their development model is sustainable whilst delivering incredibly detailed, extremely polished aircraft modules.  Beautiful, beautiful sim.",
            "review_score": "1"
        },
        {
            "review_text": "Hands down the most realistic combat simulation out there. The amount of detail in the A-10 is unmatched.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent reproduction of the A-10C. A-10C is highly realistic and accuarte all the while still being a lot of fun to play and complete missions. I do highly reccomend that you do the training missions and practice sessions as there is a lot of information to learn. Then fly a few free flights just to get used to flying and handeling of this aircraft. Keep calm and BRRRRRT! on!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game to bits. The planes look so real and the controls of the planes are so nice!!! Best Download and a must buy with the addons",
            "review_score": "1"
        },
        {
            "review_text": "I love this sim. I recommend getting a hotas to play with pedals. I use the Saitek X52Pro. Some things to be aware of about the game. There are instructional videos. They take some time to go through. The current map is Georgia. no other maps available until the european theatre comes in september 2014. The next plane will be the mig-21 fishbed.   As far as the DLC goes, something specific. I would not get F15C:flaming cliffs. Just get flaming cliffs. You get 5 more planes for the cost you can get it on special for 40 dollars. Definitely a better value.   The flaming cliffs means that you cannot click the switches/turn nobs/hit buttons around the cockpit and lose some realism. I do defninitely recommend either the flaming cliffs or the p51 DLC's as your first purchase. The p51 is a bit nicer to use. When learning the planes its important to keep track of modes and buttons. I recommend doing this. I stream @  www.twtich.tv/ztokdo  and can help people to get started. Lovikdet6 is really helpful.   This is not an arcade game. Much of the air to air combat is BVR (beyond visible range) so keep that in mind. You frequently are not shooting at planes that you can see. radar makes beep beep, clickity click means a sam is fired at you. You have to learn how to crab/into shift to land in some areas.   Most recently they added more realism with 1.2.7/1.2.8. One of the biggest problems with the game is there are no multiseat aircraft and its not available in modding. The base game is updated about every 2-3 months, so keep that in mind. Its constantly getting more stable and the server play is getting a ton better.",
            "review_score": "1"
        },
        {
            "review_text": "BEST GAME! So much detail but so fun at the same time!",
            "review_score": "1"
        },
        {
            "review_text": "Took me 2 days to learn the basics of the SU25T and 2 more days to finish the first actual mission. Almost destroyed my new joystick in a nerd rage 8/8",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing combat simulator revolving around jets, planes, and some tanks. It introduces an amazing mission creator that will blow your mind away! There is nothing at all bad to say about this game. t also introduces two very decent planes to start with. They each come with there own tutorials on weapons and navigation which helps a ton if your new to the game! I Would highly suggest getting this game because of its amazing features and flexibility to be able to master such an amazing simulation. Every kill feels like success; thats why you should get it. its free and multiplayer compatible and you can join me anytime! Thanks!",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy working out how to operate a complicated machine, this sim will give you hours and hours and hours of head scratching and delving. Just do not expect to kick asses and take names in ten minutes. It takes several weeks (weekends) to get to competency needed to take off, find &amp; kill a target and land. I'm addicted",
            "review_score": "1"
        },
        {
            "review_text": "Spot on for realism. One of the best if not the best flight sims I've ever had the pleasure of trying. The P-51 is truly awesome yet the learning curve may be too steep for some less than simulation oriented players. Great all around so far, Only wish I had more time for the game. Big time must have for plane enthusiasts!",
            "review_score": "1"
        },
        {
            "review_text": "Great Simulator for those hard core sim guys out there! i love DCS for the in depth Military Air Simulation. i personally dont have any of the DLCs at the moment but they're on my To-Buy list!  DSC-WORLD totally worth it! if you have the patience and a knack for a bit of a learning curve and love realisitc simulators DCS is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome in every aspect.",
            "review_score": "1"
        },
        {
            "review_text": "DCS is awesome. I would recommend it to anyone that wants a very detailed and realistic sim.",
            "review_score": "1"
        },
        {
            "review_text": "It's very hard to play and I'm lucky to have a flightstick, but again, what did you expect from such a complete flight simulator?  On this game you can eather go on gaming mode (easy mode) or simulator mode (hard moth#%^@%uking hell). On simulator mode you can control every single button on the cockpit. It's really awesome.   I play Warthunder and if you do too, you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game!  It is incredibly difficult. Not for COD players.",
            "review_score": "1"
        },
        {
            "review_text": "Literally the most advanced combat flight simulator available. Any sim fan needs to give this game a try. Not even brushing up on the quality of the modules (DLC aircraft) that can be purchased after the fact, what's most impressive is what is included in this game for free: an incredibly versatile Su-25T that in many ways triumphs over the ever popular A-10. Chock full with tutorials, training, and a full campaign. A mission editor and multiplayer support makes this sim at no cost at all fun for hundreds of hours.  What's fantastic about DCS World is that you can fly casually, or as hardcore as you want and therefore should not be an intimidating title for those who aren't veterans to simulators.",
            "review_score": "1"
        },
        {
            "review_text": "i ant this game but my brother had to waste all the computer memory ",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, it's complicated at first but after a bit of playing you start to learn it and it becomes really addicting and fun",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. Every detail is so realistic that you can actually read off the status from indicators in the cockpit. This level of simulation is rarely seen in games.  However I have to say that the tutorials of the aircrafts are too brief for a complecated game as such. For example for landing the tutorial only tells you the buttons to press at loading screen but nothing at all when you are actually landing. And for F15C the buttons for throttle is different from those on SU-27. It is kind of realistic but really these should be noted.",
            "review_score": "1"
        },
        {
            "review_text": "you get1 free aircraft but the rest you need to buy  for 10 euro's or 30 per aircraft :( could be cheaper but game is cool",
            "review_score": "1"
        },
        {
            "review_text": "I've only played the Su-25T so far, and have a lot to learn however my initial thoughts are that this is a very good sim for casual or hardcore fans of the genre. The controls are easier than one might expect of a game this size, and you really don't need to spend £500 on equipment to start playing. I'm using a simple joystick and pedals and mouse look enabled and I can easily taxi, take off, kill some tanks and RTB without any issues.  [EDIT] I've bought the FC3 DLC and have taken part in numerous flights within the DCS community. This is by far the best flight sim out there!  [EDIT] I'm thoroughly enjoying DCS. The community is great and this is one of the best flight sims I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Ok. So at first i was like 'this is way too complicated for me' but i pushed through it and learned how to fly the su-25T and i played multiplayer and fell in love with the game. I bought the flaming cliffs 3 expansion and have really been loving the F-15 because of its simplicity, yet complicatedness. I still have yet to try the other planes from the pack though  P.S. Crashed plane into building 9 out of 11",
            "review_score": "1"
        },
        {
            "review_text": "Bug fixed :D great fun :D",
            "review_score": "1"
        },
        {
            "review_text": "i had this game before and really liked it but they have done something to the game and i can no longer download it. i have tried it 3 times now with no luck so i guess i'm out of luck which also means i can't download somw of the new add ons. I suspect it has to do with the vr thing that all the games are going to now.",
            "review_score": "1"
        },
        {
            "review_text": "Its a very good game and is more real then anyother game I has played. Its a shame that you have to buy some of the really good aircraft but they have to make money. You should get it",
            "review_score": "1"
        },
        {
            "review_text": "Great simulator but drops you straight into it and if you dont have much experience with air sims then you will find it a bit difficult to learn. But if you are into sims then i qould highly recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "I have the whole set (none steam and have to say its one of the best games ever for flight sims, hard to master but once you do fun to play war.",
            "review_score": "1"
        },
        {
            "review_text": "Best Combat Flight Sim on the market.",
            "review_score": "1"
        },
        {
            "review_text": "Only have 183 hrs logged and I love it. Su25t, f15c, and a10a are good starter planes. In case anyone comes across game crash make sure you have win 7 sp1 and do a clean install of your video drivers.. also make a backup of your dcs saved game folder and create a new one when launching game. Cool game overall.",
            "review_score": "1"
        }
    ]
}