{
    "app_id": 223830,
    "name": "Xenonauts",
    "release_date": "2014-06-16",
    "developer": [
        "Goldhawk Interactive"
    ],
    "publisher": [
        "Goldhawk Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Turn-Based Strategy",
        "Strategy",
        "Sci-fi"
    ],
    "achievements": 0,
    "positive_ratings": 2497,
    "negative_ratings": 337,
    "price": 18.99,
    "description": "Xenonauts is a strategy game in which you control a multi-national military organisation defending a Cold War-era Earth from alien invasion, using small squads of persistent soldiers to eliminate the extraterrestrials and recover their technology in turn-based ground combat.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/223830/header.jpg?t=1548453267",
    "minimum_requirements": "OS:Windows 8 / 7 SP1 / Vista SP2 Processor:Intel 2 GHz Memory:1 GB RAM Graphics:Integrated Graphics Hard Drive:3 GB HD space Sound:Integrated Monitor:1280x720 pixels minimum",
    "recommended_requirements": "Memory:2 GB RAM Graphics:512 MB DirectX 9.0c Compliant Video Card  Hard Drive:Solid State Hard Drive",
    "reviews": [
        {
            "review_text": "I think that one of the best ways to define Xenonauts is as a 'spiritual remake' of X-Com: UFO Defense. By that I mean that the developers attempted to recreate the original X-Com as faithfully as possible (while at the same time improving on the classic's flaws) but had to use a different setting, considering they don't own the rights to the X-Com franchise (hence the 'spiritual' aspect). What is the result of said remake? Simply put, the best X-Com game that I have ever played. Xenonauts succeeds admirably at perfecting the formula that made the original game a timeless classic, and while it does have a few flaws, it is nonetheless a fantastic turn-based strategy game. It also brings forth a very nice artistic design, and streamlines the original's cumbersome UI, thus successfully bringing the original concept into the modern era of gaming.  In Xenonauts, you act as the commander of the titular organization tasked with defending the Earth against an alien invasion set in a Cold War-era setting. The game is divided into three separate components: a real-time administration simulation with 4X and sandbox elements where you manage the bases of your organization (assigning all kinds of tasks such as research, manufacturing of equipment, and building of annexes) and monitor for UFO activity in a map of Earth; a real-time with pause minigame where you engage UFOs with your interceptor aircraft; and a turn-based strategy component where the actual combat against the aliens happens. This last mode is where the meat of every X-Com game lays, and in the case of Xenonauts, I'm happy to state that said combat missions are every bit as challenging, tense and satisfactory as they were in X-Com: UFO Defense. Furthermore, the turn-based combat has been largely improved from the original, featuring more deep, complex mechanics, a wider array of weaponry and artifacts, and a healthy dose of streamlining where it was needed.   You have to keep in mind that this is a very challenging and difficult game. Every choice you make has consequences, and actions are irreversible. Furthermore, if you play on Ironman (a mode which I recommend activating from your very first playthrough, as these kind of games are clearly designed to work that way) you will not be able to reverse to a previous save state. You'll have to learn to go on with your choices, both good and bad, and I can't emphasize how fulfilling it is to achieve victory in these conditions. Remember though that if one of your soldiers dies, they're gone. Forever.  A rather notorious addition that Xenonauts made to the X-Com formula is the air combat. As I mentioned earlier, this is a real-time with pause minigame where you direct your aircraft against the UFOs in a radar-like interface, trying to maximize the damage you deal to them while avoiding their deadly attacks as much as possible. While I think this mode is far from perfect, as many times I felt it was a bit shallow, it is nonetheless a huge leap from UFO Defense's barebones interception system, and I think it succeeds in getting the job done.  The only real complaint I have with Xenonauts is with the way that psionic attacks works. This was a huge flaw in the original X-Com, as psionic abilities were hugely overpowered. In Xenonauts, they tried to fix this by making psionics unavailable to humans and making it a bit less powerful in aliens. Unfortunately, the result is that many times you feel completely powerless against psionic attacks, as there's no research that allows to counter it (something like the Mind Shields in XCOM: Enemy Unknown would have helped a lot in making it a fairer mechanic). Still, it's not a game breaking flaw, and the game it's still an excellent one even with the annoyance it poses.  At the end of the day, I don't see any reason not to recommend this game to everyone interested in a deep, complex, and tactical experience. For classic X-Com fans, this is a no-brainer, and for newcomers the lower difficulties are forgiving enough to make learning the basics of the game a smooth experience (keep Ironman mode activated though, that's the way to play this, in my opinion). Go for it.",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS IT! This is new version of old classic XCOM serie. Is this as good as original? It's even better. And I know what I am saying - I'm a big fan of original game. Developers just took classic game and developed it again trying to improve every aspect. And they achieved their goal. It's still complex and complicated game but some aspects are wisely simplified. Game feels very finished but developers still work on that title - BRAVO.  VERDICT: If you're fan of original XCOM, you must try this, you will probably love it. If you are a fan of new XCOM version, you should also try it. There is huge chance you will like this game too. If you are just a fan of good games, you should try this one, because it's just great game. But if you are fan of modern super graphics ultra simplified 3D games, don't try this. You won't understand what this game is.  Like this review? Consider to join  Good Games Giveaways &amp; Reviews  group and maybe press big sexy 'Follow this curator' button on our  curation page  to read more reviews and win free games.",
            "review_score": "1"
        },
        {
            "review_text": "I have always said the old Microprose X-COM UFO Defense is one of the greatest games of all time. I had started to worry i was just being nostalgic about an old MS-DOS game, but Xenonaughts cured me of that concern by being objectively and subjectively superior to the old X-COM game. I now know that my feelings about X-COM UFO Defense are genuine and that Xenonaughts has surpassed it.  Excellent game, maximum recommedation for anyone who likes tactical turn-based games, and a strong recommendation for everyone else.",
            "review_score": "1"
        },
        {
            "review_text": "Note: I used to play Xenonauts on my roommate's laptop before I got it for my steam account so my real play time is like 100+ hours I guess.  2nd note: Remember to set betas section to 'community edition', it's the unofficial patch made by the community that was approved by the devs and it makes the game much more fun.  3rd note: Mods are awesome, especially X-division (makes basic game feel tremendously easy :P )  Have you ever thought that new games are easy and do not require the skills we needed in the past to finish it? That there are too much tips and stuff like quest markers that completely destroy immersion and thus make games feel like Micheal Bay primitive action film? Are you dissatisfied with the new X-COM that made so many simplifications to the genre that it's almost unplayable for fans of good, old UFO?  If yes, or partially yes, this is the game for you - search no more! Here you are supposed to be the hunter, but usually feel like a prey.  It's not a game that's easy to learn, that you can launch for 30 minutes to 'pew, pew, pew' some alien scum. It's a game that requires skill and careful planning to dead with obviously superior enemies. There is no absurd mechanics like X-COM aliens that start to act only when you first spot them. Aliens in Xenonauts will use every opportunity to find, shoot and kill you whenever you don't expect it. Even if there is one enemy left on the map you can't behave recklessly cause it will lead your soldiers directly to the gates of Hades. What's more, even when you achieve the most advanced weaponry and armours you will not be safe - your people will still die painfully whenever you make a mistake.  I did not manage to finish this game in Ironman mode. Try it if you are hardcore enough. And remeber to train more people than the basic 10. You will need more experienced people cause most of Xenonauts gonna be fried/devoured/melted/shot by berserking friend.  This game made me shoot civilians so the aliens could not infestate them and fill their ranks with mutated pawns. It made me put triggered C4 on my soldier who was doing his last stand to buy some time for the rest of the platoon. I desperately used my last unarmed soldier to evacute wounded/dead (you can't be sure till the end of a mission) comrades to evac point under fire like Desmond Doss. My best team that have not suffered a single causalty for over 10 mission got utterly massacred during alien base assault when met the new alien soldiers that fought using tactics and equipment I could have not expected.  Do not listen to people who say stuff like 'aliens always know where you are' in negative comments. With proper tactics you can manuver you opponensts into crossfire and they definitely have not seen that coming. There are some issues of course, like the easy way to fire you rocket over you enemies on ground floor while firing from heigh (one must check if they really aim for the ground level) or glitches like room where you can pass between two sofas and must enter through a window (this one can be causes by 2000+ custom maps I have installed :P). Overall the bugs are minor and do not ruin gameplay.   My final verdict:  10/10 - this game is not perfect but the 10 grade is not for perfect products. It's for games that I know I will come back to after many years have passed. Xenonauts proundly stand among classics like Gothic, first two Fallouts and Total Annihilation. I never expected to say that but both original XCOMs/UFOs should now bow to a new master of the genre - Xenonauts.  Now I should go test the first public alpha of Xenonauts 2 ;) Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to start out by saying that I fully support this game and reccomend it. Despite any and all flaws it is well worth the money.  It's been years since people have been trying to bring new life into this genre. Many sequels and clones have gone by with mixed success. Games like XCom: Apocalypse changed the formula too much, while a good game in it's own right, it alienated fans. Other games like UFO: Afterlight and the series tried a different approach, but suffered from clunky menus and combat felt artificial. The recent addition of XCom: Enemy Unknown introduced excellent graphics and animations, but this hid the fact that the strategic map was dumbed down to the point that UFOs that you didn't shoot down were not the cause of missions, in fact it was possible to shoot them all down and still have missions so long as you had a country somewhere you didn't have a satalite over. The tactical was also super simplified. I would call that one an XCom-lite if anything.  Xenonauts does not have the flashy graphics of XCom: Enemy Unknown, nor does it vary far from the original. However it is improved from the original in many ways and is what many fans have wanted. It could be used as another start to evolve this hard to capture genre.  Once again, UFOs are the sole source of missions on the strategic map. If a UFO is ignored, it can generate a terror mission during a landing, or build an alien base. No longer is there effects without causes. In fact the atmosphere of the game is even enhanced by reports of UFO activity across the globe, such as new crop circles, missing ships, and cattle mutilations being reported in areas where you cannot track the UFOs. Also every UFO comes with a mission of their own, something you will discover later in the game. These missions affect their behavior, and you will have to adapt if you want to control the invasion before it's too late.  Many clones/sequels allowed the player to overpower the aliens far too much. This gave the aliens the feeling of being the underdogs despite the fact that they are the ones with the technological advantage. Not so in Xenonauts. While the majority of the alien fleet cannot attack immediately, buying you some time to prepare, their progress is at least in part based on your success. If you are doing well, expect to see harder UFOs and aliens sooner than you otherwise might. This leads you to having to make tough decisions like 'Do I let this UFO perform it's missions for a while before shooting it down?' 'Do I want to raid every UFO for the bonus cash' etc. because doing so can speed the rate of the invasion if you are successful. In short, go to slowly and risk losing funding and nations. Go too quickly and the Aliens will bring their main fleet before you're ready. Can you walk that line?  Even further you are quickly forced to decide between building better interceptors or getting better equipment for your troops. Bullets will not do for long once aliens with armor start showing up. Some will simply laugh off sustained fire if you aren't ready for them in time. Defense is important too, as even the basic armor could be the difference between a shot instantly killing a soldier or not. Even here, you cannot be reactive, as you stand to lose too much. You have to learn to predict what you will need and when, and if you are wrong, you will pay.  This game is a hard strategy game. Every decision you make will have repercussions you might not have dreamed of down the road. Your soldiers, while they improve, will never be the super soldiers you had in other games. Tactics will always be important, with armor only saving you from a mistake or two if you are lucky. A skilled player might be able to forgo armor completely, though I doubt he would do so flawlessly. I personally am almost a year into my game and I have never used combat shields, something a lot of players say is a staple in their forces. My body count isn't that high either, roughly at about a dozen.  All this praise does come with a cost. This game does have it's flaws. If you need glasses, or have trouble reading small print, the fonts on the strategic map will kill your eyes. I can barely read them as it is on 720p. It may be better on 1080p, but that's not how I stream it. This needs to get fixed.  The graphics look like something out of Fallout 2 days. They are excellent 2d graphics, but do not expect full 3d modelling here. They spent more of their time making sure the gameplay worked well than actually building 3d graphics. Still if you can overlook the graphics, there is a great game underneath.  The interface, while greatly improved, is still very clunky. 1. Double clicking on a soldier in the management panel sometimes takes you to that soldier, sometimes not. It's partly to do with how soldiers are organized on the equipment panel, partly to do with the double click speed required. 2. Planes that need to be refueled/repaired/reloaded cannot have any characteristics changed. Even their name, or loadout. It would be nice to be allowed to change a loadout while loading the plane with ammo. This goes double for positioning soldiers on the dropships. 3. This is also a feature easily missed by most players, as it is hidden almost completely. Placing a button from the loadout screen for the troops in the dropship to link to the positioning would help a lot. 4. The inability to rotate the map or hide walls makes it impossible to throw grenades on tiles behind them.  This game takes place in 1979-early 80's. Some things are anachronistic or inaccurate. 1. The basic starting rifle is the M16A2, which came into use in the 1980's. It had a 3 round burst option and 30 round magazine. The weapon that soldiers should be using is the M16E1 which had fully automatic options and a 20 round magazine. 2. The starting precision rifle pictured is a M16A4 which introduced a modular rail system to a rifle similar to the M16A2 allowing for the addition of scopes, laser targetting and the like. It would have had a 30 round magazine as well, instead of the 6 rounds given. Instead they should have used the M16E1 fitted with a scope off to the side, with a 20 round magazine. 3. The machine gun pictured is the M249 squad automatic weapon. This weapon is designed to fire ammo from a belt in a drum underneath the barrel. It can use M16 magazines, however this is not reccomended due to severe jamming issues. A M249 belt comes in 3 sizes: 100 round for training, 250 round infantry drum, and 500 round vehicle mounted drum. 4. Night vision scopes were around for the Vietnam war, and should be available for snipers in night missions in the game. Full night vision goggle(s) however will not be seen till later in the 80's. A possible tech to research and produce them would have been a nice touch as necessity is the mother of invention they say, and something to counter the alien's advantage at night would have been a welcome choice. Night vision goggle(s) do however restrict vision, and accuracy due to the way they operate. 5. The starting grenade pictured is a fragmentation grenade. It has a kill radius of 10 meters with an effective radius of 5 meters. It does not do it's damage by concussive force, but by shards of metal, like bullets, flying out in all directions. I cannot speak of how alien grenades work, but a rework of basic grenades should be in order to make them effective in this regard. 6. Flares burn can start fires easily but do not do so in game. Smoke grenades produce smoke slowly, and will only burn your hand if you aren't wearing leather gloves. They should not be starting fires in this game. 7. Bazookas are not easily reloadable in field. Carrying one as a side implement should be an option for a soldier, but ammo preloaded. The M25 rocket launcher however could fire multiple rockets, but was a mounted weapon.",
            "review_score": "1"
        },
        {
            "review_text": "I lost my whole squad. It all started with a single reaper, this reaper snuck through my lines undetected, and like a whisper in the wind, snuck up on my #1 guy. This new reaper, then managed to matrix all of my bullets my men had, then infected another soldier. At this moment, my entire squad went into a frenzy of panic shots and fleeing, one my one my men either killed each other or ran right into another reaper. Soon, all I had was my last guy. I sent this last man sprinting to the chopper so I could get him the hell out of there, and when he got there...........A reaper was waiting for him.  10/10 would lose my whole squad again.",
            "review_score": "1"
        },
        {
            "review_text": "OK. I have seriously mixed feelings here.  I am one of those folks who spent hundreds and hundreds of hours Playing the original XCOM. I played it on Playstation, even with all the crappy control bugs it had, including the awesomeness of having your soldiers run right out into the middle of an empty area with aliens all around when you tried to end a turn.  And I loved every controller-throwing moment of it. It was and forever will be my favorite game of all time.  This game is essentially an XCOM: UFO Defense clone. Same technologies (laser weapons, plasma weapons, interceptors, avalanche missiles, etc.). It's almost like the XCOM universe equivalent of Spaceballs, only instead of the Force and the Schwartz, you've got Sectiods and Caesans, Elerium and Alenium, alien alloys and...alien alloys.  It's virtually THE SAME GAME.  Depending on who you are, that's either a really, really good thing or a bad thing. This title brings back things that made the old game feel more tactical than the 2K version like time units, rotating soldiers to look different directions, and multiple bases. It feels much more like the old Microprose game than the 2K reboots. There are some new elements like scrambling squadrons of interceptors rather than individual planes, a tactical air combat battle system that didn't exist in the original, doors on the sides of the Skyranger (oops, I mean dropship), which is nice so you don't have to knowingly unload all your operatives out the back into certain death in certain situations.  It's definitely fun and nostalgic.  I picked it up on sale so I'm more or less content, but in all honesty I was hoping for more originality and less blatant copying of the original format.  If you pine for the days of the original XCOM and The Long War mod for the 2K version didn't tweak the AAA reboot enough, I recommend this game and give the devs props for their faithful recreation (and slight enhancements). If you're looking for a title that's breaking new ground, I would look elsewhere.",
            "review_score": "1"
        },
        {
            "review_text": "Did you like the origenal x-com games? Then you should give Xenonauts a try! It has all the features that made the origenal such a huge hit, plus quite a few of those little extras you secretly wished was in x-com. Can't be bothered to recover the small ufo closer to end game? Airstrike!! Wished that for once the damned cops would at least try to shoot at the alien hordes? Well, lets just say the natives of earth can sometimes be mighty hostile! Those are just a few of the many small little enhancements to the game! This game is a must have!",
            "review_score": "1"
        },
        {
            "review_text": "Less flashy than XCOM but with all the right stuff - I actually prefer it to XCOM, and that's saying a lot. It has all the best parts like the planning, base building, turn based tactics and air combat elements but the best thing for me is the overall feel of the game, its a good take on the alien invasion scenario with enough identity that makes it feel like more than an XCOM clone (like the setting in 1979; seeing the world divided up as Soviet Union, Indochina etc along with troop backstories showing combat experience in Vietnam/Afghanistan and the awesome music makes the game much more immersive). Basically it feels to me like Men In Black 3, MGS3: Snake Eater and XCOM had a love child.  I *would* however reccomend watching a couple letsplay videos on youtube if you arent used to XCOM/turn based squad shooters, as a bad first impression can ruin any decent game. That being said the game is more than fair, one of the reasons I prefer it to XCOM is that strategy actually works, as opposed to experiencing 'that's XCOM, baby' when the RNG decides to f*ck with you. Repeatedly.  Tl;dr - a cold war version of XCOM that doesnt need to be flashy to be awesome.",
            "review_score": "1"
        },
        {
            "review_text": "'If something isn't broken don't try to fix it.' This is it, guys. IT. The one X-Com we all deserved but never got. Until now that is. Xenonauts has everything that X-Com had plus fixed problems of the original. If you are a fan of original X-Com and currently in doubt, buy it. If you are a fan of a new XCOM, buy it and get enlightened. Anyway, just buy it, it's one the few games worth every e-coin of yours.",
            "review_score": "1"
        },
        {
            "review_text": "Not as flashy as XCOM, but deeper and more satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! Xenonauts is an incredibly clever and rewarding game.   Great game mechanics, streamlined micro-management and wonderful 60's type of artwork.  Tough strategic and economic decisions await you: should you build one more base to save Australia or improve your existing ones? Hire more soldiers or modernize your jets? The combats are very, very challenging: if you rush, the aliens will wipe out your best teams, those it took you weeks to promote to majors. And you will lose money, and you will lose continents.   On the down size, the repetitive, corridor style combats in the alien bases.   Superior to the XCom series, which has its own merits, Xenonauts is the proof that you do not need 3D or fluffy animations to create an enthralling and wonderful game. Oh, and I love the map and the passing of time idea!",
            "review_score": "1"
        },
        {
            "review_text": "Xenonauts takes the classic UFO enemy unknown game that entertained so many early PC gamers and makes it accessible for a whole new generation. Far deeper than the (still enjoyable) Firaxis Xcom remake, Xenonauts returns base building and a deep research tree, as well as base assault and defence and far higher levels of customisation.  A great game!",
            "review_score": "1"
        },
        {
            "review_text": "It's quite an okay clone of the original 20th century X-COM games, but it doesn't really do a very good job of capturing the original game's flair. Also, the impossible difficulty is really impossible here. I like to play on the hardest game setting, but the extent of the enemy superiority on impossible in this game is really frustrating.  Still worth playing, but I'd probably wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "had a dude who tried to reaction shot an alien and hit a propane tank blowing up half my squad   10/10",
            "review_score": "1"
        },
        {
            "review_text": "The original X-Com was pulled into a time machine and this is what came out, if you want deeper strategy, base building, and loyal human soldiers dying by the truck load fighting an alien invasion then get this!   Pros; More micro management of resources, technology and building. More than one base, build as many as you want so long as you have the money. Air combat mini game against those pesky alien UFO’s. Send down bucket loads of soldiers down to fight the alien invaders (as not all of them are coming home). A longer prolonged campaign that can be drawn out.  Cons; No streamlined and snazzy graphics. Can sometimes seem overwhelming management wise for those not into deep and heavy strategy gaming.  I liked it, thumbs up! ",
            "review_score": "1"
        },
        {
            "review_text": "one of the best x-com games ever , even if its not an x-com game , fun to play , easy to mod , tactical  everything i ever wanted",
            "review_score": "1"
        },
        {
            "review_text": "Very good remake of the classic X-COM: UFO Defence. Better in all ways. I especially like the new approach to air combat: you can manually command up to three aircraft in an air battle. Offcourse, the air battle is 2 dimmensional, but it better then the system in original game.   Also there are good mods from Steam Workshop - try out the Community Mod.",
            "review_score": "1"
        },
        {
            "review_text": "Very good remake of the classic X-COM: UFO Defence. Better in all ways. I especially like the new approach to air combat: you can manually command up to three aircraft in an air battle. Offcourse, the air battle is 2 dimmensional, but it better then the system in original game.   Also there are good mods from Steam Workshop - try out the Community Mod.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the best ever replacement for a game like the first XCOM (enemy unknown) game of the 90's.  I am so glad another group tried a game like this and made a BIG success of it. Guys keep it up and bring us more and even better games like this. YOU are the next guys people will remember for 20+ years and talk about you if you carry on bringing out games like this and with the quality as well. Your games were more stable in Beta than games that come out as final release versions. I am so sick of developers and publishers pushing out bugged games and make us the giune pigs to sit with all the bugs. Well done guys, you are an example of how it should be done.",
            "review_score": "1"
        },
        {
            "review_text": " I  loved  the original X-COM games.  This is literally a direct copy, with updated graphics. There was almost nothing new or creative used in this game - and I mean that in a good way. The original formula worked, but it was just dated as far as the actual software.  This game is awesome in keeping that formula alive.    Pros:  +Awesome, addicting X-COM esque gameplay +Better global management part of the game (play other than when in battle)    Cons:  -Price is a bit steep -While it would be a gamble, if done right it would have been nice for them to make it slightly more of their  own  game -Text can be thick, and while I want to read the lore and all the details, I find myself skimming. I just wish it were more concise   If you loved the old X-COM game(s), you will not be disapointed, although I would wait for a sale since part 2 is on the horizon. ",
            "review_score": "1"
        },
        {
            "review_text": "Left me grinding my teeth in pure retro ectasy...and Pain",
            "review_score": "1"
        },
        {
            "review_text": "I hesitate to call Xenonauts a spiritial successor to one of the greatest games of all time - UFO: Enemy Unknown (X-COM: UFO Defense in the USA) - rather instead, it's purely a spiritual  remake .  The earth has come under attack from aliens, and you manage a PMC tasked with fighting them. The nations of the world fund the company, and based on how you defend each country the funding can rise or fall. This is done from a map view of the earth, showing your base, and craft as they start to appear. To begin, just a few small scout craft arrive, easily shot down. If you intercept the craft over land, sometimes it crash lands, forming a crash site you can investigate. Alternatively, the craft sometimes lands and you can send a dropship to the location. Once the dropship arrives at the site you enter an isometric view where you can move your units, and shoot at any aliens you encounter. This section is turn based, and the amount of movement you can make is determined by how many Time Units each unit has. Once you have cleared the site, you can recover alien technologies and take them back to your base to research, leading to the ability to manafacture new items. There are many other elements to both the management and tactical section of the game, which I won't spoil here.  If you're looking for a modern take or an evolution on this forumla, look instead into the excellent 2012 Fixaris reboot, XCOM: Enemy Unknown. This is a very different experience however, and I'd still throughly recommend trying the original. However Xenonauts now presents an interesting new third option. I've recommended the original to people, only to see them never really get into it thanks largely to the outdated interface. Xenonauts allows you to experiece the brilliance of the original, but tuned to remove those frustrations.  For example, one of the least enjoyable parts of the original was surely the inventory management. While I love the base management overall, manually replacing every last clip, medkit, rocket, grenade wore thin pretty quickly, especially when most of the items were cheap enough to never really be a concern. In Xenonauts, this is thankfully gone for most of the mundane consumables. Other areas which have been simplified include reloading, and using grenades. In X-COM, using a grenade was a series of actions, removing it from your belt, putting it in your hand, pulling the pin/setting the timer, throwing it. Each took a small amount of time units, and it was entirely possible to pull the pin, only to realise you didn't have enough time units left to throw it. While this did invoke exactly the feeling of panic it was no doubt supposed to, it was largely just frustrating. In Xenonauts all of this is just replaced with a single action with a single time unit cost. To my tastes, they developers have thankfully only simplified elements which probably needed it - it certainly doesn't feel dumbed down.  It might just be me, but Xenonauts does feel a little easier than UFO was. However, this really is no bad thing - UFO was punishingly difficult, and it wasn't unusual for newcomers to be in real trouble before even their first funding review. In Xenonauts, easy mode should allow new players to get a good long feel for the game before they start ramping up the difficulty.  If you loved UFO, or you enjoy classic tactical games, if you like retro graphics style, you'll most likely enjoy this greatly. It's such a closely tied remake of UFO it almost feels like I'm reviewing that, rather than Xenonauts - either way, I cannot recommend either one highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "Looking for more old school X-com? then play this.",
            "review_score": "1"
        },
        {
            "review_text": "Basically, if you liked X-COM and/or similar games, this is one that you must have. Compared to the new X-COM games, Xenonauts simply has more depth added to it and pretty much has everything you'd want for an X-COM clone. Don't let the 2D graphics fool you, this game offers everything that's lacking in the new X-COM: Vehicles, ability to customize loadouts further and mix between classes, an inventory system, and best of all, a more involving geoscape with air battles that offers you means to not only take command on the ground, but achieve air supremacy as well, if you know what you're doing, of course.  Not to mention the excellent support from the devs, even for the Linux version of the game.",
            "review_score": "1"
        },
        {
            "review_text": "I just bought this game yesterday, so I don't know all the in's and out's of it, but I'm going to write my preliminary reactions.  Xenonauts wins on the feeling alone. I haven't played the X-Com games, new or old, but I have to say that something about the 'look' of the new one turns me off, a bit. While the AAA style of that game left a bad taste in my mouth, the old fashioned presentation of Xenonauts is quite refreshing. The excellent paintings and graphics evoke a definite 'X-files' atmosphere, and the soundtrack has an excellent atmospheric dread to it. It is quite fun to send your squads through the map, clearing buildings and establishing perimiters, hunting down that lone bug-eyed freak who you just know is going to pop out and blast your guys with a burst of plasma fire.  The amount of detail and depth in the simulation is quite good, especially for fans of strategy games which are more complex. Woefully, many games these days have a 'press x to win' mentality, but this game doesn't. You have to carefully manage your funds and figure out your own strategies. Should you build a second base early on, to keep the Russians convinced that your organization can do it's job? Or do you spend your disposable income on tricking out your North American base so that you can more efficiently capture alien tech?   To sum it up, it's a little bit of SWAT 2 and a lot of X-files, all rolled up into a wonderful old-school experience.",
            "review_score": "1"
        },
        {
            "review_text": "Its good now that it is finished. If you liked the original Xcom you will like this.",
            "review_score": "1"
        },
        {
            "review_text": "As some one who has never played the original xcom: ufo defence, I can thoroughly say this game doesnt just try to capitalise on nostalgia. It is a brilliant game in its own right. I would recommend it for any hardcore strategy fan. It can be very unforgiving and will punish sloppy commanders in both the overall strategic conflict and in the combat missions themselves. You need to stay vigilant as you are truly fighting a superior enemy. The atmosphere and aesthetic is very interesting and while the graphics wont blow you away, there are some really nice renders with some lore which create a good picture in your mind of what you are facing even if the little models of the aliens and men arent very detailed in combat. The music is also nice and eerie when you have to face the enemy or soars when your interceptors thunder towards alien craft to shoot them down. The combat itself is tactically very satifying. It has lots of depth and once you take the fight to alien bases and they do the same to you things really start to get interesting. I have many memories of individual missions and the stories that unfold in them. The heroic rookie that pulls of an unbelievably feat of bravery and kills the last few aliens even as his comrades' bodies grow cold around him. The time when I dropped my rocket launcher at the other side of the map coz my man got wounded and then had to hoof it all the way back because i had cornered an alien commander and i was ♥♥♥♥♥♥ off and wanted to blow his ♥♥♥ to xeno hell. The bunch of ill prepared and under equipped soldiers who fended off an attack on my one and only base. There are plenty of moments like this. Buy it...and suffer! In a good way haha",
            "review_score": "1"
        },
        {
            "review_text": "It's a less graphics driven but more open world version of xcom. I enjoyed it, but never got very far because I'm a masochist who only plays these types of games on ironman. But I hate myself. You would probably enjoy it if you liked xcom and aren't a masochist in regards to games. Give it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "If my playthrough would be a movie i'd be called.  Outdated F-16's vs Carries 2: Begging America to not hate me.",
            "review_score": "1"
        },
        {
            "review_text": "Not played much, already love it. i didn't get to play the old school Xcom games but i did play Enemy unknown which i like very much. and this game feels much better in depth. the music, art work and simplistic graphics are very nice.",
            "review_score": "1"
        },
        {
            "review_text": "Love it! the perfect combo of rpg &amp; simulation, i would highly reccomend   11/10 would plasma gun high preator again!  kind regards, VV",
            "review_score": "1"
        },
        {
            "review_text": "Excellent turn-based tactical combat game. In addition to its squad centered combat, Xenonauts also includes resource management and aerial defence. Awesome timewaster. Warning! You will be frustrated a lot, since the higher difficulty levels are just plain punishing.",
            "review_score": "1"
        },
        {
            "review_text": "Cold War? Yes Rich fake history entries? Mmhmm! Feels like the original Xcoms? Yus!  Simple learning curve, and if you've played similar games like the original Xcom franchise you shouldn't have any issues. It does feel almost as dated but that's almost certainly an artistic choice (I would guess to relate more to early 90s squad tactics games), it isn't the flashiest but it looks really nice for 2D Iso artwork.  Workshop items are also fantastic! everything seems to work flawlessly and there are some really interesting mods out there, a few even drastically change major parts of gameplay, adding a few more layers of depth.  You definetly feel like you're working with the NSA and MIB when your deep into a game.",
            "review_score": "1"
        },
        {
            "review_text": "Brings back memories of the old X-Com games.  Pros: X-Com like Cover system Cool graphics Air combat  Cons: Missions can get boring a bit New weapons only change damage (no TU%, no Acc etc)  Generally worth the money!",
            "review_score": "1"
        },
        {
            "review_text": "As a fan of the original X-Com series, and someone who spent many nights shivering with tension on those critical night missions a long time ago, Xenonauts recaptures all of that - and more. It had a bumpy ride through development but honestly it has turned out a solid game, and I'm very happy to have supported it early on.  One of the strengths of Xenonauts is the tactics that you can pour into playing the game, on the base management level, or the battle maps themselves. This is what people were crying out for and didn't really get in the otherwise decent XCOM game: the ability to fine-tune your planning and tactics, and go different routes. Tank and heavy weapons? Rapid response scout team? Traditional army style? Beserkers filled with explosives? Patient sniper team? You can make all of these work. Plotting your route through the maps and vying with the alotted time just  feels right .   And on the globe view - base placement, setup, research order, and all that. This all matters way more than XCOM. I'd say the AI - though not mindblowing - is just as good as the XCOM game if not better simply due to the more complex map design.  Just play out your first night mission and listen to those noises. It's very dark out there and you're all alone and it's all going to go horribly wrong - maybe.  One of the great strengths of this title over the originals, all the unofficial remakes, and the recent XCOM game, is that the maps needn't be repetitious. The system in place for juggling map assets does the hard work, and the editor is extremely powerful and will no doubt fill your hard drive with hundreds of variants (all of which, really, produce their own limitless variants). So if you take the time to download them, or map packs, or produce your own (it's fun!) you can cure one of the biggest nagging problems with the series' formula.  Can't really recommend this strongly enough to strategy fans.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the origianl X-Com why havn't you bought this already?",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the original X-Com or even the Firaxis one, you will love this game. Play on Hard and Ironman mode, and this game can give you 100's of hours of gameplay, thats some good value.",
            "review_score": "1"
        },
        {
            "review_text": "This is way better than recent XCOM remakes and has a lot of great mods to enchance your squadwipe experience. A lot of micromanagemet, great style, hardcore as it is. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The first game that im playing singleplay for a long time!!! Thank you guys.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoying it so-far, but I will admit that the difficulty is rather high. The invasion escalates faster than research does... which has put me into an Edge of Tomorrow situation on a few missions. Hard to fight Ion weapons with lead slugs no matter how good your tactics are!  But, that aside...  GOOD: Solid X-Com clone, if you're into that kinda stuff. One thing that is pretty cool, is the radar installations. Rather than sweeping a continent, it sweeps a radius from the base at the center. This means you can kind-of tailor base placement to your strategy.  BAD: I should note here that I have not yet finished the game, so the badness might change. But from what I've seen so far... there's nothing really new here. When I said earlier that its an X-Com clone, it is just that. There's really no reason for this game to have been made, since it already existed before (albeit with inferior graphics). Difficulty curve is pretty steep (normal mode). The graphics are obviously kinda dated. I realize that this appeals to some folks, but I personally prefer my modern video games to look modern. Also there are some glitches with the physics where damage isn't quite right, like an alien saucer icing my dude through an intact wall. An explosion that somehow hurt a character when it took down a building that she was not in, on the flip side: 2 of my characters receiving no damage when standing right next to a car when it exploded. Aliens often have line-of-sight to their targets, but those targets are blocked when aiming back. Also I have a feeling that aliens do not have fog-of-war, or at least there is a glitch in their fog-of-war algorithm that makes it so it sometimes does not affect them.  Overall, I approve of this game. I love strategy, and the X-com style games in particular. While its exactly like some of the X-com clones in the past (UFO: Extraterrestrials especially) and brings nothing new to the table, I hold some hope that this game was made as a modern platform for the purpose of making expansions and DLCs that will add to the common base game. That would be a worthy idea: a UFO / X-Com game that gets periodic updates like PayDay2 does! Anyway that's my hope. Otherwise its just a more graphically-enticing X-Com (old game), which I suppose is fine if the new one was too dumbed-down for your liking, or if you just want MORE X-Com. But like... even the technologies are the same, and the species. Anyway, that's my take. Thanks for reading!   ",
            "review_score": "1"
        },
        {
            "review_text": "Xenonauts has captured all the fun, excitement, and intrigue of the original X-COM games, and only intensified them in this amazing revival. With over 100 hours of play time logged on this gem, I can safely say that it is one of the most immersive and fun games I have played in a long time.   I have played Firaxis' X-COM and while I loved it, it still failed to quite capture the true spirit of the the original series. Not a problem with Xenonauts. Playing it feels like it was made by the exact same developers that made the original x-com, but with the approach and complexity that decades of gaming refinement have brought to the table.  I've heard some friends express a disenterest based on the graphics, but I can assure you that the elements of the game itself more then make up for this, and seeing how some 3D modeling can end up looking rather...cartoony or kind of silly (Planetary Annhiliation, Showrun Returns), I find it pretty refreshing.  I can't say enough about the content of this game. From the well written and detailed UFOpedia, that keeps a detailed description of every relevent item/creature you will come across and/or research, the rich histories of your team members; their prior combat experience, assignments, countries of origin, etc; to the HUGE tech tree to be plotted and explored.   The game takes place in 3 seperate environments...the 'Geoscape', where you lay out your bases, set up manufacturing and research, hire and equip your soldiers/engineers/scientists, and watch for alien activity. Once an alien ship is spotted, you must dispatch interceptors to shoot down the enemy. Once your interceptor has engaged the ship, the second environment is entered  In the second phase, the 'Tactical Air Battle' phase, you control up to several interceptors in a top down arial battle against the enemy ships. I have seen this tactical phase balance and transform as it was developed, and can say they have done a fantastic job with this and the balance as you research and develope more powerful crafts.   The 3rd and final phase is the 'Tactical Ground Combat' phase, in which you control your customized team of soldiers (and various Heavy Weapon Platforms) in turn based combat against the alien invades after you have shot them down. You may also enter this phase without shooting down an alien ship if you get your lander to an already grounded UFO, a terrorist site in which the aliens are already grounded and engaged in terrorizing a major city you must defend, or an alien base they have established on Earth's surface.   There is a fantastic variety of terrain, maps, aliens, weapons, armor, etc throught the game, so it always seems fresh, even 40 to 50 hours in. even after my 120+ hours of gameplay (have played offline at times, who knows how many hours there) I still see new maps and have to come up with new strategies/approaches depending on situations.   All in all I would recommend Xenonauts to any gamer that won't be caught up on a lack of graphical complexity, and especially for anyone who likes management, strategy, simulation, or turn based games. At $25, this game is a great buy. I think the only thing keeping them from charging more is the lack of advanced graphics. The content is certainly up there with any Blockbuster game, in my opinion. Thank you to the fine developers at Goldhawk Ineractive for a wonderful product.",
            "review_score": "1"
        },
        {
            "review_text": "To compare Xenonauts to XCom series would be the easiest, but also unfair way to deal with this enormous strategy. Quite certainly and without any shame, Xenonauts developers Goldhawk Interactive are speaking out the truth about their inspiration - Xenonauts is spiritual successor of acclaimed strategic game XCom: UFO Defense.   Gameplay resolves in circles which comprises of three main elements: management of your bases and strategic command centers via Geoscape, your game screen; real-time air combat and final stage - turn based ground combat.   Although we live in cruel time when hand drawn graphics are unfairly judged as unworthy by most of the (childish) players, get over retro, but charming hand-drawn sprites and you'll enter the world of comprehensive, multilayered strategy where you can manipulate every single aspect of your gaming experience. Numerous classes, weapons, tactics, strategies, upgrades and ideas have been brought upon the table and shrouded in mystery and atmosphere which perfectly collides panic of alien invasion and Cold war isolation.  There are numerous selling points to Xenonauts, but one of the most important IS and SHOULD BE that it's an honorable, greatly improved over original and richer hommage to XCom which delivers in every single aspect. It's unbeliveable that an indie team can deliver a game that even surpasses the original on so many fields.  If you're into aliens and hungry for some long-lasting strategic battles that will test your nerves, luck and decisions, go for it.",
            "review_score": "1"
        },
        {
            "review_text": "Implements every feature and mechanic that should have been in XCOM: Enemy Unknown. The best part about Xenonauts is the fact that the AI will move about on their own, requiring you to constantly make sure you don't get ambushed or flanked.",
            "review_score": "1"
        },
        {
            "review_text": "Really, ignore the fact that the two top reviews for this game are negative and instead pay attention to the fact that 90% of user reviews are positive. The reason those two reviews are there is because the Internet loves negativity way too much.",
            "review_score": "1"
        },
        {
            "review_text": "I'm Angryblack187 and I approve this game",
            "review_score": "1"
        },
        {
            "review_text": "Only played a little. Would recomend for fans of xcom games or games of a simalar nature.",
            "review_score": "1"
        },
        {
            "review_text": "Intercepted UFO, attacked on foot. Died instantly. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Great job.",
            "review_score": "1"
        },
        {
            "review_text": "Very good, fun and in-depth tactical game",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever. Way better than XCom. Play if you are looking for a challenge. Prepare to loose many soldiers to the hands of the aliens. Can be frustrating at times. 10/10 Would kill aliens again.",
            "review_score": "1"
        },
        {
            "review_text": "One of my soldiers was called Jennifer Lopez and she died.  10/10 we mees your taco keeses.",
            "review_score": "1"
        },
        {
            "review_text": "Despite some minor interface issues, this has proven to be a tried and true successor to the classic Xcom formula, including those rage inducing squad wipes. Have fun and bring some tissues.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes you feel like the first time you played x-com. Instead for going into alot of details, let me say i always read the negative reviews on games before buying anyhing, Now- this game really is entertaining, it is enjoyable and easy to play, but remember you will be extinct if you stick your neck to far out.  Is it worth 25us?!  Yes it is.!",
            "review_score": "1"
        },
        {
            "review_text": "This game is really good. The only thing I don't like about it is the mind control. Other than that, it's great.",
            "review_score": "1"
        },
        {
            "review_text": "Hardcore gaming at its best",
            "review_score": "1"
        },
        {
            "review_text": "an updated version of the old XCOM games, it's really really fun but i could never get into playing it all the way thru  honestly its pretty good if you like the older XCOM games  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Do u love old Xcom? Your gonna love this game too.",
            "review_score": "1"
        },
        {
            "review_text": "If you loved original Xcom/Ufo from Microprose you will love Xenonauts. Its almost 100% remake with few upgrades. There are also mods to make your game even more similar to original (music sounds etc)   I had a lot of fun with firaxis official remake, but lets be honest it was very simplified compared to original. Xenonauts its only way to bring you 100% xcom experience. 9/10  + its almost 100% mechanical clone of original xcom/ufo + very engaging and demanding but well balanced and rewarding game + combat missions have this special mood of original game + dogfights are much better then in original + full mod support can make game even more original like  - graphics are very outdated, its not a big deal in game like that but still they could done better job - some alien races are not well designed - cryssalid (reapers) are not even close so scarry and demanding like in original  ",
            "review_score": "1"
        },
        {
            "review_text": "It is time to play this amazing game. It is in a perfect out even better!",
            "review_score": "1"
        },
        {
            "review_text": "Still havent managed to win this game but is fun to play and addicitive as well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a snuff porn film where the aliens kill humans en masse!  Otherwise, great game!",
            "review_score": "1"
        },
        {
            "review_text": "Its like the good old XCOM-UFO DEFENSE days... But better in every way.",
            "review_score": "1"
        },
        {
            "review_text": "Xenonauts is a fantastic modern adaptation and reimagining of XCOM. It's a beautiful, brutal game that pits your wits against that of the AI. It is a thrilling game, especially the first time you play it, as the fear your men experience becomes something you also experience when rushing your men out into the unknown.  It's pretty much perfection.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. Really captures the feel of the old-school X-COM games, with a lot of improvement to usability, looks, etc. The devs have done a great job communicating with the backers and have paid attention to feedback, bug reports, etc, throughout the development process. So glad I backed this on Kickstarter. If you were a fan of the original X-Com, or if you just like quality tactical turn-based gaming, then this is worth your cash.",
            "review_score": "1"
        },
        {
            "review_text": "Finally instead trying to make a totally new game from X-com people just made Classic X-Com better. Much better Game feels polished and extremelly interesting. Very well done!",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Its a more in depth clone of the orginal X-com.",
            "review_score": "1"
        },
        {
            "review_text": "This feels like a true sucessor to the original X-COM game, with all the improvements, and an interesting and somewhat fun air combat minigame...Using all the tools the world had...in 1979. I love it. Now if this company's next plan is a X-COM Apocalypse version (My favorite of the series), I'd be extremely happy.",
            "review_score": "1"
        },
        {
            "review_text": "Stays true to the original but Goldhawk adds their own flavour to it. Fantastic isometrical turn based game. Worth the money and it started out as a kickstarter and humble begginings.",
            "review_score": "1"
        },
        {
            "review_text": "Best X-Com game since the very first game. Only complaints are minor, nitpicky things about UI. Get it.",
            "review_score": "1"
        },
        {
            "review_text": "Despite how unforgiving the gameplay can be, you can still have your soldiers armed with shields and stun battons who then proceed to beat the living daylights out of aliens.  Xenonaut : Welcome to Earth! 'ZAP!' ",
            "review_score": "1"
        },
        {
            "review_text": "If you like turn based rpg strategy games this is your game. It's It's got all the original gameplay elemants of X-com with a very cleverly throught out AP/TU system for combat. Research and base building isn't overbearing and combat varys from easy to very challenging from mission. I've only started playing so I haven't experienced everything yet but the more I play, the more impressed I am with the inferface and the gameplay itself. Well done Goldhawk Interactive and thank you for such a great game.",
            "review_score": "1"
        },
        {
            "review_text": "If you prefer gameplay and strategy over graphics and glitz this may be right for you. If you like tactical turn-based ground combat this probably is for you. If you enjoyed XCOM or one of its many clones this is definitely for you.  Xenonauts has all the best features of the original X-COM UFO Defense and eliminates many of the major annoyances. Overall, this is a clone so although there are a few new and very welcome additions, it is very similar to its inspiration.  Hands down, Xenonauts is the best implementation of this genre that I have played. I waited for it to go on sale to buy it because I'm a single working parent and pretty miserly as well.. Two days later I bought it again at full price as a gift for my friend. It's that good. ",
            "review_score": "1"
        },
        {
            "review_text": "I played this game, finished it, and then went and got openXcom so I could replay that too.",
            "review_score": "1"
        },
        {
            "review_text": "9,5/10 = I'm really impressed  Xenonauts fullfills it's ambition to be the successor to Xcom: Ufo defence. At first I was not overwhelmed about this game, but after few hours of gaming it really began to shine. Game requires some 60 hours to finish, depending on play style/difficulty. XCOM:EU and Xenonauts are both very good games but from different reasons. XCOM:EU has graphics and Xenonauts has sandbox and somewhat larger scale.  Positives and negatives: + Tactical battles. No spawnpoints, larger number of troops, every alien type requires different tactics by you. + Tactical battle AI. There seems to be random element and thus AI reactions are hard to predict, I saw no stupid behaviour during 60 hour gameplay. Do not think you are safe behind closed doors! + Normal difficulty level is hard already (I savescummed the hell out of this) + Balance!! Game is and feels absolutely and fantastically balanced. Every weapon has it's purpose, credits are hard to come by but not too hard, items get obsolete very slowly etc etc. + Almost buggyless. Only one minor bug encountered during 60 hours (One soldier got stuck to wall) + Immersion. - Lesser graphics (especially 2D images, like the generals around the table) - Area effect weapons in tactical battles. Be prepared to blow yourself up. It is way too likely to hit the table in front of you with a rocket.  I know that after Xenonauts there is no longer need for me to play the original XCOM. That is the best indicator of excellence this game could have.",
            "review_score": "1"
        },
        {
            "review_text": "A great spiritual successor of X-COM, balanced, well-planned and having lots of content, if only a bit unpolished and slow sometimes on weaker machines.",
            "review_score": "1"
        },
        {
            "review_text": "This is a more accurate reboot of the original XCom games with so much more depth than XCom: Enemy Unknown/Within.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just as frustrating as it is good. It's hard, it's buggy, it's capricious. But it's still the best turn based game you would ever play today.",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap, this game, smells and looks like the original X-com, but it looks like the original X-com we remember playing with our rose tinted glasses of the past, in laymans terms, that means that the original game didn't look as good as this, but we'd like to think it did.   Couple this with mod support and the outstanding community edition that is available through steam, and this game is a winner winner, chicken dinner.   You can play through this game however you want to, do you brink a vehicle or two extra xeonauts? do you bring heavy or light guns? just grenades? pretty much any strategy works on the battlefield if your patient enough to make it work. most games these days hold your hand, this one will help you at the start but just like a parent teaching their child to ride a bike you'll soon notice those hands on your back are gone, how long have they been gone? you don't know because this game is easy to learn, but very hard to master.  There will be times when this game will make you want to rage quit, thats normal, thats called building a connection with your troops and then some alien ♥♥♥♥♥♥♥ with his plasma power sniper rifle gets a lucky shot and blow out their head/chest cavity with a bolt of plasma, thats what happens when your going up against superior tech. Your only way to win is to get tactical.  Although iron man mode isn't the only way to play this game, its singleplayer you play however you want to play, want to load a save game everytime something goes wrong? you can do, its called learning. my first playthrough was somewhat like that, i took my fair share of losses, and even with repeated reloading, the game was still very challenging. My second playthrough is shaping up to be a much tougher, and rougher challenge without the reloading. And if i can justify giving this game another run through you can justify playing it if you have any love of tactical games. ( especially if it is on sale like it is right now!)",
            "review_score": "1"
        },
        {
            "review_text": "Xenonauts is a nice tactical turn based strategy game incorporated with RTS global management of your forces and bases. You will have to balance your money and forces to protect earth from the alien invasion.  To get your funding to fight the aliens you need to keep all the nations in the Xenonauts initiative protected so that they feel that they get anything back from the money they give you or they will abandon the Xenonaut project.  The turn based fighting are interesting and can be difficult if you do not proceed with care and tactics. One down side to the fighting is the limited amounts of maps and it can be a bit repetative. But hopefully v1.5 are going to address that problem, otherwise there are mods to fix and improve the gaming experience as well.",
            "review_score": "1"
        },
        {
            "review_text": "--Best XCOM Game Ever--  This is a remake of the oringinal XCOM game. Not the same name as it was done with seperate developers without the rights. Their goal was to stay true to the original...and they did an amazing job. It cleans up the old game with new graphics, interface, and engine but keeps the mechanics intact.   I highly recommend this game to any XCOM fan, especially those that would still play the original from time to time even 15-20 years later.",
            "review_score": "1"
        },
        {
            "review_text": "A fairly good remake of the original UFO. Maybe it does'nt contain the originals addictiveness although its the closest analog but remember there isn't really much competition. I would personally like to see the original remade with hd graphics and the same gameplay but will have to settle for the not quite as good firaxis modern day versions.",
            "review_score": "1"
        },
        {
            "review_text": "This game is for people who like X-Com. If you really like X-Com, you'll really like this game. If you don't know, get X-Com Enemy Unknown first. Great community for this game making mods to improve the game's variety and rules.",
            "review_score": "1"
        },
        {
            "review_text": "wooow, if you like turn based games this is a must!",
            "review_score": "1"
        },
        {
            "review_text": "Ascetic graphic, but deep gameplay. More tactical, more realistic and more complex than XCOM.   If You`re hardcore tactical games lover, You`ll most probably enjoy that game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is extremely well put together. All elements of the strategy to defend the planet from alien invasion are here. Aside from the occasional bug that makes it impossible to do the level, (Sometimes the graphics glitch out.) this game is damn near flawless. I even enjoy the nostalgic art style, as it reminds me of a time long since past in gaming. This game has amazing gameplay and replay ability as well. If you loved Xcom or any of the harder turn based strategy games of years since past, pick this title up and prevent earth from being conqured. Purge the alien. The Heritic. The Mutant. (Heh, wtb chainsaw sword.) Just kidding.   Commander in Chiefing of the Nerve HQ",
            "review_score": "1"
        },
        {
            "review_text": "Played a lot of TFTD decades ago.  It was a good game.  This is a good game.",
            "review_score": "1"
        },
        {
            "review_text": "A classic remake of  X-COM: UFO Defense  with proper inventory management and soldiers having more than 2 action points and being able to shoot more than once per turn and where you can build additional bases (referring to  XCOM: Enemy Unknown ).  The biggest annoyance is the interface which is not very intuitive:    finding a button to build a new base is close to impossible, it is just a text hidden somewhere at the edge of the screen    rotating a building before starting construction is another thing I had to google, even keys binding doesn't show that it's mouse wheel    no indication whether the quick save has been made    quick load doesn't work    in game launcher check-box 'window mode' is broken, the game starts in full screen anyway   The second bad thing is lack of economy. Infinite weapons, ammo etc.  On the good side, there is quite a decent choice of items, especially at the start of the game. There are also a few innovative items such as riot shield.  Over 40 hours of fun for ~£13 is definitely a good price.",
            "review_score": "1"
        },
        {
            "review_text": "I am a old gamer and loved the original X-Com games. I had tried the new version released the other year and I was massivly disapointed. It was just so dumbed down. It was very pretty but dumbed down.   This lead me to look around for X-Com again and stumbled across Xenonauts.   And I am so happy I found it. I can not praise this game enough. This is a real sucsessor to the original game. Thank you very much and I am not looking forward to Xenonauts 2, I feel it will be safe in your hands.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. Really captures the feel of the old-school X-COM games, with a lot of improvement to usability, looks, etc. The devs have done a great job communicating with the backers and have paid attention to feedback, bug reports, etc, throughout the development process. So glad I backed this on Kickstarter. If you were a fan of the original X-Com, or if you just like quality tactical turn-based gaming, then this is worth your cash.",
            "review_score": "1"
        },
        {
            "review_text": "Fanastic if you have beaten Xcom and are looking for something with greater depth.",
            "review_score": "1"
        },
        {
            "review_text": "If you ever thought XCOM wasn't enough like X-COM, this is the game you want.",
            "review_score": "1"
        },
        {
            "review_text": "A worthy successor to x-com. The tactical worldview and interception is much better than anything any x com game has done before. It really makes you feel like you are in the middle of a war, as opposed to the x-com satellite rush which leads to a the end game slog of knowing you won but just having to go through the motions. Would love to see what this team could do with a newer game engine.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game and the modern reboot of Jagged Alliance 2/XCOM. If you weren't satisfied with the recent XCOM games by Firaxis then perhaps give Xenonauts a look.",
            "review_score": "1"
        },
        {
            "review_text": "With only 5 hrs into the game I can say that it plays how I remember the original XCOM - UFO Defense back in '94.  It is funny how those 'great vga graphics' could pull you into a whole new world!  Xenonauts captures what was great about that game, but with a nice new high res graphics environment that although basic is more than enough for this kind of gameplay.  So far the good, that is more than enough to warrant my purchase.  The only things I find disappointing (minor) is the choice of uniforms, the early troopers look like sewage workers with old piz pans on their head. Even in the late seventies early eighties, special forces looked like special forces. In Xenonauts they look like early James Bond baddies...  Also there are too few conventional weapons, like SMGs etc. Although minor, I'd like to have some variation. The troops should look like the bad asses they are supposed to be, with the variety of weapons that Spec Ops use.  Being relatively basic in the graphics department (and weapons modeling) it should not be too difficult to address these matters (like the modding community is doing at the moment).  Also the maps seem to lack variety, even with my few hours of game play, that might become an issue in the long run. The way the maps are generate, might lead to the game becoming too repetitive.  Aliens have a tendency to pop in and out of their UFO, shooting when it is their turn and going back when it is the player's turn. Tedious and very gamey, of course a rocket or heavy weapon can remove the door and solve that issue. Still some AI tweaking seems to be in place, including interaction with the environment.  Still I like the game and it earns a solid 7/10, which could easily get above 8 if the developer gives it a little more attention, even if it is done through DLC.  ",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best turn based strategy games I have ever played. It is very well made; I have seen no glitchs or bugs, and the controls make miss-clicks a rare occurence. The difficulty scale is great as well. At the lower levels, it is more forgiving for new players yet still really fun. At the higher difficulties, it requires a high level of both stategic and tactical knowledge to survive, providing a very satisfiying challenge that I have not seen since Civ V.  The only problems I have with the game is that it does not tell how long some things may take to do, like researching tech and hiring new personel. This is a minor issue however, because after several playthroughs you have a general idea of how long these things may take to do.  Overall, Xenonauts is a great strategy game (9 of 10) and is well worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "If u liked xcom, u will like this, its awfully addictive, and terrribly frustrating, but most of all, its just great fun. Its got me hooked, at least for now! I have been playing the 1.5 testing version, and not had any real problems, except for those damn aliens killing my guys, when they not supposed to!  9/10 for being good at what its supposed to do, and 10/10 for the fun I am having with it  Btw, no crashes, no game breaking bugs so far, cant think of anything bad to say about the game, it is missing the cinematics you get with BIG budget titles, but hey, it makes up for it in gameplay  GET IT :) GET IT NOW lol, unless u dont like this type of game!",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely fantastic in every aspect, if you have fond memories of XCOM they will be rekindled!",
            "review_score": "1"
        },
        {
            "review_text": "If you played the original X-COM series, then there's nothing more to say about it. It is still as good as always :)",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game, true classic brought back to life.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the original X-Com, you will love this. I know I do.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly well done reboot of the old school X-COM games. Outside of a few bugs and occasionally wonky controls this is top-notch work and way more fun than any AAA title I've played recently.",
            "review_score": "1"
        },
        {
            "review_text": "8 rookies entered a crashed UFO... No one left. Keep on playing!",
            "review_score": "1"
        },
        {
            "review_text": "Brutal homage to the original X-COM. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I really have enjoyed the short time I have put into this game. After one Ironman run where I ultimately have to restart, I couldn't be happier! The amount of depth and customization is really great! I enjoy a lot of things about this game, and as someone who got into the Xcom series a bit late.. I find the UI preferable to the classics and the title a good way to experience the old elements of the xcom series that didn't carry over to the newest release. A good game in it's own right, and a good route to go if you want something harder in the same genre as enemy unknown/within. A great spiritual successor to the older entires and brings back memories of old school TBS gaming. The few little problems I have run across are more than overlookable. I am quite glad to see where this game has gone, being hesitant at first to hop on it until more development was accomplished! I would say in it's current state it is a quality product, well worth the price tag!",
            "review_score": "1"
        },
        {
            "review_text": "First and foremost, this is a brilliant game. The best way I can describe it is take XCOM: Enemy Unknown of 2012 and for every graphical superiority that game has that you take away, improve and refine an aspect of gameplay. This is UFO/XCOM of 1994 as a similar IP, the aliens are named and look somewhat different, but you're looking at a lovingly crafted tribute that far surpasses it's inspiration. If you didn't play XCOM 2012 because it was different and therefore dirty compared to your rose-tinted nostalgia goggled view of UFO/XCOM then this will certainly float your nostalgic boat.  Gameplay wise, believe me that the moment you research stun batons you want 3 dudes with high TU packing a baton and a riot shield. Storming a downed UFO is a cakewalk when you just stroll in and punch everybody in the face :D  I only have two possible critiques and they are that while the sprites are quite detailed, you really can't tell one soldier from another so it's hard to build the kind of bond you had with your troops in XCOM 2012 and secondly the fixed isometric veiw can sometimes cause you to leave a soldier in your dropship because you forgot him/her as you can only see the top of their helmet, that's happened a couple of times but isn't even a serious problem as you might guess. If those are the only two negatives my fussy butt can think of after around maybe 20 hours playtime it really boils down to one question: Are you a graphics ♥♥♥♥♥? If not, you really should buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "Exactly what a remake of an old classic is supposed to be. Unrelenting tactical combat with good-ol' isometric view. Safeguard the World, recover alien tech, research, upgrade defenses. Keep nations happy, or suffer funding losses. And even the devs of this game are a great bunch.   What more could you want? Get it now, especially if you are an old UFO-fan!",
            "review_score": "1"
        },
        {
            "review_text": "This game has everything you could ever ask for in an XCOM re-make. It expands on the concept and delivers high quality gameplay, graphics and sound design. In contrast to the Firaxis XCOM re-boot, this game retains the micro management aspect of base building and maintainence instead of skipping over those details for the sake of getting into more ground combat action. It's basically like a HD version of the original XCOM but with some added features and a cool cold-war era setting. I like it. :$",
            "review_score": "1"
        },
        {
            "review_text": "I LOVE IT  i really enjoy most xcom clones, but this one takes the cake.. very similar to the original, while actually improving some aspects like air battles and such! Ironman mode is the only way to go. and I love that this option exists. every game needs it!",
            "review_score": "1"
        },
        {
            "review_text": "This is quite literally what all the X-Com games up until this point wished they could be. Let me put it this way.. Xenonauts is to X-Com what Bioshock was to System Shock.",
            "review_score": "1"
        },
        {
            "review_text": "Captures everything that made the first xcom great. Perfect turn based old school combat and strategy. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a good game if you're into turn based tactical games. :) Very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Bloody good game!  (For badges!)",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much a newer remake of the REALLY old xcom. Same gameplay, mechanics, really haven't seen any differences (but maybe that's just because I haven't played REALLY old xcom in years).",
            "review_score": "1"
        },
        {
            "review_text": "Loved XCOM and this jsut keeps the turn based game going, no fancy graphics just time, strategy and mangement of the team.",
            "review_score": "1"
        },
        {
            "review_text": "Where Enemy Unknown would take XCOM and modernize it in one way, Xenonauts would take the spirit of the classic and modernize it in another.  If you wish for an XCOM much more in-tune with the spirit of the classic, scientist-hiring, time-units, chryssalid analogues and all that, Xenonauts is the game for you. It may not be XCOM by name, but it's XCOM by spirit.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a must have for any fan of tactical/strategy based games.  If you loved X-Com you'll love this, interface is clear and simple, no clutter, easy to find what you need.the AI offers a genuine challenge, it's delightfully unforgiving so save scum often, there is lots of lore to enjoy if that's your thing and lots of researching to be done if you want to stand a chance at winning.  For sure a 10/10, one for the collection of any Commander.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game in a finished product (which is not the norm for early access started games). It scratched that one, just going to play for a couple more minutes- that turns into hours- itch. Outstanding mods in the workshop. Unfortunately I could not get the best mod out there to work, but oh well. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I would write words to recommend this game, but they all seem inadequate. Buy it!",
            "review_score": "1"
        },
        {
            "review_text": "This Game is pure awesome.  Though it does take a bit of learning, it is worth every second spent playing it. I can't wait for a sequal !",
            "review_score": "1"
        },
        {
            "review_text": "A great reconsideration of the mid-90's X-Com. Build your bases, equip your crews, research your kit. Go forth and save humanity, one squad deployment at a time.",
            "review_score": "1"
        },
        {
            "review_text": "Its all the fun and frustratingness of the orgional X-Com games I can't wait until it reaches its release build. I love you Xenonauts.",
            "review_score": "1"
        },
        {
            "review_text": "To give you an idea of what this game is like, I wrote this:  You are the last man in your squad, Reapers have zombified every human in the city and to your dismay one of them pursuing you. You are too busy looking behind you to realize you have been backed into an alley, you look behind you once again to see your adversary facing you, Snappinng It's massive mouth with hundreds of incredibly sharp teeth. You can feel its hot breath against your skin, you think it is the end, and put your rifle's muzzle against your neck. But your luck changes, and you realize the reaper has exhausted their time unit supply. You lower the gun and point it at the reaper, '95% it will hit.' you think to yourself. You point your rifle at the reaper's head, and close your eyes. 'A 95% chance I will live.' You smile and pull the trigger. You hear the gun fire and feel the recoil of the bullet leaving the chamber, you open your eyes and hope to see a headless reaper corpse in front of you. Unfortunate as it is, you missed the shot and the reaper in front of you still has a head and still wants to kill you and use your body as a vessel for its parasitic spawn.  10/10 would lose 'Pvt. John Mctiggles' exactly like that again.",
            "review_score": "1"
        },
        {
            "review_text": " TL;DR Version  If you were a fan of the original series, get this game. If you're new to the genre, you may have some trouble.  Pros: Base Building. Deeper simulation. Solid tactical experience. Sweeter learning curve. Cons: Virtually No tutorial or guidance. Have to save a lot. Air-to-air combat mechanics are funky.   Full Version   It's almost impossible to talk about this game without comparing it to the latest X-COM remake, so I appologize for that. While the new X-COM feels like a modernized interpretation of the series, Xenonauts feels like a direct modernized sequal to the original series. If you're a fan of the original, it'll feel very similar, but you'll notice a number of subtle design improvements which are virtually impossible to detail here.  Ground combat feels pretty solid and similar to the X-COM series. The cover mechanics take a little getting used to, but the UI is quite straight forward. As with all X-COM games, there's still perma-death for any unfortunate soldiers. If you're a hardcore simulation fan, you'll enjoy the difficulty. If you're like me, and can't stand the loss of your beloved soldiers, you're going to have to save and load a lot. This makes for a bit of a stutter-stop experience, but from having loved the original series and the remake, I'm pretty used to it.  Xenonauts uses an 'action points' system similar to the original, that determines how much stuff each of your units can do per round. This inclueds the usual move-n-shoot, but also encapsulates rooting around in your inventory, crouching, reloading, and so forth. Conversely, the X-COM remake did away with this sytem in order to steamline the ground combat mechanics. While well executed, I appreciated the added complexity, especially around planning a soldier's loadout.  Xenonauts retains most of the base management mechanics from the original X-COM series, such as base layout, inventory, and staffing. Having this added amount of customizability really adds to the sense that this is YOUR base, executing on YOUR plans to save the world. While the X-COM remake again simplified this experience deftly, I still very much enjoy the added control that Xenonauts gives back to the player.  There are two major areas in which I feel Xenonauts falls short. One is the air-to-air mechanics. Now, when engaging an enemy ship, you can choose to enter this mini-game, in which you can control speed, limited maneuverability, and whether or not you want to retreat. Although you can pause the action at will, you don't have enough control of your aircraft for it to really matter. In the end, it's mostly a real-time battle. This feels like a disconnect in that the rest of the game is a tactical take-your-time-and-think-it-out type of experience. Even so, the game allows you to autoresolve these battles, so you don't need to worry about it if you're like me.  It's possible that this mini-game is much richer and that I'm missing out on some key mechanics, which leads me to the next area in which Xenonauts falls short; no tutorials. There is almost no explanation of how to play the game. At some moments, such as the first time you initiate an air-to-air battle, you get a big block of text, that doesn't really tell you how to succeed. Due to the similarity with the original X-COM games, I didn't have too much of a problem figuring everything out, except when it came to brand new mechanics (ie: air combat), but I can imagine it is exponentially frustrating if you're new to the series.  In the end, Xenonauts is an excellent executition of the original game complete with a mess of improvements and sweeter difficulty curve. It might not be as enjoyable if you're new to the genre, but if you loved the original, this is a must-have in your library.",
            "review_score": "1"
        },
        {
            "review_text": "Play it with the money and weapons mods because it makes the game fair on your end. The money mod makes sense so I didn't feel any gamer guilt using it. If the world was under alien invasion I am pretty sure every goverment would scrap the idea of money and just use whatever resources Earth had to defend it....not charge those responsible defending for a garage and such. The weapons mods do give you a good advantage in a ways but still those aliens will one shot you, through a wall or just walk right up to your units and MURDER all of them. You will miss just about every shot and each alien takes about three to four rounds but with the weapons mods it gives you a chance. The air combat is great and hope XCOM 2 has something along the lines. Overall it is a great game, has that looming atmosphere of the unknown, great music, the art is good (especially in the alien autopsies and weapon/gear descriptions) besides the character models. They could have done a bit more because your soldiers look extremely plain and paper cut outs. The micromanagement of your bases and world events is pretty awesome too. I suggest this game if you liked XCOM games in anyway. Just use the mods, my first ten hours of this game were without them and I was so hopelessly frustrated.",
            "review_score": "1"
        },
        {
            "review_text": "*Land at terror site *Position team in good firing lines in cover *Fight through rediculously tough waves of Sebillians *Sweep map and eventually corner remaining aliens *Reaper-Alpha appears and reduces your team to a bunch of drooling drones *Poo pants  X-COM, with teeth.",
            "review_score": "1"
        },
        {
            "review_text": "First timer to the X-Com related games. I thoroughly enjoyed it! Played it through twice, in fact! I totally recommend it for anyone looking for old-school tactical game, with a us-vs-aliens invasion twist. :)",
            "review_score": "1"
        },
        {
            "review_text": "More like the original xcom than the new firaxis version. Not really better just more faithful to the original.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games, i ever played and extremly modddable. ITs a true succcsor to the orignal x com searies. Also game is menal olypics to the extrme. Needs a fair amount of brain power and strategic thought, to wiin above normal difficulty.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  1.) Interesting and detailed cold-war era story/setting showing a believable struggle against a force that humanity barely understands.  2.) Every unit matters, losing soldiers, espically veterans, and vehicles is punishing.  3.) Nicely done tech progression system. You have reason/incentive for wanting to upgrade. 4.) Combat is balenced in such a way that while you have a chance to win. You're still the underdog. You have to rely more on strategy than muscle to win against the aliens.  5.)Varied alien types.  6.) Balenced out base building system. You can't spam several bases/buildings at one time and expect to win. They cost a lot of funding/time to make. So you have to balence expansion with needed supply.   Cons:  1.) Dogfights could use more fleshing out in terms of gameplay. Feels too simple for my taste.  2.) Night missions don't really have much point to me. It just a way for your troops to get slaughtered.   +/- 1.) Game is really forgiving on easier difficulties, often making the game very repetitive. The expierence doesn't truly shine till veteran or insane with iron man is on.   ",
            "review_score": "1"
        },
        {
            "review_text": "More like the original xcom than the new firaxis version. Not really better just more faithful to the original.",
            "review_score": "1"
        },
        {
            "review_text": "I've never been so exited about this kind of game since Jagged Alliance!",
            "review_score": "1"
        },
        {
            "review_text": "This game is for people who like X-Com. If you really like X-Com, you'll really like this game. If you don't know, get X-Com Enemy Unknown first. Great community for this game making mods to improve the game's variety and rules.",
            "review_score": "1"
        },
        {
            "review_text": "IF you like killing aliens and good tatical play, This is it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty great, during its early access period it had allot of bugs but has come a LONG way since then and is now more fun to play then even the new XCOM games (XC1 and 2 I have btw). The game gives you a sense of control and dynamic element like no other, plus looks good for a 2D game with great UI for most part.  Only thing lacking is graphics (only so much you can ask from a 2D game), and story. Definitely worth picking this up as its now on -60% special!  PS. Mods are great, and it works pretty well under Linux also :)",
            "review_score": "1"
        },
        {
            "review_text": "A pretty impressive reimagining of the original x-com. A little repetitive in places, the bases could be more frequent and the UFO spawns less scripted, but it gets the nostalgia feeling with smart updates to the original formula.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like outdated graphics of the original 90s XCOM you can get this instead. If you don't mind the old graphics you can just get OpenXCOM/TFTD.  Anyway, gameplaywise it's an improvement in that you don't need to manage things like ammo manufacturing, or selling alien loot which means less fiddling with your base inventory. And you'll get to keep armor out of dead soldiers assuming they didn't get blown up.  As for combat, researched weapons are usually just +1 of the previous one. Nothing wrong with that, I mean, infinite ammo laser guns on UFO Defense was ridiculous anyway. Also there's a new mechanic that lets you suppress enemies which makes them unable to reaction fire and start the next turn with half TU. Oh and you can't spam auto shot in this game either, so it mostly comes to play with a machine gun or flashbang, which are basically grenades that suppress enemies. You can't throw weapons or set grenade timers in this game either and play hot potato either. Which admittedly was cheesy anyway.  Anyway if you've played the 90s XCOM it won't feel *too* out of place. If you're new you can start getting into the gameplay and transition to the older XCOM and you'll do fine.",
            "review_score": "1"
        },
        {
            "review_text": "Prepare your tears, friends. For this game tugs, and tugs, and tugs.  Name your soldiers after friends, family, and loved ones. Pit them against the very horrors Space has brought. Watch them fall, and die.   Rinse and repeat, and that's how you get 40+ hours without nearing end game.   Workshop mods make this game so much more immersive and fun, just buy it, and experience what any turn based game should aspire to be.  Xcom is great too, as is Xcom 2, but even with lesser graphics, Xenonauts reigns supreme.",
            "review_score": "1"
        },
        {
            "review_text": "In X-Com, you trap the enemy with overwatch. In Xenonauts, the enemy camp the indestructible UFO, and overwatch the only door to access it. They know exactly where your team are, wherever they are. So they can sniper shot your team from across the map, way beyond the fog of war. Your soldiers usualy die in one hit, cover or not. Therefore, you often lose soldiers before you even know what you face. Lines of sight are a joke, as small obstacles likes a rock can reduce the chance to hit with a grenade, or even if you have the upper ground. Because the enemy have wall hack, the door game is atrocious. If they can, they'll open a door, shoot, then close it. You can't planify a breach like you do in X-Com. Air Game is nice tho.",
            "review_score": "-1"
        },
        {
            "review_text": "I do think Xenonauts is, in technical terms, a very well made game. However from a personal perspective I didn't enjoy it all that much.  Xenonauts is tedious. Most battles tend to feel the same which is in part due to the minimal number of lackluster maps (mods may at least provide some more variety). Losing is extreamly punishing. When a team is wiped not only is funding lost but also any of the very expensive gear the team may have been carrying. A very motivated player could probably manage this and even find it engaging. Others will be bored by it.  The game does at least provide far more depth than the modern revitalisation of XCOM.",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes every 20 mins now, Thanks update.",
            "review_score": "-1"
        },
        {
            "review_text": "Although I enjoy playing the game, it definitely has really clumsy and illogical mechanics to it.   The game has great artwork, and the actual strategy and gameplay is solid enough for me to want to play it for a few hours at a time (which is rare), but there are things in the game that make it hard for me to recommend it.  For example, corners turn out to provide 0 cover and there is no clearly defined cover system. This means that a guy crouched in a doorway with a riot shield is actually completely exposed from 45 degree angles. And the game is full of things like this. Where did you toss that grenade? At the alien? Or is it at your feet? You'll find out soon..  The game is full of small bugs, poor design, and crashes every once in a while.  The menu system is also extremely clunky, and could've been much better. A huge amount of the game is spend managing through the menu system that is simply painful to use, especially for the outfitting of soldiers.  And soldiers are completely depersonalized except for a portrait and their origins. No matter what backround or gender a soldier comes from, they will appear on the map as a faceless white guy. There is no dialog or anything.. just feels like a missed opportunity.  I love the game for the strategy and the cold war art style, but I just can't recommend it to anyone who isn't a hardcore strategy fan",
            "review_score": "-1"
        },
        {
            "review_text": "XENONAUTS FANBOIS BEWARE : THE FOLLOWING WILL BE A HARSH COMPARISON TO THE CLASSIC XCOM (1994 - 1995), DO NOT READ THIS REVIEW IF YOUR WELLBEING DEPENDS ON CONSTANT GLORIFICATION OF THIS GAME OR IF YOU GET UPSET EASILY :   (scroll down if you want to read about reality, please)                                        1) in parts buggy  2) bad, miniscule research  3) interesting aircraft-recovery, losing a craft costs nothing but WILL cost time (usually 72 hours)  4) difficulty-progression is worse / more steep than in XCOM (yes, the real, classic ones) - basically you have 2 years ... which is far from good and isnt any fun --- unlike XCOM in which the player has at least a decent amount of time before ♥♥♥♥ hits the fan  5) available money seems adequate at first - but if you dont want to lose after 2 years you will need to invest EVERYTHING and fear every loss because that can (and will) end the game. Thats XCOM on high difficulty, in this game its medium. Thats sad.  (i dont remember the exact difficulty-names, sorry)  6) research doesnt make much sense - the results are well explained but its senseless to gain knowledge about ARMOR during PLASMA RIFLE reseach, for example - that should've been available after 'alien alloys' .... and its only a small example  7) air combat is a bit more fun than in XCOM - but its also a bit harder  8) air-retreat has a big bug : the match ends only once the UFO (!) has left the screen, even if your fighter has already left  9) ground combat is ... not bad, it basically looks like XCOM with high resolution but in that case i prefer a lower resolution - either polish the classic combat in ways which make it better or keep it like it is .... there is no in-between, everything else looks pretty cheap to be honest and thats exactly what this game is -- even the dying-animations (if one could call em that) are cheap and consist of .... one (?) single step - in XCOM it was at least 2-3 per alien.  10) Music is good but the soundeffects are pretty bad - most sounds are missing or replaced by very bad ones  11) It has no XCOM-like feeling, the ground combat does not instill fear, there is zero tense anywhere and it looks like ... something boring.  12) ground combat-view is not rotatable. Yes. One of the most important features in tactical, turn-based games is missing. XCOM had it. Because its necessary.  13) the world map looks bad - even XCOM had a (much) better one, even in 3D  conclusion : its worse than the classics in some ways. The few additives make it worthwile for a few hours but thats it ... if you want a new (and ACTUAL) XCOM-follower this is not your game, its basically a bad version of what should've been released from the original XCOM-developers a few years after the last of the (original) series ... not bad but also not really good.",
            "review_score": "-1"
        },
        {
            "review_text": "UPDATED: With the release of version 1.51 I decided to give this game another go.  Unfortunately after putting in enough time to get to the final mission I still have to give this game a thumbs down. Much of the game has been improved, many bugs fixed but there's ultimately still some very weak or bad mechanics and a lack of balance to the game.  The difficulty level even at Normal is still punishing of even the smallest of mistakes. By the end game even with troops with almost all max'd stats using the best armor and weapons available it's not uncommon to be sniped at by monsters that are beyond view range and are very good shots, sometimes killing your soldiers in one hit or two hits. This turns the game into a load/save fest because if you lose your well trained troops in late game it'll be very hard to train new troops with bad stats up to the level your previous troops were.  There's still issues with visibility and firing angles that often don't make sense, such as cases where I'm 100% blocked from shooting an alien I can see but yet it can shoot at me. Also missed shots are entirely too erratic, standing right behind your own tank your veteran soldiers can still fire off a shot so badly aimed it hits and severely damages your own tank. Or trying to shoot an alien in a second story window and having the missed shot hit a stack of pallets 10 feet in front of my soldier at ground level. I've never fired a real gun in my life but I'm confident I could get the bullet to go in the general direction of the window with minimal training.  Morale also gets silly, my squad has been on dozens of missions, each member killing dozens of aliens, but still will find reason to panic or flee at times.  Many UI elements are not well designed or missing information. When you unlock new weapons that you can build in your workshop there's no tooltips in the workshop to provide details on what the stats of the weapons are. So you end up having to blow money to build a single weapon to then look at its stats to understand if you want to bother making more. Item weight is not listed in the tooltips either, you have to equip them and do the math to figure it out, not hard, but annoying. It wasn't clear to me until late game that when intercepting an alien craft you can send multiple planes. Hiring a soldier and putting them in a dropship requires going through 3 screens.  It's odd that you can't build other base buildings until the command center is completed. This isn't apparent until you experience it firsthand. So be careful - the second base you build is going to take 10 days longer than you think it will. They should really let you plan out/execute a blueprint all at once for the entire base. Take into account build times and existing structures automatically if you want.  'Run in Windowed' option only works if the resolution is less than your native desktop resolution.  Other countries that you don't have coverage over seem to lose money faster than reasonable when playing at normal difficulty even after version 1.51.  The entire interception portion of the game is entirely too tightly balanced and crucial to success. I'm here for the TBS not the interception game. Having said that, I can't stress the value in having a large air force and doing airstrikes on many of your alien crash sites. You can't and will not want to raid them all.  I ended up having to tweak the monetary values of several items in the game in order to loosen the difficulty up (on Normal) to something more reasonable to the point where the focus of the game was on the missions with your troops rather than trying to balance a checkbook.  Don't get me wrong, the game isn't horrible. However unless you're dying for a new TBS game (and I was) I'd recommend waiting till it's on sale before trying. If you're a fan of the new XCom and are expecting more of the same look elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Please be aware that this game is still prone to crashing alot, Ive had to hard reset my pc number of times. I bought this game last year and its still crashing. If the game was more polished I would recommend it no problem, but as of the date of this review I cant.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to enjoy this game. But I didn't.  It's hard to quantify exactly what sucked the fun out of the game for me, I think it's a combination of elements.  Graphics: awesome .. if it were the late 90s and the game were a direct sequel to UFO: Enemy Unknown. But it isn't. I just found the graphics - whether units, localities, base drawings .. to be very underwhelming. I know they were aiming for 'retro charm' possibly because they couldnt afford/achieve 'acceptable for modern gaming'. (I do like some retro-charm games, like FTL .. but I guess I suffer the graphics because I enjoy the gameplay.  Gameplay: where to start .. ? I found the AI to be pretty simple -- the action point system quite painful, especially managing large numbers of units -- the fog of war to be quite annoying (I dont mind fog of war in general, but in this game it's just an ugly mechanic and in many ways not intuitive .. like not seeing over a hedge) -- on a good note, the progression of units felt OK -- the strategic map and base building was OK but .. dunno, it didn't feel to me like a gripping financial sim, which was one of the appeals of the original.  Research tree, all the incidental stuff - dunno .. just felt 'been there, bought the t-shirt, don't need to go back'.  I had no particular expectation of the game .. which is usually a good thing because you're not set up for disappointment .. and yet somehow I came away disappointed anyway.  Maybe it's just because the formula hasn't aged well. I enjoyed the original games, played up to Xcom: Apocalypse (which I also enjoyed despite being outraged and culture shocked by the fact that they confined it to a city). But yeah .. in my opinion Xenonauts is a pretty bland game .. maybe a 6/10 ..  My advice is to kick the tyres and look at some videos before deciding to pick it up. ",
            "review_score": "-1"
        },
        {
            "review_text": "overly complex, unintuitive controls.",
            "review_score": "-1"
        },
        {
            "review_text": "Direct ripoff of the UFO series, which would offer a lot of quality time is implemented in a nice and clear manner. However, not only bugs like an occasional bullet through wall mar this incarnation of UFO, but the gameplay is basically broken. You'll end up with a boring series of save / make a move / see if it turns out well in the enemy turn / load. Save / Load. Save / Load.... which makes a boring play.   The reason to save so often is that you can ill afford losing soldiers, whose abilities will get better with time. Also if you're new to the game you have no way of knowing which research does what exactly and base management is a silly drag with limitted space.   What finally killed the game for me was the Predator armour. Going into action with two heavy armour suits had shown that they're a bit better than Wolf, but they'll easily get penetrated by the aliens.   Anoter note is that aliens are not much worse than your squad, so statistically your chances of making it through 100 fights with your people intact are zero unless you save and load and load and load ...  I've had more fun at work than playing this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I REALLY wanted to like this game and was excited that the team put together a turn based tactical game. Something that has been sorely missing for a while, but this game is just tedious. Aliens shoot you from way beyond your vision and through corners/walls that show as 100% obstruction. Enemies literally can be standing behind you without your knowledge as the Line of Site is absolutely wonky.   My 'elite' team sent out to save the world usually misses the braod side of any barn, while aliens with horrible vision seem like well trained snipers shooting around corners and despite 2-3 points of cover. The best hit chances for my guys usually tap out at 30%. I suppose I should have simply bought a baseball game so those averages would be quality.  Despite my best intentions, I just cannot give this game a positive review. There are hints of a great game here and there but the tedious pieces need to be addressed.",
            "review_score": "-1"
        },
        {
            "review_text": "Generally a good remake of original UFO: Enemy unknown in year 1994. Would want to give the game 'recommend'. However, the unrealistic setting in regarding to the financing, world political, world economy setting (by comparing to another xcom title - x -com : Enemy unknown) and the excessive punishment setting which prevent me to enjoy the game.  1. The organisation is poorly financed by the world and expectation is unreasonably high. Easily get financial punishment without a proper reason. Unable to expand due to financial problem. 2. Reward setting is poor. Success in high risk mission do not end up with equivalent high reward. (Destorying an alien base do not get apprasal from the local government) 3. Financing setting is poor. Limited option to get additional financing. Reselling price of advance equipment is unreasonably low just like the alien technology is commonly available to the world 4. With such high end technology and elite soliders on hand, the organisation can simply choose to walk away and get financial from other source (selling alien technology, equipment in black market, team with the most rich in the world) and deal with the alien threat on its own (just like some other sci-fi fiction). Therefore, the excessive punishment setting in the game is not enjoyable. Beside, if the government choose to kill itself, who care. The end of the government does not mean the end of the world, so long the organisation continue to exist. Sadlessly our real world actually telling you this in these recent years.  Anyway, the main point is, as a simulator, it would not be harmful if the game include the original rule set, improved rule setting and custom rule set for player to suit their style.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a copy of the original X-COM, where all original content is worse than what X-COM had, and the art style and UI is worse. I played it because it's like X-COM, but didn't finish it.",
            "review_score": "-1"
        },
        {
            "review_text": "Unlike some of the other reviewers I have no nostalgic tendencies towards games of this sort, I'm just a new user coming to it fresh. I found the graphics clunky and then spent an hour trying to work out how to kill some aliens at a crash site, with my soldiers shooting each other, before giving up. The rest of my steam playtime was idling for the trading cards.  Maybe I should have spent more time on it before writing a review but the bottom line is that I just couldn't be bothered. A game has to appeal to new users as well as experienced ones, and this fails miserably.   I'm afraid I can't recommend this as I've been spoiled by the far superior turn-based strategy game, Frozen Synapse.",
            "review_score": "-1"
        },
        {
            "review_text": "Hate to break it to you but the game really sucks, poor graphics, no rotation, no cover, interface poor. The point is there are 5 other games like this that are better in many ways with much much better graphics, so whats the point. I wasted 20 bucks. I would return it in a heartbeat if they allowed that.",
            "review_score": "-1"
        },
        {
            "review_text": "This started out hard, but fun. And then psionics happened to it. For a supposedly tactical game, half your success on missions comes down to 'not failing your save against psionic enemies with unlimited range and no line of sight required'. You don't get psionics to throw back at them, you don't get any counters to it, and you have no idea where the attacks are coming from. Usually it's some enemy on the far end of the map, so you can't even try and rush them to remove the threat.  It's not a challenge, it's just random rolls that occasionally mean half your team freezes and you waste a round. This game would have been better off without it, or limiting psionics to line of sight so you can do crazy OP tactics like 'scouting' and 'planning'. Get XCom-Enemy Within, it uses actual game difficulty rather than arbitrarily zapping you.",
            "review_score": "-1"
        }
    ]
}