{
    "app_id": 224040,
    "name": "LocoCycle",
    "release_date": "2014-02-14",
    "developer": [
        "Twisted Pixel Games"
    ],
    "publisher": [
        "Microsoft Studios"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Captions available",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual",
        "Racing"
    ],
    "tags": [
        "Action",
        "Racing",
        "Comedy"
    ],
    "achievements": 20,
    "positive_ratings": 197,
    "negative_ratings": 53,
    "price": 6.99,
    "description": "Newly self-aware, I.R.I.S. the martial-arts wielding assassin motorcycle, has begun a cross-continent escape to freedom. I.R.I.S.’s only ally is her engineer Pablo, who gets conscripted into the quest after his pant leg gets caught in her chassis. Hunted by the psychopathic motorcycle S.P.I.K.E. and a multinational weapons cartel, I.R.I.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/224040/header.jpg?t=1542845184",
    "minimum_requirements": "OS: Windows XP SP2 32-bit Processor: Dual Core Memory: 2 GB RAM Graphics: DirectX10 GPU w/256megs VRAM DirectX: Version 9.0c Storage: 15 GB available space Sound Card: Windows HD Audio Additional Notes: DirectX9 GPU not supported",
    "recommended_requirements": "OS: Windows 7 64-bit Processor: Quad Core Memory: 4 GB RAM Graphics: DirectX11 GPU w/1gb VRAM DirectX: Version 11 Network: Broadband Internet connection Storage: 15 GB available space Sound Card: Windows HD Audio",
    "reviews": [
        {
            "review_text": "It's not the greatest game in the world, but it sure as hell tries!!  Honestly, I don't even know where to begin with this title. I'll be honest when I say that my love for superbikes and motorcycles in general got in the way for me to pick this title right up with no initial reviews or expectations except that it had a bike in it... pretty much never having heard of it in development at all and simply saw it released today, I figured, 'Why the hell not? It's got a slick looking bike in it...'.  But boy lemme tell you, was I in for a surprise!  First and foremost, the game is a cinematic-spectacle with explosions going off in the game just about every 5 seconds (gameplay included) as you take command as I.R.I.S.: an extraordinarily advanced female-AI motorcycle. How advanced? You ever seen a motorcycle pull Brazilian jujitsu moves on a helicopter?! Yeah... THAT advanced! What a personality IRIS has got on her too... I imagine she must be some sort of distantly removed cousin of GLaDOS--the bubblier, more naive cousin who likes to talk about movies, wants to visit Scottsburg, Indiana, doesn't understand Spanish but pretends she does. Trust me, if and when you play this game, you'll completely understand what I mean...  The game itself borrows SO many different game mechanics, I don't even know where to begin with. If you've played Spyhunter, you've probably played this game before... except just as a motorcycle, that's it. As a motorcycle... wholly, the game plays like one of those oldschool arcade racers: Cruisin' USA, Ridge Racer, and Out Run come to mind. It even borrows elements from another unsung classic: ROAD RASH!! Yeah! It even copies bits of Road Rash at some point in the game! Yet further on in the game, I was constantly surprised by multiple other game mechanics that pop up. At times you're dodging things like in a Frogger game. Or button mashing like a beat 'em up--again, it's SO hard to say this game is ONE thing because it does ALOT of things at once or in various degrees throughout the game, and actually does them pretty well to make one hell of an experience.  FYI: there are quick time events in this game... ALOT of them, which also add into the rest of the expansive repertoire of game mechanics this game has got going on. And I'll be honest, I'm not that big a fan of QT-events, and I was all, 'Ah man, REALLY??' When they first showed up, believing they'd be very gimmicky or add nothing to the game; I again was surprised as to how effective they felt and were implemented in the game. This of course could just be subjective and someone else could disagree with me, but in my experience, it was pretty solid.  There's nothing groundbreaking going on in the title except that it has a certain charm you can't dislike about. For instance, there's alot of pop culture references in this game, most of them based off movies. And I mean particularly old movies: Men In Black, Big Trouble in Little China, Ski School... oddly enough I've yet to hear a single reference from Short Circuit, but I haven't completed the game yet. Instead, what I got going on here is to let everyone know what I've experienced so far, and it's a pretty awesome game. Again, it's not THE GREATEST title you'll play, but it does what it does very well and you'll have a blast of a time watching all the action sequences which rival up to the likes of some Pixar movies.   In short, the game is charming, it has moments where its made me laugh out loud and it's one of the few motorcycle based games out there that puts a 'CRANK IT TO 11!!!' Looney-Tunes type spin on some spectacular action sequences... I'm still wrapping my head around the fact I watched a motorcycle take down a chopper Zangief-style with its front wheel!!  Though I recommend this game, it definitely won't appeal to everyone and that's a shame because a game like this? Taken seriously? You're probably doing it wrong and seriously need to reassess your priorities in where they lie, because you can leave all your serious business at the door before stepping into LocoCycle's house. When you show up at this game's doorstep, prepare to leave reality behind and go back in time to that magical Saturday morning's cartoon weekend we've probably all lost touch with in this jaded age of ultra-competitive gaming going on these days. It's nice to know that a game like this is out there, because I couldn't imagine a world without LocoCycle; I mean I could, but it would probably be a little bit more boring.  I'd sit here and finish the game outright, but I got errands to run, a family to take care of--but once I've got some free time to myself again, I'm hopping right back in and see what else this fabulous little game has got to offer! And so should you!  6:32PM Update =  Finally got around to finish the game and it takes about 4 hours give or take how fast you're able to get through some of the levels, though the pacing seems pretty consistent, so I'm sticking with my guns on this and saying 4 hours. Wow.  Just. WOW!  As the progression gets further, the relentless amount of action (and even more explosions) never lets up pretty much all the way through to the ending, but it's not about the ending that gets me. It's the journey. Because from where I last left off, again, there were even MORE pop references from movies, but also other video games that LocoCycle shamelessly dishes out with comical effect, making the smile on my face wider and wider the more it got me reminiscing on my childhood past. The devs behind this game REALLY knew where to pull my heart strings on those little details!  At this point, I feel like if I drew this out any longer I'd just be wasting your guys' time, and that I might be spoiling some things about this game that you should really experience for yourself. This truly is an awesome experience of a game, and for 10 bucks, you can't argue with how much thought, care and effort was put into this title.  Check this out for yourself, people. Because I had a blast playing this through from beginning to end!",
            "review_score": "1"
        },
        {
            "review_text": "You gotta give them credit for making something different. Overall its okay. The game kind of lost its charm somewhere in the middle. Gameplay gets repetitive. The live action movies are interesting I suppose. Neat little game, worth a try.",
            "review_score": "1"
        },
        {
            "review_text": "Alright so after playing The Maw, 'Splosion Man, Comic Jumper, Ms. Splosion Man (on the 360) this is the first Twisted Pixel game i play on PC (using controller) so i don't know how the controls feel on keyboard. But this was the best game they have made to date, i had a blast playing, watching and unlocking everything in this game. Now i just want more LocoCycle!",
            "review_score": "1"
        },
        {
            "review_text": "That was a whole lotta fun. Simple, but not too simple of gameplay that varies enough, but controls well that is full of good humor. Great pick up.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe it's because I paid $2 for it, but the 4-5 hours I spent playing this game felt like a fast-paced thrill ride of chuckles and surprises well worth the price. In every other stage the game introduces a new trick to throw in your way, and the boss fights are well-imagined and executed. It's a bit on the easy side (okay it's VERY EASY), but this is definately one of those games where the experience is more important than the raw challenge. I've spent more money on games I enjoyed way less, so hey, if you catch it on sale, no reason not to pick it up and have a few chuckles and thrills.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing but great fun, graphics, soundtrack, story! Ty Devs for an Awesome ride!",
            "review_score": "1"
        },
        {
            "review_text": "I mean...it's something, that's for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Pick this up during the Steam Summer Sale for $2. This is by far the best $2 I have ever spent in my entire life. I would have paid $50 for this game. I highly recommend it to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Totally enjoyed this, didn't know a bike could be a kung-fu expert lol.",
            "review_score": "1"
        },
        {
            "review_text": "I don't care what anyone says, but this game is the ♥♥♥♥ and brings me back to late 90s arcade games and early Dreamcast days with souped up visuals. If you consider yourself a fan of that era of gaming as well as general whacked out ideas in general, you'll can't go wrong with this gem of a game at the sale price. I wish I had paid fullprice for it back in Feb its that good.  The corny live-action FMVs are pretty great as well!",
            "review_score": "1"
        },
        {
            "review_text": "Someone mashed together a mildly amusing B-movie and a severely mediocre game and ended up with something that might be slightly better than either one on its own but not particularly great overall. I got what I paid for out of it (almost nothing in a bundle), and I seemed to be having more fun than not while moderately sleep-deprived, so at least it has that going for it. It'll kill some time if you're looking for something dumb and are running low on options.",
            "review_score": "1"
        },
        {
            "review_text": "I paid $2 to warn you that this is one of the worst games I've played in recent memory. Don't let my sacrifice be in vain.  Seriously, I don't care how you feel about Twisted Pixel's other games, or if you liked Road Rash or other combat 'racers', or what. This is not good. It is not fun. Nothing was fixed from when it was the turd jewel of the Xbone's console launch until it was shoved out the door onto Steam months later to desperately try and make some money back on this abomination. The game is ugly, it is repetitive, it opens with a friggin 12 minute cutscene, and it has no respect for you, your time, or anyone involved in making it.  Do not purchase, period, easily one of the bottom ten games on Steam that isn't just a broken mess.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is broken, have had it for months and tried to run it periodically, never starts. I've contacted both steam support and the developers directly, neither of which have helped me. Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "LocoCycle is a good change of pace from what I normally play; FPS and RPGs. I bought the game about 4 hours ago, and have been playing it since. It is more fun than I expected and runs great on my system with no slowdown or graphics glitches that I could see.  An Xbox 360 controller is storngly recommended. With a wired 360 controller, I had no issues, until a couple of sections where you have to target objects using a reticle. I'm not sure if my gamepad was just not calibrated or this was intentional, but these sections were quite frustrating because the riticle kept moving to the bottom, making aiming very difficult. I hope this was just bad calibration on my part and not bad design. The game also did not save any of my progress, so I lost all my upgrades. Not that I mind replaying up to where I was all that much, but I hope this will be fixed soon.  If you can get past the ridiculous premise and down right silliness of this game, it can be quite a bit of fun. While the game mechanics are very repetative, they actually threw in a variety of enemies to try to keep it fresh. This game has it's flaws to be sure, but it's my new guilty pleasure.  Update: The game is still not saving my progress, and I haven't been able to pinpoint the cause. Maybe it is a permissions problem, but nothing I have tried has worked. I have disabled my anitivirus before launching the game with no effect. I've set the game and Steam to run with Administrator privileges, and I've tried both 32 and 64 bit options, but nothing works. My rig is a follows with nothing overclocked.  Core i7 2600k at 3.4ghz 16 gig of Ripjaw ram Nvidia GTX 780 Gigabyte ga-S68xp-ud3-ssid motherboard with built in 20gb ssd  3 1GB WD Caviar Black hard drives Windows 8.1 64 bit 850 watt 80+ gold certified power supply  I run pretty much anything maxed out at 1080P without issue. Right now this is the only game giving me problems. The game does seem very stable, but not being able to save my game sucks. I really hope someone comes up with a fix. Until then I will have to change my initial recommended buy to not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "You can tell they never prepared this well for a PC version. When you first start playing and are learning the controls, the controls it shows are for an Xbox controller. You can go into the controls within the settings and see the keyboard controls, but when you're starting out and it shows on-screen to push a button to do something you can't pause the game and look at the keyboard controls when this happens. So, you have to just push every button on your keyboard until you find the corresponding Xbox 'A' button on your keyboard. The how-to-play menu also, is in some Arabian language or something. The rest of the menus are in English, so I don't know why that particular menu is in some other language.   Combat.... The combat is very slow. You can hit your melee combat button 10 times with a .5 second interval between each button press and you will only do like 4 moves. Your health isn't even shown by default for some odd reason. You have to hit 'tab' to show your health and the other stuff in the bottom right corner.   The game does have a nice upgrade system. A good amount of upgrades in various categories as well.  That's pretty much all the good I have to say about this.  Just remember these are my opinions. Please refrain from going all brainless on me and argue with my opinions.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just...god awful... stay far away from it if you value your braincells",
            "review_score": "-1"
        }
    ]
}