{
    "app_id": 224300,
    "name": "Legacy of Kain: Defiance",
    "release_date": "2012-12-06",
    "developer": [
        "Crystal Dynamics"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Story Rich"
    ],
    "achievements": 0,
    "positive_ratings": 429,
    "negative_ratings": 61,
    "price": 4.99,
    "description": "Take control of two powerful and highly evolved vampires: Kain, an all-powerful demigod, and Raziel, a demonic angel of death. Each equipped with a legendary sword, Kain &amp; Raziel must battle through a world loaded with conflict and intrigue as they attempt to unravel their destinies and defeat the dark forces that seek to condemn...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/224300/header.jpg?t=1478895731",
    "minimum_requirements": "OS:Windows XP/ Windows Vista / Windows 7 Processor:1.8Ghz processor Memory:1 GB RAM Graphics:3D graphics compatible with DirectX 9 DirectX®:9.0b Hard Drive:2 GB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Here we are. The last part of the Legacy Of Kain Series. The almost perfect conclusion! It's a shame they stopped developping it.  The storyline is perfect and game mechanics have improved even further! The puzzle part is a tiny bit easier than the previous games but it's still hard enough to keep you immersed. Giving us the ability to play and see the story through both characters with their own strenghts and powers is exhilarating. Just see how badass Kain looks in that one! I loved this game as a teenager and now I can remember why heh!  Go for it. These vampires don't sparkle in the sunlight.  Vae Victis!",
            "review_score": "1"
        },
        {
            "review_text": "This is an EXCELLENT oldie. It still holds up pretty well today. From the superb voice acting to pretty exciting story, I loved this game back over ten years ago and the port is pretty decent. It supports all screens and my Xbox controller gets the job done! For $6 you really cant go wrong.",
            "review_score": "1"
        },
        {
            "review_text": "The Legacy of Kain is an AMAZING series. I lov this game i remember playing it on the OG xbox and playstation. The voice acting, the characters, the environments and lore are all so absolutely spot on and amazing. My only problem is platforming with the keyboard. Please when you get this game becasue i know you will. Have a controller by your side.",
            "review_score": "1"
        },
        {
            "review_text": "Oh wow, nobody recommended this? Why, this is one of the best games of my childhood.",
            "review_score": "1"
        },
        {
            "review_text": "10/10, would Kain again",
            "review_score": "1"
        },
        {
            "review_text": "Defiance is the final game of the seires, and as such resolves most all still hanging plot threads. more over, as the seires ender, i didn't feel cheated like some other 'seires capstones' to come out recently *looking at you Bioware*  once again, the game picks up where Soul Reaver 2 left off, and this time, you get to play as Kain as well.   this game is a must have if you liked the first two Soul Reaver games",
            "review_score": "1"
        },
        {
            "review_text": "The last of the series in this epic pentology series brings us awesome action sequence gameplay and most important of all closure for a really long storyline which in my oppinion is one of the best in games in general. Voiceover is epic performed by amazing actor's, soundtrack is awesome as it was since the beggining of the franchise. If you like story driven, action packed and atmospheric type of game's LoK Defiance or any in the series will offer more.  Some people wont like linear gameplay but it doesnt matter.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game. i love it!",
            "review_score": "1"
        },
        {
            "review_text": "Raziel was the Soul Reaver all along K a p p a",
            "review_score": "1"
        },
        {
            "review_text": "great theme, great story, great plot twist about Raziel :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game took me back to when I first played this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very Wicked Game To Own!!!",
            "review_score": "1"
        },
        {
            "review_text": "awesome game...if you did not happen to play this game before then you are losing a big chunk of your gamer life...",
            "review_score": "1"
        },
        {
            "review_text": "one of the best games I've ever played!!! 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Chances are you've already played the game. I know I have! In many ways it still holds up: whacking people with the reavers is satisfying, the combat system is simple and effective for stringing combos, the voice acting is legendary at this point, the story and mythology is also good. And this time you can skip cutscenes if you wish.  The things that hold this game back are: the slightly old sound design, the awful camera (infact platforming is the most dangerous part of the game as is it's hard to tell where you'll land), and obviously this game never got a sequel and never really ended. The camera is especially unfortunate since there are a couple of good environment puzzles.  If you can deal with the bad you'll find this time-traveling hack &amp; slash adventure a worthy sequel to Soul Reaver 2.  Word of advice:  If you have two monitors use only one (windows icon + P shortcut = computer only) to avoid problems with launching, and don't bother with the trainer that gives you the SR2 camera, it's not much better and sometimes creates bugs.",
            "review_score": "1"
        },
        {
            "review_text": "This was the game that tied it all together.  Gameplay-wise, I won't say it's the best of the series, but on a technical level it was somewhat groundbreaking in bringing us into the world of multiple-opponent combat in its genre. One of the big things they advertised about this game when it first came out was the ability to fight a crowd as a crowd, not let each one politely come up and get beat up when it's his or her turn.  Story-wise, this tied up so many loose ends in the series, and really made the story into what it should have been all along. Follow with me: The first Blood Omen felt like a one-off, a Playstation game that was kindof fun but wasn't really going anywhere. It was an overhead RPG-ish thing where you played as a vampire avenging his murder, and it made that into a bigger picture story where he was the victim of a greater plot. Then Soul Reaver came out, with its awkward camera angles hat nearly made the game unplayable, block puzzles that nearly finished what the camera failed to do, and where someone in their infinite wisdom decided that the Soul Reaver story needed to be cut in half to sell two games instead of one. I remember people dug into the disk and found content that was designed for continuing the story, but was unavailable in the game because they wanted you to play a second Soul Reaver. Then Soul Reaver 2 and Blood Omen 2 were released, with massively improved gameplay mechanics and graphics. The PS2 days. Blood Omen 2 was a little hokey for backfill, but backfill it did, and it added more substance to the Vorador and Janos characters. Soul Reaver 2 became more about tying the series together, and Raziel was less consumed with simply killing his maker as he learned more about the plot that entangled them all. And for all the mind♥♥♥♥ that the time streamer's games had played on the antiheros and the player, Defiance really brought us back in full 3D amazingness to the intro video and the events from that first Blood Omen. This is the game that tied it all together, and it did so in such a way that it made me love the entire series all over again. Questions I didn't know I should ask, like why did the guardian fail to protect the circle, and from whom, were replayed and answered at the same time. Just... brilliant.  Also, the voice acting pretty much made this series, as much as the game itself did. Simon Templeman is a total badass.  Last note; I played this through several times on PS2, and its predecessors once-to-four-times through on their respective Sony systems. Steam made me load it up for five minutes to review, but I've played it though more than once. My review is on the game itself, and I didn't include any technical details (OS, system hardware/performance).",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game when it was available on the playstation platform so downloaded for nostalgic purposes , contols can be configured to work with an X box controller but not complete support. some of the controls still need to be assigned to the keyboard. It is still a good game although camera angles are sometimes an issue and can lead to some frustration when trying to manouvere using a controller but on the whole still a good purchase. my verdict 3 out of 5",
            "review_score": "1"
        },
        {
            "review_text": "back in the days this was the best out there, up there with god of war.",
            "review_score": "1"
        },
        {
            "review_text": "Good port for PC. The story is god like.  The 2 things that bother me in the game though is 1 the camera angles 2 Every damn element forge is the same and you spend a good part of the game in these. Soul Reaver 1 and 2 had WAY better puzzles/Temples etc etc.",
            "review_score": "1"
        },
        {
            "review_text": "omg the camera following Kain is SOOOO BAD. I can't play this.",
            "review_score": "-1"
        },
        {
            "review_text": "Completely unplayable, Steam should not be allowed to sell games in this state. Have also played blood omen 2 and Soul reaver 2 which worked ok after spending a few hours trying to get a controller working and dealing with B02 incompatiblity with multiples cores. Steam is basically selling knock off goods here.",
            "review_score": "-1"
        },
        {
            "review_text": "Trust me when I say this: This game has not held up as well as I had hoped.  On one end of the spectrum, the combat is simplistic yet surprisingly satsifying, even the new combos you learn don't appear to add much more but make a world of difference when you realize you can infinite combo everything with a little practice, it almost seems as if infinite comboing as many enemies as you can at the same time is it's own separate game inside of this one; which is fine because you'll need to do something when you're not suffering from 'WHERE THE **** DO I GO?!?!??!' syndrome.   For those who don't know what I mean, this is when a game puts you in an open stage where half the doors are locked by stuff you have to retrieve from later on in the game and the other half of the doors are either hidden off screen by the camera or look like the last door you came through confusing you as to whether you're actually backtracking or moving forward in the game.  The story is laughable, the graphics are not as bad as I remember and the combat is fun at least; but this level design... OH GOD! I would like you to note that I may have three hours on steam but I have beaten the game when I was younger and remember everything quite well; that is, everything but how the stages were laid out. You will get stuck, you will get confused and you will want to rip the developers neck apart with your teeth and feed on their blood. But the joke's on you, with level design this heartless all you would get is a mouthfull of sand, and that's the last this you want to get stuck in your teeth.",
            "review_score": "-1"
        }
    ]
}