{
    "app_id": 224500,
    "name": "Gnomoria",
    "release_date": "2016-02-23",
    "developer": [
        "Robotronic Games"
    ],
    "publisher": [
        "Robotronic Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Workshop"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Sandbox",
        "City Builder",
        "Strategy"
    ],
    "achievements": 0,
    "positive_ratings": 2509,
    "negative_ratings": 698,
    "price": 10.99,
    "description": "Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/224500/header.jpg?t=1456262462",
    "minimum_requirements": "OS:Windows XP, Vista or Windows 7 Processor:2.0 Ghz Memory:1 GB RAM DirectX®:9.0c Hard Drive:200 MB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Normally I don't do reviews but I felt that w/ all the negative reviews since release I should do so. I have 528.5 hours in this game, so I can safely say that I've been through a few releases up to version 1.0. I can't speak for the bugs folks mention, as I have never run into any that were game-breaking myself, but I can say for the folks complaining about lack of tutorial is that it's difficult to write a tutorial for a sandbox game that leaves the details completely up to you. I can recommend you watch youtube videos, there are some excellent let's plays that will teach you the basics. You're also able to turn off enemies if you want to go through the learning steps a few times.  Some cons though: Now let's be fair, this doesn't have the complexity of Dwarf Fortress, I don't know if that's possible for any game right just because of what I know about DF. But it doesn't say that it's trying to be a DF clone so that's OK. One other thing is I hope the developer continues to develop the game and add new features, such as more workshops, more armors, more weapons, more traps, etc...right now the game has JUST enough material to justify $15, but I can only say that because I've played it. If I did not play it maybe I could not be convinced to pay that amount, I don't know.  All in all I DO recommend this game, if for nothing else but a step towards Dwarf Fortress.",
            "review_score": "1"
        },
        {
            "review_text": "Development is pretty slow but the game is good. Has Linux support which is great and overall is a nice timesink.",
            "review_score": "1"
        },
        {
            "review_text": "People here complain about developer abandoning the game... Actually, the game's complete enough to enjoy it (and been that way since its first appearance on steam). And not only enjoy it, but spend 300+ hours playing. And before the Robobob (dev's name) ceased working on game and disappeared for good, he managed to make a game open enough for workshop-devs to actually enable them to polish it to perfection. Definetely worth a try. Incredibly addictive and relaxing. 9.5/10 on 'fun' and 'quality' scales amongst the games of this kind.",
            "review_score": "1"
        },
        {
            "review_text": "Ever heard of a little game called Dwarf Fortress? It cast a long shadow for a one-man ASCII project, but if you could get past the atrocious interface it was a bewilderingly deep fantasy sim. Unique projects like that tend to attract imitators, and that's where we get Gnomoria from. But don't write that off as a bad thing just yet, because there's plenty of room to fiddle with the original formula.  Gnomoria plops you in the middle of the wilderness with a band of eight stubby settlers and a few supplies. From this humble beginning it's up to you to help your little friends find food, shelter, and purpose in life. There are extensive commands to have them effect change in the world around them, including numerous digging options, room designations, workshop placements, and foraging orders. You might notice there are no direct movement or action commands, and that's because everything in this style of sim is treated like an open order. When you mark walls to be tunneled through, one of your gnomes that can mine and has nothing better to do will scoot over and start tunneling for you.  You have further control over the order system by assigning jobs to your petite populace. There are several roles like Woodsman and Miner that can be further customized with granular tasks like 'hauling wood' or 'stonecarving', giving you full control over the workday. Of course, your gnomes will wander off to find food or drink or catch a nap if their needs persist, but they tend to be diligent enough in their tasks to not cause any headaches.  What WILL cause you headaches is the steep learning curve in Gnomoria. I know all of this sounds simple thus far, but the amount of production systems to come to grips with is staggering. The number of workshops alone is utterly gobsmacking, including professions like bone carving and weaving. Production chains can be frustratingly complex, and the best example of this is making a single bed. A bed is made from a frame and a mattress at a carpentry workshop. The frame is made from planks cut at the sawmill from logs felled outside. The mattress is made from cloth woven by your tailor, using cotton grown on a farm and a bone needle from your bone carver obtained by slaughtering animals. Thus to make a single bed, you need four different workshops processing goods from forests, farms, and livestock.  There are helpful tooltips that will explain where to get component materials, at least, and if you have all the workshops set up then materials will be auto-queued when ordering a finished product. Little quality of life features like this help make Gnomoria easier to come to grips with, but it's still very much a game that requires a wiki. A tutorial walking you through the foundations of production would be a godsend, and it's a shame that will likely never happen.  You'll run into other difficulties like trying to dig stairs and ramps in the chunky isometric interface, or rooms not functioning and not really getting any feedback why. However, I maintain that there's enough charm and variety to keep you pushing through the rough spots. You are given impressive reign to tunnel and build as you see fit, and sprawling underground kingdoms are not out of the question. It never quite reaches the bar set by Dwarf Fortress, as you don't have a wider world to explore past your immediate map and your gnomes don't have the psychotically detailed personalities of DF inhabitants, but the accessibility goes a long way towards balancing that out. Gnomoria makes a great entry point for this particular brand of ultra-detailed sim, with enough features and polish to keep you digging for hours.",
            "review_score": "1"
        },
        {
            "review_text": "I first bought this game in June of 2012 on Desura. I played about 150 hours before I activated my Steam key. Since activating I've played almost 180 hours more. The developer has been diligently churning out regular updates and solid communication for the four years I've owned it. He has listened to the community and truly shows how early access can work well.  Gnomoria is one of the greatest base-building games ever. The random start conditions (and extensive options for customized starts) result in a new challenge each time. It's frequently punishing, occassionally frustrating, and consistently fun. Players can enjoy a complex village sim with emergent gameplay that rewards patience and perseverance.   There have been many who have described Gnomoria as 'Dwarf Fortress Lite,' which is not entirely inaccurate, but it's (mostly) modern UI and colorful sprites make it far easier to overcome it's learning curve. It's easily one of the friendliest dwarves building fortresses games out there.  I highly recommend Gnomoria.",
            "review_score": "1"
        },
        {
            "review_text": "It's an alright game; it's very clearly heavily inspired by Dwarf Fortress, and unfortunately does not actually live upto Dwarf Fortress in the least bit.  7/10 Would gnome again; except I decided instead to just make a gnome race in DwarfFortress.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!   Unfortunately it appears the developer has abandoned it, so the few remaining bugs may never get addressed.  This doesnt detract from the fact that this is a fantastic game and is worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "By way of content, this game is a lot like Dwarf Fortress without the asymptotic learning curve at the beginning (there's still one, mind you).  The mod support that came out in late early access definitely helps the community build more upon the base game but at the same time allows the developer to throw out the majority of the future plans listed on the game's website during early access because the game is technically finished.  Scripting mod support (Lua??) would be gratefully accepted, even though we'd be wishing for a miracle.  Overall, the game is very enjoyable and I would highly recommend this game to fix that fort management itch.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite game of all time. It is heavily inspired by Dwarf Fortress but is still unique and in some ways I prefer over Dwarf Fortress.",
            "review_score": "1"
        },
        {
            "review_text": "You can smash goblins with doors and turn gnomes into cyborgs. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love this game! There are many qol features I wish were added but I think they might be addressed by mods in future.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, fine ware for you money. Tough curve at start but it pays off to learn it.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game.  If you have trouble getting started it is because there is a lot of depth here. Just take it slow. Figure out how to play on Easy, then take on a higher challenge. VERY challenging but so worth it.  FUN!",
            "review_score": "1"
        },
        {
            "review_text": "As many others have noted, Gnomoria is in no ways complete, and seems to have been abandoned by Rob. However, I still absolutely adore this game. It's often my go to game to just mess around, make a new world and give myself some random goal. There's still some modders working on the game to add new features, and I've never personally experienced any of the major bugs. It's a pain to learn the interface, but if anyone really loves survival/building games with a lot of micromanaging, I would encourage you to learn by watching a let's play.  It's sad the dev never got to add all the features that were in his vision, but I've sunk more than enough hours into the game that I'd definitely buy it again despite it's unfinished state.",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "First of all i would like to say that i realy loved this game. Ive played well over the amount of time I originally was intending. With that being said, I am fully dissapointed with the final release, we were told that magic would be added, and wasnt, we were told that gnomes would have more personal goals and actually leave if those goals were not met. as well as some other things. The final version has been left up to the modders to finnsh. This practice in my opinion is lazy. Considering how long we had to wait for patches and updates, this practice is a slap in the face to all the fans of the game. I understand it is one developer, and i understand he has a life. But if you tell us one thing and then do another your no better then all the othe companies that took our money and said eff it. Please dont let this be the end of the devlopment and realy on modders to do the work, you turn them into free labor and make yourself look like alazy doosh in the process. Being a developer myself I understand the need to know when to stop a project. I also know that saying one thing and doing another is an awful way to go about your game. EA has done it, SquareEnix has done it, this does not give you the right to do it. Untill these practices have ceased the Indie community will be no better then the AAA community. Dont slap your fans in the face and be a lazy devoloper, mods are fun but content from the developer is better. I will recomened this game but I do not believe it is any better at full realese then it was when it was put on for early access. Dont let this stand.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little time-waster and isometric version of Dwarf Fortress.",
            "review_score": "1"
        },
        {
            "review_text": "Game is good, spend many hours on this before Steam.",
            "review_score": "1"
        },
        {
            "review_text": "I looked at negative reviews and doubted them, now I understand. This game was rushed. The AI are all mostly mentally challengedand The maps take a unreal amount of time to generate even the most simply maps. It is a fun game, don't get me wrong, but they really need more work. I recommend thi game, but for a later date. when they all get it together and start updating everything. the negative aspects nearly out weigh the positive ones but the positive wins. Get the updates out and this kind of review will be all but gone.",
            "review_score": "1"
        },
        {
            "review_text": "I like the game, and I've played it a lot, but I don't know how to open up the dev console. Can anyone help?",
            "review_score": "1"
        },
        {
            "review_text": "Superb Base building/management game. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's games like this i start up and then say why am i playing this. Then its 2am.",
            "review_score": "1"
        },
        {
            "review_text": "Still one of my go-to god games. Think 'Dwarf Fortress light' with much better art.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. So addictive. Very creative. I give this game a thumb up.",
            "review_score": "1"
        },
        {
            "review_text": "As you can see I have a few hours invested in the game (just a few).  For an independent development it is very forgivable for the small issues the game has, if they can be considered issues. There is plenty of ways to play the game and I still have a lot of fun.  The game is very much playable, lots of fun, and once you learn the mechanics it is fairly easy going and can be, at times, very funny. Call me morbid, but I think it's hysterical when a Gnome loses a limb, or picks up a goblin arm and appears to be beating his buddy with it.  There is plenty of room for changes and more patches, but this is far from being listed as abandoned. They did a fairly decent job.  74/100  Original Review: A wonderful city building sim revolving around gnomes. Addictive gameplay, very replayable, and goblin dismemberment. What else can you ask for!?",
            "review_score": "1"
        },
        {
            "review_text": "It's alright I guess",
            "review_score": "1"
        },
        {
            "review_text": "when the game first came out on early access i fell in love, and then forgot about it today its publicly released. so im gonna play it now, probably fall in love again, and then forget about it",
            "review_score": "1"
        },
        {
            "review_text": "Addictive",
            "review_score": "1"
        },
        {
            "review_text": "Im really used to hate this game, until it came out fully! First I got this game for free, and now its one of my favorite games! It has great music, and so much exploration!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. It doesn't have anything to help you learn it, and that's truly unfortunate.  There is a surprising amount of depth and strategy involved, and a very interesting method for directing your gnomish civilization. People who have played games like Dwarf Fortress will be familiar, but in short you don't get to give orders.  Instead, you assign jobs to gnomes. You tell a gnome that they should be a farmer and chef, tell them how to priorize their tasks, and then you designate tasks that should be done. For example, you specify an area to be a farm, and that the farm should have hweat planted on it. The gnomes who have farming on their job list will take care of the tilling, planting, and harvesting as they can.  You oversee and take care of planning and organizing, but you don't micro-manage the gnomes.  Tips!   A couple of tips going into the game, I highly recommend that you start easy and work your way up, possibly even disable hostile creatures and raiding parties the first time. Also, if you do have hostile creatures, organize your gnomes into squads early, and put all gnomes into squads. Non-combat gnomes can be put into a special formation, and you can specify that they avoid enemies and don't take orders, then you can't accidentally assign your civilians to combat. If you don't do that, then all gnomes will fight to protect their home, which isn't always what you want. In addition, this will allow you to assign armor and extras to all gnomes, for example you can have all civilians carry torches in their left hands.  ",
            "review_score": "1"
        },
        {
            "review_text": "Despite its annoying imperfections this game keeps me coming back again and again to manage the life of a handful of gnomes. Bought this game 8€ when it was in developpement, play time tells about cost/value ratio",
            "review_score": "1"
        },
        {
            "review_text": "212 hours of playtime and I still don't know what the hell I'm doing.",
            "review_score": "1"
        },
        {
            "review_text": "For the 15$ price tag Gnomoria presents an outrageous value.  Sure, it's not dwarf fortress.. but it's still pretty complicated and easily can give more than 40 hours of enjoyment. Far more if you get into it.",
            "review_score": "1"
        },
        {
            "review_text": "Great fun! Takes a while to get into it and is a pain in the ♥♥♥ when Goblins come and kill all your Gnomes. Highly recommend, if you enjoy a very challenging, creative, survival and builder games.  It's greatest appeal to me is how similar it is to Dwarf Fortress - not quite as indepth but much better graphics.  Bugs I found:  - Chizel doesn't autobuild - Gnomes soldiers don't always attack all at once. - Gnomes don't always retreat, even when well enough to do so. - Goblins tunnel, even with there is an entrance to base sometimes. - Belows won't auto build. - Goblins tunnel exits, when clicked, crash game.  Improvements I recommend:  - All corpses should be butcherable - its makes the ethics of the game more fun! - Gnomes shouldn't spend ages organising stockpile - put it down and forget about it. It doesn't matter what it looks like! - Male and female Gnomes should pair up and mate under good conditions. - Not everyone doctors (easily moddable). - Woodcutters not grove peeps (easily moddable).",
            "review_score": "1"
        },
        {
            "review_text": "It's kind of like Dwarf Fortress Lite. It's really fun and addictive, and starting a game over never feels like a chore. It could use some improvements (mostly related to gameplay depth) but still, Gnomoria is one of my best purchases on Steam!",
            "review_score": "1"
        },
        {
            "review_text": "Run your own gnome hideaway in Gnomoria. You rule over several gnomes as you get them to gather resources and build up a base to defend yourselves. Start out in a small cave and build a super structure full of treasure rooms, grand halls, dorms, farms with livestock. Trade for those pesky finite resources. Defend from creatures that want to take what you have. Fail and all your gnomies will die, thrive and more gnomes will join you to follow your every command.",
            "review_score": "1"
        },
        {
            "review_text": "Still in Beta but shows a lot of promise in the future. As of now the developers need to work on the A.I of the gnomes. Even though I am liking this game thus far, the A.I is making it nearly impossible for me to make it through the beginning stages. I would still recommend this game and I am excited to watch it grow as I did with Minecraft three years ago :)",
            "review_score": "1"
        },
        {
            "review_text": "Well, no more updates apparently, which means that none of the bugs will ever be fixed - the game can still be enjoyed, but it will never reach its full potential. Too bad, could have been a great game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game's AI is some of the worst I've ever seen. Constantly building walls closest to them, and then blocking themselves in with that wall until they starve to death. Carrying 63/64 blocks of stone in a wheelbarrow and would rather walk past the stockpile to get 1 apple the other side of the map to fill it up first. THEN he decides 'I'm tired' drops his stuff all over the floor and then comes back... WHILST HE WAS ON HIS WAY BACK ANYWAY. My gnomes then go out to clean up his mess, and no-one uses his wheelbarrow. They pick it up one at a time... BLEEDING GNOMES who are dying would rather bandage a sprained ankle than stop the bleeding. 3 bandages used and my gnome sill died... Digging, a major part in this game, is something you have to manage constantly! You can't leave the gnomes to do it themselves because they can't do it right. Telling them to dig a square out of the ground, they end up going for the closest line, which cuts off access to the rest. Or worse, they trap themselves in the middle, stuck on a single block. Bandages are insanely important in this game where gnomes hurt themselves daily just trying to eat and drink or sleep. Don't even bother having one try to fight a wild animals for food, because you'll lose 4 gnomes trying. Except, you HAVE to kill wild animals to get bones, which you need to make needles, to make bandages...  This game is like babysitting 9 children that live in a knife factory. It's not fun. Basic tasks are like trials. Everything has to be micro managed. In a game where you have no control over your gnomes, it needs you to control them, constantly. This game needs to either have it's play style overhauled totally, or they need to hire a programmer who's not lazy to fix the AI.  I wanted this to be the Dwarf Fortress with a decent UI that it claimed to be. It failed horribly. The UI is staggeringly basic and makes me think back to the days of Windows 98. Menus and submenus in awkward places with unhelpful icons. The one thing this game is meant to be better at than Dwarf Fortress, and it's awful. Seriously, for a game I PAID for, I was expecting more. DF is 100 times better. Gnomoria is nothing more than a cashgrab aabusing the pupularity of DF.  If you want a decent DF style game with graphics, I suggest RimWorld. It went for a scifi theme probably to avoid copy-pasting from DF, but keeps that gameplay. Focused more on a small colony and survival, it's different, but is fun for the same reasons. It's still in Alpha, but has a thriving mod community and hard working programmers.  ---- Another playthrough later: 5 months ago this game left early access, implying it was finished. This game as it is, is how they think it should be. I'd be more understanding if it was still a beta.  I gave the game another go today and found a gnome sitting at the bakery, I guess trying to pick up some bread? Only they couldnt, their wheelbarrow was full, so they just got stuck. Until finally getting too tired and dropping all 30 items on the floor. Which disables a workshop...  I've also noticed in combat that no-one has any health. The only way to kill an enemy is to make it bleed out. Even after injuring every single limb on an enemy, my gnomes will keep whacking away at it pointlessly. Sometimes even bleeding to death themselves before the enemy does. This lack of HP is why I just had my 15 dwarves killed by 4 beetles. Goblins are easy, but beetles which give no loot are as unkillable as any wild animal. The combat is simply broken.  I just still can't get over the fact this is called a finished game. I played it again just now because I thought I was being too harsh. And I'll probably do the same thing a month or two from now. Only to keep proving I wasn't being harsh enough.",
            "review_score": "-1"
        },
        {
            "review_text": "I really liked this game. But the developer completely abandoned it and let modders do the work.",
            "review_score": "-1"
        },
        {
            "review_text": "MAKE IT OPENSOURCE IF YOU THREW THIS PROJECT.  Repost, please.",
            "review_score": "-1"
        },
        {
            "review_text": "This game used to work and was pretty cool.  Then the dev kept trying add more stuff, broke it, called the game finished, and vanished.   Avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Gnomoria was an addictive early-access 'Dwarf Fortress Lite' game centered around an isometric view, actual graphics, and the titular gnomes. The game is charming in its own way, the varety of gnome sprites brought a modicum of life to what would otherwise be smiling icons. But aside from Gnome looks there isn't much else varied in the game.   You have your standard farms and produce, your varieties of stones, a smattering of metals, a few AI 'kingdoms' to trade with and that's about it.  No, really. Unless you count the monster varietes, all of which but three can be countered by simply lighting your mines with torches. Skeletons, Zombies, Beetles, and Spiders simply aren't a threat to any player (read: most) capable of planting torches on the floor. The rest are periodic goblin &amp; ogre invasions that scale in size and armament with the 'wealth' value of your realm. Not that the scale of these will kill anything other than your framerate when you reach a point where you can trap them in corridors and let them starve to death. The last enemy is the mant, chitinous men-ants who spawn in numbers based off your food storage and can be completely circumvented by killing a scout spawned a day or so before a raid.  These threats do not become more challenging over time as much as they become higher in number. Attack frequencies never increase, there are no bigger threats, and they're routine enough to be completely predictable. The difficulty curve in this game stems from the lack of a tutorial and the creeping FPS death and bugs (both beetle cascades and crashes).  If you're wondering if the game has any mystical or otherwise big events/features/content, I can say there's none. Once you learn the mechanics (and the gnomish mechanisms), the game becomes trivial in the extreme. So yeah, 'Dwarf Fortress Lite' in the negative sense of the phrase.  The game lacks in significant and essential content it sorely needs to justify itself as a finished game, such as a deathcare system, expanded economics and management(No royalty/nobility! Though you might consider that a good thing) , and a meaningful way to interact with the game world outside your kingdom.  To top it all off Gnomoria does not support resolutions higher than 1080 and the developer has not and will never make any attempts to ever support them. Enjoy playing in windowed mode if you've a higher resolution monitor.  Gnomoria was good for an early access game. It is not a finished game worthy of release. Sacrificing the last 2 years of development to focus on mod support at the expense of sorely needed content made this game another warning against Early Access.",
            "review_score": "-1"
        },
        {
            "review_text": "It was great while it was being updated, but now that it's abandoned I can't recommend it at all. Too much is still unfinished and buggy to be called a released and completed game.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, you can buy Stonehearth and get almost same thing in new 64bit instead of this abandoned sadness. From start not so bad idea, but who cares when it rusts in field in unusable condition? Run away from this at this point, if you can..",
            "review_score": "-1"
        },
        {
            "review_text": "Save yourself some money and download Dwarf Fortress. The dev still updates that game where this one is pretty much dead.",
            "review_score": "-1"
        },
        {
            "review_text": "Between the random crashes on Win7, and graphics artifacting on Linux (only game out of my library that does this), I have not been enjoying this game as much as, say, Towns. Can't recommend it in its current state.",
            "review_score": "-1"
        },
        {
            "review_text": "Abandonware. Don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a good clone of dwarf fortress minus some of the complexity. Still alot of game crashing bugs though, sadly. Might want to wait to see if they patch the issues before buying. Way too many game crashes to enjoy in long run.",
            "review_score": "-1"
        },
        {
            "review_text": "good game but the ai is really bad (i always lose my entire kingdom to thrist since NONE ever build anything except the crude workbench. I have lost a few kingdoms to a single badger or golem)",
            "review_score": "-1"
        },
        {
            "review_text": "Yet another incomplete game pushed into 1.0.",
            "review_score": "-1"
        },
        {
            "review_text": "So it has finally been 'released' and with hardly any updates apart from more tinkering around the edges.  I guess i should correct my comments below to 'Now that it is 'finished' you should not buy the game. The Dev has abandoned it progressively over the past 2 years and 'released' it just to pretend it was done.'  *********************************************************************  NOTE: Look at the time of the last Update. February 2015 and it was a minscule Update at that. If it ever gets finished (BIG IF) then you should buy this game. But honestly, that is not going to happen. This game is dead in the water  *********************************************************************  I have had this game for a while and came to it because i did not have the time to dedicate to Dwarf Fortress and also wanted something with more intuitive control system and at least minimal graphics.  My initial expectations were met but each time i pick up the game (after 3-6 months off) i come to find very little has changed of value. Development has slowed to the point where it is a legitimate shock when there is an update and then disappointment when you discover that what is an 'Update' to this Dev would be a tinkering of the system in any other game.  If, and thats a  BIG  if, it gets released then it might be worth buying but it is essentially dead in the water and has been for quite some time.",
            "review_score": "-1"
        },
        {
            "review_text": "Game has been Abandoned :( Before that it had great chance to be good.",
            "review_score": "-1"
        },
        {
            "review_text": "I've played a few similar games (Zoo Tycoon, Theme Park World, SimCity 2000, various sims games, Holy Potatoes, Swords &amp; Potions, AdCap &amp; Game Dev Tycoon) and after getting a bundle containing this game I wanted to give it a quick try.  There is no tutorial so I don't really know what I'm supposed to do. I feel like even if I did, it would be boring to build and manage my village in this 2d isometric setting.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought this in 2013 in Early Access. It released this year finally. It took 4 minutes to generate a map that had graphics similar to an early 80's videogame console system. It looks like it is running at about 1 or 2 frames per second.  There is no tutorial. There was supposed to be a tutorial. Don't buy this game unless you already know how to play this game.  It took 20 seconds to save my game before exiting.  Maybe when I load it up next time to get my last 2 trading cards, my gnomes will have figured out how to pick up the logs from the trees they cut down. If the tutorial has been put in by then, maybe I will figure out how to make them do it.",
            "review_score": "-1"
        },
        {
            "review_text": "only one way to describe INSANLY BAD",
            "review_score": "-1"
        },
        {
            "review_text": "Open source please.",
            "review_score": "-1"
        }
    ]
}