{
    "app_id": 224760,
    "name": "FEZ",
    "release_date": "2013-05-01",
    "developer": [
        "Polytron Corporation"
    ],
    "publisher": [
        "Trapdoor"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Indie"
    ],
    "tags": [
        "Platformer",
        "Indie",
        "Puzzle"
    ],
    "achievements": 12,
    "positive_ratings": 10641,
    "negative_ratings": 928,
    "price": 6.99,
    "description": "Gomez is a 2D creature living in a 2D world. Or is he? When the existence of a mysterious 3rd dimension is revealed to him, Gomez is sent out on a journey that will take him to the very end of time and space. Use your ability to navigate 3D structures from 4 distinct classic 2D perspectives.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/224760/header.jpg?t=1472521163",
    "minimum_requirements": "OS:Windows XP SP3 (for Version 1.11, accessible through the 'Betas' tab) Processor:Intel Core 2 Duo 2.8Ghz or equivalent Memory:2 GB RAM Graphics:2nd Generation Intel Core HD Graphics (2000/3000), or dedicated GPU with OpenGL 3.0 Support Hard Drive:500 MB HD space Sound:OpenAL-compatible Additional:See <a href=\"https://steamcommunity.com/linkfilter/?url=https://getsatisfaction.com/polytron/topics/support_for_intel_integrated_graphics_hardware\" target=\"_blank\" rel=\"noopener\"  >https://getsatisfaction.com/polytron/topics/support_for_intel_integrated_graphics_hardware for details on Intel HD Graphics support, not all models are supported. Latest graphics drivers are required to maximize OpenGL feature compatibility.",
    "recommended_requirements": "OS:Windows 7 (for version 1.12 or later) Memory:4 GB RAM Graphics:nVidia GeForce GT 240 or better Additional:See <a href=\"https://steamcommunity.com/linkfilter/?url=https://getsatisfaction.com/polytron/topics/support_for_intel_integrated_graphics_hardware\" target=\"_blank\" rel=\"noopener\"  >https://getsatisfaction.com/polytron/topics/support_for_intel_integrated_graphics_hardware for details on Intel HD Graphics support, not all models are supported. Latest graphics drivers are required to maximize OpenGL feature compatibility.",
    "reviews": [
        {
            "review_text": "Note: This review is for FEZ, not Phil Fish.  Acclaimed as one the best indie videogames ever made, FEZ is a puzzle platformer in a 3D space composed of 4 2D planes. I agree that this game is nearly perfect. It's fun to play. The controls are okay. The music is cool. The art is brilliant. And there are good designed puzzles. And the best part is it's difficulty: in this game you need to collect 32 normal cubes and 32 anti-cubes, among other things. The normal cubes are easy to find, and to beat the game you only need 32 cubes. So, if you're not very good with puzzle games, you can beat this game. Since it has (almost) an open world style, if you get stuck you can just keep moving ahead, instead of being stuck forever. The anti-cubes are harder, but some are easier to get than others. But getting them all is a real challenge. And there are also 3 red cubes, which are extremely hard to find. So, this is a game for everyone. I think it has the right lenght, but it can be annoying sometimes, for example when you need to backtrack. This is definitely one of the best games i ever played, a true masterpiece in almost every way. Buy it now (on sale is even better).",
            "review_score": "1"
        },
        {
            "review_text": "Love Fish or hate him, only a cynically biased person could resist praising this game. It's a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Short answer: this is a masterpiece.   Long answer: it is sad that most people would turn down this amazing experience just because they care much more about the hate they feel towards its developer, whose opinions and points of view got taken way out of context by the media. Those people miss an excellent opportunity to be immersed in an unique platformer whose environment is breathtaking and truly puzzling. I'm so happy I discovered this work of art and I would do anything to make its sequel see the light of day. But I guess good things come in small packages, and Fez offers more than enough.",
            "review_score": "1"
        },
        {
            "review_text": "Another quaint puzzle platformer that takes a revisionist lens to the retro games of a bygone era. I'm sure everyone's tired of them. But, you should get over it and play Fez. I can't imagine why you haven't already. You've seen all the praise right? Well if you are holding back from playing Fez to look cool, or because you hate Phil Fish, really, you are only hurting yourself.  If you have an ounce of interest in puzzles or platformers, or puzzle platformers, congratulations! You should own this, you should play it and figure everything out. The aesthetics are exremely well done, but i'm not going to dwell on them. Fez's key mechanic is perspective shifting. You are a 2D character that can rotate which face of a 3D world you are on. I am not going to pretend this mechanic is brand new (Ortho comes to mind, though there is probably an older example), but it is done extremely well and makes for some very interesting puzzles. On top of the dizzying perspective switching, there is also a whole language you have to learn to solve some of the puzzles.  The ending is also one of the most beautiful things i've seen and the new game plus features one of the best punch lines out there. It is an unforgettable game that is bursting with charm, challenge, and some other praise that starts with 'ch'.",
            "review_score": "1"
        },
        {
            "review_text": "Just stop and enjoy the sights and sounds. That's the vibe I get from this. Most of this game is very well done and fun. The pixel art is finely done and matches almost flawlessly with the soundtrack. It's a short game taking me just under 10 hours to get just about 100% done. That may be longer than average since I really enjoyed the art and sounds of the game and would find myself drifting off just admiring them.   However I am not going to learn a fake box language that is my only gripe. Seriously the only one. Everything else is great.",
            "review_score": "1"
        },
        {
            "review_text": "A small and unique little game.  Also, rip Fish, thanks for the game.",
            "review_score": "1"
        },
        {
            "review_text": "Hours in and new mechanics are still being thrown at you. If you even remotely get any enjoyment out of puzzles, this game will push your mind to its limit. Not to mention the phenominal aesthetic (the creator spent 5 years developing this game, even going as far as throwing out and completely redoing the graphics because they weren't exactly as he imagined), the sunsets and the sunrises, the music, the creatures you find running around this amazing world; it's all perfect. Any screenshots or videos you watch of this game don't do the experience you will have exploring this world justice. On this topic, DON'T get turned off from buying this game because of anything you may have heard about the creator, because in reality that has nothing to do with this masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Fresh idea, fantastic background with an unbelievable quality of pixel art. Masterpiece. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is really simple. But simple in the right way! A simple innovation in a consolidated gameplay will open a new dimention in how you can approach problems and puzzles. Secrets can be slightly frustrating btw. Neverthless, it has one of the best cost/ratio I've ever seen.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this off and on for a few days. Very relaxing light puzzler with a fun game mechanic, good music, very nice pixel art. My only real gripe is that most of the puzzles are pretty easy and you don't really feel like a genius for figuring them out. I would still recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "A phenomenal puzzle game with a great aesthetic and a cute twist that turns just another platformer into an incredible experience.  This game, and particularly its author, has had its share of drama. Personally, I feel that the fact that people in the gaming community drove the game's creator away, made him hate making games, is a massive blow to the medium.  This is absolutely a game you must try out. The gameplay is solid, the art style is beautiful, the mechanics are unique, and the easter eggs and allusions are on-point.",
            "review_score": "1"
        },
        {
            "review_text": "This game is incredible. Please ignore the issues sorruounding it's creator as they are not worth focusing on when there is an incredible game behind it all. This game is a one-of-a-kind original piece of art, that is the only way to discribe it. This is a puzzle game which is enough to turn many people away but it has an amazing twist to it: 'Dimension bending' as I like to call it (Althought they probably have an offical name for it). 'Dimension bending' is extreemle difficult to explain and I recomend that you watch a video of some gamplay of FEZ to see how it works. The art style is a beutiful modernised 8 bit which makes me never want to stop looking at it. As a result of the simplistic, yet amazing, graphics, the game runs easily on most system and is loved by many because of this. The sound track for this game is truley mesmorising. It has been created in such a way that it really feels like it belongs in the world that FEZ is set in. You can get a good few hours out of this game (I have not yet completed it on this acount, I have on my other) and is well worth the £7 (Or your equivelant) which is being Charged. In summary, this game is a masterpiece, something which will hopefully inspire amazing games in the future, which diserves credit. Sadly I say that the developer deserves credit for making this (Although I know he is a prick). You as the potential purchaser have a choice: buy an amazing game and don't buy a few pacets of sweets as a subsitute or don't buy it and leave without an amazing 10 or so hours of your life.",
            "review_score": "1"
        },
        {
            "review_text": "Great game but the levels sometimes feel like the same thing.",
            "review_score": "1"
        },
        {
            "review_text": "Before I begin, let's get something out of the way - yes, you have probably heard that the game's designer, Phil Fish, is some kind of egotistical crazy ♥♥♥♥♥♥♥ (or something along those lines)... Regardless of whether that is true or not, don't let it deter you from playing this game. All that extraneous stuff aside, FEZ, as a game, is the real deal.   You play as Gomez, a little dude who lives a nice peaceful life in a 2D world. That is, until about 5 minutes into the game, when he is given a gift - the titular fez - which opens up a whole new world to him. Literally. The fez allows Gomez to rotate his 2D world at any time, to reveal the previously unseen 3rd dimension. For example, there may be a platform that is too far away to jump to, but rotating the world 90 degrees shifts the perspective such that the platform appears to be much closer. You can then jump to it and rotate the world back to where it was, or in any of the other 3 directions. This is the most basic example of the gameplay, but it's also just the beginning. The sheer number of cool ways this one simple mechanic alone has an effect on puzzle-solving and exploration is amazing. It's just really fun to explore and figure things out. Your main goal is to collect a series of special cubes, which are scattered throughout a pretty large world. Some cubes are found intact, but others require collecting smaller cube bits first to create a full cube. That's really all there is to the game. But just saying it that way is a disservice. The puzzles you have to solve to find all these cubes range from simple to - forgive the pun - truly outside-the-box. This is because there is more going on in FEZ than appears on the surface. A major part of solving the game's mysteries involves figuring out various codes outside of the game itself (such as deciphering the number system and alphabet, scanning QR codes, and more). So not only will you need a controller to play this game, but a pad and pencil as well. The game can be completed without finding all of the cubes (and actually has to be the first time through), but in order to get the most out of it, a little bit of extra effort is needed... though I suppose you could also just look up the solutions to some of the more effort-intensive puzzles online. I wouldn't blame you. There were only a few things that brought the game down for me a little bit. The big one was the confusing and mostly ineffectual map. The game world is huge, like really huge, and is connected by a crazy number of doors. It was very difficult to keep track of where you are and how to get somewhere else. And while there is a sort of quick-travel system available, it wasn't really implemented well. The map screen is also overly complicated and buggy. Finally, some of the puzzles I felt stepped a little too far in terms of either their obscure solutions or plain tediousness. But aside from these few minor missteps, FEZ is very much worth playing, especially if you are into platformers, retro-looking graphics, solving codes/mysteries, or games that involve collecting things. Oh, and the music is pretty amazing too. All in all, FEZ is a pretty outstanding game, and well-deserving of all the accolades it has received.  Final Grade: A-  Technical notes: You are definitely going to want to play this game using an Xbox360 controller, or equivalent. It was designed to be played with a controller and I can't even imagine how it could even work well otherwise. Some puzzles even require having a controller to figure out. So, just something to keep in mind.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting concept and creativity. One of the most unique games out there.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is a fun 2D world which you can actually rotate to see the entirety of each level. Rotating a level will create new paths you can navigate to progess through the map. The game is fun, albeit a bit complicated. It's one of those games you probably won't be able to finish without a guide - I know I wouldn't have been able. Overall, it's a fun game that's worth playing at least once.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. Goes back to the roots of exloration and captivating puzzles. Brings back back to old school games where I enjoyed exploring and solving puzzles on my own without the use of guides. Only complaint I have is the lenght. I wish the game was longer.",
            "review_score": "1"
        },
        {
            "review_text": "This game, with its beautiful art style, fantastic art style and great concept, has captured my heart. I love this game 6/5. One complaint: the secrets really are very secret. If you don't want to spend more than ten hours in this game, you better find a guide.",
            "review_score": "1"
        },
        {
            "review_text": "A riddle wrapped in a mystery inside an enigma, and possibly the best game of the 21st Century so far... I want to erase my brain so I can re-play it from scratch!",
            "review_score": "1"
        },
        {
            "review_text": "With its groundbreaking gameplay, FEZ is one of the best indie games of 2013. If you like puzzling, full of secrets, and, most of all, singular games, this is the one for you.",
            "review_score": "1"
        },
        {
            "review_text": "The atomosphere of this game is what makes it truly special. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "great game but better with a gamepad",
            "review_score": "1"
        },
        {
            "review_text": "Fez is a very casual platformer with an adventure game feel. The game is pretty easy to finish and there are no enemies to fight, but there are also a lot of fun little secrets and puzzles for those who want to try collecting everything. Cute graphics with some nice variety between locations, great music, lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "A masterful platformer that is simply addictive. It's jam-packed with some incredible features, including four third-dimensional perspectives to play from, tons of items to collect, and lots of challenging puzzles to conquer. Great replay value. For a platformer, this is simply beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. If you enjoy games like Kyntt, then this is a must have. It's very suggestive, and it has a wide varieties of puzzles. I was sceptical about this game at the beginning, but then I changed my mind immediately",
            "review_score": "1"
        },
        {
            "review_text": "An excellent puzzle game if you ignore the fact that the creator is a pretentious jerk.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game to play while watching Breaking Bad on Netflix. I really like the puzzles and the atmosphere in the game.  Just wish that the dev was just as amazing as the game.",
            "review_score": "1"
        },
        {
            "review_text": "s'butiful",
            "review_score": "1"
        },
        {
            "review_text": "I bought this when Summer Sale. and this game is so absolutely great. Combine 3D + 2D world puzzle with Cute main character. Try it",
            "review_score": "1"
        },
        {
            "review_text": "Fez is a retro game. Fez is an indie game. Fez is a 2D platformer, yet all of these descriptions barely scratch the surface of what makes this game so great.  This is a smart game. It is ingeniously designed and an absolute joy to play all the way through. I would highly recommend this game to anyone who enjoys very involved and challenging puzzles where the answers are not always clear. This game will ask of you not only your platforming skills and drive to explore, but also your ability to pay attention to small details and be able to break ciphers almost entirely on your own. I had to have a piece of paper beside me while I played so I could write down codes and keys to solving ciphers, but I found it to be extremely fun and rewarding. If you're not into that sort of stuff, this game may not be your thing.  Each area is brilliantly designed, with visuals that are never an eyesore. Each zone has its own style and personality, and almost every room has a secret for an astute player. The soundtrack is always fitting, if not especially riveting, though I'm sure you'll find a track or two that you'll love. The game pays homage to classic games of the 8-bit era, with a few nuggets of nostalgia strewn here and there for you old Nintendo fans out there.  Overall, Fez an exceptional game, though it is not without its flaws. I run a fairly powerful PC, surely powerful enough to run a visually simplistic game like Fez, yet I had problems with screen flikering, a stripe of glitchiness through the middle of my screen, and phantom graphics throughout my entire playthrough. It was bothersome, but I could ignore it. It's a fairly common problem from what I've read, and it can be solved easily, so just be aware. Some puzzles were genuinely difficult or frustrating, namely the clock tower anti-cubes and the infamous black monolith. You will almost certainly need a guide for these puzzles.  Other than those relatively minor gripes, the game is fantastic. I'd recommend playing with a controller if possible, but the experience shouldn't be any worse if playing with a controller isn't possible. I'd give this game a final score of 9.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever played. It is challenging and that can be a little bit of a bummer but if you stick with it and really thinking about what they are trying to get you to accomplish it really isn't so bad. I HIGHLY recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game. Play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone must own this game.",
            "review_score": "1"
        },
        {
            "review_text": "great game but better with a gamepad",
            "review_score": "1"
        },
        {
            "review_text": "was upset that this entire game is actually just a elaborate Doctor Who reference",
            "review_score": "1"
        },
        {
            "review_text": "... probably amongst the top 10 platformers of all time ... I ♥♥♥♥ you not ...",
            "review_score": "1"
        },
        {
            "review_text": "In Phil Fish's Austism simulator 2012 you play as Gomez, an unemployed mexican worker tasked with mowing the golden lawn, but you have to get all the crack rocks before you are allowed to mow the lawn, upon completion of finding these crack rocsk you are tasked with watching all 7 seasons of my little pony, after this gut-wrenching trial you discover that your wife and 17 children have been abducted by the swedish mafia, Led by Notch, in order to get them back you decide to go through a trial no phagget has gone through before, the hall of a million D1ckz awaits but before you enter that door, you have to pay the 2.49 on-disk DLC fee, after completing this hall of seamen and phagg0try, you are forced to show your documents to the police, but OH NO, you left them in your other jeans, so after being sent back to mexico where you belong you realize that you are coming down from that acid you dropped three days ago, at this point you realize something that you though you knew from the beggining, Gomez is Notch, Shrek is love, shrek is life",
            "review_score": "1"
        },
        {
            "review_text": "It's more art rather than a game. But it sure is pretty, along with a soothing soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, nice art style, cool music, and overall awesome game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I went into this game expecting a bad platformer (Respawning right where you are? You can't have any challenge with that!). What I ended up finding is a puzzle game, and a pretty unique one.  Rather than having a set of rooms that you solve through using the quirky 3D mechanic, it's actually about exploring the world, gathering clues to understand how the various artifacts you find work. Somewhat similar to an in-game ARG that you can solve yourself.  Some puzzles can get complicated and the game sometimes expects you to make some pretty long leaps in logic. But once you figure it out after thinking about it for a while, you feel very clever and it can also bring light to another mystery elsewhere in the world that was getting you stumped earlier, which is quite rewarding and makes you want to go check it out immediately.  The ambiance is also a big part of the game, with it's pleasing atmospheric soundtrack and the wildly varying environments that you discover. This reinforces the whole 'exploring the world' aspect of the game, and is very successful. You can also go look for deeper meanings to the implied events that happen in the game. I personally was very content just looking for puzzles and smelling the roses, but it's certainly there for people who like it, and it adds to the overall mysterious ambiance.  In the end, I was pleasantly surprised, and quickly found myself caught in the mystery-solving, ending up with a few pages of scribbles and a lot of screenshots taken as notes. If you like investing yourself into ARG-like puzzles you'll certainly get caught like me.    Now I feel sorta bummed out for Fez 2.  ",
            "review_score": "1"
        },
        {
            "review_text": "Ok, everybody knows that the creator of this game is a really bad person, but in this review i'll only talk about the game's undeniable quality. Fez is an amazing experience! It goes beyond the game, and you'll feel like you have been transported into a dreamy and surreal world, while playing. It's relaxing, yet somehow challenging. I have to warn you , though... The game is mostly puzzle/exploration driven, and sometimes it's quite cryptic, so you'll need a bit of patience, but then you'll be rewarded with one of the best games ever made. The graphics are something gorgeous! It seems to look like an 8 bit game, but it actually isn't. It's much richer and the game is actually 3D, while mantaining the charm of the 8bit graphics, with the added value of amazing color contrasts and gradients, impossible to achieve in the 8bit era. Sound is amazing aswell, incredibly relaxing and evocative! I also suggest getting the game's soundtrack.  A highly recommended game!",
            "review_score": "1"
        },
        {
            "review_text": "Brilliantly charming game, arguably the best puzzle-platformer I've played.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, but do not even bother 100%ing without a guide (or spending twenty years of your life on it).",
            "review_score": "1"
        },
        {
            "review_text": "This game will blow your mind.",
            "review_score": "1"
        },
        {
            "review_text": "'Seems like I cant reach there.' *switches view* 'Oh, I am actually there.'  We need more games like these. But map is still frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "The design and graphisms are great. It really is an ADVENTURE with a huge world to explore. About that.... to solve the puzzles, the player needs to understand the world's cubic language and numerical system. Too much of a bother for just a videogame in my opinion. Just exploring was the best part.  In the 2D/3D platforming genre, I enjoyed Perspective much better.  Oh, I forgot to add that the PC port is not so great, it shows that the controls are adapted to a gamepad.",
            "review_score": "1"
        },
        {
            "review_text": "One of, if not, the best games I have ever had the pleasure of playing. It is simply beautiful in every way, the artwork is gorgeous, the gameplay is superb and the 2D/3D aspect is simply magnificent.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game and would recommend it to anyone who enjoys platforming, retro, indie, or puzzle games. The creative mechanic and fresh graphics with some poppy music as well as tough but still fun puzzles makes this one of my all time favorite video games. Even though I got it on sale, i'd say its worth 10$ if you have it.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is a true one-hit wonder; that rare game that blows your mind and just keeps blowing it until the very end. A masterpiece in game-design and world-building, Fez takes this new concept and rolls with it through strange, beautiful worlds. It is a true tragedy that we won't see another game quite like it again, but that only makes Polytron's debut title shine brighter. A platformer that rewards experimentation and exploration with discovery and mystery, FEZ out-Nintendos Nintendo in just about every department. If you're at the least bit curious about this controversial title, I had fun with it. I'm sure you would too.",
            "review_score": "1"
        },
        {
            "review_text": "When I started the game I only wanted to have a quick look. When I learned about what makes the game really tick I wanted to refuse to force myself through all of this. But before I knew it, I was already sucked into it and eventually got all achievements. I'm not exactly sure how they did it, but it worked.  The experience around FEZ has multiple layers.  On the surface you have this cute and easy going, gimmicky Platformer that plays with optical illusions. Before I played it I had the impression you had to do a little more three-dimensional and logical thinking. But as it turned out, you only have to swap the perspective until you can progress. This layer is all about finding the way, spotting doors and traversal. In and of itself that is already quite engaging, because you have this rather vast world with multiple paths. Discovering all the rooms and places to complete the map is pretty fun, I think. You have warp gates and shortcuts to streamline it more but it is true, that you have to backtrack very often.  When it come to exploring, I am really impressed how they managed to tweak your navigation. You know, all these little conveniences everyone takes for granted. Almost every (major) screen has a distinguished element, like a landmark that you can see in the background or as preview that hovers in the air while you stand in front of a door. Some screens have a different color palette, that makes them easy to recognize. The map gives you all sorts of feedback. The warp gates show you the sky that is unique to certain areas so you know where they'll lead you. Also you can easily see which rooms you havn't visited yet because doors will stay open.  When you got enough collectibles, you can complete the storyline (if you wanna call it that). But after that, the game shows its true colors. You need to play the  new game +  mode to enjoy it to its fullest.  You see, FEZ is about secrets and hidden stuff, really. It would be undermining the point if I told you what it was. Let me say it more simple so you don't get overwhelmed by all the cryptic stuff: You need to look closely at your surroundings and watch out for signs in order to decipher codes. Most of these require you to write something down. Then you have to input key commands to communicate to the game that you solved the puzzle. But it gets even more complicated. You need to think laterally and meta for some of the other things. There is a number system, an alphabet and input symbols. Try to make them out by yourself. There are hints but nothing is spelled out for you.  I love the music and the animation.",
            "review_score": "1"
        },
        {
            "review_text": "Just mind blowing",
            "review_score": "1"
        },
        {
            "review_text": " PROS:  + satisfying &amp; fun gameplay + really nice UI &amp; menu + great puzzles + dimension shifting + new game+ + awesome pixelated visuals + tons of collectables to find   CONS:  - a couple of ridiculously hard not very logical puzzles - occassional ladder glitch (especially in the 'globe room') - occassional crash to desktop (twice in 13hrs of gameplay)   Comment:  I went into playing FEZ without expectations and after finishing it I have to say it was really incredible! Sometimes simple and easy, sometimes really hard (looking at you, rising lava level) but always fun. The '3D' shifting mechanism works really well and makes the game feel really unique and original. On top of that is a cool map of locations, each filled with either NPCs, collectables, puzzles or just platforms. It is hard to pinpoint what I like about this game so much but I guess it could be the way it lets you progress. While the floating cube gives you vague hints it is YOU who tries out which path to go. The only thing about the game logic that I disliked was the cryptic language and a couple of puzzles that were a bit too hard in the way that I had no idea what the game wanted from me. So, yes, I helped myself with a guide after collecting all that I could (which was most of the stuff). However other puzzles like vibrating controller hints were really cool and I loved them. The pixelated graphics are a nice touch, they fit the game really well too. Overall I can see the tremendous amount of time spent on making this game, it is AWESOME! So awesome that I am purchasing another copy (maybe via GoG) to support the developers. Result? You can either recommend FEZ or you have not played it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a MUST play. Delivering a puzzle game experience like none other, FEZ redefines the meaning of atmosphere gameplay. Not to mention the ABSOLUTELY stunning graphics &amp; sound track  If you're an indie gamer like me, you'll find this game quite the journey, a true masterpiece in 'perspective-puzzles'. you'll find yourself the rewarding feeling of accomplishment each time you solve a problem  ~Have Fun~",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game with a unique style of puzzle solving and and an awesome retro art stlye. Definitely worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game! Simple, yet taxing to the brain, it really is a work of art. Through its vivid colors and music, the game gives every single different scene its own style and atmosphere. Often I just pause, and stare at the sunset, or the stars and admire the scene. Along with these admirable qualities, FEZ brings new and innovative ideas to the platforming and puzzle genres, which we will hopefully see in future games. Overall, this game gives a refreshing taste of the platformer and puzzle genres. In one sentence - FEZ really brings its pixels to life. ",
            "review_score": "1"
        },
        {
            "review_text": "This is THE most immersive, fun, and difficult puzzle I've ever played in my life. I bought this game when it came out impulsively, like many game collectors on steam, and the experiences I've had with this far outweigh the money I spent on it. This game has some of the most mind-blowing, rage-inducing puzzles ever seen in any video game, but as the case is with any puzzle game, the gratification you get from solving the puzzle makes it all the worthwhile. The presentation of a 3D world from a 2D perspective is also an extremely cool concept, and makes platforming quite fun, and also spices up some of the already difficult puzzles :&gt; I definitely recommend this game to anyone who enjoys rage-inducing puzzles and little white people wearing fezes. As a gamer who has previously mostly only played FPSes, this game was an eye-opener for me. From the game design, platforming, puzzles, innovation, and even the soundtrack, this game is really a perfect 10 from every perspective (lel) for me.  Edit: THis game suck",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is one of those games that feels random at first, but as the story progresses, you can't help but feel the cringe-worthy satisfaction of getting the scattered golden cubes one after another. The game lets you set the pace and execute different types of approach. Thus, the immensity of this cube-tastic game and the variety of puzzles, mazes, and other rage-inducing challenges that Gomez has to face, will pull you in to the cube-ception of this iterating world of FEZ.  The hours I've played may be deceiving *70% of the anti-cube goes to youtube videos and reading through unnecessary google results.* but the game will most likely be twice of the time I have done. However, the challenges and the different patterns of mazes in each section are all beautifully designed and in each section, it feels like you are in a completely different zone. My personal description may seem unrealistic and far-fetched, but it is up for you whether you'd accept it or ignore the game's mind-blowing experience. Despite the decision you have made, FEZ is a hell of a game nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite game EVER. It's full of secrets, metaphors and fun platforming. One of the best indie games ever, go get it!",
            "review_score": "1"
        },
        {
            "review_text": "I didn't stop playing from the moment I began - very addictive platformer. The puzzles and level design are mind boggling, and no one's going to read this anyway, so I will confess that I have been drinking my housemate's juice.",
            "review_score": "1"
        },
        {
            "review_text": "I found FEZ very charming. It's a bit tedious compared to other platformers, but has lots of atmosphere and mystery to make up for it. Its main mechanic is rotation. The world is a three-dimensional space 'flattened' into whatever side you're looking at, and to progress you can turn it around. The platforming is fairly trite - the level design uses that rotation system very cleverly, but there's lots of waiting for the slow protagonist to walk somewhere. And surviving a fall makes you lose more progress than dying, which is very annoying. On the other hand, the game world is lovingly designed. The relaxing, beautiful and mysterious atmosphere will make you smile and the dragged-out platforming actually helps you take in the details.  The world is filled with mysteries and cryptography puzzles, which are optional and vague but very satisfying to solve.  I recommend this game for its beautiful ambience and strange puzzles that may please fans of games like La-Mulana and Antichamber. Be aware of its slow pace and focus on atmosphere over action though.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is a relaxing pixely puzzle platformer, where you get to navigate a daedalic map system looking for mysterious cubes. The twist to classic platforming is that you can actually rotate the map left and right to reveal hidden areas and climbing points, while the puzzles include a lot of code breaking. FEZ looks like any other cute puzzle platformer at first glance, but it can be surprisingly addictive in its depth. Some puzzles are pretty hard to crack and you can find hints on the backstory while exploring. Even though this game is probably not for everyone, I feel it is at least worth your consideration. Playing with a controller is strongly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Some of the most romanticised events of history are those of great explorers and their struggle against unforeseen difficulty: searing heat, freezing cold, malaria and navigation over great seas and jungles in search of unknown knowledge and treasure.  In Fez, it is revealed to you, as a two-dimensional creature that your reality actually has three dimensions, each with two-dimensional creatures living unbeknownst to each other. The ability is granted by the namesake fez which he wears at all times after the opening sequence. Perspective based platforming is well-explored, but Fez still comes over as fresh and charming, with its extensive and beautiful 3D pixel art on all sides.  As the owner of the fez, you are charged with assembling cubes from pieces scattered across the dimensions in order to repair the universe. The game truly is expansive, with many unique art styles across the many sectors and subsectors, each forming a minimum of 4 separate 2D platform sections as you rotate the camera in 3D.  I was disappointed in Fez. I feel like the game could have been so much more, but it is also clear that the creators had a very different vision to what I would have hoped. Fez is about exploring, and that is  all it is about , there are no enemies, or bosses or quests or miniquests or upgrades or pickups, or shops or anyone to talk to. The game is an endless search for cubes, and though one or two new mechanics are introduced in this search, they all felt tedious and simple, including: The lever which you have to rotate your camera in 3D to turn every time you want to use it, the platforms in that one hub world that rotate irritatingly in 3D, forcing you to rotate the camera as they rotate or jump like you’re trying to defeat Air Man’s vanishing bricks; and the most common ‘puzzle’ in secrets, look up and translate the alien symbols into English (which, by the way also describe the Xbox 360 controls and not the PC controls, so you always have to look them up).  If the creators’ intention was to question the reason you were searching for cubes at all, they did a very good job in heavily instilling that feeling in me. At the beginning I made an exhaustive search for cubes in each area, making sure to find every last one, assuming that somehow by collecting these I would be in a better position in the other worlds. But the cubes only unlock  more worlds , where you can collect more cubes  but for what?   Travelling between worlds is a tedious and irritating process, as there is no ‘fast travel’ in the game. If you, like I did, exhaust the world of cubes before you left, you must move through these empty worlds, solving all the puzzles you did before, backwards to get back to where you were so that you can explore the game’s branching paths. These worlds are extremely extensive and still require extensive precision jumping, rotating and thinking just to get through them. Some 'hub worlds' have portals, but you still have to reach them from whatever backwater dimension you were in.  The best comparison to another game I can make is The Machine         YouTube™ Video:  Knytt Stories: The Machine playthrough to the normal ending on normal&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "As far as I've played so far, I love it. I find it unique and creative, as not many games out there are both 2D and 3D. The elements and controls are easy to handle, however many of the puzzles are difficult to solve. There aren't many clues out there, and the ones that are are very hard to translate or solve. Navigation through worlds is a little bit frustrating as well, as you have to constantly refer back to the map in order to see the next screenshot of the area you need to go to next to pass through.  And I'm not even going to start on the black holes............................ x_x  But overall, yes. I do very much enjoy this game and recommend it to anyone else who shows even the slightest interest. It'll keep you busy for hours.",
            "review_score": "1"
        },
        {
            "review_text": "prepare to be mind♥♥♥♥ed with 3 dimentions",
            "review_score": "1"
        },
        {
            "review_text": "Extremely artistic in both visuals and music, i just love the pink block cave area! (no homo) ^.^",
            "review_score": "1"
        },
        {
            "review_text": "An excellent, joyful, simple, and yet challenging game. You need a controller to play this game, since it's way easier to play this way. Huge recommentations if you like puzzles and a really well executed game.",
            "review_score": "1"
        },
        {
            "review_text": "'This game is pretty fez.'-Santiago Rodriguez, 2016 elections. ",
            "review_score": "1"
        },
        {
            "review_text": "It's a FEZ, FEZZES are cool.",
            "review_score": "1"
        },
        {
            "review_text": "On my PC fez only goes untill the one square breaks.So if the people who made the game is reading this, FIX THE PROBLEM",
            "review_score": "1"
        },
        {
            "review_text": "This game is my dream game. Puzzles that include thinking and using things beyond your game, interesting lore and art. Fez is a work of genius.  Some people can't divorce the creator from the work but Fez is worth the try.  The downside is the (unintentional) bugs that make the game harder to play at times.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Received this game along with other by buying the Indie Game the Movie Bundle and they are all WELL worth the money(I believe I got mine on sale during Christmas, but I would have paid full price if I had to). While this game is awesome in its own right, if you want it, go for the bundle(Braid is amazing and Super Meat Boy is good as well).",
            "review_score": "1"
        },
        {
            "review_text": "A cool game to spend some time in.",
            "review_score": "1"
        },
        {
            "review_text": "Can't wait for squeakuel!",
            "review_score": "1"
        },
        {
            "review_text": "Phil Fish is the Billy Corgan of indie games in that whilst he is incredibly easy to dislike, it's very hard to actually discredit him as far as game development. FEZ is a beautiful platformer in both its aesthetic and its mechanics; and is by far one of the best 'indie' titles of the past few years.",
            "review_score": "1"
        },
        {
            "review_text": "Looks can deceive. Difficult puzzles, if you want a perfect game. One of the best games I played this year.",
            "review_score": "1"
        },
        {
            "review_text": "It's an adorable platform-puzzle game perfect for anyone who is a fan of indie games.",
            "review_score": "1"
        },
        {
            "review_text": "Play this if you like puzzles and riddles.  If you would spend hours discovering and figuring out a new universe you'll LOVE this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game was really fun to play but my computer crashed near the begining just when I was getting into the story.",
            "review_score": "1"
        },
        {
            "review_text": "This is literally the best game in history. Everyone, stop making games. We're done. Games are retiring. Good bye.",
            "review_score": "1"
        },
        {
            "review_text": "Nice concept, nice arts, not enough to keep me playing it.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is a great indie puzzle platformer! the basic story is easy to complete but to have everything fully complete is close to impossible. This game fuse 2D and 3D. its basically a 2.5D game. it will BLOW your mind. it is cute as well. :D",
            "review_score": "1"
        },
        {
            "review_text": "I've put more brainpower into this than any serious task in my entire life. Completing this without a walkthrough is like a full blown project, and forces immersion through slow-thinking alone, not to mention the beautiful visuals, amazing soundtrack and great game feel. This 2.9-recurring D puzzle platformer with linguistics (and code cracking) is one of the best games I've played in a long time, and one of the best experiences.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful experience. Gorgeous world to wander around in, ambient soundtrack, and mysterious cryptography riddles to solve. This is a top tier game and is a true journey. I bought a pair of red-blue stereoscopic 3D glasses just to play this game the third time through.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun game some levels are pretty cofusing its fast graphics are good basic controls could be closer together but altogether rating would have to be 9.5/10 i would definitely reccomend it to others but it's a shame that its quite expensive. (=",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game during the autumn sale for a little over $2 and let me say it was a fantastic game. When this game first came out I remember hearing about all the great reviews this game was getting, and how it was a must-buy, but it never really interested me. I finally bought this game because the deal seemed to good to pass up, and I do not think I have been more pleasantly surprised by a game. I really enjoyed this game and if you like solving puzzles this is also the game for you.  The graphics are certainly not the best, but that is the point. However, they are charming at times and the music score fits the environments really well.  In my opinion this concept of discovering the third dimension and rotating the space to access new areas was a really interesting and novel idea, and it was done very well. Also the codes in this game show just how much effort the developer put into this game, which to say is quite a lot. Although the controls could be a bit annoying at times, this game overall was fantastic, I am very happy I bought it, and have enjoyed every moment I spent playing it.  I would recommend this game to anyone looking to be challenged by some zany puzzles whilst having loads of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing in every single way, AMAZING visuals, awesome soundtrack, fun puzzles and an amazing game! This game gets an A/5",
            "review_score": "1"
        },
        {
            "review_text": "FEZ was the first game to make me bust out pen and paper to solve puzzles since Myst.  (Runic symbols for letters and numbers, tetris piece button input, etc)  Plus it's a stupidly-good puzzle platformer. Who *wouldn't* love this game? My own wife, who claims to hate videogames, likes this game. The universe imploded. Or exploded. Depends which ending you get. &lt;/spoiler&gt;",
            "review_score": "1"
        },
        {
            "review_text": "I still have to find every secrets but I had a lot of fun playing this game, and trying to solve the mysteries by myself, tho I found the rumble puzzle very difficult with only the 'rumble hearing', they are 10 easier with a pad that has vibrator.",
            "review_score": "1"
        },
        {
            "review_text": "I Love this Game! It may just be a small indie game that doesn't take long to finish but it is just so fun to be able to play in a 2D world and flip sides around a 3D object. I think that if you haven't played this, you should buy it and play it and decide for yourself whether it's fun, my opinion is that is is sooooo fun. This game is a must play game!",
            "review_score": "1"
        },
        {
            "review_text": "Nice concept, nice arts, not enough to keep me playing it.",
            "review_score": "1"
        },
        {
            "review_text": "Incredible game! Simple, yet complex. It's a shame Fez II got cancelled.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is a game that implements puzzles and tricks in many ways to make for a fun experience in trying to find all the secrets :D",
            "review_score": "1"
        },
        {
            "review_text": "I cannot explain how thrilled I am to play this game. It is one of the very few games that break the 4th wall. 2D being merged with 3D sounded like a stupid idea, but FEZ did it right. Must play!  I rate: 5 out 5 pixels",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is the most unique puzzle game I have ever indulged in. The world it throws you into is incredibly large, and a treat to explore. The puzzles proved to be very difficult at times; lots of trial and error and screaming on my part. I highly recommend this game. It was truly a grand adventure.  Also, invest in the soundtrack. Just go ahead and do it. The music is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "A very unique and fun experience, FEZ entertains with its 2D perspective on the 3rd dimension. Puzzles range from easy to challenging with every step inbetween. Sometimes the unnatural controls can hinder the expierence but practice makes perfect. There are a ton of cubes to collect and areas which you will certainly have to revisit in the second playthrough. Buy this if you like puzzles that require you only to move things around until solved or give enough thought to play through efficiently. I really enjoyed this game.",
            "review_score": "1"
        },
        {
            "review_text": "this game sucks you in and does not let you go. i launched it just to try it out really quick and i ended up playing the whole day away. its just an all around great game.",
            "review_score": "1"
        },
        {
            "review_text": "interesting gaming experiance.",
            "review_score": "1"
        },
        {
            "review_text": "Cute as ♥♥♥♥. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game has nice flips! 10 out of Phil Fish.",
            "review_score": "1"
        },
        {
            "review_text": "Can't wait for Fez 2.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, really makes you think and encourages you to just explore without focusing on much.",
            "review_score": "1"
        },
        {
            "review_text": "Truly one of the great hallmarks of indie game, FEZ is indie game with many block and puzzle.  Rotate the game to change the game and advanced.  Many play hours.  Pressing 'Start.'  Down to exiting the game.  Silently, a Phillip Fish weeps.  'Do you really want to exit FEZ?'",
            "review_score": "1"
        },
        {
            "review_text": "This is a pure puzzle platformer down to the bone. You see there is no combat or real danger in this game, it is pure exploration.  But this is where the game is innovative.  You receive a magical fez that bestows you with the power to change perspectives from 2D to 3D at will. Use this new power to explore the landscapes and find secrets that were once invisible to you! It's a really groovy mechanic and the retro-bit graphics really bring the package together nicely.  I recommend it to fans of exploration and pure puzzle platformers.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Hard for me to rate this one. It wasn't good enough, gameplay-wise, that I felt compelled to finish, but the design and the effort put into it is laudable, to say the least. There's also something to be said about a game that doesn't urge you to finish it - this game doesn't push you along unwillingly, and I appreciate that. Overall, I have to recommend this because I've never seen anything like it and I just can't get over the core mechanic. Beyond that, it's hard to say how a given individual will enjoy this one.",
            "review_score": "1"
        },
        {
            "review_text": "This is literally the best game in history. Everyone, stop making games. We're done. Games are retiring. Good bye.",
            "review_score": "1"
        },
        {
            "review_text": "This is a beautiful game to look at. Even more beautiful is the fun workout your brain gets while playing in this 2D world with its 3D mechanics. Soundtrack is perfect. This is one of my top favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "I simply loved that game. Really hard to solve puzzles and it makes you totally addicted! Visuals are stunning and the way the whole game is done is quite amazing. Had a lot of fun and totally worth it !!!!",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is a boss game but it started to crash recently for my computer ;(",
            "review_score": "1"
        },
        {
            "review_text": "a lot has been said about fez over the years. most people seem to have very strong opinions about it (and its creators). for me, it's one of my favorite games i've ever played. and i might never be able to finish it.  i'll start with the good: fez is visually breathtaking and immaculately designed. the level of polish and attention to detail is something i've rarely seen. everything about it exudes charm, cuteness, and fun. its game world is immense, sometimes to the point of being overwhelming, but it's so much fun to explore; there's so much variety, and so much mystery, that it never really gets boring or tedious. fez's puzzles are infamously complex and sometimes impenetrable - even once you've wrapped your head around navigating a 2d world in 3d, there's still a language and number system to decode, and even more than  that  if you plan on 100%ing the game. gomez, the player character, is a ♥♥♥♥ing adorable kirby-like example of simplistic, minimal character design made endearing and loveable. and of course there's also the soundtrack by disasterpeace, which perfectly suits the game's atmosphere and is incredibly well-made.   the bad: the controls are a bit stilted and can take some getting used to (especially jumping), which makes some simple exploration a bit harder than it should be at times. but that's not even the worst thing, really - fez, despite its polish, can be pretty buggy, from small weird visual glitches to massively gamebreaking issues. i had nearly 100%ed the game when i reached the ending, and was extremely disappointed to find that the game always crashes to my desktop just before the end of the final cutscene, meaning that, as long as i have this computer (or if someone magically fixes the issue somehow) i'll never be able to complete it. and that makes me really sad, because i love fez.  fez is perfect for those who sound of a cute, relaxing metroidvania with intricate lore and puzzle design. just make sure your computer will be able to run it properly.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game - screenshots and even video don't do it justice. I didn't really understand its greatness until I started to play. Changing perspectives to find your way forward is engaging enough and unique enough that none of the parts of my brain that indicate I'm solving a puzzle become engaged.   If I realize I'm being presented with a puzzle, I usually get irritated and turn a game off... I don't like having puzzles sprinkled into action, or platforming, or really anything other than an explicit puzzle game. The puzzles in this game are so naturally integrated, though, that I'm able to get the mental reward for solving them without feeling any of the exhaustion that comes with recognizing a puzzle. The only other hybrid-puzzle game I can think of that's been as successful at fooling me into enjoying it is Portal 2, which is pretty good company for an indie endeavor like this.  Fez is worth full price, and definitely worth it when on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Sigh. I wanted to like this game so much. The visual is stunning, the music is awesome, and the mechanics is groundbreaking. I just liked the overall atomosphere. The game had almost everything for telling a powerful story, and yet it totally blew it. First of all, the game is relying too much on that 'code' thing... why would you do that? I mean, ANY game can do this. Why not clever use of the game mechanics? Atop of that, the game has no message. With a proper narrative, this game could be a true gem. Maybe I had a little too much of expectation for this, but I can now say this game is full of missed opportunities. It is just sad. Recommendation? Screw it.",
            "review_score": "1"
        },
        {
            "review_text": "On my PC fez only goes untill the one square breaks.So if the people who made the game is reading this, FIX THE PROBLEM",
            "review_score": "1"
        },
        {
            "review_text": "Scanning QR Codes is not a puzzle.  A+",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game 11/10 Harambe would play again... if he could R.I.P",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the most tricky, amazing, deeply frustrating game ever. You open a door, 10 more will follow. you find a secret, 100 more you'll get later. If you like platform and puzzle game, you won't regret.",
            "review_score": "1"
        },
        {
            "review_text": "You're a white humanoid being, given a magical fez from a gigantic alien cube, and then you have the ability to warp reality.  Wow.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I can't explain this, but I will try. FEZ is about a dog that has to collect cubes and also pieces of cubes to unlock and adventure around a rather strange world of... Worlds? Game starts off simple enough, your dog gets a fez from a rotating floating cube thing to save it and the world(s). With the diverse world that is both 2D and 3D, you move the world in a cube by pressing the right and left tiggers on the controller (Sorry, I only used a controller). You climb and solve puzzles along the way collecting those ever important cubes. Thats about it. Oh, and its really fun, don't write it off by just reading this medeocre review I threw together. Have fun friends!",
            "review_score": "1"
        },
        {
            "review_text": "'A walk around and sniff the flowers game'  Pros -Great Art style -Great Soundtrack -Great Story -Solid platforming -Good gameplay mechanics -Two man team -Phil went through a lot to get this out   Cons -Does get boring -Dev is a ♥♥♥♥♥♥♥♥♥ -Dev spams my twitter up -Dev cant handle critisism -Dev is a ♥♥♥♥ -Dev needs to make fez 2    VERDICT:  Fez is a really great indie game, but highly overrated and has a stupid developer!  I rate it a 7.2/10",
            "review_score": "1"
        },
        {
            "review_text": "They finally (after months) fixed the crash bug at the end!!! I could finally see the last 10 seconds of the game!   Anyway, here's the review: +unique playstyle +runs smoothly +amazing and relaxing soundtrack +fun +many secrets and puzzles and items to collect +giant world +hours of gameplay +pixelgraphics  -some puzzles are really mean and hard to solve -you can get lost easily  8/10 ",
            "review_score": "1"
        },
        {
            "review_text": "The hat is the only good thing in this game",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game",
            "review_score": "1"
        },
        {
            "review_text": "Really nice puzzle game. Good thing there is a guide for it, otherwise I couldn't have done it. If you like puzzle games you definitely should get this one.",
            "review_score": "1"
        },
        {
            "review_text": "it is nice and a funny game that you can spent many hours on it ",
            "review_score": "1"
        },
        {
            "review_text": "so... much... love for the rotating 2d.",
            "review_score": "1"
        },
        {
            "review_text": "Great mechanics, great art, and music. I do recommend buying this game.",
            "review_score": "1"
        },
        {
            "review_text": "LT RT LT LT LT RT LT RT A LT RT RT RT LT LT RT LT",
            "review_score": "1"
        },
        {
            "review_text": "hi im 10 years old and autistic. im gonna write a really long review with about 500 words on this game i bought for 2€ about how the puzzle on the 22nd level was abit too hard and now this ruins the entire game.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely beautiful and abstract game. Fez is a side-scroller / platforming/ puzzle game that takes place in 2 dimensional slices that can be altered by rotating the camera at 90 degree angles to alter the world. Such is similar to theory that imposes what four dimensions would be like relative to three dimensions. By altering your 2 dimensional world, you will solve very complicated plat-former puzzles to collect 3D cubes. This game is also nonlinear, allowing the player to roam wherever he or she pleases. I can't say any more about how much I love this game. I will cherish this game and perhaps in 20 years when this game looks like a retro piece of ♥♥♥♥, I will play through it again treating it as childhood nostalgia, even though I played it when I was in college.   Oh and I played this entire game high af, I would recommend it if you are high as well :3.",
            "review_score": "1"
        },
        {
            "review_text": "I like to collect cubes",
            "review_score": "1"
        },
        {
            "review_text": "Flawed, but entertaining. Mystical and frustrating. ",
            "review_score": "1"
        },
        {
            "review_text": "A digital representation of your childhood as seen on acid. Are you dreaming or tripping balls? Who knows, but more importantly, who cares, just enjoy the ride.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic platformer that add a whole new dimension (literally) to the genre. Well thought out, compeling and fits perfectly with the pixel graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic platformer that add a whole new dimension (literally) to the genre. Well thought out, compeling and fits perfectly with the pixel graphics.",
            "review_score": "1"
        },
        {
            "review_text": "the guy who make game is pretty hatty ",
            "review_score": "1"
        },
        {
            "review_text": "A keeper! The artwork, level design and game development is amazing. I am astouned by the depth of this game. So many levels of exploring and enjoying. From start to finish a game i recommend.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best indie games out there.  10 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Fun, casual, beautiful, and VERY VERY mind-bending. Will certainly suck up time.",
            "review_score": "1"
        },
        {
            "review_text": "Love the concept for this game. 'Changing perspective' gets you much farther than simply 'turning the camera'. It allows for distant objects to appear close and THEREFORE makes them accessible. A second dimensional being suddenly able to tinker with the 3rd dimension makes for a fun and interesting game. Not to mention it's cute as hell.  The dev's idea of a 2D creature's mentality is adorably similar to our theories about higher dimensions. One guy you talk to says, 'There's no such thing as a cube. Only squares.' Then, BOOM! We're 3D...sortof. I like the old school sidescroller feel and LOVE its integration with level rotation. Ya done good, FEZ! Oh, I also got a kick out of the evolution diagram in the school. (something to look forward to)",
            "review_score": "1"
        },
        {
            "review_text": "The most enjoyable platformer I've played in many years. Not too challenging, but always charming and surprising. Played great on a Mac with a Dualshock 3 controller.",
            "review_score": "1"
        },
        {
            "review_text": "When thinking about Fez the first words that come to mind are pretty, atmospheric and niche, i'll explain why and what you'll find in this game.   Gameplay",
            "review_score": "1"
        },
        {
            "review_text": "It's great and looks nice, but HOLY HELL SOME OF THESE DAMN CUBES ARE HARD TO GET (I'm talking about Anti-Cubes here). It's worth it though!",
            "review_score": "1"
        },
        {
            "review_text": "I still can't figure why the trolls hate Phil Fish so much while he has given us this masterpiece. Really. For that price, you should definately get it and judge for yourself. The 2D/3D combination is just awesome and well presented. The controls are easy to master after a while (gamepad recommended though), the puzzles are numerous enough and some of them will be a real challange, believe me. The ambiance/music (Boards of Canada-like) also fits perfectly. One of the best indie games i've ever played. Thank you, Phil... you are our modern Galileo beheaded for his genius.",
            "review_score": "1"
        },
        {
            "review_text": "Cool Game",
            "review_score": "1"
        },
        {
            "review_text": "Note: I did not start New Game+ will probably play it later.  Say what you will about Phil Phish, the man knows how to make a good puzzle based platformer. But the gameplay isn't what sticks out the most for me. It is the music and the way it works when you are rotating the level. I love that when you are rotating and you rotate yourself behind the wall the music becomes muffled. For me that is interesting and I am sure it has been done in other games, but I can't think of any right now.  The game controls great and you really only use the jump button, the left and right rotate buttons and the interact button primarily. It is a short game You could technically put it down after you collect 32 cubes. But to get the real ending you need to play through new game+ and collect ALL of the cubes (64 I believe).  The only downside in this for me was the map. because of the way it was design it could get confusing to tell where you could possibly go. The upside...there are two secret worlds, one is Gameboy influenced and the other is Virtual Boy influenced...really awesome, but the Virtual Boy world is hard as hell.  4/5",
            "review_score": "1"
        },
        {
            "review_text": "This game is an awesome puzzle/platformer game. At first it seems fairly straightfoward, but as you continue to play, you discover that it is a much more extensive game that you originally thought. Cleaver puzzles, beautiful pixel graphics, and nice music. I would definitely recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this! Good difficulty curve and the 2D-3D idea is very clever. Almost got 100% cleared, but with just a couple of the last puzzles I had to give up, sniff.",
            "review_score": "1"
        },
        {
            "review_text": "A digital representation of your childhood as seen on acid. Are you dreaming or tripping balls? Who knows, but more importantly, who cares, just enjoy the ride.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty innovative puzzles. Requires a lot of 'out of the box' thinking to solve everything. Except for the clock, screw the clock. You'll know what I mean.",
            "review_score": "1"
        },
        {
            "review_text": "Game that proves total piece of S#!T can still be useful.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ combines the best of puzzle games and platformer, explore a world in 2.5D, with its own alphanumeric system and its own system of riddle, learn from scratch and enjoy its univers.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, it's good",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best games i have ever played! I love it most out of all my games the only thing wrong with it is that it lags my computer alot other than that its perfect!",
            "review_score": "1"
        },
        {
            "review_text": "I only got this because it was called FEZ, and I like fezzes.",
            "review_score": "1"
        },
        {
            "review_text": "Buy This Game!",
            "review_score": "1"
        },
        {
            "review_text": "The game is brilliant, but the developer is an ♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome game, would recommend! Super pretty to look at with lots of different puzzles to figure out.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. When my internet was out and I couldn't play Counterstrike I played a bunch of the singleplayer games I had and this game is amazing. It's just amazing, get it. Get the game.",
            "review_score": "1"
        },
        {
            "review_text": "The dev is an ♥♥♥♥♥♥♥, and the game shoves 'indie' up your ♥♥♥ with all of its cryptic messages and puzzles, but you'll get one or two of them and feel like the second coming of Albert Einstein. Plus, google will help you with all the other ones. Definitely not a good game for someone that just wants a more casual puzzle game though.",
            "review_score": "1"
        },
        {
            "review_text": "game gives you a headache but makes you feel serene...like weed",
            "review_score": "1"
        },
        {
            "review_text": "🐟👍",
            "review_score": "1"
        },
        {
            "review_text": "Perfectly executed. The best platformer I have played in a long time, if not the best ever.",
            "review_score": "1"
        },
        {
            "review_text": "Great simple game! I really enjoy it!",
            "review_score": "1"
        },
        {
            "review_text": "  The First part of the game is creepy, then everything just gets hard.",
            "review_score": "1"
        },
        {
            "review_text": "I was able to enjoy this without giving any money to Phil Fish thanks to a humble bundle. And isn't that what gaming is all about really?",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games. Finished it four times so far.",
            "review_score": "1"
        },
        {
            "review_text": "Although the creator of this game is a ♥♥♥♥♥♥ bag, I would say it's still a great game. The magic of this game comes into play when the music and the scenery collide, creating one of the best feelings of the world. It gives you this feeling of solitude and yet, peace. The ambiance only amplifies how great the games aesthetic is. All of this is coupled by the tricky puzzles, such as learning a new language and number system. Puzzles that make you feel like your discovering a lost world, this game leaves you begging for more even after you beat it 100%. I would say this is by far, one of the greatest puzzle games I have ever played. I hope you take the time to pick this masterpiece up",
            "review_score": "1"
        },
        {
            "review_text": "Blah blah something.. Phil Fish joke I guess. ♥♥♥♥ off im tired",
            "review_score": "1"
        },
        {
            "review_text": "its good mane",
            "review_score": "1"
        },
        {
            "review_text": "Ignore the fact that Fez was made by the ultimate jerk. Ignore the bile that Phil Fish both gives and receives, and take the game on its own merits. This masterpiece deserves nothing less.",
            "review_score": "1"
        },
        {
            "review_text": "This is the greatest game ever, you know.",
            "review_score": "1"
        },
        {
            "review_text": "10/10",
            "review_score": "1"
        },
        {
            "review_text": "If you're still looking for the best platforming game this generation then you should've stopped long ago because it doesn't get any better than this. Excellent music and plenty of different levels to tackle. Xbox 360 controller highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "If you're wondering whether to play FEZ or not, don't. It's marvelous, fun, simple, and incredibly well designed. This game is for both casual puzzle/platform players as well as hardcore freak problem-solvers, because it's seriously full of those. Loved it, and recommend it with all my heart :D",
            "review_score": "1"
        },
        {
            "review_text": "very phun ",
            "review_score": "1"
        },
        {
            "review_text": "Pro's: - Pretty unique puzzle gameplay. - Graphic style.  Con's: - Really buggy: character gets stuck often, only playable in windowed mode otherwise graphic glitches and controls don't respond. - Could do with some more music. - Not much story. - Too easy if you don't count the decyphering. Only one level that took some effort to get through.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most brilliant game I've ever played. Phill Fish is maybe an ♥♥♥♥♥♥♥, but this game makes you forget what he ever said and did and just makes you enjoy wonderful expirience that this game is. The fact that this game does not affraid to throw you puzzles that you can't solve from the first try is simply amazing, especially in this day and age when handholding is something that is being required for most of the games by gamers.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful Platformer! In my personal TOP 10!!",
            "review_score": "1"
        },
        {
            "review_text": "Fez. Hate to say it, but after the happy the no more. There no have to be a joke! All aside is bad, but who knows... the joke have to get the sad after breakfast? 8/10 would recommend to a friend.",
            "review_score": "1"
        },
        {
            "review_text": "Pill Fhish did a thing.",
            "review_score": "1"
        },
        {
            "review_text": "Cant wait for the sequel",
            "review_score": "1"
        },
        {
            "review_text": "support Phil and buy it now",
            "review_score": "1"
        },
        {
            "review_text": "Honestly one of the greatest games I have ever played. A beautiful, challenging, and brilliant puzzle platformer with varying environments, mind-blowing mechanics, and amazing music. I cannot recommend this game enough. BUY FEZ NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Cannot recommend this game more. It is such a calming experience, and it has great gameplay to it. I bought it at the same time that I bought Super Meat Boy, and after struggling in SMB for a few levels or so, FEZ helped me calm down. It's music is lovely, and it's environment is stunning. I sincerely wish that FEZ II had not been cancelled, to see this story continue.",
            "review_score": "1"
        },
        {
            "review_text": "An amazingly fun puzzler. This game has a TON of secrets and getting them all can be annoyingly difficult at times, but the game can be completed without them. The music and detailed pixel art, animations, and sounds that accompany the game make the whole experience feel amazing! I'd recommend playing with headphones and an Xbox 360 controller for the most complete experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game's quality matches the infamy of its creator. It's more than a game about platforming and rotating. The universe has a depth to it, and the puzzles, if you choose to engage them, can be very challenging and rewarding. I highly encourage everyone to withhold from looking up anything until you have thought long and hard about a puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ has a deceptive appearance as a cute platformer with a simple premise, but it is chock-full of rewards for those who are observant, logical, and inquisitive. If you aren't taking notes and busting your brain while playing this game, you are missing out on its real underlying beauty.  Highly, HIGHLY recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful concept, beautiful platformer. The puzzles get overly obnoxious, so unless you really, really like looking them up and grinding them out, you aren't going to 100% the game.  It's a shame the developer was an ♥♥♥♥♥♥♥, because the game is a very solid, more relaxing style of platforming. If he made any more games I would be interested.  The game gets a little tedious when you have to navigate back to areas to try and get more completion/areas unlocked. The levels aren't set up in a predictable way to navigate, so there can be nooks and crannies everywhere. The map does give you information on what you unlocked.  Warning: If the save files get messed up, you can't recover them. There is almost an anti-cheat system on the damn saves, so you can't replace them with old files, or get Steam to update the cloud with old files.",
            "review_score": "1"
        },
        {
            "review_text": "Now, I only have to say 4 things about this game: 1. The mechanics of this game are unique and quite interesting 2. The game itself looks great and feels relaxing, it has really nice levels which with a unique atmosphere for each section of it 3. It's soundtrack is quite relaxing aswell, always being in theme with the level making you feel the game unfold right around you 4. Aaaand also it is very forgiving, even though it has some rather hard to understand puzzles (which i don't think are necessary to do for the full experience of the game) Overall, it's a great game, a piece of art indeed, which should be much more popular because of it's enviroment and because of it's gameplay, even though it does have a simplistic story, the way it develops throughout the game itself makes it quite nice.",
            "review_score": "1"
        },
        {
            "review_text": "This game is harder than engineering, 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Turing corners, HUH! IN 2D!",
            "review_score": "1"
        },
        {
            "review_text": "This mind-blowing game took my spatial imagination, tore it apart and made a whole new thing out of it. This game is a must-have!",
            "review_score": "1"
        },
        {
            "review_text": "It may just be the best game of a kind. I've never seen a puzzle-solving platformer to be that awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, havent even finished it yet. Not really worth it at full price tho 9/10 would recomend Also, please don´t judge a game because of what it's developer did or did not do AFTER it was released, that just shows how unreliable your review is.",
            "review_score": "1"
        },
        {
            "review_text": "I had a heck of a time getting this to work on my laptop, but when I did... It was gorgeously pixelated and adventuring through the world was stunning. There were interesting puzzles everywhere that depended on so many various factors and things. It was mysterious and made me curious. The game even has it's own language and number system going on at times. If you love puzzles and gorgeously crafted pixel environments then you will love Fez.",
            "review_score": "1"
        },
        {
            "review_text": "Have only played a few hours so far, but this game is really unique and beautiful! I love it!",
            "review_score": "1"
        },
        {
            "review_text": "fun puzzle/platformer with nice music :)",
            "review_score": "1"
        },
        {
            "review_text": "The best platformer I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Pixel graphics that are tight, well-rendered and animated, a twist on the 2D plane that is ingenius, interesting and plays into every aspect of the game.   really, for a puzzle platformer that plays fun, casual and interesting, you can't go wrong with this. you can reach the end with an average amount of effort, but there's a lot there for completionists; highly, highly reccommend.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is a very fun game for everybody. I say its worth the money and as i'm typing this, it is 75% off for 7.5 minutes so get it NOW.",
            "review_score": "1"
        },
        {
            "review_text": "Good fun for the casual gamer and has degrees of difficulty depending on how much you want to complete the game. To achieve 100% there are some insane tasks to complete though so don't commit to it unless you really have hours to lose. Easy game to pass the time though.",
            "review_score": "1"
        },
        {
            "review_text": "9.5/10 Best platform game after Megaman. With 3D-like 2D gameplay plus slick puzzles/secrets, this game is simply my #1 this year so far!",
            "review_score": "1"
        },
        {
            "review_text": "Great atmospheric game with incredible soundtrack. Filled with secrets and puzzles 'n stuff",
            "review_score": "1"
        },
        {
            "review_text": "fez is a pretty cool guy. eh lives in 3d world and doesn't afraid of anything.",
            "review_score": "1"
        },
        {
            "review_text": "This has got to be one of the wackiest games I've ever played. It's like you're playing a 3d game in 2d. :O",
            "review_score": "1"
        },
        {
            "review_text": "Adorable and relaxing. This is an indie game worth checking out.",
            "review_score": "1"
        },
        {
            "review_text": "Very Interesting 2D / 3D puzzle platformer. !WARNING! the game will look like it is crashing, this is suppose to happen. It is a very unique take on the 2D platformer. I recomend it.",
            "review_score": "1"
        },
        {
            "review_text": "I would love the game even more if Phil Fish wasn't such a hipster piece of ♥♥♥♥♥. 10/10 doe",
            "review_score": "1"
        },
        {
            "review_text": "probably one of the best games I have ever played- the graphics are beautiful and the gameplay is simple and soothing- i highy suggest you get it",
            "review_score": "1"
        },
        {
            "review_text": "Mind-bending game mechanics. Litteraly headache inducing! The idea of a 2D platformer that isn't really 2D. Its 3D. The floating islands you are plaforming on, does rotate 90-degrees at the press of a button. This game is an experience.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for chill out. (f*** the clock puzzle)",
            "review_score": "1"
        },
        {
            "review_text": "Definitely a must have for any lover of Platformer/Puzzle games...this is a very beautifully designed game and deserves it's popularity. FAH SHO!",
            "review_score": "1"
        },
        {
            "review_text": "A great, immersive and fun experience for everyone. The best game to pass time with.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is Amasing. Its 2D.. Or Is It, I Wish Fez II Came Out But It Wont So Fez Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game to anyone! It was a fantastic playthrough.",
            "review_score": "1"
        },
        {
            "review_text": "Merry Xmass has indeed arrived early: --&gt; easy to run - looks ♥♥♥♥en sweet - pixel porn nostalgia! * FEZ * in Steam/Store is less then $3 !",
            "review_score": "1"
        },
        {
            "review_text": "just buy this game NOW! it is AWESOME!",
            "review_score": "1"
        },
        {
            "review_text": "This isnt a review but if you guys get a error message that says this. 'An essential rendering feature is unsupported in your current drivers. Try updating your drivers to the latest version. If you are using the latest available drivers, your video card might not be able to run FEZ.' Please Help Me",
            "review_score": "1"
        },
        {
            "review_text": "The whole idea of messing around with dimensions is fascinating. Starting out with a 2d world really puts that in perspective. You have to manipulate everything around you via changing your perspective on things, which gets a lot deeper as you go on. The gameplay is fun and challenging, and the amount of secrets hidden throughout the world adds hours of fun. The sense of humour the developers have and how they inject it into such an immersive world is really well done, and you won't know what I mean till you complete the game and it all clicks into place. Not to mention, you get to wear a fez. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I love this game it is my favorite puzzle game i have not got through it though it is definitly an awsome game and i recommened it to people who like puzzles and pixle based games. ",
            "review_score": "1"
        },
        {
            "review_text": "11/10. One of the best indie games I've ever played. A must in every gamers collection.",
            "review_score": "1"
        },
        {
            "review_text": "Although it's technical problems, it's still a perl of a indie game. I don't fancy the developer too much, but the game is definitely a fresh breeze from your standard 2d indie platformer. What strikes me odd, is that it would run better on a port for OSX on Intel HD4440 than my desktop machine with AMD HD6870. There's something wrong, and Phil Fish haven't fixed it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome mechanics. Couldn't stop until I finished everything",
            "review_score": "1"
        },
        {
            "review_text": "Phil Fish is a ♥♥♥♥♥♥! -Everyone",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good platform game! I really enjoyed the puzzles and graphics (8-bit). Recommended!!!",
            "review_score": "1"
        },
        {
            "review_text": "I was addicted to this game until I finally beat it completely, and it was amazing. The way the game mechanic is used is really ingenious and the puzzles in this are perfect. My only qualm is that the last item needed to unlock only appears for five minutes once every week Kind of a let down, but hey, anything to keep people playing right?",
            "review_score": "1"
        },
        {
            "review_text": "This game brought job back to me worthless life. I was on the verge of suicide but then I found this game and everything changed. The sun came out, birds chirped, naked women fell from the sky. This game saved me and gave me naked women. Who wouldn't recoment this game.",
            "review_score": "1"
        },
        {
            "review_text": "You should play this. Fun puzzle game, doesn't do anything mindblowing, but does involve a large variety of puzzles. I really enjoyed the background and how it told a story through the atmosphere (i.e. through pictures, random tidbits).",
            "review_score": "1"
        },
        {
            "review_text": "Where puzzle meets exploration in a fascinating enviroment. One of the best games I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "[ If you played or owed a 8/16 bit console, read this ]: FEZ is an outstanding platform title, even rising above big names like Braid and Limbo. Yes, the gameplay is confusing at times and does not match its stellar visuals and sounds. But single player games are played for the experience and in that FEZ delivers. Get sucked into the bizzar yet beautiful world of gomez and the concept of time won't apply to you anymore.   [ If not, read this instead ]: This is a rare genre masterpiece and a testiment that immersion is not created by imitating the real world, but by giving life to the reality you created. Even If you are not into platformers, invest the 10 euros anyway. Not for the game itself, but for what games like these stand for ... true passion.    ",
            "review_score": "1"
        },
        {
            "review_text": "FEZ, where should I start. FEZ is an amazing game that provides very nice graphics which are very pleasant to the eye. The soundtrack is super soothing and great with good headphones. The overall construction of the game is great. If you are thinking about getting this game and you like games that work your mind, and require patience to complete this is the game for you. Even though I myself have not play a extreme amount of the game, it is safe to say that this is truly an amazing game in all aspects.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an amazing game. It has an amazing art style with a very original concept of switching what your perspective is. It is a great game for only $10. Also it is just adorable. I would really recomend this if you have any enjoyment of platformers at all.",
            "review_score": "1"
        },
        {
            "review_text": "most beautiful, most spectacular game i have ever had the pleasure of playing. pure wonder... ",
            "review_score": "1"
        },
        {
            "review_text": "This game is so different from anything I've ever played. It's pure and simple genius. Gets you hooked and keeps you there. It's beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Clever, fun, pretty. Perfect little game. Must play!",
            "review_score": "1"
        },
        {
            "review_text": "Other than Spelunky, FEZ is the only game I bought for more than one platform. I'm also aware that designer Phil Fish is a controversial figure. I'm enough of a cheapskate and activist that overcoming these things is a massive deal.  FEZ is beautiful and clever. Sometimes it's too clever for its own good, leading to some puzzles that are inexcusably ridiculous in some respect. Still, the high art and difficulty make this a must-play. It might even improve on a second playthrough, when you've forgotten enough to make it fun, but know enough to avoid the frustration of obscure puzzles.  Buy the soundtrack. It's honestly my favorite of all-time, and convinced me to fall in love again. It will capture your imagination.",
            "review_score": "1"
        },
        {
            "review_text": "This is by far the best side-scroller puzzle game I've ever played. Even though I got this during the summer sale, it's worth every penny at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Don't let any 'drama' or hear-say regarding the creator, Phil Fish, sway your opinion: Fez is simply a fantastic game.  It starts out a beautifully composed, pixel-style platformer. From there, it blossoms into quite the relaxing, puzzling, exploration journey. My biggest recommendation: avoid as many spoilers as you can, at least through your first play-through. The more you discover on your own, the more you'll enjoy the experience.  Take your time with Fez, and you'll have an absolute blast. You can easily eek ten-plus hours from the game, depending on how many hints you look up. If you haven't played it yet, get on it. It's more than worth it.  Here's hoping that somehow, some way Fez II comes back one day...",
            "review_score": "1"
        },
        {
            "review_text": "For months I watched this game go on sale and each time I vowed that I would never buy it. How could another 8-bit style game be as good as everyone is claiming? I mean c'mon, a 91 on metacritic?!? After playing for just a few minutes I am now wondering how it only got a 91 on metacritic. Its just a lot of fun, super original concept, and more proof that you dont need advanced graphics or complicated gameplay to make create a wonderful title.",
            "review_score": "1"
        },
        {
            "review_text": "Great throwback to the good memories retro video gaming can bring. The graphics and special effects all have meaningful artistic quality.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is a very great game, and even though the creator does not have the best personality, I would recommend FEZ to anybody who likes atmospheric puzzle games, and easter egg hunting. If you can separate the game from the creator, then get this game now.",
            "review_score": "1"
        },
        {
            "review_text": "This game brings a whole new perspective to platformers. Also note that this game was made by one guy, and it looks beautiful and it is played very cleanly. One of the best indie games that I've played by far. 91/100 is definately an appropriate rating. Check this game out if you're into a very relaxing game, yet gives you a mindblowing visual experience.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my absolute FAVORITE platformers that I've EVER played. Scratch that. One of my all-time FAVORITE games that I've played in my life. The game mechanic was very unique and user friendly. I've never played a game with such a relaxed feel to it before. Having the opportunity to be able to stop and take everything in, is truly awe-inspiring. I know that Polytron and Phil Fish may be gone for good. I really hope this won't always be the case, but if it is, I think I'll be ok, simply for the fact that FEZ is a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "Great relaxing little puzzle platformer with a fun mechanic. A lot of the Anti-cube puzzles require New Game Plus if you are a purist, but your progress transfers so worry not. If your goal is just to finish the game stress free, I would recommend any guide save IGN's; the Steam Guides are pretty nice. Overall good blend of clever new mechanics and aesthetic, great low-bit soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Cute Gomez. Thoughtful puzzles. Awesome design. ♥♥♥♥♥♥ through music.  It puts LIMBO to shame.",
            "review_score": "1"
        },
        {
            "review_text": "So much fun, absolutely delightful - i just wish there was more!!",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun. One of the best indy games of the last 5 years.",
            "review_score": "1"
        },
        {
            "review_text": "Love the art style and the way it works. It is amazing especially at this deal.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game with nice art + music. The first half is very enjoyable and casual, but the second half is much harder.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest fishing simulator ever.",
            "review_score": "1"
        },
        {
            "review_text": "I'm actually kind of shocked how good this game is. I don't mean to say that I didn't expect it to be good--from all I'd heard (and from how much time and work went into it), I expected it to be pretty good. I just didn't expect to be as good as it was, nor to be able to really appreciate the game as much as I did.  I haven't really ever cared for puzzle games of any kind, but FEZ really grabbed me. By and large, it doesn't feel arbitrary nor, usually, too difficult, but it does require you to actually use your head. (Also, I went into it expecting to regularly be presented with puzzles that'd be nigh-impossible to figure out, based on comments I'd heard about it, but I found this a great exaggeration of the truth. Maybe that's just me going in with that impression, but if it isn't, don't be intimidated, it's not as bad/tough as everyone says.)  I could probably go on about this game for another few hundred words, but I'll refrain. This game is worth playing; play it.",
            "review_score": "1"
        },
        {
            "review_text": "Fez brings nostaglia back to the players as it brings both new and old components to a platformer. From simple jumping and worlds, to the aspect of switching perspective, Fez is definitely a game I recommend. Although this isn't for everyone as it is very challenging with endlessly hard puzzles to decode. Even if you aren't up for the challenge and use guides on the interent, the experience you get form this gameplay and story is unexplainable. For the price it is 100% worth the buy if it interests you even at a first glance becuase it never fails to deliver what it advertises. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game's quality matches the infamy of its creator. It's more than a game about platforming and rotating. The universe has a depth to it, and the puzzles, if you choose to engage them, can be very challenging and rewarding. I highly encourage everyone to withhold from looking up anything until you have thought long and hard about a puzzle.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. I bought it on sale and fell in love. I love the puzzles and the cool designs of the worlds. Every door is an unexpected adventure. I would highly recommend this game. I haven't finished it yet and it will probably take me forever, but I really enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. Have bought many copies as presents for friends, highly recommended",
            "review_score": "1"
        },
        {
            "review_text": "Some have asked the question: Can a video game be art? I myself at first didn't know the answer to the question.  But after playing FEZ, my answer is a firm YES.",
            "review_score": "1"
        },
        {
            "review_text": "!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Asome, also new gamre plus is epic. ",
            "review_score": "1"
        },
        {
            "review_text": "MLG QUALITY RIGHT HERE LIKE TOTALLY ♥♥♥♥ED MY MIND. DORITOS AND ALL THE KIDS GOING MENTAL BECAUSE THEY GOT A NOSCOPE, Oh wait. ♥♥♥♥ wrong game. This game is fun.",
            "review_score": "1"
        },
        {
            "review_text": "I first knew my adventure was going to take me nowhere when i went through hell to climb up a mountian fell 3 times into the deathly fall below and at the end of all this I GOT A FEZ ALL I GOT FROM THAT WAS A FEZ    at the end of my ordeal the old man that had gave me this fez (idk how the old man got up there) he told me to go find these golden peices of kush from the realm of snoop (or somthing like that im a bit foggy on that memory) and i quickly set off on my adventure  my first ordeal was going around the town and finding the kush boxes to put in the door to the realm of snoop i had to invade everyones privacy by entering there houses and 360 noscoping the kush boxes from cross the map and aquiring the stoning powers of dank  after going through the door i realised this was created by fil fish and quickly went back to hentai   420/666   ",
            "review_score": "1"
        },
        {
            "review_text": "For those of you who love platformer and puzzlers, this game is for you.  You start out as gomez, the main character who has the ability to change the 2d into 3d and flip the world, discovering a whole new area.  the objective throughout the game is to collect small cube bits to make a big cube, which is a piece of the gigantic cube, you do this through the game. Solving puzzles, some of which the community took a entire year to solve. Gameplay is fluent and addictive, keeping you coming back for more.  Warning: you will find yourself frustrated with some of the puzzles, it does take time and patience to solve many of them.  Although the incident with phil fish and fez two happened, it may keep some of you from playing it, but by all means. Just because the developer is a bag, don't stop playing it. The game is very fun and references do appear, secrets are there for you to solve, making the game mysterious.  anti cube puzzles: these are optional puzzles that appear throughout the game and are very difficult, you may get frustrated alot with these things.  There's a whole new language, you can decipher this by paying close attention and researching the wiki or any site.  Overall, I give fez a 8/10, I love platformers, as this gave me great nostalgia of the good old days of gaming. I recommend this to anyone who loves the genre. You will have great memories and fun playing this and solving puzzles on the wiki. Good luck.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 tied with Portal 2 for best puzzle game EVER. Portal has a story fun characters and cool mechanics. FEZ has a story fun characters and cool mechanics. However, the stories are completely different, the characters have a completely different personality, and the mechanics and completely different. I would definitely recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most beautiful and inspiring games ever.",
            "review_score": "1"
        },
        {
            "review_text": "Great game...  ...weird, wacky, and crazily addictive",
            "review_score": "1"
        },
        {
            "review_text": "Great game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game and one that deserves to be completed. That will require some perseverence and looking up hints and cheats online. And there's no shame in that. In fact, that would be in keeping with the idea of the game because there are one or two parts that are nearly impossible without looking for outside help. I won't spoil anything but you only complete the game thoroughly with game+ mode (continuing). The game changes some of the parameters and then you will have your 'Aha!' moments. I thoroughly completed the PSN version, later thoroughly completed the (original) Xbox 360 version. It's something I want to revisit, whatever my platform of choice.  While the game is good and full of love and joy for gaming history, the soundtrack from Disasterpeace is an absolute knockout. Listen to this game with headphones or a really good sound system! The soundtrack album is also available in digital download and I consider it the best video game sountrack album I have heard to date. The music is inspired by nostalgic chip-tune music but it goes in its own direction, using effects like wow to also harken back to music on worn film. The music can be joyous and exciting but also bittersweet and melancholic. It reminds me of the tone of Boards of Canada music.  I have completed this game thoroughly on Steam. I keep thinking of the game with fondness. It's not an ordinary game. Its theme is in praise of expanding one's knowledge and perspective of the world. The visual design, the gameplay methodology, and the music all come together to deliver that harmonious and edifying notion of coming out better than where you started.",
            "review_score": "1"
        },
        {
            "review_text": "Relax old school trip",
            "review_score": "1"
        },
        {
            "review_text": "An interesting game.",
            "review_score": "1"
        },
        {
            "review_text": "Best puzzles ever. İf you like platformer games with lots of puzzles you will definitely love this",
            "review_score": "1"
        },
        {
            "review_text": "Seriously one of the best puzzle games I've ever played, very interesting concept.",
            "review_score": "1"
        },
        {
            "review_text": "Super smart puzzle-platformer, great challenge and great amount of content that's full of charm and style. This game provided me some great satsifactory moments, very very recommended!!  **((best played with a controller))",
            "review_score": "1"
        },
        {
            "review_text": "After playing Super Meat Boy and watching the Indie Game Movie, I decided to get the indie game FEZ! This game really impressed me. I love how this game can go from a 2D perspective to being able to rotate the game's world in a 3D style perspective. It has beautiful graphics and it's a game that can put your puzzling skills to the test. Fun game and it's currently one of my favourite indie games to play right now! I recommend this to anyone how enjoys platform games and those who like to solve puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "The was always something fishy about the dev.    Also,    My brain hurts.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an amazing mixture of puzzle and 2D platforming. Visualing stunning.",
            "review_score": "1"
        },
        {
            "review_text": "I saw this game had alot of bad feedback but i dont think thats the case. Ive only been playing te game for a few hours and i love it. Its a pretty simple game that you can just get on with.",
            "review_score": "1"
        },
        {
            "review_text": "- Great soundtrack - Switching perspective makes for an entertaining mechanic - Awesome visual style",
            "review_score": "1"
        },
        {
            "review_text": "Bit dull but verry interesting",
            "review_score": "1"
        },
        {
            "review_text": "Phil FIsh for president",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is an amazing puzzle game that will warp your perception of the 2D and 3D plane. You play as a little white marshmellow and you have a fez, you need to save the world from dissapearing by collecting yellow popcorn. The soundtrack is second to none, on my phone even. The platforming is rewarding and doesn't punish faliure, yet acknowledges it. The puzzles at times can become so cryptic that you will want to quit, and thats understandable, but the game will always have you coming back.",
            "review_score": "1"
        },
        {
            "review_text": "When I first played FEZ, I thought it was alright, but it's just a 2D platformer on top of a 2D platformer. The mechanic for changing perspective between the different 2D worlds is not unlike that of better (older) titles, such as Paper Mario. While the game is not flawed by this similarity, it really has nothin more going for it.  The art style is a mix of retro 8 and 16 bit era gaming. If that's what you enjoy, then this may be a game for you. The screenshots really do show the game as-is.  Honestly, the end of the game is not as rewarding as one might hope. It lacks any true component of challenge. Whereas games like Stealth ♥♥♥♥♥♥♥ or Mark of Ninja incorporate enemy elements alongside platforming, FEZ does not. I would have hoped for this challenge in FEZ 2, but the creator of the game apparently cannot take any criticism.  This is definitely a title for any gamer at any age, but it likely to be enjoyed more by a casual gamer.  I hope this was helpful.  6/10",
            "review_score": "1"
        },
        {
            "review_text": "Never mind what you may have heard about the creator, this is a fun little platformer with a neat gimmick. The puzzles can be weird and tricky though.",
            "review_score": "1"
        },
        {
            "review_text": "A very original and nice game. Quite short, but still for the prize especially during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Fresh gameplay mechanics, creative thinking, very smart and at times quite difficult to figure out. Interesting well-rounded game.",
            "review_score": "1"
        },
        {
            "review_text": "The smooth visuals and excellent game mechanics make for a fun and decently lengthy game! definitely worth buying.",
            "review_score": "1"
        },
        {
            "review_text": "Not sure what to say, nothing else that i know of like it. Is it a must own ? Yes but not something you have to go out of your way to own right away, hope that helps",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most awesome games I've played in the last 2 years, started playing and couldnt stop until I blasted my way thru all 64 cubes @@   A phone, a notepad and a pen are a must for this game(until you learn to read the tetrominos)",
            "review_score": "1"
        },
        {
            "review_text": "While I have enjoyed this game and think it's very well done, I don't think it's a masterpiece that I think many others make it out to be.   After about 1 hour into the game, it stops developing and there is no added depth to it. It looks nice, plays nice, and sounds nice, but unfortunately it plateaus pretty hard.   That being said, it does plateau high. So, I still think it's a great game! it's like an 8/10 for me.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is an amazing game with exstremly high attention to detail. it makes you feel like you are in a new reality. It's like discovirng a 4d world and exploring it. just an truely amazing experience. if you are considering to buy it just do it all ready.",
            "review_score": "1"
        },
        {
            "review_text": "I only played before I bought this on steam. If I remember correctly, it took me more than two weeks to finish the story and get all collectibles.  I don't know how to describe this game. The combination of 2D and 3D is excellent. You can rotate the camera to change the world view from one side to other side in a 4 side world. The area design is very good. While the story is linear and not too complex, after playing for a while I felt like I'm playing with just following the flow of the puzzles, not the story. I was wandering the whole world looking for a clue, but I almost forgot what the story was. The only important things in the story are in the first beginning when you get fez and in the second beginning when you get the black glasses. But, the puzzles itself has is good enough to make this game one of my favorite puzzle game.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Makes one wonder what experiencing a 4th dimension of space would be like in RL. ok brains hurting now...",
            "review_score": "1"
        },
        {
            "review_text": "Genuinely one of the best games I've ever played. I always say that any game where I feel like breaking out a pen and paper is a win in my book.",
            "review_score": "1"
        },
        {
            "review_text": "I can't say what I want to without putting ideas in your head, and even by writing this now you know something's up and I'm spoiling you in the spoiler warning, but consider this your spoiler warning.   I'm still working out some of the last puzzles in Fez, one of which is why this game makes me feel the way it does.   I think it's because of all the mysteries this game cloaks itself in. There's so much depth to the world, so many secrets you can feel just outside your peripheral vision, and I love playing a game that doesn't hold your hand and talk to you like you're a little idiot.   We need more games that aren't scared to slide the difficulty slider off the slider entirely.   Disclaimer: I'm a little idiot and couldn't solve some of these puzzles without cheating",
            "review_score": "1"
        },
        {
            "review_text": "Spellbinding, charming indie game that will put your dimensional perspective to the test combined with great platforming sections. But don't be fooled, this is not a platform game. It is a game of exploration and 8-bit wonders. It even goes deeper once you figure out there are even more codes and puzzles to break. Highly original, a game every gamer should own. Thanks for the PC port, Phil!",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautifully done. The mechanics, the style, and the drive to gain knowledge. At times it was simple, and at times it was very complex. I really enjoyed every second I put into this game. 9/10 would recommend to a friend.",
            "review_score": "1"
        },
        {
            "review_text": "'i'm trying to recreat that experience you play games as a kid before the internet existed and hearing these kind of urban legends: 'hey here if you go stand in that corner and u wait for five seconds and u press down and then u jump two times it warps u somewhere.' that's kinda what the game is about.' 'so it's meant to be played slowly and carefully like enjoy the world.' 'yeah.it's stop and smell the flowers kind of game.'  A piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "Super Mario World and Portal had a love child! FEZ is a definite must-play for anyone who loves puzzle platformers, 8-bit graphics, and chiptune themes and sounds. The idea is very simple, but beating the game is very, very hard.",
            "review_score": "1"
        },
        {
            "review_text": "Dear god this game is Amazing Tricky But Amazing",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie game ever",
            "review_score": "1"
        },
        {
            "review_text": "It´s a very fun and entertaining game, I definitely recommend it, I like visuals, and soundtrack also, can't stop playing it :D",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games. Great visuals, music, and story.",
            "review_score": "1"
        },
        {
            "review_text": "If you like paper mario this is another great adventure",
            "review_score": "1"
        },
        {
            "review_text": "The game's first playthrough is really simple with some easy puzzles and very relaxing, but the second playthrough is very challenging and will really test your problem solving skills with a plot that makes you wonder what is out there.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the most enjoyable games I've played in a while. If you like puzzles or platformers this game doesn't disappoint. I couldn't put it down for more than a day until I beat it because it is so addictive. The only part I didn't like was the clock tower    the tower syncs with the current time on your computer and it is almost impossible to get the last 2 cubes unless you are really good at guessing the right time to play the game    Other than that great game, real shame the creator snapped and shut down the sequal...",
            "review_score": "1"
        },
        {
            "review_text": "A great platformer with interesting gameplay. A must for anyone who can afford it.",
            "review_score": "1"
        },
        {
            "review_text": "The most Awesome Game I've every played considering the Gameplay. Phil Fish you really a good Game Designer. I like the soundtracks and the art style. The game levels are so vast, that you keep bouncing from one level to another. Its sometimes very confusing , but still good fun. Its good to play it for sometimes and then go off to work. It refershes my mind.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely love the mechanic behind this game. It took me a while to wrap my mind around having to move the world in order to advance, but once I got the hang of it I was amazed at how it was used. Just brilliant. And if the adventuring wasn't enough, the puzzles that they planted all over the world were quite devious, but it felt really good each time I solved one. After you beat the game, you are treated to possibly the best screen saver ever! Can't recommend this one enough.",
            "review_score": "1"
        },
        {
            "review_text": "I watched 'Indie Game the movie'. then bought the game.  Recommend doing those in reverse order :P",
            "review_score": "1"
        },
        {
            "review_text": "An awesome game, a bit coimplex latter game, but awesome anyway",
            "review_score": "1"
        },
        {
            "review_text": "Cute game, awesome gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is an amazing game with beautiful scenery colors and gameplay. I have spent hours wandering the seemingly endless world that Fez takes place in. And not one of the minutes I spent in this game was wasted. The bright, vibrant colors combined with realistic shading and design combine to create an area I can explore for hours. Not only is this game beautiful, but it is very smooth and fun. The gameplay feels amazing, and the levels and puzzles are perfect. Overall Fez is a smooth, vibrant world absolutely worthy of the ten dollars needed to purchase it. Don't let medias opinion on the creator, Phil Fish deter you about this game. I know you will enjoy it and spend a lot of time exploring the world inside of Fez.",
            "review_score": "1"
        },
        {
            "review_text": "First impression was amazing, really fun mechanics and gameplay, until you start having trouble finding more cubes. The goal of the game is to find 32 cubes (regular or anti-cubes), and eventually you 'will' have to resort to the internet. Those puzzles often require deciphering, invisible platforms, or other strange solutions where the hints are very easy to miss. Can be played until you can't solve any more puzzles without missing much; just play as much as you want.   + Fun mechanics + Easy controls (played with 360 controller, clearly designed with it in mind) + Beautiful graphics + Attention to detail, plenty of references, animals, etc + Short (took 6 hours for me), good for one weekend if you have a busy schedule + Essentially no dangers, pixel perfect movements, or randomly generated areas (very leisurely) - Some ridiculous puzzles, walkthrough necessary - No teleporting to visited areas, backtracking required (Teleporting back to start possible once you complete an area often available though) - Not very deep story (not expected) - Required windowed mode due to graphical bug (for me)",
            "review_score": "1"
        },
        {
            "review_text": "Atmosphere, pace, and art make this game a good escape.   This game is straight forward in the way you play it, but also doesn't hold your hand. I found myself wandering the gamescape totally lost, but still able to enjoy the sights and sounds.  This isn't a game for thrill seeking, trigger happy gamers, but it offers a great reward for those looking to experience an attractive explorative puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Smart game with some moments of pure genius. The perfect hybrid between a platform and a puzzle game, with the novelty of a 'compressed 3D' world. Only for those who are searching for something to challenge the brain rather than the fingers.",
            "review_score": "1"
        },
        {
            "review_text": "This game breaks your idea of indie games. This game got me into indie games. This game is simply amazing interms of graphics, music and story arch. A game that will go down in history. Be part of the history and play this beauty of a game",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely recommend this game to everyone. This is a 2.5D platformer that kept a smile on my face throughout my whole playthrough. It's really trippy in a good way that should be fun if you try it out.",
            "review_score": "1"
        },
        {
            "review_text": "I've seen alot of people who refuse to play Fez due to its creator, Phil Fish. Those people are missing out. Fez is a masterpiece. Not a game you could play everyday for hours on end, but a nice, peaceful, relaxing game to enjoy every once in a while. The main mechanic of the game is fun to play around with, and the visuals &amp; music are superb.",
            "review_score": "1"
        },
        {
            "review_text": "Got hat from old guy that made the world 4 times cooler 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one cool game if you love platformers, with a very unique concept.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great game, full of cool puzzles that people would really like. I just wish it didn't get so laggy if you're using say an older graphics card. It didn't feel like a fnatstic port of an xbox game, but given what sorta ports are out there, it's pretty decent.",
            "review_score": "1"
        },
        {
            "review_text": "I have never played a game that makes me calmer and as happy as FEZ. it gave me a feeling i havent felt for years, a feeling i felt back when the idea of halo cod and bf werent in my mind. when i thought of 100%ing ratchet and clank. its a fresh breath of air every gamer should experience to just have some enjoyment ",
            "review_score": "1"
        },
        {
            "review_text": "I recommend Fez because it makes me happy. It reminds me of games of old and has a certain charm to it. Fez is really good fun.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting story with great detail in every piece of the game.  Very fun and addictive!",
            "review_score": "1"
        },
        {
            "review_text": "It's too slow paced for me to complete, otherwise FEZ is FEZ, with it's nice ost. ",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable and deceptively enthalling game.",
            "review_score": "1"
        },
        {
            "review_text": "neat game, very good for the price, awesome concept, abit repetitive at times",
            "review_score": "1"
        },
        {
            "review_text": "It's original ideas make it a great platformer. Just don't expect it to be a walk in the park.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing indie game. I literally cannot get over how fun this is. Everyone needs to play this game. I don't even know how to describe it. The way the movement in the game works is flawless, and the entire idea is brilliant. Bravo to the dev team, this game is just beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, what can I say FEZ? That you were the best sidescroller I've ever played? No that would'nt do you justice. Best game I've ever played? Quite possibly. Don't miss this game, or you will miss one of gaming's finest moments.",
            "review_score": "1"
        },
        {
            "review_text": "I played it through once, then suddenly it stopped working. Now when I start it, the frame rate is extremely low (around 2-4fps) and gets lower when there's a lot on the screen. It is unplayable.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is a 2D puzzle platformer that exists in a 3D world. The main mechanic is that you choose what 2D plane you move in, and is the source of most of the puzzles of fez. The main goal of Fez to explore the world to find as many cubes and anti-cubes as you can. There is no urgency in Fez, and it is a rather relaxing game.  The puzzles range that involve Fez's main mechanic are mostly interesting, but ususally are not all that hard. However, there are a lot of puzzles that involve code-breaking that start as fun but soon get repetitive. I think Fez can be frustrating for completionists, as some of the puzzles are very close to impossible to solve without looking them up online, which takes away some of the satisfaction. Seriously, to say that one needs to think outside of the box to solve the hardest puzzles in Fez is an incredible understatement. They will either have to be a lucky-guessing genius, or give up and find the solutions online.   A few other minor complaints: The in-game map is rather clunky. Additionally, while there are a few ways to travel quickly accross the large world of Fez, there will still be a large amount of backtracking that can get very tedious.   All in all, the game is relaxing and a fun game to throw some time into. There is a chance that completionists could end up finding Fez to get tedious after a while (I did, and gave up on completing Fez). But for anyone who has interest in a relaxing 2d puzzle platformer, I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for people who like puzzles! The symbols are hard to figure out unless you look it up on the internet. Overall, I have to give it a 9.5 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "As somebody who grew up playing NES, this game is simultaneously nostalgic and fresh!  Great game and highly recommend this to anybody on the fence of buying this. Also recommend playing with a controller.  Cheers",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is a game I thoroughly enjoyed playing. While there isn't much in the aspect of game mechanics except for the 'dimension shift', the retro pixelart-style,  brilliant  soundtrack and sheer level of world detail more than make up for it. The difficulty is moderate, you don't need Super Meat Boy-pro platforming skills to get to stuff and most of the puzzles don't tax your brain  too  much.  Overall, a very great game. 11/10 from me.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't think I would enjoy it as much as I did. The only complaint I have is navigating the world map can be hard.   Headache inducing.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is s cute game thats simple and fun to play. The majer benefits is that its relatively cheap.",
            "review_score": "1"
        },
        {
            "review_text": "most enjoyable puzzle-platform game ever played by me. smooth controls, clever puzzles and not frustratable.  my score 99/100. not 100 because i wanted more :P",
            "review_score": "1"
        },
        {
            "review_text": "Brillaintly put together game.",
            "review_score": "1"
        },
        {
            "review_text": "After finishing this game, my 4 year old turned to me and asked, 'What does that mean?' I don't have a clue.  This is a puzzle platformer whose gimmick is manipulating the perspective of the world. It's a really good gimmick and it works out well. During the course of the 6 hours I took playing and beating Fez I was constantly switching between really liking it and hating it. Obviously, that makes it hard to recommend.  There's a lot of content here. Much of it near impossible to access if you don't have a web-browser open with a walkthrough site telling you how to access the next secret cube. None of this is required to play and beat the game, but if you have the time and an open internet connection you can find out how to read the hidden language in the game, the unique counting system, the language for representing keypresses, etc. There's even a puzzle that requires you to decode morse code into the game language to find the right buttons to press. Does that make it a good game? Nope, not at all; but it does have a lot of content.  The travelling system is quite a pain. The problems arise when you know where you want to go (because you can see it on the map) but you can't get there easily, so you do a lot of back-tracking to get to there. Even worse is when you know where you want to go but can't find the door to get there. Then you start playing Russian roulette between loading screens hoping that this last door will be the one you need to get to.  Pretty much all my biggest problems with the game are easily solved with an active internet connection, but that's not as much fun. Sadly, being frustrated isn't fun either.  Still, the core concept is solid, the controls are spot on, and the world is colorful and vibrant. Pick it up if it's on sale and you've watched 'Indie Game: The Movie'",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing, beautiful, some of the puzzles are killer.",
            "review_score": "1"
        },
        {
            "review_text": "Vibrant, charming and unique, Fez is a game that gives you a real sense of adventure and, occasionally, wonder. A beautifully realized and lovingly crafted puzzle platformer with plenty of secrets. I can't think of many games that make me feel so happy and at peace as Fez has.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle platformer. Loved every minute. Highly recommended if you're a fan of this genre. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Its super pretty, fun, simple to beat but hard to 100%. Amazing soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "I've never played this Game, but it seems gud. Would git *\\0/* 10v10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "++++",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is a beautiful, aesthetically complete game that feels fresh while still maintaining a sense of familiarity.  The game has come under criticism for certain elements, particularly somewhat arduous navigation despite required backtracking, and some puzzles with questionable (or ambiguous, or nearly impossible) solutions, but these shortcomings are overshadowed by the beautiful colors, distinct but cohesive level design, engaging exploration and desire to advance.  My favorite part, however, is the sound design. Simple, elegant, minimalist. It sucks you in with its sparse but perfectly complimentary ambiance. I couldn't wait to put on a pair of headphones and just feel immersed in this pixelated world.  I recommend this game, but with a note of caution: if you can't figure something out, leave it and go explore somewhere else. Chances are you don't have what you need, and you'll only hurt your head by banging it against the wall.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful! Perfect to play through with a child, as well, thanks to its gentle spirit and lack of violence. Fun puzzles, especially if you let the places you are stuck at marinate for awhile, rather than going to online guides. I played through most of the game months ago, and picked it back up again recently, which for some reason allowed me to see solutions that I hadn't the first time.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is amazing!  One of my favourite indie games of all time. It was recommended to me by a friend, so I decided to buy it. Great decision. Great game. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Fun puzzle platformer game, the graphics, sounds, style, music, gameplay, and even smell of this game are all awesome. I have to google half of the puzzles to know what to do because im not a decoding god, bet even with cheating, its a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Although this game might not be the action packed platformer you are craving for, this game's art style, the music, and the overall feel of the game makes you keep coming back for more. Definitely invest in a controller for this one.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very special, very uncommon. Phil Fish is a prodigy.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the most Indie game in existence",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: Not your usual 16-bit game.  One of the most exquisitely executed games I have ever experienced, this goes beyond the realms of your regular side-scrolling platformer and turns it inside out, upside down (literally, with the incorporation of changing viewpoints...the concept is so simple yet brilliant). From beginning to end, the gameplay is mesmerising. The palettes used in each world/room are perfect for the setting, and the soundtrack is an alien chiptune earworm. Despite the innocuous presentation of the landscapes, the puzzles are not child's play - many times I had to resort to consulting the internet to find the anti-cubes (which are 'extras' anyway).  Gomez is the most adorable protagonist in gaming history.",
            "review_score": "1"
        },
        {
            "review_text": "This game has shattered my mind. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining game; 5/5 would recommend",
            "review_score": "1"
        },
        {
            "review_text": "its fun is way cooler than it looks andis addicting",
            "review_score": "1"
        },
        {
            "review_text": "I thought I wanted to play this game, but I didn't because it seemed like it might not be worth the price. Current me really wants past me to want to play it more than past me does so he buys it now and starts spreading the good news before now.",
            "review_score": "1"
        },
        {
            "review_text": "Super smart puzzle-platformer, great challenge and great amount of content that's full of charm and style. This game provided me some great satsifactory moments, very very recommended!!  **((best played with a controller))",
            "review_score": "1"
        },
        {
            "review_text": "Fez is an incredible masterpiece of a game. The 2D interaction in 3D space is well designed and is fun to play with, and there's no enemies or anything to distract you from the puzzles. The puzzles themselves, however, are impossibly mindbending - although most of the solutions may seem incredibly obvious in hindsight. I'd only recommend this if you enjoy wrapping your mind around the most subtle of conundrums - having said that, there's no shame in looking up the new game+ end-game puzzles...",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, innovative, interesting gameplay. The amount of collectables and easter eggs keep you looking for new messages within the game. A total must play!",
            "review_score": "1"
        },
        {
            "review_text": "It is a very awesome game with a friendly enviroment, it can get dull sometimes (I am not totally sure what all the mechanics are, I have only played for about an hour or two, so it might get more intresting, but yes I do recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is an immersive, beautiful game that demonstrates an artistic vision coming to fruition. Be warned: without a penchant for puzzles, one may find this game little more than a 'pretentious platformer.'",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun. Makes me think. Pretty good!",
            "review_score": "1"
        },
        {
            "review_text": "Magically mysterious, immersive experience. Audiovisually amazingly beautiful and intact. A piece of art designed and implemented with passion and love.",
            "review_score": "1"
        },
        {
            "review_text": "I can't put into words the wonder that this game fills me with. It is beautiful, creative, and it is one of the most original game that i have ever played. Too bad the sequel is canceled because this left me wanting more.  8.6/10",
            "review_score": "1"
        },
        {
            "review_text": "I have played FEZ to completion on XBox 360 and loved it so much that I am buying here for the future and I am planning on buying for the PlayStation Vita for a handheld versions. This is in my top 5 games of all time. I grew up with the NES, and FEZ captures the mystery and exploration felt when playing The Legend of Zelda. The puzzles are both challenging and rewarding (some even require QR codes scanners or paper and pencil to translate symbols to crack the code) and the world will keep me playing this game over and over again.  ",
            "review_score": "1"
        },
        {
            "review_text": "I'ts a very interesting game. I loved ıt. It never ends !!!",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game it was amazing the art style was an exelent choice and the gamplay was awesome I hope there is a sequel",
            "review_score": "1"
        },
        {
            "review_text": "Admission: I have not explored every secret of Fez yet. And honestly, that may be part of why I am so enamored with it. There is a compelling mystery in the world Gomez inhabits and I still feel I've only scratched the surface. Regardless of what I might discover later, I will tell you that this game has perfect platforming, atmosphere in abundance and incredibly creative, mind-warping puzzles involving perspective. It also features a pretty profound story that centers on the fact that poor little 2-D Gomez is really in a 3-D world. That changes everything. From start to kill screen, there is plenty to completely enjoy in this game and I recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "I have only played 36 minutes of this game and it blew my mind. It's a very unique design, I watched Indie Game The Movie and I really disliked Phil Fish. However, after playing the game I have changed my opinion of him (and his team). He(and team) wanted to create a perfect and beautiful game and they took their time doing so. I am really glad they did. This game is amazing and I can not wait to play more of it. I totally reccomend this game if you want a casual, calm, fun and visually stunning unique gameplay experience. If you are looking for hardcore non-stop action...this might not be your cup of tea. I don't write many reviews but when I do, it's because I love the game.",
            "review_score": "1"
        },
        {
            "review_text": "So much fun! Graphics are fun in that they mimic the old pixelated images of yesteryear, but the 3D concept is nicely fashioned. The puzzles are intriguing, though I have found myself a little confused as to which level goes first/second, etc. Another thing - works great on my mac, but perhaps the video card in my PC needs an update since FEZ acts like it's underwater in how slow it works, and the jerky motion of the video graphics is frustrating since I would often overshoot jumps.  Overall, though, a really fun game, a great concept, and puzzles are awesome!",
            "review_score": "1"
        },
        {
            "review_text": "No game has brought back the charm and awe of exploration that I felt in the old Mario and Zelda games like Fez. At the same time, it feels fresh and new and mysterious. A beautifully rendered masterpiece that should not be missed!",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that you open up for the first time, and you just look at how pretty it is with the music and video quality, and its just one that makes you just wanna say 'OH MY GUGHGHAHAHAH ITS SOO CUTE'  I really love the game so far, and I haven't even scratched the surface. I love the whole concept of the game, and it is totally something everyone should experience and play.  Yeah.  It's really cute.",
            "review_score": "1"
        },
        {
            "review_text": "One of the very best games I've played in a very long time. It's cute, the music is soulful and immersive, and the controls are tight and easy. If you like spatial puzzles this game will have you on your knees begging for more.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fantastic. The music, the setting, and the game play are so unique and captivating. It will bring back fond memories of platforming. There is absolutely no reason not to buy this game and play it through until you have collected everything.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice mysterious game :D",
            "review_score": "1"
        },
        {
            "review_text": "I'll say this once, this is the most beautiful game i ahev every played in the intrirty of my exsistence in reality so far",
            "review_score": "1"
        },
        {
            "review_text": "This unique platformer gets high marks for artistic style, presentation, and game play. One of a kind, and highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun platformer, but it definitely plays better with a gamepad.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game but will definately take cheating to find everything.",
            "review_score": "1"
        },
        {
            "review_text": "Having this game at work with a controller is a great use of time. Loving the expierence so far.",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully designed game that is both intriguing and fun. Whilst some of the puzzles are too cryptic to be considered good in my opinion, the ability to continue with the story without finishing them makes the game almost flawless.",
            "review_score": "1"
        },
        {
            "review_text": "One thing I can say about FEZ is that I don't agree with the stellar reviews around the time of its release praising the game for its fascinating puzzles and uniqueness.  Another thing I can say about FEZ is that despite its flaws (puzzles are either too simple or become too complex and boring to be worth the time, for instance), it's a great game.  I can't entirely pinpoint as to why I thought so, but I think those are part of the reason: - Low price of $9.99 - Long game - Beautiful - Nice soundtrack - Does take a gameplay element that is rarely seen and pushes it further (playing with perspective) - Many, many environments to explore at a nice pace  FEZ is not the groundbreaking game it could've been in my opinion, but the experience is definitely interesting and I don't doubt for an instant its worth your time and money, even if it was $14.99 or perhaps even slightly higher.",
            "review_score": "1"
        },
        {
            "review_text": "Just like Portal bends your mind and makes you think outside the box so to does Fez. I can not recommend this game enough! The chip-tune music and pixel-graphics will appeal to some and turn other people away. Personally I love the retro feeling and the level design is one of the best I've ever seen. Ever. Grab this game. It will challange you and give you a never before seen gaming experience.",
            "review_score": "1"
        },
        {
            "review_text": "Get this game. It is a solid platformer with a very intriguing twist on being able to switch between 2D and 3D persepctives. The setting is fantastic and the whole pixel-art lends to the general likeability of this game. I highly recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "This game bring back childhood memories",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining, challenging, and fun as hell. Give it a try :)",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic 2D/3D design and concept. Many wonderful pixel art worlds to explore. Unique and rewarding platform jumping challenges and some perplexing puzzles. Play it using a gamepad for best results :)",
            "review_score": "1"
        },
        {
            "review_text": "It's about a stupid kid, whose name is probably Sesame, who has a stupid fez cap on his stupid albino head, and he goes on a really stupid and boring adventure, only to save his ♥♥♥♥♥♥♥♥ Great Grandfather, Mishka, with a few side effects, such as being able to see 3D freakin' objects. Cause yolo.",
            "review_score": "1"
        },
        {
            "review_text": "a game that will make your day. :)",
            "review_score": "1"
        },
        {
            "review_text": "This is some sort of Metroid-vania game but you can fold space and time with delicious results. What seems like a simple game turns out to have a deep backstory and a lot of extras that will make you think but not completely frustrate you. The map system is very well thought out, controls are precise and game mechanics overall are an A+. BUY BUY BUY",
            "review_score": "1"
        },
        {
            "review_text": "fun and difficult game to play",
            "review_score": "1"
        },
        {
            "review_text": "Really really fun! Puzzles and platforming",
            "review_score": "1"
        },
        {
            "review_text": "Absoultely amazing game! My personal game of the year 2013. This game is a must play!",
            "review_score": "1"
        },
        {
            "review_text": "Neat Concept. Really enjoyed the game. Could be a little longer/have more content.",
            "review_score": "1"
        },
        {
            "review_text": "Well this game kind of changed my life so yeah I can recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Take caution with this game! It doesn't support certain graphic cards and may not run well! Still I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "The game is good, but before you buy know the following: The guy who made the game is a total jerk. He stole the game concept from a former friend, said some really nasty things about gamers and then rage-quit the video game industry over internet arguments. Although I've defended him several times in the past he's only gotten worse with time.  So consider NOT buying this game (even though it really is a good game)",
            "review_score": "1"
        },
        {
            "review_text": "The first two thirds is a straight platformer with some interesting 3D puzzles, which was extremely enjoyable. The last third is a bunch of random puzzles (such as diving key press sequences from various background elements) which really didn't suit the style of the game. Play for the first two thirds, uninstall once you finish the exploration and start needing to Google for solutions.",
            "review_score": "1"
        },
        {
            "review_text": "Very well made game. I enjoy every part of it! I'm learning new secrets every time I play it!",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun. Makes me think. Pretty good!",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Just really hard as crap to find everything.",
            "review_score": "1"
        },
        {
            "review_text": "Beutiful graphics, amazing sotryline and an overall calming game, I recomend this game to hardcore and casual gamers. I garuntee, you will love this game",
            "review_score": "1"
        },
        {
            "review_text": "Relaxing, pleasant, easy going, yet triggers the mind. Pixel art is great. Total YES to this game :)",
            "review_score": "1"
        },
        {
            "review_text": "On the surface it's a beautiful platformer with a great hook. Look deeper and it's a love-letter to video games so complex and nuanced that few will solve all it's puzzles. If you haven't played it, you're missing out.",
            "review_score": "1"
        },
        {
            "review_text": "This game absolutely deserves its 91 scores. The world is beautiful (a masterpiece in pixel art, if you ask me) and very creatively designed, and there's so many interesting puzzles left after you finish the game with 32 cubes. Brilliant work, Phil Fish!",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly good platform game! I really enjoyed the puzzles and graphics (8-bit). Recommended!!!",
            "review_score": "1"
        },
        {
            "review_text": "I only played before I bought this on steam. If I remember correctly, it took me more than two weeks to finish the story and get all collectibles.  I don't know how to describe this game. The combination of 2D and 3D is excellent. You can rotate the camera to change the world view from one side to other side in a 4 side world. The area design is very good. While the story is linear and not too complex, after playing for a while I felt like I'm playing with just following the flow of the puzzles, not the story. I was wandering the whole world looking for a clue, but I almost forgot what the story was. The only important things in the story are in the first beginning when you get fez and in the second beginning when you get the black glasses. But, the puzzles itself has is good enough to make this game one of my favorite puzzle game.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Wow. This game is truley unique. I find myself wondering what a multiplayer arena might look like in this world...",
            "review_score": "1"
        },
        {
            "review_text": "With great power, comes silly headgear. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A very different and thoughtful indy game. I liked this one a lot. It always kept me thinking.",
            "review_score": "1"
        },
        {
            "review_text": "Innovative and cute, but having a really difficult time navigating the game world and making sense of the map. Still worth it overall though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful, great soundtrack. The only things I can complain about is the lack of help cause I'm stuck just because the cube wouldn't tell me where to go exactly sooo I'm confused and 2nd Phil Fish is still an ♥♥♥♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Great game that you can spend hours playing. Controller integration/support is top notch",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful. I love the graphics and how this game just breaks logic. This is absolutely worth picking up if you enjoy a unique platforming puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "MY HEAD IT HURTS SOO MUCH!!! Honestly, i really do enjoy this game, and the entire 3D/2D thing is just mind blowing, but its difficult to play for long periods. Take a break every once in a while.. ",
            "review_score": "1"
        },
        {
            "review_text": "Good puzzle game, good luck finding all the cubes (you won't.)",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics combined with compelling music and intriguing puzzles make a masterpiece like this. A simple goal that is hard to reach, this game requires patience, knowledge, and yes, you're going to need a guide. This is my favorite game, but don't take my opinion. Buy it and see how you like it.",
            "review_score": "1"
        },
        {
            "review_text": "This game bring back childhood memories",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game with simple controls and beautiful graphics, truly a game to be played",
            "review_score": "1"
        },
        {
            "review_text": "The art style and sound track is amazing! One of my favourite Indie games!",
            "review_score": "1"
        },
        {
            "review_text": "Great game! While playing, you can tell the amount of detail put into this game is astronomical and that the many delays of its release where well justified. Unlike any other game out there, Fez allows the player to 'flip' the screen view, much like turning a dice to see the numbers on the other sides. This feature adds depth to what would otherwise be just another side scroller adventure. At first glance, the game is relatively short, but allows for multiple playthroughs to find all collectibles. Fulfilling puzzles utilizing an in-game language replace the need for enemies and make the game hard to put down. The electronic style soundtrack adds to the experience and negates the need to have a background window open for music. I would recommend this game to anyone who likes their games to be a mental challange and not merely a first-person, action-filled shooter.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun. One of the best indy games of the last 5 years.",
            "review_score": "1"
        },
        {
            "review_text": "F  (ive Guys and Fri)  EZ.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is an incredibly well made 3d-2d platforming adventure, following the incredibly adorable Gomez on his quest to restore balance to the universe. The controls are pretty tight but it's the clever gameplay and fantastic visuals that hook players on this masterpeice, and although you may or may not hate it's creator, but you cannot deny the genius this game displays. ",
            "review_score": "1"
        },
        {
            "review_text": "Great graphics, but resolution still not changeable :/ (on game screen) but still i recommend this :3",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It's a very tricky puzzler with a lot of polish. Some puzzles seem to be nearly impossible without looking them up on the web. I would overall recommend this game to anyone that can tolerate puzzle games and appreciate the art style.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Had to look at the guide a few times because some of the puzzles in this game are crazy deep.",
            "review_score": "1"
        },
        {
            "review_text": "The most fun you can have with your pants off and your thinking cap on to keep you from ripping out your hair. Seriously, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Its alright I guess.",
            "review_score": "1"
        },
        {
            "review_text": "This charming, whimsical game takes pixel art retro-gaming into a fresh new dimension. Expect twisted perspectives as your world flattens and expands from 2D into 3D and back again with effects that would have made graphic artist M.C. Escher proud. Vector SFX graphics reach exalted heights, at times evocative of Doug Trumbull's time-travel sequence in Stanley Kubrick's 2001: A Space Odyssey. Dreamy, spacious synthesized music, an air of mystery and plenty of secrets to uncover make the world of FEZ hard to escape and impossible to forget.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "Very good, i was surprised",
            "review_score": "1"
        },
        {
            "review_text": "this is a fantastic game  I love playing this with my daughter",
            "review_score": "1"
        },
        {
            "review_text": "Love the 2d/3d puzzleness of it",
            "review_score": "1"
        },
        {
            "review_text": "A mesmerizing, colourful adventure. So clever that you can't help but play with a smile on your face.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most trickiest puzzle games I've seens o far.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best and longest puzzle games I've played. The main story is not really hard, it gives a nice twist in the old 2d/3d platformers. The advanced puzzles/secrets, however are really hard to complete/find though, and I finally understood the map when I had my second playthrough (new game +). It's good to see that the map shows you where you have forgotten secrets/items, otherwise this game would have been impossible to 200% (yes, it's 200%). Aside from that, it is really fun to play and the puzzles are really genius sometimes. (QR code scanning, reading morse code etc.) 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Fez is a great game that I cannot wait to play it more. It goes to show that after so many years there can be something new for Platformers. I would recommend to anyone of any age for a good few hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "it is so freaking amazing i loved how you could chang your view of the 2d world and i loved the visual effects",
            "review_score": "1"
        },
        {
            "review_text": "A beautfiul game, it just relaxes me when I play it. FEZ has a very intriguing 3d perspective system. It also has a type of open-world where the player can get lost in very easily :\\ but thanks to a little game mechanic, we're able to find our way. The game has puzzles which vary from simple and easy to extremely complex! Sometimes involving the fact that you have to learn a new language! Yeah, you have to learn a new language in order to complete certain puzzles. The FEZ language is a very complex language but it is possible to beat the game without complete understanding of the language. I haven't even started on the amazing soundtrack this game has. It is beautfiul, I don't see any flaws with it's music as it is so graceful and calming.   This game is perfect for when yr not in a good mood and you want to just roam around a calm land doing little puzzles. Also recommend an XBOX controller for this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game that is chalenging at times but is truley just a game where if you can think through the problem then you will survive.",
            "review_score": "1"
        },
        {
            "review_text": "Level design is beautifully brutal",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful concept, beautiful platformer. The puzzles get overly obnoxious, so unless you really, really like looking them up and grinding them out, you aren't going to 100% the game.  It's a shame the developer was an ♥♥♥♥♥♥♥, because the game is a very solid, more relaxing style of platforming. If he made any more games I would be interested.  The game gets a little tedious when you have to navigate back to areas to try and get more completion/areas unlocked. The levels aren't set up in a predictable way to navigate, so there can be nooks and crannies everywhere. The map does give you information on what you unlocked.  Warning: If the save files get messed up, you can't recover them. There is almost an anti-cheat system on the damn saves, so you can't replace them with old files, or get Steam to update the cloud with old files.",
            "review_score": "1"
        },
        {
            "review_text": "This game is sheer effing brilliance",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is one of the coolest games ive ever played, I have been watching it for some time now and bought it at the summer sale.  Its an amazing game its been like 4 days and i already have 4 hours. 9/10 (Some puzzles are un-solvable and you have to turn to the internet. i was stuck in a room for half an hour.)",
            "review_score": "1"
        },
        {
            "review_text": "This is a very fun game to play by yourself without feeling lonely or anything like that. It has a wonderful soundtrack and nice game mechanics. I would definetly recommend this to other players who enjoy indie platformers.",
            "review_score": "1"
        },
        {
            "review_text": "Hard but good",
            "review_score": "1"
        },
        {
            "review_text": "Freaking great game, tons of fun, really cute music.",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully designed game flow. Every game should be like this.",
            "review_score": "1"
        },
        {
            "review_text": "This is hands down the best platformer I've ever played. Rich with wonderful visuals, amazing soundtrack, and lots of challenges and puzzles to overcome. If anything you'll buy this game and you won't regret it! Be sure to get the soundtrack too because there are some really great tunes in this game that you'll want to hear outside of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Very best of 2D-platformers. Unique.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most original platform game I have ever played. Love it! Pretty sure that you will love it as well.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game. I saw Indie Game the Movie a while back and I was really intreagued by Phil Fish's plight and struggle to get the game finished and released. You can tell with every map, puzzle and hand crafted pixel texture that he really poured his heart and soul into this game. It really shows. Phil has had a lot of bad press of a personal nature, but the game is nothing short of genius - and I'm not suprised in the least that he's defensive when criticised.  It's fun, intreaguing, clever and really quite puzzling at times. I'm not usually a platform gamer, but this game has really got me.  NOTE TO PHIL: the chances that you might read this are slim to none but if against all odds you happen to be reading this - don't let people get you down. There are more good people out there than there are malicious, the malicious are just louder and more aggressive. Fez is a work of art, whether or not Fez II ever happens. It simply doesn't matter, just enjoy what you've done.",
            "review_score": "1"
        },
        {
            "review_text": "A good puzzle/platformer/scavengerhunt game",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun yet difficult. :)",
            "review_score": "1"
        },
        {
            "review_text": "pros : Great game i had fun playing this for the 2nd time, very tricky puzzles,   cons: this game has its own language which i find very annoying to translate, also no Fez 2 :( . few glitches here and there.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely well put together game. Nearly perfect!   This is a 2d platforming game that allows 3d rotation of your viewable world. This relatively simple gimmick creates a wide variety of puzzle possibilities. Fez does a wonderful job of slowly introducing you to the mechanics, then expanding the goals for multiple hours of enjoyment.   I have a couple extremely minor complaints about the very end game unlockable goals, mostly they achieve unreasonable levels of difficulty (including a puzzle that literally nobody in the world has figured out WHY the solution is what it is).   Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Fez has a rich backstory, which you discover or more accurately decipher over the course of the game. The movement and rotation gameplay mechanics are great and the new twists which are added in the various sections of the map are fun rather than gimmicky. The puzzles get progressively more difficult after the first 32 Cubes are found, but in most of these cases the solutions are located in the game and provide a great sense of reward when finally figured out. Classrooms are a great place for learning!  The most difficult puzzles require understanding the three sets of symbols in the game. I ultimately had to look outside the game to figure the counting system, as I had actually made errors in my assumptions of how it worked! Nevertheless I thoroughly enjoyed playing Fez.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed this game, took 2 or 3 days to complete the main storyline. Excellent fun.",
            "review_score": "1"
        },
        {
            "review_text": "Video games as art? This game is exactly what it means for a video game to be art. ",
            "review_score": "1"
        },
        {
            "review_text": "OH my god, god forbid please play this game. i have spent hours on hours playing this game, and ive enjoyed every second of it. the puzzles, the story is just amazing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is entertaining, but wow am I lost. You play as a square-headed creature that realizes that he is a cube-head. Climb and spin the level in order to grab golden cubes and reach other areas. Most doors you go through send you to another area with many more doors. Some levels will come to an end, and then you will need to backtrack; some areas will have a portal cube that sends you to a slightly familiar level; and then others seem to go on for a very long time. I know that there are some areas that I have not explored because I chose the wrong door. I first started in a peaceful village, and now I'm in a floating graveyard; and I know I missed a treasure chest because I didn't have a key. I found a key ten levels later, but I forgot where the chest was located. Like I said, lost. This would be so much easier with a TARDIS.",
            "review_score": "1"
        },
        {
            "review_text": "Cute little game, with a very deep story. Would definitely recommend if you're into games with a deeper meaning. The only thing I that could've been improved is the gameplay, as I do find it a bit repetitive at times, but other than that; fantastic game!",
            "review_score": "1"
        },
        {
            "review_text": "Ignore the negative comments made about Mr. Fish, this is pure videogame gold. Classic platforming action with a twist (Yes, a bad pun, I know), and some down-right obtuse puzzles make this a rare gem indeed. Something everyone should expereince.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is honestly one of my favorite games of all time. Alongside the beautifully stylized pixel art, FEZ has a large world full of mysteries and puzzles to explore. The exploration is one of the best parts of the game, in my opinion. Every time I thought I had seen every area in the world, I discovered a new room with some mysterious artifact or puzzle.  FEZ is a very calming experience that requires a lot of thought to figure out it's deviously mind-bending puzzles. It's a wonderful, wonderful game, and you should check it out if you haven't already.",
            "review_score": "1"
        },
        {
            "review_text": "WHAT DO THE NUMBERS MEAN, GOMEZ?  This game. What can I say about this game....  It can go from 'Yay! I solved a puzzle!' to 'OH MY DEAR GOD WHY?!? WHAT HAVE I DONE TO DESERVE THIS MENTAL TORTURE?!' in the span of five seconds. You are Gomez, and you have discovered the third dimension. Now you have to find bits of the giant cube that opened your tiny, pixelated eyes and put it back together again. This game has puzzles, codes, an alien language to decipher, and much more. Now stop reading this and go get Fez.     The Quick Brown Fox Jumps Over The Lazy Dog   ",
            "review_score": "1"
        },
        {
            "review_text": "lovely soundtrack and graphics. nostalgic",
            "review_score": "1"
        },
        {
            "review_text": "If Stanley Kubrick had made a game it would have been Fez.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely recommend this game to everyone. This is a 2.5D platformer that kept a smile on my face throughout my whole playthrough. It's really trippy in a good way that should be fun if you try it out.",
            "review_score": "1"
        },
        {
            "review_text": "This game enriched my life in a way that defies words. Please make more games; the world needs stuff like this.",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous game, definitely recommend.  This game, in my opinion, looks absolutely stunning for a pixelated platformer. Not only that, but it has a calming soundtrack that you can enjoy while playing. The unique mechanic works in many ways, like turning the area to a 90 degree angle to reveal hidden doors, or jump to other platforms you couldn't get to in another perspective of the level.  Generally, I love this game and I recommend it to anyone who is looking for 2D with 3D pixelated platformers.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "i just want hes Fez thats all",
            "review_score": "1"
        },
        {
            "review_text": "FANTASTIC visuals,music,gameplay, all amazing 10/10",
            "review_score": "1"
        },
        {
            "review_text": "... best soundtrack and best visual presentation, you have to try FEZ!",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is one of my favorite 8-bit platformers, the music and graphics is beyond what i expected before i first got it.   Im giving FEZ a 78, that is really good",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant puzzles, many secrets, and an unfolding universe! It's awesome, and the soundtrack is great, and the attention to detail is so carefull,   especially with the first person view halfway through the game  . 9.7/10, cutscenes lag the  hell  out of my computer!",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly awesome. Challenging spot-on gameplay, amusing story and dialog, fantastic soundtrack. If you like 8bit/retro platformers and chiptunes, I think you'll be right at home. Slap on some silly back-story ala classic Working Designs localization and off you go!",
            "review_score": "1"
        },
        {
            "review_text": "such and extrodinairy concept. The world is incredibly full and the play on a mythical third dimension is expressed in a very clever way... in the begining that is. This game is definitely worth several plays or a single full 100% playthrough. Im not sure if it is worth the price tag, to some degree I would say yes... but I purchased it on sale... so there was no question I whether or not I should buy it.  I definitely recommend this game to anyone who enjoys engaging puzzles and multi-dimensional platforming(different from 3d platforming.)   Last thing, The secrets are sooo awesome to find... it is basically like figuring out a combination lock.",
            "review_score": "1"
        },
        {
            "review_text": "A very relaxing and serene game.   Good for a late night after work to unwind and get lost for a few hours.  A lot of atmospheric pixel art, which might not be your thing but it's pretty aesthetic none-the-less.  Recommend to play with the lights off and with an gamepad.",
            "review_score": "1"
        },
        {
            "review_text": "One thing you may not know about Fez is that it has a LOT of puzzles. Most of them are very outside-of-the-box. Example: One time I had to use a QR code scanner to find a hidden collectible. I also keep a notebook and pencil ready when I play to solve some of the deeper mysteries. My experience with Fez has been very rejuvenating and satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "It's a double edged sword. I highly recommend if you enjoy your platform games. It's cute, it's clever and allows all the freedom for you to just explore and get on with your adventure. Simple and provides plenty of jumping goodness. With it's instant checkpoint system, failing a jump isn't a crux which keeps the flow of moving continious.  However, i don't recommend if you hate cryptic bulls**t. This game notoriously has puzzles, although all are completely optional (you can complete the main game without worrying about it) which are incredibly vague. This game uses it's own language for you to decipher, binary to understand and even real-time clock puzzles to work out which will basically end up forcing you to go online instead to figure it out. I don't mind clever puzzles, but something that requires skill or logic puzzles. Puzzles which require to completely stop all momemtum, sit down, man the hell up and start reading and writing is the point that you think, 'F**k it'.   So, recommend for a platform fan, hard to recommend for completionists.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, I love this character. I want a fez.",
            "review_score": "1"
        },
        {
            "review_text": "2 dimension games are awesome, even more amazing about this game is being able to change what dimension you see. This game makes you think, but is also laid back and fun. It is definitely one of my all time favorite games.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing puzzle game! Main purpose is finding all the blocks and anti-blocks by a combination of classical 'jump &amp; run' combined with quite a few puzzles (some of which are pretty myst style I dare say ;)).  However, do yourself a favor: don't cheat to resolve the puzzles. It is way more rewarding if you figure out the solution. Every puzzle can be solved by clues found in the game. I suggest preparing paper &amp; pencil for deciphering some of the inscriptions. And don't be frustrated, to solve all puzzles you will _have_ to play the game twice (you won't loose puzzle progress after finishing the first time).  If you are really stuck, run a quick search on game exchange, they often given pointers to the solution without directly telling you.",
            "review_score": "1"
        },
        {
            "review_text": "If you like puzzles, and if you like mindbenders (ala portal) then this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "A great platformer with interesting gameplay. A must for anyone who can afford it.",
            "review_score": "1"
        },
        {
            "review_text": "This game BLOWS YOUR MIND. All you need is the first few minutes of gameplay and you will be hooked unless you have no sense for awesome game concepts. If you've ever played monument valley then this will be farmiliar to you, sort of. I highly reccomend this game to everyone. One of the best games out there and encompasses everything great about gaming.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is one of my favorites. Although I agree with other reviewers that the gameplay falls off a bit toward the end I still enjoyed the overall feel. The pixel graphics are really great and what would seem like just another 2D platformer turns into an innovative puzzle with the addition of perspective changes. The controls are easy to use and with a story that takes place over a web of locations you aren't forced to travel in a set path. Add to that the excellent ound design and Disasterpeace soundtrack, and you've got a rather nice game!",
            "review_score": "1"
        },
        {
            "review_text": "Really cool puzzle game which is mostly self explaining. Most puzzles have a setup that makes them solvable without looking it up which is an important point for me. There are also some longterm code breaking puzzles which will test your brain (I looked up some hints, not very patient^^) Not to forget that it looks amazing!",
            "review_score": "1"
        },
        {
            "review_text": "it's intrest and very unique gameplay makes me wish i didn't have other things to do tonight or i'd still be playing. It's a great puzzle platformer game that i'd recommend to anyone that like either genre.",
            "review_score": "1"
        },
        {
            "review_text": "I hate phil fish so much that i'm playing a torrented version of this game. and i seed it daily. please people, torrent it, don't give this ♥♥♥♥ your money. he's literally worse than hitler.",
            "review_score": "1"
        },
        {
            "review_text": "The only game where I had to take notes.",
            "review_score": "1"
        },
        {
            "review_text": "was gonna speedrun, but couldnt be bothered finished 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Fez is probably the best single player game I have played in a long time. It encourages you to explore the beautiful world it provides, without making it an annoying task. The puzzle difficulty ranges from incredibly easy to incredibly hard with some of the hardest requiring you to have already beaten the game. The game looks beautiful and has good controls that allow you to maneuveur each stage however you see fit. The game is famous for its 2d 3d mechanic and it is executed flawlessly. No stage has any noticable problems or glitches and every zone has its own unique atmosphere and style. Although one can play Fez and collect 32 cubes and say they are finished, I highly recommend completing the game fully, 32 cubes, 32 anti cubes, 3 heart pieces. It really makes the game so much more enjoyable and satisfying.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome concept. This game reminds me of monument valley, it has an awesome concept and colourful inviting graphics. The gameplay can get a bit tedious at points. Would give it a go if you have the money to spend. But I think there are more enjoyable indie games at the same price point, with more repeatability. Not looking at you Binding of Isaac: Rebirth.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Amazing art Good soundtrack Novel setting for a platformer  Cons: Boring puzzles Clues for puzzles must be found elsewhere Unrewarding and repetitive gameplay Little to none story  I got this game at 80% sale. The graphics alone was worth the price, therefore I recommend it.  This game gave me a feeling similar to that I had when I first played Minecraft. I explored the brand new world, collected shiny bits and enjoyed beautiful sights. If you are looking for some relaxing indie game, this one fills the role perfectly.  However this game has little to offer besides the beautiful world. The puzzles are either too simple or requires clues that must be found elsewhere. Without cool puzzles adding spice, gameplay is just traversing back and forth between stages hunting for bits.  What frustrated me most was totally obscure clues. Most of the time they feel like easter eggs rather than an integrated part of the game. They add some depth to the game but I honestly cannot appreciate the result. I will not comment in detail to avoid spoilers.  All in all, FEZ is a good platformer for its price. Don't expect much fun out of it though, and absolutely stay away if you are looking for mind blowing puzzles, as there is none.",
            "review_score": "1"
        },
        {
            "review_text": "Epic indie game, it's on sale pick it up nao!",
            "review_score": "1"
        },
        {
            "review_text": "it's good",
            "review_score": "1"
        },
        {
            "review_text": "Some of the puzzles were a little tedious but the gameworld inspired a spirit of intrigue. Artstyle and music were very immersive for a retro looking game. Controller is a must however.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing. Cool art style, animations, and most of all, the gimick. Its all so creative and fun! Maybe one of the best games on steam!",
            "review_score": "1"
        },
        {
            "review_text": "Too many secrets!",
            "review_score": "1"
        },
        {
            "review_text": "Bay this game.If you like pazzle platformer.This game is art.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is brilliant. It is 2d with rotational world to make it 3d- so what. Well with this you can bend reality, what is oneplace by itself with a quick key press can be conected to something else. At the start i was mearly fluking it. Randomly switching views as i jumped about, until i saw the twisted logic in it, jump onto one thing nowhere near where you want to go then switching view a couple of times and voila your there- its not that easy though. There is no pacific order you have to do it in though there is a broad general order. Only problem is it can get monotomous. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "So Phil Fish got angry at the internet and we lost out on Fez 2. Sad times :(",
            "review_score": "1"
        },
        {
            "review_text": "So I think Fez is the first game that I've 100% completed and gotten all the achievements for, which is funny because this game is actually impossible to solve unless you are some kind of a genius or you have access to the internet. However, the difficulty meant that the puzzles I did solve myself made me feel very smart. The main character wears a Fez, which is incentive enough to play this game, because nothing is cooler than a Fez. I loved discovering all the new places in this funny little world and just enjoing the music and art. My dad looked over my shoulder at one point and called it a 'daft game'. Whatever dad, I like it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game, not great and the map's a little confusing, but fun.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is a great game. I am really loving it because of the mechanics. I have never seen anything like it before.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favourite games of all time. Amazing style, good music, challanging puzzles and an interesting world you just want to keep exploring.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun, but extremely tiring after the endgame when I tried to 100% it.  Apparently, the creator is a jerk.",
            "review_score": "1"
        },
        {
            "review_text": "I've got Fez on  GOG.com , Steam and XBOX Live, and I don't regret it. A solid platformer with great heart.  Brilliant music, sound controls and gameplay and tantalizing puzzles.  VERY VERY highly recommended (although from what I've seen in the indie game movie, Phil Fish is a ******)  Seriously, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a beautiful game, excellent design, awesome story, an amazing game mechanic, and my favorite game soundtrack ever, but unfortunately it was developed by the giant block of ♥♥♥♥ cheese that we all know and hate: Phil Fish. A damn shame.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game, I just wish they would have followed through with a sequel",
            "review_score": "1"
        },
        {
            "review_text": "One of the original Indie titles, simple yet enjoyable, unbeatable without a walkthrough.  Thank Valve for the Steam Overlay.",
            "review_score": "1"
        },
        {
            "review_text": "This game achieves what it's set out to do: create a soothing environment for the player, while also posing a challenge with clever puzzles. It is a unique concept brilliantly executed through both stellar visuals and audio. Some think the game is boring or the puzzles take too long. If the game were more exciting, it would not achieve its goal. If the puzzles were quicker, the game would be too short. It's already short enough as it is, so the cheaper price tag is reasonable; you're getting what you paid for, so I don't see that as a reason to bring down its rating. This game is not for everyone, but I really can't find anything to complain about, to be honest. I'm going to have to give this a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I bought it on xbox360 and finished it. Now I bought steam version again to assist the developer no matter where he is.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is a game that had me smiling far more than I was expecting. Its protagonist is adorable, its environments are gorgeous, and its soundtrack is astounding. It feels like a real game- a real world to explore- a haven, of sorts. It's beautiful and rewarding.  If you like a break from the action, this game is a mix of Pokemon games and Proteus- a rare and wonderful experience. The only downside? The main character's movements are super slow.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is a pretty alright game if you can manage to get it to work. You play as a tiny naked man and you go around all over the place collecting anti-cubes and uncle cubes and robbing people's houses. There's also a lot of spinning involved. It's pretty fun for a couple of hours and then you spend the rest of the game decyphering cryptic alphabets and looking for secret messages in the background of the game.",
            "review_score": "1"
        },
        {
            "review_text": "I liked this game a lot, the multiple 2D perspective for puzzle solving is one of the most innovative things I've ever seen in gaming.  I wasn't able to finish though, because I myself am a compeltionist. I want to check every corner and make sure I don't miss anything, but thats not really possible in this game. Whenever I clear a room there will be multiple doors and each of those doors will lead to more doors and by the time I'm done following doors I'm caught in this huge network of levels. So when the game comes and says 'You have 16 blocks! go back to the block room to unlock a new door!' I spend almost an hour trying to find my way back to that room before I have to check a guide to get back. Any time that I need to stop a game and google for help is terrible for the flow of said game, but I think this might just be a personal issue I have and shoudn't reflect the quality of the game.  The game itself is wonderful and I'd recommend it to anyone just to have them experiance the unique perspective of FEZ. ",
            "review_score": "1"
        },
        {
            "review_text": "This is an OK little game. It has some neat puzzles and I can honestly say I havent figured all of them out yet. But I have completed the main story, I think, since it ends kind of ambiguously. Gameplay is focused on traversing a 3D world one 2 dimensional plane at a time. The visuals are beautiful at times and the music is relaxing. Those are its strengths. Its weakness is I don't desire to go back and play it now that I have beaten the main story, even though there are more puzzles. Its just not my kind of game, so you could say I stepped out of my comfort zone on this game. I would give it 7/10. I would recommend it because it makes you think deeply.",
            "review_score": "1"
        },
        {
            "review_text": "This game is ABSOLUTELY AMAZING! The puzzle solving is very interesting, and the core gameplay mechanic (perspective changing) works very well. There are a few parts where you just can't figure out what to do (*cough*owl puzzle*cough*), but once you figure one thing out, everything else just fits.   TRANSLATION SPOILERS:    Pfft, it's more fun when you do it yourself! :)     11/10 Highly reccomend  P.S. Ignore my time played stat, I played most of the game offline. It took me 30 hrs and 24 mins to full clear (209.4%) the game.",
            "review_score": "1"
        },
        {
            "review_text": "Makes you think about how to figure it out, its like a huge puzzle, getting more complex and complex as you go. Get this game.",
            "review_score": "1"
        },
        {
            "review_text": "A small loan of a million dollars to mess up your brain! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "A game to relax with good music. If you get this game, get it with the soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Basically if you think it's gonna be fun, it will be. Not much else needs to be said. It's worth finding all 64 cubes just for the sense of satisfaction. Perhaps a bit to cryptic at times, but it IS a puzzle-platformer. It's worth your time if you like these types of games.",
            "review_score": "1"
        },
        {
            "review_text": "So I think Fez is the first game that I've 100% completed and gotten all the achievements for, which is funny because this game is actually impossible to solve unless you are some kind of a genius or you have access to the internet. However, the difficulty meant that the puzzles I did solve myself made me feel very smart. The main character wears a Fez, which is incentive enough to play this game, because nothing is cooler than a Fez. I loved discovering all the new places in this funny little world and just enjoing the music and art. My dad looked over my shoulder at one point and called it a 'daft game'. Whatever dad, I like it.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is one of the few games that has made me think to actuallly be able to beat the game. The puzzles are fantastic, and in my opinon feel very rewarding. Which is unlike any other puzzle game Ive played so far. I really hope Phil Fish decides comes back, and make a sequel. I highly reccomend this to anyone who likes puzzling games.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is one of the few games that has made me think to actuallly be able to beat the game. The puzzles are fantastic, and in my opinon feel very rewarding. Which is unlike any other puzzle game Ive played so far. I really hope Phil Fish decides comes back, and make a sequel. I highly reccomend this to anyone who likes puzzling games.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, loved every aspect of it.",
            "review_score": "1"
        },
        {
            "review_text": "Believe the hype.",
            "review_score": "1"
        },
        {
            "review_text": "worth the money its priced at now; its a very heavily-puzzle-based game that has its most rewarding secrets hidden behind some truly complex cyphers",
            "review_score": "1"
        },
        {
            "review_text": "Creative puzzle platformer with great soundtrack. Fez deserves the 10+ hours of a puzzle-solver's time.  On a two-dimensional screen, rotate the world to access the third dimension, which gives access to more parts of the level. Great concept and it is implemented well. The game demands more skill in puzzle-solving than in platforming. It's not meant to be 100% completed in one playthrough; in New Game+, the player gets an ability to find more clues to solving the puzzles.  The puzzles constitute most of the game, and although it's possible to get lucky in solving them, the solutions definitely have strong reasoning behind them. The mechanics and clues behind the puzzles are among the most creative that I have seen.",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully made and with one of the most interesting game mechanics I've seen to date. With a soothing soundtrack, a variety of different levels to explore, and a seemingly-limitless amount of puzzles to complete, FEZ is an instant favorite.",
            "review_score": "1"
        },
        {
            "review_text": "Same review as on the Good Game app: There can never be enough clever, charming puzzle-games in my opinion. I adore the nostalgic 8-bit graphics, the beautiful level design, the crazy story. But beware, should you want to solve and collect everything there is! Some puzzles are so hard, you'll only be able to solve them, if you're a professional cryptologist.",
            "review_score": "1"
        },
        {
            "review_text": "This game is wonderful. That is all.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game with a suprisingly huge world map and an abundanc of puzzles and hidden codes to solve. Consistently keeps a relaxed feeling and the colors + music gives an atmosphere that's fresh and alive. It has a personality that's reminicent but also new and it's own entity. My only major peeve is that some of the puzzles are QR codes which can be annoying if you don't have a smart phone.",
            "review_score": "1"
        },
        {
            "review_text": "loads of fun...and it's pleasing to look at...",
            "review_score": "1"
        },
        {
            "review_text": "I cheated and used a guide for this entire game. No regrets. However, I don't know how to play this game after playing it. Took a nice screenshot that would be great for use as a wallpaper though so great game!",
            "review_score": "1"
        },
        {
            "review_text": "I do enjoy a good puzzle/platformer now and again, and FEZ is very unique in its gameplay. This game is a collect-athon type game like Banjo Kazooie or Mario 64, but it is far more difficult than either. Many of the puzzles are cryptic and involve knowledge of mechanics you have to learn in the world itself. No character ever tells you how to solve a certain kind of puzzle, that's something you have to figure out yourself using common knowledge and little details from the game. This game kept me busy for a long time, and I enjoyed it every step of the way. If you enjoy surreal worlds, puzzles, and want to stay busy with a game for a while, I'd say pick up FEZ and at least try to beat it. All I can say to the completionists is you're gonna have to do some deep digging to solve all the puzzles.  9/10, a bizarre game with an interesting world",
            "review_score": "1"
        },
        {
            "review_text": "This game is easily worth $90, you gosh darned ingrates.",
            "review_score": "1"
        },
        {
            "review_text": "Fez is a good Indie Game. Definitley pick it up when on sale.                 the sequel should be  fez 2: power of perspective",
            "review_score": "1"
        },
        {
            "review_text": "Awsome if you're a fan of platformers then you will love this game",
            "review_score": "1"
        },
        {
            "review_text": "This is at the top of my favorite games list. I love the graphics, the design, how things move and change based all on something so simple as perspective in 2D. It's beautiful, the music is lovely to listen to and there are more than a few things that make you go 'WHAT?'.",
            "review_score": "1"
        },
        {
            "review_text": "Great platformer!",
            "review_score": "1"
        },
        {
            "review_text": "When I actually got it to start,it was really nice.Nice pixel art nice soundtrack and all this stuff.8/10 +cuteness lvl over 9000",
            "review_score": "1"
        },
        {
            "review_text": "I had a video game hangover after this one. BUY IT BUT IT BUT IT!!!! The puzzles are incredible. It'll have you thinking in a whole new way. It's like thinking with portals....but not.....BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "THis game is really cool! I love the flattening of 3d to 2d. It really is a great mechanic and keeps you thinking :)",
            "review_score": "1"
        },
        {
            "review_text": "ive had this game since it came out on steam and still not completed it but thats not even a bad thing  i just come back to this game every once in a while to play it and its always amazing",
            "review_score": "1"
        },
        {
            "review_text": "This isn't really a game at all, but instead a pastime, like knitting. I recommend pirating this game for free. ",
            "review_score": "1"
        },
        {
            "review_text": "Ok, what can i say about this game!!! some years has passed since i played this game for the first time... i was allways into game of last generation with the best graphics and so... this one, was one of the fisrt indie games i ever played and it took my breath away... the art is beautiful, the story makes you think, re think and re think... solve puzzles, find out alphabets and numeric symbols... its the game for people that like to get into the story and get thrilled by the outcome of the story... Now y tell you, one of the things that cought me was the music, relaxing, soft, really nice 8 bit music!!! Do i recomend this game? of course i do!!!",
            "review_score": "1"
        },
        {
            "review_text": "A staggering feat of programming and an absolutely awe-inspiring and utterly original and unique game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a legit side scroler....i mean were do u get (exept this game) a side scroler wher u have more than one perspective to see your area from .its like a 3D game in a 2D game!!!!!!!i like it.u should too",
            "review_score": "1"
        },
        {
            "review_text": "is rly good, visually interesting, good platforming gameplay, mostly smooth experience. some puzzles are really hard and require help unless you're a genius, but I didn't mind that.  Great game, highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game exceeds my expectations. Never expected this game to be so fun. Would recommend whoever that plays this to use a controller instead of the keyboard.   I would give it a 12/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautifully done. The mechanics, the style, and the drive to gain knowledge. At times it was simple, and at times it was very complex. I really enjoyed every second I put into this game. 9/10 would recommend to a friend.",
            "review_score": "1"
        },
        {
            "review_text": "FEZ is an amazing Indie game. The visual design in this game is spectacular. If you enjoy a challenging platformer experince. FEZ is a game for you!",
            "review_score": "1"
        },
        {
            "review_text": "It breaks the fourth wall. Amazing.",
            "review_score": "1"
        },
        {
            "review_text": "BEAUTIFUL!!!! Just play it!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fantasically fun. The atmosphere, especially the music, make it a wonderful experience that you can sink in to all day, and the platforming is unique enough to keep you interested.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my favorite games, and I wish I was better at puzzle games so that I could unlock all of its secrets.  Although this game is best played with a controller (as most of my hours are actually on console rather than PC), but I just had to be able to carry this game around with me to play whenever I start to miss it. The soundtrack is wonderful, the game mechanic of learning how to deal with another dimension is a blast to learn, and the story of the game seemed pretty funny to me. If you like puzzle platformer games, then FEZ is a must.",
            "review_score": "1"
        },
        {
            "review_text": "Ignore the dev and just play this incredible game",
            "review_score": "1"
        },
        {
            "review_text": "11/10 would buy a second time",
            "review_score": "1"
        },
        {
            "review_text": "love the story and intricate details in the levels!",
            "review_score": "1"
        },
        {
            "review_text": "Really cute game and the puzzles can range from easy to challenging.",
            "review_score": "1"
        },
        {
            "review_text": "This game is visually appealing in a strange and nostalgic way. The puzzles can be frustrating but mind blowing when you finally solve them. I actually had this game sitting in my library for quite sometime and once I started the game, I couldn't stop and finished everything in 3 days.  Definitely give this a try!",
            "review_score": "1"
        },
        {
            "review_text": "I would highly recommend this game IF -You are a completionist -You are ok with an unsatisfactory ending -You are into wierd dimensional platformer puzzlers  If you don't meet all 3 I wouldn't really recommend it too much.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing platformer - puzzle game with such a sweet characters. Definetly recomend:)",
            "review_score": "1"
        },
        {
            "review_text": "The game's atmosphere and puzzles are amazing!   Very interesting to play.",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "Plays Fez, Looks around,  'I've been living in a 3D world this entire time! No way!'",
            "review_score": "1"
        },
        {
            "review_text": "A very intresting idea, mixing 2D with 3D elements. Absolutely unique!",
            "review_score": "1"
        },
        {
            "review_text": "Try doing it without guides ( yeah as if )",
            "review_score": "1"
        },
        {
            "review_text": "absolutely amazing game with cool mechanics 10/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, if you like puzzles and platforms games then you will like this one to, also lovely music and really relaxing to play. Played it 3 times and it didn't bore me one moment. As I said before i played it 3 times so don't think it's a 17 hours game, it takes you more the first time you play, it took me around 10 hours, second and third time takes you less, it depends if you enjoy it or if you rush it just because you already played it, it took me 7 hours second time. (Played it on steam twice 10+7=17). 10/10 Favorite game",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, if you like puzzles and platforms games then you will like this one to, also lovely music and really relaxing to play. Played it 3 times and it didn't bore me one moment. As I said before i played it 3 times so don't think it's a 17 hours game, it takes you more the first time you play, it took me around 10 hours, second and third time takes you less, it depends if you enjoy it or if you rush it just because you already played it, it took me 7 hours second time. (Played it on steam twice 10+7=17). 10/10 Favorite game",
            "review_score": "1"
        },
        {
            "review_text": "Dang, this is hard. So good, but seriously hard.  If you are into cryptography and love serious challenges, get this. While I was able to figure out enough to 'beat the game' i.e. get to the credit sequence, I know for a fact that never in my life will I be able to 100% this game. I heard somewhere a great comparison: 'The hard puzzles in Portal 2 are real thinkers. You will sit back in your chair and think, 'how is this possible?', but 10 minutes later you will have solved the puzzle and be moving on. The hard puzzles in Fez take 10 hours and a doctrate in mathematics.' That wasn't the exact quote, but it gives you the idea. The hard puzzles are hard as hell. Throughout the game there are two 'languages' tha you will encounter that you have to break to continue. The first is fairly simple (I got it after only about 4 hours of fiddling around) and the other is just insane. Maybe I am missing somthing, but wow.  Gameplay itself is fantastic. Super unique concept, being a 2D person in a 3D world, and it takes a bit to really wrap your mind aroud it. The map you have is also quite challenging to understand at first, but trust me you can get the hang of it.  Tons of really intriguing puzzles all in one box. Some easy, some borderline impossible. Smooth gameplay, excellent concept.  Solid A+ game. Took me about 7 hours to get to the credit sequence (but completing probably half the puzzles, total).",
            "review_score": "1"
        },
        {
            "review_text": "Unique and fun game. Very big game for the price. Some puzzles required extensive effort and time so I looked up the answers so I could move forward with more casual game play. I don't feel that doing so detracted from my enjoyment of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Self indulgent and underrealized.  Fez is dominated by a main puzzle mechanic that is never used to any real effect, frustrating platforming physics, almost no variation in mechanics, and 'decode the background' puzzles. In addition, it makes frequent use of artless metagame effects (e.g. fake crashes) that are clearly supposed to affect the player but in reality the only emotion they evoke is impatience.  The central gimmick of the game is that you interact with a 2D plane, but the world is 3D and can be rotated. By switching the world around, you can change the apparent location of objects and move between them even if they're at wildly different depths. Nearly every actual use of this mechanic will be fully explored by the time you finish the tutorial. Nearly all the rest of the game makes use of the same two or three tricks.  World locations have their own additional mechanic layered on top of the basic platforming, but none are more complex than basic key/door puzzles. You might have to carry a block to a switch, carry a bomb to a cracked wall, or raise a platform into position, but never will you have to engage in any real thought or foresight about your actions.  Further frustrating the samey gameplay are the core platforming actions you'll be engaging in for the entire game. Your character is slow and heavy. Changing direction is a chore and it takes ages to traverse platforms. The climbing and mantling animations are even slower, giving you plenty of time to reflect on exactly how long it takes for your inputs to be realized into actual events.  And then there are the optional anticube puzzles. And thank God they're optional. I found two that required me to scan a QR code. I do not own a smart phone. Another needed me to feel the vibrations in my controller and copy the left/right pattern as world rotations. I can't imagine what I would've done if weren't using an Xbox controller. Probably give up and go somewhere else. Plenty of other apparent puzzles had no immediate means of interaction, and on my save they are still unsolved. I have little desire to go back and try them again.  As a fan of indie games, I hate Fez for being everything people think of when they say 'Ugh, indie games.' Thanks for living up to the stereotype, Phil Fish.",
            "review_score": "-1"
        },
        {
            "review_text": "Fez is secretly two games.  One of those games is a mediocre puzzle-platformer, where you rotate your view to 'move' platforms around and do a couple other gimmicky things with the ability. In particular, getting around the map is a complete chore, even with the assorted teleporters floating around.  The other game is a series of obscure hidden riddles, one of which was so fiendish the community had to solve it by brute force rather than by 'solving' the puzzle. Like many collections of riddles, it is completely and utterly trivialised by modern conveniences like Wikis and GameFAQs. The solutions are typically controller codes you punch in to receive your prize.  Neither game I think is very good.",
            "review_score": "-1"
        },
        {
            "review_text": "I heard a lot of hype about this game, but unfortunately, it's not for me. I just get bored quickly and find it difficult to enjoy. The level rotation is a cool gimmick for the first 10 minutes but after that the game feels very repetetive.  The pixel art's nice though :P",
            "review_score": "-1"
        },
        {
            "review_text": "This looks like a really cool game, but I'm having so much trouble actually getting it to work. Anyone looking to buy it should read up on all the PC support problems first, otherwise you're in for a lot of frustration. Clearly wasn't ready for PC...",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game. Creator is an ♥♥♥. Wish I would not have purchased it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game sucks Don't support Phil Fish -1000000000/10",
            "review_score": "-1"
        },
        {
            "review_text": "dont buy it due to the maker, dont support him",
            "review_score": "-1"
        },
        {
            "review_text": "This is a tricky game for me to rate. I'm somewhere between Yes and No on is.  One one hand the concept of these changing perspectives is great and allows for some amazing puzzles.  But on the other hand the game is very frustrating. Relying on code alphabets, tetris code, being in the right place during the right ingame time and an great deal of backtracking through a maze that's very hard to navigate.  Unless you enjoy pointless busyword in translating the messages, know what tetris code is and willing to dig up other obsure puzzle solutions OR willing to make frequent trips to help sites then Fez is most likey going to frustrate you to no end after the early 30%.  In my book this is a flawed gem. It could have (and at times IS) amazing but wastes it's potential with too much unenjoyable 'work' to progress.",
            "review_score": "-1"
        },
        {
            "review_text": "Created by one of the worst people in the games industry today. Phil fish, a self aware one hit wonder, who constantly whines about the industry while ♥♥♥♥♥♥♥♥ on other people  The game itself is certainly not terrible, even if it's just a fairly unoriginal faux-retro indie platformer, but it's not worth your time or money.",
            "review_score": "-1"
        },
        {
            "review_text": "the maker of this game is a pure idiot and criminal dont buy this game it gets boring fast and not worth a price of free",
            "review_score": "-1"
        },
        {
            "review_text": "Despite this game having some unique gameplay mechanics that I have never seen before in a video game, I can't recommend FEZ for one simple reason: The developer. For those of you who don't know, Phil Fish, the creator of this game, has said some controversial and horrific things towards the gaming community. I won't go into any details here since you can always look at other user reviews for this game and also can find out what exactly he said online. Simply put, I can't believe I spent money on a game from a developer who is f**king evil! What the hell was I thinking?   Game Rating: 7/10  Devloper Rating: 0/10  If you end up buying this game, you're supporting someone who is a complete @$$. My advice: Don't do it.",
            "review_score": "-1"
        },
        {
            "review_text": "don't buy this game. boycott phil fish and any product he makes. he thinks people owe him money for putting of videos of fez on youtube.",
            "review_score": "-1"
        },
        {
            "review_text": "  Originally posted by  Phil Fish :",
            "review_score": "-1"
        },
        {
            "review_text": "Jesus tapdancing motherloving Christ this game is bad, i have never been so close to dying from a sever case of the borings in my life, why call your self a platforming game if you jumps barely see what you are jumping upon? I managed to beat the first level but my frustration and shouting caused a series of unfortunate events to occur, first my child awoke from my pained exhaultations and began to follow my activity with it's own personal twist of replacing my rage and frenzy into emotions and fear and discontent. Upon this child's screams laying gently upon my wife's morphine laced ears, she realised the situation involved a possible chance of me throwing the Liquid Crystal Display based viewing monitor carefully connected my my hard drive by the large greasy man from PC world who helped set up my computer when my previous failures caused two things, one, my wife's black eye, and two, me having to pay the gentleman to keep quiet and to return wo his home planet of Personal Computers without any mention of his experiences in our dimensional plane. Upon picking up the child she began calling the police in the fear that she would be subject to what i can only describe as a Beltbuckle whirlwind, I couldnt stop her as i usually could because I was too busy trying to figure out if what i was playing was a game or just a poor excue to exploit a gimmick that ends up just confusing the player and not providing anything new to a genre that was once a bastion of difficulty adn challenge, but with the addition of little to no enemies feztakes this genre into a direction that seemed good but was infact a step into uncle bubba's basement full of mystical wonders and restraining equipment.The police arrived promptly given my previous offenses and found the fifteen ankle bracelets that they had assigned to me all lying on the floor in a pattern that spelled out the words 'i fought the law and the law won'. The irony was not lost on me. I am writing this review from prison during my precious few minutes i am allowed on the rec room's computer time sheet. This is all just to pass time of course becausei can expect that my inmate (known only as big jim and i can tell you he is only 5'9 so the operative word 'big' must refer to either his hands or feet, or at least a hope so). The tragedy of this situation is that he wasn't planning on having his way with me until i mentioned that i preferred platformers that utilise enemy placement and difficulty and not just use silly gimmicks to trick people into thinking time and effort was put into a game, but unfortunately big jim disagreed. Well thank you fez, for the impending traumatic experience, i hope you realise just how pathetic you are, at least in my last moments of anal virginity i retain a shred of self respect which is not particularly easy for an abusive husband/father.",
            "review_score": "-1"
        },
        {
            "review_text": "The engine is cute. But that's all.",
            "review_score": "-1"
        },
        {
            "review_text": "Brilliant world design and graphics. Soundtrack is also really good. But that's it really.  I really tried to like this game but I managed to stand it 2 hours and I'll give up, because the game is just not fun.  The whole game is about collect cubes... and more cubes... oh can't reach, switch dimension... collect more cubes.... zzz...  The dialogs are poor and the story is almost nonexisting.  The game seems to have 'borrowed' lots of elements from Super Paper Mario like the void which is expanding and puzzle like level design to be solved by switching dimensions... It would be unfair to compare FEZ to Super Paper Mario as there is a quite reasonable budget difference (although the world design and graphics are really professional)  But the fact that the only thing which you do is collecting those darn cubes without any combat makes the game terribly repetitive.  So if you're expecting a good platformer game don't buy this game However if you're into exploration games and don't have any expectations for a good story or good dialogs then this is your game.  This game could have been much better...... what a shame",
            "review_score": "-1"
        },
        {
            "review_text": "I dont like it.. It's just plainly no fun for me",
            "review_score": "-1"
        },
        {
            "review_text": "F*ck Phil Fish.",
            "review_score": "-1"
        },
        {
            "review_text": "Contrary to popular belief, this game sucks. It's pretty, but it's boring and un-engaging.",
            "review_score": "-1"
        },
        {
            "review_text": "What looks like a quirky and unique plat former turns out to be a pretentious over reaching puzzle game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is break, not run in Mac OS X and Ubuntu",
            "review_score": "-1"
        },
        {
            "review_text": "Fez is beautiful to look at and the premise of the game had us all hyped. Overhyped. I badly wanted to enjoy Fez, believing that it would inspire developers in the future to think more creatively with their mechanics designs. Instead, I found the core gameplay, the entire appeal of the game, to be highly disappointing.   After the first couple hours of gameplay, you soon realize that all the puzzles are copies of each other arranged slightly differently and generally boils down to the player rotating the camera 378629 times (this along with the bright colour palette left me feeling sick after a while) until seeing the solution rather than solving thinking exercises.   The konami and QR codes had absolutely nothing to add to the gameplay and didn't even loosely tie into the story. Personally, I just found those 'puzzles' a hindrance. The game gives little to no hints of how to solve puzzles and often become arbitrary because of this. However, puzzles are linked to each other which means that there is a A LOT of backtracking. (Did I mention that there's no fast travel?) With the leisurely pace Gomez (you) keep throughout the game, this is not a game for the impatient.",
            "review_score": "-1"
        },
        {
            "review_text": "Game mechanics are very interesting, but Phil, the game itself is mediocre, I expected more. Music is poor and anoying, and the game gets boring after an hour.",
            "review_score": "-1"
        },
        {
            "review_text": "does not work on the first go if this happens to you resart it then it shud work if you find it intretsing but i find it terrblie  note:i'm a bad writer/typer binding of isaac is good if you dont have you shuld ave it it's realy good",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the idea of it, and the puzzles, however the confusing map and ways to get around it kept me very frustrated.",
            "review_score": "-1"
        },
        {
            "review_text": "I was excited to download fez. but when I launched it and it crashes immedately after.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow this game was just a big disappointment! No idea why it got these high ratings! I expected a nice puzzle game which uses the 2D-3D mechanics for great puzzles. Instead the 2D-3D mechanic is stupidly easy and the corresponding puzzles are boring after 5 minutes into the game. There seem to be other puzzles in this game as well, some kind of meta puzzles where hidden messages are encoded in the background and stuff like that... these puzzles seem to be just weird unsolvable stuff.  If you want to buy a nice puzzle game with original puzzles, a nice graphic, and so on i recommend Nihilumbra.",
            "review_score": "-1"
        },
        {
            "review_text": "r.i.p phil fish he is swimming with the fishes",
            "review_score": "-1"
        },
        {
            "review_text": "you crashed that wedding. nobody invited you. nobody wanted you there. you little ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "It's an ok platformer. Interesting concept. It messes up the graphics of my desktop while running. I've only touched it once. Never again.",
            "review_score": "-1"
        },
        {
            "review_text": "Game has a gamebreaking glitch that randomly occurs a few minutes into the game. Like what the hell?",
            "review_score": "-1"
        },
        {
            "review_text": "Nice original idea but fell flat after a few levels due to repetitiveness.",
            "review_score": "-1"
        },
        {
            "review_text": "While I wanted to like it and it was fun at parts, it was just too slow.  The animations seemed to just drag on and take much longer than they needed to. It was annoying at the begining and it quickly grew to the point where I couldn't tolerate it.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, I would pass on this one. The art and music is REALLY good. The game mechanic is REALLY good. Obviously alot of love went into this title. Problem I found is that it was difficult to play with a controller from the couch. And this is weird since it was made to be that kind of game. The main difficulty with playing from the couch was that reading text was nearly impossible (I won't spoil, but at some point deciphering code becomes a big part of the game). Speaking of those sorts of puzzles - alot of the puzzles were quite difficult and actually felt cumbersome.   I felt that there was too much packed into this game. It would have benefitted from being a bit simpler. This is not an easy decision, but I would pass.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so laggy it's unplayable. The only place there isn't an outrageous amount of lag is the starting room. It might be worth playing if the lag is ever fixed, but I doubt that will happen any time soon.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't give Phil fish money.",
            "review_score": "-1"
        },
        {
            "review_text": "Mediocre game, it's not bad but not worth buying.",
            "review_score": "-1"
        },
        {
            "review_text": "The mechanic is interesting enough, but it gets old fast.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is has an interesting but gimmicky core mechanic, that could have been utilized much better. I tried to give it a chance, but gave up after the first couple of hours. Apart from having a nice art style and some cool and fitting music, it's lackluster. The puzzles are tedious and unrewarding, the story is pretty lame as far as I got. It's just boring; the controls are floaty, and the dev is a complete asshat for saying that PCs are not for gaming. Also, you can see that this is a crappy PC port: the default resolution is 720p but can be changed, BUT (and this is a big but) YOU GET A LETTERBOXED 720p GAME SURROUNDED BY BLACK. WHAT THE ♥♥♥♥ DEVS? These guys are so lazy and quick to make more money on a PC port that they basically locked the game to run at a filthy peasant-like 720p.  Do not buy this game. I have no clue how this mediocre, half finished money-grab port gets a 91/100 on Metacritic. I would give it a 30/100 max.",
            "review_score": "-1"
        },
        {
            "review_text": "i h8 phil fish he sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "I choked on it",
            "review_score": "-1"
        },
        {
            "review_text": "No trading cards? Choke on it Phil Fish. Slow, boring gameplay, with a brilliant rotating mechanic and a beautiful world that doesn't get utilized to it's full potential.",
            "review_score": "-1"
        },
        {
            "review_text": "Empty game, no fun at all, no gameplay, just the task of mechanically rotate all the screen to catch all the cube. Repeat that the next screen. And again. And again.... Really anoying task.",
            "review_score": "-1"
        },
        {
            "review_text": "look on youtube for AlphaOmegaSin's rent about Phil Fish. Do i need to say more?",
            "review_score": "-1"
        },
        {
            "review_text": "Mostly fun game.  There are two idiotic 'puzzles' which require you to play at a specific time on a 24-hour and a 48-hour timer, respectively. For me, these times were (as i calculated them) in the middle of the night. Yes, you can change your system time. You'll need to quit and restart the game, then wait for the level reveal animation and climb back to the top of the level after each time, then do it again if you were slightly off. In other words, I didn't finish the game.",
            "review_score": "-1"
        },
        {
            "review_text": "didn't hold my interest.",
            "review_score": "-1"
        },
        {
            "review_text": " 1/10",
            "review_score": "-1"
        },
        {
            "review_text": "The game really want's to be Cave Story, yet can't come close to it.",
            "review_score": "-1"
        },
        {
            "review_text": "didnt play it that much but i heard the guy who made it is a ♥♥♥♥ :/ so i guess i dont recommend it cuz it never rlly grabbed my attention",
            "review_score": "-1"
        },
        {
            "review_text": "This game has lag that for some computers is uncontrolable  Unless they come out with an update to fix this do not get it!  I use a high quality gaming computer and I give this game a 3/10  ",
            "review_score": "-1"
        },
        {
            "review_text": "i have the cu",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't pay for it. I got it from the Humble Indie Bundle and I appropriated my money so that none went to Phil Fish.  Suck my ♥♥♥♥. Choke on it.",
            "review_score": "-1"
        },
        {
            "review_text": "i hate this game. i cant complete it. when i finish the 32 cube part. it crashes f*** this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Wow, this game was really over-hyped.  Neat as a tech demo, but really sort of crappy for a platform game. Cave story is much better, and has a lot less overhead.  1/10  Gamplay can be done by any kid with a 2D engine like construct 2.",
            "review_score": "-1"
        },
        {
            "review_text": "The game started exiting, but quickly turned into tedious screen turning looking for one cube I missed.",
            "review_score": "-1"
        },
        {
            "review_text": "This game looks like so much fun but it would be fun IF I COULD PLAY IT 3FPS PLS STOP",
            "review_score": "-1"
        },
        {
            "review_text": "FEZ is a game which clearly has had a huge amount of time spent on the vast number of levels (each obviously carefully crafted), the perfectly judged tone (both surface and deeper), and apparently the deeper challenges.  I say apparently in that last clause because, despite this effort, the core platforming gameplay just isn't 'fun' enough to support all the running around and backtracking you apparently need to do to actually explore the deeper levels of the game. After 3 hours of platforming around, I'm just not having enough fun getting from place to place (and there's lots of places to get to) for me to put up with that necessary input in order to access the deeper levels.   Sad to say, FEZ is a game where the primary mechanic lets down all of the things hanging off of it.",
            "review_score": "-1"
        },
        {
            "review_text": "i like it but it crashed it was in a creepy way this cube broke and my computer changed colors",
            "review_score": "-1"
        },
        {
            "review_text": "I just couldn't get into this game. To be fair I didn't give it a huge effort. I was more laissez faire in my attempt at playing it rather than forcing myself through the initial map however if a game doesn't draw me in and i'm bored after 10 minutes of the mechancis I'll usually end it there.. The concept was interesting but it wasn't for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly, I just couldn't get into this game. Most media has boasted that this was one of the best games of 2013 which led me to buy it against my good judgement. I'm not normally into these 'new-age retro styled' games, but again, I decided to give it a shot. It has a really cool mechanic, 3d in a 2d world... at first I was blown away by it, but I quickly lost interest. Much of the game became collect these things, jump from this place to the next. No real substance and it key selling point rides so much on the 3d flipping mechanic that the rest falls so flat. It's too bad, creative, but not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Something about this game burns my sides. I feel like theres something fishy about it.",
            "review_score": "-1"
        },
        {
            "review_text": "Buggy as Hell.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't recommend this game because paying for it is giving cash to Phil Fish.  The game is fun though. :)",
            "review_score": "-1"
        },
        {
            "review_text": "This game is for masochists, but you can't tell that right away. Oh no, it entices you with its cute graphics and adorable fez-sporting hero, Gomez, who lives in a 2D world which suddenly opens up to him when a whole new third dimension is revealed. He goes on to explore it and solve various puzzles along the way.  Some of the puzzles are easy, but the further you progress, the more difficult they get, and honestly, some of them are simply unfair in that they are nearly impossible to solve using normal methods - some were only solved by gamers via brute-forcing (or knowing the answer in advance and trying to find a solution that resulted in it). This is not acceptable for me in a puzzle game and only serves to frustrate and anger... and waste a ton of time. Unsolvable puzzles scream bad design to me. Moreover, there are a few QR codes that you have to scan throughout the game, giving you easy answers to otherwise much more complicated puzzles... unless, of course, you cannot scan them, which was what happened in my case - my phone simply refused to recognise them (perhaps the contrast was too low, as QR codes are meant to be black and white, not light purple and slightly darker purple).   As such, I can only recommend this game to people who enjoy the dissatisfaction of NOT winning the game entirely through their own efforts. While the price (especially when on sale) is very reasonable, it's just too painful a gaming experience - I expected enjoyment when I bought it and got rather less of it than I hoped for!",
            "review_score": "-1"
        },
        {
            "review_text": "I just couldn't get into this game. To be fair I didn't give it a huge effort. I was more laissez faire in my attempt at playing it rather than forcing myself through the initial map however if a game doesn't draw me in and i'm bored after 10 minutes of the mechancis I'll usually end it there.. The concept was interesting but it wasn't for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Very boring, I played 10 minutes then gave up and uninstalled it. The adverts make it look playable but the truth is most flash games are better.",
            "review_score": "-1"
        },
        {
            "review_text": "The game mechanic is interesting. Unfortunately there's no real gameplay whatsoever.",
            "review_score": "-1"
        },
        {
            "review_text": "FEZ: 'WtF is a computer'",
            "review_score": "-1"
        },
        {
            "review_text": "I didn't play this the longest, but it wasn't for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty looking, impressively polished, but dull.  Worth loading up once to see the cool visual gimmick.",
            "review_score": "-1"
        },
        {
            "review_text": "Only get it on sale, and only for the 'easy' puzzles (yellow cubes) which require what you'd expect: navigate an area while spinning between perspectives, making things line up in interesting ways. You can get the 'easy' ending playing only these.  The other half of the game (blue cubes) is Myst-style puzzles so tedious and obtuse that it's a question of whether you get 25% of them vs. 75%, depending on how much effort you put in. No one gets them all. More importantly  there are no room names , so when you try a puzzle for an appropriate amount of time and want to move on -- too bad. There's no way to look up an answer for just that puzzle. You either read a full-spoiler guide, or quit the game. And do you really want to do puzzles that involve transcribing glyphs from 3 made-up alphabets, scanning QR codes with a smartphone, and keeping it all written down to cross-reference later? Is that what anyone thinks Fez is going to be about when they buy it?  Worst of all: backtracking. A lot of areas look just like others, and some have 8 doors which look like all the other doors. And no room names! Good luck remembering how you got from there to here, never mind finding your way back later. It gets old really fast.",
            "review_score": "-1"
        },
        {
            "review_text": "I wouldn't call Fez' perspective shifting a gimmick as it is a decently well thought out mechanic IMO. Unfortunately what frustrated me most about this game is that it's effectively a platformer with lots of slow backtracking necessary to figure out a few unintuitive puzzles. I never felt like I was progressing in any way other than slowly gaining arbitrary cubes. If I'm expected to wander through a 2d world (slowly), then I want to feel confident that I am better armed to figure out the significance of a seemingly empty room. In Metroid games you get new powers that are the keys to previously unsolvable puzzles. In this game the keys to any puzzle you can't figure out might just be to tediously study the pixel art in a level across the game world. Alternatively you can look up the answer on youtube and feel cheated that the game expected x level of attention for a 'casual platformer'. It's a cool game to try and a boring game to try to finish.",
            "review_score": "-1"
        }
    ]
}