{
    "app_id": 224740,
    "name": "Clockwork Empires",
    "release_date": "2016-10-26",
    "developer": [
        "Gaslamp Games, Inc."
    ],
    "publisher": [
        "Gaslamp Games, Inc."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Indie",
        "Simulation",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Simulation",
        "Lovecraftian"
    ],
    "achievements": 46,
    "positive_ratings": 348,
    "negative_ratings": 426,
    "price": 22.99,
    "description": "Take on the role of a Colonial Bureaucrat sent forth by the Clockwork Empire to build a Frontier Colony. Design houses &amp; workshops to feed the Ravenous Maw of Industry, manage a uniquely unruly population, avoid cannibalism &amp; monsters, and make Important Decisions for the glory of the Empire!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/224740/header.jpg?t=1477517969",
    "minimum_requirements": "OS: Windows 7, Operating System of The Lower Classes Processor: Intel i5 Processor or Equivalent (&quot;The Little Scrapper&quot; model) Memory: 4 GB RAM Graphics: NVIDIA or AMD card capable of supporting OpenGL 3.2 Core or Above. INTEL HD3000 AND HD4000 GRAPHICS CARDS ARE NOT SUPPORTED. DirectX: Version 9.0 Storage: 4 GB available space Sound Card: Lord Palmerstoke's Sound-Reproducing &quot;Old-Timey&quot; Wax Cylinder Driver Additional Notes: INTEL HD3000 AND HD4000 GRAPHICS CARDS ARE NOT SUPPORTED. The Ministry for Video Game Drivers would like to remind you: true Patriots of the Empire always install their latest Graphics Card Drivers before Enjoying A Bracing Video Game, lest the Blackness Consume Us All.",
    "recommended_requirements": "OS: Windows 7, 64-Bit Version (By Appointment to Her Majesty) Processor: Intel i7 or above, fashioned of Stout Empire Tin and Burnished of Solid Pewter Memory: 8 GB RAM Graphics: A Big, Shiny NVIDIA or AMD Graphics Card With Lots of Fans Stuck to It. (Remember: More Fans Means More Steampunk!) DirectX: Version 9.0 Network: Broadband Internet connection Storage: 8 GB available space Sound Card: &quot;His Masters' Voice&quot; Novorusian All-Wailing Gramaphone Module and Borscht Dispensary Additional Notes: The Ministry for Growth and Monitoring encourages you to buy a Really Big Monitor.",
    "reviews": [
        {
            "review_text": "UPDATED POST RELEASE: Significant improvement to game overall. Hardly any bugs remaining and the game is functioning as I would have expected. Of course this is not the end of CE. There is still much more content to come! Really pleased with Devs. --------------------------------------------------------------------------------------------------------------------------------------------- UPDATED REV 42E: The Devs have been focusing on bug fixing and mainly changes within the User Interface and Farming area of the game. The U.I has had an overhaul in terms of the character selection menu and information panels. They tell you more about each character, their mood, emotion and progress towards desires. Each character's current effects now show bars as to how it affects their mood within these panels.  The Farming and Kitchen has been addressed in a sense that instead of mass lists of recipes, the vast majority of standard food you can find, gain from hunting and farming has been condensed into a simple 'Make food' job where the colonists will use any standard type of food they can find. I much prefer this because it is at the end of the day what you order anyway, all food you can.  Militarily, the barracks function and NCO has been fixed so they now properly train into Regular troops from militia.   Overall, not a bad update at all however as I have previously stated, the game is very much playable and more of the game 'content' in that regard, new items, clothing etc, should be coming in the near future because it would seem most systems are now functioning as intended and have been fixed.  -------------------------------------------------------------------------------------------------------------------------------------------------- UPDATED REV 41D: Constantly changing and evolving, CE is more stable than ever. So many changes in the latest builds from REV 38. The majority of issues have been addressed to the state that you can pretty much play for however long you like. Once you start getting larger populations however you may still encounter the odd bug or issue. On that note the Devs are reaching what I call the last loose ends. Fixing the remaining issues that people encounter and adding in the systems left.  The UI has been updated massively and there are various new systems in place such as the events which are now much more refined. There is a starting property ownership system in place which is going to be built on to eventually include owning clothing, various objects and so on. The workshops have been overhauled and recently just added in is the new Military Barracks which replaces the old system of training. You assign a Military Officer or Militia NCO to the Barracks and he/she will start to train troops into Regulars.   The favour system has also been recently amended. For example you can now recieve a prisoner work group which will assist your colony doing various tasks for 3 days. Many now have a time frame. The squad of Regulars led by an NCO also assist for 3 days (or is it 5?) for example.  All in all a lot has changed to list, including minor changes but the game has made substancial progress certainly.  --------------------------------------------------------------------------------------------------------------------------------------------------  UPDATED REV38 : So much has changed since my last update. This is now Clockwork Empires in the Official stable gameplay stage now. You can play without any major issues, no crashes or that. They have added removal of buildings, planning changes, new User Interface elements and refined Combat mechanisms and A.I for colonists and elements alike. If you were following this previously, then now is a pretty good time to join in the fun and development of Clockwork Empires.  The team is constanly updating it, each update bringing much better features and now that all the bug bashing has really been done, it is content that is being brought in. Cults have been revamped, basic diplomacy is now functioning with minor factions like bandits and so on bringing all sorts of events that your decisions can affect your colony and how long it survives. Far too much to list but the future of CE is very bright indeed!   UPDATED: REV33: By far the best update that has been implemented. Now with complete re-designed mechanics and Graphics, the game runs certainly, much smoother and MAC support is now in the works with basic features working. The game has came a long way from the past 2 builds and with new features such as bandits, new animals, refined combat and economics and UI the game is definitely coming together. Again I would still be waiting a couple more before buying but in terms of my level of 'playablility', that stage has almost been reached.   ------------------------------------------------------------------------------------------------------------------------ Original Review:  While this is Early Access.......very very early. I have to say that this game has huge potential. The developers are keen and very open and the game itself is the perfect management game for those who loved traditional city builder games crossed with a bit more things to do such as combat, defence etc.  It is based during the Colonial-Early Industrial period and already the developers have nice features set out. The game itself does have a sense of humor thrown in and the like such as having to fight off Fish people and all sorts of creatures. In future they plan to add bandits and all manners of factions and allow you to ally, trade and conduct diplomacy for your newly starting colony. There is also a map set out what looks like it will be a sort of campaign style base in which you choose where you would like to set out your next adventure for the Empire and start to form new colonies.  The artstyle in my view fits perfectly along with the current mechanics which are currently implemented it really does look and function well. If you play it you will see just exactly what this game could offer in the near future and even now.  The game is one of a kind and unique in so many ways. If you don't mind investing in such games then by all means take it into account but if you want a finished product then you will have to wait. I would say another month or so and this game will get better and better......hopefully :) It really is up to yourself but I can say this certainly. If you decide to invest your money in this EA game.  You will not loose out. The Devs are like PA Devs in that sense but even better. They are constanly interacting with community to fix things, release experimental build updates pretty much from 2 days-1 week. Really are making significant progress and fast.  EDIT: And I was correct when i said a month or 2. Saves are practically on the table with loading now as are basic defences. Many fixes and performance improvements to allow smooth running of the game and ruled out majority of crashes. Now they can finally give it a few weeks, start working on the games mechanics and content more rather than bug fixing. For now anyway :D  ---------------------------------------------------------------------------------------------------------------------------------------  On that note: The team plan to adopt a monthly update schedule which will release major build updates to the public. If you would like to assist in testing or just mess around with it early then they have an opt in 'experimental branch' which as it suggests is 'experimental' but enough to keep you playing. I can see the team relating to Prison Architect in that sense as they always keep the community interested and up to date and these guys are constantly fixing and addressing issues with their game so very active :D  As I am constanly testing the Experimental builds which are updated regularly with new things to check out and suggest, I will be updating this throughout each build, or when I can :)",
            "review_score": "1"
        },
        {
            "review_text": "THIS REVIEW IS REALLY LONG. TLDR: I recommend it. The thematic: In my last game, a colonist framed a fishperson for the murder of an occult inspector from the mainland.  I was nurturing some of my colonists with a bit of an eldritch bent. A handful of beetles now and again seemed a small price to pay for religious freedom! One of those stodgy old occult investigators was sent from the Parentland to root out any nefarious activity. Ugh. Between you and me, and I’ll deny it if anyone else asks, but I told Zora Bronzehewer it might be best if the investigator had a little… accident. Those mainlanders can be so clumsy pulsing dark daggers. So Zora goes out to deal with this investigator, and stabs him a good one, and he flees  right into a fishpeson . Now, I’ve got to give him due credit – even injured by dark energies and knowing he had no chance, that investigator did his duty by queen and country and flame-roasted that fishperson on the spot. His finally report (written on the fly, while likely bleeding out), forgot to mention Zora’s dagger. Officially, the investigator had died in line of duty, bravely protecting us from the dreaded sea horror. Unofficially, well, if anyone else saw Zora walking away from the two bodies, they were smart enough not to bring it up.  The Good: * Gameplay is rich, and satisfying. You feel accomplished when you look at some sprawling colony you created. * Details detail details details: EVERY colonist has a set of hopes and dreams and goals and memories. They affect the way that person moves in the world, including the people they interact with and how productive they work. For someone else, they may get a kick out of making sure they don’t make a drunkard run the public house. For me, I’ll put her there just to see what happens. The best part about the details is that they influence the game but they aren’t game-breaking. Micromanagement at the individua level isn’t necessary, but it’s there if you’re into it. * Graphics. I dare you not to look at the animation of the little fox barking at a colonist and not zoom in to appreciate how cute it is. Or not to laugh the first time you see someone “dance with frantic joy” or walk somewhere while Maddened. The graphics only get better when [REDACTED]. (But, ok, the water looks really bad). * Lots of events and stuff to do. I can’t imagine someone getting bored of the options in game unless they’re already bored with other aspects.  * You can make your colony as ridiculous or as structured as you want. I’ve spelled out my name in buildings. I’ve also created uniform row housing that would make brutalists proud. * Colourblind mode. Thank you. * META: The devs of this game are very decent human beings. They’re aware of the “issues” in the genre and time period they’re working within, and they have constructed an experience that lambasts the silliest part of the Victorian era without celebrating the worst bits OR leaving them in there without comment for “accuracy” purposes. If it matters to you, Gaslamp are good people. * META: Devs are accessible and there are a lot of tools in game for bug-chasing, due to its time in early access. Speaking from Early access, I’ve had bugs I reported fixed within a few hours and pushed to a build.  The Bad: * The pacing can be slow. It’s a sim game, and your people all have stuff to do. Sometimes you’re stuck watching your people do their thing and waiting for more colonists to arrive / jobs to complete / etc. There’s a lot of satisfaction in seeing everyone scurry around at your whim, but it can get old if you just want them to finish building cots or whatever. * The hows and whys of flattening terrain are strange. I still haven’t figured them out.  * Overwhelming. There can be a lot to take in at once, and you need a few games to comfortable with all the options. This is especially early in the game when you don’t necessarily have the necessary workshops and people set up to do anything about it (like foreign offices or vicars). It’s kinda fun in its own way, but there can be a lot on screen at once with you not really being able to deal with any of it.  Final Verdict:  It’s really fun and all of these detailed randomized people have the potential to create both a very rich colony simulator, and very strange stories (like Zora and the Investigator).  There’s lots of reviews that talk about the game not being “Finished”. It’s not, in the sense that there’s still a lot of room for growth and potential. But right now, the game is already well equipped to tell stories, and occupy you for hours. The stability is pretty good and it’s going to get better. (Heck, it’s already more stable than most AAA games are on launch, fallout 4, xcom 2, etc). If I had written this review 6 months ago, I wouldn’t have recommended it. I think it deserves to be out of Early Access now, as the game itself is complete. I know the devs will continue to add content (Look at their previous game – Dungeons of Dredmor, which had 3 expansion and free content updates throughout).  This is a fun game! You should buy it!",
            "review_score": "1"
        },
        {
            "review_text": "I was positively surprised when I went to my (regular ~3months) testing session for the newest updates and see that it got a proper release. And I have to say: It is nearly perfectly playable (1.0D experimental).   Pros: The tasks get worked, the provision and maintenance got a very good revamp. Every functionality and feature I read about the years seem to be implemented and I have encountered no bugs in my last session. The music makes a good work in putting one into a creepy mood to encounter great old ones. The feeling that everything just works, even if it takes some time is just great. Also the game mechanics in itself are realy well thought about.  Cons: One might think the game feels a bit slow. Everey task has to be considered if it is now a good time to do this or later. The game improved in communicating with the big Overseer (you) but could be improved also a bit. I still do not know where I get sand despite the random(?) lucky appearance of 2 in my stock. In later games one might hope for some graphic options which might improve the feeling of smoothnes in the game.  What does it mean? For every lover of settling and passive building strategy games: it is now time to try it out. Me thinks if your PC is not older than 3 years than the smoothnes should be no problem. I do hope though that we get some middle big updates just to improve the general gameplayability in term of performance and feedback to the user.",
            "review_score": "1"
        },
        {
            "review_text": "Considering the reviews, I was a bit wary about purchasing this game. Im glad I did though as it is a well thought out basis. It does have bugs, but what game doesn't? Dev - I can confirm the issue regarding Rally points displaying Place plant, also when you rally they stand around and dont seem to attack until the rally is over and they can move freely again? A challenging economic sim, mixed with a bit of strategy aspects in a decent blend. I look forward to seeing where this game leads in the long term.",
            "review_score": "1"
        },
        {
            "review_text": "An enjoyable game which I have followed since its very first release on Steam early access. Great, active developers who are keen to continue their work. There is a lot of micromanagement - you are not going to be able to sit back and relax too often. However, if you really want to get hands on and in-depth with your colony, grab this.",
            "review_score": "1"
        },
        {
            "review_text": "I love games like this, going through my steam library I have a lot of games that I refer to as 'civ builders' I really enjoy them. This one was just released and offers a lot that many others do to but at the end of the day I really love the setting and there's so many little things that are unique. This one has quickly skyrocketed to the top of my favorites list.  It still has a few issues but the devs are the same guys who developed Dungeons of Dredmore which they updated and kept working on for more then a year afterwards adding little things and making it better. I'm really looking forward to seeing what comes of this game considering how great it already is. Thanks Gaslamp and keep up the great work!",
            "review_score": "1"
        },
        {
            "review_text": "There are a lot of Chinese players enjoy the game, why not release Chinese version of it, so that more Chinese players to buy and enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Gotto give this game credit for its originality above anything else.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game with great AI!",
            "review_score": "1"
        },
        {
            "review_text": "If I can describe the game in one sentence: If Banished/Gnomoria gameplay and Sunless Sea-esque lore got mashed together into an eldritch, steampunk city-builder game.  The Good: - Organic gameplay complemented with well-tied in lore.  -Unique and personalize colonists, each with traits, skills, and background history, memory of events that affect them in-game. -Fish people! Bandits! Obeliskians! Finally a settlement/city-builder game with a decent 'enemy' and combat system. The Bad: - Still no graphic or performance setting option (As of version 55A) - Still a few non-game breaking bugs. Gabion placement are glitchy, etc.  ***  It's been two years since I bought this game, and having revisit it this week, I've decided to write a new review to address the all new changes and fixes to the game. The game has improved vastly since 2014, in terms of both playability and stability. No more random crashes, thank the heavens, but there are still a few glitches with gabions. Other than the gabion issue, I have not experienced a crash in the 12 hour play session I logged last night. From what I seen the devs of CE stuck to their guns, addressing the myriad bugs in-game from before and were not afraid to overhaul game mechanism and the UI to optimize gameplay. That being said, some graphic or performance options would be appreciated, as this game does seem to have steep requirements.  For those who haven't purchase the game, Clockwork Empires in a nutshell is a steam-punk themed settlement management game. You're place in charge of a few Victorian-esque settlers in the middle of a strange, hostile wilderness blanketed in a fog-of-war. You start out with just a few barrels of sausages and a small stack of logs, the rest of the resources and food you need must be gathered from the local surrounding, then processed and combined in the multitude of workshops you have yet to build. Everything takes time (and attention from your diligent overseers and their subordinate labourers) to complete, whether its building construction or goods production.   Sharing the wilderness with you are bandits, hostile foreigners, man-eating fish people, giant beetles, and other unmentionables that won't shy from throwing a wrench into your colonial operation. The occasional demonic alien Obeliskian onslaughter is particularly effective in reducing a unprepared settlement into a charred pile of rubble and bodies. Within your own colonial population, you have to worry and guard against starvation, epidemic depression, cults, and unsuspecting axe-murderers. Needless to say, the game throws out plenty of challenges and random events to keep the player on his/her toes and provide some good laughs and WTF moments. Yet, there is no feeling of a grind, and once you get the hang of dealing with these base threats and obstacles, you'll find time to expand, consolidate, and enjoy your colonial gains.    CE has a redeeming quality and feel that I can only describe as organic. The day and night cycle is visually rendered in-game. Resources like forgeable plants and trees grow back slowly after being picked and chopped, and local fauna wander about the map foraging. Corpse slowly turn into skeleton and bones. Ominous lights and noises queues when things are about to get real. In CE your colonists are not just mindless sprites or peons - each one of them is an individual character with his or her own unique set of skills, personality, beliefs, likes, and fears. These traits are not just for show; most of them carry actual in-game consequences. Skills for your overseers affect how fast or well they produce goods in workshops, gather resources, or fight enemies if they assigned as militia. Skills level up for tasks that an overseer frequent does and there's also a Training Academy when they can take time off to school themselves and raise certain skills. Personality traits also affects how overseers and labourers work and respond to their surroundings. If a colonist has the trait 'Craven', you might want skip him or her on a spot in the militia. Your colonists also socialize and forge relations with each other, and again these social interactions and relations bare impact in-game. It's almost like Sims.  The game gives you the opportunity to view a profile of each colonist under your control, where you can view their status, activities and thoughts in detail. Your colonists have needs, and they can and do get tired, hungry, or moody. If you meet their needs, they would work more efficiently and cause less trouble for you. Some colonists have unique needs, but for the most part if you feed them well, give them booze and a bed, and make sure they/their friends don't get murdered on a daily basis, they'll stay happy and work diligently. If their needs are chronically unfulfilled, you would definitely see work slow down and the whole population domino into a melachonic state ripe for destruction by a bandit raid or pending disaster.  Even little individual things can come together have a huge impact on the day-to-day running of your colony. In one instance, I had one overseer devolve into a state of depression after losing a friend to a Obeliskian invasion. This particular overseer was the star cook in my colony's kitchen, churning out food for an entire colony of 50. After the incident, he stopped working and moped around town. Eventually, I was facing a food shortage. Adding labourers to his crew did nothing to address the slowdown in the kitchen. In the end I reassigned him as a cushy bartender, and had a less-talented overseer hold the fort for a while. After a few days, I reassigned the fella back into his old kitchen, and he back to cooking like his old self.    Random events come every several days to shake off monotony in the colony. These events range from a passing artist hoping to score a free meal or your miners having awoken a monster from the depths of the earth. Some of the more dire, dastardly events are linked to your 'Disturbance' level, an arbitrary counter which gauged how much your colony had disturbed the natural surroundings. Most often, the event simply signals the arrival or imminent arrival of hostile forces bent on your colony's destruction, other times its incidents that take a much odder or darker turn. You are often provided with choices of actions during these events.   CE also includes different factions in-game. Some of these factions, like bandits and fish people inhabit the map alongside you. Your interactions with these on-map mobs can be both hostile or non-hostile, with non-hostile options opening up a host of interesting benefits and consequences. There are also other foreign powers that show up occasionally to trade or invade. The diplomatic and warfare options available in-game are plentiful and varied; combined with the organic nature of gameplay, they keep things interesting. On more than one occasion my colony was saved from utter ruin from hostile attack by the timely arrival of a friendly trade partner's caravan, who's escorts handily lend their fire to my defences.   Things like this keep gameplay interesting and deviate from the usual monotony of micro-management in games of this genre. CE really has a way of immersing players into its lore and setting, which it brings alive with interesting and well thought-out game mechanics and options. While it had a rocky start (as with most alphas), I can now honestly say it's a game worth buying and playing. That being said, there's plenty of room for improvement, but most of these improvements center on technical aspects, such as the ability to change graphic options beyond screen resolution and a few bugs that still need ironing out. Given the amount of attention the devs have paid to player suggestions over two years of development, I'm confident that these issues would be resolved eventually.",
            "review_score": "1"
        },
        {
            "review_text": "Buyer beware, not worth the money. The state of this game will serve as proof that it's developers were likely more interested in profiting off this over-priced unfinished science project through release date hype rather than actually finishing the game.   I purchased this back when it was in early access and I regret it now. I will grant that this game has come a long way since my original purchase. It was unplayable when I first bought it, however, this game still crashes and it suffers from what I would consider to be a host of design and development flaws.   There seems to be no real focus on what they were trying to develop. The UI and control scheme is clunky and unplesant. The resource chain makes no sense. This game feels like the developers just wanted to try and develop a bunch of sim/management game features and this is the end result.  Every time I attempt to play this game my game essentially ends right around the time I need glass, because sand is virtually impossible to find and its pretty much essential for progressing into later stages of the game.   From material I have read from the people developing this game, they seem to be masking a disinterest in finishing this game behind the guise that 'this is how its supposed to be.' I have read blog posts about problems they seem to be aware are in the game (Including the sand thing) but years later those problems still exist in the game, further adding to my suspsion that this waste of money had no direction, and just benefited off the stupidity of people willing to pay for an unfinished early access game.   The idea of a lovecraftian horror element twisted into a simulation/management game sounds like a cool idea, unfortunately this is a terrible manifestation of it.   Shame on you developers for charging so much for this trash, I will be boycotting whatever garbage you continue to produce.",
            "review_score": "-1"
        },
        {
            "review_text": "I want to be able to recommend this - the initial idea was excellent, but the end product (at least out of early access, GLG do have a strong history of post-launch support with Dungeons of Dredmor, so I'll update this if things change) is pleasant enough, but lacking in depth. Just about everything has been done better elsewhere. You have no real motivation to give a particular damn about individual colonists.  If you're looking for a colony simulator where anything and everything can go wrong for all sorts of bizarre reasons, Rimworld is still a better choice here in my opinion, and has far superior moddability, workshop support, depth and sense of 'individuality' of your colonists. It's also only asking for $3 more than this.  Tentative 'yes' on sale, would not recommend at full price unless further patches add a lot more content.",
            "review_score": "-1"
        },
        {
            "review_text": "I read about Clockwork Empires oh so long ago in some PC games magazine on a flight to Las Vegas. The article interested me so much that I sought out the game and purchased it as an early access game.  I know early access is full of glitches so I waited and waited and waited and waited and waited for the CE to be declared complete. Wow was I disappointed when I opened the game up and saw that the same bugs, glitches, and EXTREME LAG were still present from the early access.  What have the devs been doing this entire time? The game is lags so much that it is unplayable.   As of now, I would NOT RECOMMEND this game. However, I still have hope that one day prior to the apocalypse Clockwork Empires will be playable.",
            "review_score": "-1"
        },
        {
            "review_text": "I love the concept, artwork and gameplay but the game is just too unstable and it grows worse as your colony grows.  If you can live with a crash every 2 hours (sometimes more), then by all means pcik it up.",
            "review_score": "-1"
        },
        {
            "review_text": "if it wouldn't be for the massivly accuring random crashes, itsw a good game.  and some endgamecontent couldn't hurt.",
            "review_score": "-1"
        },
        {
            "review_text": "For the price I'm going to say NO. Rather have my money back, but alas that was my own choice.",
            "review_score": "-1"
        },
        {
            "review_text": "I was so excited by this, but it's released and it's not a 1.0 game.",
            "review_score": "-1"
        }
    ]
}