{
    "app_id": 224700,
    "name": "The Game of Life",
    "release_date": "2013-06-10",
    "developer": [
        "Virtuos"
    ],
    "publisher": [
        "PopCap"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Strategy",
        "Casual"
    ],
    "tags": [
        "Strategy",
        "Casual",
        "Board Game"
    ],
    "achievements": 0,
    "positive_ratings": 23,
    "negative_ratings": 47,
    "price": 6.99,
    "description": "It’s Your Life – Where Do You Want to Go? Spin the wheel and choose your path – the possibilities are endless! Stay single or say “I do”. Retire rich or lose it all. Anything can happen in THE GAME OF LIFE! Choose your car and take a spin on the winding road of life. Play it safe with sensible choices like college, marriage and kids.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/224700/header.jpg?t=1447356958",
    "minimum_requirements": "OS:Windows XP SP3/Vista/7Processor:1.4+GHzMemory:2+ GB RAMGraphics:256+MBDirectX&reg;:9.0cHard Drive:1+ GB HD space",
    "recommended_requirements": "Graphics:512+MB",
    "reviews": [
        {
            "review_text": "420/10 IGN best game 4ever play it 24/7 NOW or you´ll nbot bee mlg pony noquikscoppicing m8! ",
            "review_score": "1"
        },
        {
            "review_text": "Classic board game. The AI does a nice job playing against you without resorting to cheating.",
            "review_score": "1"
        },
        {
            "review_text": "Nothing good at all, no multiplayer, boring singleplayer...ect",
            "review_score": "-1"
        },
        {
            "review_text": "Boring, boring, and boring... waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "its like the board game",
            "review_score": "-1"
        },
        {
            "review_text": "Ewh. I didn't like this game. I loved the first version on PC of this game but this version hurts. The board is oddly zoomed in for an even odder first person view. The portraits of the people look like they've just done a line and are ready to turn up some more. The interface at best is clunky. The main thing you see is the spinner: I get it. It's a big part of the game, but you don't see Monopoly as a huge close up of the dice. Makes no sense honestly. There's a party mode if you can pry some of your turned up friends to sit and mash on the keyboard with you. It's better to go play your real 'Life' as boring as it may be because I gurantee it's better than playing this game. 2/10",
            "review_score": "-1"
        }
    ]
}