{
    "app_id": 224820,
    "name": "Super House of Dead Ninjas",
    "release_date": "2013-02-18",
    "developer": [
        "Megadev"
    ],
    "publisher": [
        "Adult Swim Games"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Leaderboards",
        "Includes level editor"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Platformer",
        "Rogue-like"
    ],
    "achievements": 46,
    "positive_ratings": 1306,
    "negative_ratings": 56,
    "price": 4.99,
    "description": "Super House of Dead Ninjas is an action arcade game with roguelite elements. Race against a 30 second timer as you descend floor after foe-filled floor and attempt to unlock the secrets of this deadly tower!Play as the fearsome Crimson Ninja, wielding an arsenal of deadly ninja weapons and attacks.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/224820/header.jpg?t=1493659998",
    "minimum_requirements": "Memory:512 MB RAM Hard Drive:200 MB HD space",
    "recommended_requirements": "Memory:1024 MB RAM Hard Drive:200 MB HD space",
    "reviews": [
        {
            "review_text": "This Adult Swim gem is my favorite retro platformer!  The controls are super responsive. Brilliant, fast paced gameplay Loads of melee weapons, projectiles, bombs and suits to unlock.  The unlocks and achievements actually test your in game skill. Even if you fail, you will never get frustrated or bored playing this game.  If you absolutely love modern or retro platformers, YOU NEED TO BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun and fast pace platformer with a highly upgradeable weapon &amp; attack system. You gain access to more weapons and maneuvers opening up the game to new play-styles which ultimately adds to it's replay value. The acrobatic fighting mechanics are fun and will make you feel all ninja-like, which is always a plus in my book, 7.3 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on a whim while it was on sale and it is great!   The combination of tight control, cutsey retro pixel art, unlocks and the sarcastic sense of humor makes it a fun tromp for anyone who remembers the heyday of NinjaGaiden on the NES.  I hope they do some more games in this vien, maybe a gauntlet paradoy?",
            "review_score": "1"
        },
        {
            "review_text": "Pros: -Fast paced gameplay -Speedrun mode -Customizable suits -Somewhat cheap -Low space requirment -Funny quotes -A storyline (you wouldn't expect it from a game like this) -Unique powerups -Level editor -Steam workshop  Cons: -A somewhat steep learning curve -Level editor has only one possible music -Somewhat lame name  Wishlist for the game:  -Steam workshop for ninja suits  Overall score: 9.2/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Great action, lots of weapons, blood &amp; gibs, boss fights, difficulty is just right (not too easy, not impossibruu). What else is needed to say?",
            "review_score": "1"
        },
        {
            "review_text": "If you like fast-paced platforming action, I cannot recommend this game enough.  If you don't like fast-paced platforming action... what the hell is wrong with you?",
            "review_score": "1"
        },
        {
            "review_text": "I thought I was good at these kinds of games  It's not called Super House of Dead Ninjas for nothing",
            "review_score": "1"
        },
        {
            "review_text": "Very fast paced, kill everything in your path and collection the droped items platformer. Highly addictive, like cocaine, but in video game form.   Bought this game at the same time as a couple other AAA games which just went on sale...haven't played the other games and currently have 14 hours on this one.    Might need rehab? 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Imma sucker for platform games... and this game covers that bill perfectly...random levels? hell yea, fun gameplay? you better belive it and awesome weapons? hahaha gotta love the weapons... i would recomned this to any one who loves platforming and roguelike games :D",
            "review_score": "1"
        },
        {
            "review_text": "It is amazing how a simple flash game can have the best feel out of all the pIatformers I played, it is incredibly smooth and it just FEELS good to tear through floors going at light speed, stoping only to basically bully the bosses every once in a while.  It is definitely not for everyone, but if you like classic arcade games or simply going fast, then you'll probably like it.  If only the RNG wasn't so keen on destroying your runs then it'd be literally perfect.  (It's probably best to grab the DLC with it too because it contains a lot of cool stuff, including the best weapon in the game)",
            "review_score": "1"
        },
        {
            "review_text": "The controls are fluid, the combat feels awesome, the pogression is smooth, just everything about this game feels really good. If you like platformers or rouge lites, you should defintely buy this game. Just great.",
            "review_score": "1"
        },
        {
            "review_text": "Old school Arcade Heaven!  If you are into retro action/jump&amp;run games then this is a must buy for you!  Beautiful handdrawn graphics! Dozens of weapon unlocks! Cool Soundtrack!  makes a fast-paced arcade action (with a good controller).  Worth many hours of playing time, even if you never beat the endboss (like me so far). This game is 100% true in the tradition of a 16-bit arcade game.  A great game for the price of a fast-food meal!",
            "review_score": "1"
        },
        {
            "review_text": "Could've popped out of an arcade from an alternate dimension. Very cool.",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't even expecting much, bought it on a whim, it's cheap anyway. I was pleasantly surprised. Almost endless replayability, the tower you try to descend from top floor, except for the first short tutorial level, changes every playthrough and so do the bosses you encounter (except the final one). You unlock new gear and power-ups by doing achievements in-game, some power-ups are permanent, while others unlock the possibility to find them in game, while the gear, you unlock melee weapons, bombs, magic and throwing weapons. You can customize your gear before going to try to beat the tower and choose one for every category stated above, you may change your costume too and off you go. The gameplay itself is very frenetic, but satisfying, I personally don't like platformers very much because I tend to get angry with them after a while, but not this one, most of the time you're like 'ehh, that was my fault, I can regain that heart if I play carefully.' A nice little game overall, and the price is so cheap, you should better take it, the screenshots don't do it justice.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game!!! ive bin playing this game since 2014 &amp; i personally recomend this to any gamer whos into action type games.",
            "review_score": "1"
        },
        {
            "review_text": "This is easily one of the best platformers available at the moment on Steam (or any other platform, really). The gameplay is simple, but adictive and sometimes very challenging, the story is basicaly non-existent (which is cool, btw), the music awesome (and goes well with the game) and the graphics simply great :) I love the whole style, look and feel of the game and would recommend this game for everyone.  PS: it's on sale. Grab it O:)",
            "review_score": "1"
        },
        {
            "review_text": "Got a few dollars to spare and crave a simple 'pick-up-and-play' kind of game that will keep you entertained for a good while? This game is perfect for you then. It's a fairly basic game that feels amazingly executed and will keep you coming back for more and more as you get better.",
            "review_score": "1"
        },
        {
            "review_text": "Do you like Spelunky but think it crushes your soul too much? Then play this game. At least you'll make what looks like a lot of progress before eventually dying.  Basically picture this: Spelunky obstacle course run with inevitable death meets ZOMG speedrunning, action bliss. Throw in some unlockable weapons and items so you can change the way you plow through floors and spice it up with bosses at the end of each stretch and you got Super House of Dead Ninja.",
            "review_score": "1"
        },
        {
            "review_text": "The tower of a thousand deaths  After climbing down 350 floors of traps, monsters, and ninja ghosts, not to mention the extra levels seemingly without end, I've come to one conclusion: I should never become a ninja. Sure, I should have known that before I even started playing Super House of Dead Ninjas, but it's nice to have confirmation.  I've died a lot. Countless times, really. Not enough to earn the achievement 'Dedication,' which one gets for dying a whooping 1000 times, but that achievement should tell you that this is a game about living for mere minutes. Thankfully, those minutes are filled with blood-soaked joy, certainly enough so that dusting one's self off and starting again isn't too great a chore.     Super House of Dead Ninjas (PC) Developer: Megadev Publisher: Adult Swim Games Release: February 18, 2013 MSRP: $6.99  Nintai Ryoko, the super-charged ninja and title's protagonist, is a woman on a mission. Her goal: to travel to the bottom of a hellish tower, one apparently filled with treasures and the promise of glory. She doesn't want any of that, however; instead, she intends to discover what happened to the one ninja who succeeded before her, the one-armed ninja.   Getting to the bottom is easier said than done, what with it containing a myriad of horrors, from undead warriors, evil spirits, dragon guardians, and crazy monkeys, to traps ranging from floor and ceiling spikes to laser cannons. It's no easy task, but Nintai has a plethora of violent tools at her disposal.  She starts of with a basic katana, some shuriken, bombs, and one magic spell, but a vast array of unlockable weapons and tools can be earned for completing all sorts of challenges. Unlocks and upgrades can be picked up at a shop run by a sour old woman. She's dismissive and doesn't think you'll get very far. I didn't like her, and instead of seeking the fate of the one-armed ninja, I really just wanted to show that hag who the boss was. Her and the omnipresent voice that crops up from time to time judging my actions and mocking my many, many failures.  At the shop, you can see what needs to be done to unlock any of these items or upgrades, but most of them can really just be earned by playing the game without sparing them a thought. Finding out that I could use grenades or had a new pair of nunchucks that I could snatch after yet another death really softened the blow. Who doesn't like presents?  All the cool toys in the world won't make a difference without skill, however, and that's the area where I found myself rather lacking. Dead Ninjas is an insanely fast game, with Nintai being, more often than not, nothing but a blue (or whatever color her ninja robes are, there are several to unlock) streak, speeding across the screen. This speed is a necessity, too, as the game is on a timer, counting down to failure. Pick-ups can be discovered which add more time to the counter, but there's always the feeling that you're running low.  Haste inspires recklessness, unfortunately, and that lack of caution spells death. Nintai can sprint past some enemies, slicing and dicing as she goes along, but others have shields, require more than one hit, are covered in spikes, fling projectiles, teleport, or are exceptionally fast, and they require a split-second analysis before tackling -- there's no time for more. So speed becomes dangerous, despite being key.   At first, this led to an agonizing amount of frustration, as Nintai continually got turned into a red smear on the floor of this unwelcoming tower, but I was getting irritated by my own failings, not the design of the game. I got carried away by the delightful 16-bit violence and extreme pace, and would just run into confrontations without a second thought. Practice and experience made me a slightly better ninja. Make no mistake, however, I'm still terrible.   It's all about getting into a rhythm, and when you start to recognize enemies, it takes less than a second to recall the best way to slay them. Continually slaughtering the tower's residents in quick succession builds up Nintai's quickly diminishing rage meter, and when it's activated she becomes an unstoppable force of destruction. Those moments are the game's best, sprinting down the tower as an invincible, deadly whirlwind. And the more enemies you kill while in rage mode, the longer it lasts.   The floor layouts, enemy placements, and item locations are all randomly generated, making each new game after a death a fresh experience. Sure, it means that you won't be memorizing the levels, but it also means you won't have to play through the same section over and over again, which would certainly happen in a game this tricky.  Filling out the roster of ghastly enemies are a bunch of rather unfriendly bosses, and a very traditional bunch they are, too. They all come with special abilities, patterns that must be memorized (usually simple ones), and weaknesses that can be exploited. While challenging, most of them have a fairly small amount of health and can be dispatched quite quickly once you figure out how to deal with them.  I'm not the most patient of fellows, so I appreciated the fact that these villains didn't outstay their welcome. Die while fighting them, though, and you'll be sent back to the beginning of the section, a hundred floors above them.   Appropriately for a challenging game such as this, Super House of Dead Ninjas sends you into the fray with only minimal instruction. There is, however, a rather novel tutorial in the form of a comic, accessible from the main menu. Contained within are little tips and tricks that the main game doesn't really share with you, and one one occasion it even offered me the key to defeating a boss I'd been struggling with. It's well worth reading, and even rewards players with a new costume.  Super House of Dead Ninjas can be played for free on the Adult Swim website, but getting it on Steam nets you an upgraded version. The map editor and player-created dungeons offer up tools for you creative types and a bounty of new levels for those that can't get enough of the main game and its extra, transdimensional tower. It also comes with added items and unlockables, as well as an upgraded soundtrack. The latter is cracking, as well, containing some wonderful oriental-themed chiptunes.   This is one game that I know I'll be playing long after this review is finished with. The instant challenge and frantic pace makes it perfect to just pick up and play for 15 minutes, while the tight controls and potentially limitless number of floors makes it easy to pour hours into. If you're not convinced, then check out the free version and see if it floats your boat.  I do have one caveat, however. Whatever you do, don't play this with a keyboard. It's possible, but you'll just be giving yourself another unnecessary and fairly unpleasant challenge. Thankfully, Super House of Dead Ninjas comes with native controller support, and after a few initial hiccups, it seems to work perfectly now.    Super House of Dead Ninjas reviewed by Fraser Brown 9/10 SUPERB  A hallmark of excellence. It may have some flaws, but they are negligible to what is otherwise a supreme title.",
            "review_score": "1"
        },
        {
            "review_text": "A fast paced action platformer that plays very well and has a certain charm to it. There are a lot of unlockables so it has a good amount of replayability but on top of all that, it's just really fun to play. Plus, the developers have been really good with continuing to support the game with patching out bugs and glitches, so that's always cool. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Super House of Dead Ninjas is a fast-paced rogue-like platformer. The story is very minimal in this game. It’s an arcade game, the gameplay is the most essential. You're Crimson Ninja, a deadly assassin who wants to descend a 250-Floor Tower filled with all sorts of hostile monster in order to prove her honour. That's preety much it. There is a nice and very well drawn comic book in the game, but it won't explain anymore than what I just wrote in the previous sentence. Super House of Dead Ninjas combat system gives you a couple of options to fight with. You can use your main weapon, perform a dive attack, use a throwable consumable, use an explosive consumable (careful not to blow yourself up with it though) and use an ultimate powerful magic trick. You will feel like a fast and skilled ninja. Don’t get attacked too much, you only have a handful of health points.  Enemy variation is good but it could always use more. Killing the same enemies isn't boring and some will require a special trick. The feedback is good, enemies get dismembered in a psychotically beautiful way and the blood splatters like paint into a canvas. You even have a narrator similar to that of Quake who compliments you if you’re awesome and tells you off if you suck.  The bosses are a big meat of the game, get ready to rage a bit. They’re all very unique and require some strategy and skill to finish them off. Even though they’re hard, they’re fair but I do believe that Colossus is too hard. In order to dodge him, you have to jump over him while he charges at you. But even if a pixel of your character touches the Colossus then try not to throw your monitor or laptop out of the window. This boss is ridiculously hard!  The upgrades are where I have a couple of problems with the game. I like that you have to unlock the items in a specific challenging way instead of simply grinding for the items like in RPGs. When you upgrade your health, for example, you can't turn off the upgrade and we encounter another issue. The leaderboards are therefore unfair because it doesn't take into account the upgrades you used. In Serious Sam games, the score will be influenced by the difficulty you choose. For example, if you chose easy, your score won't have a multiplier counter as high as of that of a player that chose a harder difficulty. Also, during the levels you can't check the requirements of unlocking certain; you have to remember them by heart. Now, you think that using new and different items helps the gameplay be more dynamic than it is, but that isn't the case. I find myself using the boomerang and the nunchucks more than other equipment. Furthermore, the game doesn't have preset equipment choice.  On the technical level, the game looks like it was made in the 1990’s. The graphical style is pixilated and has so much charm for it. It even has effects to it to show your character’s momentum and speed. It runs preety well but it can tank when there is a lot of effects on the screen. Still though, this version of House of Dead Ninjas, is better coded and has more configuration options. The game has an in-built Steam Workshop, but honestly, the custom made levels are too short.  Regarding the expansion, if you think that the base game of Super House of Dead Ninjas wasn't enough for you then I recommend the True Ninja Pack. It’s worth it really for the price. You even get to play it with a new ninja with different stats.  In conclusion, the game is great! I think it would be better if it would be played on a mobile device. It’s a small game that should be played more than once and on the go. Still though, the game is worth it for sure and the price is fair! I recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Super House of Dead Ninjas is a well executed retro-styled precision platformer. The lightning fast combat and sensitive controls can seem a bit unwieldy at first, but they ultimately lead to a uniquely adrenaline-charged 'ninja' feel that only hurtling through the levels at a breakneck speed can create. There is a wealth of unlocks as well, the only problem being that after showering the player with new weapons and upgrades during the first few hours of gameplay they slow to a mere trickle. Add to that the unusual order in which upgrades unlock, and you have a recipe for potentially unsatisfying progression.",
            "review_score": "1"
        },
        {
            "review_text": "The most difficult 2D platformer I've ever played, I can't seem to stop coming back to it. It's addicting and never seems to get boring. Also, you can kill a giant talking Mantis using a katana and a bunch of hand grenades, so there's that.   10/10 Would get murdered by a monkey again",
            "review_score": "1"
        },
        {
            "review_text": "a great game that feels good instantly. solid controls, great music and art design all meet to make a really decent rogue like dungeon thingy. it has it's own character and humour and is pretty entertaining in general. lots of replay value due to weapon unlocks and so on...if you see this game for a couple of quid grab it, especially if you like RoR, Rogue Legacy, Nuclear Throne... :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a awesome sequel to House of Dead Ninjas, for cool ninja fans, i suggest you playing this game! It's about a ninja travelling a mortal tower full of monsters, traps, and others. This game is also pretty epic, i beated Normal mode and i have to finish Hard mode.   Story: 9/10 - The story is pretty epic, the characters, the towers, etc. Controls: 10/10 - The controls are pretty better. Nuff said. Graphics: 10/10 - The graphics are SNES-likely and they're better than the original first game, also the blood is perfect... Music: 10/10 - 2 words to describe this: VERY EPIC!! I love the music, and also, i like the boss music. Gameplay: 8/10 - The gameplay is very awesome, but i hate when it lags... Total: 4.7/5",
            "review_score": "1"
        },
        {
            "review_text": "this game rules. lots of murder and death. lead is a female. female needs bigger boobs. murder is fun. murder is intense. all hail the PCmaster race.",
            "review_score": "1"
        },
        {
            "review_text": "Tightest controls ever like dear god",
            "review_score": "1"
        },
        {
            "review_text": "Woah what it's like 9 oclock at night on a thursday and i forgot to eat and feed my pets and where is my family oh no they left.",
            "review_score": "1"
        },
        {
            "review_text": "I saw this and decided i dont want a no-skill button mash and left it.  I was of cource a moron.   This game is quck and hard. It take skill and speed but also peicience. If ur not sure, i highly recomend more research as it is amazing fun!   ",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Super House of Dead Ninjas is not a good game. It's not even a decent game. Passable? Maybe. But beneath it's addictive kill system, there isn't much to it. There's just so little variation in everything, and the weapons are horrifically unbalenced. Perhaps unexpectedly, I'm not bitter over it being a formerly free game. I think there's actually enough added to make it worth, if not the exact price, being put up for sale at all. But the additions are too little too late and don't help much. Plus, what's with the DLC? It's so cheap, and hits a weird balence between not adding much yet locking things you'd really think should be in the base game. When not on sale, Super House of Dead Ninjas is roughly 6.99 and the DLC is 2.99. Couldn't they be 9.99 and come together by default? Even if the DLC came later, it's a weird situation. I guess it doesn't make much of a difference, so whatever.  Having gotten it while it was really cheap, I can't complain too much. Hours not quite well spent, but spent doing something at least, and sure, I'll pay a few bucks to at least not be bored for awhile, until the creeping boredom of the game itself starts to set in. Otherwise, I can't reccomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "It's just awful, the hitboxs are messed up, enemies pass through attacks and it even has locked in game content that you only get by paying for an expansion that ads practically nothing nothing. it is actually just abysmal.",
            "review_score": "-1"
        },
        {
            "review_text": "not fast gameplay rely slow even the dlc speed run mode not as fun as advratised movments very stiff",
            "review_score": "-1"
        },
        {
            "review_text": "Addicting as ♥♥♥♥ and also pretty damn hard if you have no fingers like me. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced and very very addicting, 1.2 hours in and I'm addicted!",
            "review_score": "1"
        },
        {
            "review_text": "WRITTEN WHEN I PLAYED FOR AN HOUR  This game, is amazing...ly hard. Along with amazing, Super House of Dead Ninjas is a randomly genereated game where you are a ninja. A very fast ninja. Adult Swim packs alot of enemies and frustration into this cheap game. I really enjoy playing. You start at the top of a tower, and you go down each floor, hacking and slashing your way through the enemies as fast as you can. You only have 30 seconds maximum, BUT, you may get more time as you move along. SHODN may seem like a fast game, but not really. This game is easy to get used to, and is a great time killer.  LITERAL 10/10  *Credits to STAR_ for showing off this game on YouTube!*",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and addicting game. Fun to unlock different stuff through achievments. Various loadouts for different play styles.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing! I was expecting a typical [Adult Swim] game that would be more about the comedy than the actual game play, but I was so wrong! I have never played a game that did such a great job of balancing power and vulnerability until this one. It's super fast paced and yet very easy to keep up with. You truly feel like a ninja! It also has lots of unlockables and achievements that are difficult yet not impossible.  I highly reccomend this game for those who enjoy side scrolling games, fast paced games, or simply love crazy ninja action!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed this severely on  adultswim.com . Enjoy it even more here thanks to the sweet weapons and DLC. Worth it. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "very quick, very fast gameplay fun to just keep playing and playing if you get bored of slow and boring gameplay from other games this game will perk you back up with its easy to learn controls and fun to levels to play. 10/10 would do business with again.",
            "review_score": "1"
        },
        {
            "review_text": "Propably the most Fun that you can have with a jump and run style indie game (but you should own a gamepad)",
            "review_score": "1"
        },
        {
            "review_text": "Lovely platformer that mixes old school conventions with newer standards. On a sale this game (including dlc) goes for about two bucks, it's a steal. If you're getting it - a controller is highly recommended. Be warned, it's a pretty challenging game, but a fun one.  Closest comparison I can think of is 'Spelunky' in terms of being a rouge-like platformer. But Super House of Dead Ninjas is faster, harder and to me just a better game. It's simply fun unlocking stuff and the speed of gameplay you can reach is great. The difficulty can be unappealing to some, and the random elements of the game sometimes do feel unfair, but overall for me randomness is one of the reasons the game is so enjoyable and replayable.  This game also does retro right, with reminiscent sound effects, controls, enemies and just overall presentation. Those things that puke when you run under them from Ghost &amp; Goblins? Those tower enemies from Megaman 2? The axe throwing weapon from Castlevania games? All there. There is even a 'scanlines' TV filter.  As for the newer things, there's online leaderboards, a map editor and a number of 'self imposed challenges' such as a speedrun mode (with splits!), achievements and an endless mode for highscores.  It's not a perfect game, but for what it does it is polished and fun!",
            "review_score": "1"
        },
        {
            "review_text": "I would sneak this game into all the Happy Meals...",
            "review_score": "1"
        },
        {
            "review_text": "Probablo still one of my favorit games! Its so basic and stil so enjoyable! Probably cause the fast mechanics and pumping timer! I would highly recommend this with a controller though.",
            "review_score": "1"
        },
        {
            "review_text": "Addictive fun game great for speed running. Very simple game but very interesting.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great very fast paced very random many unloackbles if you like ninja games try this one out!",
            "review_score": "1"
        },
        {
            "review_text": "A fast paced action platformer that feels like something out of the NES or SNES days with modern embellishments.  You are rewarded for multiple plays thanks to the numerous unlockables that improve your repertoire of items and abilities.  Controls are smooth and fluid once you get used to the game's gravity/physics, and the fast pace of the gameplay almost reminded me of the old Stryder arcade game from back when.  Every so often as you make your way down the floors of the tower you bump into a boss battle, and it seems to be slightly randomized as to which boss you will fight at each of these levels. Just defeating a different boss usually unlocks a new weapon or ability for you to use the next time you play.  The music and visuals are decidedly 8 bit styled, but they are not without their own charm. Your ninja character beautifully slices and dices and shurikens all of her enemies into explosions of pixelated carnage (which you can turn down/off in the options if you'd like).  Don't expect anything incredibly deep here, but there is plenty of quick satisfaction to be had, and the customization options grow the more you play and unlock new features. There's a sort of gradual progression from seemingly basic to surprisingly varied after even just a few tries.  Online leaderboards allow you to track your best times and scores and compare them against your friends as well. Works great with a controller too!",
            "review_score": "1"
        },
        {
            "review_text": "This game brutally tests your reflexes as you slash or throw shuriken at enemies and watch their guts explode everywhere whilst you jump quickly from platform to platform avoiding death at all costs. If you're able to get good at it, however, it rewards you by making you feel like a total badass.",
            "review_score": "1"
        },
        {
            "review_text": "Love the fast pace dungeon crawler, but would like to see more bosses or someway to continue on.",
            "review_score": "1"
        },
        {
            "review_text": "I rememebr when I saw this game on the store page. 'Super Hours of Dead Ninjas?' I said. Needless to say, the first iteration was pretty OK. Then, as updates happened, it turned into an even better game. This got me started on Adult Swim Games' games and I love it for that.",
            "review_score": "1"
        },
        {
            "review_text": "Super old school bit game. Brings back the really challenging levels and unforgiving gameplay.  I recommend this game to people who miss the old games from the Mario world era.  ",
            "review_score": "1"
        },
        {
            "review_text": "yes i do recommend this ♥♥♥♥ ass nigguh ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "Not so long ago, almost next to your place, a Ninja, Pop-Culture and Diablo had a child..   You are a highly skilled warrior of the ancient Clan Megadev, deployed to assault hell itself.",
            "review_score": "1"
        },
        {
            "review_text": "This game was given to me for free at PAX East 2013 by 2 booth babes dressed as more ♥♥♥♥♥♥ versions of the protagonist. Not saying it's a bad game, but hey, I like free games as much as the next guy, but I also dont like dying at the same floor over, and over, and over, agian and throwing my mouse across the room in a fit of rage.",
            "review_score": "1"
        },
        {
            "review_text": "Platforming in it's more pure form is something that has to be played, and this game gives you such a good sensation of what that is. Starting off, the controls are going to seem a bit off ( Up to jump? You only attack in the air if you hit down? ) but once you get past that, it starts to click, and suddenly this game goes from 'I'm dying before I reach the first boss' towards 'I gotta get a faster all clear time'. The game also does a good job of always keeping you 'informed' with how things unlocked, teasing you of bosses you've yet to see, or objectives you should be attempting and aiming to do, that in turn can end up improving your score a ton if you focus on some of those strats.  For a game you'll be able to pick up and play for like ~10 minutes per run, it's quite the blast, giving you a sensation of a shmup, without being one at all. Just stick with it if you do get it, because your first few games ARE going to end poorly, and are going to make you wonder if the games just bad, or you've just yet to understand it.",
            "review_score": "1"
        },
        {
            "review_text": "A very difficult game that, once you get the hang of it, is insanely fun to play. The game's playstyle is very fast paced and the game itself can be repeated 20 times over and always feel different. 10/10, would ninja again.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly the most fun ive had in a long time. Its like Super Meat Boy only better with randomly generated levels tons of unlocks and at a price you just can't beat.",
            "review_score": "1"
        },
        {
            "review_text": "challenges, weapons, and powerups out the ♥♥♥. great gamefeel and optional scanlines",
            "review_score": "1"
        },
        {
            "review_text": "If you like fast paced, oldschool difficult games that will punish you at every corner, this game is for you.  It is so fun and addicting, that even through all the pain it puts you through you'll be back for more.  Gamepad/Controller is recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Nice if u like old school snes platformers :)",
            "review_score": "1"
        },
        {
            "review_text": "It's an absolute distillation of the Ninja genre. No plot worth noticing, characters, emotions, nothing whatsoever. It's a highly visible ninja murdering her way down a tower for no good reason. It is people getting whipped, and then being decapitated. It is a pure game, and I will whip anyone who says otherwise. And afterwards, they will be decapitated.",
            "review_score": "1"
        },
        {
            "review_text": "Fast-paced and intensifying action with lots of blood and gore! I enjoyed the smooth gameplay while especially using her ninja weapons and special abilities on evil! Fun arcade side-scroller game, worth the $3 I got it for!   Pros: -Controls are smooth and responsive -Nothing like running through floors while slicing and dicing to get that adrenaline pumping -Lots of weapons, upgrades, and customization for your ninja -Gameplay worth more than what you are paying for -Extremely addictive   Cons: -Your ninja is a girl",
            "review_score": "1"
        },
        {
            "review_text": "Spelunky+Ninja Gaiden=many hours of hardcore,randomized,variable high-speed action.This game,in other words is perfectly-addictive-and-overall-perfect.end of line",
            "review_score": "1"
        },
        {
            "review_text": "c bon calissse",
            "review_score": "1"
        },
        {
            "review_text": "Fun. Addictive. Ninjatastic. Super House Of Dead Ninjas is a wonderful game made for those who want to get better the more they try. I have close to 18 hours on record and I do not regret a single moment. Even if I would have gotten this game at full price I'd still be satisfied. The combat is solid, the gameplay is fun and the developers are very close to the community. If I do have a single complaint is that sometimes the game is supposed to give you an award but it does not. Its only happened with Horror and the ghosts but otherwise solid title. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "What do you mean you don't own this? Stop reading these pointless words and purchase this now. Seriously, it's a simpe premise but ultimately ends up being an addictive fun-fest of fun-ness.   You could always play the free version that is up on Adult Swim's website as a kind of 'demo' before you try this but bare in mind when this game says Super, it really means it.",
            "review_score": "1"
        },
        {
            "review_text": "All the best elements of Megaman, Shinobi, Strider, Castlevania, Metroid, even some Elevator Action, blended with the roguelike sensibilities and persistent unlocks of Binding of Isaac. And I mean ALL the best elements, graphics, gameplay, music.  It's basically perfect.  There's a reason the initial loading screen looks like an SNES box. Grab your gamepad and go.",
            "review_score": "1"
        },
        {
            "review_text": "this is really cool game, but its king of hard to complete on hard mode",
            "review_score": "1"
        },
        {
            "review_text": "Fun fast frenzy of slicing, jumping, running, and dying. Yes dying, but that's okay because the game is super fun and you are back in the game almost instantly afterwards. If you liked any of the old Shinobi or Ninja Gaiden games then you will love this.",
            "review_score": "1"
        },
        {
            "review_text": "A nice throwback to the 2d Platformers of yesteryear, SHoDN has you traversing a 350 floor caslte with demons and traps around every corner. Having similarities to a rogue-like, death comes often but never being an annoyance. You'll slowly unlock new weapons, abilities, and magic spells to help you get closer to the final floor in your next game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to just pick up and play, asian reflexes are ideal but not required, a controller will help greatly!  Soundtrack is pretty good, and the dialog can be funny although after failing a level 5 times in a row and hearing 'you suck' can get you angry lol.  Only 3 levels within the game, but a randomized boss end of each level, hard mode means you get only 1 life and start at the beginning level, so if you're on level 3 just about to complete the game and you get a unfortunate death your straight back at level 1!! This mode gives the game good replay value and a chance to get a juicy achievement, the game features quite alot of different weapons/upgrades once you unlock them.  Overall a great game i would recommend!",
            "review_score": "1"
        },
        {
            "review_text": "this game is fast",
            "review_score": "1"
        },
        {
            "review_text": "A fast-paced action platformer with randomized levels and unlockable powerups, costumes and weapons that persist throughout your playthroughs. There is a free (flash) version with less content on adultswim's website.",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun, though some may not like the retro look of it",
            "review_score": "1"
        },
        {
            "review_text": "Much speed such ninja WOW 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "fun game but I ♥♥♥♥ING HATE TRANSDIMENTIONAL LEAKAGE but other than that it is a very cool",
            "review_score": "1"
        },
        {
            "review_text": "Play this. It's 350+ floors of Megaman on Speed.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and fast. A really fun game to speedrun.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little platformer that is quite forgiving to the player. You get two coinplays, and some hearts, so it becomes bearable. This can probably be attributed to the loose controls of your character to keep the player's frustration in check. Nonetheless, a wide variety of unlockables to keep you going at it.  Some boss levels can be quite annoying, since you don't know how to face them as you haven't learnt their movement/attack patterns yet. Once you die, you will definitely be frustrated at the fact that you have to traverse the entire level again to get to the boss, and hopefully memorized the boss by then. If you didn't, be prepared to traverse the stage again.  I'd give this a 8/10, for the nice retro graphics and storyline behind it. Gameplay wise, nothing game breaking. I am glad this game doesn't have any 'pixel-accurate' obstacles, it'd definitely make the game more frustrating. All in all, still a game worth trying out.",
            "review_score": "1"
        },
        {
            "review_text": "Normally, I wouldn't endorse this sort of game, because it typically would be ♥♥♥♥♥♥ and not worth buying. Surprisingly, that isn't the case, this time around. If you're a fan of fast paced arcade games that were unreasonably difficult until you burned through a week's worth of quarters, but oh-so rewarding when you could breeze through the game in front of all of your friends (assuming you had any), then you should enjoy this. The controls are solid, tearing through enemies is sadistically entertaining, and the randomly generated tower should keep you entertained for quite a while. Or frustrated. Or both.  tl;dr - 9/10, worth the pocket change.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me hate monkeys, frogs and red skeletons.",
            "review_score": "1"
        },
        {
            "review_text": "A super fun, challenging platformer, with some seriously punishing difficulty, be warned it's addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Its ok. Not an owherwhelmly positive funn type off game. But if you are a platformer perfectionist, you will like this.   For the casual player, its propably not going to be a serious time waster. But something to press when waiting for the dinner to get done.   Wish there was another way to rate games on steam, like a scale from 1-6 stars or something.",
            "review_score": "1"
        },
        {
            "review_text": "Adult swim really knows good video games",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, very fast paced and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "A very addictive game that gives hours of countless fun to all levels of gamers, casual to hardcore. Worth picking up on sale, not for 7 dollars, 10 with dlc. It was 3 for both combined on sale today, and I plan to get a good 100+ hours out of this game.",
            "review_score": "1"
        },
        {
            "review_text": "Just outstanding. 10/10 essential purchase.",
            "review_score": "1"
        },
        {
            "review_text": "This game is addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Memorization like mega man, but more like memorize each enemy, they're everywhere. I had his plan to slice the 6th guy on the left. After I went through his buddies. I get hit with a thrown item from the 7th guy. I didn't see he was a thrower from my first scan of the batttlefield. my first scan took less than a second, and less than 3 seconds later; I was dead meat.   This will keep your brain firing. better than sudoku.",
            "review_score": "1"
        }
    ]
}