{
    "app_id": 224940,
    "name": "Legacy of Kain: Soul Reaver 2",
    "release_date": "2012-12-06",
    "developer": [
        "Crystal Dynamics"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "Adventure",
        "Action",
        "Story Rich"
    ],
    "achievements": 0,
    "positive_ratings": 288,
    "negative_ratings": 107,
    "price": 4.99,
    "description": "In this sequel to the critically acclaimed Legacy of Kain: Soul Reaver, reassume the role of Raziel, and travel back through the currents of time into various eras of Nosgoth's past in your relentless pursuit of Kain.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/224940/header.jpg?t=1478900999",
    "minimum_requirements": "OS:Windows XP / Windows Vista / Windows 7 Processor:1.8 GHz Processor Memory:512 MB RAM Graphics:3D graphics card compatible with DirectX 7 DirectX®:9.0 Hard Drive:2 GB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Soul Reaver 2",
            "review_score": "1"
        },
        {
            "review_text": "Amazing sequel to an amazing game, with some infuriating enemies 8D Story and voice acting is once again absolute top notch. And Soul Reaver 2 swaps out its predecessors love of block puzzles for light reflection puzzles. The game is solid, if short, but a very worthy entry into the Legacy of Kain series.  Knowledge of Soul Reaver 1's plot is basically essential here, as it picks up EXACTLY where the first leaves off.",
            "review_score": "1"
        },
        {
            "review_text": "  All legacy of Kain should have full compatability to game pad. Other wise the keybaord and mouse just messes thing's up. :)",
            "review_score": "1"
        },
        {
            "review_text": "What to say that has not been said already. If this game was a cup, it would be overflowing with epicness.  If you never played it before, you are in for a story you will never forget(most likely you wont understand it either if you havent played previous Legacy of Kain games). Naration is just epic, all voice actors(Kain especially) are very gifted voice actors and will make every cutscene feel amazing. Also, story is well written and leaves little to nothing unexplained but rest assured that after finishing LoK series, all shall be revealed.   Speaking of gameplay, combat is good, fast and dynamic and fairly challenging at some points. Puzzles are entertaining, and a bit challenging every now and then. Only thing that is worse, in my opinion, compared to previous Soul Reaver game is that there are no things to collect, as health upgrades or glyph magic and that the world feels much smaller than the one in the original Soul Reaver  Pros: -Epic Story narrated by epic voices -Fast, dynamic combat -Fun puzzles -Detailed world and nice visuals  Cons: -No 'secret' collectables -Can crash on PC's with multi core CPU's(avoid by making it run on only 1 core)  9/10",
            "review_score": "1"
        },
        {
            "review_text": "The greatness carries over, and where Soul Reaver I would leave absences for expanding upon the same dark narrative... the plot thickens, it twists and turns, and beginning right where the first game ended, we see Raziel follow his course of fate and vengeance, not through Nosgoth, but through time itself. Take again the Soul Reaver, and put those welps and weaklings to pay. Feed on them, grow, as you find the shackles of destiny, and of time itself, clasp about your wrists.  This game is gorey, bloody, just as much so as the first. Raziel must sate his dark hunger.  UPDATE!!!: You should get an xbox controller, or a programmable mouse / controller to play this game. The default controls are shakey on PC, as this was definitely intended for the Playstation. I would most likely extend this comment to all other Legacy of Kain games.",
            "review_score": "1"
        },
        {
            "review_text": "Throughly enjoyed. One of those games that I stayed up late to finish.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game... but it totally fails on my computer. Probably have too much for it.",
            "review_score": "1"
        },
        {
            "review_text": "LoK is probably the best single storyline in gaming history to date.  Soul Reaver 2 is the third entry in the series, after Blood Omen (not available on Steam) and the first Soul Reaver. In this entry Raziel hunts Kain through the passages of time and learns of the conspiracy of the time-streamer Moebius, with sinister implications concerning Raziel's own destiny.",
            "review_score": "1"
        },
        {
            "review_text": "A triumph in technology from the first Legacy of Kain: Soul Reaver, Legacy of Kain: Soul Reaver 2 is the squeal we all waited for and it delivers. Great storytelling, talented voice acting, memorable characters and a compelling world all come together again. The addition of enhanced combat and trickier puzzles make Legacy of Kain: Soul Reaver 2 the necessary second installment of the trilogy you have to dive into.",
            "review_score": "1"
        },
        {
            "review_text": "Had to get xpadder to work with the controller, I set it to gamepad and keyboard. Seems to work well once you map everything out. Only the projectile shooting goes off aim, but that might be my controller. Other than that I'm happy with this.",
            "review_score": "1"
        },
        {
            "review_text": "Had to get xpadder to work with the controller, I set it to gamepad and keyboard. Seems to work well once you map everything out. Only the projectile shooting goes off aim, but that might be my controller. Other than that I'm happy with this.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not reviewing the game itself, but the version currently on Steam and how it plays. That is, depending on your system, terribly.  Lots of people have problems with random freezes during cutscenes, which is a pain since save points are often an hour or so apart and you can't even skip cutscenes you've already seen.  The localized versions of this game, while they exist and are generally considered good quality, are simply not available on Steam. This is English only, and worst of all, this game comes from a time when not having any kind of subtitles was acceptable (way to do accessibiility, by the way).  I don't care how old this game is. If you are republishing it, you have to do basic support. Why are we still paying for it if not this?  Update on this : So it appears the frequent freezes are related to processor affinity in multiple core systems (most modern PCs). There are workarounds, none of which are very convenient for end-users. This could be fixed somewhat easily for everyone if Square Enix had any care. For this reason, and for the non-inclusion of versions other than English, I still don't recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "No Controller support an no other language than english (i'm german).  This port doesn't contain standart supports of gaming.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Cant ever get the damn thing to run.. Even bought the GOG version and does the same thing. I got suoer excited when the EIDOS logo flashed then i got the sr2.exe bullcrap. I have play and own all legacy of kain titles except for this one!! AND I CANT FREAKING PLAY IIIIIIIIIIIIT!!!!!!!!!!!!!!!!!!1",
            "review_score": "-1"
        },
        {
            "review_text": "the game doesnt even start up, a complete waste of money in my opinion as a game should run without you having to search thro hundreds of solutionsto get it to work, which it still wont work for me even after trying many different methods to fix it",
            "review_score": "-1"
        }
    ]
}