{
    "app_id": 225020,
    "name": "Tomb Raider VI: The Angel of Darkness",
    "release_date": "2012-11-28",
    "developer": [
        "Core Design"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 12,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "Adventure",
        "Lara Croft"
    ],
    "achievements": 0,
    "positive_ratings": 349,
    "negative_ratings": 262,
    "price": 4.99,
    "description": "A series of grisly murders brings Lara into conflict with a sinister Alchemist from the past, and a secret alliance of powerful individuals shrouded in mystery. Accused of the murder of her one time mentor, Werner Von Croy, Lara becomes a fugitive on the run.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/225020/header.jpg?t=1556062075",
    "minimum_requirements": "OS:Windows XP/ Windows Vista / Windows 7 Processor:1.8GHz Processor Memory:512 MB RAM Graphics:3D graphics card compatible with DirectX 9.0c DirectX®:9.0c Hard Drive:2 GB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This game still remains to be my favourite Tomb Raider game. This, along with Revelations.  However, I can't recommend this game to anybody unless I'm willing to have my head removed and my house keys stolen.   The reason being? Well:  &gt; Core have managed to make the control scheme WORSE than the previous games- yes, your heard, WORSE. However you can bind the controls to your taste and patch some of the crappy animations. It's a pain in the ♥♥♥♥ though.  &gt; The graphic settings are too elaborate and you can easily toggle the wrong thing and your game will either not work or worse: look like Minecraft  &gt; Took me an hour or two to figure out how to launch it (had to mess with graphic settings)   &gt; At least 2 hours of the game are wasted, waiting for the slow, sloppy animations to end. It takes Lara about 9 seconds to climb a ledge after performing a long jump just to stop her legs from dangling. This is very minor I know but it's just poor Core.  &gt; Lara is a complete and utter ♥♥♥♥♥, like she has some personality disorder. She really is a malicious cow-bag to people who are friendly to her- why, lol? Also, there have been an addition of dialogue choices, but these only seem to make a difference during two points of the entire game.  &gt; Oh and the combat? It's hit and miss. Most of the time you'll probably miss.  I know this game is old and it may appear ridiculous to slate a game of its age. But I really don't want new-comers to the Tomb Raider series to just assume all the games are masterpieces (we all know that's not true anyway) and just buy this expecting it to be good as- idk- Legend or Anniversary.   And after all of this you've probably scrolled up to see if you read the first line correctly: yes this IS my FAVOURITE Tomb Raider game. But this is probably because of nostalgia or something.   It does have a pretty decent story, and variant levels, and action and there is ONE tomb.  I'd recommend missing this; or if you're dying to play it, buy it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "I will talk about few things here but I will first say, that I use the control fix mod, HD graphics mod (only for first few levels) and some other mods. So I had a better gaming experience than it was at the release.  Story One of the best in the series. I love how it's not a typical 'Search for artifact without even have a clue why she is searching for it'. The game was rushed and that's why it wasn't finished. The beta documents are in the internet so the story wouls've been better than it was already. But for now it's also great. I enjoyed the story and very well cutscenes. Also playing as Kurtis was also cool and that they put a second playable character in this game was something new, which I liked.  Graphic The game turns 13 years old this year, so of course it's old graphic engine. I like the style about it and that it's not trying to look realistic (like nowadays), instead it's kinda of a comic style. I prefer this style over the games who came after AOD.  Gameplay We all know that the controls weren't the best but before I used the control fix, I never had problems with the controls so I don't really have nothing against them. The only things I didn't liked were that she does 2 slow moves and then starts running. The second thing was the control on stairs sometimes. That was annoying. The grip thing was interesting and maked it more realistic but climbing under time pressure wasn't so good. The rest of the controls were good. They were kinda like the old controls so.  Music The soundtrack is also one of the best in the series. I love the theme song the most and also the others. If you want to listen to it, search it on youtube and listen to the beautiful soundtrack :) Overall This game is one of my faves for some reasons (Really good story, the style of the Levels and good cutscenes for example). Many people dislike the controls or some bugs in this game but if you put them aside, you have a good game. I think it would've been the best TR, if it was finished and not rushed and released in an unfinished state. I recommend this game if you don't really care for bugs and the controls and just want to experience a good story with interesting game design than it's the perfect game for you :) This game deserved better-  (If you want some mods like the ones I mentioned earlier, than go to  core-design.com  and search in the community section for them)",
            "review_score": "1"
        },
        {
            "review_text": "Don't get me wrong. I'm a huge fan of the TR series and I love pretty much all of them. Except for this one. Yet, the first five games were pretty much the same game regurgitated, but hey, I loved those games! But AOD had slightly different controls and it was just so frustrating. The graphics are much improved, and the story is awesome, but the controls and glitches make it super frustrating to play. Unless you are a die hard Tomb Raider fan, don't play this. There's a reason Core Design went under and had to sell the TR series after this game was released.",
            "review_score": "-1"
        },
        {
            "review_text": "Glitchy as Hell and the control scheme too a while to get used to.  As a Tomb Raider fan however I cannot stress enough that this is a great game overshadowed by some of its flaws. Graphics aged incredibly well and can be even boosted by ENB mods.  Definitely recommend if you like old school Tomb Raider.",
            "review_score": "1"
        },
        {
            "review_text": "Well, i love the game concept of her in real life not all fantasy, several people didn't like it, but the stealth, running from police and being able to take care of herself without weapons made me crazy about the game. I actually like more the Paris part than Prague, but the game is awesome for me. I like playing with Kurtis as option, but he only using 1 weapon sucks, he needed something stronger, i felt like his battles were way worse than any other boss fights with her.  Another thing that annoys you is the bug interface everywhere, you jump 2 times and skipped a whole lv.  The story itself is really interesting and some plot twists happen and i don't know about others but the end blew up my mind, awesome!  I totally recomend this if you are open minded for a different version of lara, darker and cynical.",
            "review_score": "1"
        },
        {
            "review_text": "I have played this Tomb Raider when it was realesed, a couple of years ago. I finished it and enjoyed it a lot.  However, now, after I played more recent game (just finished Tomb Raider (2013), the gameplay is horrrrrible! Controls react slowly and motions are slow; for climbing through a window you must first align with the window, then stop moving and only then prress a key to go through. Searching cabinets has a pretty animation, but takes too long. And what the hell is with the first two steps in walking speed and then suddenly running?! It makes manouvering in smaller areas, like rooms, very difficult.   To summon: Don't play this Tomb Raider if you have played any more modern or recent games to save yourself some frustration. Otherwise, it could be fun I think!",
            "review_score": "-1"
        },
        {
            "review_text": "TR6 was the third in a sequence of TR games made to a story arc. Lara had been working with her old mentor in TR4 to uncover some secret in a pyramid, when the structure collapsed. Lara was left for dead. After the rescue efforts finally were given up, a bunch of her 'old friends' got together to tell the tales of her younger self... meanwhile something was happening to Lara somewhere.... Later.. TR6 happened... She's back, and she's ♥♥♥♥♥♥ at her former mentor, but for some reason still considers him a friend. What happened... how did she end up both annoyed, and friendly? Who knows. TR6 should have told you in the intro, but didn't. The intro consists of a confusing 'radio announcement' about some killings, and then dumps you into a city chase without so much as an explanation. And so begins the (so far) weakest of the Tomb Raider games.   From the name, you'd assume you'd be raiding tombs... but like several of its predecessors, you spend a lot of time in cities, apartments, burning buildings and so on. While okay to tell the plot, the amount of time above ground, or in modern structures is equal to (or greater than) the time below ground in ancient ones.  The plot is okay.. Lara's on the run, there's some bad dudes.. Guess who has to stop them.. the usual... The only thing that's vaguely new in this game is the use of a proper 3d environment... Gone are the blocks and sharp angles of previous TR games. you've now got polygons coming at you from all angles. There's volumetric fog, lighting, shadows.. all sorts of new graphical stuff to delight the eye.   It's just a shame that the majority of it is buggy as hell. This is the first TR game where I've experienced a crash. Usually in the AI path-finding (according to the debug log), or fallen 'through' the scenery, endlessly falling...   It's also the first time I've been truly truly annoyed at the controls. There are some sections of the game where the camera doesn't help you perform a sequence of moves (there's a few sections in TR:Chronicles on the irish haunted island which come to mind), but in this game, the camera can sometimes be behind a door, plant, wall, or just facing in the least useful way possible. Often you'll be stalking a corridor, and something will walk up behind you and stab you to death. You didn't see it because the camera was such a stupid angle, you couldn't have.   Camera aside, the single most annoying thing about this game are the controls. Gone are the fluid jumps and flips of previous games. In this game, they chose to animate lara using animation chains that cannot be interrupted by you. Sometimes the game will interpret 'forwards' as run forwards. Sometimes it's walk forwards... You take two, three or four steps walking, and then you start to run. When under fire, or doing a timed puzzle, this uncertainty is the main cause of death-reload cycles.   Next, you've now got this little 'standing jump', which you have to use in certain puzzles. However if you use it too close to an edge (or even not!), when you jump, the game re-orients you in the air randomly.. I think it's to align with the edge you just left. On curvy little round platforms, that means you often curve away from your intended landing spot, and plummet into the chasm. There are two sections of this game where you have to standing-jump from tiny platform to tiny platform. It was just a case of jump-die-reload-jump-die-reload........ until the game decides NOT to curve you away, so you save and repeat until at the far ledge. Damn frustrating. I ended up just using back-flips blindly in the hope of landing in the right spot (over and over again). because at least the backflip doesn't get curved by the game in mid-air.  Fighting is equally bad. Shooting and flipping was a great tactic in TRs1-&gt;5. If you try do a flip now: She has to crouch, jump, land, bend, straighten, move her feet apart, and fractionally lower her gun, before you can jump again. Doing so makes for agonisingly stilted acrobatics. Don't even think about trying to do two things at once (like back-up and take your gun out, which was a staple of previous TR games).. Also, when fighting, gone is the wonderful 'arms tracking enemy' in previous games (remember when lara dual-wielded, and her arms could track TWO enemies? That was AWESOME). Now Lara's whole body tracks the enemy, and 'locks on' and 'locks off' at random intervals... So you can be in a fight, running away, then suddenly BAM, you're pointing AT the enemy running towards them... You try to do a backflip, but for some reason the controls are now reversed, and you do a flip AT the enemy. The fight with 'Boaz' is one of the most frustrating fights: The stilted pauses between flips is slower than the enemy's blob-fire rate, so you're constantly being knocked down. Grrr.  All in all, this is definitely the weakest of the TR games. I played it initially in the hope that I'd find out how she survived TR4 (which I didn't), and to move the story arc along (which it doesn't)... So all in all, a disappointing game.   The voice acting and music is standard TR fare, that is to say, excellent. The level design itself is staid, but solid. The monsters are interesting and different. It does introduce an interesting new character (future love interest?).. So I can't say that it's ALL bad.   The Verdict: If you're a TR fan, sure, go ahead and play it.. It'll waste a good 10+ hours, and give you a bit more in the life of Lara. Be prepared for frustration: Don't expect anything as polished as Chronicles, though.",
            "review_score": "1"
        },
        {
            "review_text": "Angel of Darkness was the last of the 'Von Croy Trilogy' as well as the last of the Core Design Tomb Raider made games. It was the first 'smooth' graphics Tomb Raider game ever made, meaning no polygonic characters or blocky locations. The game had excellent detail on the characters as well as the locations. But great visuals don't lead to a great game, when the controls don't function right. Apparently this game was in production for a few years, and to have it be released at the same time as the second Tomb Raider movie 'Cradle of Life' it was rushed into the gaming market without fixing the bugs or glitches. In the past, the only difficulty you deal with in the Tomb Raider games is the environment of the levels and the obstacle of traps and enemies. In this game, you are handicapped with limited controls, glitches, and a hanging meter every time you need to travel across a ravine or ledge by hanging off it with only your hands holding you up while going across. Had these issues been resolved this could of been a playable game. But I am unable to give it mercy when the game is frustrating in control wise and not level wise. I can understand what they were trying to do, they were attempting to experiment with new challenges, gameplay, and situations to differ from the older games. Which that is fine, I am open to new experiences for the Tomb Raider games but if you don't focus on the gameplay of the game no one will care about what those new experiences were. At the time this game was released, only three million copies got sold, and was cited as a market failure. It was such a disaster that it nixed the planned sequals to follow up and Core Design ended up ditching Tomb Raider which ended up in the ownership of Crystal Dynamics. I would love to of seen a follow up to this game, which was going to be titled 'Tomb Raider: The Lost Dominion' which would of explained how Lara Croft escaped from the Temple of Horus as well as the fate of Kurtis Trent, who was an interesting character who became the first playable male protagnogist in a Tomb Raider game. But with the reputation this game has, I don't think we will ever see him in another Tomb Raider game again. Thus Angel of Darkness ended the first line of the Tomb Raider franchise and is if not the weakest game in the entire franchise. Lesson to be learn, never rush the prodcution of a game and be sure the controls don't suck.",
            "review_score": "-1"
        },
        {
            "review_text": "You will hate everything about your life while playing this game. I liked the old school Playstation version much better as the controls werent as glitched. After playing games like Skyrim, it's near impossible to go back and actually enjoy playing something like this as the fluidity with the controls or steam controller (which is what I've been using) is just not there. Lara Stop / Starts if you even try to turn a corner, there is no running or diving component and more often than not, she turns by herself in a direction that you dont want.   I wish they would do a remake of this game with the technology that exists today. I like the storyline, it's very Film Noir but other than that, you'll be yelling obscenities at how glitchy the game plays out. Better off playing Tomb Raider Anniversary.",
            "review_score": "-1"
        },
        {
            "review_text": "'If I had a coconut for everytime some lunatic said something like that'",
            "review_score": "1"
        },
        {
            "review_text": "Worst Tomb Raider ever. Buggy, even on Windows XP. The controls are horrible, the story is horrible. Don't buy.",
            "review_score": "-1"
        },
        {
            "review_text": "This game so lag on the start and always random crash.. help me please O.o Tomb Raider Legend and Anniversary run smooth on my Laptop",
            "review_score": "1"
        },
        {
            "review_text": "What this game lacks in stiff controlls and glitchy graphics macks up in the invonment of the game. Beautiful. Differnet from the rest of the TombRaider games, and the Best in my opinion. 4/5",
            "review_score": "1"
        },
        {
            "review_text": "'if only I had a coconut everytime a lunatic said something like that'",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia at its finest. This was the first ever game I played, when I was just 2 years old I dived into one of the tomb raider 's classics. It's a must for any diehard Lara Croft fan.",
            "review_score": "1"
        },
        {
            "review_text": "It is the best Work since Edios start to making the TR series, the best Story and best Puzzle(Underworld has also very good puzzles, but to compare with Angle of Darkness, the puzzles in Underworld is a little bit easier.). You should not miss this one if u r really a Fan of Tomb Raider.( I have bought the CD before about 6 years, and now i bought it in Steam, the 10th time i playing this one). Maybe someone would say, that the 3rd generation is much more better than this one, all righ, if u meaning the puzzles, yes, it is. But considering the Puzzle, story and Graphic, maybe also the limit of Bullet. Angle of Darkness is than better than 3rd generation.",
            "review_score": "1"
        },
        {
            "review_text": "This..... is a new kind of bad.  The kind of bad where alt tabing breaks the game. The kind of bad where you can fall through the floor and through other things if you have an AMD graphics card. The kind of bad where everything auto aims and you have to press roll to change the target even though the game at no point tells you that. The kind of bad where if you don't complete a certain portion saving a certain amount of bullets you will not be able to kill the second to last boss without using someone else's save. The kind of bad where you can die at a certain point just for not selecting the right dialogue choice. The kind of bad where at multiple points you can glitch the game to the point of not being able to progress. The kind of bad where the story lacks enough substance to make it worth finishing.  Don't buy this. Don't even play it as a gift. Hell don't even pirate it.",
            "review_score": "-1"
        },
        {
            "review_text": "Yep. I remember this game. The PC version was better than what was released as what I consider underdeveloped for the PS2, but the issue was.. This just wasn't Tomb Raider. Sure, it had an idea, and tried new things.. But I like to think that this never had anything to do with Tomb Raider. I mean, a hardass like Lara Croft suddenly being attracted to some run-of-the-mill male character RANDOMLY introduced? No thank you. Nope. Nuh uh. Bad enough they forced you to go through dialogue.  If you want to look at this from another perspective, or say it was made by fanboys/girls, sure, it's decent. But still, broken.",
            "review_score": "1"
        }
    ]
}