{
    "app_id": 225160,
    "name": "Shadow Warrior Classic Redux",
    "release_date": "2013-07-08",
    "developer": [
        "General Arcade"
    ],
    "publisher": [
        "Devolver Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "FPS",
        "Classic",
        "Action"
    ],
    "achievements": 20,
    "positive_ratings": 1789,
    "negative_ratings": 151,
    "price": 6.99,
    "description": "The definitive version of the cult classic shooter, Shadow Warrior Classic Redux features remastered visuals and two massive expansion packs. Corporations rule every facet of life in a near-future Japan and employ Shadow Warriors, one-man armies of unparalleled skill, to protect their power and forcefully remove all opposition.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/225160/header.jpg?t=1482286710",
    "minimum_requirements": "OS:Windows XP, Vista, or 7 Processor:1.5 GHz Processor Memory:512 MB RAM Graphics:OpenGL compatible graphics card with at least 256M DirectX®:7.0 Hard Drive:650 MBHD space Additional:OpenGL compatible graphics drivers.",
    "recommended_requirements": "OS:Windows XP, Vista, or 7 Processor:1.8 GHz Processor Memory:1 GB RAM Graphics:OpenGL compatible graphics card with at least 256M DirectX®:9.0 Hard Drive:650 MB HD space Additional:OpenGL compatible graphics drivers.",
    "reviews": [
        {
            "review_text": "A classic fps masterpiece.  + Epic quotes. + Brutal and gory gameplay. + Original Weapons. + Enhanced graphics. + Level design. + Katana. + Replay value.",
            "review_score": "1"
        },
        {
            "review_text": "The most authentic asian simulator I've ever played!!  You go around collecting fortune cookies, banging gongs and uncovering ancient chinese secrets. Everyone is out to get you so your kung fu and katana skills will come in handy.   The main character Lo Wang is someone everyone can relate to. He likes sushi, acupuncture, anime babes and hes not afraid to crack a laugh about Hiroshima.   In one of the included expansions Lo Wang hunts down his twin brother Hung Lo. Folks they don't make games like this anymore.    ",
            "review_score": "1"
        },
        {
            "review_text": "incredibly racist and hilarious   also good gameplay but thats not as important",
            "review_score": "1"
        },
        {
            "review_text": "One of the great retro FPSes, Shadow Warrior is somewhat similar in gameplay to Duke Nukem 3D. The game is definitely quite difficult, but the introduction of quicksaving and quickloading eases off the difficulty for newer players. Since much of the game's humor comes from he hilariously stereotypical protagonist Liu Wang, some players may find it racist, but it's all just in good fun. The game looks good for its time, and the sound assets are great.   Gameplay wise, the game plays great. The player can fight enemies with his fists, a katana, dual-weilding uzis, a rocket launcher with optional heat seeking missiles and even a nuke, a heart that creates a clone of Liu Wang, and more. The stage design is usually a major strength in old FPSes, and Shadow Warrior is no exception. The huge, expansive stages are fun to explore and packed with secrets. Enemy variation is not the best, but there's definitely enough to keep the player entertained.  The port remains faithful to the original, but one of the new editions is a multiplayer mode. It works well, but I rarely use it. One of the multiplayer's greatest strengths is the ability to design stages and share them with full Steam Workshop Support.  It may not be as well known as Duke Nukem 3D or Doom, but it's definitely just as good. From veterans to new players alike, Shadow Warrior Classic Redux is a classic that's definitely still worth the price today.",
            "review_score": "1"
        },
        {
            "review_text": "go speed racer go",
            "review_score": "1"
        },
        {
            "review_text": "Just as insane and cliche-driven as Duke Nukem, but with a more exotic setting and leading character, Shadow Warrior Classic Redux is a great shooter that's been perfectly redone for newer computers with tons of beautiful levels and funny one-liners that will keep you hooked.  Who wants some wang?",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior is another great, classic FPS from 3D Realms, the last before they went on to do Duke Nukem Forever. Compared to Duke Nukem 3D the level design has improved even more, all of them seem very well thought out. They make also more use of destructable wall than before, some for revealing secrets or to progress. The style is pretty much the same: find the end of the level, sometimes hindered by locked doors for which keys have to be found. The weapon fit the style of the game, but are not as unique as in DN3D. Beware that the game is very racist against asians and sexist. It spawned controvery at its release and is probably the reason why it didn't sell as well as DN3D did. Especially the comments of protagonist Lo Wang can be quiet bawdy, more than the 'modern' Lo Wang in the Shadow Warrior reboot of 2013 and even Duke Nukem. The Classic-Redux-Edition features improved music and graphics which look nice in Full-HD resolution but keeping the style of the original. If you prefer the low quality music and sound and heavily pixelated graphics of the original you can still play it as it is included. Also included are the two expansion packs Twin Dragon and Wanton Destruction. WD was made by Sunstorm Interactiv which also made solid expansion packs for DN3D and this one follows them. They have some good level design, although it does not reach the quality of the base game, but are still worth to play. Twin Dragon on the other hand features large, mostly boring and uninspired levels that are more like the ones in modern FPS than the labyrinths of the classics. Especially annoying are the hidden mines in some levels that kill you instantly - not a good fit to a fast paced FPS.  I'd recommend the game for everybody who enjoys old school FPS like Doom, Quake or DN3D, although I think Shadow Warrior doesn't reach their quality, but comes very close. The Classic Redux is probably the best version to enjoy the game today.",
            "review_score": "1"
        },
        {
            "review_text": "Old school combat and funny stilll. So not PC...  You no mess with Lo Wang!",
            "review_score": "1"
        },
        {
            "review_text": "Nothing but childhood memorys here you play as the smooth talk master ninja Lo Wang. This game is all about fast pace fps that will keep you going until you rage from the deaths that you will have to go throught just to pass one level but im saying worth every penny comn and grab a copy !!!!!! or wang will find you and you know wang you to death!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Finally a properly working version (not counting DosBox) of Shadow Warrior in Windows. Full of gags, action and hot anime girls. What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "It's so nice to be able to go back and play a game from my childhood.  It's exactly how I remember it. The games that first got me into shooters. Love this throw back!",
            "review_score": "1"
        },
        {
            "review_text": "Enough Wang for you.",
            "review_score": "1"
        },
        {
            "review_text": "Get this. Shadow Warrior was underrated when it originally came out. DON'T MISS IT NOW.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game again made me realize how much I used to like the voxels of the original build engine. This game specifically was not my favourite at that time, but the nostalgia value made it grow on my perception - a lot. It's fun, not very long, hard and on occasion makes you laugh about some of the jokes.",
            "review_score": "1"
        },
        {
            "review_text": "Take Master Roshi from Dragonball  put him a blender with Duke Nukem pour it into a tray in the shape of a 70's poorly dubbed kung-fu movie add monsters and naked anime girls that shoot you for watching them poop   you get Shadow Warrior  and it is incredibly fun.  11/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Recommended if you like games like Classic Doom or Quake If you are going for the achievements, some are really easy to farm Like the kills, secret areas or the cookies. Just save and load again   9/10",
            "review_score": "1"
        },
        {
            "review_text": "Saw naked girl farting and doing #2...  Definitely recommend this game! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite game series and definitely a classic. I would definitely suggest this game to anyone who enjoys old school shooters as well as innuendo and cheesy jokes.",
            "review_score": "1"
        },
        {
            "review_text": "NOW ON SALE THERE IS NO REASON NOT TO BUY THIS!!!  Created in the footsteps of Duke Nukem 3D and Atomic, this embodies everything that made Duke so awesome, but throw in a slice of rude Asian jokes or jokes about Asia, as well as a slice of humour/violence as in Redneck Rampage (similar game to Duke and Shadow Warrior) and you have yourself one bad-♥♥♥, fun, addictive and insanely offensive game!  Also this game can easily be completed with just the Katana... ok well... not /easily/ but it can be done :P  So shut up and give Steam your moneyz!",
            "review_score": "1"
        },
        {
            "review_text": "While not quite as good as doom or duke 3d, Shadow Warrior still provides plenty of fun is still a great fps. Can't wait to try out the remake.",
            "review_score": "1"
        },
        {
            "review_text": "Fun old school fps. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Old-school FPS at its best. Not a an attempt to recreate it, not an homage, just the pure shooter goodness that we all loved before Y2K hit and things started going downhill.  Maze-like levels with lots of exploration, ammo/medkit management, secrets, and lots of angry enemies. Need I say more?  As far as actual contents go, this contains all the Shadow Warrior goodness that came out -- the base as well as both expansions. All optimized to run natively on modern machines, so no more DOSBox. Graphics got smoothed out and improved a bit, though they kindly left an option to stick to the classic textures. So yeah, runs fast and looks good -- all a classic fps fan needs!  Oh yeah, this package also includes the classic '97 version running through DOSBox. This is the same version that is available as a f2p title, and content-wise is an exact copy of the original Shadow Warrior compact disc from 16 years ago -- so 4 missions, and a full soundtrack. Expansion packs for the classic are freeware and can easily be added in.",
            "review_score": "1"
        },
        {
            "review_text": "Who Wanta Some Wang?   don't be weak as a baby fart, Buy this game now! or face GREAT DISHONOR!!!",
            "review_score": "1"
        },
        {
            "review_text": "It`s Fun (^_^ )",
            "review_score": "1"
        },
        {
            "review_text": "Very fun old school game, will recommend this!",
            "review_score": "1"
        },
        {
            "review_text": "It's amazing how nice it feels to play a 3DRealms retro FPS. The movement speed is incredibly high - as a result, the katana is actually useable and fun if you really need to save up on ammo or just feel like goofing around.  If you don't like the idea of 1990s shooters where you can put yourself in a pretty bad spot by taking too much damage and running the map out of health kits, scrounging around for hidden secret items, this isn't for you.  The modern port is quite nice. Options, textures, plays smooth and as expected.",
            "review_score": "1"
        },
        {
            "review_text": "lo wang shadow warrior is soo freaking cool ! big weapons like automatic shotgun and anime posters  +fast paced fps +badass enemies +lo wang one liners  10/10 sword ! thats my personal weapon",
            "review_score": "1"
        },
        {
            "review_text": "Why I recommend this game?  Sliced many evil ninjas in half. Got to drive Speed Racer's car. Learned many ancient Chinese Secret. Creeped up on Master's naked waifus, one waifu shot at me with uzi. Bred hundreds of little rabits 'till they grew and ♥♥♥♥ed to death. (Literally). Almost got killed by not an ordinary rabbit; because it had sharp, pointy teeth... Hoping to meet Sailor Moon one day.   -Great catchphrases! -Awesome selection of weapons ranging from Katana to Nuclear Missile. -Intense old-school kill 'em all game.     Whooo still not-to buy Wang??",
            "review_score": "1"
        },
        {
            "review_text": "+Nice classic game +Working on Linux +More enjoyable than new dull shooter with graphic and with nothing more",
            "review_score": "1"
        },
        {
            "review_text": "Yes, yes, yes, yes. You must buy this game.  Another classic game from the golden era of FPS games together with Doom, Quake, Wolfenstein and the mighty Duke Nukem.  The humor and references are top notch, the level design is fantastic, the game is challenging and thankfully does not hold your bloody hand. This was back when 12 year old kids was not the target audience. I highly recommend this game to any FPS fan, there's many hours worth of gameplay and fun in Shadow Warrior!",
            "review_score": "1"
        },
        {
            "review_text": "This was good, beautiful graphics (joke) it's a game from 1997. Much the same feel like Duke Nukem 3D.  With very wrong 1 liners and classic 90s gameplay. It's still worth buying, doh do it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior Classic Redux  If you enjoyed Duke3D then you should enjoy this. Its just as good if not better. Its the Asian version of Duke3D.  The weapons are great: Katana or Fists, Shuriken, Riot shotgun, Uzi (+dual wield), Grenade launcher and rocket launcher, Sticky bombs (stick to any surface including enemies), Railgun, Guardian head (the head of an enemy that shoots fire), Ripper heart (heart of an enemy that can make a clone of you).  Powerups: fortune cookies give health boost, armor, Nuclear bombs, Heatseeker cards for rocket launcher.  Interesting enemies like female warriors, Sumos, even ghosts.  There is less nudity than Duke3D, the girls are anime girls.  Keys can be used multiple times, you have the keyscards but you also have keys for locks.  The game is more fast-paced than Duke3D but at the same time easier. My main weapon in Duke3D was a shotgun, in Shadow Warrior its the dual Uzi.  Bosses are also easier, not giant alien monsters.",
            "review_score": "1"
        },
        {
            "review_text": "In order to properly describe my experience with this game, I'll quote Nicolas Cage's character from The Wicker Man:  'OH, NO! NOT THE BEES! NOT THE BEES! AAAAAHHHHH! OH, THEY'RE IN MY EYES! MY EYES! AAAAHHHHH! AAAAAGGHHH!'   Also, Vsync is broken and makes the mouse motions less fluid - this thing must be American-made. Also, the fortune cookies are right: you are never going to score.  Overall, Wang/10, buy now.",
            "review_score": "1"
        },
        {
            "review_text": "When hung low, go gung ho.     Sorry I'm barely in it and it's already got me making puns.     Seriously though, you play an old, asian guy who drops one liners whilst slashing/shooting/blowing ♥♥♥♥ up, that's a winning combo right there.",
            "review_score": "1"
        },
        {
            "review_text": "A ninja knows no fear",
            "review_score": "1"
        },
        {
            "review_text": "DO YOU WANT TO WASH WANG? OR DO YOU WANT TO WATCH WANG WASH WANG?  Fast classic FPS with a sympathic, badass Ninja 'The Shadow Warrior' Lo Wang. Many nice designed setpieces *Japanese Style*, different cool enemys and badass guns. And of course 'MY SWORD, IT'S A PERSONAL WEAPON!' The mechanics used to be fast and satisfying to use - and they do so! Get this old classic with it's charme and of course - Master Lo Wang!   A NINJA KNOWS NO FEAR!",
            "review_score": "1"
        },
        {
            "review_text": "A great game even by today's standards, if you liked duke nukem 3d give this one a try!",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior recipe: 5 Parts Duke Nukem 1 Part Serious Sam A drop of LSD  Bake until your toasted.  Add a drop of level editor, some steam cards and achieves.    7/10 (-1 for no multiplayer, -1 for being YAFPS (Yet Another First Person Shooter), +1 for more Wang) = 6/10 Buy when it's $5 or less.",
            "review_score": "1"
        },
        {
            "review_text": "Flawless remaster.",
            "review_score": "1"
        },
        {
            "review_text": "This like duke nukem 3D Megaton edition are the best ports of classic games that ive played mainly because they took time and the result is awsome. BUY IT",
            "review_score": "1"
        },
        {
            "review_text": "Alright i just Read the negitive comments and these filthy casuals dont understand how amazing and ♥♥♥♥ing awesome this game is. its a childhood memory to a lot of us. but this game is funny and fluid ammount of action. its not sexist or whatever people keep saying its just mother ♥♥♥♥in Lo wang what more reason do you need for this game? if not go back to playing cod you filthy subhuman casuals",
            "review_score": "1"
        },
        {
            "review_text": "I recently got this game on sale for a dollar, it's such a fun game! If you like Duke Nukem, you'll enjoy this! It includes: The original DOS game, Redux Version and 2 expansion packs. Worth. Every. Penny. Great Comedic Dialogue, Levels and Weapons.  FEEL THE WANG INSIDE YOU",
            "review_score": "1"
        },
        {
            "review_text": "OK Shadow Warrior is one of my favorite games i played as a kid, so i definitely put in more hours shown. I always loved the blunt racism, sexism, and attitude, like Duke Nukem 3d, and of course the gameplay and level design are top notch :) I highly recommend this game to anyone who likes the classic FPS games like Doom, Quake, Duke3D, and Blood. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Love Shadow Warrior Classic game, its awesome, the gameplay mecanics like Doom and Duke Nukem 3D, the scenarios, music, enemies, gore of the game, it awesome.  It kicks more ♥♥♥ than DN3D xD but Doom 1 and 2 are still better :P",
            "review_score": "1"
        },
        {
            "review_text": "A nice alternative to Duke Nukem 3D. Maybe not as memoriable, but tries a few new things. Enemies and weapons are a little more varied, which makes it feel like the same game, but not the same game at the same time. Levels and locations are also really great and fun to look at and explore.",
            "review_score": "1"
        },
        {
            "review_text": "The ultimate weeaboo simulator. You can finally hone those dormant katana skills you've been itching to bust out.",
            "review_score": "1"
        },
        {
            "review_text": "This is basically Duke Nukem 3D 2. While Duke Nukem parodied old action and horror movies, Shadow Warrior parodies martial art movies and asian culture.",
            "review_score": "1"
        },
        {
            "review_text": "Crazy good fun. Make sure to check out the awesome expansion (w.d.)",
            "review_score": "1"
        },
        {
            "review_text": "Everyone should get on this wang!",
            "review_score": "1"
        },
        {
            "review_text": "This port isn't quite on the same level as Duke Nukem 3D. It has a few glaring issues, like stuttering (even on a modern computer) and some random crashes. About the game itself: I understand this is a very old shooter, but the game has a very obnoxious key-hunting aspect, and although it has a lot of guns, you will be using the same 2 (or 1, since the Uzi runs out of bullets really fast) for most of the game. Enemies are unbalanced, so they're either too weak or too strong.",
            "review_score": "-1"
        },
        {
            "review_text": "for some reason, the game won't allow mouse controls on my Steam Controller, thus making it impossible to play for me.",
            "review_score": "-1"
        },
        {
            "review_text": "Re-edited this review. Was thumbs up, now is thumbs down. The game is full of bugs, every single day is a new bug.  Old school FPS. Duke Nukem 3D improved.  It is all about shooting and goofy jokes with oriental pop culture.  The only problem, has no multi-player.",
            "review_score": "-1"
        },
        {
            "review_text": "About the Linux port:  Terrible:  - It crashes almost every time I play it.  - The game settings doesn't keep saved and I have to adjust them every time I play, well more than that because of the crashes.  Even with this, I still recomend this game if you have other plattform or you love Duke Nukem (like me). The game deserves a try.  Edit:  I gave it another chance:  - I play it on normal mode (I was playing on hard), so I don't have to restart/reload so often since I die less. This way I'm avoiding the known load game crash.  - I put my settings and then quit the game (menu-&gt;quit game). This way my settings remain and I don't have to go to settings each time I init the game.  Much more playable and enjoyable.",
            "review_score": "-1"
        },
        {
            "review_text": "Find a key to open a door to find a key to open a door to find a key to open a door to the end of the level. But at least the levels are really varied and full of interesting pahahahahaha yeah it's boring 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "I do not recommend this game",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just meh. Not very thrilling to play at all. I prefer Doom over this game by a longshot",
            "review_score": "-1"
        },
        {
            "review_text": "If your familiar with the antics of Duke Nukem 3D and liked it you will love this game too",
            "review_score": "1"
        },
        {
            "review_text": "You no mess with Lo Wang!",
            "review_score": "1"
        },
        {
            "review_text": "I started out really disliking Shadow Warrior. It felt like just Duke Nukem 3D Map Pack with a stupid character added in... boy was I wrong. I played the first 5 minutes groaning in regret of my purchase, then it hit me. Or I hit an enemy and the achievement counter started for 'More Personal Weapon'. I questioned this newfound discovery until I realized.. 'Wang prefer sword, more personal weapon' Then the anime girls with Uzis that made NO SENSE appeared and I was hooked. After having beat the first part of the game, it feels like opposites. Where Duke Nukem had easy to use weapons, but intricately designed levels, Shadow Warrior has relatively more simple levels but an intricate combat system. Each weapon has an alternate fire, to great effect, even giving you the ability to launch a nuke. Shruikens are speedy spreading projectiles, but the fact that you can recover them from walls makes their weakness actually usefull, since you'll almost always have ammo, a 4 barreled ♥♥♥♥ing shotgun, dual weild innaccurate weapons. The flow of combat deviates, although slightly, from Duke Nukem 3D, which makes, gameplay wise, a more independent game fun rather than living in the shadow of it's predecessor. Lu Wang suprised me with his humor. Once again, I started off disliking him, but once the one liners struck, I was hooked. If you're thinking about getting Shadow Warrior, but scared because it'd just be like Duke Nukem, I say buy it. It's different enough to stand alone, yet similar enough to give you the same rush.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful graphics and gameplay. *_*",
            "review_score": "1"
        },
        {
            "review_text": "This is a great classic game if you love classic FPSes. Worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "'You are half the man you used to be!'  This game is a classic. You should definately buy it if you love the Build engine or are a fan of classic FPSes like DooM or Duke 3D",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game. You can make bunnies have sex.",
            "review_score": "1"
        },
        {
            "review_text": "I've never played any old-school shotters, besides a free 'DOOM' trial on xbox (*shudder*). This game, though. It's great.   It comes with two versions, the original (complete with nostalgic old-school PC game startup) and the remake, which I recommend. The newer version comes with slightly better textures, and much better mouse control and HUD.   If you've never played an older shooter, I recommend this game above all others. It's a classic, and therefore means the maze-like corridors of random space bases and ninja forts will confuse you to no end. But the challenge is rearding; after playing the first level probably 10 times, I finally knew every secret and hidden area.  It's a great package, best if on sale. Also comes with a map editor. Beware of stereotypes.  Rate: 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I thought I was the only kid who had this game. It was pretty edgy... But in my world at least it maintained a low profile...  I just remember finding a secret room where rabbits were 'multiplying' like crazy....  If you can tolerate 90s FPS game then play this.",
            "review_score": "1"
        },
        {
            "review_text": "love it ! Grand Master Wang to the rescue !",
            "review_score": "1"
        },
        {
            "review_text": "Another classic 90s shooter. It has great level design, one liners, weapons, and enemies. This revamped version is superior to the DOS-BOX version and is still being patched (they fixed the only bug I encountered). Must play, 10/10. I also recommend Duke Nukem 3D Megaton Edition and Blood: One Unit Whole Blood.",
            "review_score": "1"
        },
        {
            "review_text": "amazing game a must have",
            "review_score": "1"
        },
        {
            "review_text": "You won't regret playing with Lo Wang",
            "review_score": "1"
        },
        {
            "review_text": "An exceptionally fun game that can easily beat many modern military shooters in the entertainment factor. What it lacks in graphics it makes up for in stupidly fun gameplay. You don't get walked through it like many you do in many FPS games now days and you can explore the brilliantly made levels and find a plethora of secrets that can give you that edge you need. Totally worth the money in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "'The definitive version of the cult classic shooter, Shadow Warrior Classic Redux features remastered visuals and two massive expansion packs. Corporations rule every facet of life in a near-future Japan and employ Shadow Warriors, one-man armies of unparalleled skill, to protect their power' - Shadow Warrior Classic Redux.   I've always been a fan of the old 90's shoot em up games. I remember Duke Nukem, Shadow Warrior and Doom 1+2 as fun and exciting games where level design and graphics blew my mind. Now we are so lucky to get remastered version on all of these game and yes I still enjoy them!   Shadow Warrior Classic Redux gives you a lot of content. 2 base episode + 2 expansion episodes. Each episode has around 10-20 levels. Each level is designed well and feels open with different paths. The maps are big and filled with secrets and easter eggs (which I love). Graphics looks good and it runs easily with 400 fps. The game itself launches without problems and doesn't crash at all. Widescreen support is also very handy! The gameplay is fun and exciting. It plays like Duke Nukem and Doom where you have to get to exit on each map. Find keys to unlock doors, solve puzzles and defeat many different enemies on your path with a big arsenal of guns (smgs, shotguns, rpg's, katana etc.). The game might be hard for someone unfamiliar with old school shooters, so don't rush it. You need all them health packs and armour pickups ;)  If you are a big fan of the old games and just wanna have a nostalgic feeling, buy this game! It's cheap and offers a lot of content. The game got humour, gore, run and gun, big maps, a vast of different enemies and guns, secrets and most important it offers a lot of fun!  Get hyped for Shadow Warrior 2! :D",
            "review_score": "1"
        },
        {
            "review_text": "'Man who stand on toilet, high on pot'",
            "review_score": "1"
        },
        {
            "review_text": "I only finished episode 1, but thi game is amazing. Great level design, challenging enemies and a awesome soundtrack. A great game if you like fps games, especially if you like 90's fps games.",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior is my all time favourite game.   Nostalgia fueled opinions aside, it has amazing level design, fun gunplay and some witty one-liners. Overall, it's a blast from the past kind of experience that runs on modern operating systems (yup, even your nans PC) and has convinced some very clever people that two sequels were worth making. Fair do, that.",
            "review_score": "1"
        },
        {
            "review_text": "'It's an Asian Duke Nukem 3d.' Is what some people might describe this game as, and they're partly right, but only partly...  This game, which came out in 1997, was easily one of the best shoot'em ups in its time, considering the fact that it was made in one of the finest gaming studios which prided itself in FPS way back when, 3DRealms.  The game has recently been given a complete overhaul in almost all aspects, modernizing alot of features and content while leaving a greater portion of it untouched and only improved when needed, and it feels WAY better than it did years ago. If there's ever a definitive example of a retouched masterpiece, look no further than this game right here.  I really wish alot more gaming studios took more care and resonsibility in revamping excellence to an all new high of their past franchises like this one.  If there is love in your heart for nonsensical, good ol' fashion FPS, Shadow Warrior and its lowbrow antics, samurai sword, uzis, shurikens, demons and all, will be a righteous addition to your gaming experience.  I certainly couldn't imagine a world without some Lo Wang in it. Now get on out there and chop up some Zilla scum!",
            "review_score": "1"
        },
        {
            "review_text": "'I like, sword; that's a personal weapon.'",
            "review_score": "1"
        },
        {
            "review_text": "Yes, this game is as good as they say. Designed with care, thought, sense of humor, and a high expectation for the player's skill and intelligence. If u want action this is it right here, it satisfies.",
            "review_score": "1"
        },
        {
            "review_text": "Go and grab it. Its such a good game, we need to keep alive iniciatives such this one to bring back really good games.",
            "review_score": "1"
        },
        {
            "review_text": "I missed out on this game back in the day, but I'm glad I can play it now.  This is how you fps.",
            "review_score": "1"
        },
        {
            "review_text": "Think if Duke Nukem had a japanese brother who knew how to kick ♥♥♥. This is a fun and funny game",
            "review_score": "1"
        },
        {
            "review_text": "This game feels nostalgic for me, even though I only played it for the first time recently. Fantastic older shooter, a perfect example of what made FPS of its time great. The 'redux' is a nice newer coat of paint, with a modern title screen and options menu, and significantly prettier in-game graphics and smoother controls.",
            "review_score": "1"
        },
        {
            "review_text": "OLD TIME FAVE AND STILL A FAVE, CANT ♥♥♥♥ WITH MY LO WANG!",
            "review_score": "1"
        },
        {
            "review_text": "Its a Must Buy",
            "review_score": "1"
        },
        {
            "review_text": "3D Realms most definitely achieved a marvel of FPS games with this one.  Insane, difficult and terrifically gory, fans of Duke Nukem will love this game! Works fantastically with newer computers delivering updated graphics and resolutions whilst still maintaining the original aspects of the game that made it work so very well. Tons of secrets to find, a great variety of weapons to use and awesome level design, you'll most certainly enjoy this game - pick it up whilst it's on sale, it's a fantastic game!",
            "review_score": "1"
        },
        {
            "review_text": "I missed this game, redone quite well considering the yr it's from. Reminds me of the golden age of FPS games, with some twisted humour. NOT for everyone, but if ur a duke nukem fan, it's a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Nice old game with OpenGL support. You no mess with Lo Wang! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "It may not have had as big of a spotlight as Duke Nukem 3D, but you have to ask yourself why it wouldn't be worth your time to run around with a katana and dual uzis killing undead ninjas.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a true classic.  In short: Pros: + Long Game(comparing to recent FPS games; I played for 20 hours to achieve 100% completion, but then again i knew most secrets/maps/enemy placement) + A varied arsenal, with most weapons being useful + References to popular and less popular Anime titles(i.e. Slayers) + Humor + Challenging + Additional maps/Total conversions/Map Packs are available to download(Not through Steam though) + Map Editor is included  Cons: - Steam Version adds several bugs - No MP support through Steam(but there are still methods for it) ",
            "review_score": "1"
        },
        {
            "review_text": "Old game but by no means irrelevant, modern games could take a page out of old games books. I love the shadow warrior series",
            "review_score": "1"
        },
        {
            "review_text": "March 2015 - still much much better than all Call of Dummy games",
            "review_score": "1"
        },
        {
            "review_text": "9/10  The classic was already awesome. This Classic Redux version is even more awesome. With improved graphics, better controls and two expansions, the only thing that could make this even better than it already is, is multiplayer. When multiplayer is included for this game, then it'll truly be a masterpiece!",
            "review_score": "1"
        },
        {
            "review_text": "You no mess with Lo Wang!  This game is a total awesomeness. Lots of easter eggs, lots of one-liners, lots of guns and enemies ... Shoot like it´s 90´s. Yea, I know, the graphics. But it is not that bad, and if you consider yourself as a true gamer, you need to play this polished classic. Very well playable on gamepad.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great fun but not as polished or entertaining as Duke Nukem (done by the same developer). Similar to what I said in my Duke Nukem 3d review, make some settings tweaks to help make the classic version more playable as the lighting isn't as dark as it should be - no need for night vision here.   A few funny secrets scattered here and there provide a couple of laughs. Using the sword is feels great. The one level set is annoying to play as many of the standard zilla mobs are replaced by generic chinese dudes with little bowler hats and they constantly make this obnoxius HNNGYAAHHH sound every 2 seconds until you kill them.",
            "review_score": "1"
        },
        {
            "review_text": "I remember this and duke 3D from back in the day, I got the package on sale and it was worth the trip down memory lane! I havent went through the game again yet but I look forward to it.",
            "review_score": "1"
        },
        {
            "review_text": "I'd not played this back in the day, but it reminded me of the days of Doom and the like. Quite enjoyed the gameplay and style. It was a blast and fun, but hated the jumping puzzles whihc just remind me os side scrollers and I hate them. Otherwise it was fun.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "ANCIENT CHINESE SECRET!!!",
            "review_score": "1"
        },
        {
            "review_text": "Definetly a great old school shooter.  Pros: -Great arsenal of weapons compared to Duke Nukem. The Uzis are good for fast enemies and the missile launcher and grenade launcher can blow up enemies to pieces. -Maps are maze like with keycards to open the next area. It never gets confusing and I never had to look up a walkthrough to find out where to go. -FOV slider -Great environments from ancient Japan like levels to Japanese towns. -The graphics are appealing -When you blow up an enemy his body parts fly in the air. -Some weapons have an alternative fire. For example the riot gun can fire one shell or 6 shells consecutively. You can fire 2 Uzis or one. You can use regular missiles or heat sinking missiles (with a power up) or a nuke. This would be used in Half Life which came out the following year.  Cons -Sometimes your grenade launcher will make fire on the ground where you have to backtrack and you will occasionally take damage from touching it. -The default mouse controls are awful but can be fixed by changing the X-axis scale and Y-Axis scale. -Every single line out of Lo Wang is a joke referring to his giant wang. He gets annoying quickly. You basically play as an old bad ♥♥♥ pervert. Also he speaks in broken English. You can always turn off his voice though. -The story is not really that good. Yes this is a 90's game but it came out a year before Half Life.  This is the last game 3d Realms developed before Duke Nukem Forever. It is a great goodbye to the end of an era of old school shooters. If you liked Duke Nukem you might like this game. I say might because I think Duke is a more appealing character for some reason. Whatever the case, Shadow Warrior Classic Redux has great level design, great weapons with alternative fire, and plenty of secrets to find.",
            "review_score": "1"
        },
        {
            "review_text": "An entertaining retro game, it reminds me duke nukem, but with chinese balls",
            "review_score": "1"
        },
        {
            "review_text": "'Ahh, better than acupuncture.' 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Awsome game, you have to search for some buttons and items and that is sometimes anoying. Gr8 for my low-end Macbook. Get it 90% off when on sale!",
            "review_score": "1"
        },
        {
            "review_text": "For less than one american dollar on sale, Shadow Warrior will offer you hours of intricate level design, challenging gameplay, and hilarious level design in what many would consider a lesser-known FPS shooter in the same vein of Doom, Wolfenstein, and Duke Nukem. Though it was overshadowed by its successors, its values surrounding diverse weapons, enemies, and dialogue are not to be understated. As is the nature of these older FPS, don't expect a great deal of variety in combat. The enemies can get challenging and the tasks repetitive, but the combat is mostly the same. Fans seeking a nostalgic FPS with some of the funniest one-liners in gaming history should pony up for a couple hours of fun.   If you're not convinced by the overwhelming amount of praise, you can check out the original 1997 version of the game for FREE.",
            "review_score": "1"
        },
        {
            "review_text": "Quick paced, fun, balanced. Levels are well planned (a lot of going back and forth though, need to find the keys/the door was 500 meters back etc.)  Lo Wang says, play or watch Wang wash Wang.",
            "review_score": "1"
        },
        {
            "review_text": "This game is basically a asian Duke Nukem. It's still a great game and I totally recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Shadow Warrior Redux is a fantastic bundle. It comes with all of the dlc, a map editor, and a improved version of the original game. I would without a doubt recommend picking this up, especially if you are a fan of any of the other shadow warrior games.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome, it plays great and always keeps me coming back.",
            "review_score": "1"
        },
        {
            "review_text": "In the end, I would recommend this game for modern gamers that can still enjoy DOOM style 'find the key, unlock the door' type of gameplay. The humor, art direction, and general badassery make it a very memorable experience.   Story time: In case you didn't know, Steam offers a DOSBox version of this game for free (The original 1997 version). I installed and played the first level of the original, but had to stop because of how poorly the graphics and menu/saving systems have aged over the years. I then discovered this remake and picked it up on a sale. This remake fixed every issue I had with the original DOS version, which is great because now I get to enjoy and old '97 classic in 2016.  Visually, the remake brings the old look of the original game up to modern HD standards. Think Half-Life or Quake style 3D environments with DOOM style 2D sprites. The run and gun action is pretty solid and the humor is pretty great (even if it's extremely racist). The story takes a back seat, but that's not really why anyone would play this game.  Also with this remake, you get access to the Twin Dragon and Wanton Destruction expansions (though you cannot access them in the base game's menu system which makes no sense to me). Overall, there's probably about 15-20 hours of gameplay in all of Classic Redux.  The biggest issue with the game overall is the confusing and cryptic level design. While this is a DOOM clone, the levels aren't nearly as spacious or sprawling as DOOM or DOOM II. The design is very, very dense with lots of backtracking and random puzzles. I had to use a guide in about every other level just to get through. While the design is annoying, I still enjoyed the game overall. I completed the base game and Twin Dragon but was turned off by the level design and had no interest in starting up Wanton Destruction (Twin Dragon has really confusing level progression to the point of extreme frustration).   A great remake of the original Shadow Warrior: 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Worth buying it.",
            "review_score": "1"
        },
        {
            "review_text": "Wishing I was an eighties kid. I often go back and play classic fps titles such as The Classic Doom, Shadow Warrior Classic, Blood and Duke Nukem 3D. These games don't give me nostalgia but they make me depressed about how the fps genre has taken a turn for the worst.   This Shadow Warrior Classic Redux gives me the chance to be able experience game mechanics that were common 'back in the day'. From the fixed health system, keycard hunting, beautifully made sprites, actually challenging in a fair way (if you die it's your fault), SECRETS (I love having to discover a secret randomly as I just happen to stumble upon it) and the many effective and fun weapons at your disposal (You can carry them all at the same time! Bring this back to the modern day shooters please! XD).   So far this game has been enjoyable for the most part, The level design can sometimes be overwhelming to a newcomer to these types of games (as I was when I was first playing Doom. I had no idea where to go.) but just exploring around making sure you didn't miss a door or a keycard somewhere is not too tedious as you just need to go where there are no corpses of your enemy and then mark that place with the corpses of your enemy to know that you've been there before.   I'd recommend this game to anyone who'd want to experience games as they were way back when. If you don't like this game I guess there's too much wang for you to handle.",
            "review_score": "1"
        }
    ]
}