{
    "app_id": 225260,
    "name": "Brutal Legend",
    "release_date": "2013-02-26",
    "developer": [
        "Double Fine Productions"
    ],
    "publisher": [
        "Double Fine Productions"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Strategy"
    ],
    "tags": [
        "Action",
        "Comedy",
        "Adventure"
    ],
    "achievements": 59,
    "positive_ratings": 12816,
    "negative_ratings": 905,
    "price": 10.99,
    "description": "Brütal Legend is an action-adventure that marries visceral action combat with open-world freedom. Set in a universe somewhere between Lord of the Rings and Spinal Tap, it’s a fresh take on the action/driving genre, which in this case is full of imitation cover bands, demons intent on enslaving humanity and Heavy metal tunes.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/225260/header.jpg?t=1479167529",
    "minimum_requirements": "OS:Windows XP SP3 Processor:Intel Core 2 Duo at 2.2 GHz, or AMD Athlon 64 at 2.2 GHz Memory:1 GB RAM Graphics:512 MB GeForce 220, Radeon 4550, Intel HD 3000 Graphics DirectX®:9.0c Hard Drive:8 GB HD space Sound:DirectX Compatible Sound Card Other Requirements:Broadband Internet connection",
    "recommended_requirements": "OS:Windows 7 Processor:Intel i5 Duo at 2.5 GHz, or AMD FX 3.5 GHz Memory:2 GB RAM Graphics:512 MB GeForce 650, Radeon 7000 DirectX®:9.0c Hard Drive:8 GB HD space Sound:DirectX Compatible Sound Card Other Requirements:Broadband Internet connection",
    "reviews": [
        {
            "review_text": "Like Metal?   Buy this game.   Like Jack Black?   Of course you do. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Brütal Legend is a game for metalheads. Yoü play metal, yoü listen to metal, yoü ARE the metal. I don't think any other game has managed to so completely immerse the player in a concept and create süch a rich game world. The art direction at Doüble Fine is simply amazing.  The game itself is rather üniqüe, combining an open world third-person action game with real time strategy. Ünfortünately düring the original release, EA's advertising glossed over the RTS aspect, leading many players who were expecting a straight action game to be confüsed and disappointed. Controlling troops from a third-person perspective may not be as flexible as a normal RTS and it does take some getting üsed to, büt it works well for what its intended for in the game.  The müsic in the game and the long list of big name voice actors really help draw yoü into the game. Even thoügh I don't particülarly like most of the bands that are featüred in the game, the müsic fits so well that I can enjoy it anyway. Brütal Legend even has the most perfectly placed song I've ever heard in a game düring one of the cütscenes, thoügh I can't stand listening to it oütside the game.  One problem some people may have is that Jack Black plays the main character. I can assüre yoü that it is not a problem. Eddie Rigg's character is Jack Black playing Jack Black, büt written by Doüble Fine so there is none of Jack Black's classic stüpidity. Ünless yoü cringe at the soünd of Jack Black's voice, I think yoü'll be able to enjoy the game jüst fine.  My only disappointments are that the story felt like it ended rather süddenly when I thoüght it was only halfway throügh, the side missions get rather repetitive, and Doüble Fine doesn't have the fünds to make a seqüel. Hopefülly that will come in the fütüre.  To süm üp: play this game! Everyone needs more metal in their lives.",
            "review_score": "1"
        },
        {
            "review_text": "I could make a three hour long rant about how much I adore this game, but it all boils down to this:   If you like exploring beautifully designed worlds, killing stuff, and Jack Black, then this game is DEFINITELY for you.",
            "review_score": "1"
        },
        {
            "review_text": "Fan of metal music? Rock music? BOTH? Well you're in luck! This game combines these genres, in their widest and most well-selected form (107 songs from 75 bands, aside from the game's own soundtrack), with a fantastic game based around the world of rock and metal music!   This game is worth playing for the music alone, but the storyline, setting, and gameplay are also fantastic. I'm not going to sit here and tell you why, it's an experience.. so go experience it for yourself!  Features characters based on and voiced by musicians like Jack Black &amp; Kyle Gass (Tenacious D), Lemmy Kilmister (Motörhead), Ozzy Osbourne (like you don't know who that is), and many more!  EDIT: Also look at my hours played.. I really mean the things I wrote up there!",
            "review_score": "1"
        },
        {
            "review_text": "In the 42 minutes I have played this game I've lost count of how many times I've raised the horns because of how metal this ♥♥♥♥ing ♥♥♥♥ is.",
            "review_score": "1"
        },
        {
            "review_text": "Brutal Legend can be the greatest tribute ever made to the Heavy Metal music genre. The landscape, the characters, the history, the gameplay and of course the soundtrack merges brilliantly to deliver a game that is a must play for fans of the genre.  Although the RTS can be annoying at some times, it is easy to get the hang of it. The playability on the controller is infinitely simpler than on the PC, so I strongly recommend you take out the dust of your joypad for this one.  To summarize, ♥♥♥♥ING EPIC!!!  PS.: As many have stated, yes, you can ride a mammoth. And a black panther that shoots lasers through his eyes.",
            "review_score": "1"
        },
        {
            "review_text": "Metal, Noise, Fire, and Blood!  Play it for the love of Metal God.",
            "review_score": "1"
        },
        {
            "review_text": "Damn, I would love to love this game. Seriously. The music kicks ♥♥♥. Jack Black kicks ♥♥♥. The visuals are stunning - as if they'd built the whole game using every single rock and metal album cover and made the world out of it.  However mechanics-wise, it's terrible. The game begins as a sub-par-to-decent third person brawler (with a guitar as a ranged weapon, brilliant!). But somewhere along the line, it becomes some kind of a racing sim. Huh, ok. And then it settles on being a kind of RTS, and a terrible one at that. You need to physically move your character near the units you need to move and there's no visual cue whatsoever to tell you what units, exactly, will be affected by your commands, meaning you end up selecting either too few, or too many.  That game had a LOT of potential but it's the designer team had too many cool ideas and ended up implementing none of them properly.",
            "review_score": "-1"
        },
        {
            "review_text": "jack black screamed at me and I got scared",
            "review_score": "1"
        },
        {
            "review_text": "DO YOU LIKE THE METAL?  DO YOU LIKE BUTTON MASHING?  BRUTAL LEGEND IS FOR YOU.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Metal there's no mistake with this.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say.... this game is badass fun! \\m/  Basically Brutal Legend is an open-world game with a very heavy influence of rock and metal music, and whilst that may sound like an odd combination is really does work. I was sceptical at first, but everytime I played the game I genuinely had fun. The humour and the music are pure joy and will keep you coming back for more.  8 devil horns out of 10 \\m/",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that not everyone can enjoy.  Personally, I loved this game.  I love the humor, the gore, the music, this game has a lot of great stuff. The only thing I don´t like is, in some areas you might run around trying to figure out what to do for very long, more then you should. That can be just me being a dumbo though.  So in short, must buy for the hardcore Metal fans.",
            "review_score": "1"
        },
        {
            "review_text": "I wish that Jack Black was in more games. Brütal Legend is an open world, action RPG from Double Fine Productions. Let’s get rocking.  The Good  I think the obvious answer to this is Jack Black.  If you’re a fan of Tenacious D, this game is pretty much Tenacious D: The Game.  The soundtrack is fantastic. Whether you’re cruising around in the Deuce or just wandering around seeing the sights, the blend of well known metal music and original composition is glorious.  There is a satisfyingly ample amount of items for you to unlock in the “Motor Forge”. Their are weapon upgrades for the Deuce, weapon upgrades for your character, and additional attacks to use. There are also purely cosmetic items to acquire, however, like paint jobs, new clothes, and giant stone heads.  There is a large array of enemies for you to hack to pieces as well as indigenous fauna for you to harass. All the designs are brilliant and very much metal influenced.  The story is great, the dialogue is funny, and the game never takes itself to seriously. This is a trait which we don’t see enough these days.  The map is surprisingly big and makes for a good amount of exploration.  The Bad  I’ve got nothing here, sorry.  The Meh  There’s no DLC, so, once the game is over, it’s over. This makes me a sad panda.  Verdict: Yea  If you’re a fan of jack Black, Tenacious D, or metal music, then BL is very much the game for you. You can pick it up in the Steam Store at your earliest convenience. It is money that you won’t regret spending. As always, thanks for reading.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most interesting games I ever played and it is immensely funny too.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of metal then you will love this game. You get to kill demons with an axe and a guitar and lead a powerful army. There is a lot of metal music in the game and a lot of references to metal bands. Jack Black, Kyle Gass, Rob Halford, Lita Ford, Ozzy osbourne, Lemmy Kilmister, and Tim Curry are voice actors in this game. Rest in peace Lemmy.",
            "review_score": "1"
        },
        {
            "review_text": "This game.......Is F..... Awesome!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun and goofy, the game is worth playing. However, its controls are terrible, and the driving mechanics are rage-inducing. I can't even begin to think about the number of driving escort missions I failed multiple times in a row just because I was stuck on geometry and had to spend a minute or more trying to maneuver my way around so I could *maybe* get back on the path.  The game felt short, and after the final boss fight, I felt happy to see what the next area would be like, only to find myself watching the end credits. I felt like the game ended abruptly, either because they ran out of time, or because they're saving stuff for Brütal Legends 2. Either way, if it's on sale, give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Very good at being a tribute to metal. Not very good at being a fun game.   I mean, it seemed a lot of fun in the start, but the battles grew so terribly tedious, spammy and boring. It needed a proper rethink before it could be thought as decent.  But I'd recommend it, just because of a very heartfelt tribute to metal music, which is definietly worth seeing for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "The best game I've gotten at a sale price on Steam!",
            "review_score": "1"
        },
        {
            "review_text": "[8.1/10]   This game is the perfect ode to metal ! I love this game not because i'm a die-hard fan of rock and metal. it's really great. packed full with BRILLIANT metal soundtrack, hilarious dialogue and memorable characters.  Unfortunately, combat system is horrible...",
            "review_score": "1"
        },
        {
            "review_text": "[8.1/10]   This game is the perfect ode to metal ! I love this game not because i'm a die-hard fan of rock and metal. it's really great. packed full with BRILLIANT metal soundtrack, hilarious dialogue and memorable characters.  Unfortunately, combat system is horrible...",
            "review_score": "1"
        },
        {
            "review_text": "If you like Action, Gore, Brutality and (of course) Heavy Metal Style then this is the game that you'll regret if you've never play this game. And this game comes with Anti-Explicits and Blood function, so you can have your kids play this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game has everything a metal enthusiast's heart desires, but it doesn't stop there. From the trailers I have seen back when it came out in 2009 I expected a funny, metal infused comedy put into a videogame, but I got so much more than that.   You would think that Jack Black and the all-star cast of voice actors is enough to sell the game but nuh-uh, there's more. The hilarious, epic and sometimes cheesy story works on so many levels if you ever had long hair, wore band shirts and maybe branched out to some make-up for the ultimate concert look. I never knew you could build up such a perfect metaphor for all the scenes and subgenres of Metal, yet it's no caricature and can stand perfectly on its own as a serious, comedic approach to the world of Metal music.  Your ears will be spoiled with a fine selection of shredding guitars from Classic Rock over Hair Metal to Black Metal. In the first hours into the game I thought it was all about Classic and Glam Rock, but when I heard Carcass pop up I creamed my jeans and will definitely go through my old records, since my mouth is watering for Metal again!  This game left me stunned after it ended and this is probably the only downside of it.  It has an end.  10 out of 10 metal horns!",
            "review_score": "1"
        },
        {
            "review_text": "A fun, humorous RPG with celebrities in it. this game has a unique storylinr but the gameplay itself is not very big. There is some RTS invovled in this game as well as it's small Open World Adventure. If you like heavy metal you will definitely like this game (i'm not a fan but i still enjoyed) although the game seemed to drag out at times and some parts felt like fillers to the story. I haven't completed this game as the gameplay isn't very enjoyable. Like when there was an army battle it was like 20 v 3 waves of 20 so it wasn't really fun, i prefer mass numbers where the troops are weak not small numbers wher everyone is strong. At times they were like yeh we got an Army of 10 and i was like wut this was anticlimatic. Jack Black 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great game. Beautiful graphics, a nice story. Gameplay and controls are tricky and I had to reduce the resolution of the game to be able to control the car (otherwise, it was impossible) and to have a good control feedback, but that aside, it is a great game!",
            "review_score": "1"
        },
        {
            "review_text": "'It's ♥♥♥♥ing awesome!'. That's pretty much all that can be said about this game. Buy it - you won't regret your choice.",
            "review_score": "1"
        },
        {
            "review_text": "Absolute must play action RPG with a kinda unique RTS play mode.  Never seen anything like, never been more fascinated by such a simple concept.  Played it three times so far, and will play again.  For the glory of Metal!",
            "review_score": "1"
        },
        {
            "review_text": "It's a MUST have ! :D",
            "review_score": "1"
        },
        {
            "review_text": "Best $1 game I played ever. It's like a combination of The Lord of Rings and Metal lol. Even though it's mainly an action game, it gets to RTS(not really) at some point where you can flying around and produce/command your troops from above. The entire story-line surprises me since by a look of it I thought it might be a few hours long to get to the end, where it in fact took a longer trip with more fun adventures. For the side quests I love the racing game the most, the upgrades for all the equipment and cars are aweeeeeesome, it's also funny to see the the metal of god brings something new to say everytime when you visit. I never thought someone could come up with such crazy ideas and put all the fun stuff together to make a game full of chaos, post apocalyptic and metal. Even though it's a one-time fun to play, it totally worths the money and will bring you lots of fun.",
            "review_score": "1"
        },
        {
            "review_text": "The best game for metalheads of all time!!",
            "review_score": "1"
        },
        {
            "review_text": "I'll spoil my review right now: Get this game. Get it now.   But only if... You love metal or love music. You love amazing vibrant art styles that ring out so powerfully from almost every other game ever made you'll be in awe the first time (and quite a few times after) you see it. From classic, classic metal visions of twisted earths with massive beasts with huge metal jaws, covered in spikes to sly slinky monsters that slither through black water towards you. This covers almost every genre of 'Metal' that exists.  This game is just pure briliance, and what else can you expect from Tim Schafer, creator of Psychonauts? (Well, except him being a complete jerk.) Jack Black alone makes the game worth playing, but expect to run in to many, MANY 'Rock Gods' on your journey. Like... Well, I won't ruin it. But if you're a fan of Black Sabbath...  The game isn't as perfect as I say it is, so I've got a few things to complain about so let me point out the major flaws.  This is the big one: The game transitions from being primarily a hack n' slash to a... RTS esque battling system. You still control Eddie (voice by Jack Black, duh.) and can still run around on foot (or drive around in car) and kick ♥♥♥. But you'll also be responsible for taking control points, commanding units and making sure you keep your resources up. Don't worry, it's NO WHERE near as complicated as most RTS games, but the change takes time to get used to.  A few of the later 'battles' can become very frustrating due to how some enemies work and how you are positioned to them. Mostly since you start with almost nothing and the enemies can start out full pelt. Especially on higher difficulties.  In fact, all I really have to complain about is the combat... But unfortunately, since that's what the gameplay is... It's a big one.   This game has done almost everything perfectly. The music, the visuals, the cameos, the voice acting, the 'solos' you learn and the story. The animated cutscenes you have to seek out yourself to learn the backround are gorgeous, the scenery is pure eye candy. It's truly a fantastic game.   Unfortunately, the combat itself will ruin the game for a lot of people. If you can adapt to it, (It's seriously not as bad as you think, but I have to be fair.) this game will be somewhere on your top games of all time.  Summary/TL;DR: I am in love with this game. It's gorgeous, in fact, some of it made me tear up a little.. But, it's flawed. It really is. Play this game if you want one of the greatest (top 5 easily) stylizations that's ever been in a video game and most likely ever will. Play this if you want FANTASTIC voice work. (For gadzooks, it has Tim Curry!) Play this if you want a great value for your money and to be sucked in to an amazing world that left me depressed for a full week after I finished it... Because there was no more, and most likely never will be.   I give this game an 3.75 out of 5.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I've missed creative fun games like this.Smooth gameplay creative story and creatures.You can tell the developers put a lot of love and thought into this game i appreciate that in games.   I definitely recommend ***  I have no complaints with the game.  ",
            "review_score": "1"
        },
        {
            "review_text": "this is a fantastic game the music, gameplay, comedy and the characters are fabulouse this is one of the best gamess I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "Legendary game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my all time favourite games, it's hard to put into words how much I love this game.  So I won't.  It's just incredible go play it  9.8/10  Brutal Legend 2 now &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "For starters i am going to ignore the controls and will bring them up a little further down.   Ignoring the controls the game is brilliant one of the best soundtracks i've ever heard in a game, classic jack black humour amazing scenery and atmosphere i truly felt like i was in a mystical place of rock and roll.  the whole commands and conqure esqe parts of the games are okay but occure way to often its a major part of the game and i felt like it should not of been i felt like it belongs along side the other side missions with the occasional one being a main mission because of these moments having crazy difficulty spikes i have gotten stuck in the game.  another reason is because of the controls, these have got to be in my opinion some of the worst controls i have ever come across in a port since saints row 2 pc port, both the keyboard controls and the controller controls while the button layout are decent the fluidity and stiffness of them drive me crazy and really suck me out of the game a lot ofthe time mainly in the RTS moments.   That being said, i have a feeling that the ps3 or 360 versions controlls are a lot of fluid. I do reccomend this game, but just not on PC",
            "review_score": "1"
        },
        {
            "review_text": "Really nice music and fun gameplay. Very lovely multiplayer also ;)",
            "review_score": "1"
        },
        {
            "review_text": "I played this game when its came out for xbox. Now i can enjoy this game forever on my pc! :) this is a fun, epic, hilarious adventure game with easy controls (recommend controller) with decent graphics and very artistic characters and landscapes. This is a very fun and you will not regret getting it!",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful romp. Plus who doesn't like Jack Black",
            "review_score": "1"
        },
        {
            "review_text": "Where do they get their cigarettes from?",
            "review_score": "1"
        },
        {
            "review_text": "Brutal Legend is an awesome game and I had much fun playing it. A compelling story, nice characters both protagonist and antagonist, great music (every single track, I'm serious), amazing locations, old-school air of rock and metal. I don't regret having bought this game, one bit. Rock'n'Roll, baby!",
            "review_score": "1"
        },
        {
            "review_text": "Just look at my time enough said.",
            "review_score": "1"
        },
        {
            "review_text": "So far i have not made it that far in this game (3 Bosses killed), from what ive seen so far it's pretty incredible. the choice of in game music is the best of the best metal you will ever hear, classics all the way around.",
            "review_score": "1"
        },
        {
            "review_text": "Brutal Legand Review -------------------------------  Story - 9 Gameplay - 8 Graphics - 8  OVerall - 9  Note - They got Jack Black. ' Nuff said...  Worth Buying - Yes",
            "review_score": "1"
        },
        {
            "review_text": "This game is Hard as metal...:D",
            "review_score": "1"
        },
        {
            "review_text": "Metal!!! This game is, great! I had to rebuy it becuase i lend my ps3 copy to someone and never got it back :-(  Now it's on sale, just get it!  Metal!",
            "review_score": "1"
        },
        {
            "review_text": "This is a great RPG/RTS blend that is funny too. You don't need to love metal to love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Just a day in the life of Jack Black.",
            "review_score": "1"
        },
        {
            "review_text": "That's f**g awecome!",
            "review_score": "1"
        },
        {
            "review_text": "This game is like a big awesome Metal party \\m/",
            "review_score": "1"
        },
        {
            "review_text": "no one can destroy the metal",
            "review_score": "1"
        },
        {
            "review_text": "A blast to play! Seems like it ended a little suddenly but the gameplay and atmosphere outway the quick ending.",
            "review_score": "1"
        },
        {
            "review_text": "Jack Black makes everything better",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Tim Schafer is an artist.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just awesome: you've got blood, fire, noise and metal with a soft touch of Aetulia's singing. The game really makes you believe that there was an age of metal (which would be awesome, though) with demons, titans, Ormagoden himself and humans. If anyone would take this seriously, it might even become a religion (or at least another evolution theory) for some.  It's amazing that this game has been released with all the good ideas, I'd really want to see a sequel to it with the ability to make Eddie fly when roaming all around the map, although it would be easier to find secrets that way. The limits of the map aren't natural when talking about exploring the game, though: you hit an invisible wall at some point, it feels like the map is made out of many open-sided boxes. But all of these improvements would work even better with separate campaigns for every main character: Eddie, normal/drowned Ophelia(s, spoilers, sorry), Doviculus, that glam hairstyle wearing Lionwhyte, maybe even Rignarok with Succoria, and the future characters, if any. Even though it's far fetched, it would make a great addition to the game. And, of course, a longer story - I've beaten this game in 8 hours straight. Must. Have. More.  So in short, the game is already epic, some improvements would work in favor of the game (unless it becomes worse like what happens with some game series - the writers get carried away), the story pulls you into the game and holds you tight until you ultimately finish the game with every achievement unlocked. The songs are picked pretty well, too. In the name of every metalhead in the world, Tim Schafer, please release a sequel!",
            "review_score": "1"
        },
        {
            "review_text": "Rock Step aside , THIS IS METAL !!! 666  Pros  1.Awesone casts and crews , from a famous actor like Jack Black to well known singers in an old school 70' Heavy metal scene like Lemmy, Rob Halford, Lita Ford, and Ozzy Osbourne.  2.Cool in - game music (soundtrack) included many types of metal songs from Heavy metal to Blackend Death metal , from Thrash metal to Symphonic Black metal.  3.NO POSER METAL - wanna be music like Metalcore , Deathcore and Screamo here !!! None.  4.Unique art direction , like 'Tim burton' style.  5.Featuring an RTS system with many units to choose.  6.A Lot of collectable items and secrets.  7.Good Storyline.  8.Guitar SOLOs !!!!!  Cons  1.Poor PC optimization , The graphic didnt look 'Sharp' , I imagined how awesome it will be if the color is vividly cool like Borderlands 2   2.Why Dont they let us use that 'wing' in free roaming :l  3.No pure 'Death metal' music , either Death metal or something more advance like Brutal Death metal.  4.Default songs are mostly Heavy and Thrash metal , in order to acquire those 'cool / rare' types such as Black metal , You need to find some relics / collectable items.   5.Bad Guiding system , no waypoint , just the destination marker.   You will surely ENJOY this game , IF you are a Metalhead , just like me (for 9 years ). Even if you are not, but ready to dive deep down into a fantasy world with hellish music in the background. Go for it !   8.5 / 10   666 'Devil's horn' 666",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game played it on the Xbox when it first came out, a MUST buy!!! for any Rock or Metal Fan!!!!",
            "review_score": "1"
        },
        {
            "review_text": "You can't kill the metal The metal will live on Punk-Rock tried to kill the metal But they failed, as they were smite to the ground New-wave tried to kill the metal But they failed, as they were stricken down to the ground Grunge tried to kill the metal Ha,hahahahaha They failed, as they were thrown to the ground Aargh! yeah! [x2]  [Singing]  No-one can destroy the metal The metal will strike you down with a vicious blow We are the vanquished foes of the metal We tried to win for why we do not know  New-wave tried to destroy the metal, but the metal had its way Grunge then tried to dethrone the metal, but metal was in the way Punk-rock tried to destroy the metal, but metal was much too strong Techno tried to defile the metal, but techno was proven wrong Yea!  Metal! It comes from hell! ",
            "review_score": "1"
        },
        {
            "review_text": "AWESOOOOOOOME!!! ...OME...OME...OME... ome ... e e e...   &lt;pants&gt; yeah... ITflippin Is. The dark gods of blood driven hardcore metal are summonimng you, head their call mortal. Even with some Nazi bull the americans put into this genre is certainly is one of those games you'll cherish.",
            "review_score": "1"
        },
        {
            "review_text": "For the price of it during sales, it's a pretty awesome game. Great music (if you're into rock/metal), pretty fun storyline, humourous, and they put in a lot of effort into creating the open game world with the metal music theme. Definately worth a play-through.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome for people who like metal!!",
            "review_score": "1"
        },
        {
            "review_text": "awsome game buy it now if you like tenacious d and jack black also if you ik erock",
            "review_score": "1"
        },
        {
            "review_text": "The mere act of buying this game caused me to listen to Iron Maiden's entire back catalogue, even the Paul Di'Anno ones.",
            "review_score": "1"
        },
        {
            "review_text": "Underrated",
            "review_score": "1"
        },
        {
            "review_text": "If you love Metal then you gonna love this too! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is METAL!!! The music's metal, the gameplay's metal, the WHOLE DAMN GAME'S PRACTICALLY BURSTING WITH MOLTEN METAL!!!! Buy it now, it's metal. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Ever felt like you were born in the wrong time ?  like when ? in the 70s ?  like in the early 70s when music was real.  Metal noise, blood and fire, tell me what you most desire.  8.7\\10 great RPG with open metal world :v and alot of rock\\metal elements and great soundtracks ;)",
            "review_score": "1"
        },
        {
            "review_text": "Play as a time traveling bard cast into a medieval world, where demonic overlords rule over humanity. Lead the uprising against the human colaborators, and then against the plague of the undead, while slowly gearing to a final confrontation with the demonic emperor himself.  Oh, and the bard has a guitar that sets people on fire, the humans are all Old-school metalheads, the devils are pure gore-metal inspired BDSM wearing fleshy-badassess, the Undead are depressed black Metal fans, with the best Tim Burton-esque gothic imagiry this side of gaming. Wage war in a both complex AND shallow RTS system with crazy units and a whole-lot of 'what is the counter system in this game???!' that makes increasingly less sense! Enjoy driving around listening to songs and being dissapointed when the journey ends because you want to listent to solo, but it just keeps giving and giving! Enjoy mashing two buttons and occassionaly running away crying because you are almost dead, and then coming back with vengence. RINSE AND REPEAT! and then, prepare to ignore all the problems of the game, because of the amazing soundtrack, amazing ladnscapes, AND ♥♥♥♥ING LEMMY KILMISTER! AND ♥♥♥♥ING ROB HALFORD! AND ♥♥♥♥iNG OZZY OSBOURNE! AND ♥♥♥♥ING METAL! Classic Heavy Metal, Speed Metal, Power Metal, Trash metal, Death metal, Black Metal, Industrial metal, Glam metal, Goth Metal, and even some Nu-metal, you ♥♥♥♥ing fake-♥♥♥ Infidel. It's not even ♥♥♥♥ing metal, you ♥♥♥♥♥♥♥!   You buy now, yes?",
            "review_score": "1"
        },
        {
            "review_text": ":horns:",
            "review_score": "1"
        },
        {
            "review_text": "Sandbox game which soundrack, topic and its icons compensate for the lack of content. The metal/rock music got their fully deserved tribute game which provided me with highly satsfying cultural experience!! \\../",
            "review_score": "1"
        },
        {
            "review_text": "You can't kill the metal The metal will live on Punk-Rock tried to kill the metal But they failed, as they were smite to the ground New-wave tried to kill the metal But they failed, as they were striken down to the ground Grunge tried to kill the metal Ha,hahahahaha They failed, as they were thrown to the ground",
            "review_score": "1"
        },
        {
            "review_text": "Lemmy. And Ozzy. And Jack Black.",
            "review_score": "1"
        },
        {
            "review_text": "Loved is, graphics are good (even though, it glitches on the scream wall), gameplay is amazing, controls are good, i loved it, and i fully recomend it if you like strategy games",
            "review_score": "1"
        },
        {
            "review_text": "Pretty entertaining game, which is a mix of open-world racer, action RPG, and RTS, with the latter part clearly the weakest. And a word of warning: If you can't stand Heavy Metal music, this game is not for you at all.",
            "review_score": "1"
        },
        {
            "review_text": "Take Great writing, good gameplay, and a totally metal soundtrack, and you get Brutal Legend, a surprisingly fun and original game. 4/5",
            "review_score": "1"
        },
        {
            "review_text": "A great Heavy Metal Music themed adventure game with some great visuals, gameplay, and awsome customisation options for both Eddie Riggs and his Deuce Muscle Car.  Includes a real-time strategy mode called 'Stage Battle' that works a little similarly to games like Supreme Commander and Halo Wars, but you actually get to join in on the action in-person as Eddie Riggs, or 1 of 3 characters in the multiplayer mode.   Only negative thing i can say: Beware when fighting the Drowning Doom in the RTS mode, they really like to spam horsemen.",
            "review_score": "1"
        },
        {
            "review_text": "Play as Jack Black playing Jack Black starring as Jack Black.   What more can I say?",
            "review_score": "1"
        },
        {
            "review_text": "This game is more Metal than me.  10/10.",
            "review_score": "1"
        },
        {
            "review_text": "If metal was made into a video game, this would be it. Oh, and it has Jack Black and Ozzy in it.",
            "review_score": "1"
        },
        {
            "review_text": "Rock 'n' Roll brothers! Riff off on an actual axe! All the legends in one game!  RIP Lemmy Kilmister 1945-2015",
            "review_score": "1"
        },
        {
            "review_text": "Tracklist 10/10 METAL Ozzy &amp; Lemmy and Halford ♥♥♥♥ MAN 66/6  YOU PLAY IN HELL. MAN THIS IS ♥♥♥♥ING METAL.  Don't buy this game if you don't like metal",
            "review_score": "1"
        },
        {
            "review_text": "The greatest video game known to man.",
            "review_score": "1"
        },
        {
            "review_text": "Plus: Heavy metal music and themes with an overly energetic Jack Black voicing the main character. If you like reasonably open world RPG style games without too much detailing overhead. You will love this game. Good graphics. Fast car, loud music, babes. Rockers wet dream. Minus: A few minor bugs. Quirky controls. Requires a lot of adventuring off of the main storyline path to find collectables.  AMD Phenom II X6 1100T 3.3Ghz. 6GB DDR2 2.5TB 7200RPM, 16MB, SATA II 16MB/s Cable/N300 Wifi XFX 2GB Radeon 6950 Vizio 42' 1080P 3D LED",
            "review_score": "1"
        },
        {
            "review_text": "Oh, c'mon - Jack Black in PC game? 9/10 Battles might be tiresome",
            "review_score": "1"
        },
        {
            "review_text": "The game is chockfull of rock goodness, which means you get to hear great tracks of the 'rock gods'. The storyline in the game is funny, Jack Black voices the main character, the main menu is very funny the firs ttime you see it.  The only gripe I have with this game is that it is so damn short. The main story takes you about 7/8 hours to finish. I only took 9 because I spent so much time doing sidemissions. If you can pick this one up in a sale I'd say you should get it. For less than 5 dollar/euro this game is a steal and worth the giggles.",
            "review_score": "1"
        },
        {
            "review_text": "What I really love about this game is the amount of Heavy Metal music and puns/jokes. The writers did well with this one. All the cameos and Jack Black....what's not to love about this game! So the controls are a bit wonky and I've been getting a few hair glitches; but seriously, Brutal Legend is one great game! Nothing better than lightning guitars and heavy metal to get you in the mood.",
            "review_score": "1"
        },
        {
            "review_text": "Metal + Double Fine + Jack Black = Amazing game. Plus it's only ♥♥♥♥ing 15 dollars and it's always on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The game every rock/metal fan should play. To quote Manowar: “If you're not into metal, you are not my friend”.  That Cry of the Banshee, though…",
            "review_score": "1"
        },
        {
            "review_text": "This game  IS BRUTAL  A must have if you like metal and Jack Black. A Metal-infused open world with cameos EVERYWHERE Hack nd slash then RTS !!! Has it all !  Not to mention a brutal storyline and AMAZING humor.  Njoy Folks",
            "review_score": "1"
        },
        {
            "review_text": "This game it's so metal, it'll melt your face!",
            "review_score": "1"
        },
        {
            "review_text": "Its like GTA meets, a metal version of skyrim. Buy this game its worth it, if your a metal fan in general youll like the cameos, and soundtrack 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. It is so much fun, and the multiplayer is really fun.",
            "review_score": "1"
        },
        {
            "review_text": "Such an under rated game, it is like a lovel letter to my child hood. So much good music.... I sometimes just boot up the game to listen to the music. This game does so much right, such a great strory, vivid scenery.",
            "review_score": "1"
        },
        {
            "review_text": "Jack Black.",
            "review_score": "1"
        },
        {
            "review_text": "MY REVIEW IS THE 6,666TH GREAT GAME",
            "review_score": "1"
        },
        {
            "review_text": "As a metalhead and a gamer I must say this is ♥♥♥♥ing BRUTAL. From slaying munk's to listen to Fast as a shark by Accept in your car in a world of beautiful darkness and fire is beautiful! One of the better games i've played even thoe i've only played for 2 hours :) If you're a metalhead do buy this game \\m/",
            "review_score": "1"
        },
        {
            "review_text": "If you like metal, comedy, and/or slashing everything in your path, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Highly overlooked game. Really fun to play and Jack Black does a great job with the character.",
            "review_score": "1"
        },
        {
            "review_text": "Game ROCKS!! Jack Black in a video game is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Actually more entertaining than I thought it would be.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Skyrim but with less looting/rpg elements and a lot more hardcore metal.",
            "review_score": "1"
        },
        {
            "review_text": "Brutal Legend is set in a wonderfully stylized world, full of humour variety and above all metal! In the hands of any other develper this would be a hodge-podge of ideas that don't quite come together to make a cohesive and rewarding experience but Double Fine's love of the material really shines through and makes the whole greater than the sum of its disperate parts. It's not the complete package by any means but there is a lot to love in metal world of Brutal Legend.",
            "review_score": "1"
        },
        {
            "review_text": "Never before have I laughed, killed, and rocked out so hard as I do while I play this game. This game is a mix of the open-world wonder of an Elder Scrolls game, the awesomeness of seeing Iron Maiden live, and the powerful action of Terminator 2, all while riding around in a custom hot rod slaying beats with shredding guitar riffs. Honestly, I was suprised by how great this game is. If you love metal, Skyrim, thrilling action, JACK BLACK, or heavy metal humor, then you will love this game.",
            "review_score": "1"
        },
        {
            "review_text": "I was super apprehensive at first, than as I played it I found it delightful. Controls are a tad twichty, need to find your personal feel of the controls, but all in all a great game. THE MUSIC ROCKS!!!! A must have for metalheads such as myself!",
            "review_score": "1"
        },
        {
            "review_text": "Brutal Legend is a very charming game filled with funny moments and feels like it was made with so much love.  Unfortunately, as funny and as cared about the game is, the fact that there is basically 3 missions in the game, that just slightly reskin and increase the difficulty, gets very tiresome after a while.  The three missions are - Heard up a wild beast, Escort a van and protect it from attacking monsters and RTS tower defence type mission. For a while it was fine but after 6 hours of the same 3 missions, it got too repetetive to bare. I had a lot of fun with this game for about 5 hours, so it might be worth picking it up on sale, but don't expect something groundbreaking and prepare for monotony.   ",
            "review_score": "-1"
        },
        {
            "review_text": "As you can tell i am a METALHEAD! Oh pardon me, anyways this game is worth every penny, the graphics are okay cause well this is a game before the 2010s, the gameplay is fun with a hack &amp; slash mixed with RTS, which is a very innovative mix, the combat isn't too repetitive, side missions are well, just side missions, the story is a metalhead's dream come true, the characters are funny &amp; interesting, very creative enviroments, great voice acting, didn't experience any glitches, is a great PC port, &amp; is overall a great 8.5/10 game, BUY IT IF YOU'RE A METALHEAD! IT HAS BLACK JACK, LEMMY KILMISTER, &amp; EVEN OZZY OSBOURNE PLAYING IN IT! WITH A BADASS HEAVY METAL SOUNDTRACK!",
            "review_score": "1"
        },
        {
            "review_text": "Metal.   Need I say more?",
            "review_score": "1"
        },
        {
            "review_text": "LEGENDARY game.  Simple-minded fun, riddled with metal-puns and inside jokes. Short as it should be. Just play it for the story and the lawls.",
            "review_score": "1"
        },
        {
            "review_text": "MOST EPIC BRUTAL HARD METAL GAME YOU CAN FIND!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's hard to review this game as it has many great ideas, but also many horrible ones. And sometimes even those great ideas are horribly executed. The game is a hybrid 3rd person action adventure with RTS elements with racing elements. Truth be told, I spent 3/4 of the game in Deuce, the beefed up car, mostly because the 3rd person combat and RTS elements are rather poorly executed. The game's story is quite an interesting one and cameos from many well known metal figures are rather funny and/or interesting. All in all if you like metal music, just buy the game. You will enjoy many many things while enduring the cumbersome parts. \\m/ If you don't like metal music, or if you're just indifferent to it, there is nothing for you here. Nearly every aspect of the game lacks polish and it's not worth going through all the shortcomings to enjoy the nice story.",
            "review_score": "1"
        },
        {
            "review_text": "Rockin'est game ever created.",
            "review_score": "1"
        },
        {
            "review_text": "More personality than any other game I've played in a long, long time. Game mechanics are okay with the RTS elements being a little painful but not as bad as I expected. Mind-blowing soundtrack. Tons of world to explore. Loved it.",
            "review_score": "1"
        },
        {
            "review_text": "Brutal Legend is a MUST HAVE for those who love METAL! Double Fine and Jack Black bring to life a refreshing and fun open world with a MOBA-type Command and Control mix for the main story. The Soundtrack alone is worth buying this game. I'll admit I copied the track list and bought them all in iTunes. While this game isn't as polished as some, I played through it glitch/bug free and enjoyed myself.  Pros: Options to *bleep* cursing and turn off gore so the kiddos can learn to ROCK! Original Story Line Amazing Game Design/Landscaping Soundtrack of MEEEETAAAALLLLL Appearances by some of your favorite Metalheads Amazonians  Cons: Ending is not really an ending End game is finishing up side missions  Recommendation: Wait for this game to go on sale and buy it. WORTH IT DEATH TO ALL BUT METAL",
            "review_score": "1"
        },
        {
            "review_text": "Love this game :)",
            "review_score": "1"
        },
        {
            "review_text": "Glad I got the POS on a humble bundle instead of wasting good cash on it. Any other way I would not be a happy camper right now.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is just another example of poor PC porting, if you ask me. There aren't enough graphical settings for my liking (I like to consider those with bad computers) and, quite frankly, the mouse gets in the way of what I'm doing (I play with a gamepad, because I've been playing this since the original Xbox release)  That's my only problem, really. Game has a ballin' soundtrack (Most played on my Ipod 3 years in a row) The storyline is awesome, charming, and funny. I just wish that the console port was better.  Don't get me wrong, I love this game, I just wish it was as smooth as the console version.",
            "review_score": "-1"
        },
        {
            "review_text": "Undercooked character action game with an offensively simplistic RTS thrown in. Jack of no trades, master of none. Excellent theming and world can't save the messy gameplay, buy at a steep discount.",
            "review_score": "-1"
        },
        {
            "review_text": "A game that has the voice of Jack Black......YES please. An awesome game, gets a bit boring if you play it 8 hours straight. However its always seem to drag me back to it and play for another 8 hours. A legandary time waster if you like just wasting time. Oh did i mention that it HAS.... JACK BLACK in it......JACK BLACK!!!!! OH YEAH xD",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game, and that's something I don't often say! The graphics, the gameplay, everything just fits so perfectly to make this a beautiful game! Just look out that it doesn't hit you right in your 'addiction', if you know what I mean :)",
            "review_score": "1"
        },
        {
            "review_text": "A truly Beautifally Brutal game. 10/10  Graphics were wonderfully cartoony and gorey  Soundtrack was full of heavy metal with some classic rock and black metal mixed in.  Voice acting: Jack Black, Lemmy Kielmiester of Moterhead, Rob Halford of Judas Priest, Lita Ford, Ozzy Ozzbourne, and Tim Curry... Nuff said. Did I mention Jack Black?",
            "review_score": "1"
        },
        {
            "review_text": "You could say it's pretty brutal. Maybe even pretty Tenacious. But I'd go with the greatest game in the world tribute.   10/10 soundtrack  11/10 Jack Black  For real though. I'd buy the game again if only just to spend hours listening to metal while decapitating demons.      ",
            "review_score": "1"
        },
        {
            "review_text": "One of the most underrated games in history. Best game soundtrack in history. A bizarre mix of third person hack n slash, open world exploration, GREAT environments, and then also lite RTS for big scale fights that you can also still drive around in and jump out and hack n slash. Only disappointment was Tim Schafer turning out to not be cool after all.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly I only wanted to play this game because Jack Black was the voice actor for Eddie Riggs.  After completing a few mission and finished the basics of playing this game, gotta say that this game is really awesome!  Firstly, the settings was rather creative as you're in the world of metal and because of it, the soundtracks are baddass. Then here comes the gameplay, at first I thought that it's gonna be a hack and slash game but it turns out that it's not just that. In fact, I consider this game more of a strategy than an action game. The controls aren't that smooth but it'll do.  In conclusion, I enjoyed this game very much and think that you should try this game if you really love rock/metal song playing in the background.",
            "review_score": "1"
        },
        {
            "review_text": "Everything I've heard about this game went something like this: 'It's falsely advertised', 'It's actually an RTS, don't believe the trailer', 'It's a bait-and-switch'. I'd always thought that the first half of the game is hack-n-slash, and then in the course of a loading screen becomes Command and Conquer.  Now that I've played the game, they're wrong. Sure, there's RTS elements, but they work within the game. It makes sense in context, and even then, there's still hackn'-n'slashn' between Stage Battles, so I don't really see what all the fuss is about.",
            "review_score": "1"
        },
        {
            "review_text": "This game will be in my top 10 games list forever, for a few reasons.  1. Jack Black 2. Metal 3. Kickass gameplay 4. One of the best video game soundtracks i've ever heared.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game graphics are good, music is awesome if you like rock and roll, overall good game",
            "review_score": "1"
        },
        {
            "review_text": "There's 3 Ozzy songs and 2 Black Sabbath songs on the soundtrack. Thats enough reasons to buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Being a fan of Jack Black and heavy metal, I had very high hopes for this game. Unfortunately, this game tries to involve too many gameplay genres and executes them with varying degrees of failure. As a result it doesn't know what type of game it wants to be and ends up being not much of anything.",
            "review_score": "-1"
        },
        {
            "review_text": "As a preface: I'm not sure if my computer was meant to play this game.  I saw Jack Black in the opening of the game. He's hilarious. Surely the game has to be good.   And it was, up until I met this strange lady who the main character wanted too hard. I spent 4 hours on this game. 3 of them were at one part. I'm going to say up front that I'm not the best at Guitar Hero, but I play fighters, so timing buttons isn't terribly difficult. But yet, there was something going on. During the Guitar Solo portion of the game, the first one, even that only requires 4 different inputs, one of which is given to you for free, the timing wasn't right. At least, it wasn't right visually. I didn't think of doing it by ear because the sound should match up with the picture, right?  I don't know, but after look up stuff on the game, I didn't find many people with my issue, so I'm pretty sure it's got to be an issue with this computer. No big deal. It did make the game frustratingly unplayable, though. Oh, and the camera.  Don't get me started on the camera.  Then again, it could have just been visual lag again.   I don't know.  What I do know, though, is that the visual lag I had in this game made everything awful. The car responded to my inputs noticeably slowly and that made the first escape the bridge sequence awful. Along with every other car-related portion of the game. Along with every portion of the game. :/",
            "review_score": "-1"
        },
        {
            "review_text": "Soundtrack, comedy and style sold the game for me, yet no matter how much I wanted to love it I just couldn't. I gave up halfway the story and never looked back. While action is passable, the so-called 'RTS' is a complete disaster. Mother of duck, why?",
            "review_score": "-1"
        },
        {
            "review_text": "It's very cool awesome game in world, music is the best in world.  P.s. Makes me laugh sometimes. P.p.s. Here is two sexy girls. :P",
            "review_score": "1"
        },
        {
            "review_text": "Brutal Legend seems to have a lot of unique things about it. It's obvious heavy metal world, the blending of RTS and normal third person RPG combat, and lots of different troops to command. However, despite the potential, it fails to execute these elements properly.  Open World- The open world system common to rpgs does have some good aspects about it. There are things to find that give you rewards, and the environments, while generic, do vary quite a bit (you have grasslands to desert to snowy areas and so on). There are many probles however. First of all, it doesn't incorporate the heavy metal theme quite as well as one would imagine. Sure, there are momuments and such relating to music, but most of the areas just seem bland.   Why Open World?- The bigger problem, however, is that there's not much point in having the open world. Unlike other rpgs, this game only has an open world to store a few, repetitive side quests, and some collectables that give Fire Tributes (the game's currency) and more songs to play (abilities per say), all of which could have easily been contained within something like a mission system.   Compared to Other Open Worlds- In a worthwhile rpg, there would be a variety of secrets and such to reward exploring, while in Brutal Legend, you'll only find a few abilities that can sometimes be pretty useless and small amounts of fire tribute. The only interesting thing are the bits of lore you can discover, but this isn't nearly enough content to justify the usage of an open world. In other rpgs, you'll find many unique and interesting wildlife/enemies/npcs that spice up the gameplay. In Brutal Legend, there will be only a small handfull of wildlife in a large part of the map, without even as much as pockets of specific types being spread out to add to the environment. You will find npcs around, but they only serve to give you sidequests or give a line of dialogue. There are enemies, but it's pointless to kill them, and they are of no threat as you will be in your car most of the time.  'Driving'- Ah, the car, the Deuce, or the piece of trash (whatever you want to call it). The problems listed above could have been passable if it were not for the fact you have to use your car most of the time. The controls on it are finicky and seemingly random. Turning is, by far the main problem. Most of the time, holding down A and D won't turn much at all, but sometimes if you do as much as press on of them once you'll go 90 degrees in that direction. This problem only adds on to the next problem in that your car feels completely weightless. Say, if you graze a rock, instead of holding its ground and only wavering for a bit, the Deuce will turn 90 degrees and go completely off course. Fantastic. And this only adds to the next problem in that the camera doesn't move with your car. Now, I know some games with vehicles allow you to move your camera freely all the time, but here, well, let's just go back to the original situation. Due to bad turning mechanics, you hit the edge of a hill or something. Due to the weightlessness of the car, instead of keeping on track, it starts turning towards the mountain. Due to the non-fixed camera, you keep on holding W to make your car go foward, only for it to turn to the hill within a matter of seconds, and at top speed, your car drives (or attempts to drive) up the hill. If there was a fixed angle, as soon as the car wavers towards the mountain, you would notice and press A or D respectively to combat the turn. These problems make it a pain the traverse the world, and you HAVE to use the Deuce as there's no fast travel system.  Combat- Definently not as bad as driving, but it could use some work. So you have two main attacks: a melee attack and an auto-target long ranged one...and that's about it. There are combos that you get and unlock and songs that you can play, but it all amounts to the same result (songs are okay, but combos aren't worth remembering). Enemies attack differently, but there's no real strategy to beat them with. Unlike other rpgs, there's no weakpoints or vulnerability to attacks or really anything. It's just hack 'n slash. Okay, but what about those rts elements? Surely those will make up for it! Well, again, it's okay. Better, but still just okay. During battles you can summon troops and all, but you're limited on commands on what to do with them. And you can't really split up your army easily, nor do you have to as the enemies and terrain are just as bland. So battles will just be:   Summon troops--&gt; Attack--&gt; Summon more troops--&gt; Attack--&gt; Repeat  All it comes down to is 'Who has the bigger pile of troops?'. Okay, but maybe the troops are so complex that having advanced control of your army isn't needed! Again, not really. They are different, and there's even specific missions dedicated to most of the troops, but it just comes down to spamming as much troops as possible. As long as you have enough melee and ranged and maybe a healer, then you're fine. You can't really summon troops to counter your specific enemies or anything complex like that.  Sidequests- As said before, there are sidequests. Every once in a while you'll find a unique quest, but most are just bland repeats of a simple objective. So in my gameplay, I've really only played at most 6 different sidequests. And these sidequests, while different, are just as bland as combat battles. Also, there's a questline for racing. It's not fun. At all. (I could talk about racing but this review would probably be 50% longer)  Fire Tributes- You get these by exploring and doing sidequests, and you can only spend them at Motor Forges for upgrades to things like the Deuce or your attacks (and for some reason Motor Forges aren't even introduced in a tutorial or main storyline). I wouldn't say these upgrades are minor, but again, they're bland and don't change up gameplay much, only help you progress by giving more DPS or something. Also, you get a crap load of fire tributes over time, so doing all the sidequests or exploring isn't neccesary or rewarded much (going along with the problem with the open world).  Story- The story is really what's making me finish the game. It's not groundbreaking or overly good or anything, but like any story it's nice to know how it progresses. One redeemable thing I like is how it shows the journey of the player and the npcs moving around rather than there just being one main base you always return to. Unlike sidequests, the main missions also give much different objectives, but they're just as bland.  Music- Adds to the environment, of course. I mean, it's a game based on metal. There's not much to say other than that the music exists. Personally, I like the selections, but if you can't tolerate the genre, then you shouldn't even bother getting the game.  Main Probems- All of what I'm saying boils down to this: skilless combat and crappy driving. The two main elements of the game are not executed too well. The combat does some unique things, but feels so bland and skilless, ultimately taking away from the other aspects like the sidequests. If this were the only problem, then the game would still be commendable (for it's price, anyways), but the driving just ruins it. It destroys a whole line of racing quests, isn't fun, and makes the open world system feel more unneccesary than it already is. The driving is what truly makes the game not worth it. ",
            "review_score": "-1"
        },
        {
            "review_text": "It's really epic game! Just try it! :)",
            "review_score": "1"
        },
        {
            "review_text": "The most METAL game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "The voice-overs, the expressions on the faces, the humor ... are beautifully executed. That's why I kept playing for a while. The rest of the game however (gameplay, controls, missions, story ...) became tedious, so I stopped playing.",
            "review_score": "-1"
        },
        {
            "review_text": "3D beat'em all. The heavy metal scene clichés are all here.   Nothing special. Kinda boring.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is very slow and not much fun. I've only played a little bit of it, but it was not a very good game.",
            "review_score": "-1"
        },
        {
            "review_text": "Brutal Legend is a great game that is certainly worth looking into. That being if you like heavy metal and Jack Black...",
            "review_score": "1"
        },
        {
            "review_text": "Mildly amusing writing and wacky Double Fine world building doesn't make up for the fact that it is a clunky console port with extremely weak gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "The book was better.",
            "review_score": "1"
        },
        {
            "review_text": "Some people say that the gameplay is boring or unbearable, but I tell you - it's playable, very playable. More like an interactive story actually. Contains many interesting ideas and quite loyal to the player, so you don't need to fear to get stuck somewhere. Just something you need to relax and play while listening best of the best of rock and metal music.  P.S. I didn't expect so much black and gothic metal in the second half of the game and... thanks for Super Beast by Rob Zombie :3  9/10 - I could only wish some better slasher part and better physics for the vehicles...",
            "review_score": "1"
        },
        {
            "review_text": "tis one badass game.... with some minor issue.... but still worth it",
            "review_score": "1"
        },
        {
            "review_text": "Great Game the only thing i dont like is the RTS  the story is great the soundtrack is very good  The story is pretty good gameplay is nice not the best but cool  :)",
            "review_score": "1"
        },
        {
            "review_text": "Brutal Legend-Brutal it most certainly is :)  Hmmmmmm,ok,maybe its a while since this was released,but damn is it a good game.For starters,its got a bit of hack'n'slash,a little rpg,racing,rts and best of all,METAL!!!!!!!!!!!. Oh yes,and Jack Black as the main character,Eddie Riggs.You start off as a roadie at a concert,and from there are brought into a world of Metal,demons,Goths etc etc.Its your task to free the downtrodden people of this new world from the Emperor Doviculus(masterfully voiced by Tim Curry,who as usual is superb)and his minions(he he Bottom!:). The entire world is large,including some of the characters in the game.Jack Black plays Eddie exactly as you'd imagine.Larger than life,and full of attitude.And the Guardian of Metal is none other than,well,I'll let you find out yourself.Ophelia is voiced by Jennifer Hale,who has voiced a lot of other characters in other games,and damn,is she hot.Even hotter later on ;)(I meant Ophelia,though Jennifer Hale is quite hot too,in case she ever reads this :))-Most of the other main characters are easily recognizable,esp if you grew up in the 70's/80's. The music fits the game superbly,and if you like Heavy Metal and similar,you'll love this. The gameplay starts off simple enough,but once you start getting into it,as with the battle stages,it gets a bit more complex. I've only just finished the game,and I'm diving right back in for another go. This is really only a bare review,but I heartily recommend this game(until Doviculus rips it out that is). See you on the stage people!!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you actually take a look at it, the game is really well made. In my opinion, the gameplay is quite creative, characters are fun, main character is the best, and I really like the idea with the Main Menu...but there are some minuses indeed.   Not a really harmful ones but they are still making the game going; The car controls aren't that bad but when you sometimes playing and let's say you have to lead group of those...[REDACTED], and you are just like 'what?'...hard to explain but this happends. Adventuring the world withought a car = massive hardcore in a game (You die quikcly).   It's not a bad thing but sometimes it's cool...but let's get back a little bit to a good side. What I also like in a game is the Voice Acting, Character creation/emotions, and specially, the world design. Effects are also epic.  After all this game does worth a try. Specially for a people who pre-ordered it, it worthed a payment.",
            "review_score": "1"
        },
        {
            "review_text": "This game, I love it and it kinda translates this into the real world.  The main story is about heavy metal (good music) is dieing from p*ssy rockband music and you have to bring back heavy metal and defeat the evil guy or whatever he is called (can't remember atm)  However unlike the game, good music is dieing (Like queen) and p*ssy rockbands are on the rise (One Direction) yeah hate on me you 1D fans, its true that they say they are a 'Rock band' while they play sh*t love songs. *Edit* Also I learned that they diden't sing for a young girl who had cancer and only 8 weeks to live, she was a fan of them, knew all the songs of by heart etc and they diden't play because they wasn't getting payed... can somebody shoot these ♥♥♥♥♥♥♥s? Not only they don't deserve to reproduce, they shouldn't be able to live.  ALSO THIS GAME HAS THE BEST MENU OF ALL TIME, I ALWAYS PLAY THE INTRO BECAUSE ITS SO AWESOME!",
            "review_score": "1"
        },
        {
            "review_text": "This game spiked my love for metal",
            "review_score": "1"
        },
        {
            "review_text": "Started off very strong then turned into a borefest really quickly. The only thing good is the voice acting. I wanted to like this game. I really did.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed the humor and had fun playing this game.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "the first rts i enjoyed playing in decades, although it feels an act too short. still cool as heck.",
            "review_score": "1"
        },
        {
            "review_text": "'This is a tribute'  Quoting Tenacious D that's exactly what it is. It's got so much love for heavy metal and the rock that influenced it. With voice acting from some of the most legendary names in metal and Jack Black, a solid soundtrack and exaggerated landmarks ever so cliché. Brütal Legend succeeds in what it sets out to be. Elements from various kinds of gameplay are mixed in here. Hack'n'slash, driving, sandbox and even guitar hero-esque bits. There's also a strategy element that steps in ever so often, and it's arguably the game's weakest point. The multiplayer is all about that element... Well... It's not that bad. There's alot of collectibles and great details, scattered around the world. Ozzy Osbourne as a bat! The plot has alot of ridiculous moments but is actually quite decent. Just expect it to be over the top very often. I'd say this game is definitely worth purchasing.  'DECAPITATIOOOOON!!!'",
            "review_score": "1"
        },
        {
            "review_text": "This.Game.Is.......AWESOME. Anyone that likes metal is really gonna like that game.... BUY IT NOW",
            "review_score": "1"
        },
        {
            "review_text": "Oh. My. GOD. This game is pure awesome. The voice acting in this game is FLAWLESS. The overworld is so big and there are MANY hidden secrets that can only be found when exploring. There are TONS of sidequests if you wanna take a break with the main mission. The combat is good. And just. Wow. This game is fun. 10/10. NO. 11/10. NO WAIT. 1000000/10. :3",
            "review_score": "1"
        },
        {
            "review_text": "love the game duble fine but the lag my pc is a beast it can run gta v max settings just fine but i dont know why a game from 2010 makes my pc lag i kinda more recomend the xbox/ps ports of the game so please fix the lag this game is ♥♥♥♥ing metal i love it but the lag is rly bad but... i rly would recomend this game to ppl that wants to enjoy probley yhe best game soundtrack i love you guys at duble fine much love keep doing what your doing &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "For lovers of hack and slash games with a touch of strategy, awesome heavy metal songs, cool cars with really annoying controls, and cool voice acting, then this is for you. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Tim Schafer's done it again. Great writing, interesting blend of hack n' slash, open world, RTS combat. What a pity then that this is port is so horribly optimized, unoptimized... It runs like ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "after all those years i still cannot play any game from Double Fine because of their 3d engine. i'm so sorry ! :(",
            "review_score": "-1"
        },
        {
            "review_text": "Hmmm..... I'll just sum it up, if u are here for the game and stories you'll be disapointed...the story sucks, gameplay sucks, the only thing i like here is just the music..*IF YOU ARE ON A BUDGET DONT BUY IT*",
            "review_score": "1"
        },
        {
            "review_text": "One word Unfinished But its ok...at first.",
            "review_score": "1"
        },
        {
            "review_text": "Brutal!!!!!!! One of the best third person games I have ever played. Action,racing,strategy,role playing all combined in a Musical Mayhem! METAL!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "jack black is in it, what else can i say?  i r8 8/8 m8 iz gr8",
            "review_score": "1"
        },
        {
            "review_text": "Go here, go there... DO this little thing, do that little thing. I dont' know, the story sucked. The open worldness sucked. There's no point in being anywhere else besides the mission. The secondary missions are the same it appears, but all over the map. Why would I or anyone want to do that? The game is extremely easy, even on the hardest difficulty.  The multiplayer is not really there. I found one match, but it's not engaging to the players. It's just boring. The only good part about this game is the sound track. It could be due to the fact, I love music and enjoy rock and roll stuff. But that doesn't make this game worth getting.  The characters in the game is pretty decent though.",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is a peice of crap. i waisted hours of my life on this thing! The controls are way too sensitve. DO NOT BUY THIS GAME.",
            "review_score": "-1"
        },
        {
            "review_text": "There’s a good art, design and most of all soundtrack buried under layers of bad gameplay decisions.",
            "review_score": "-1"
        },
        {
            "review_text": "Not the greatest game in the world but if you're a fan of heavy metal I'd highly recommend it. Features a selection of both more well known as well as some more obscure bands. If you want to drive a hot rod through a heavy metal inspired fantasy landscape while listening to Angel Witch then this is the game for you.   And hey, you can hang out with Lemmy Kilmister. If that isn't worth a buy then I don't know what is.",
            "review_score": "1"
        },
        {
            "review_text": "I would love to rate this game higher, but I am affraid I can not. The question of course is why, because the game certainly does have several things that speak for it.   Brutal Legend is a game filled with humor that is akin to main man's introduction cult movie; The Pick of Destiny. Personally, I enjoy it for in the game it is not constantly bombarded at you if you are just cruising in the Druid Plow (that is your car), but fills the conversations with a light air that is certainly good for a laugh. If you are cruising Metal music (of different genres of metal) greets your ears. Something I enjoy and in fact made me appreciate some artists better, but certainly not for everyone. Okay so that gives it a rather niche public, but that doesn't make it bad does it? No, it doesn't.  However, the game also has real time combat and does so in a the old Warcraft/Starcraft format, but has the view not topdown but on you as well as you are a important player. With no pause function, bad overview, the fact that you need to fight as well as command constantly - because the AI is just horrible - makes it stressful. A shrill constrast to the rest. Now a friend of mine has it and does well enough. The difference, a controller. I have mouse and keyboard and the controls are such .... finicky, that on a dial I can not even select the unit above or below it because it either won't move or will go down 2 in an instance. The solos you need to perform to boost you army also require key combinations which also go wrong at times due to this. No problem outside combat but in it... The problem is that this game is fun, looks nicely, has good humor, but was not properly developed for combat with mouse and keyboard.  Thus, the game has its niche in which it does well. However, if you do not like this niche or do not own a controller, I would say it is not worth the frustation of the combat and quirky controls (even with remapping!) - because that is the opposite of what the game is intended to be and would be a dissappointment over an otherwise well intended and decently executed (mainly music, humor and graphic wise) game.",
            "review_score": "-1"
        },
        {
            "review_text": "The concept for this game is an inspired work of genius but I can't bring myself to recommend this game. You play as Jack Black who is sucked into a world of heavy metal and demons. World awesome and full of cool characters and cameos from heavy metal legends. The problem comes with the gameplay. It has elements of hack and slash, real time strategy, free roaming exploration and driving. It manages to do all of these elements quite badly. The hack and slash parts are okay, the RTS parts are terrible, the side missions are uninspired and repetitive, the mapping system is poor, The inability to jump and the sketchy driving make getting around annoying, the upgrades seem to make no appreciable difference and the story is for the most part uninteresting. I guess if you like heavy metal you'd like the sound track but once I had turned off all the songs I didn't like I was basically left listening to Mr Crowley on repeat. This game does have its moments but mostly it is just not that much fun.",
            "review_score": "-1"
        },
        {
            "review_text": "A brütal heavy rock it's in my grasp, now with my fingers and my electrifying magical guitar i must destroy an entire civilitazion of demons from the all kinds of metal style.",
            "review_score": "1"
        },
        {
            "review_text": "if you love metal, and music this game is totally for you, i love jack black in this one 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Dude, only the soundtrack of this game makes it worth buying, damn, that soundtrack...",
            "review_score": "1"
        },
        {
            "review_text": "A spiritual successor to Sacrifice and Giants: Citizen Kabuto. Exactly as those games, Brutal Legend is not for everyone, but I would recommend it for people who are looking for something different. It features an amazing setting, cool characters, funny dialogues (with great voice acting) and tons and tons of awesome metal music. Granted, the plot is rather average and for its length the game could use a little bit more gameplay variety, but it is still a solid experience.",
            "review_score": "1"
        },
        {
            "review_text": "the best game there ever was and ever will be",
            "review_score": "1"
        },
        {
            "review_text": "A very metal game, this game is brutal and legendary. 10/10 would get",
            "review_score": "1"
        },
        {
            "review_text": "On the up side, the game has an amazing story and music, loved every bit of it so far. The team did a great job putting up the characteristic Jack Black humor together.  The problem is the controls... Maybe it did work well in the console or maybe with a controller, but using keyboard / mouse to play this game provides a horrid experience, specially when you're behind the weel... the car just doesn't go where you want it to and it's frustrating.  Overall, I'd have loved this game if it was a movie: a fun and great story. But as a game, the gameplay is just not on par with the rest.",
            "review_score": "-1"
        },
        {
            "review_text": "This game looked SO much better in the commercials.  2.5/10 would not play again",
            "review_score": "-1"
        },
        {
            "review_text": "Got the game on sale, brutally cheap  Pros Jack Black is the protagonist Ozzy Osbourne is your underworld mechanic and shop keeper Lemmy Kilmister is the bass string god Rob Halford as himself and some 80s glam metal version of himself? Heavy metal \\m/  Cons Heavily repitive Sold as a open worldish action adventure Game turns into a really ♥♥♥♥♥♥ RTS halfway through without any warning Controls are a bit iffy There's multiplayer, but ♥♥♥♥♥♥ RTS multiplayer Not enough heavy metal \\m/",
            "review_score": "-1"
        },
        {
            "review_text": "Jack Black + Melee + Metal Music --&gt; Just amazing. Fun game especially if you like the music and the hilarity that can occur when you involve Jack Black",
            "review_score": "1"
        },
        {
            "review_text": "ewwwwwwwwwwww dat isnt rock at all, just some metal chords in the middle of disgusting world with full of dumb iron heads and gay purple ♥♥♥♥♥♥♥s &gt;__&lt;",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the pinnacle of edgyness. Play only if you have a terribly immature sense of humour, don't mind listening to old metal bands for 20 hours and you have a 'new music is garbage' ideaology, as it's the premise of the whole game.   I really wish I could refund this thing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a strange mash up of Metal and game. my two favourite things in the world. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Many genres combined in one game didn't come well, story is meh, gameplay is hard to enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "Great humour, rather original in some ways and good tunes of course, but the game itself is rather average and tedious most of the times. Audio and visuals aren't bad too, with some lovely scaling and depth, though it's mostly wasted on being rather liner and DirectX 9 only at best.  It's just not my style or genre of game and most likely enjoyed by everyone else accept me. So don't take my 'NO' recommendation too seriously, as you personally might like it.   *2/3*  -  Plays too much like an old and possibly broken console game, but with the substance of a decent quality Windows OS/Steam game  []^_^]",
            "review_score": "-1"
        },
        {
            "review_text": "If you're into your Heavy Metal and like Hack n Slash games like God of War, Dante's Inferno or Devil May Cry, this game will enter your top 10 games within minutes of playing. The story is great, funny and immersive. The humour is spot on and the voice acting is spot on from people like Lemmy, Ozzy Osbourne and Jack Black.  If you don't like Heavy Metal but do like Hack n Slash or RTS games, I still suggest you give this a go, it's fun for SO many different reasons, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting storyline but terribly outdated graphics and gameplay. I am not a hardcore metal fan, didn't enjoy many of the references. Fans of Metal should play this.",
            "review_score": "-1"
        },
        {
            "review_text": "Brütal Legend features action/adventure fighting, vehicular combat, and real-time strategy in equal measure, and often all three simultaneously. Unfortunately, no one of those modes ever feels properly realized unto itself, and the game never manages to make them cooperate as parts of a greater whole, leaving only a messy hodgepodge.",
            "review_score": "-1"
        },
        {
            "review_text": "i idled for 4 hours just to get the gamecards from this game.",
            "review_score": "-1"
        },
        {
            "review_text": "very bad port, but good on console. so buy it for your console",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, but extremely laggy, and no way to fix lag.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought it for tf2 promos, this game sucks ♥♥♥♥ing granny ♥♥♥♥. 0.5/69",
            "review_score": "-1"
        },
        {
            "review_text": "Some say this game is the spiritual successor to Sacrifice, another third-person hybrid action/RTS. Well, I played Sacrifice. I knew Sacrifice. Sacrifice was one of my favorite games. Brutal Legend, you're no Sacrifice.",
            "review_score": "-1"
        },
        {
            "review_text": "  Trash!!!",
            "review_score": "-1"
        },
        {
            "review_text": "It's a game for metalheads.",
            "review_score": "1"
        },
        {
            "review_text": "It is a fun game. However is steam raising it's prices i remember buying it for 1.89 e last year...",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games ever. Played it on console, 100%'ed the damn thing.The whole game is chock-full of metal star cameos, and the world and everything in it looks like it's ripped straight off of an album cover. (Just wait until you see who the God of Rock is.) If you like real heavy metal (I.E. Black Sabbath, Motorhead) and don't hate Jack Black, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Brutal Legend is good, but disappointing. Coming from the mind of Tim Schaefer (and the rest of the double fine team), you should really expect a bit more. The world and characters are decent. It is fairly witty, making me chuckle and even burst out laughing a couple of times. But the campaign is fairly lacking, and the psuedo-RTS aspects seem kinda shoved in there with no rhyme or reason. Compared with most games it's good, but alongside the rest of Double Fine's work, it's just not all there.",
            "review_score": "1"
        },
        {
            "review_text": "It was fun. I beat it easy enough. I will load it in again someday to collect everything and beat it. Jack Black... Ozzy Osbourne.... come on! Who wouldn't want to play?!?!?! Get it.",
            "review_score": "1"
        },
        {
            "review_text": "Despite how it looks, the bulk of the gameplay is actually a Real Time Strategy game with the ability to get in and mix it up directly. There is a good amount of open world exploration but it's considerably secondary to the main story. It is, however, the exploration of an AMAZING world with a rich history. This game is worth playing for the world alone, but the story is also solid and funny. If you can handle Jack Black, and like Fantasy Worlds, give this one a look.",
            "review_score": "1"
        },
        {
            "review_text": "Dude! Heavy Metal + videogames within a heavy metal world.... This is a must buy. Great soundtrack, great concept, awesome gameplay. This is pure metal.",
            "review_score": "1"
        },
        {
            "review_text": "Very Liniear, Lot of issues with the game in meaning of preformance issues (not good optimized) very long intro story, and a lot of cut scenes.  On the Good side, Very innovative game this is a way you never have played it before (yes it is still hack and slash but in a diffrent style)",
            "review_score": "1"
        },
        {
            "review_text": "This game was some of the most fun I've had in a while. Upon starting it, I spent the first couple of hours getting a good laugh before being sucked into the story. The art direction has kept the game looking good after all these years and the soundtrack as you can imagine is AMAZING. I didn't mind the RTS elements, although I did find them a tad under developed and I was extremely disappointed when the game ended. Not because the ending was bad or anything (although the game itself was a little short), the ending was great, but the game ended. I want more please. If a sequel is ever announced, I'm all over that.",
            "review_score": "1"
        },
        {
            "review_text": "I played 66hours and completed all side missions and main story:  Pros: *The single player is awesome.  * The music is brutal (sometimes I would just drive around the car listening to the music while smashing creatures around the world)  Cons: * Side missions are very repetitive * around 40% of the achievements are won playing online against someone else. It depends on your tastes but , IMHO, the multiplayer is 110% boring   Overall: Must play if you have high standards for music and enjoy smashing things. If you don't, and you are into &gt;2000 'music', then Barbie: Detective will suit you better.",
            "review_score": "1"
        },
        {
            "review_text": "This game is, on a scale of one to ten, extremely metal. Also,it's definitely something people should play.",
            "review_score": "1"
        },
        {
            "review_text": "Truly a game worths its money...also best soundtrack !!1",
            "review_score": "1"
        },
        {
            "review_text": "Seriously underrated game. I, like many, originally got this game thinking that it was a hack n' slash back when it was on consoles. I've never really liked RTS games, but the way they ease you into the RTS elements through the single player actually makes it a lot of fun. This may end up being the only RTS I've ever really played online. It's lots of fun and the PC version has a lot of improvements!",
            "review_score": "1"
        },
        {
            "review_text": "By the power of metal! Best music ever, best characters and The Duce? Epic. Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool hack and slash RPGish game. Lots of metal. Much brutal.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game just because it had Jack Black! It's a decent game, story is good, the best part for me is the humor. The game play isnt anything new or special but its still a fun game thats worth the 15 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "You play as Eddie Riggs (perfectly voiced by Jack Black). When a stage collapses on him and kills him, he is sent to the metal world. He awakens to find demons attempting to kill him. He eventually meets a group of heavy metal freedom fighters attempting to revolt against Doviculus (brilliantly voiced by Tim Curry). Eddie must teach the freedom fighters how to fight and how to rock and lead them to victory.  This game has some awesome 3rd person action/adventure sections and a great deal of awesome ladscape to explore (all the while rocking out to a perfect mix of thrash metal, black metal, death metal, and classic metal). There are also some RTS-style 'Stage Battles' that serve as the major fights in the game. As someone who generally doesn't like RTS games, I felt that these were perfectly done. So, if you don;t like RTS-style games, don't let them scare you away.",
            "review_score": "1"
        },
        {
            "review_text": "School of Rock meets Kung Fu Panda and gets an R rating. I have never laughed so hard during the first half hour of playing a game!",
            "review_score": "1"
        },
        {
            "review_text": "Really awesome Game! Great story and nice gameplay",
            "review_score": "1"
        },
        {
            "review_text": "It hasn't aged really well however it is stil a blast, and not to mention hilarious 8/10",
            "review_score": "1"
        },
        {
            "review_text": "A very comedic yet very fun action game that takes place in the world of Metal Music. I would recommend this game to anyone, whether metal music lovers or casual gamers. This game does not dissapoint in how much fun you will have, sure the graphics may not be the best, but the story and gameplay and story makes up for it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever. I don't even like real-time strategy games and I love Brutal Legend. The game takes place in a fictional land that has a heavy metal theme based off of album cover art. It has people like Lemmy from Motorhead and even friggen' Ozzy Osbourne as characters.  I love this game to death.  The only problem I have with it is what the heck took so long for the PC port?!",
            "review_score": "1"
        },
        {
            "review_text": "loved this game ive played it on every available platform the graphics definitely look better on the pc version other than it just being a fun game to play theres not much else to say but just buy it you wont be dissappointed",
            "review_score": "1"
        },
        {
            "review_text": "It's one thing playing a game and listening to metal, and it's another thing PLAYING THE METAL!!! Love this game! :D",
            "review_score": "1"
        },
        {
            "review_text": "Sadly, most games with ambitious design decisions suffer from poor execution, having no predecessors to draw from. Brutal Legend is an exception. For those who haven't played Grim Fandango or Psychonaughts, Double Fine is known for an exemplary degree of humor and polish. Brutal Legend is no different.  If you couldn't tell from the thumbnail, the game is thick with heavy-metal themes. Everything from environments, units, soundtrack, voice actors, to passing references all is in some way a tribute to metal, both old and new.  The gameplay is a refreshing mix of RTS, hack and slash, and open world. I wouldn't go so far as to say it's a masterpiece in any one of those areas, but it would be difficult to find a gamer without something to do in this game. If you're not proficient in one area, the others will more than make up for your difficulties. Unit effectiveness can be greatly increased by 'double-teaming', or controlling a single unit, adding abilities or boosting stats. The game is littered with combos and tactical nuance for 3rd-person RPG fans to dig into. For the exploring types, the landscape is thick with collectibles, of both the stat-boosting and artwork/music varieties.  If I had to present any flaw with the game, it would be the length, only the staunchest of completionists will get more than 15 hours out of a single campaign. It is obvious that budget or time constraints forced Double Fine to thin out the latter half. Initially, the story and character-development is carefully paced, and suddenly it's turned up to 11, characters entering and leaving the stage quickly. Thankfully, this is only in quantity rather than quantity, for every piece of content in the final game from story to idle dialogue was masterfully done.",
            "review_score": "1"
        },
        {
            "review_text": "A videogame comedy in two acts, delightfully written and performed by brilliant actors. It's bursting with style and charm from the very first minute until the last, and its love for the source material is positively contagious. It may be trying to cram more diverse forms of gameplay into one package than it can really pull off (let's call it the Psychonauts syndrome), but there's so much quality stuff in there it doesn't really matter. The game is glorious as it is.  And I don't even like metal.",
            "review_score": "1"
        },
        {
            "review_text": "This game ♥♥♥♥ing rocks face omg wow. the multiplayer is cool and bad ♥♥♥ because it reminds me of star wars battlefront classic action slasher and real time strategy mechanics but with METAL, the game campaign is funny, brutal, violent, and just awesome. If u want something randomly comedic, violent, decent story, good voice acting, cameos of celebs, and METAL play this ♥♥♥♥ing game asap!",
            "review_score": "1"
        },
        {
            "review_text": "This game is an action RPG / RTS / heavy metal mash-up from the guys that brought us the fantastic Psychonauts. Somehow it completely slipped under my radar (released 2009); but playing through it now is an absolute charm.  Except for the rushed ending (thanks EA), I can't recommend this game highly enough.",
            "review_score": "1"
        },
        {
            "review_text": "Great game ! lots to do, and lots to upgrade !   First off i am a Jack black fan and also a Fan of Heavy Metal. This game is fun to play its kinda a hack and slash wich is always enyoyable. I picked this game up for like 3 bucks so it was a must buy at that price.  this game has a great soundtack and lots of side quests to keep u busy. jack black does a great job with brining his character to life. i did enjoy this game a lot has jack black, Ozzy Osbourne and other heavy metal gods are in this game.  Great sound track, Great Game play and a few laughs.   Id say its Worth a Buy !",
            "review_score": "1"
        },
        {
            "review_text": "I wasn't a fan of heavy metal before I played this. I thought of myself as too much of a responsible adult.  However, because of this game, now anytime I hear heavy metal I want to grab a warhammer shaped like a bass guitar, run into battle screaming, naked, and with my hair on fire! I nearly got an inappropriate tattoo on my chest of a chrome eagle all because of this game.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Its an insane but very lovable game, i just cant hate anything about this 1.",
            "review_score": "1"
        },
        {
            "review_text": "If you thought you couldn't combine a Hack 'n Slash, RTS, open world RPG into one good game, you're wrong.   Brutal Legend is a perfect blend of awesome, sporting diverse combat mechanics, sweet soundtracks, and an engrossing storyline. Don't buy if you're not man enough to handle it.  The only negative comment I have is that the game starts off in easy mode and stays that way until a plot twist where the difficulty suddenly picks up. That wasn't bad enough to cripple my enjoyment though.  10/10 game.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of my new favorite games of all time. A glorious mix of RTS and 3rd person-RPG, with melee-guitar combos and spell casting via guitar solos. The multiplayer i've played (AI only, not enough friends have this game) against AI has been fun, moreso then the campaign because you can play as the enemy factions.  Also Jack Black.",
            "review_score": "1"
        },
        {
            "review_text": "If you are of weak mind - BEWARE. Because of the epicness of metal, this is too badass for mere mortals to handle",
            "review_score": "1"
        },
        {
            "review_text": "What's not to love about this game, it's got everything, Metal, snappy combacks, and Jack Black. This game is truly an example of what all games should be.",
            "review_score": "1"
        },
        {
            "review_text": "This review could go either way, so I hit 'Do Not Recommend' to balance out the average a little more toward the 7/10 or so this game deserves.  While elegantly made, with great environments and some great humour, the Brutal Legend really falls flat in a few areas. If you enjoy Jack Black and his movies, this game will probably feel like a good length. To me, it felt like they could have cut a third to a half of the game and no one would have noticed. In particular, the lengthy time needed to unlock units, progress the story, or get enough fire for the upgrades takes forever. The story seemed good, but stretched too far out. Unless you roll straight from story mission to story mission, you're likely to have forgotten the plot or why you ever cared in the first place because of all the filler missions in between.  If Double Fine had instead focused on EITHER an RTS or a third-person brawler/adventure/sandbox, the game would feel so much better. Instead, you find yourself repeating the same moves with the same character, rolling into a terribly designed RTS where your immediate objective is to get out as fast as possible to hop back in your car, summoned with the same boring chord that you'll use fifty billion times. Oh, and your car remains the same; some upgrades, but don't go looking for even a bike (except for 2 minutes in one mission), because that car is it. I'd enjoy at least a little variety. Given the strength of the third-person adventuring, Double Fine could have cut the RTS sections totally, shortened the game considerably, and still had an awesome title.  Finally, if you don't enjoy Jack Black, his voice will make you want to murder him. The intro to the game has no bearing on the game itself (why is Black in a record store? Why is this record there? Why are we watching this dumb video whenever you start the game? And best of all, why should we care?), and Black could only be arsed to record some lines, which means you'll hear many Riggs' lines over and over and over. There's only so much self-depreciating 'hurr hurr look at me I'm just a roadie in the background but you're hot wanna bang oh no ok that's cool I'm still better than anyone else but I'm in the background' that you can take before wanting to garrote yourself with guitar strings.  In summary:  PROS: Good humour (the first time you hear it), great environment, great art, killer soundtrack, some excellent sections and bosses.  CONS: Stretched far beyond reasonable game length, the repetitious missions and humour ('Hey, who we ambushing?' 'BAD GUYS!' x200), the half-♥♥♥♥♥ game setup split between combat and RTS, graphical glitches that screw up any hair (in particular LionWhyte's, which is sad, as it's his only real feature), predictable and trite storyline, Black's humour gets old really fast. Multiplayer is a crappy port of the RTS section, with all of its weaknesses. WHERE'S THE ♥♥♥♥♥♥♥ MINIMAP? No real reason to upgrade beyond the basics (machine guns for the car, more combos if you want them, the mountain man look).",
            "review_score": "-1"
        },
        {
            "review_text": "I'd recommend it only if it's on sales. It's really fun to play 4 to 5h this game but then you rapidly get fed up, it's repetitive and what made you enjoy it the first few hours well... remains the same and basically you get bored",
            "review_score": "-1"
        },
        {
            "review_text": "80/100",
            "review_score": "1"
        },
        {
            "review_text": "I wish there were more games like this. I love metal I love jack black and I love video games. This is my perfect match. I got some pretty great laughs out of this game as they come with everything jack black does. The only negative thing i could say about this game is that the rts'ing wasn't great and it doesn't have much replayability at all. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "It's metal as nobs!",
            "review_score": "1"
        },
        {
            "review_text": "So much love it bleeds!",
            "review_score": "1"
        },
        {
            "review_text": "It's cool and funny. Kind of like The Stick of Truth funny. So if that's your type of game, I absolutely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "OK. Just started to play Brutal Legend. Got it on a super sale for 2 bucks.  01 min. (OMG. Its Jack Black presenting the game) 02 min. (Nice graphics and stuff) 03 min. (Already shaking my hair like in a heavy metal concert) 04 min. (Awesome DUDE!) 05 min. (Yeaaaaaaaaaah!)  Buy this game. Its fun.",
            "review_score": "1"
        },
        {
            "review_text": "Get this right now when it is only $2. Trust me.  The soundtrack does not have the actual rock music that plays in car or stage battle but game transition music that is worth seconds long, and the full track of 'Girlfriend' from 'Cabbage Boy'. It is not worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "This game is my jam!!! Music: GREAT, Story: COOL, Gameplay: PRETTY GOOD. The stage battles are a little awkward, but are good once you get used to the feel. Big improvement compared to the console version, as RTS kinda stuff is never a good time with a controller. Regardless 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "A game that has Lemmy and Ozzy Osbourne in it is surely the greatest game ever made! This is one seriously fun game to play with an excellent soundtrack and it's got one of the best main menu's I have ever seen for a game when you fire it up. What's more fun than beating up people with a great big axe and electrifying them with your guitar?   Definitely one game for your collection. All hail The Kill Master!!",
            "review_score": "1"
        },
        {
            "review_text": "You can run over metal sonic with your car.",
            "review_score": "1"
        },
        {
            "review_text": "Oh man, so much good and blah here. The RTS is meh. The cruising around and doing open-world stuff is great. Story is well done, even if aspects are predictable. The thing to enjoy in this game is the detail that went into the environment. Everything about the world from giant swords, trees with exhaust pipes, and the lazer panthers fits so very well together that I want to explore that world for another week. I wish the game sustained that, but even then I had a good time exploring and killing things with electric lightning from my guitar.  1. Pass on this if you don't like Metal. 2. Pass on this if you can't stand Jack Black. 3. Pass on this if you don't want to push through some meh gameplay for a good story and great creative world.",
            "review_score": "1"
        },
        {
            "review_text": "It's a hilarious, endlessly enthusiastic and bloody fun to play. Jack Black is fantastically cast as the lead, the supporting cast all turning in great performances and the game's story and aesthetic is stunningly good.   Combine that with hugely varied gameplay, my favourite video game vehicle of all time and a curiously good RTS multiplayer, it's a top 10 game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "This is more of a yes i liked it no i did not like it. the game if fun i like the RTS feel to it and the METAL but the game was not very filling the ending sucked so HARD! (my own opinion) other than that yes i would recommend this to a fellow metal head to play",
            "review_score": "1"
        },
        {
            "review_text": "I used to be number 1 in the world on Xbox 360 gamertag was IBrutal IBailey... Heavy Metal the game...",
            "review_score": "1"
        },
        {
            "review_text": "Nice metal-world story. Perfect metal atmosphere! Amazing metal fight combined with real time metal strategy. and other metal reference!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game!!! Despite the fact that some of the events are hard, I totaly recommend this game to fantasy fans and rockers alike!",
            "review_score": "1"
        },
        {
            "review_text": "Great game for metal heads and Jack Black fans",
            "review_score": "1"
        },
        {
            "review_text": "as a PC gamer I didn't like most of the mechanics much but damn this is an entertaining game. Best played with speakers turned fully up to share the experience with your neighbours!",
            "review_score": "1"
        },
        {
            "review_text": "Comical action game with rts elements packed with great old school metal and jokes about it.",
            "review_score": "1"
        },
        {
            "review_text": "Ozzy Osbourne pimped my car. ",
            "review_score": "1"
        },
        {
            "review_text": "( ͡° ͜ʖ ͡°)",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap this game is awesome. If you like metal and humor it's a must-play.",
            "review_score": "1"
        },
        {
            "review_text": "I ♥♥♥♥ING LOVE THIS GAME! ok, if you are a metalheade, or wish to become one, PLAY THIS GAME it just, ♥♥♥♥ing awesome",
            "review_score": "1"
        },
        {
            "review_text": "Jack Black, Lemmy Kilmister and Ozzy Osbourne plus a kickass Rock 'n Roll soundtrack and you get the most Metal game ever!",
            "review_score": "1"
        },
        {
            "review_text": "Do you like action adventures? ♥♥♥♥ OFF! Do you like metal?! PLAY THIS!",
            "review_score": "1"
        },
        {
            "review_text": "This game ROCK !!!!!  Let's ROCK!",
            "review_score": "1"
        },
        {
            "review_text": "Overall fun game, 'little glitchy' though. I hope they decide to make another one!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I like it. Maybe its just me, but the controls are not responsive, making cars almost undrivable. Camera is never where you want it to be and jokes wear off after 2hrs.   Like I said, once you get past some tedious control issues it's an ok game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game about metal.   Strength: Metal Weakness: Game  Play it for the metal and you might like it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you like Jack Black and hard rock.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 would headbang again only bad thing is, there is litertally no one on multiplayer. but the game itself is extremely fun, i love the music. if anyone is a metal fan you'd enjoy it as much as i do.",
            "review_score": "1"
        },
        {
            "review_text": "If you love Jack Black or Rock, open world and adventure of rock game, just take it ! Its like a fantasy game with famous actor and more stars with rock music.",
            "review_score": "1"
        },
        {
            "review_text": "It has Jack Black 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game.  BUT!!!:  Impossible to play multiplayer because:  No one plays multiplayer D,,;",
            "review_score": "1"
        },
        {
            "review_text": "Ozzy Osbourne is awesome",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Game should win Heaviest Of Metal Award also sequel please for the love of all that is metal!",
            "review_score": "1"
        },
        {
            "review_text": "Wow! I cant believe this game didnt suck ♥♥♥. this game eneded up being pretty ♥♥♥♥ing awesome, the story is really good. MOST of the humor is actually funny and not the typical lame ♥♥♥ nerd humor you usually get in todays games. As i am playing this game it keeps opening up new stuff and new units into your army preventing the game from getting stale. Very well done.  The monotiny and tedium is minimal.There is some but most of that can be avoided as they are part of 'side tasks'.  The combos are good and you can BLOCK.  The car handles like ♥♥♥♥,brakes like ♥♥♥♥, typical american Dooche rod, but looks really mean and has weapons and can be upgraded.Is reasonably fast. The polish on this game is one of the best that i can remember.It feels like an absolute labor of love from the people that did it and the musicians that did it. The voice overs are mostly great. Use the FACE MELTER guitar solo and ♥♥♥♥ comes up milhouse way more often. The animation is a trip when you see the zombie faces melt.  I give this game a 9 out of 10.  FANTASTIC.",
            "review_score": "1"
        },
        {
            "review_text": "Jack Black Simulator 2013",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "Good but with reservations.  The whole concept and the game world wasn't used to it's full potential. I'd expect more content making use of the game's mechanics - not just throwing a player into a 'stage battles'. The world also feels kind of empty when compared to other 'open world' games. Still, quite unique and enjoyable experience.  +/-:  + nice concept + nice humour and lovely characters + nice graphics (better than one would say from the pictures) + headbangers + Jack Black (100x '+' reserved for metal music fans :)  - stage battles not very entertaining and sometimes even pretty frustrating due to clumsy controls (e.g, it is hard to tell what or at least how many units are close enough to hear your commands) - too much of the 'stage battles' in the 2nd half of the game, these are fine for a minigame but not as a main content - poor side missions (basically only four - just placed multiple times randomly on the map), feels like development team ran out of funds or time. There are few funny extra side missions that show how much better it could be but 'few' really means just a few (5 or so).",
            "review_score": "1"
        },
        {
            "review_text": "If you like Rock music - you'll definetly enjoy this gem. It's made with care and has a soul.",
            "review_score": "1"
        },
        {
            "review_text": "You like Heavy Metal and videogames? The Gods of Metal command you to play this game! It's one of the highest of my Hall Of Fame list.",
            "review_score": "1"
        },
        {
            "review_text": "Love metal? Love cars which have demon faces on them? Like to slash endless hordes of enemies to some of the greatest songs ever written? Then this is the right game for you young boy! P.s. it also has Jack Black&lt; life couldn't get any better ^_^",
            "review_score": "1"
        },
        {
            "review_text": "Like Music ok. Like jack black ok. Want an rts that is really werid ok.But most of all you wanted to hear THE BATTLE CRY.'what do you do with a bunch of kids who just bang their heads all day' Easy make an army.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun to play. Varying gameplay machanics. Driving could be better.",
            "review_score": "1"
        },
        {
            "review_text": "That's a good game with a great theme. It has some bugs, but nothing that disturbs the playing.",
            "review_score": "1"
        },
        {
            "review_text": "extremely funny comedy and just all round awesomness",
            "review_score": "1"
        },
        {
            "review_text": "Absolutly awesome soundtrack and in-game songs. Game play feels a little unfinished because it seems like they couldn't decide on a melee beat them up, twisted metal driver, or army build and command game. All are fun but just seems like they went jack of all trades but didn't finish mastering them.  Great game for metal heads to mess around on and jam out to.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely recommend this game to everyone, the gameplay is great, some flaws but overall pretty damn good and if you love metal, which i do, you should definitely play this game cuz the soundtrack is ♥♥♥♥in wicked !",
            "review_score": "1"
        },
        {
            "review_text": "Haven't yet completed the game, but it usually takes me a while anyway. Loved it from the start. It's the story of a heavy metal roadie, Eddie Riggs who is transported to an unkown land of metal stuff with horns and wheels. He has to help save the world or something but it's cool just running around killing stuff. Definiterly worth the money, especially if you can catch it in a sale. My new favourite game (for now)",
            "review_score": "1"
        },
        {
            "review_text": "Okay, lets start off with this... It is a game about, Rock Music! Already perfect. But when you add in a comical and loveable main character played by Jack Black, a fun and quick combat system, and a completely original and random story, you have a game worth playing. Although a lot of the story can be a little confusing with the 'base building' style fights, and the sometimes unresponsive movements can be irritating, i still like this game, despite the feeling of incompleteness. What allows you to forget this is the comedy of the game, the originality and the amazing rock music. So i have to say, this game, is amazing.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant OST, fun humour and great to play. Makes Jack Black likeable too. All win!",
            "review_score": "1"
        },
        {
            "review_text": "great game great music nuf said",
            "review_score": "1"
        },
        {
            "review_text": "so... brutal legend. it's not a bad game, but it's not good, either.  things i liked - art direction - soundtrack - backstory - free roam  things i didn't like - awful optimisation. this game is rather old now, and i know it was made for 360 and ps3 but hot damn, this is a terrible port in terms of how it actually runs. - the badly implemented RTS. i knew about it, and knew people hated it, but i didn't know just how integral it was to the main game. the stage battles are the boss fights, after you gather your first few units. it felt more like a prototype than a finished product, very, very tanky feeling. - driving controls, way too much understeer - input seems to be unresponsive sometimes - no way to get unstuck unless you exit to the main menu - upon death (or returning to main menu), you're taken back to the last motor forge/significant quest point regardless of where the last autosave was, meaning if you last exited a motor forge at the left most side of the map but die on the right most side, you'll have to travel ALL the way back. - very little to do outside of the main quest line. it's literally just ambush quests and kill quests. i think that's pretty poor for an open world game. there is hunting for the collectables, but there should have been much more fun/interesting interactions with world and the people in it. - completion of the game seems to remove all your ironheade buddies from bladehenge and they're just forever roaming, killing rival clans...  i think it's obvious the game was rushed, and if double fine had taken their time this would have been absolutely perfect. a shame they didn't seem to bother rectifying anything for the pc port. only get this if you find it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "A bit too clunky to be fun without a controller, but otherwise definitely worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Just...AWESOME.TIME OF METAL,BABY!!!",
            "review_score": "1"
        },
        {
            "review_text": "I didn't expect it to be as fun as it was. A blast for when you need a pick-up-and-play title that's not too emotionally involved or hardware taxing, for that matter.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game accidentally in a bundle. I remember hearing about it when it was new and thinking, 'A game where you play a roaddie in a metal inspired world? WTF, no thanks!' The only game I have been more wrong about at first blush was Kingdom Hearts. The writing was pretty good, the visuals unique and screenshot worthy (years after it was released!), and by god I actually enjoyed Jack Black for a change. The occational minigame psuedo-RTS elements weren't amazing, but they weren't terrible either. I haven't been so glad to be wrong in prejudging a game.",
            "review_score": "1"
        },
        {
            "review_text": "Jack Black's part in this game is only one part that makes it so metal. It's a blast to play, and also hilarious. The songs are great, gotta love the oldies!",
            "review_score": "1"
        },
        {
            "review_text": "First 3 hours are pure gold. Gets a bit repetitive after a while, though. Completed the story, did very few extra missions.",
            "review_score": "1"
        },
        {
            "review_text": "mindless open world rpg... love all the old metal, very cool!",
            "review_score": "1"
        },
        {
            "review_text": "You love heavy metal? You will love this game. Jack Black and the Double Fine guys created a game that contains everything that is the best in the heavy metal world - great music, a wicked sense of humor and hot chicks.",
            "review_score": "1"
        },
        {
            "review_text": "I just finished this Brütal Legend and it left me with a lot of questions. Is it a God of War Clone? A racing game? An action packed Guitar Hero? A RTS in the spirit of Sacrifice? I guess it's a little bit of all of these, but mostly: it's a sincere declaration of love to heavy metal music. It's, as Rock Paper Shotgun said, 'raw enthusiasm in search of a game design'. And it's awesome.  I've waited for 4 years to get Brütal Legend on PC. It's not a perfect game, by all definitions: the graphics are starting to show their age (even though the textures and drawing distances are way better than on the console), the gameplay is not as polished as it could be (I mean, it does try to be a hack-n,'-slash, a racing game and an rts, all at the same time)... But the scenery, the writing, the voice acting and the soundtrack are unbelievable. Ozzy Osbourne plays a bat, for Christ's sake!  It made me like metal (and Double Fine) even more.",
            "review_score": "1"
        },
        {
            "review_text": "Lot of great music and fun to be had.",
            "review_score": "1"
        },
        {
            "review_text": "this game is alot of fun, keep me laughing and has an awesome soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game. No more no less!",
            "review_score": "1"
        },
        {
            "review_text": "Good game for good time. Pretty jaw-dropping plot, honestly. With good sense of humor, pretty graphics and ♥♥♥♥♥♥♥ crazy music!",
            "review_score": "1"
        },
        {
            "review_text": "I love this and would highly recommend it for any metalhead",
            "review_score": "1"
        },
        {
            "review_text": "It's the Jack Black simulator. What more could you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "It has Jack Black. 10/10, If you arent into metal, this game will change youre perspective.",
            "review_score": "1"
        },
        {
            "review_text": "Like Metal? awesome. Like a great story, soundtrack? awesome. With cameos by a some Metal legends such as Ozzy and Lemmy and the hero played by none other than Jack Black, you have a great combination for a terrific game. Pick this title up even if you don't like metal (God forbid) ",
            "review_score": "1"
        },
        {
            "review_text": "If you like Psychonauts and/or heavy metal, you really should try this. The story of a roadie who ends up in hell and starts a revolution against the demon overlords (and crappy metal), it is filled with great music, lots of different mechanics (hack&amp;slash, real time strategy, driving). Lots of great Double Fine humor too. Not of all of it is executed perfectly, but all in all this is a forgotten gem.",
            "review_score": "1"
        },
        {
            "review_text": "Great Cast, Fun Game, Worth picking up if you have never played it before",
            "review_score": "1"
        },
        {
            "review_text": "Never before have I found a game that captivates and pays homage so well to Heavy Metal. ",
            "review_score": "1"
        },
        {
            "review_text": "a love letter to heavy metal, i'm biased because i loved the soundtrack to bits. medium replay value and lots of places to explore. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "100% fun, if you've never played it or just dont own it. WHY THE HELL NOT",
            "review_score": "1"
        },
        {
            "review_text": "Bang Your Head ♥♥♥♥♥es",
            "review_score": "1"
        },
        {
            "review_text": "Not too shabby!",
            "review_score": "1"
        },
        {
            "review_text": "This game is METAL AS ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "What the hell is this game?",
            "review_score": "1"
        },
        {
            "review_text": "This game is METAL!!! Couldn't reccommend it enough!",
            "review_score": "1"
        },
        {
            "review_text": "One thing is certain - you won't be disappointed with game soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so ♥♥♥♥ing badass that only one word can describe it properly: METAL \\..\\",
            "review_score": "1"
        },
        {
            "review_text": "From the mind who brought you Grim Fandango and Psychonauts, Tim Schafer once again takes us along a mind-blowing adventure. No other game has you tapping your feet and banging your head as you axe and 'shred' through legions of demons in a gothic-mythology world inspired by the very idea of Rock and Heavy Metal.  Orginally for consoles, this is a port done right. This game is beautiful if your rig is up to par, made even better the fact it's open-world. Combat starts off as Hack-and-Slash, but later on it it develops into a weird hybrid of that and RTS-style. It'll probably throw off some who got use to the start, but once you learn to understand the mechanics behind the RTS gameplay, it can be loads of fun.  If you're a fan of music, especially Rock and Metal, do yourself a favor and get this. A kick-♥♥♥ soundtrack, quirky humor, epic lore, and loads of collectibles for your OCD needs awaits you!  Rock on! \\m/",
            "review_score": "1"
        },
        {
            "review_text": "Even though this is a mediocre hack n' slash with RTS portions thrown in randomly and often annoyingly, it's the awesome heavy metal soundtrack, voice acting, characters, and plot that'll make you keep playing.  It'd be one of my favorite games if it weren't for the poorly explained/executed RTS segments.",
            "review_score": "1"
        },
        {
            "review_text": "This game is totally Metal! No way can a game get more Metal than this. Kick ♥♥♥ doesn't even begin to describe it...Just straight up Badass!...to the bone!",
            "review_score": "1"
        },
        {
            "review_text": "It's short, it's sweet and refreshingly unique.   It looks good and the world is just fantastic. The only bad thing about it is that it's short and that Double Fine is owned by EA. -_-  Bottom line: It's worth its money.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly don't listen to much metal nor am a huge fan of Jack Black but this game actually makes me forget that and enjoy both of those things anyways. It's a hard game to describe, as is usual with double fine's games, aside from 'really fun.'",
            "review_score": "1"
        },
        {
            "review_text": "This game is better than whatever you're playing right now.",
            "review_score": "1"
        },
        {
            "review_text": "Ok guys....if you like heavy metal awesome axe swinging violence and jack black?? then you need this game. it has a few flaws with animation but its amazing!!!!!!!!!!!!!! the story is so much fun and its totally bizzare. the character design is fun and creative and the jokes keep coming. i love this game i recomend this game to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "A real awesome game that brings back features that are missing is so many modern titles. I really joy to play :D",
            "review_score": "1"
        },
        {
            "review_text": "Must buy for oldschol rock fans and metal heads.Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "I'm going to start by saying that Brutal Legend is flawed. The controls aren't great, the driving can be choppy, and I'll occasionally see some issues with the graphics. That all aside, I really enjoyed the game. The characters, interactions, and story were pretty funny. Jack Black, the Double Fine team, and the assorted rock stars did great with that. The game had an interesting tactical combat where you command your troops of metal warriors (metal as in the music genre, of course) that was executed fairly well for a hack-and-slash type of game. On the topic of metal, I'm not that much into the genre, but I enjoyed the tracks as I played and I'd say I appreciate metal a little more. Most importantly, I had fun playing it. Issues aside, Brutal Legend is a very enjoyable game.",
            "review_score": "1"
        },
        {
            "review_text": "Epicness. In one condiment? Awesomesauce. Pure and 100%",
            "review_score": "1"
        },
        {
            "review_text": "This game combines my two lifbloods: Metal and Videogames. The gameplay is a mix of hack and slash, driving and real-time strategy and is laden with heavy metal references everywhere, featuring music from godlike bands such as Megadeth, Motorhead, Black Sabbath, Judas Priest, Testament, Accept and many more. If you like electrocuting people with guitars, sending thick-skulled headbangers to kill people with their bare skulls and love metal, then empty that wallet of yours.",
            "review_score": "1"
        },
        {
            "review_text": "So this game literally Rocks Hard. And thats what its all about. The story is rather cool. The music is amazing if you like rock. The stratagy game is suprisingly solid. But most of all, the Feel to the whole game start to finish (and extras/multyplayer) is well.. Very Rock'n'Roll!!  To Summ it Up. They took a 3rd person Adventure game, a Strategy game, A few realy boss Rock Tunes, and a Steriotypes Cataloge. a Dash of Celebrity Voice actors. Then they stirred It all over A Roaring Flame of Pure Rock! And You get this game.  Seriously It's Good, Play it. Have fun, and rock on.",
            "review_score": "1"
        },
        {
            "review_text": "i had fun playing this game. lots of humor, badass music, enjoyable storyline, etc. could've done with less RTS-like passages but other than that, i recommend you buy this.",
            "review_score": "1"
        },
        {
            "review_text": "If you like heavy metal, this would be the best game you ever played. The game is so well designed and put together, that it reminds a well written book or a movie. The style of the game is astonishing, it creates an unique atmosphere that consume you completely so it's impossible to exit the game before it is absolutely no more missions to pass. For the first time ever, I wanted to start over from the beginning immediatelly after I've finish the game on the maximum difficulty.   If you enjoy heavy metal music, fast cars, brutal weapons, spectacular landscape, and breathtaking storyline - this game is for you. Absolutely will be waiting for the second part.",
            "review_score": "1"
        },
        {
            "review_text": "Epic game, you could buy it just for the hundred music that is in it , but game play and the funny story , and the famous characters make it a very good item ;)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fun!",
            "review_score": "1"
        },
        {
            "review_text": "For everyone who knows at least anything about Metal...",
            "review_score": "1"
        },
        {
            "review_text": "Imagine the ♥♥♥♥ing awesomeness of Jack Black, the amazing music of Metal, and the comedic value of Double Fine. This is this game. And it is ♥♥♥♥ing AWESOME. Buy this ♥♥♥♥, you will not regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game, the mix between humour and Metal, what else can you ask?",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, awesome music but the end was not so good",
            "review_score": "1"
        },
        {
            "review_text": "Like playing a Heavy Metal album cover, I could just drive around looking at the world for hours. Also the sound track is excellent.  Just be warned, it's a genre bender, with 3rd person melee, open world exploration, car battles, racing, rts, squad tactics, and I'm sure I missed a few. I didn't find it particularly difficult at Brutal difficulty but I hear rage quiting isn't too uncommon. If you get stuck, it's probably bot that you're not good enough, you're just fighting the battle a suboptimal way.",
            "review_score": "1"
        },
        {
            "review_text": "METAL IN ALL IT'S GLORY! HAIL SATAN 666 \\m/",
            "review_score": "1"
        },
        {
            "review_text": "I went into this game not expecting much, from the little I knew about the game beforehand (that being it starred Jack Black) I was happy to give it a chance (I really like Jack Black), and I was not disappointed! It is a very enjoyable free roaming action/adventure caper, and most importantly it has substance. The storyline never let down and kept the game interesting until the very end, featuring some great one liners along the way. I'm a big fan of collectables also, and my needs were surely met with a variety of boxes to tick. I briefly forayed into the online multiplayer too (moreso to tick a few more boxes so I could achieve 100%, which I did, METAL GOD!) which seems adequately populated and nicely varied with the choice of 3 different sets of characters. All in all, a very nice gaming experience which was to be expected with Tim Schafer on the scene, a fact which will make me check out his other two hits Psychonauts and Grim Fandango in the, hopefully, not too distant future.   “Oh mighty sun, burn the creatures of the night from this land while I enjoy coffee and bacon.” — Eddie Riggs.",
            "review_score": "1"
        },
        {
            "review_text": "It's as amazing as it was when I first bought it on Console. I would recommend this to anyone with a good PC that can keep up with it; whether it's overhead third person muliplayer battles set to really metal music or crusing around in the Duce while listening to the classics. I can never get enough of this game. It does require a hight Ram PC to really work to it's best though and using a mouse is a must as trying to use a pad with it to select songs is just near impossible first time and it does get annoying when you're trying to do a mission or one on one battle.",
            "review_score": "1"
        },
        {
            "review_text": "A game that is very under rated simply due to the fact that people were expecting a purely hack and slash action adventure game like God of War but recieved an action adventure/ RTS instead and decided not to give it a chance. I however throughly enjoyed it and thought it had some of the funniest moments I have ever experienced in a game. Very fun and did a good job of making me feel for the characters. I would recommend this game to anyone who loves metal and wants a game driven by a truly unique story.",
            "review_score": "1"
        },
        {
            "review_text": "For $1.99 you really can't go wrong. It has a predictable story, boring mechanics, and less than stellar graphics, but it's still fun. Definitely worth a purchase.",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan of Tim Schafer, Double Fine, Jack Black, or hard rock music then you'd be stupid not to play this game. ",
            "review_score": "1"
        },
        {
            "review_text": "Free humanity From Deamon's Rock Your Way &amp; Let The God's Of Metal Light your Way !!!!",
            "review_score": "1"
        },
        {
            "review_text": "It's Brutaly amazing! Great story! Funny as all hell will let it be and then some! Just worth the time!  I know I can say this is a must pick up, when I played on a 360 I got this game four times! Four times! Cause I played so much of the game I destoryed the disc!",
            "review_score": "1"
        },
        {
            "review_text": "If you like heavy metal, Jack Black, and awesome humor, this is the game for you! 100% !",
            "review_score": "1"
        },
        {
            "review_text": "9/10 - Double Fine quality at its finest. Game is too good to be played only by metal fans. You can love metal, rock, fantasy or Jack Black to find this game excellent, but truth is - Brutal Legend should be great for anyone.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty simple gameplay, but epicness and soundtrack are overwhelming!",
            "review_score": "1"
        },
        {
            "review_text": "Jack Black + Tim Schafer? Great game &amp; awesome soundtrack!! Happy this game found its way to the PC.",
            "review_score": "1"
        },
        {
            "review_text": "Simple and fun.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing game now i know irs not out when this recomdation will get posted but i have played it on my xbox and loved it and i can tell they apmed up the graphics since then to make it look even more beautifull",
            "review_score": "1"
        },
        {
            "review_text": "If you like or have liked heavy metal bands from the 70-80s you'll get a smile and some nice music out of this game. Bikes, Cars and Battles. Later battles play more like strategy games.  Remap keyboard controls or get a Xbox controller or similar.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game full of amazing metal music and suttle humour. The story line is enjoyable and makes you want to keep coming back for more. Once you master the controls combat gains an extra dimension as it mixes classic fighting with RTS all on the same screen. Jack Black fills this roll amazingly, he really does make the game.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Jack Black, then look not further. This game just stinks of Jack, and its a good stink. From the funny live movie cutscene, to the characters you find, this game is METAL. has a mix of openworld RPG, and RTS minion managment. Really good game, and put alot of time into it on the xbox 360 version. worth the play in my books!!",
            "review_score": "1"
        },
        {
            "review_text": "Lets see how many ü's i can üse in this review, becaüse I want to püt ümlaüts over every one and I think its very important to do that okay. Thanks dad, yoü made me into a big old cantakeroüs pirate king. ALSO, poünd cake. That wasn't very many ü's in retrospect, but thats okay, i don't give a ♥♥♥♥ ♥♥♥♥♥ yoü.",
            "review_score": "1"
        },
        {
            "review_text": "Funny, creative world of heavy metal. A good console port (for me at least) Gamepad vibration isn't currently working for me, reportedly fine for others. If you are a metalhead you'll love the jokes and cameos, if you like open world exploring and hack 'n' slash games you'll probably like it too.",
            "review_score": "1"
        },
        {
            "review_text": "This game rocks (har har). Brilliant combination of Metal culture and lampooning that shows both a great sense of humor and a deep respect for the culture at the same time. There is a massive licenced soundtracks from some of the greats like Metallica, Black Sabbath and Motorhead, as well as smoe of the newer kids on the block like Cradle of Filth.  The game it's self is a combination of open world adventure game and aRTS. If you've played Sarifice you will know what to expect from the RTS portions, except the controls are worse because the game was designed for consoles and unfortunately the controller is a pretty limiting input device.   TL;DR - Brutally awesome, go buy it now.",
            "review_score": "1"
        },
        {
            "review_text": "An interesting game, but gets boring quite fast.",
            "review_score": "1"
        },
        {
            "review_text": "Brutal Legend is a charming love letter to all that is metal. Too bad that Double Fine clearly had no idea what do with the gameplay so its a deformed lovechild of an action and RTS game. It's not bad enough to bring the writing, setting, and characters down though and its worth checking out to see stuff like Ozzy yelling at you to take care of your car and an 80's glam rocker that flies using his hair voiced by the guy from Judas Priest.",
            "review_score": "1"
        },
        {
            "review_text": "This game is metal incarnate. No self-respecting metal head should give this game a miss. the only falling out is the gameplay, being slightly boring and chaotic at the same time.",
            "review_score": "1"
        },
        {
            "review_text": "I have to admit that at first I was very skeptical about this game because I imagened it to be a crappy tribute to metal with a very poor gameplay. After having played it for a bit I can say it is more than a tribute to metal: it pictures the Dreamland of a sixteen years old headbanger... or Jack Black... or Manowar... Anyhow the gameplay is really enjoyable and overall the game is really good! The games it's also full of metal culture's quotes and in-jokes... really funny!",
            "review_score": "1"
        },
        {
            "review_text": "If you've ever been into heavy metal even briefly, you must play this game. It is pure awesome and ridiculousness chock full of genre references and over the top style. Not the usual generic fantasy stuff. This is why all other games have ♥♥♥♥♥♥ metal featured on their soundtracks, all the best stuff got absorbed in here! Be warned that it's essentially a third person RTS (kind of like Sacrifice or Overlord) so don't go expecting just a simple hack &amp; slasher.",
            "review_score": "1"
        },
        {
            "review_text": "Brütally awesome.",
            "review_score": "1"
        },
        {
            "review_text": "One totally under rated game. It's not perfect, but it is fun.",
            "review_score": "1"
        },
        {
            "review_text": "100% Pure metal, And not that ♥♥♥♥♥♥ Aluminium metal I’m talking pure titanium metal. Heavy metal adventure the first 3 hours are huge Double fine off the walls action with head banging tunes, Electric guitars and kick ♥♥♥♥ monsters After that it turns into a really cheap RTS with bad mechanics and frustrating gameplay. What the ♥♥♥♥ happened...  If this game goes on sale, Buy it because it’s a sure Steel. (See what I did there?) ",
            "review_score": "1"
        },
        {
            "review_text": "The game is just brilliant, there is no other way to put it. The game is 10x better if you are into metal what with the scenery being all made of stone guitars or axes rising from the ground, characters such as Ozzy Osbourne or Lemmy, the different factions essentially being like a battle between Glam rock, Metal and Goth, the special moves being activated by guitar solo's.   The whole world itself is just amazing (I mean the Screaming Wall being made of amps!) and again so much better if you like metal. Even if you're not into metal the game is still superbly funny and fun to play with a interesting story and pretty good combat, though a lot of the little things that make me squeal as a metal fan may pass you by, but you don't have to know them, they are just nice easter eggs sort of.  The strategy side of the game which is hidden at first won't please more hardcore strategy fans (I being one myself) as it is very simple, however it's made more than bearable by the fact you can just wade in and fight yourself which you can't do in say Total War's or Starcraft. Or even better summon your car on the battlefield and go nuts.  To top it off, a serious recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "This next game asked me not to type this... But...godd%#mit, I'm going to type it anyway, because I'm reviewing this game, and it's the truth!  I F#%KING LOVE THIS GAME! IT IS ONE OF THE BEST GAMES EVER... PERIOD!  Ladies and gentleman... BRUTAL LEGEND!",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game! Has great single player RPG elements with a nice touch of champion-based RTS. Beautiful artwork throughout and a ~42 sq km playing area to have good ole' fashioned rock-n-roll fun! 8.5/10 still play alot.",
            "review_score": "1"
        },
        {
            "review_text": "Jack Black AND Metal. Nuff said.",
            "review_score": "1"
        },
        {
            "review_text": "I guess devs were intoxicated but it was the only way of making this game. Nice one.",
            "review_score": "1"
        },
        {
            "review_text": "Jack Black + Metal  456456/10",
            "review_score": "1"
        },
        {
            "review_text": "This game pleases the Gods of Metal. Plus, it's Double Fine, and who doesn't enjoy their insanity? ",
            "review_score": "1"
        },
        {
            "review_text": "Beat'em up - Check! Heavy Metal - Check! Gore and Cussing - Check! Silly Humor - Check! Jack Black - Check Check Check!  All the ingredients are in and the combination is just perfect.  This is what games are supposed to be about: funtimes!",
            "review_score": "1"
        },
        {
            "review_text": "HEAVYMETALBRUTALAWSAOMEEPICBADASSNESS!!!  WHY THIS GAME IS METAL: Voiceacting by Jack Black, Kyle Gas, OZZY OSBOURNE, Lemmy Kilmister, ROB HALFORD, Lita Ford... (the list continues)  I`ve never seen such a consequent metallic-fantasy-world like this before!! Everything looks and sounds metal!  The soundtrack is full of licensed tracks, that gets your face melting!!!",
            "review_score": "1"
        },
        {
            "review_text": "The humor is spot on and the soundtrack is solid. Add in great voice acting and a fun story and you have a great game.",
            "review_score": "1"
        },
        {
            "review_text": "This - Game - SO - F***ing - METAL ! !  If you like metal - BUY IT FFS ! !",
            "review_score": "1"
        },
        {
            "review_text": "IF YOU LOVE THE METAL, THEN YOU LOVE THIS GAME. DEN OUTTA DEN ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome!  I bought this game and had it in my waiting list for a long long time. Today I decided to give it a shot and I was greatly impressed. It's exciting, funny, and the music rocks!  The best part, for me, is that I'm running it on my linux laptop without any problem (even with the Xbox controller). I wish I had played it right after I got it :)",
            "review_score": "1"
        },
        {
            "review_text": "I thought I would hate this game but I loved it. Looks ♥♥♥♥, game mechanics are sketchy at times but it was just fun. The music is awesome and it was easy as long as you used the skills gained along the way.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just pure, heavy metal genius... Beat it when I had a 360. Beat when I had it on PS3. And now I've joined the PC race and I'm going to beat it and play the hell out of it on here.   Love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, excellent to play with a controller. The music makes it. This game has got it all: Humor, metal, guns, babes. What more could a guy ask for?",
            "review_score": "1"
        },
        {
            "review_text": "'They can´t stop us, let them try. For Heavy Metal we will die!' -Manowar, Die for Metal \\m/",
            "review_score": "1"
        },
        {
            "review_text": "Heavy Metal game with voices from Jack Black and many metal legends! Awesome soundtrack! Very stylized open world! Gameplay not the best I have seen, but the sheer amount of metal-related content more than makes up for that fact. I recommend using a 360 controller.",
            "review_score": "1"
        },
        {
            "review_text": "couple hours in, hillariously fun. want my badge",
            "review_score": "1"
        },
        {
            "review_text": "This game IS METAL in it's purest form!!! Headbangers FTW!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is 100% metal. If you don't like metal you can ♥♥♥♥ off.  No spoilers: Jack Black, Lemmy Kilmister, Lita Ford, tons of epic and classic metal songs, hack'n'slash combat + RTS battles and a badass storyline.",
            "review_score": "1"
        },
        {
            "review_text": "For the price, I'd have just got the game for the soundtrack! I think any metal fan would appreciate a heavy metal themed game, not just the soundtrack but the overall presentation and imagery.   I couldn't help but be reminded of World of warcraft, then again pretty much every open world game reminds me of WoW for some reason but what did it particularly was the art style.   As a game, without the bells and whistles, the experience for me wasn't mindblowing, it was....just another game I hate to say. I couldn't find it funny even though Jack Black is a funny guy, he just didn't have too much humor in this game, which is why I'm wondering why the game has been tagged 'comedy', I just didn't find the comedy very....funny. I consider Giants citizen kabuto or Armed and dangerous as funny games, which strangely enough this game reminded me of also to a certain extent.   The action and combat didn't feel overly fluid to me, it worked but it just felt like all I needed to do was mash buttons. After a while the 'RTS' sequences got a little tedious and I figured all I needed to do was rush the enemy fast to win. The upgrades to the vehicle and your character were nice, as a personal fan of black metal I'm so greatfull they didn't leave out the black metal threads.   The story kinda felt like it had holes in. Like one character would be talking about something that had not really been covered and you were expected to know what they were on about, all of the sudden the main char knows about something they've never heard of. By the end though, you kinda figure it out in a rough way.   For some stupid reason I had and urge to hit a button and JUMP....you can't do that..is it just me or is it annoying when you find a game you can't jump in?!?  As much as I could find flaws with it, there was a lot more good and at the standard price it's well worth it if you have a good 20-30 hours to put in.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game with good soundtrack if you like metal The game does have a short story though ",
            "review_score": "1"
        },
        {
            "review_text": "tl;dr: This game is a great blend of Action/Hack-and-Slash and RTS gameplay with a style that ensures that it ages well as time passes. Definitely worth getting on sale.   The stage battle missions in the game relies heavily on your ability to manage your army, while making sure that you yourself are active enough in the battle to ensure that your enemies don't get a leg up on you; only your units can damage buildings and free resource nodes, but you have to step in to capture these points, and regularly need to come in to help take down more powerful enemy units. The rest of the game provides a good blend of smaller skirmish-type battles, solo missions, and driving missions to protect your tour bus. The world is very well-designed, and the graphics still hold up well for a game that was originally released on console in 2009 (I believe most cutscenes are in-engine, so modern machines won't have the drawback of poor video quality cutscenes). The writing is exactly what you would expect from a game where Jack Black voices the main character; 'Who we ambushing?' 'Bad guys. Wanna help?' Overall, this game is a great buy if you can find it on sale or in a bundle, as the only real negative is that the game has a fairly steep learning curve for those unfamiliar with RTS games.",
            "review_score": "1"
        },
        {
            "review_text": "It's not just savage, it's Brutal.",
            "review_score": "1"
        },
        {
            "review_text": "You Like Rock Yes You Like Jack Black Yes You like Killing Evrything Well What Are You Doing Go And Buy This Game Bro",
            "review_score": "1"
        },
        {
            "review_text": "If you like metal, this game will blow your mind",
            "review_score": "1"
        },
        {
            "review_text": "Jack BLack is life, Jack Black is love 9/10",
            "review_score": "1"
        },
        {
            "review_text": "The game is quite fun. Sort of like God of war met Command and Conquer.",
            "review_score": "1"
        },
        {
            "review_text": "A game about metal made by metalheads for the most brutal metal fans.",
            "review_score": "1"
        },
        {
            "review_text": "I still haven't finished the game but as far as I can tell, this is a game that took me like no other ever did since FF X. That's probably thanks to the Ophelia-Eddie Love story, but Brutal Legend is great even in everything else it has to offers. I love Metal so I actually enjoy the world very much, with Lemmy, Ozzy and so on. The songs are fantastic and they really perfectly fit every situation, making the game even more exciting. Gameplay is good, not the best hack n'slash out there but good and the mix between it and tower defense-like gameplay during stages fights works very well IMHO.  Schafer, if you read this somehow, please consider doing a sequel to this masterpiece. I know it would be no cheap, like 30m or so, but please atleast try. Maybe less licenses, so the price would come come down a bit.  Game has a lot of achievements also, so it will keep me busy for a bit =)  To everyone in doubt: BUY IT and support this fantastic studio, they made the best heavy metal game on the planet. Oh, and please, make Eddie and Ophelia stay together &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Awesome music.  Absolutely awesome music.  It makes you forget all about the gameplay issues that may or may not bother you otherwise (a lot of fun and not so fun (mini-)games mixed together). Play this game for the unforgettable experience it is to play a game with some of the best metal ever made in it.  Rock on!",
            "review_score": "1"
        },
        {
            "review_text": "Guys, this game was awesome. Far from being perfect but totally enjoyable. An insane story with an insane world and crazy characters. Everything you can expect from a Tim Schafer game. My only problem is that after a while it gets very repetitive and boring. But if you want a unique game with quality humour and love metal music it's your game. It contains Jack Black and Ozzy Osbourne as well!",
            "review_score": "1"
        },
        {
            "review_text": "If Metalocalypse was the best thing to happen to you since Metallica dropped LOAD, then this game will be the best thing to happen to you since Metalocalypse.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a piece of art. Part action, part driving, part strategy. Fans of action, comedy, and heavy metal history should love it. Its environment and character designs are super creative, like Alice in Wonderland...Alice Cooper that is! Jack Black is hilarious, combat and driving are fun, and the soundtrack (needless to say) is awesome! Playable with keyboard and mouse but a controller is highly recommended. Fans of 70s and 80s metal will definitely get the most out of this game, but I think anyone can appreciate this game and the love that went into making it. I highly recommend it and hope for a Brutal Legend 2 someday!!",
            "review_score": "1"
        },
        {
            "review_text": "Tim Schafer: Check. Jack Black as the main character: Check. Heavy Metal: Check. S&amp;M Demons led by Tim Curry: Check. Rocket Cars: Check. Ozzy Osbourne as your shopkeeper: Check. Action-Adventure with elements of RTS: Check. Soundtrack: METAL!  If any of those sound good, you owe it to yourself to pick this game up.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "A must for any Metalhead-Gamer.  Featuring the voice acting from Jack Black (Tenacious D), Kyle Gass (Tenacious D), Rob Halford (Judas Priest), Lemmy Kilmister (Motörhead), Lita Ford (The Runaways &amp; solo career) and Ozzy Osbourne (Black Sabbath, and if I have to tell you he has a solo career, you might rethink buying this game), as well as a soundtrack with quite a lot of Metal, from Def Leppard and Mötley Crüe to In Flames and Children of Bodom.  The gameplay is quite varied, mixing Hack'n'Slash with RTS-elements (I don't usually like those, but with this game it just clicked in place), open world elements and plenty of small minigames. Though it might be a little bit weird at times, this also makes sure the game doesn't get boring fast, and adds replay value (I myself played this quite a bit on my old 360 before buying it on PC). The blend-in of songs, lyrics and even band images and album covers works great with the over-the-top-fantasy storytelling that actually works way better than one would expect.  To close up: If you feel the need to nitrous-ramp a hotrod off a landscape looking like it came from Megadeth's album art while blasting DragonForce at full volume, this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Fun! Bad thing:Multiplayer is dead Good Thing:Rest of the game!",
            "review_score": "1"
        },
        {
            "review_text": "A unique take on the hack and slash genre. The game incorporates rts style battles, which are not nearly as bad a people make them out to be, but can be a pain at times. Great story, really funny, and has a great soundtrack. 8.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Great story and music, slightly confusing and disappointing RTS segments.   Wish the whole game was like the first hour, but still worth a play.",
            "review_score": "1"
        },
        {
            "review_text": "Jack Black, Metal, exploding heads and melting faces. What's not to love? An interseting and unique story on the origins of Metal/Rock music. Featuring a medly of artists from AC/DC to Dragonforce, this games soundtrack rivals that of any Grand Theft Auto. The gameplay/ combat system is a little lackluster, basically button mash, spam as many people as possible, and the multiplayer is a bit of a joke. The single-player on the other hand will have you exploring a diverse post-arockalyptic world, learning the origins and ruinations of the metal gods who came before. Just who is Eddy Riggs, and how did he get to this world?  The answers to these questions await you.",
            "review_score": "1"
        },
        {
            "review_text": "It took me eight hours to figure out that this was an RTS.  Now I can't refund this garbage.  ♥♥♥♥ me.",
            "review_score": "-1"
        },
        {
            "review_text": "Must buy for metalheads",
            "review_score": "1"
        },
        {
            "review_text": "dá pra dirigir ouvindo kickstart of my heart épico",
            "review_score": "1"
        },
        {
            "review_text": "Tenacious D: The Game. 11/10 would try to kill the Metal again.",
            "review_score": "1"
        },
        {
            "review_text": "Yey or Nay?  The amount of enjoyment your going to get out of this game depends on 3 main factors:  -Do you like rock/metal?  -Do you enjoy Jack Black?  -Do you like Stratagy games?  Yes and this game will instanly cause you freinds and family only see you of 'rare occasions'  Pointers:  -Voice acting in this game is amazing  -Is NOT a multiplayer game (If you really want it to be you can make it one)  -Visuals/art style are amazing (but graphics are not that good)  -Soundtrack = OMFG this is amazing  -Level-up system and gear; quite cool but not much variety  -You CAN command hardcore moshpitters  All in all a good game and worth the price. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "You can play a guitar and set enemies on fire and melt their faces, what's not to love and it has an awsome Metal Soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "really worth buying this game",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game for Jack Black. He personnally told me to purchase this game. I was watching Goosebumps and in the middle of the movie he broke the fourth wall and said 'Will, buy my game that I singly-handedly developed' So I did. It is a very good game. It made me laugh so hard I....",
            "review_score": "1"
        },
        {
            "review_text": "I have only one thing to say: Brutal...",
            "review_score": "1"
        },
        {
            "review_text": "Brütal Legend is a game every metal head should play. The gameplay is pretty ♥♥♥♥ing good for what you would expect. The references to famous artists, bands and songs in this game are awesome. I already found Jack Black a hero but this game confirms it... He is a true hero.   Pros: -Solid Gameplay -Nice references  Cons: -Stage battles could have been better  Rating: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Won't run (unable to change refresh rate). Filthy console port.",
            "review_score": "-1"
        },
        {
            "review_text": "it's a fun game and it kinda lags but playable on a laptop with 2nd gen i5, intel 3000, and 8gb ram",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun and unique game. There's nothing else like it the only reason I only have two hours is because I beat it on a console and got it in a humble bundle.",
            "review_score": "1"
        },
        {
            "review_text": "If you like games (which you probably do since you're on Steam), and you like Heavy Metal - get this game! Riding through the world in a car while listening to legendary rock and metal bands has never been so awesome!  My only complaint is that not enough people play multiplayer. It has a lot of potential to be great, but alas...",
            "review_score": "1"
        },
        {
            "review_text": "It's metal and it's strangest strategy game I ever seen.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game with a creative world design. Gameplay is smooth for the most part, definitely an interesting and has an amazing soundtrack if you're a fan of classic metal.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an absolute riot from start to finish! \\,,/",
            "review_score": "1"
        },
        {
            "review_text": "Rock On!",
            "review_score": "1"
        },
        {
            "review_text": "Worth every penny.The music is awesome, the cast is beast. But the story towards the end seems rushed. Overall a very metal game",
            "review_score": "1"
        },
        {
            "review_text": "Had some dude who was running to get to me, he screamed 'Metal!' at me then he got away.  HeavyMetal/10 would headbang again.    Serious review:  This game is a must have for any fans of metal, it's not totally serious, the gameplay isn't epic but the game itself is awesome and should be played at least once in your life. It has black metal, Symphonic metal, power metal, hard rock, viking metal and other great genres of metal. No bu**♥♥♥♥ that should not be called metal. Great bands such as Enslaved, Cradle of Filth, Megadeth, Motörhead, Mötley Crüe, Kiss, Dark Tranquillity, Iced Earth, etc etc...  I love video games and metal but someone who doesn't likes video games but love metal could like this game anyway, it's simple, it's basic and it's good, once again, it doesn't have the best gameplay ever, it is not the best game ever but you should see this mostly as some kind of tribute to the metal.  8.5/10 Metal head for eternity.",
            "review_score": "1"
        },
        {
            "review_text": "Omg, a definate must buy. If not just for the laughs alone. I do recommend using a controller to play though. It is a bit tricky with a mouse and keyboard. But SO much fun.",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of heart and good storytelling in this game, along with the trademark humour you'd expect from Tim Schafer. That said, it can never quite decide whether it wants to be a hack 'n' slash, open world exploration or RTS/MOBA game and doesn't really excel at any of them. It does have it's moments, and I was grinning like a loon when given the opportunity to mow down a horde of Emos in a lightning-gun equipped hot-rod while Black Sabbath blared out of the speakers.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is For People That Like Rock  But If You Don't Like I Think You Will Either Way",
            "review_score": "1"
        },
        {
            "review_text": "it is old but it ROCKS  the comedy is awsame the soudtrack is well made and you have the voce of jack black what more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "I can't describe how ♥♥♥♥ing epic this game is in words, so let me try to describe it. You know power metal, right? Well, imagine a game set in a world based on the lyrics of a generic power metal song, and this game game has boobs, giant battleaxes, and some excellent classic heavy metal as a soundtrack. Gort that in your head? Good. Now amplify its greatness by 100x. BRUTAL LEGEEEEEEND! I wish I could reccomend this game 10 times.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game &lt;3 R.I.P. Lemmy",
            "review_score": "1"
        },
        {
            "review_text": "Epic! Metal it comes from hell!",
            "review_score": "1"
        },
        {
            "review_text": "the heavyest of metal games 10/10 F.A.K.K.2 ozzy and jack black",
            "review_score": "1"
        },
        {
            "review_text": "Doom is a video game version of Heavy Metal but Brutal Legend is a full on tribrute to Heavy Metal and honours the genre in the highest degree.    An RTS Hack N Slash with a Heavy Metal theme with the humour and writing of Tim Shafer. If that's not enough, Jack Black lends his voice as the main protagonist: Eddies rigs as well a Heavy Metal legends such as Ozzy Osbourne of Black Sabbath, Lemmy Kilmister of Motorhead, Rob Halford of Judas Priest and many others. Oh and Tim Curry is type castsed as the villian...and I wouldn't have it any other way.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game for those who love Metal! Great soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "10 devil horns out of 10 with an ultimate badass seal of aproval!! i would chop off both of my pinkie toes if it would mean brutal legend 2 gets announced and is just as good if not better than the first",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome! Yes it has so many flaws and if you are ok at gaming or understand how games work you can beat this game hardest setting in 4 hours. Now if you enjoyed the ps2 type games and metal this is a must have for your collection suprisingly even with only 3-4 different side quest this game actually has replabitlity",
            "review_score": "1"
        },
        {
            "review_text": "I'm still only half way through Brutal Legend, but it is a fantastic game. The humour thoughout is brilliant (speaking as a heavy metal fan- because many of the jokes could go unnoticed by non-metalheads)... I love the tongue in cheek metal references and the overall light hearted tone- even though it can be a little gruesome at times. (The introductory cutscenes were fantastic in how they allowed you to choose whether you wanted to hear coarse language and then see gore as well)! The voices are great and cameos are very well done (Just met the Rob Halford inspired character). The fighting mechanics can be a little repetitive and I am really not a fan of real time strategy directing a battlefield (sending troops here and there), but the game is still fun and good value. Give it a go!  * Update * I've had a break from the game for a while, partially due to getting frustrated by the strategy elements of the game, but having had another go, I totally remember why I wrote such a glowing review. It's awesome!!!If you're patient with the real time strategy battles, just getting involved and doing team-up attacks can be heaps of fun. Once again I recommend Brutal Legend. It's a great game. :)",
            "review_score": "1"
        },
        {
            "review_text": "This game is for people who love classic rock, Heavy Metal, and also Jack Black. its a silly game with serious undertones that manages to sticks its fingers into almost every genre of game. From Beat 'em up, and Racing, to Real Time Stratagy, and adventure.",
            "review_score": "1"
        },
        {
            "review_text": "While it does show its age, it's a fun romp nontheless. Most of the metal references flew over my head, but even I recognised quite a few of them. The world design is beautiful and unique. sadly, DoubleFine has a hard time getting games to actually sell, so I doubt we're going to see a sequel any time soon. Definitely recommend getting this on sale.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say? Straight out of Jack Black's head and into my PC!   A weird and wonderful, rocking brutal fest.   It's fun, got a great rocking backing track and just different enough from the norm to make it utterly brilliant.  Don't expect great graphic's (although they aint that bad)  Don't expect a single serious moment!  Don't expect an in depth far reaching story!   Come this way if you expect to be entertained, My belief is... you will be!",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this is one of my favorite games of all time. The world feels vibrant and bloody fun to drive around in. The characters &amp; design throughout is dazzling. The adventure is challenging, and the stage battles - while they have their control problems - are very satisfying. This game is like a Boris Vallejo cover to an eighties metal album come to life! Check it out if you love heavy metal and have a sense of humor!",
            "review_score": "1"
        },
        {
            "review_text": "Best lore and best soundtrack EVERRRRRRRR !",
            "review_score": "1"
        },
        {
            "review_text": "Haven't played it much here yet, but I bought, sold, and rebought this game a few times on 360, playing through the whole thing at least once every time. As someone raised on 80's hair bands and metal, this is a game that speaks to me. Even long after I think I'm done with it, I'll get the urge to play it again, so I bought it again here, just to make sure I always had it. It's not for everyone, and the gameplay isn't spectacular, but it's not unplayable either. It's a little unintuitive, sure, but it's not about the mechanics. It's not about the story. It's about the experience, and that's why it captures the vibe it's going for so well. So if you like good music, over the top over-metalifying everything, and the Oz man in one of his few understandable speaking roles, grab this game and keep it.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games",
            "review_score": "1"
        },
        {
            "review_text": "Left behind and forgotten yet unbroken. Best Double Fine game.  There's no game in this world like Brütal Legend. It needs a remastered version much more than BioShock ever did. Still waiting for a sequel, but each and every fan of this masterpiece knows that it will never come.  Rest in peace, BL, you will live on in our hearts and libraries.",
            "review_score": "1"
        },
        {
            "review_text": "OK... I have to admit... this was one of the best games I've every played!  Now... how to describe it... Take something from OVERLORD, add some GTA or SAINTS ROW, something little from TES + 100% of !!!HEAVY METAL!!!  In another way I can say that this game is a sandbox rpg strategy hack and slash game with tons of crude humour! That last thing I liked the most... this game is simply FUNNY as HELL! Plus add some names as Jack Black and Ozzy Osbourne and a Metal mentor... hillarious!  I think that I can that this game is MUST-BUY title : ) (and I even don't like heavy metal so much as other music gengres)",
            "review_score": "1"
        },
        {
            "review_text": "Still a fun game to play after many years.",
            "review_score": "1"
        },
        {
            "review_text": "This is game... is brutal.  This game is without a doubt one of the best games ive played, enjoyed every minute of it. I recommend this game to any heavy metal fans.  I give this game a 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Do you like metal, dismembering people with a battle axe, and doing it all while listening to classic metal? Well if not then this game will tell you to go ♥♥♥♥ yourself and strap you in for a ride through headbanger heaven. Too bad some of the cameos have passed away.",
            "review_score": "1"
        }
    ]
}