{
    "app_id": 225360,
    "name": "DARK",
    "release_date": "2013-07-03",
    "developer": [
        "Realmforge Studios"
    ],
    "publisher": [
        "Kalypso Media Digital"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "Stealth",
        "Action",
        "Vampire"
    ],
    "achievements": 31,
    "positive_ratings": 476,
    "negative_ratings": 500,
    "price": 6.99,
    "description": "DARK is a unique stealth-action game with RPG elements in which you take on the role of the ultimate hunter: a vampire. Ambush your enemies from the shadows, roam the darkness and use powerful vampire skills to dispatch your opponents.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/225360/header.jpg?t=1476090008",
    "minimum_requirements": "OS:Windows XP SP2 Processor:2.0 GHz Dual Core Memory:2 GB RAM Graphics:NVIDIA GeForce 9600 GT / ATI Radeon HD 4670 / Intel HD Graphics 4000, with 512 MB dedicated RAM Hard Drive:5 GB HD space Sound:DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Full of brilliant ideas, but from what I've played, those ideas have been poorly executed alongside aweful AI.",
            "review_score": "-1"
        },
        {
            "review_text": "Dark stars Eric Bane, a newly turned vampire who wakes up in a night club called Sanctuary. In the world of Dark, those that are turned into vampire have to then drink the blood of their sires in order to complete their transformation. If they fail to do so, they become mindless beasts. Unfortunately for Eric, he can’t remember anything and thus has to venture out to find out who turned him into a vampire. Until the last two levels, that’s as complicated as Dark’s plot gets, which is a good thing because the dialogue is terrible but in an incredibly odd and endearing way. It inadvertently makes the game less serious and a little goofy, which I found rather refreshing. Instead of getting bloated down with too many story details or an emphasis on the dark and gritty, Dark’s plot is really only there to give you a reason to go to different locals and murder people.The heart of Dark’s gameplay is stealth. Being such, it is not a good idea to try to play it like an action game. One of my pet peeves in modern stealth games that they enable characters too much; making it too easy to run-and-gun or bash you’re way through a scenario. Dark resists this trend but does so to its own detriment. While Eric Bane may be under-powered compared to his stealthy counter-parts, he’s not powerless by any means. His powers are simply all geared toward enabling him to dispatch foes stealthily and no other way. Eric can acquire or enhance a total of 16 abilities through the course of the game.Being a vampire, Eric uses blood to perform these feats and must get up close and personal in order to replenish that blood.While most of the powers in Dark require the use of said blood, Shadow Leap does not. Shadow Leap allows Eric to teleport short distances and climb ledges. Like other abilities it can be upgrade to reduce the sound made and decrease cool down time.While Dark actively rewards players for playing stealthily and staying hidden it also contains one of the sparsest check pointing systems in recent memory. In Dark checkpoints are generally only at the beginning of each room. Rooms often contain somewhere in the neighborhood of 7 enemies while some can contain as many 20. On top of that, once enemies are alerted, they stay alerted for a quite a while, making evasion or restarting from the last checkpoint the best options. Needless to say, it can get quite frustrating. Even with experience points and despite being billed as a “stealth action RPG”, Dark is a stealth game with a progression system. It is not an RPG. While it has some of the trappings of an RPG, none of it is very meaningful.Visually Dark is an interesting game. It is not terribly impressive technically or artistically. It employs an art-style that very reminiscent of the Crackdown games. For the most part everything is drawn as it normally would be except that everything has a black outline around it.In the end, Dark is an incredibly hard game to judge. While it may be rough around the edges, Dark is the kind of game that has heart. Yes, the animations, voice-acting and checkpoints could all use a massive overhaul but I found myself enjoying its brand of stealth.",
            "review_score": "1"
        },
        {
            "review_text": "NEUTRAL RECOMMENDATION. I really wish Steam has a neutral rating for games that fall somewhere b/t Not Recommended + Recommended.  --------------------------------------------------------------------------------------------------- REVIEW:  DARK is a 3rd person stealth/action game focused around vampires. Taking some cues from many other games in certain ways (such as Dishonored &amp; Vampire: The Masquerade - Bloodlines), DARK also tries to bring its own spin on things here with vampires; especially since this game is primarily a stealth-orientated game. In some ways (such as atmosphere + art direction), it succeeds. In other ways (such as stilted writing), it doesn't succeed. For every hit (such as Doug Cockle doing a lot of voice-acting), there's also a miss (such as almost everybody else's voice-acting).   In this game, the player is Eric Bane - who has amnesia, recently got turned into a half-vampire, and must find a vampire's blood to try to become a flood-blooded vampire. If he doesn't, things get much worse i.e. he could turn into a wild vampire and lose total control of himself. This certainly isn't even the half of the story, but I don't want to really spoil too much here.  Two things this game gets right is the atmosphere + art direction. Sure, the art is not the best-looking art, on the technical side of things. But the cel-shaded look &amp; vibrant use of colors makes up for a lot of that. A lot of the areas do have a good amount of textures in the game-world &amp; the direction of them look quite good. The game is absolutely loaded with atmosphere, as an easy way to get lost into world.   The Sanctuary is one of the stand-outs of this game, as this is the nightclub Eric frequently visits, loaded with stuff happening: people on the dance floor (and yes, you can join in) and people are everywhere doing things (making-out, chatting, having dialogue, having drinks, etc etc). The club just oozes cool and it feels like you really are there. Even the music played there - and any other original music played throughout the game, for that matter - sounds great + fits this vampire-themed game.   Another thing this game gets right, it's having Doug Cockle on board here, who did the voice for Geralt in the Witcher series. Cockle does the voice-acting for Eric Bane and delivers. While most of the voice-acting is all over the place, Cockle is the glue that holds the game together - always making the player want to press forward, to see what he says next and what happens next. His voice, his delivery, and everything is the best part of the voice-acting in this game. Sure, while a few other characters do a decent job (i.e. the voice-actresses for Rose + The Angel) - that pretty much is the end of that. Most of the other voice-acting in the game is all over the place.  The writing often feels like its right out of the Spiders camp of games (i.e. think Mars: War Logs). The story, writing + dialogue one moment can be dead-on and surprise you, being actually quite good. At other times, it's completely stilted, odd, and just doesn't look + sound natural at all. At some times, the game actually delivers something that feels like it is its own and is quite good; yet at other times it feels like its out of The Book Of Predictable Plot Elements, Twists + Turns 101.   If you're going to play this game, it's going to be very stealthy. This is a full-on stealth game - or else, you will likely get slaughtered. Most of your attacks and moves, especially early-on, are going to be melee moves. Early on, you're going to be basically sneaking up behind enemies and knocking them out or feeding on them. Most attacks here are one-hit kills, by the way. You gain experience points (XP) in the game, which you can use to upgrade and unlock abilties of your choosing. Later on, you might learn a few distance stealth kills and other cool moves. You can do a teleport move, which feels like it was in Dishonored. You can feed on certain enemies, which can replish your abilities - which sounds right out of Vampire: Bloodlines. One cool move (Shadow Grip) is you can grab an enemy from a distance and then slam them to the ground.  One problem here is the save system + difficulty system, which pretty much go hand-in-hand. This game is not an easy game, by any means - especially early on, when you don't have many abilities. Players should know this: that even on Easy, the game's tough. On Easy, you also get extra XP per kill and for what you do in the game-world (finding data in the game-world, doing the very few side-quests in the game, getting kills without being noticed, etc etc). On Easy, you have an unlimited number of Saves. On Normal (which should've been labeled Hard), the game only gives you 2 Saves. At some points, though - you might generate back another Save, once when you reach a certain point. Though, auto-saves (which won't cost a Save on you) are spaced-out quite a bit. While I didn't touch Hard, it's said that you cannot manually save period.   Many players will likely start on Normal (like you should, in most games). But in this game - especially for a first-time run through, you're better off going with Easy. It's unfortunate that the terms of this game when selecting difficulty are not explained up-front and out-right, unlike say other stealth games like Hitman: Absolution. Luckily, you can change the difficulty while in-game, if need be. I spent around 17 hours with game, but it probably should've been anywhere from 7-10 hours - since I began on Normal, yet somewhere in the middle of the game switched over to Easy because what was a hard game was getting insanely hard.   When it's all said and done, DARK delivers an experience that is all over the place. Its execution isn't always the best at times, yet other times it's down-right great. Sometimes certain elements deliver, yet at other times that same element doesn't. DARK is a game that I wanted to utterly love because of its cool premise of a stealth-based game with vampires + its excellent atmosphere, but it would up as a disappointment because of other things (i.e. all over the place voice-acting; some stilted dialogue + writing; and some not-so-good voice-acting).   Its consistently great art direction, atmosphere + music are worth experiencing alone, if you can find the game on sale dirt-cheap somewhere. But as it stands at its $40 MSRP currently on Steam, I can't recommend DARK at that price.   Final Grade = C-.",
            "review_score": "-1"
        },
        {
            "review_text": "This game isn't perfect, far from it. But I like it. I can't put my finger on it. But it has charm.  The environments are nice, the level design is acceptable, stealth is needed (for the most part). It's fun.   It has it's problems. Some skills are awfully overpowered, and make the game too easy. Their strength is offset by charges. Charges must be regained through melee attacks, which can take a few moments to perform. It also requires that you isolate your target, otherwise you'll be alerting gaurds. Still though, there is an impressive list of skills you can purchase. You should be able to get all of them by the end of the game. But as I said, some are much, much more powerful than others. Some are practically useless.  I still give this game a positive rating, however.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just horrible! It's way too hard and stupid because your powers need to recharge with blood that you need to suck from victims, the victims being a lot in a room (cops) and it can be outraging trying to get them! This game is way too expensive for the poor storyline, the playthrough and the graphics! I haven t finished it and i don t intend to! i give it a 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Sorry can't defend them with 'it's only a small company with two dozen people'. That's more than enough for an independant publisher.  To put it simple a team of 20 could and do put out better games on the Unity engine in there spare time.",
            "review_score": "-1"
        },
        {
            "review_text": "It's as if they realized that it was too short and up'd the difficulty to make you have to try and try again. Some of the pasive 'powers' are functionally null...as in they seem to do nothing. Even at the strongest level some of the active powers are just barely useable.",
            "review_score": "-1"
        },
        {
            "review_text": "So I have seen numerous reviews on here for this game, and for the most part, they have been negative? Why? Yes, this is a hard game(most Stealth games are), and not meant to be a run/gun action game. If you get this, take your time with it, learn the gameplay, observe the guards patrol routes, etc. Trust me, if done right, this game can be a whole lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "You notice the faults a little less after playing it for a while but don't buy it for more than 6.99. The ending is very ' ...ok...that's it?' asking you to make a choice between the 'love interest' who has been helping you throughout the game (which is like the span of 48 hours or something?) and this character who is apparently the bad person. The game doesn't have a lot of content or replayability. I can't believe once upon a time I paid full price for this game.  - This game feels more like it was released in 2007 than 2013. Visually, the style had promise (a tell-tale like picture), but the animation and models are so atrocious that nothing could truly save it (honestly it could only be improved if the mouths didn't do that weird thing, and the teeth, what's up with that? Also apparently the people who designed this have no idea what people look like while they are standing, or even perhaps what a person looks like, because protags hands have definitely been trod on by a horse).  - The voice acting is alright (passable, but far from noteable). The speech and dialogue itself however, is bizarre. In a bad way. Why provide immersive dialogue when you could instead explain everything in just the way conversation doesn't work. The conversation system feels like a thrown in feature used simply to break up the actual game, rather than a necessary part of the story.  - The control system isn't friendly to remapping (you can, just don't expect to be able to remap to custom keys), and the game either doesn't seem to recognise a click at all or just straight up takes a double.  - The story is nothing new (honestly what is about this game), classic 'who am I/what's going on/how did I get here' hero learning about his new powers. Stealth based, though after a few chapters of stealth kills and racking up the points, you'll be powerful enough to forgo and just charge through to be honest, so fair to call the skills overpowered.",
            "review_score": "-1"
        },
        {
            "review_text": "What a massive piece of ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Good stealth game. kinda like playing thru the movie Underworld.",
            "review_score": "1"
        },
        {
            "review_text": "honestly i came into this game with low expectations and i was still disapointed, the only real redeaming feature i can find is the visuals but for me thats not enough for it to be even an enjoyable bad game.  2/10 Avoid",
            "review_score": "-1"
        },
        {
            "review_text": "It feels like they tried to make a good game but the mechanics are broken. the game is way too hard on the lowest difficulty. if you are in an enemy's line of sight for .2 seconds you will be detected and you might as well give up when that happens because you won't be able to hide for the whole 3 minutes of alertness which resets if literaly anything happens. 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Despite the bad press this game has received, I think it definitely has its charms and deserves a recommendation, at least when on sale. Its strongest point is probably something many players overlooked due to the steep learning curve:  Pros: + The sense of achievement the player gains from beating tough areas and reaching a save point is amazing and the game's strongest point. This only comes into effect on hard difficulty and when playing the way the game wants you to play, namely as a pure stealth game. + Feel truly like a very powerful vampire. + Story with twists and turns. + Aesthetics, environmental level design and atmosphere.  Cons: - Weak universe that is not particularly fleshed out or believably developed. - Very linear, hardly any sidequests. - Bugs, mainly relating to the AI, the ragdoll physics of the enemy bodies and the display of collectible PDAs. - Easy difficulty and openly fighting enemies makes the flaws in the AI very easily apparent and makes the game very easy.  - Unfair learning curve. - Occasionally feel like a vampire with two left feet.  In general, DARK would have benefitted from larger hubs to flesh out the world and characters, making it more like Deus Ex and intensifying its atmosphere. The first level is also disproportionately hard, since you have very few tools at your disposal and there are too many enemies, reversing the learning curve in a rather painful way.",
            "review_score": "1"
        },
        {
            "review_text": "Not really good. Bad animation. Low story, only sneaking around without weapons or real powers. Its a room to room game.",
            "review_score": "-1"
        },
        {
            "review_text": "wHAT A PIECE OF ♥♥♥♥ THIS GAME IS 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Noobs say 'Horrible game', horrible game sais 'Noobs'. The lack of saves and quicksaves makes this very annoying on normal or hard. All the COD kids out there should just go for easy, then the game becomes fun.  Oh and a tip: if you Alarmed the oponents, just reload the last save. Eric is a vamprie but not Chuck Norris, he simply isn't meant to meele a dozen of mercenaries shooting at him.",
            "review_score": "1"
        },
        {
            "review_text": "Like this other person said: Despite the bad critics, I'm really enjoying this game so far. Of course its not the best game I've played but I think its pretty good. At 80% off with kalypso sale, deffinatly a must buy if you like the genre.",
            "review_score": "1"
        },
        {
            "review_text": "I seriously don't know what the ♥♥♥♥ I was thinking. It's an impulse buy I dearly regret. It's a game that took stiff to a new level on top of being unoptimized ♥♥♥♥. 0/10 They didn't even try.",
            "review_score": "-1"
        },
        {
            "review_text": "this game...i bought it for 20€ or something, i was expecting it to be GOOD...i was horribly wrong...i hate everything about this spawn of satan... i managed to fight through 21 min of pain and suffering before i exited the game, and started hearing sad music like ''mad world'' (gary jules version) while crying myself to sleep...i really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, really, hope that whoever summoned this demon like creature from the dephts of hell dies a horrible death.......and that i get my money back.....im still recovering after the DAMAGE this demon did to me...i see my therapist every now and then to talk it out. it's really bad when you have ONE OF THE BIGGEST COMPANYS EVER TO RUN (HYPERION). alot of people say hyperion is a company of ♥♥♥♥♥♥♥s...well whoever made this is far more evil. i see light in the distance, i will be back to normal soon...i hope all you people who bought it will have the same luck (unless you are vault hunters, then die)    no but really, this game sucks 11/10---IGN      no but srsly, 1-10---Me",
            "review_score": "-1"
        },
        {
            "review_text": "There are different kinds of stealth games. There's the gentle stealth game, like those mini stealth runs in LoZ that require no challenge at all. Then there's Skyrim stealth, which is ludicrous and meh. Then there's Dishonored stealth, where enemies actually react and show off how a person reacts to stealth, and pay attention to things. And then there's DARK.  This game's stealth is INCREDIBLY difficult! And enjoyable. DARK is a challenging stealth game, putting you into the role of a vampire (you do not sparkle) trying to find his creator so he doesn't end up a mindless ghoul. The AI is well done; they follow good pathways and block exits normally, and during hostile moments they wander, and work well together. They cover each other. THEY GIVE COVER!  Overall, worth the buy, but only if you enjoy stealth games. Otherwise, you'll spend hours just sitting in the same spot going 'ffs move you ♥♥♥♥♥♥♥ guard.'",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game if on easy mode. not enough saves on any other level.",
            "review_score": "1"
        },
        {
            "review_text": "Started very bad, but turned to be pretty good as soon as the snkeaking started.",
            "review_score": "1"
        },
        {
            "review_text": "it's ok, not as bad as these reviewers make, mostly because i don't think they take the time to learn it. Read guide, you'll be fine, it's not a bad so-so game.  I didn't look at the reviews when i bought the game, i just looked at some pictures, and a gameplay trailer, and i said, meh, let's get it. Then after buying it i saw so many bad reviews and that really got me thinking, but then i played it, almost hit my new keyboard for like an hour when i started playing this, before i learnt the game system, and how to play as supposed. Just cover, cover, cover, sneak, kill or feed.  You also have plenty of powers and skills, which can be purchased with skillpoints you earn really easy while playing.  It's sad that we don't have many vampire games these days. If you catch this game at a sale, get it. It has glitches and bugs, but it's not as bad as these reviews might make you think. I think it's pretty cool, and deserves to be played.",
            "review_score": "1"
        },
        {
            "review_text": "Dark, what can I say about Dark? Possibly the most annoying and enticing stealth gamplay I've played since Deus Ex. Make of that what you will. Dark is not polished, Dark is not deep, Dark aspires to one day have the writing quality of a b-grade 80's action movie, But Dark does actually manage to do stealth halfway decent in its own way. But that way is definitely not for everyone. . .  I bought Dark on Steam because it was on sale, and THEN I heard what people were saying about it, oh WHY do I bother to listen? But the interesting thing about the reviews were the comparisons to Thief and Deus Ex, and how Dark falls short, being frustrating, boring and repetitive. I'm sorry? frustrating, boring and repetitive? That pretty much describes my experience of those two games, yet I somehow managed to finish them despite spending hours trying and failing to stay stealthy. Still, the comparisons are apt, I was five minutes into the game, and I found myself thinking: 'okay the story and voice acting are predictable as heck, but why do I feel like I'm playing Deus-Ex?' Granted, Dark will never be either of those shining jewels of adolescent nostalgia that many of us remember as 'Deus Ex' or 'Thief', but saying it falls short merely because it is difficult just reads like nostalgia bias to me.  Let me digress for a moment by leaping sideways into a comparison... When Rise of the Triad recently got a reboot, what emerged from the rebooting process was a graphical update with all the misshapen heart, and twisted soul of the original: lame jokes, drug references and all. Yet what I was left with, was the sense that a perfect recreation of my schoolday afternoons in a modern graphical engine laid bare just how small and easily entertained my 10-year-old mind was. In much the same way, Dark's gameplay calls to mind the stealth FPS games of the late 90's and early 00's: Thief, Deus Ex, Hit Man, etc. but this time in a good way. Clearly I've lost 80% of the audience right off the bat with that one, but nostalgia is a funny thing...  You see. I've save scummed my way through the first two missions, carefully rationing out my two saves per area, stealth-killing my way through enemies, and resetting time and time again. I have rage quit at least two dozen times and taken seven hours of real time to get through four hours of gameplay. But at no point in all my failed attempts at silently taking down a couple-hundred armed mooks have I been able to honestly say: 'that one was the game's fault.' and that's what keeps me coming back, that's the thing that reminds me of Deus Ex (at least, how I played it). I'm not being coddled, in fact I'm being threatened with deadly weapons, but Dark neither blames me for failure nor rubs my face in it when it beats me again and again and again. Success in Dark is its own reward, and failure is a learning experience.  In this day and age of short attention spans and shorter patience, Dark IS frustrating and repetitive, because you will be frustrated at how often you're repeating the same sequence over and over and over. But that is the lot with any true Stealth game: if you screw up prepeare to reload. This is a major reason why any game that involves stealth as a mechanic these days refers to itself as having 'stealth elements' because it will give you a way to fight your way out of the pickles you'll get yourself into. But as soon as you give a stealth game a 'violence parachute' then stealth immediately takes a second seat to the alternative. Why? because it's easier.  I honestly haven't had a problem racking up XP, nor have I had an issue with the controlls, but I think that Dark is made for a particular style of play, and a certain kind of player. That player is definitely me and the play style is 'creeping death': Slowly and painstakingly working your way from room to room picking off all the enemies one at a time. As a stealth action game Dark is also a puzzle room game probably MORE of a puzzle room game than a Stealth action game. Only all the puzzle elements are also ambulatory and packing automatic weapons and supernatural powers. When taken in this context and played in this manner, Dark is actually FUN. The goal of each little segment of level is not to simply get to the next one, the goal is to cut a hole into the web of mutual surveillence the guards are wrapped up in. Isolating and neutralising as you go until you can sneak on through, and it IS possible.  I think however, that there is a better comparison to be made for Dark, the game I am reminded of is even older than Deus Ex, Older than Thief. That game is Robot Rooms. I don't know if obscure shareware games for win 3.1 needed rebooting, but there it is.  If you don't like puzzle games, or if your idea of stealth is more in the vein of Assassin's Creed or Dishonored, Dark is not for you. If you expect AAA voice acting and a complex, deep storyline, Dark is not for you. If however you're something of a completionist, if you're a patient and methodical hunter in FPS games, leaving nothing but corpses with surprised looks on their faces behind you, and if you enjoy a challenge, then you might just like Dark.",
            "review_score": "1"
        },
        {
            "review_text": "I wanted this game when it came out for some reason. I finally bought it coming off my Castlevania: LoS high. I should of not listened to myself on this one. The faults in this game overexceeds the playablity unfortunately. I got this game on a great xmas sale, but still feel like I shouldn't have paid over $5 for it. First off, lets start with the graffics which appear out of date and poorly mocapped for a game that came out this year. You add the extremely poor voice acting and this game just seems very 'cheap'. And believe it or not, that's not the worst parts of the game! The difficulty is unbalanced with the AI (even tho they are just humans) overpowering you very quickly and unfairly. But get this, even though your a 'powerful' vampire, YOU CAN'T EVEN ATTACK THEM. Once spotted you're pretty much dead and then you have to start the section of the level over again, killing the 15 humans you've worked so hard to kill OVER AGAIN. Which makes it even worst is the controls for this game which are loose and clunky, some moves actually having no use at all. If you spent your last once of money to buy this game and are stuck with it, then you've got to have the patience of a monk to play it. I wanted to compare this game to Tenchu which I grew up loving as a stealth ninja series, but even in Tenchu you were able to attack once spotted and the AI wasn't so 'cheezy' and overwelming. The only good things I can say about this game is that the power ups are very interesting and make the game 'slightly' fun, but it's definitely not enough to make it not 'suck'. &lt;---C'mon you knew that was coming lol.  If you want to play a 'newborn vampire' game, I would recommend Vampire Masquerade: Bloodlines instead of this. Even though VM:B is much older it has a better story, character options, choices, adventures, playablity......let's just say that it's an all around better newborn vampire game than this mediocre attempt.",
            "review_score": "-1"
        },
        {
            "review_text": "Similar to splinter cell or any other stealth games, just with vampires and ghouls, pick your targets and execute them in various styles, had fun playing this game, took well over 5-6 hours for me since i perfectly planned every move and so on. Great game, maybe ill try the dlc, will check it out.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Vampire The Masquerade Redemption or Bloodlines you'll probably like this since the ambient feeling is there! Even though it's not a AAA-title it's definitely decent enough even though it lacks some polishing. But since all games are more or less the same now days this feels fresh. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "A good game with great idea but not many things to do. Story makes sense. Controls are ok.  Some people may complain about the graphics but personally I think it's ok, if compared with Borderlands. Well, I'm not saying that Borderlands has worse graphics, it's just about people's own likings. Some people like Minecraft's pixel graphics, some others prefer Crysis 3's graphic cards burning quality.  The main story feels like  unfinished  (or that should be the proper ending), and It definitely gave me the impression that this game could have more DLCs and expansions to play, but sadly no.   The only thing you may enjoy after beaten the whole story is racing against the cloak and completing some difficult challenges. There is a leaderboard for these challenges, but does it really matter? Ask yourself after a glance on people's review and release date.  Oh and, although I think this game is okay, it's still a little bit overpriced. I recommend anyone who's interested in this game buy it when it's on sale, with at least 25% off discount.",
            "review_score": "1"
        },
        {
            "review_text": "This is quite possibly the worst game I've ever played next to Day One. Made it about 15 minutes before it became unplayable. Everything is so buggy it is totally and completely unplayable.",
            "review_score": "1"
        },
        {
            "review_text": "To be honest, it feels like vampire is just an excuse to create a hitman game with superpower. I would say the movements feel slightly worse than Hitman Blood Money, but mechanics are good enough.",
            "review_score": "1"
        },
        {
            "review_text": "hay um i just bought this game but it says i need a email and password to play it were would i beable to make this email password at??",
            "review_score": "1"
        },
        {
            "review_text": "Edit: While this game looks like a decent stealth-vampire game on the outside, it really isn't. The game is extremely linear, except for the end, which is something I hate in a game. The story isn't that great either, and is pretty much a mix of everything I hate about modern fantasy. All you do is hunt down one vampire after another, fighting the same generic guards every time. The only other enemies are these zombie things which aren't much different. It is one of the most repetetive games I've ever played. Some of the maps are admittedly pretty cool and different, but still boring to play. The addition of an RPG-like system is nice, but not enough to redeem this game. 4.5/10  Just get Half Life complete instead. If you already have that than get Skyrim. And if you already have that than get anything else for $40. 4.3/10",
            "review_score": "-1"
        },
        {
            "review_text": "EDIT: I just realized the game's steam price is $40. NOT WORTH $40!!!!!!!! The game is worth $10-15 max and I only recommend it in that price range. I got this game in a BUNDLE and it was worth it.   I believe the disparity in how much people are paying for this game is determining the reviews. If I had paid $40 for this game I'd be pretty ♥♥♥♥♥♥ too! In fact, my review would be negative if I had paid that much, but since I paid less than $5, it is positive.  ---------------------------------- Low budget Batman Arkham clone with only the 'Predator' elements.  VERY OVERPRICED on steam (but quite good at the $10 range)  PROS: -Good stealth abilities (Its basically the 'Predator' stealth parts of Batman Arkham without much of the combat) -Good RPG aspects (but they are useless at lvl 1 and overpowered at max lvl...)  NEUTRAL: -Difficulty implementation seems good at first, but I'm not sure if it really makes much of a difference. -Graphics are good enough. -Can be save scummed (slightly encourages it due to variant enemy behavior, see below)  CONS: -NOT WORTH $40 -Level design gets very repetitive due to boring AI. -Enemy behavior is occasionally slightly different even when reloading+doing the same thing. -Combat isn't very good (but I played on hard so I only got exp for stealth...so I only used stealth) -Enemies spot you at somewhat awkward distances. 10 feet he sees you! 10 feet, 1 inch...doesn't see you anymore!  -Enemies have extremely rigid patrol paths with no variation. -A couple animations are almost verbatim copied from Batman Arkham series   All in all, if you enjoyed the 'Predator' components of Batman, this is it's well done lower budget cousin.",
            "review_score": "1"
        },
        {
            "review_text": "One big bugfest.  no hot saving, so you have to start back 20 min if yoou get caught on the wrong bug-foot",
            "review_score": "-1"
        },
        {
            "review_text": "A rather well made game, solid mechanics, though no real 'combat' at least not what you'd expect. The story on the other hand..... a laughable B-movie script at best I'm afraid, although there's still enough to keep the game ok.  All-in-all, a good game, just not quite enough to keep me playing longer than necissary.",
            "review_score": "1"
        },
        {
            "review_text": "'Didn't like it, wish the hell I could forget it.' - Alex Mercer",
            "review_score": "-1"
        },
        {
            "review_text": "Being a fun of white wolf's Vampire the Masquerade, i was really looking forward to getting this thinking it would be something similar to Bloodlines in terms of style......boy was i mistaken......  The game was terrible, the writing was atrocious, to get an idea the name of the main character was .......Eric Bane, a name that feels like it was picked by a 10 year old like Phoenix Steel or Damian Dark or something as pretentious. The dialogue was equally laughable with very poor plot (at least up to the part i played but i doubt it gets any better after the tutorial unless the first team died in a mysterious accident was replaced by a team of actually competent developers). The final nail to the coffin that made me say 'enough is enough' and urged me to kill my character and put him out of his misery was the terrible and unimpressive gameplay.   The only thing i enjoyed in the game was to discover that the first mentor to the character was a club owner who, judging by her face, was based on Rose McGowan and is coincidentally named Rose :P ",
            "review_score": "-1"
        },
        {
            "review_text": "Absolutely ♥♥♥♥! 2/10 you can't do anything when caught, no multi use powers and no base attack. When you press attack he doesn't attack, when you hold to drink he kills someone. Doesn't finish the job when killing someone. Poorly made and constucted, I'd never recommend anyone play this game unless you want to die from stress.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible VERY sorry I bought it on sale",
            "review_score": "-1"
        },
        {
            "review_text": "I really didn't expect it to be bad. Good thing I got it on sale and did not waste 30 dollars",
            "review_score": "-1"
        },
        {
            "review_text": "Easily one of the worst games I've ever played, terrible control, clunky stealth, incredibly bad story. Only plus here is the main character's voice actor, everyone else is of course terrible. Avoid like the plague",
            "review_score": "-1"
        },
        {
            "review_text": "I'd give it a 3/10. It is very repetitive and boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Damn i wasted my money on it. always on stealth no action",
            "review_score": "-1"
        },
        {
            "review_text": "Story is, acceptable.  Combat is just the worst i've ever seen in my life.",
            "review_score": "-1"
        }
    ]
}