{
    "app_id": 225640,
    "name": "Sacred 2 Gold",
    "release_date": "2012-12-21",
    "developer": [
        "Ascaron"
    ],
    "publisher": [
        "Deep Silver"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "RPG"
    ],
    "tags": [
        "RPG",
        "Open World",
        "Hack and Slash"
    ],
    "achievements": 0,
    "positive_ratings": 1177,
    "negative_ratings": 495,
    "price": 10.99,
    "description": "Experience the world of Ancaria in its full glory with Sacred 2: Gold Edition. Containing Sacred 2 Fallen Angel and the awesome add-on Ice and Blood. Defeat countless dangerous enemies; capture powerful weapons and valuable treasures. Prepare yourself for the ultimate battle and become a legend.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/225640/header.jpg?t=1447357017",
    "minimum_requirements": "OS:Microsoft® Windows XP (32 / 64 Bit) with Service Pack 3 / Vista (32 / 64 Bit) with Service Pack 1 Processor:2,4 GHz Processor Memory:1 GB RAM Graphics:Graphics card 256 MB RAM, DirectX® 9.0c compatible, with Pixel Shader 2.0 support (from nVidia® GeForce™ 6800 or ATI® Radeon® X800)  Hard Drive:20 GB HD space Sound:DirectX compatible sound card",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sacred 2 gold is an amazing game. If you purchase t his game, you should make sure that you search for, and download the community patch. You can also download a community addon patch, and there are some other mods out there. I'd also highly recommend taking a look at the sacred 2 characters, their skills, and possibly some guides on how to build them. You can play through with any character in this game, but if you build them wrong, you will pay for it at higher difficulty levels.  This is a very good action RPG/Hack N Slash. It is a huge, beautiful, open ended world. The graphics are incredible if you turn the settings to maximum. The world is a living breathing world, like other reviewers have said, there are lots of small things like birds building nests, people talking to each other in towns, etc in the game that make it feel alive. If you have a Nvidia card with physx (however it is spelled), leaves will blow around and react to your spells. This happens in all environments like in dungeons.  Ignore the warning about not being optimized for WIndows 7 PCs. IF you google Sacred 2 crashing windows PC, you'll get a guide on how to create a shortcut that has a few command line options enabled, while also changing the shortcut to run the game in windows xp SP3 compatibility mode. If you do that you should be fine. The game also frequently auto saves when you teleport or change areas, so in the even of a crash, just load the game back up and you'll be right where you left off.  If you have played this game on a console and are wondering if its worth purchasing on the PC, the answer is yes. The expansion pack is included in this PC version, and with the community patch you can unlock Christmas island. You also get a carrier imp included with the gold package which helps store extra inventory.  If you download Tunngle beta (Free) you can play this with your friends CO-Op.   Endless loot, endless enemies, endless hack n slash action RPG adventure goodness. What are you waiting for! ",
            "review_score": "1"
        },
        {
            "review_text": "9.9/10 A HUGE world with quirky comedy, killer combat and EPIC quests. Detailed, deep, min/max-ing doable but not necessary. This is 'The Skyrim' of Hack 'n Slash games. Champions of Norrath on steroids. FAR better than Diablo 2 and 3 in my opinion. For $20 it is a STEAL. Love it. I took .1 points off for crashing 3 times in 350 hours.  Also I bought a new rig for this game because the GPU requirements were too much for my 2.4Ghz I3/ 9800GT gpu.  I am running a 3.4ghz I-9 and the newish Nvidia GTX 750ti EVGA -OC- SC. All settings CRANKED with an HD resolutions pack and never dips below 60FPS.  Best $1400 I have ever spent, this game is gorgeous when you can use all of the avaiable graphics.  Just buy it and play it and love it.  P.S. Sacred 3 was an insult to ALL gamers and should have NEVER been made !!!",
            "review_score": "1"
        },
        {
            "review_text": "It has Blind Guardian in its soundtrack. Sacred Worlds is one of their greatest songs. 'Nuff said. Go buy. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game and its ok however be aware if your color blind like me you will not be able to make out the red on red health bar. Whoever made this game decided to use some strange color choice for the health bar and I cannot make it out. So frusterating and there is no simple fix for it. Also the Co op feature is not very good at all. It does work however its still not very good. Just a heads up for color blind people like me. This is the only game I have every played where I could not see something. I would recommend this for single player and for people without being color blind. I would give it a score of 7/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like playing isometric rpg games, you should definetely get this one.   Pros: * Huge map (openworld) * Vast variety of items to loot * Multiplayer is fun to play via LAN * Interesting skill tree and combos * Nice looking character visuals and items * Lots of quests to do * Very long play time * Mounts * Two different paths for campaign (Evil or Good)  Cons: * No active servers to play online * No creativity in boss fight tactics and styles * Repeatitive quests * Escort quests are pain in the a**",
            "review_score": "1"
        },
        {
            "review_text": "The fun factor I get from this game is superb. The fiddly start and crash only happens occasionally when I have been playing for 4 hours. Would I recommend it hell yes. hours of missions and discovery.",
            "review_score": "1"
        },
        {
            "review_text": "Well I've only played 40h so far, but I certainly like this game a lot.   Pro - good selection of classes to choose from  - funny quotes and humour - huge world to roam - option to be good or evil - lots of thing to do - crapton of quests  Con - camera angle; it's bit restricting, but you can get used to it - ranged character moving towards mobs instead of shooting a bow - game doesn't really explain/teach most of the stuff you need to know for character skills/runes etc. (so bit of googling before starting to play is in order) - physX; yea I have amd gpu but I needed to install nvidia program to play the game  Other than that, I can't think of more to complain. Some ppl have mentioned crashes, but I've had like 2 crashes so far out of 40h playtime. So I don't see it as a huge problem. Saving is as simple as hitting F7, which I do at least once every 30mins (and game autosaves every time you enter/exit a cave or complete a quest), so losing lots of progress is odd complaint unless you consider 15mins as lots.  Well worth the little money it costs. Also there seems to be some community patch to fix some issues.",
            "review_score": "1"
        },
        {
            "review_text": "one of my favorites in ze action rpg genre. the game offers a big map, 6 distinct races, and a lengthy campaign. including a secret mission with the band Blind Guardians which is pretty cool. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Sacred 2 is a great game. I loved playing it for hours on the console and it's even better on PC. There are only two things wrong with Sacred 2. -It's extremely hard to launch, requiring fiddling with the files every time I want to launch it. -No multiplayer outside of LAN. (And it's still balanced for Online Multiplayer. I.E. No Reclassing)  Still, if you don't mind plunging into the files every time you want to launch (Or your operating system can run it as-is), it's a great game.",
            "review_score": "1"
        },
        {
            "review_text": "What can I say for an old game? The graphics aren't the best but that doesn't matter at all! It's up to the point where it's amazingly fun, and I actually do find it fun! For being a game made from Deep Silver, or at least I think it was released by them in 2008, I'd still say this game is ridiculously fun. If you enjoy a top-down role play game that is like Torchlight, or the likes I'd go for it. Lots of classes to choose from with a variety of abilities for each. Not to mention they all have their own path of the story and alliance to a god. If I were you I'd give this game a quick look, research and all before you actually buy it, but if you want to try it out for yourself I'm sure it won't disappoint!",
            "review_score": "1"
        },
        {
            "review_text": "When I first saw this, I lost my marbles and was looking for Sacred 1 so I didn't have to watch hours of video to get through the story. As far as I know, this is a standalone title.  The first thing I noticed about the game was that despite everything it represents visually, the game had no remote support, thankfully, a little fooling around with the remote and some trial and error and I have it in good with the controller, The game came off as a bards tale, just because of the annoying camera, and this is hindered even moreso by dodgy mouse controls, in rare occasions you'll find yourself tapping at one stair to get out of a bad see through stairwel. After fiddling with the camera angles a bit and tweaking the zoom I realized this game is absolutely magnificent.   Unlike most looting games, this one takes the form of every one of them in a way that gives you a morrowind feeling but all of the time, whether it's a lucky store visit or another cave run your eyes are always oopen for that rare grab that'll make you drop your inventory in front of enemies just to get the item for sure. The save anywhere do anything aspect really shines when you realize you have to take a long trek again and have to do a lot of walking.  I only have about 9 hours in, so I don't have too much of an opinion but I'm pretty much camping in the level 3-5 area completing all of the quests. A big problem I may face later in the game is having that rare level 2 item that's way better than the items beyond. But I'm almost certain this game will have a very nice way to go about it.  If the shared box works as I would hope, you may be able to share items across all saves, making the game progress in a fairly breezy yet new way, and since you get drops of all races from the game, you may be able to start a more serious difficulty after you get rick rolled about how easy bronze is feeling.   I've had one bad encounter with an ally npc... he ran in the middle of a mob with a bow... I was so mad. However no other npc has behaved that way, the npcs that don't fight actually run away and know very well and how to stay back I could sit in the inventory menu in deep thought while trolls are running amok and the npc will be seen crossing the screen staying away from enemies. It's a very nice sight.   For me, This game is a deliverance. You get that mmo feel of being strong and having loads of opportunities to make armor builds with great purpose, you have gear that differs by race that drop often and are sold on an average occasion, characters that look really sharp and have cheesy one liners that go great with the enemies, who have their own. and an all around experience that will go from bards tale to a point and click mmo just by changing the camera.   Edit: After about two more days I decided to change the difficulty and wanted to flip out. All of the quests were reset but my stuff was still intact, map data was intact but no portals were active. I went back to bronze, and all of the data returned. In my opinion, you should use one data to complete the story and another to enjoy the quests, This feature is probably the best I have seen, thougrh the repetitiveness will probably make you sick, this is one of those games that even when you get finished... Lol in about 4 months, youre not really finished. I have 4 days of game time in bronze and i still have about 14 circles in the large city just sitting there. And I probably wont address them until I've caught up in silver, So I can speed through bronze. This is one of those games that would make you gain hope in an era of games just because of the sheer value it gives to you. Though it is not the era, It is only this game.  In another light, the way that the quests are displayed will bring out the completionist in anyone... seeing failed red circles in select spots bombarded with green is sort of depressing, as well as a log book that has 2 red Xs among chapters of pure green. So if you do a quest, make it count and don't mess up if that sort of thing bothers you. Since there are two datas, (and possaibly more) You should do well to take at least one of them seriously in an attempt to wow someone with a pure green quest map.   I would reccomend it it anyone who needs a game. If they like story they can do quests, if they like a challenge, tell them to just run ahead. I'm sure everyone has paid much more for way less in this day and age. And I would hope people would want a game they would want to play after they beat it, and this game emphasizes on concepts that make you okay with playing it again. Even if it's just to be powerful and slap monsters around for a chance at seeing an item with beast stats.",
            "review_score": "1"
        },
        {
            "review_text": "I so wish this game had native gamepad support... I loved playing it on my ps3 and put many, many hours into it, but I simply can't play games like this with a keyboard and mouse. And I was really looking forward to playing the ice and blood expansion and being the dragon mage which never made it onto the console versions of the game in North America. Excellent game tho and is definitely worth playing, especially with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. It has a massive open world(see screenshot below) with tons of quests and so many different sets of gear and weapons. Customization of your characters is quit deep. It is surely worth picking up since it is so cheap. I own multipule copies of this, the original pre Steam version, PS3 version and The Gold edition on Steam(picked it up in a humble bundle for $1). Can still be played multiplayer with VPN tools. If you like ARPGs and are a loot hoe this one is a must have.         Sacred 2 Gold&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "it would go on sale right after i bought it.  gg  this is important. dont play temple guardian. he looks dumb, his armor looks dumb, his skills are dumb. everything about him is dumb. especially the way he runs/walks. looks like hes got a ♥♥♥♥♥♥ diaper.  anyways. its fun, its got a different skill progression that you dont see in any other game, the combat is about what you would expect from isometric games. spells and techs are cool to watch. the world is open to you from the get go. as in their are no borders from where you can or can not go. beyond the edge of the map that is. the quests are funny to read and there are a lot of puns an jokes. the humor is there, the combat is there, the progression is there. To be completely fair. you can definitely tell within 2 hours if youll enjoy the game beyond that. so returning is an option.   odds are if youre even looking at this youre interested in the game. i assure you its solid. try it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fantastic and unique action RPG experience that really stands on its own in many ways. I feel as though if you're a fan of exploring new ideas of what makes this genre great this could be a great gateway for seeing a lot of creative and fun potential and creativity.  The game is pleasing to the eye, extremely diverse, and in the end a rewarding experience! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Pros... -Big world to roam around and explore -A lot of quests; main storyline and side quests to keep you busy -Armour and weapons have their own designs (RPG rules dictate more skin = more defense,) -Gorgeous graphics -Campy, self-aware humor in the form of intentionally bad writing, voice acting and dialogue -Always stuff to slay and make you feel tough like the big, bad, skimpy Seraphim you are -Class customization with special traits, perks and four skill/ability trees for each class  Neutral?... -A lot of quests are just 'go here and kill X' or 'go there and gather X'. It generally works but can get tedious having to fight your skimpy butt through half of the continent to loot a stone or something and then sprint your skimpy butt way all the way back for an often mediocre reward.  -Character 'classes' are gender locked. I didn't care about this, but I recall it being a common complaint from critics.  -Too easy. Bosses basically have a lot of HP. Just slash away.  Cons... -The camera is atrocious. Good lord. -The AI is abysmal. Escort missions suck; for example, I had to escort a villager to his sister. He would dart clear across the map, aggro a bunch of crap, runs in another direction, aggroing MORE stuff, by the time I finally FOUND him, he was dead and I failed the quest. Don't expect other escort missions to be better. -No Steam Cloud support  Overall, it's an enjoyable hack n' slash and worth picking up, but I would recommend doing so on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "worth the purchase and price is very nice compared to when it first released and very easy to play not to mention replayability is up there in regards to the genre the game is in  ",
            "review_score": "1"
        },
        {
            "review_text": "Great Game. If you are looking for something that isn't yet another Diablo Clone, this is it. Open world with mounts, but still keeping with the dungeon crawl tradition.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent throwback to oldschool hack n slash RPGs, this game is thoroughly enjoyable, with good story writing (even though much of it is just in the logbook, not really thrown at you) and enjoyable combat with a variety of difficulty, you can either stampede through one horde of kobolds and then get slaughtered in seconds by some champion undead. All the races have their own main quest, and unique everything, from mounts to armor to amazing abilities.",
            "review_score": "1"
        },
        {
            "review_text": "When I first played Sacred 2, it was on the 360. I did not enjoy it. Literally, every time I loaded it up, I fell asleep.  Then, time went by, I became a PC gamer, and I got this. I expected to have the same kind of experience. I am happy to report that I do not.    Pros[/b] : +Loot, loot, loot, loot, loot, loot, LOOT! I guess what I'm trying to say is-  LOOT!! . There is tons to be had in Sacred 2. The merchants update quite frequently, and I've found useful pieces out in the world and in combat. As far as ARPG's go, this game brings it with tha booty!  +Seraphims are righteous b!tches. It entertains me to hear them cast judgement on the enemies or calling the townspeople 'simple'. It's a huge plus in my book.  +Character customization. Unfortunately here, I'm only talking in the Stat sense, not the appearance. As far as Stats go, though- I feel completely comfortable with making the exact character I want to play. One of the coolest, easiest, rewarding Stat mechanics I've seen in an RPG.  +Gorgeous world. Day/Night cycle, weather and PhysX that blows leaves about (if your PC can handle it). It is a gorgeous storybook world that gets splattered with blood. Win win!  +Enemy Scaling. This is quite the hot topic in the discussions, and it seems some people don't care for it. I, for one, like how Sacred handles it's Enemy Scaling- there is always a fight worth fighting!   +Mounts. The gorgeous world is huge. Portals can only help you out so much- you're gonna need a mount!    Cons[/b] : -Multiplayer is dead. Not so bad with an outside source like Himachi and others, but for those looking to hook up easily through Steam- leave that delusion at the door.  -Character customization- appearance. It's not very in depth. There aren't many hair colors available to the different races (but with a Save Editor, this is easily fixed). There is a nice amount of Skin choices, but no face options. Your Seraphims face will look like your Seraphim partners face. No big, but really worth mentioning.  -Can be overwhelming to the casual crowd. It's massive.  -CM Patch hasn't worked for me recently. It did once. It's not really a Con on the game, but it's worth noting because the CM Patch is the  better  way to play Sacred 2.    Overall[/b] : It truly is a great ARPG. It might even be my favorite ARPG, as I dig into it deeper. The freedom of Character Stats mixed with the gorgeous, well-envisioned fantasy world really makes this game stick out. I am glad I went back and gave it another chance... it's better than some of the games that have released recently.   ",
            "review_score": "1"
        },
        {
            "review_text": "best of the sacred series, THIS is an amazing top-down diablo clone. it outdoes diablo in terms of depth, open world, length, etc...though maybe not quite as replay-able...",
            "review_score": "1"
        },
        {
            "review_text": "Played it long time ago, and now it got my full attention again.  One of the best RPGs ever.  Could be best, if not the crashes and freezes :( But some lucky people says they're managed to fix them...",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly deep writing and the soundtrack kicks butt",
            "review_score": "1"
        },
        {
            "review_text": "very great game with a lot of equipment and class... love it.... want to try all the job here :D",
            "review_score": "1"
        },
        {
            "review_text": "I know my current playtime SEEMS small, but the truth is I played the ♥♥♥♥ out of Sacred 2 Gold on a copy before it was released on Steam. I played through the entirety of the vanilla game, over 60 hours, and let me tell you, I loved every single minute of it.  This is hands down the absolute BEST hack n slash rpg I've ever played. The graphics are smooth, crisp and well made, the combat is tight, the skill and combat art system is engaging and rewarding, there are literally THOUSANDS of quests to complete, monsters to slay, and loot to acquire, and there's a surprising amount of good, Larian-style humor here and there. Did I mention that the world is MASSIVE, likely TWICE the size of the original Sacred, Undeworld included?  Oh yeah, and the fan community is one of the best I've seen. It is incredibly helpful and eager to help new players ease into the game.  Speaking of which, let me end on a PSA. If you end up buying this, DOWNLOAD THE COMMUNITY PATCH. Not only does it fix a multitude of bugs, but it also adds a TON of new content to a game already full of it, such as new items, new quests, and new enemies to fight!",
            "review_score": "1"
        },
        {
            "review_text": "as with the previous game, the amount of hidden, additional, chuckle-inducing content and easter eggs in this game is simply astonishing. Sometimes I play it just for those and sometimes I play this game instead of reading memes.  It's also a fantasy RPG, in case you missed that.",
            "review_score": "1"
        },
        {
            "review_text": "Game is fantastic, but the online server has been permanently closed by the company. CO-OP still works locally, but thats as far as you can go in multiplayer now. ",
            "review_score": "1"
        },
        {
            "review_text": "Open world Diablo-ish hack and loot fest with more complexity, bells and whistles, and multiplayer features.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, recommended to diablo fans.",
            "review_score": "1"
        },
        {
            "review_text": "i used to love this game back in the day when it was called DIABLO lol.this is the most blatent diablo rip off i ever seen in my life ...but since diablo rocked ...um go ahead n try it",
            "review_score": "1"
        },
        {
            "review_text": "buy it classic fun at it's best and better than diablo 3 ;)",
            "review_score": "1"
        },
        {
            "review_text": "This game offers unlimited options of stuff you can do.. I played for over 40 hours and I've done only the first chapter ( I'm exploring everything) and I really love this game.. Unfortunately the company that made this game is no more so the game has a lot of bugs, but that doesn't make me abandon the game and nothing will ever make me change my mind! Sacred 2 is very good game and I recommend it to everyone. -wrap",
            "review_score": "1"
        },
        {
            "review_text": "sacred 2 different from other RPG games , huge maps which divided into several areas , lots of side missions , and interesting complex leveling sistem , good graphic with may effect and powered with ageia physx. the combat is satisfying but little to slow, you need to click a lot. side quest can be too much and repetitif. Boss battle can be difficult but chalenging.   is worth to buy ?YES",
            "review_score": "1"
        },
        {
            "review_text": "One of the weirdest ♥♥♥♥♥♥♥ games in its genre. Every class is pretty ♥♥♥♥ing distinct (down to armor slots, even - most of them are different SPECIES), a massive world, and a not-quite-Divinity-series sense of humor and charm that'll basically either sell you on or push you away from the game.  ♥♥♥♥, I'm pretty sure every class has its own starting area and chunks of quest too.  You cannot claim this game was half-♥♥♥♥♥, is what I'm saying, even if it's not the pinnacle of the genre. Holy ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 doesn't work for windows 8",
            "review_score": "1"
        },
        {
            "review_text": "Another great classic but with nice graphics.. holds its own among the likes of D2 , TQ, GD, Sacred etc. well made and great fun with oodles of loot and quests. If your a fan of the genre its a must play. Don't worry they did'nt use the name as a cash cow and sell you a load of useless crap like DS and Sacred 3 turned out.",
            "review_score": "1"
        },
        {
            "review_text": "i saw creepy eyes on the trees in the menu and ♥♥♥♥ my pants. promptly uninstalled.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "this game satisfies all of my autism and then some",
            "review_score": "1"
        },
        {
            "review_text": "i need help why my mouse not working when i start this game",
            "review_score": "1"
        },
        {
            "review_text": "For all I can say this is the ultimate Version of Sacred 2. With most of the bugs purged and a large world to play it still has a lot to offer. Even or especially in the days of Diablo 3. Sacred 2 is for those who seek the need for freedom and openness. You will and should continue playing Sacred 2 since its successor isn't granting you a huge world to play and has merely become a free2play game that was turned into a fullprice title within the last second however is not losing the smell of its inferior heritage. Let Sacred 2 have its renessaince for good.",
            "review_score": "1"
        },
        {
            "review_text": "It's a C+ game, reminiscent of early Runescape in its layout and quests. Player customization is pfft, item generation is diablo-esque, and prepare for lots of frustrating terrain, simple combat, and a dismally low level of environmental interaction. Camera is limited, AI is buggy. I would wait for a killer sale or else not bother with this title.",
            "review_score": "1"
        },
        {
            "review_text": "I finally got the game to work! The problem was with physx, I didn't have physx installed, but then I installed it, and now the game works!!!!!!!!!!!!!!!!!!! If you like the first sacred, you'll love this one!",
            "review_score": "1"
        },
        {
            "review_text": "After pouring more than 500 hours into this game, I think I can safely say that I can write a good review of this game. For those who enjoyed action rpgs such as diablo and torchlight, you probabaly will enjoy this game. Sacred 2 is an open world hack n slash rpg that is filled with massive amounts of content. I have to say the thing that keeps me playing this game is the leveling. Leveling up in this game is so much fun and super addicting. Gameplay is pretty solid, although it could be better in my opinion. Loot is definitely an aspect where Sacred 2 shines. The feeling of satisfaction you get after picking up PILES of loot from slain enemies is amazing. The character classes are all really fun, each have their own unique playstyle and all classes (excluding the seraphim and inquisitor) can choose between a shadow campaign or a light campaign.   Now I did mention this game is similar to diablo; however, if you are looking for the same level of challenge as diablo II, then this game does not have it. So for those who like a really high challenge, you might want to try a different game. This game is also known to have many glitches, which is why many others playing this game suggest the community patch. Personally I have not used the community patch and I have not ran into and game-breaking glitches.",
            "review_score": "1"
        },
        {
            "review_text": "One of my absolute fave top view action rpg's! ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game!!!! so so so epic Storyline, gameplay, etc",
            "review_score": "1"
        },
        {
            "review_text": "Bought the sacred franchise pack since I have played this title over at a friends house last year and I have enjoyed it so bought it finally for myself. Gameplay seems good and gives me the diablo feel to it which I do like. I am not sure about playing 3 based on the reviews, but will once I have played this some more.",
            "review_score": "1"
        },
        {
            "review_text": "An action RPG that I still come back to from time to time to scratch that itch.",
            "review_score": "1"
        },
        {
            "review_text": "This Game doesn not have proper support for Windows 7 and basically loads when it wants to. I have tried several of the work arounds listed inthe community pages and only with limited success.",
            "review_score": "-1"
        },
        {
            "review_text": "Savegame corrupted after 10 hours",
            "review_score": "-1"
        },
        {
            "review_text": "Kept freezing and crashing. Then i would have trouble loading the game up. It is not worth the trouble.",
            "review_score": "-1"
        },
        {
            "review_text": "I have purchased and it has yet to launch when I click play. It says the 'app' is running already and cannot start.",
            "review_score": "-1"
        },
        {
            "review_text": "No matter what I did, I could not get past the network error (64)... Even on single player.  Useless.",
            "review_score": "-1"
        },
        {
            "review_text": "This game could never even start. as it said it had a issue with a Nvidia GTX760 card not being reconized. Then all the Direct X functions in the game had issues also in trying to start. So all I ever saw was crashes to desktop. Thank god I only wasted my money during a sale and didn't pay full price.",
            "review_score": "-1"
        },
        {
            "review_text": "No more online servers dont buy if you plan to play with your friends. ohterwise the game isnt to bad but rather get it on console where the game was clearly designed to be played.",
            "review_score": "-1"
        },
        {
            "review_text": "By far the most crashing game i've ever playes.",
            "review_score": "-1"
        },
        {
            "review_text": "servers closed, and the quests feels very boring, maybe in coop it would be more fun, i don't know",
            "review_score": "-1"
        },
        {
            "review_text": "Motion-sickness inducing 3rd party view that CANNOT be adjusted. Unplayable for me.",
            "review_score": "-1"
        },
        {
            "review_text": "game not running on windows 10 for me 2 hrs of install time out the window",
            "review_score": "-1"
        },
        {
            "review_text": "I can't deny this is a great game, but it simply doesn't work on Windows 10. There are some workarounds, some of them are really complicated and most of them (if not all) don't help you to run the game on Windows 10. There should be a notification message on Steam store page about this issue. I can this unacceptable.",
            "review_score": "-1"
        },
        {
            "review_text": "I would have enjoyed this game except for two reasons  - Poor Camera angles - Lack of tutorial  Don't buy this unless you're really into the series. The game starts assuming that you already know the backstories and controls. It has a 'tutorial' but it is very poorly designed, as you'll end up figuring by yourself most of the controls and abilities. If that is not a problem for you, then I assure you, the camera will be. It is FRUSTRATING. Every step you take the camera will move on its own, and you'll end up stopping to adjust the camera to your liking, only for it to move again, out of angle. You'll end up losing your way because of the constant shift of camera angles.  I really, really wanted to like this game, specially since it has Blind Guardian in it, but I ended up disliking it.   Again, don't buy it unless you're into the series and you know what's up. Otherwise, spend your money somewhere else, this is not the game for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Multiplayer is not working! The game itself point it out, somewhere above, i just want to underline that statement, because not even LAN is working :)",
            "review_score": "-1"
        },
        {
            "review_text": "This game realy suck .. sacred 1 is so much better ..",
            "review_score": "-1"
        },
        {
            "review_text": "Whats this piece of garbage... total waste of mola..",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible I'm lucky to have got it as a gift and that I didn't buy it myself so honestly just go find a different game or play Guild Wars 2 if you have it or buy it or just play loadout hope this was helpful.",
            "review_score": "-1"
        },
        {
            "review_text": "Crap, total crap. payed I think 3 bucks for it and its worth less.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately this is by far worse than the first part and the best example how to ruin a good game",
            "review_score": "-1"
        },
        {
            "review_text": "Unoptimized for Win 7. Nuff said...",
            "review_score": "-1"
        },
        {
            "review_text": "Sadly it doesn't come close to the charme of the original game.",
            "review_score": "-1"
        },
        {
            "review_text": "It's much better use of both your time and money to track down a copy of Sacred 1.   I had only heard bad things about this game and most of them are true. It's very boring with none of the charm the first game had. I would of loved a 'lazy' reuse of the last game's engine sequel, atleast that would be better than this. Most of the quest are the same old 'go here, kill this' quests and it controlls like it was programed for someone with 6 fingers on each hand. Switching abilities is a pain and is hard to do in combat.  The characters are stereotypes of the ones in the first game, that were stereotypes to begin with, with a completly pointless customisation slider that just makes them all look the same. Not that it matters beacuse to be able to see more that 2m in any direction requires the screen to be fully zoomed out.   The map looks like someone lent on the brightness way too much and forgot what 'open world' means. Sacred ! was this world slowly falling in (and part of) hell, so very dark. Also it might look open but it's just a series of paths boxed in by invisible walls with little to nothing worth discovering in it.  Basically it is 'Baby's first Vanilla Fantasy Land',  'Tired of getting lost in a open 2d world?'  'Try our quest trail and fast travel systems to totally remove all sense of exploration or acomplishment.'  'Plus we've made the whole map boring and lifeless so you can be prepaired to know what real life is like.' and so on.  Compaired to the first game it's bad, as a game on it's own, it's worse.  Spend the $20 on a better fantasy game, there's a ton of them out there for much less.  I'm happy to of got this on sale, even then it was still a rip-off.",
            "review_score": "-1"
        }
    ]
}