{
    "app_id": 226840,
    "name": "Age of Wonders III",
    "release_date": "2014-03-31",
    "developer": [
        "Triumph Studios"
    ],
    "publisher": [
        "Paradox Interactive"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Steam Cloud",
        "Includes level editor"
    ],
    "genres": [
        "RPG",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Turn-Based Strategy",
        "Fantasy"
    ],
    "achievements": 74,
    "positive_ratings": 4479,
    "negative_ratings": 1132,
    "price": 22.99,
    "description": "Age of Wonders III is the long anticipated sequel to the award-winning strategy series. Delivering a unique mix of Empire Building, Role Playing and Warfare, Age of Wonders III offers the ultimate in turn-based fantasy strategy for veterans of the series and new players alike!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/226840/header.jpg?t=1541059262",
    "minimum_requirements": "OS: Windows XP, Windows Vista, Windows 7, Windows 8, Windows 8.1 Processor: Intel Core 2 Duo E6600 @ 2.4 Ghz or AMD Athlon 64 X2 5000+ @2.6 Ghz Memory: 2 GB RAM Graphics: nVidia 8800 / ATi Radeon HD 3870 with 512MB or  Laptop integrated Intel HD 3000 with 3GB system ram DirectX: Version 9.0c Network: Broadband Internet connection Storage: 10 GB available space Sound Card: DirectX 9 Compatible Additional Notes: Requires a 1024x768 screen resolution.Requires an <a href=\"https://steamcommunity.com/linkfilter/?url=http://ageofwonders.com/support-2/networking/\" target=\"_blank\" rel=\"noopener\"  >open IPv4 connection for online multiplayer.A Triumph Account is required to use the game's online services. The game's single player and Hot Seat modes are fully playable using the guest account.Please note that the Editor is Windows only.",
    "recommended_requirements": "OS: Windows Vista, Windows 7, Windows 8, Windows 8.1 Processor: Intel Core 2 Quad Q6600 @ 2.4 Ghz or AMD Phenom X4 9900 @ 2.6 Ghz Memory: 4 GB RAM Graphics: nVidia Geforce 460 1GB or AMD Radeon HD 6850 1GB DirectX: Version 9.0c Network: Broadband Internet connection Storage: 10 GB available space Sound Card: DirectX 9 Compatible Additional Notes: A 1920x1080 screen resolution.",
    "reviews": [
        {
            "review_text": "It's difficult to follow up a classic. It always feels like something is lost when a great game from years ago is brought into the modern age. Things get prettier, bigger, and more streamlined, but many times it feels like some essential chemistry is lost. Some of us blame nostalgia, others simply write the developers off as appealing to the largest audience or the lowest common denominator. Sequels always lose something.  Which is why Triumph Studios had no right to produce such a perfect game.  This is the perfect sparkling bouquet of what made the original great, combined with the streamlined production quality we've come to expect from a quality modern game. It's asymmetrical and unfair in the most balanced ways possible. Whether you're outfitting your heroes or designing your player class, you'll find great satisfaction in trying to break the game. You'll be very good at some things, and very bad at others, but it will always make sense and it will always feel right.  The unit design deserves special mention. Each unit is deeply well-crafted and unique, even when comparing racial units of the same role. The attention to synergy is unmatched, both between units of the same race and in the way that race and class combine to make a whole. Leveling up often provides interesting new abilities that also tend to synergize, instead of simply providing better stats.  This game has a lot of everything, and all of it affects everything else. You'll build cities, research and cast spells, and train units. You'll command armies on the beautiful strategic map, and when you explore dungeons or fight another army, you'll go down to fight on equally beautiful tilesets. Tactical combat is reasonably simple but very deep. This game has not been casualized. The A.I. is maddeningly clever, and you won't take this statement seriously until you've experienced it. You'll fight skirmishes in the woods with bandits, and you'll fight in truly massive sieges to conquer cities. Your heroes will explore dungeons, find and equip items, and lead your armies into battle.  You will build your strategy, and then get excited about other strategies you think could work. They probably will. Your race, your class, and your specializations all fundamentally change the way you need to approach the game. It takes a long time to bloom into a full understanding of how the various parts of the game work together, but the journey is pleasant, and you can absorb it by playing.  The campaign probably deserves it's own review. It's gloriously cheesy golden-age high fantasy. The campaign follows branching questlines, so you can end up doing different missions. The base game has two campaigns of eight missions. Eight does not sound like a lot but you can easily spend an entire day playing one mission. They're huge. Think of them more like chapters. The expansion packs can add another two campaigns.   There are also a number of scenarios which are like competitive missions for X players. The 'real' Age of Wonders though is in the procedurally generated random map mode, where you can fight other players or the AI. There are a huge number of random features on the maps, such as 'dwellings' where you can purchase units from a non-player faction like Giants or Pixies. You'll need to play many games before you've seen everything you can find. Also of note, Age of Wonders has an underground map, full of caves, tunnels, and the cities of the Goblins and Dwarves.  Triumph is confident enough in the mastery of their game to give the player enormous freedoms to explore how to play. Their own mastery is evident in the careful design of how every element acts together. If you find anything this game does interesting, play it for that reason, but be prepared to fall in love with the rest.   This is what a strategy game should be.   10/10",
            "review_score": "1"
        },
        {
            "review_text": " Disclaimers :  - I was a closed beta tester for the base game as well as its two expansions. However I'm not an employee of Triumph Studios, only a community volunteer.  - This review was written post Eternal Lords and 1.5 patch releases.    Age of Wonders III is a turn based hex based fantasy 4x game that is a lot more combat focused compared to something like the Civilization series but also quite a bit more strategically and tactically involved than let's say Heroes of Might &amp; Magic which can be both good or bad depending on your personal preferences.     Gameplay   Compared to the previous games AoWIII retains most of the series' fundamentals but also iterates and adds to the formula.   The most notable change is the way yor faction is presented via the class system. Your research tree and unit roster are not only determined by spell school and starting race picks but by your leader class (warlords, sorcerer, archdruid, dreadnaught, etc.), starting race as well as specializations which are akin to the previous game's spell spheres and leader skills. Your base unit list is thus determined by the race of the towns you own as well as your chosen class.  Comparing it to AoWII the class system in a way separates the racial aspect of a faction from the   gameplay theme  of it. For example, in AoW2 Elves were always Druids with nature themed units, Archons were always Theocrats with their religious and holy theme, Dwarves were Dreadnoughts due to their technological prowes, Orcs were Warlords with strong physical combatants and so on.   The AoWIII class system separates race and theme so Elves can be steampunk-ish technologists, Dwarves can wield druidic powers while Goblins can be religious crusaders. Thematically this allows you to create both stereotypical combinations (wizard elves) as well as some unusual ones (holy angelic goblins).   Gameplay wise the trio of race, class and specialization (additional mini tech trees) allows for a myriad of different play styles and strategies and a very diverse meta game which encourages experimentation and greately enhances replayability.   Each class comes with a unique tech tree which consists of special class units which can have their own racial variations as well as a large number of combat or strategic spells and passive upgrades that enhance your empire as well as units.    Customization   AoWIII features a leader creation process which allows for detailed aesthetic and gameplay customization. Visual options are akin to rpg games like Dragon Age allowing for changes to race, gender, clothing, accessories, hair style and color, skin color, eyes, hats masks, postures, background scenery, portrait poses, coat of arms, etc.  Gameplay-wise the options include race, class and 3 slots for specializations that can be magic oriented or more mundane empire upgrades.  Game settings include numerous tweaks to the random map generator like map type (land, continents, islands), map size (s, m, l, xl), geographical settings (types of terrain and climate, existence of the underground layer), starting town/army, amount of resources, treasure sites, independent monsters, etc.   Furthermore various game parameters can be tweaked like the number of heroes, hero level cap, hero race, game pace, starting resources, turn progression (classic i-go-you-go or simultanious), empire quests, map events, victory conditions, type and number of opponents, preference for manual or auto-combat and so on.  Much effort was made to cater to different preferences and play styles.    Combat   Like in Heroes of Might &amp; Magic for example, combat in AoWIII happens on a separate tactical map that is derived from the participating units' position on the strategic map. If the units were standing on a snowy arctic hex the tactical map will also have snow on it for example. Same with forests, swamps, etc. Not only that but various sites like cities, farms, dungeons, mines, tombs, etc. are all represented on the tactical map and can have different effects like providing obstacles, choke points, magical effects and so on.  Compared to AoWII combat in AoWIII has less randomness and is more dependent on the player making the right moves. Attacks will always hit for example (except under special circumstances) but the damage can still vary and there is the possibility of criticals or fumbles.  There are many things to keep an eye on in combat like move points (usually the less you have the less attacks you get but not always), limited retaliations, defensive stances, attacks of opportunity, flanking attacks, distances, unit position and facing, range, the presence of obstacles or city walls, types of movement (walking, floating, flying) and so on.  And this is without taking into account unit stats (physical attack vs. defence, magical/elemental attack vs. resistance), traits, special abilities, morale (which influences critical chance), combat spells, unit and battlefield enchantments, unit types, etc.  The basics of combat are simple. Click on a unit, right click to attack an enemy unit. But is the enemy unit far enough to trigger the charge ability, can I flank it, what's the chance of my special effect triggering, what elemental protections does it have, how many retaliations does it have remaining, does it have first strike, is it a polearm unit and will my cavalry take extra damage, can I weaken it prior to attack and how, can I kill it, will my unit survive the next turn after it attacks...there are many questions you could end up asking yourself.  Learning about the units, what abilities they have and how they can be used and combined for maximum effectiveness is necessary for mastering the game but learning can be achieved in gradual steps.  AoWIII retains the adjacency rule of previous games so all armies that are adjacent to the hex being attacked will also participate in combat which can result in some pretty large battles. Thankfully animation speed in battle can be adjusted during combat.   Units and heroes that perform well and survive will accumulate experience points and become stronger acquiring new abilities as they level up and grow into valued veterans.     Strategy   On the strategic level you build up your empire by settling or capturing new cities and expanding your borders in order to bring more and more resources under your control. There are resource sites to be captured, treasure sites to be explored, artifacts to be found, neutral creatures, cities and enemy leaders to be subdued. All in all the world is a dangerous place and venturing forth requires combat worthy armies and leaders. Luckily there is a beautiful cloth map to be zoomed out to in order to get an overview of the situation.  Resource gathering and exploration primarily serve the goal of building up armies that can defeat the dangers that lie beyond your borders.   A new addition here compared to AoWII are the creature dwellings which function as minor races that offer unique units for hire as well as their own sets of buildings. These dwellings can expand your unit roster and provide unexpected tactical and strategic options.  Both creature dwellings and independent cities can be outright conqured or negotiated with towards peaceful annexation by vooing them with money or performing quests. How you treat various towns and races can determine their attitude towards you as well as your alignment and diplomatic relations.   Another addition is that clearing out and controlling certain treasure sites can unlock special unit or town upgrades in cities controlling those sites which can make some cities more valuable than others.   All in all after 618 hrs of playing I have not yet experienced everything this game has to offer, so many untried combinations and strategies, which is probably the biggest endorsement I can give.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine Civ 5, but with combat that actually felt fun to do, choices that were actually meaningful and the ability to create and flesh out your own leader of one of numerous races. The gameplay is less than stagnant, it has mob support and it's campaign is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "This hidden gem game I found only this December. As a big fan of old HOMAM and CIV games I cannot describe how amazed I am by this game... Its like my childhood dream comes true! I will recommend this game to everybody, already give it to my brother for Christmas, he loves it too.",
            "review_score": "1"
        },
        {
            "review_text": "It's a true spiritual successor to Master of Magic and that's what I love about it  I would estimate that I played somewhere in the vicinity of 1000 hours on the original Master of Magic (in fact, still have it and play it occasionally on Dosbox). It had been a pinnacle of fantasy TBS games, unsurpassed by any, in my opinion.   until this game came along.   To any MoM player, Age of Wonders III will feel right at home. From mage customization to the exploration of ruins and caves, the settling of new cities and the building of great armies, the researching of grand spells to strike your opponents and bless your lands... and of course the heroes - numerous and varied.   The races are fairly unique, with no two feeling alike. Playing anything from Elves to Pantherfolk, the difference between units and cities are big enough to merit playing at least once with each race. Add to that the different classes and magic skills you can customize your leader with and you get near infinite replayability   The music is great - I found myself walking around humming some of the battle tunes plenty of times... the visuals are fairly good for a TBS and I doubt anyone would complain much about them...   The multiplayer returns the classic old Hotseat option, which definitely feels good for an old-timer like me...  So far I've played well over 200 hours and I am still playing... it's just great.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game. I like the tactical battles for this game. I have quite a few turn based fantasy 4x games, and the tactical battles for AoW have always been fun. There are lots of unit types. Also, players get to cast many spells while playing the game, both tactical and stratgic. Leader customization is great, and starting new scenarios is neat due to all of the choices availble.   AoW III is also a very pretty game. The graphics and sound are phenomenal. There are spells that allow the player to change the terrain. Tactical maps also look good, with a lot of environment colors.  Overall AoW III is a good, fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Really solid 4X with extremely in-depth combat and plent of units, spells, etc. to play with to make your perfect army. The developers have show a huge amount of support for the game and have gone out of the way to listen to criticisms to iron out the flaws that stuck out on release. I definetly would recommend this to anyone who enjoys the 4X genre just for the combat alone.  Note: This isn't fantasy Civ 5; The game focuses more on the war aspect of 4X's than it does the empire/economy management, so if your strictly looking for a game with that Civ feeling then you might want to watch some youtube videos to get an idea if this is a game for you.",
            "review_score": "1"
        },
        {
            "review_text": "EDIT 23-11-2016 - This game still stands the test of time, if you still haven't bought it; Do it now!  EDIT 17-04-2015 - With the new Eternal Lords expansion in combination with the free 1.5 patch, this game is even better than it was originally.    Twelve years we waited for the successor of the excellent Shadow Magic (also available on Steam). And is it worth it? Hell yes!  The graphics, soundtrack and (re)playability are excellent!   As the Devs are a small company from Holland, and independent publishers, they actively browse and reply on the official forums, making notes of bugs (although there are very few bugs at release) and planning on fixing them in future patches. The same is regarding balancing issues. They are very actively gathering balancing suggestions and also implementing them thorugh patches. They are very close to the community and that is something most software companies can learn from. Regular patches are already released and more are in the pipeline.  The game itself comes with an editor, so you can make your own maps/campaigns. Furthermore single-player options are two campaigns, about 8 scenarios and, the icing on the cake, a Random Map Generator. This generator makes very good maps with realistic landmasses. Maps can be selected for small to extra large size and 2-8 players. There is also a multiplayer mode which supports Hotseat (players take turns on the same computer), LAN (need to make contact with official servers first, after that it's offline), VPN (in beta patch at the time of writing) and normal multiplayer games through the internet.  I already netted 165 hours in the game, which was released just 16 days ago (at the time of writing) and I just cannot stop playing! This game is highly recommended, not only for gameplay purposes, but also to support the independent developer!",
            "review_score": "1"
        },
        {
            "review_text": "So, i nominated this game for some Steam Award and now i have to write a review for 25XP. Deal with it! Still, i'm going to write a full review as someone wo has nearly 400 hours in Age of Wonder 2: Shadowmagic, and... well, a lot less hours in Civ 5.  So what is Age of Wonders 3? Age of Wonders 3 is a turn based Strategy game strongly focused around combat, in a pretty standard fanatasy setting. You have elfs, orcs, goblins, halflings and some more unique races like fronstlings and draconians for example. You play as a highly customizable wizard, learning spells and taking over cities, you can upgrade to build stronger and more units, either by producing them in the cities or summoning them with magic. You have multiple classes for your wizard, that kind of work based on the rock paper scissors principle. You'll be able to recruit heros, who can cast some spells as well, and whom you can level up and equip, just like your wizard. Unlike in the previous Age of Wonders game you have the option for your heroes, that if they die in battle, they'll still life on afterwards, unless you lose the bettle entirely. But then you can just resurrect them, using a spell, everyone gets sooner or later. This makes things much less frustrating for those who wish so.  The other big new thing in AoW3 is flanking. In AoW2 you could come in with a few string units and just ♥♥♥♥ up a whole army of individualy weaker units with ease, unless you enemie had a big defensive advantage. Flanking gives you new tactical method to make your numbers count, if used well, and it makes some stealthy units more viable, by focusing their skills on this tool, not just having invisibility or concealment on the worldmap.  Yes, there is a worldmap and a 'new' map for each battle. Playing CIV5 after AoW is the least satisfying thing in regards of combat ever. It's like playing ludo after falling in love with chess. You can fire with archers or priests from the top of your city wall, while the enemie sends massive wallbreakers to tear down your gates. Meanwhile his flying unity just pass the wall, trying to take out your raged units. As your last archer dies you cast a massive firestorm for lots of damage on every unit on the battlefield, including your own ones. This is combat.  Now there are some cons i'll have to point out. First of all i am not a fan of the campain. As much as i'd like to play it, the missions are just annoying to me. I can't really explayin why, sorry. But i've never liked the campain in any AoW game, while there are many others who loved them. So most of the time i'm just playing randoms maps. The second thing i'd like to point out is a point that occurs in every round i'm playing. It's the point where you are (if you're winning) reaching superiority in a game it becomes boring. They implemented the option for leaders to surrender to you, which i really appreciate, but if you play a 4-player match and took over the cities of 2 of them already, the last enemie is pretty boring to defeat most of the times. That's why i rarely ever finish a game. The third thing are the difficulty settings for the AI. The AI cheats on higher difficulties. They get way more resources, combat bonuses agains independent units, like for example a group of dwarfs protecting a mine, and other stuff. That's not a good way to create difficulty in my opinion. And at last the DLC problem. No, i think the pricing is ok, but i also think they are mandatory for a good experience. The base game just feeld a bit empty.  But now a quick sum up of all the great stuff, and belive me, there is a lot! The combat is great, and if your Army of Angels has to fight a pack of wolves you can just let the battle fight out automatically. The new class-system is a welcoming difference. The environment looks gorgeous, even on (most) random generated maps. I still prefer the soundtrack of AoW2 but it's still great in AoW3. Never had any problems with online play. The spells are great. The customization options for the leaders give a lot of variety and a lot of different options for tactics.  To sum it up. Age of Wonders 3 is a great turn based game that lacks the economical complexity of games like Civ, but provides a superior tactical combat experience in a good looking fantasy setting.  8,9/10 because i can play as a goblin druid and it's great!",
            "review_score": "1"
        },
        {
            "review_text": "An actually good remake of Master of Magic. If you enjoyed AoW2 or MoM this is the game for you! Fantastic and worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "I was a big fan of Age of Wonders II and Age of Wonders II: Shadow Magic so it is natural like I would like AoW III. This turn-based strategy game with a fantasy theme is sort of a mix between Heroes of Might &amp; Magic and Civilization. At least for me, I like AoW best of all. I love the hero units in this game and the way they level, have items/mounts, and can use spells. I love that there is incentive to level and grow even the normal units as their stats get better and they may get additional abilities at higher levels. I love being able to choose what each city is producing whether it be units or some building that will give that city an ability or boost. AoW III does not have the race and unit variety that AoW II: Shadows Magic had but they keep adding races and whatnot via expansions so maybe it will get there eventually.  I like the single-player campaigns thus far but there are some things that bother me. First, sometimes the missions force you to be very aggressive in order to win. If you are too slow then the AI can wipe you out or at least make the mission drag out way longer than it should take. Second, I love to focus on leveling my heroes and the campaign missions usually have a hero level cap that gets higher as you get deeper into a campaign. I understand the reasoning for that but my interest drops when I can't grow my heroes anymore. The best part about the campaigns is that you get to keep your heroes mission to mission. All their XP and items and skill points remain. There is a caveat though but I'm not sure how much I should say about it since it could be a story spoiler.  I have about 80 hours played thus far and I haven't even finished the first out of four single-player campaigns (I think the base game comes with 2 campaigns and the expansions add more). I am definitely getting my money's worth. Even if/when I finish all the campaigns I can easily create scenarios against AIs or players where I control the map size and whatnot (a la Civilization). That is what I often did on AoW II.  This is not a game I will play all the time but I will always come back to it periodically where I get all excited about it once again and sink a lot of time into it for at least a couple weeks.",
            "review_score": "1"
        },
        {
            "review_text": "It's like a mix of Age of Empires + Civ + XCom. I love it. Definitely recemmend it.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game. Definitely feels like the original AOW1. If you like AOW, you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "I wish I knew about this game sooner. It incorporates features from Civilization, Total War, and XCOM in a turn-based format.  ========================================= Pros:  I'm just playing single-player so far, but I'm loving the RPG elements of leveling your leader and troops.  You can research spells which you can use to cast spells in combat (buffing troops, damaging enemies, etc), or cast spells outside of combat (damaging enemy armies, buffing your cities, etc.)  Sieges are well done as far as giving the defender a big advantage, but still making siege weapons useful. Not enough games use these mechanics properly.  Each race has it's own pros and cons, and each leader has their own spells and stats, some of which you can influence when they level up. There is a custom leader creator as well which is pretty cool.  Great value. Got this game on a -66% Steam sale, absolutely worth the price. Only bought the base game, but in the first hour realized I would enjoy it enough to buy the whole package.  ============================================= Cons  There is a lot of micro-management, but it's turn-based and similar to Civilization. So if Civ was overwhelming, this may not be the game for you.  Battles can be a little tedious because you move and attack with every unit. Also most units have their own spells and ranks, so it's not too horrible. I'm not disliking combat yet, but I can see where some might. There is an auto-resolve option like Total War though.  Edit for multiplayer review; highly not recommended. You have to watch every battle as other players complete their battles. There is auto-resolve, but this game is all about tactical battles and it's unplayable like that. However, there is play-by-email and that works fine, so if you don't mind doing that, then it's do-able. Really disappointing, but it's because of gameplay balance.   =================================================  All in all, if you enjoy Civilization, XCOM, or Total War, then you would probably enjoy this game.    Also, that guy who has 100 hours played and still didn't recommend this game, stop being so entitled. That's a great value.",
            "review_score": "1"
        },
        {
            "review_text": "I miss the variety provided by its predecessor in terms of races and great changes of units from one race to the next. That being said, this game adds its own type of variety with the leader classes, and the game provides a very solid turn based gameplay. The combat is involved, and your leader is an active participant in your conquest. In alot of ways, this game is more akin to a sequel of Age of Wonders 1, than it is a sequel to the more widely popular, AoW: SM.   Fun, engaging, and as always, it has the hated feeling of 'one more turn is all I need'.",
            "review_score": "1"
        },
        {
            "review_text": "This is a damm good game. I've enjoy playing this game a lot. It is better than the oiginal and the soundtrack is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Best 4x fantasy strategy game ever.    Great combat mechanics    Awesome character customization    Exploration is fun  ",
            "review_score": "1"
        },
        {
            "review_text": "A fine update of the AoW series. It is essentially AoW 2 for the modern era. Well designed, good graphics for this type of game, and very fun. I highly recommend if you enjoy strategy or 4x games.",
            "review_score": "1"
        },
        {
            "review_text": "I've played a variety of 4X games and I can say, undoubdelty, this is the ONE for me.  I like Civ, don't get me wrong, Civ is a pretty amazing game, but it was way too focused on nation interrelations, diplomacy and 'player versus player' experience, as in, you'll be battling and dealing with the big AI (the other players in the game) rather than the environment AI (in the case of civ, barbarians)  I also played Fallen Enchantress, but the art didn't quite charm me.  This game combines what I loved from FE (exploration, variety of AI enemies, more 'player versus environment' focused) with an incredibly beautiful artstyle, amazing soundtrack and a much more fleshed out singleplayer campaign. Highly recommended for any fan of strategy games, be it 4X, grand or tactics.",
            "review_score": "1"
        },
        {
            "review_text": "When I was young I played the original Age of Wonders to death. As i got older I still played it and it became one of my most beloved games. Now while I do have a biased point of view I will tell you this : AOW3 Feels so much like the original is frightening. It seems like Triumph decided to start with the original and flesh out what was good and shave off the bad. I feel that they did a fantastic job making this game exactly what it should be.   The overall gameplay makes you think that its a CIV knockoff but after playig it for some time I realized that its just similar, nothing more. I like the overall feel of the game and the only complaint I had was that the screen scrolling seemed quite clunky.  I truly think they did a great job making the combat system emulate the original while giving it a unique feel that makes you want more. I'm excited that they kept commander (or leaders) in the game which nearly makes the game a turn based RPG. One of the best additions to this sequel is the ability to create a random map. While random maps are pretty standard now (or should be honestly) it brings a breath of longevity to the game.  If you enjoy turn based stragety games that are fun and have dynamic combat this is the game for you. I truly think you'll spend hours enjoying this game and exploring or conquering your own world!",
            "review_score": "1"
        },
        {
            "review_text": "4 HOURS INTO THIS SHEET AND LOVED IT. NO REVIEW NEEDED. GOOD GAME!",
            "review_score": "1"
        },
        {
            "review_text": "This game is brilliant. If you're looking for a fantasy 4x with a military/tactics focus, this game takes the cake. Economy management is extremely simple compared to Civ5 or other 4x games so if that's your interest I'd look elsewhere. However the unit diversity, spells, and tactical battles of this game are unmatched.   The assymetrical balance via combinations of starting race and leader class really makes for truly epic dynamic compared to the copy pasted civilizations featured in other games. Playing a Dreadnaught (engineer) leader is a whole different ball game from playing a Druid or a Theurgist. Seeing a battlefield of up to 42 units strewn with one army of cannons, tanks, and musket men standing on a city wall vs an army of shaman and summoned beasts set to a wonderful backdrop of a massive rising city scape really brings the game to life.  Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Think Civ + HoMM. Really liking it thus far!",
            "review_score": "1"
        },
        {
            "review_text": "Considering the good/bad comments about AOW, there is not much left to say apart from:  PRO:  -This game is a total BLAST in Multiplayer - even in hotseat mode when everybody is watching your moves (paranoia reigns !) - People complaining about the lack of depth (economy): Name a *good* (like CIV4 or Endless Space) game where the economical micromanagement was'nt just a time consuming boredom-factor once you got past the number crunching.. - AOW3 IS heavily combat-focused - and in that discipline it shines on every level. The amount of tactical decisions to be made (terrain, movement, stats, buffs, debuffs, resistances etc.) combined with clever army builing is JUST RIGHT to let this game FLOW. In this regard, AOW3 succeeds where all the other titles (HoMM 4-6, Disciples, Fallen Enchantress) have failed miserably.  CONTRA: - The Number 1 Mistake of new Players (and obviously the reason for a lot of bad tempered 'reviews') is the misinterpretation of the way the units are represented (HP/DMG-wise). FOLKS ! The Number of 3d-Models in a Unit is JUST A REPRESENTATION of the Hitpoints - where low-tier units have i.e. 5 figures and high-tier units just one model..so: no, once the Orc Shock Trooper slot looses a model (HP) it does not inflict less damage. It's all a matter of interpretation. My real Contra with this is that the devs did not consider the necessity of explaining this is in some sort of tutorial. It's 2014 and the kids are used to playing stupid crap where everything is chewed for them...what a good 4x game does is leaving some room for imagination, only visualizing what is necessary to establish the mood. But it's a sad fact that , in order to sell these concepts to the masses - you have to *educate* them a little bit - Diplomacy. Just plain boring. What i'm really missing is an AI that displays total irrational reactions (a goblin druid declaring war on you just because you captured his favoured neutral tavern; an allied dwarven theocrat who is a racist ♥♥♥♥♥♥♥ and breaks the alliance because you have chosen not to migrate the last town you captured to your heroes race...you got the idea. Where everything else in TBS is about numbers and logic - diplomacy should be about lying, cheating, egos and taste - just like real world politics :) - The random Map Generator needs serious tweaking. There is some sort of 'Mountain Spaming' on large map types with 'underground' and even player numbers...very annoying.  Bottom Line:  There is always a lot of work to be done. Some Unit-Stats tweaking here, some AI-Polishing there. Regarding the overall game design, AOW3 does it right. There have been lots of discussions about the typical TBS issues: Balancing the time exposure / gameflow ratio; how to avoid the stack of doom, complexity vs. laid back indulgence. The fundamentals are here, they play very well and boy - do they look good. With some more effort, this will be the best fantasy-themed TBS-Game since the days of MoM... ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game with endless replayability. If you like Civilization V, you will love Age of Wonders III!",
            "review_score": "1"
        },
        {
            "review_text": "I haven't played Endless legend, but both of these games seemed similar and I had the choice between them.  After some research: the basic difference is probably that Endless Legend is closer to Civilization/ Warlock, and Age of wonders is closer to Heroes of Might and magic.  Age of wonders is a well done 4X game with combat reminiscent of Heroes of Might and Magic, but more strategic depth and world-strategy elements such as city building.  Overall a great game, although the campaign story feels a bit 'meh'... it is basically a set of missions with each class so you can get used to it's strengths and weaknesses. Multiplayer contains a lot of cheese or strong strats, but if you know what's possible it becomes a fun challenge to play around your opponent.  Learning the game properly takes a while, there are a lof of mechanics that only make sense when you research them.",
            "review_score": "1"
        },
        {
            "review_text": "For those familiar with the Age of Wonders series, this game is definitely worth playing. The game will immediately feel familiar, while new game mechanics do not feel forced in. Overall, each race still plays like their predecessors, but each leader type will put a twist on your force composition.  If you are new to Age of Wonders, this is a Turn Based Strategy game that is based on a series that has been around for some time. Age of Wonders III is similar (but superior) to games like Disciples, and Heroes of Might and Magic. Other similar titles would include Warlock, and Fallen Enchantress. The basics of it are you build an army, learn new spells, and march your gathered army to victory. On the main map, you can cast spells to help you and your allies or hinder your foes. You can explore the map for powerful items to equip your leader and heroes with. When you fight another army you switch to a tactical battle mode. Here, you will command your troops individually, and you are also able to cast magic to aid them.  This is not a fast paced game, and larger maps can take a long time to finish. There are some minor issues, such as AI Diplomacy being touchy, however this game excels at Multiplayer as its previous iterations have. The campaign allows you to play both sides of the main conflict, and the achievements allude to 2 endings per side.",
            "review_score": "1"
        },
        {
            "review_text": "Took a little bit to get into, but after ~10 hours, I began to understand the game and started to really enjoy it. It was touch and go for a while. Tactics in battle are the games center and strong point. MP is slow moving, but you can do so much stuff out of game, while your frien-emies are taking their turn.   You can pick it up on a sale for less than $10, a steal really. If you get into it pick up Eternal Lords DLC.",
            "review_score": "1"
        },
        {
            "review_text": "If you are a fan of the classic AoW games, this one may disappoint you a bit, especially if you are only interested in the Campaign mode and story. The storyline finishes before even you warm up. You can't bring your best levelled-up units to next level, which is why I bought this game in the first place. That was what made AoW awesome. You used try to keep units alive and level them up so you can take them to the next level. A huge disappointment for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I used to have productive weekends.",
            "review_score": "1"
        },
        {
            "review_text": "Civilizations crossed with Heroes of Might and Magic. Very fun.",
            "review_score": "1"
        },
        {
            "review_text": "Well, this game has damaged my productivity somewhat significantly this week. Some interesting tweaks from the traditions set down by its predecessors, and I'm glad to say they pretty much only make it better. Glad to see another installment after so many years, to what was pretty much my introduction to turn-based strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent combat-focused 4X game. Think Heroes of Might and Magic with much deeper combat, and more depth overall. Expansions also highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Why is it bright outside all of a sudden?",
            "review_score": "1"
        },
        {
            "review_text": "Very Likely Defeat",
            "review_score": "1"
        },
        {
            "review_text": "Perfect strategy game!",
            "review_score": "1"
        },
        {
            "review_text": "The mainstream review sites like IGN got this one WAY wrong. It's easily the most fun TBS game of the last few years. Buy the expansions too. Totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful sequel to the Age of Wonders series. The latest updates have really made this game a joy to play. If you enjoy 4x fantasy games then this one should not be missed.",
            "review_score": "1"
        },
        {
            "review_text": "It's kind of like playing five or six games of Civ V at the same time, on two maps. If fantasy themed stuff don't turn you off, and if you like 4x strategy of the Civilization variety, it's well worth giving this a try. I'm the type who searches and searches for the perfect game, so I've tried Endless Legend, and Galactic Civilizations, and Empire Earth, and Age of Empires, and Beyond Earth, and on, and on. Age of Wonders 3 is the shizznit.  I will say this - if you only play this game for an hour or something and think you've seen it all and it's just silliness. Play through a whole game and you'll see the magic",
            "review_score": "1"
        },
        {
            "review_text": "good building majic and fantasy war game I don't much like the campains but the open map is fun to mess with and in that setting it reminds me of Civ 5 with out the culture or religion effects.   ",
            "review_score": "1"
        },
        {
            "review_text": "Grading Scale: 10 - Masterpiece 9 - Amazing 8 - Great 7 - Good 6 - Okay 5 - Mediocre 4 - Bad 3 - Terrible 2 - Abomination 1 - Unplayable  Game: Age of Wonders III  Summary: Turn-based strategy game with some RPG elements and a fantasy setting.  Pros:  Combat- Refreshing and fun for a turn based strategy game. Although some flaws are evident (will go over it in the 'cons' section). Combat takes place in a battlefield that takes into account the type of terrain you were on when combat was initiated. You can move your units around and place them in strategic areas around the field.  Character Customization- Able to customize your hero with different hairstyles and certain cosmetic options such as armor and head pieces.   RPG Elements- Able to equip your hero with items that are obtained throughout the world. You can also level your hero and have him/her learn new spells and moves. Among these units are mounts which really give your hero a unique feel.  Units- Each unit is unique and inspired. Although you cannot customize your units the same way you can your hero, they each have their own unique abilities and appearance.   Cons:  Limited Victories: Although diplomacy is possible, the style of the game begs for a conquest win. The resources at your disposal for any other type of victories are simply not worth the effort. It's a lot of fun to just stomp through everything with your unique armies.  Repetitiveness- After playing for a while. Combat can get a bit tedious to a point where you just find yourself skipping it altogether. Once that happens, the rest of the game just doesn't hold up. Combat is the fun part of this game, not so much the diplomacy.    Verdict: Fun turn-based strategy game with a fun twist on combat that suffers from repetitiveness. The hero development, different class system and customization adds for a unique experience everytime you play the game.   Score: 7",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive!",
            "review_score": "1"
        },
        {
            "review_text": "Quality game, very similar to the Civilization games. The coop mode is an added bonus.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Similar to Civilization however has a more in depth Fights if you want to fight. Multiple classes leaves many different play styles. Explore or Conquer however you want.",
            "review_score": "1"
        },
        {
            "review_text": "Great game DLC worth it ",
            "review_score": "1"
        },
        {
            "review_text": "I have played many games of this genre and of all those games, this has to be one of my favorite all time. The city planning is on par. If you liked Civ, this is Civ +. If you like endless legends, you might appreciate the added control in fights. The reason I feel like the fighting system is amazing is because of the amount of control and strategy involved in the decisions you make. The hero's are a great feature, although I will admit endless legend does have more customization for your hero with the gear and items you can make. Great to play on your own or with friends... love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Played this game till my eyes were bleeding. Solid, Thick, Tight.  A fantastic mix between the 'heroes of might and magic' games with equal parts 'civilization'! Also has the addictive time killing feature of both games .   As a fan of both HoMM and Civ, this was a ♥♥♥♥ing 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Very good turn based game. Me and a friend has had a lot of fun playing co-op. If you like turn based strategy, then I highly reccomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "In this game, the main premise is a large scale rivalry between powerful mages with varying specializations and studies, who bend cities by their will toward good, evil, or whatever.  Gameplay is reminiscent mostly of Heroes of Might and Magic, in a good way. This is a 4X game with an especially strong emphasis on exploration and extermination, with heroes who go questing, conquering, leveling up, and looting for themselves and their empire. Campaign actions are made on a high-level campaign map. Battles play out on a lower-level map in a tactical turn-based manner, taking into account the terrain and structures of the tile on the campaign map. Both maps use hexagonal tiles. Armies (unit stacks) are composed of up to six units. In a battle, all adjacent armies participate. In some ways, this approach to combat feels like a middle ground between Civilization and Total War.  Much of the design is reminiscent of Master of Magic. Cities and units vary according to the class of the player and the race of the inhabitants. There are six classes (arch druid, dreadnought, rogue, sorceror, theocrat, and warlord) and six races (high elf, human, orc, goblin, dwarf, and draconian). The variety is good but not dizzying, with a solid array of standard unit types and a handful of specialists available in any city that has the requisite buildings. Spellcasting plays a major role on the campaign map and in battles. The spells span a wide spectrum from an assortment that is modest in cost and effect to the immensely powerful and expensive high tier. Each school of magic (among air, earth, fire, water, creation, and destruction) is distinct, with its own characteristic effects and strategies. The interplay between questing, empire building, warfare, and spellcasting is fun, engaging, and balanced.  Compared to other 4X games, there is a diminished emphasis on exploitation. Rather, the exploitation here is ultimately focused on serving the exploration and extermination. You won't find options for cultural, diplomatic, or economic victories here, and the gameplay options are limited likewise. This is not a game of peace. [edit: Interestingly, Triumph has hinted that this is an area that they will expand in upcoming updates.]  The overall fit and finish is very good, although not without room for improvement. The UI is strongly reminiscent of Civilization V—a good choice of inspiration. Some aspects live up to this standard better than others. There is a Tome of Wonders (akin to Civilopedia), but it's a pain to navigate (no back button?! among other problems), and some of its pages neglect important information. Some stats show breakdowns on hover, as they should, but some breakdowns lack desirable detail, while others are simply omitted. I'm curious to see if any of this improves with ongoing updates.  Unlike Civilization and most other games in the 4X genre, a game of Age of Wonders III at normal pace is significantly shorter. Expect a commitment of three to six afternoons instead of three to six full days. Considering the pesky existence of real life, this is a very desirable trait.  If you like 4X and high fantasy, and you'd like a game that combines the two in a form that's easy to swallow, then this is a great choice.",
            "review_score": "1"
        },
        {
            "review_text": "really interesting and thought provoking definetly a must buy.",
            "review_score": "1"
        },
        {
            "review_text": " It Rocks!",
            "review_score": "1"
        },
        {
            "review_text": "This went better than I expected.  (My mine gripe is that performance is sub par)",
            "review_score": "1"
        },
        {
            "review_text": "Fun combat and.. so far its quite hard even on normal difficulty..",
            "review_score": "1"
        },
        {
            "review_text": "Great Single Player game. Works real well, and the graphics are very nice. Multiplayer is sadly the worst I have ever played in a 4x game. When playing with other human players you have to watch the combats of every single person. So from the start I get to know your army, leader name, see how your tatics are and what you have for units. The Game ends up being a turtle-fest and huge time sink. I hope they fix this. This game has huge potential with a good multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "Lives up to expectations marvelously.  Solid music, solid graphics, fascinating creative content, and most importantly, actual gameplay, not just some cinematic romp.  Recommended for anyone and everyone who likes to play actual games rather than just watching interactive movies, but also recommended for those who like production quality fitting of a game in 2014. Being highly visually and audio oriented, I wouldn't be playing this game if it suffered in production quality.",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game but I really, really wish it had a deeper technology tree.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, a top fantasy streategy experience, if you love civilisation series, and heroes of might and magic, it's a must have. You can always purchase AOW2 and get a similarly rich experience.",
            "review_score": "1"
        },
        {
            "review_text": "This new iteration to the Age of Wonders franchise combines the empire management of the Civilization games and the turn based, hexagonal combat system of the Heroes of Might and Magic series perfectly. The world full of vast biomes and areas to explore has a lot to offer. From sending your armies into a crypt to find a dragon defended by dragonkin and skeletons to sending your army against the Elvish Arch Druid army, only for him to call upon the Forest God to decimate your musketeers. This game offers amazing customization options as well, from creating your character and his looks to choosing his race, his class, his attributes and his spells. All of these options affect how you will play the game. Will you become a Dwarf Arch Druid and heal the land around your empire to reap the awards of a bountiful Harvest? Or will you become a Dragonkin Mage and call down fire and plague and destroy your rival's lands? These spells and skills also affect the combat in the game. Your heroes will have one time spells to use to decimate a particulary powerful creature or even call up a large random creature, which turns out to be a poisonous death adder. Overall, this game is a great source of fun and enjoyment and I can see myself putting many more hours into this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just getting better and better. At first, I was a bit disappointed but for each expansion added they just added more and more content to the game. More campaigns, more scenarios, more races, new class. It start to feel more and more like Age of Wonders 1 again but with a class system and city building for more controlled expansion.   For each patch, for each expansion it just becomes better! It should be a game in every X4 fans collection. To put it on something familiar, add a dose of Heroes 3, add a dose of Civilisation, add a does of roleplaying. You get Age of Wonders III. A 9 out of 10 game right now for me. But I might be a bit biased, being a long term fan of 15 years with this series. But I recommend it to everyone who enjoy this kind of games.",
            "review_score": "1"
        },
        {
            "review_text": "AoW 3 is a very satisfying mix of traditional 4x gameplay and a detailed turn-based combat system. I have played many of the 4x games on steam over the years, but AoW is really holding my interest with its varied races, multiple playstyles, and beautiful graphics (for the genre).",
            "review_score": "1"
        },
        {
            "review_text": "I love every game in the AOW series. AOW III is everything that was done right in AOW 1 and AOW2 put together into one game.   My only complaint about the game is that there is some kind of weird graphical corruption. It is hard to describe its mostly visible as a flicker in certain pieces of terrain like lava or the underground forests. This EXACT same issue was there in AOW2. It makes the game unstable. It is very annoying to see bugs carrying over into sequels. I've this bug on many different computers at this point so talk of graphics cards and drivers being at fault is ridiculous. The same damn bug happens on linux as well as the windows version!  But everything else about the game is awesome and it is hands down the best fantasy TBS strategy game I've ever played.   ",
            "review_score": "1"
        },
        {
            "review_text": "A great game combining the best aspects of Heroes of Might and Magic and 4X games such as Civ V. Lots of character customization involved along with very decent level generator provide high replayability value and many hours of pure fun.",
            "review_score": "1"
        },
        {
            "review_text": "I played this game myself and find it very enjoyable. Age of wonders 3 has a great combination of civilization, fantasy,questing and a little of what felt like total war do to the fact you can controle your troops on the ground. you can even costimize your own leader aand class they will be! i would highly recomend playing it. give it a shot ^u^",
            "review_score": "1"
        },
        {
            "review_text": "This game is if WarHammer40k &amp; Civilization 5 had a child but with playable combat and fantasy races. Not to mention the beautiful terrain and you can live underground. Not only that but you can be a multiple species nation with Goblins,Orcs and Dwarfs and more races under you're rule!",
            "review_score": "1"
        },
        {
            "review_text": "4.5 Stars - An engaging strategy epic that will easily hit home for fans of games like Civilisation and the HoMM series.  I hadn't played the earlier AoW gamess when I started this but was very happy with the mix of emprie building and tatical battles. The core game contians two campaigns which alone can be 100+ game hours.  The combinations of racial benefits and class skills give you strategic freedom into your city buiding and army mix. Heroes have RPG elements and will become significantly powerful with both levels and loot over the course of the campaign.  Pros - Tatical Battles Replayability &amp; game size Empire design  Cons - Artwork can appear clumsy on lower resolutions tho the prevelance of small detiails will overcome this if you can play on higher settings",
            "review_score": "1"
        },
        {
            "review_text": "So far this game has been a delight to play. It can be challenging but it can also be very easy depending on your play style. I have had to re-play a few missions due to me taking the wrong play style with the level laid out in front of me. It is a great strategy game though and would definitely recomend it to fans of the turn style RPG.",
            "review_score": "1"
        },
        {
            "review_text": "this game is one of the only hex games i play and it is to much fun by this game",
            "review_score": "1"
        },
        {
            "review_text": "In the era, when the huge companies are either streamlining the previous games with usualll tendency to loose anything from the atmosphere of the old best sellers (yes, Heroes, im talking about You...) or even trying to squeeze Your wallets with so called HD feature stripped reedition (Yes, again Heroes of Might and Magic) asking You to pay a full price there it is - something out of the today standards.  Despite always being somewhere in the shadow of HoMM series, AoW series is nowhere behind the legacy of turn based fantasy strategic games. And even if it obviously was overshadowed by allmighty Heroes III (which is probably the best game ever for majority of players reading this review - me included) at the times where Age of Wonders 2 was published (even, despite my opinion it was pretty much equally good in some terms), its no longer a case.  Heroes series lost all of it glory throughour the years. Age of Wonders, resurrected not so far ago. And in a contrast of really average attempts to recover HoMM franchise, Triumph Studios made it done. This is the game every AoW fan was waiting for, and this is the game all the turn based fantasy strategic games fans should head into now. There is absolutely no other game in the genre with so much detail, fun and polish.  Of course, the game has some issues (like multiplayer connection which for no reason tries to establish p2p connection which is kind off archaic method) but developers are constantly updating the game based on our feedback.  So if You really enjoyed playin HoMM 3 twenty years ago, and You would love to feel something similar today - go grab it. You'll love it.  ",
            "review_score": "1"
        },
        {
            "review_text": "only played 12 hours so far i can tell you this.. this is 1000x better then any of the civilazation series. you won't regret",
            "review_score": "1"
        },
        {
            "review_text": "I loved AoW 1 and 2 plus the expansions. This one just is not anywhere as nice. It is fun and more advanced than a Heroes of Magic game, but pales to the depth and strategy of the original games.",
            "review_score": "-1"
        },
        {
            "review_text": "Hmm Well Age of Wonders 3 may be lacking in what the old games had But that doesnt mean it is a bad game Its graphics are nice and even though the camera has problems at moments its not worthless The gameplay is the best part and runs solid It seems a bit laggy for me sometimes The only real issue is the multiplayers forced to watch battle thing But thats a passable not to bad scenario There is actually a ton of content to the game which is nice off the bat But most likely tons of new things on the way to look at for DLC... No signs of :RogueChicken: so iam still hungry But this game has a ton of stuff to chew on  They still need to work out the kinks on editor ITs not as simple as the old ones But oh well, this is a 2014 game not a 2001 Alot has changed since then  Besides the points of anything, this game is good And in this dying age of actually decent games This gem is a proud 8 or 9 out of 10  it still has some polishing to fix any issues But i like it Its not for everyone and it is its own game Its not 4X or Starcraft... so i dont understand what the comparrisons are IT is Age of Wonders 3 and its here to smack your shoes and say ERNHHHH....  lol",
            "review_score": "1"
        },
        {
            "review_text": "I really thought this game was letdown. Sorry, Triumph, but what I liked about this game series was the epic-level wizardry, and you've totally dumbed it down. It really all comes down to the downgrade from domain-level spell to city-level. Now you cast the same spell over and over, only to have the compy players dispel it randomly around your empire. The troops are all weaker, too. Playing daconians? No red dragons for you. Your best unit is now... flyers. Yay. It's like they cut the best options out and then expect you to be happier with the stupid bottom tier troops. Oh, and your wizard (or whatever) is now just another hero.  Maybe you'll get some of the old awesomeness back with an expansion or something, but right now, though, if you're looking for an epic sequel. Look elsewhere. This is decidedly NOT epic.",
            "review_score": "1"
        },
        {
            "review_text": "To those who love games like Final Fantasy Tactics, Tactics Ogre, XCOM, etc..., I would highly recommend this game. It takes the core elements of great tactics style RPGs, and throws them inside a slightly simplified empire building game a la Civilization V.  I can acknowledge that the strategic portion of the game lacks some of the depth that can be found in the most hardcore strategy games, but I do not feel this is a flaw. One of the greatest games ever devised, Chess, has only 6 unique pieces, and in its standard style of play, only allows for 1v1 competition. There is a delightfully simple elegance to the units and technologies available in AoWIII (which offer many more choices than Chess). Taken from a purely turn-based strategy game perspective, they would seem shallow compared to the game's peers, but in the context of a deep turn-based tactical RPG (with heroes levelling from 1-30, earning skill points to allocate each level, and spells to research, and gear to equip) it is plenty complex enough.  My favorite thing about this game is how amazingly stable my multiplayer experience has been. My first time launching online multiplayer, it checked my connectivity rating, and told me it was poor due to firewall settings. I clicked a link provided in-game, and in a totally crisp and not buggy fashion, minimized my client and sent me to the company's help page, wherein I was given the neccessary port to forward. I did so, had the game check again, and was good to go. A friend and I have long searched for a good co-operative tactical RPG experience. The best I have yet found was FFT: The Lion War for PSP. It's a shame that a hand-held game system has trumped PC for so long in this niche. XCOM lacks co-op campaign functionality, Eador is horribly buggy and unstable, and the others I've tried are all crumby. In AoWIII, I've found that harmonious combination of enjoyable gameplay and completely (and I mean 8 straight hours of addictive, no crashes or disconnections) stable multiplayer.  Watch some videos of this game and decide if it suits your interests, but as for my opinion, I can give this one an A+.",
            "review_score": "1"
        },
        {
            "review_text": "If you like turn-based fantasy games then this game may be for you. This game might give you the worst ♥♥♥♥ing headache because one mistake can even make you lose so be careful",
            "review_score": "1"
        },
        {
            "review_text": "With the strategic and tactical mix, AoW3 has that Master of Magic feel while retaining the familiarity of the AoW 1 and 2 games. I have enjoyed this game very much. The classes seem to be very similar and playing them doesn't really require a different strategy for each. Fewer balanced classes that played differently would have been more enjoyable but very few games have ever gotten that formula right. I also find that occasionally I can win a difficult battle with autocombat ex: (two six man armies each led by a hero against four fliers and a hunter in a city) that I couldn't win manually and vice versa ex: (I beat an eight man army lead by a hero with three elven archers). Not sure what that's about but if I redo a battle a bunch of times and get my butt kicked I can occasionally win it with autocombat. Also a little frustrating when my hero doesn't get disjunction to research during a random game but oh well makes for a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "I love AoW3 but there is one thing I'd change if I could--the camera controls on the battle screen to rotate the view are backwards from all the other games I've played and there seems to be no way to tell the game to reverse it so it's caused me no end of frustration. The option to reverse the mouse screen rotate would be awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Some time now has passed and I have over 450 hours into this game. All of my original complaints have been addressed and the game is perfect except for one thing. Multiplayer does not support Apple Airport routers. With AOW3 now being ported to OSX I assume this will be addressed soon.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant! Great work shop content as well.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a true strategy game, a wonder that combines hex-based strategy with city managment and the growing of heros. The game has a good campaign, although the multiplayer and the skirmishes are better. It also features leader creation, so you can build multiple leaders from any of the playable races in the game.  The game also features a class system, which with regards to your heros, means they get skills based on their class. With regards to your leader, they also get skills, but this also determines what types of units you can build.  The game has some seriousness to it, be it the evil necromancers, wanting to bring the world to the apocolypse, with the help of undead dragons, reapers, and fallen angels, to the holy theocrats who want to bring peace to the world. The game also has some sillyness to it, tameing fairies and dire penguins, and other ridiculous creatures.  I would truly recommend this game, it is sure to bring you hours of fun, both by yourself and with your friends!",
            "review_score": "1"
        },
        {
            "review_text": "One of my 10 favorite games, ever, and I have played a ton of games.",
            "review_score": "1"
        },
        {
            "review_text": "The best 4X heroic-fantasy themed game on the market, especially since Might &amp; Magic is pretty much garbage nowadays. Age of Wonders III managed to stay true to the roots of the game while adding in new fun mechanics and content. It's a charming game, set in a colorful and vibrant classic fantasy universe. Well worth its price, along with its expansions, if you liked Heroes of Might &amp; Magic or want a change from Civilization/Total War.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the Heroes of Might &amp; Magic series, you will feel right at home here. More available choices, an intro campaign for those you like to ease into the experience!",
            "review_score": "1"
        },
        {
            "review_text": "Hate the long wait between turns on larger maps but overall this game is an amazing turn-based fantasy game.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game if you like fantasy and strategy",
            "review_score": "1"
        },
        {
            "review_text": "Age of wonder is old game but I love it .",
            "review_score": "1"
        },
        {
            "review_text": "A great addition to the Age of wonders line. Moves it into the new age. I wish somethings were a bit different but over all a wonderful addition.",
            "review_score": "1"
        },
        {
            "review_text": "one of the best Turn based games i have ever played just simply amazing only downside (for me atleast) is that sometimes the AI takes insane long turns but every thing else is simply fantastic 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Worth your money, even at full price.  Can actually Co-op very well, and even fight alongside in battles.",
            "review_score": "1"
        },
        {
            "review_text": "A combination of 4X and a hex based tactics game. This game focuses on fantasty style combat. It is good for people who like to play warmongers in games like civ.  Pros:   Customization. Do you want to play tree hugging dwarves? Why not? An evil elf cleric. Sure.   Battlefield tactics. When armies meet, turns into a turn based tactics game.   Simplified magnagment. No tax rates to worry about. City management is important, but not nearly as time intensive as in Civ games.   Game options. Want your heroes to be come back if they die? (as long as you win the combat) there is an option for that. Hate underground? Turn it off. Lots of monsters? No monsters? Everyone starts with a large pile of gold, a well developed city, and a huge army? ok Create your own leaders.   Cons:   Campaigns are boring. 400 hours in and I still haven't bothered to beat them all.   A bit of a learning curve. It takes a bit to learn the game. There are lots of units and roaming monsters can get quite powerful if you never destroy thier dens.   This game ruined a lot of other 4X games for me. Whenever I start playing those, I always come back to this one. ",
            "review_score": "1"
        },
        {
            "review_text": "civilization meets might and magic! good stuff!",
            "review_score": "1"
        },
        {
            "review_text": "When I first got this game it seemed a little dull. After playing for a while and exploring the races and classes and getting to know the game it's a real delight to play.",
            "review_score": "1"
        },
        {
            "review_text": "Great 4X game.",
            "review_score": "1"
        },
        {
            "review_text": "Similar to Civilisation games in some aspects, but not as dry. Tactical combat (can be skipped and auto battle instead), hero units, spellcasting, make this game great.  I keep thinking I've burnt out but keep coming back for more. Eagerly awaiting more DLC or AoW4.",
            "review_score": "1"
        },
        {
            "review_text": "Age of Wonders 3, Worth playing?  Age of Wonders 3 is a hex based empire building strategy game in the same space and Heroes of Might and Magic and Civilisation. If you've played any of the games in the same genre, you have essensially played this, this game however does some things right and others, not so much.  This game also allows you create your own hero character, there are around 5 races and 5 classes, all with different units and variations on armies, this allows you to style your empire based on what you have picked.  Empire building - 6 (bog standard, nothing new, very easy to use and the UI is pretty good. Research tree is bland and most of the time you will only have 2 proper options, the rest being superficial or pointless)  Combat - 8 (This game goes from your isometric empire builder to turn based strategy in an instant, with almost no loading time. Units feel varied, combat feels smooth, the UI is better than I expected and is functional and paired with the games research 'tree' you can get some pretty impressive units, like giant rolling warships and cannons)  Graphics - 4 (Easily the worst part of this game is the god awful graphics, don't get me wrong, the Empire map looks great and looks decently made but the character models are some of the worst ive ever seen, hideous.  Gameplay - 8 (I like this game, for a strategy game to work it needs to be complex on several layers, this game is a pleasure to control in every situation, part of this is the great UI, which is both decent looking and practical. Both the Empire map and the Combat are both well put together and work nicely.)  Difficulty - 7 (This one is hard to say, this game is more complex than you'de think, some of the battles ive lost have been to weak armies consisting of units that countered me hard, me obviously not knowing about this)  Content - 8 (This game has Campaigns, random maps which is skirmish mode and scenarios, that's more content than you can shake a stick at. This game also has many races and classes.)  AI - 6 (Stupid but ruthless)  New player experience - 6 (Small but steep learning curve, no indepth tutorial, assumes you know the genre)  In conclusion, I like this game, it provides enough depth for me to keep playing and it has enough variety for me to want to come back to play another match.  Overall score - 7.5 (This game is decent enough to sink a large amount of time in, its no CIV killer but its a decent entry into a dying genre, worth the price in my opinion)",
            "review_score": "1"
        },
        {
            "review_text": "The strategic level plays very simialr to Civilization games, with considerably less managment involved, with more focus on exploring and fighting than diplomacy. Fighting is the centerpiece of the game with all the myriad units filling thier own niche. The different races have rosters of simialr core units, but each one puts some different twists, either stat or ability wise, such as goblin infantry being the cheapest but having the lowest hitpoints, or orc archers causing bleeding damage and so on. The additon of all sorts of spells across the different classes always makes combat more interesting from chain lightning to cherubs you can usually zap, burn, blast, heal, shield something in the fights. It is a good thing the combat is so interesting though as the strategic level mainly serves as a conduit and context for the turn-based battles, the only way to win is to defeat your enemies, you can form alliances and there is a diplomacy system with dispositions and item and city gifting, but the end goal is usaually either kill everyone, or make a few friends, and kill everyone else. The one sorta exception to that is the independents (minor non-player or cpu factions). These will often be something not found in the normal factions, like giants or faeires or skeletons, and if you can ally with them they will give you a quest, usally involving killing something, and then after 1-3 of these will join your faction, allwoing you to recruit the special units. Of course you could always just kill them and absorbt thier dwellings, effectively accomplishin the same thing. All in all, game is a lot of fun with a lot of replayability, it seems to trade strategic depth on the imperial level for very high quality on the turn-based battles. ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, deep, and fun! Its a perfect mix of strategy, fantasy, RPG, and 4X game. City building is a little dumb down, just like the old AOW, but must own if you liked the old AOW games.",
            "review_score": "1"
        },
        {
            "review_text": "Age of Wonders III is a beautiful game. The world map looks like a storybook come to life, and the whole world feels fleshed out; living and breathing.  I can't wait till I understand all of the moving parts of this game, as I think I will then truly appreciate all of the work that went into this.  I don't buy many games at launch, but I am certainly glad I did.",
            "review_score": "1"
        },
        {
            "review_text": "Much fun! Of course, make sure you can run 64 bit with no issues.",
            "review_score": "1"
        },
        {
            "review_text": "It makes me so happy to see this series back, the game is brilliant and content is planned in the future. They literally improved everything from the prior installment. Like Heros of might and magic? Well come check out the series that inspired it, I can say with confidence this is the best 4x Fantasy game out there right now and it's only going to get better!",
            "review_score": "1"
        },
        {
            "review_text": "The most fun I've ever had playng an RTS. If you enjoy an RTS with a fantasy setting or just like throwing lightning and fireballs while ordering a legion of wolves to besiege a city try this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Think of the best things from Heroes 3 + city building and tons of other cool mechanics. I'm loving it.",
            "review_score": "1"
        },
        {
            "review_text": "A must have for any 4X / Turn-based strategy games fan.  On the menu : Lots of replayability, challenging AI, proceduraly generated landscapes, excellent art direction, Linux support.",
            "review_score": "1"
        },
        {
            "review_text": "Really enoy this game. Bought it because another game I wanted to purchase got bad reviews and doest not seem to have been fixed. I like the mix of city/empire building, the numerous options for heroes, and the strategic combat in this game. There is also a reasonable amount of user created content that is easy to install and manage within the game. The campaigns are fun and the random map generator has made some fun maps. This is one of those games that has amazing replayability. Put it on your wish list and get it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Love 4X? Love Fantasy? Then you'll love this game! With the DLC you'll have a lot of 4X fun!",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay has me totally hooked.  Graphics are pretty. The animations are really beautifully done and I love how each race/hero combination feels totally different.   Sound is good. Music is a bit shallow but theres mods to add more music in.  Character development is good. Civilization building is deep enough but this is a combat game mainly. That said there are many ways to win and you can adjust the winning conditions to your liking such as allied victory etc, it doesn't have to be to the death.  The story mode seems like a lot of fun and theres many hours of content there. I enjoyed what I played of it, though I quickly went on to the random map generator which is absolutely fantastic! You can customise so many things in the game and the character creator is wonderful to play with.  Theres plenty of mods to play about with on the workshop to improve things further.  Basically all there is to say. Awesome sauce game &lt;3 Highly recommend it.  (I bought the xpacs too, so I can't speak for vanilla alone)",
            "review_score": "1"
        },
        {
            "review_text": "LIkes: * Unit-by-unit control on an overworld and battle map. The number of units you manage throughout a single game does not become unwieldy either. * Flexible spell casting system, which can often turn the tides of a battle (or war); in your favor or your opponent's. * Extensive and challenging (in hard difficulty) singleplayer campaigns. * The euphoria when you defeat a numerically or qualitatively superior force through tactics and wit. * Multiple different races and classes, each of which is easy to pick up, but hard to master.  Neutral: * City building and resource management is vital, but lacks much in terms of customization. After you stuff every possible building in a single city, you repeat for other cities. * Research (spells and bonuses) is a nice system (you are unlikely to research everything in a single game), but opaque in terms of what unlocks what.  Dislikes: * Multiplayer generally requires auto-combat to go at a reasonable pace (combat holds a global lock on the game state). * Lower tier units become worthless quickly (except, to some extent, archers). This generally leads to monolithic army compositions later in the game. * Spell disjunction, especially in games with many players, is somewhat annoying; and constantly hampers your ability to do much with spellcasting besides re-casting disjuncted spells.",
            "review_score": "1"
        },
        {
            "review_text": "I came for Age of Wonders 3 in two and a half years. Now that the game has gotten much better and richer with all the patches and expansion packs, I highly recommend it to anyone looking for a 4x game with magic stuff. In fact it has now become one of my favorite 4x games. In my honest opinion it is the best 4x in terms of exploration :)",
            "review_score": "1"
        },
        {
            "review_text": "Killed a squad of Orcs and captured their city using a spy satellite.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the only game where you can play as Vladimir Putin, kill Donald Trump, have Vermin Supreme die from Skelator, have Snoop Dogg surender to Vladimir Putin, Join his army, and then they go to war with Skelator.  10/10 would beat Snoop Dogg into submission and name his final city W33dville again",
            "review_score": "1"
        },
        {
            "review_text": "I spent twenty hours building a continent spanning empire expecting to come to face equally powerful enemies in glorious battle on a massive scale only to find that only one of my four AI rivals had more than a single city to their name and more than a handful of archers with which to fend off my all-devouring hordes of summoned Eldritch Horrors  Thanks Triumph  Edit: ai got updated but they've still got no clue how to build an empire",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite game, a classic turn-by-turn with macro and micromanagement. A must have for the fans of that type of game.",
            "review_score": "1"
        },
        {
            "review_text": "I give this game a 9. An incredible remake of AoW 1 &amp; 2. Except for Multiplayer, where the game stops all human players from doing anything (except to watch the battle) when someone starts a combat. I rate it a 6 for multiplayer due to that huge gaff. ",
            "review_score": "1"
        },
        {
            "review_text": "Loved the original AOW and this was good job at continuing the franchise. No huge risks here, build on what you've done right and add content where it can add to the experience. I would like to see a way to play as some of the evil specialty races (i.e. undead), with coresponding upgrade paths that included more than a few buildings, but it wasn't necessary to make the game worth recommending.",
            "review_score": "1"
        },
        {
            "review_text": "love age of wonders!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "I really didn't know what to expect when I started playing this game and boy did it get hard quick on the second part of the campaign.  My first day in the game and at the moment I'm stuck. I will beat this orc I swear it. His head will hang on one of my pikes before the night is over.  Over all I'm glad I took the dive and purchased the game.  I do find it a little laggy on my alienware laptop but thems are the breaks when you are playing such a pretty and expansive game.  Likely to purchase all the expansions when I get paid Friday while they are still on sale.",
            "review_score": "1"
        },
        {
            "review_text": "The Best Fantasy 4X game out there.",
            "review_score": "1"
        },
        {
            "review_text": "Dis sere is a fun gim.",
            "review_score": "1"
        },
        {
            "review_text": "1 more turn please",
            "review_score": "1"
        },
        {
            "review_text": "A master piece of turn based strategy goodness. If you are a fan of turn based/fantasy strategy games, or any type of turnbased strategy war games, buy this right now.  Important to note that this is a turnbased startegy war/4X game, if you're looking for detailed empire/ economic management you won't find it here. City building has enough options to be interesting, but you don't feel like you are governing cities. You're leading an empire to war.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever. Period. (I would place this game in the top 100 of all time)   Get it and the expansions. If you like turn based building and fighting this one does it VERY well. I have spent a lot of time playing this and the reason is simple it is good and it has replayability.",
            "review_score": "1"
        },
        {
            "review_text": "The game is fun and simple, like a mix between civilization and disciples gold. the manual and auto combat feautures add more to strategy for one wrong move no matter how strong your forces are could spell thier downfall.",
            "review_score": "1"
        },
        {
            "review_text": "edit: Like the start of my original review. Most underrated game ever. It's awesome.. seriously get it.  Incredibly underrated game.  In the past I played AoW 1 and 2 so when AoW 3 was announced I was looking forward to it, but the reviews weren't that positive and Endless Legend got released which got quite good reviews so I preferred that one. While Endless Legend doesn't manage to capture my attention I played some other games. Eventually AoW 3 was on sale and I thought... whatever let's do it. Without high anticipations the game kinda blew me away. What an incredible atmosphere! The tactical fights are really good and the strategy is ok, but this game just really DEMANDS me to play 1 more turn. It was a long time ago that I really couldn't stop.. keep on delaying the time I was going to quit.  Now I also bought the Golden Realms expansion and it's even better! The best part is still to come though! The upcoming expansion Eternal Lords will offer a new class and 2 more races, but also a loooooooot more depth to an allready quite deep game imo! 1 of the things they worked on which was really poor is Diplomacy which is great. AI will have different personalities nad being evil or good actually influences your playstyle.  Just really get this game if you like 4x, it's worth it. No doubt!",
            "review_score": "1"
        },
        {
            "review_text": "Very disappointing, nothing new but the graphics, and casting point allocation has been removed. The controls are also somewhat unresponsive resulting in sore fingers after awhile, and hero upgrading is extremely mundane. Just buy age 2 if you want to experience the game.",
            "review_score": "-1"
        },
        {
            "review_text": "i will never stop having sex with it YOU CANT MAKE ME STOP",
            "review_score": "1"
        },
        {
            "review_text": "Hundred plus hours in, loving every second of it. A solid empire builder coupled with a fantastic turn-based combat system and diverse unit list. Hilarious in the combos you can think up. Dragons, Unicorns and goblins versus Orcs, Giants and spiders, the list goes on and on. Gorgeous to look at, and a blast to play :)",
            "review_score": "1"
        },
        {
            "review_text": "Awesome strategy game ! Remember me of Heroes but with the addition of an impressive combat system.",
            "review_score": "1"
        },
        {
            "review_text": "Civilization V meets Heroes of Might &amp; Magic is how I would best describe this game.  The fantasy setting is hardly original but the game is gorgeously presented with an easy to use interface, lovely artwork and graphics (anti-aliasing is poor but you can force MSAA+SGSSAA via the driver if you have an NVIDIA graphics card) and a wonderfully atmospheric musical score that fits the game perfectly.  Thankfully, the game plays as good as it looks and sounds as well. I've found the game to be very immersive and entertaining, even relaxing as you can focus on building up your cities and forces and set the combat to Auto and just watch it unfold in real-time if you wish.  If you are a fan of this genre then this is a must-have in my opinion.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the the first AOW series you will like III. DLC keeps getting better.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so fun! If you like kingdom building games or tactical battles this game will be a blast! It has a nice art style to it and a interesting ballance of neautral enemies / quests / and the usual build kingdom to crush enemy thang going on. Although I love this game it does have its short comings as well. Certain unit types are just absurdly unballanced which isn't uncommon in games with alot of factions or races and the neutral enemies can easily distract you from your main goal. That being said it's still very fun and satisfying each and every battle. If your looking for hardcore kingdom building and not a huge fan of tactical battles then mayhaps Endless Legend is better for you, but this game is mostly about the battles.",
            "review_score": "1"
        },
        {
            "review_text": "You've played Civ V, where you made alliances with city states and declared war on other civilizatios? You've played LOTR where u were able to play as an orcish warlord or an elven lord? Now think of them combined. Here you go, you have Age of Wonders III, a 4x game with mythological races and other elements (orcs, goblins, fairies, giants and exc.) As a HUUUUGE fan of AOW:SM, gotta say that this one is not good as it's predecessor, however it's still great. Had a lot of fun with it and I'm sure I'll have some more.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "if you liked age of wonders II, you'll think you've bought another expansion. more of the same, reliable, difficult campaigns.",
            "review_score": "1"
        },
        {
            "review_text": "Simply Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, so far I'm only a couple hours in, but it's the most fun if ever had with a 4x game. The strategy mode is fantastic, and the combat mode for troop deployments is breath taking my beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "After the incredible AoW2 SM the expectations were very high for this new incoming 3D version. Honestly I was mainly disappointed when the game came out due to the lack of my beloved faction, the undead and for the fact that this game followed the same way of many others with the DLC. Now, with all the DLC is the best fantasy turn based game. Tons of fun, many different strategies.",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly good. Civilizations meets Master of Magic.",
            "review_score": "1"
        },
        {
            "review_text": "Very solid 4X game, primarily focused on combat. The expansion are highly recommended because they add many more gameplay options and playstyles that make this game very replayable.",
            "review_score": "1"
        },
        {
            "review_text": "I have only started playing but this was the kind of game that I was wanting when I bought Civ 5 and Endless Legend. Dont get me wrong I love those games but I wanted to win by fighting not diplomacy and it seems this is what kind of game this is. I wish I had bought the complete version now and theres no way to upgrade during a sale",
            "review_score": "1"
        },
        {
            "review_text": "pretty decent strategy game, but might get better with expantion.",
            "review_score": "1"
        },
        {
            "review_text": "Okayish, buy it when the game is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Great hex based strategy fantasy game.  Creating your our leaders and playing different races make each game different.  The game gives you quests to complete if you want and you will receive a reward for doing so. Amazing game really recommended ",
            "review_score": "1"
        },
        {
            "review_text": "Lots of style, little substance.   I've always gravitated towards 4X games, so when Age of Wonders III came out, I was naturally pretty hyped. However, after playing it, there's quite a few flaws I've noticed about the game:  - Character customization is extremely limited  - Game is a resource hog. My computer's pretty decent and I still got huge lag spikes pretty frequently  - It is far, far too easy to steamroll in this game. Once you've captured one city, the rest is just details.   - Very, very little variety. A few leader classes and races and that's it. There's not much assortment of monsters, either, even with the expansion.   And lastly, the game simply doesn't have any 'soul'. Remember Heroes of Might and Magic III, where each and every artifact had a little story behind it? Or Fall From Heaven 2, where each faction had a long and sordid history? Or even Fallen Enchantress, with a bit of both? Yeah, none of that's here. The game world is pretty much the blandest you could imagine, with a color palette apparently ripped from Fable 2 that just does not jive with the tone the rest of the game tries to set.",
            "review_score": "-1"
        },
        {
            "review_text": "An excellent game for the genre and a faithful sequal to a series that was long overdue for another installment. AoW III has all the best parts of Civ 5 combined with the high fantasy that the series is known for.",
            "review_score": "1"
        },
        {
            "review_text": "I like 4x. I do. It's a great genre for fans of strategy. After playing hours upon hours of civ 4, a few of the total war games, warlock 2, civ 5, then finally beyond earth, I started to get a bit bored on basic science and diplomatic based victories because I just didn't like combat in civ. I picked up Age of Wonders 3 during the past sale, and I'm really enjoying myself. Compared to civ, elements like the way tech and buildings worked took a bit to get used to, but i'm really starting to fall in love with the game. It combines the grand 4x strategy of civ, with a much better combat system similar to what you would see in a hex based strategy game like might and magic, and I feel the fusion was extremely well done. I'm doing something I haven't done in a strategy game like this in a long time, and that is seek out combat. I love the feeling of flanking opponents for massive damage, just to realize I left a commander unguarded and having to wait a few turns before it respawns, and having to build up armies again. I'm still in the middle of my first game, but I can forsee many more in my future, and would recommend this to my civ loving friends out there, especially if you're getting sick of boring combat. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A quirky, but very large and ambitious strategy/hero game.",
            "review_score": "1"
        },
        {
            "review_text": "I'm disappointed at where this series went, but if you're a Sid Meier's Civilization fan, this is fairly similar, just with a medieval/fantasy twist. I loved the first two Age of Wonders games but I was disappointed with this one.",
            "review_score": "-1"
        },
        {
            "review_text": "I would recommend for fans of the series or genre and I did enjoy discovering what this game had to offer. However, I did find the game quite shallow once I started to reach the peak of what was available. Almost everything is limited in scope from the cities buildings to the troops that can be fielded. There is slight difference between races to choose from and those units can be acquired during playthroughs making the only major decision is the type of leader you'll be.  The graphics are great, the turn based maps have plently to explore and the HoMM tactical combat is fun until it becomes a tier 4 spam fest.  I don't regret my purchase as I enjoy these kind of games but I don't see AoW3 competing for my freetime again.",
            "review_score": "-1"
        },
        {
            "review_text": "@Dev 'Easy Mode' - I don't think you understand what this means.  I went easy mode campaign to get a 'feel' for the game and learn it - immediately the game decided to hit me with a ton of bricks, murder my fair city and plunder my neighbouring town of all their pixie dust, repeatedly. God forbid what normal or hard mode is like. It feels like your forced to use certain units, freedom of choice is limited.  I feel like I'm now wasting my time with the game and have little desire to pick it up.",
            "review_score": "-1"
        },
        {
            "review_text": "I recommend this game but won't post a review. Deal with it.",
            "review_score": "1"
        },
        {
            "review_text": "Almost a good game. I wanted the game to be better than it is. Needs some refinement to be really a good game. Lacks a personnel connection with your empire once the charicter creation is complete. It is like starting a fantasy Civ with a custom charecter (which was awesome) but the game play and interaction with the opposing players was absent. The game became tedious and uninteresting as turns progressed throughtout the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I had a lot of hope for this game.  I had a lot of disapointment with this game. Everything in the game is at best 'ok'. There is no real progression tree telling you what you need to research to get what, or how far through the research you were. The range on ranged weapons is ridiculously small and the penalty for the range was even more ridiculous. Apparently no one on the development team has ever spoken with or researched historical bow range increments. The melee combat is pretty stupid with the implementation of flanking. Apparently if an enemy is approaching you, and outside of one step away, your unit would never think to watch them closing in on you, and thus should be be able to annhialate you. If you were actively engaged with an enemy, this makes sense. When you aren't engaged? The development team shows just as much initiative in considering melee combat as they did with ranged. The magic use in tactical and strategic combat ranges from flavorless to boring to pointless. There are uses for magic other than nailing a ranged attack on an enemy, but most of them are not any more effective, so there isn't a point in doing so most of the time.  The replayability factor in this game is non-existant. It's not a terrible game, it's just not engaging, exciting, or really entertaining. It's blah in practically every way, and a huge disapointment.",
            "review_score": "-1"
        },
        {
            "review_text": "A great game overall. Great design, beautiful soundtrack, smart gameplay, a huge lot of content and very deep and tactical battle system, and great work from the devs based on the community's feedback (each patch and DLC make the game even better). This game has everything for him.",
            "review_score": "1"
        },
        {
            "review_text": "Played a match it just gets too a point where you know you've one and you have to mop up... I HATE CLEANING. I like it though look forward to Multiplayer UI being made easier, and additional race ect. As I recall AoW2 had a ton.",
            "review_score": "1"
        },
        {
            "review_text": "Best way to describe this game is a simplified version of Fallen Enchantress. Its still fun. If Civ5 is the most complicated strategy game you can play you'd get along great with this game.",
            "review_score": "1"
        },
        {
            "review_text": "Age of Wonders III is a good game. Off course it's not Heroes, but few things are really nice in the game, mainly graphic, and plenty units/armies You can choose. Gameplay is also OK. After about 20 hours game starts to be boring.. My Mark : 6/10",
            "review_score": "1"
        },
        {
            "review_text": "imho better than homm or civ",
            "review_score": "1"
        },
        {
            "review_text": "After playing a couple of games and experimenting with different settings, I have to say that I think the game is underwhelming.  What I like: + There is a good amount of diversity of creatures, abilities, hero types, etc. + There are cool things to do on the map, things to explore and fight. + Tactical combat is pretty decent.  What I dislike: - The AI. The tactical AI is semi-competent, I guess, but still underwhelming. The other faction AI players are probably the most disappointing. When you are ahead, it does not seem to be maneuvering in any real fashion to bring you down a notch. Before you get ahead it is not trying to keep you down. - There seems to be little or now catch up mechanics (at least not for the AI). Once ahead, you're snowballing out of control fast.  I haven't played against other players, so I cannot comment on that aspect of the game.  Addenum: I will play some more random maps and use different victory conditions than 'Allied Victory' and see if that helps...",
            "review_score": "-1"
        },
        {
            "review_text": "This game deserves a thumbs up for being a fun strategy based game. Very well thought out. Storyline is great and so are the graphics. Highly recommend as a single player game.  However, I had every intention to play this game as coop. That's where the thumbs down comes into play. Even with good connection...we were unable to host our own server using multi-player mode. And there are really not a lot of servers to join. Most are password protected. The ones that aren't, which I have to say are very few...with more then 2 people playing on the server tends to get very laggy. So until the game makers fix this issue, I wouldn't rely on this game being multi-player.   But playing solo. I still do recommend.",
            "review_score": "-1"
        },
        {
            "review_text": "Tatical Combat is the worst i ever seen in a Turn-based Strategy game! When someone try to tell you that this game has a nice tatical combat system, than he is a turn-based-strategy noob or just a god damn liar!  The units in an army don't have any initative, instead all units in one army make there move! So you can move your whole units before the enemy is able to do anything... When you are finished then it is the enemys armys turn... And guess what... he also can move all his troops in one turn. And then its your turn again... and so on...  The first army that will get in range of the enemy army will be completly crushed by the other army, because the other army can attack the first army with all of it troops, before the first army get a chance to fight back...  WHAT A F***ING JOKE!  I don't know which dev had the idea to implement such a poor tatical combat system, but from my point of view it is a completly gamebreaking mechanism.  And i never has seen such a bad combat system in over 20 years of playing turn-based strategies!  If you got game like heroes of might and magic or fallen enchantress just stay with them. They have a alot better tatical combat design than this pile of BS.   Beside from that, the controls and handling mechanism of the game is not very polished and a little bit anoying.  If you really want this game than wait till it cost 5-10 bucks and don't make the same mistake like i did by wasting 20 bucks in it.",
            "review_score": "-1"
        },
        {
            "review_text": "At first I thought this is a good game, but after a few hours in I realized I was just fooling myself, it's a bad game.  * After killing 11 out of 12 soldiers in a squad it still does the same damage as if nothing changed, * Heroes customization has too many useless traits, and even level 10 heroes aren't that powerful. * You can only cast 1 spell per combat round, even if you have 2 or 3 casting heroes. plain stupid.  * Casting global enchantments is pointless, whatever you cast is immediately dispelled the following round. * Heroes only give their bonuses if they are leaders, so you can't stack two heroes in an army. why?! * All races have the same buildings. * There is almost no different between the units of each race (race 1- priest shots fire, race2 - exact same priest, but it shots poison etc...), choosing a race is almost purly about aesthetics. * It takes ages to clear a map, and 75% of that time is spent waiting on your cities to produce enough units to take down the 3 army stacks the computer has holed up in his castle. really really boring. * Not enough ruins and such to explore, you barely get 2 items per game. * Strategic battle starting positions are insane. units start out all over the place.   I can go on for ages, this is a bad game, they did not think this through, this is a big disappointment!",
            "review_score": "-1"
        },
        {
            "review_text": "Civilisation style empire management combined with turn based strategy yet done so boringly. The array of races is large but they're all boring and the unit of one race is largely the same of a similar unit in another race. The array of buildings is boring (and pretty much the same through race). Heroes feel weak. Turn based battles are boring and your troops feel worthless.   It's a chore to play and I gave it a go, but I don't like it.",
            "review_score": "-1"
        },
        {
            "review_text": "A must have for previous fans of the series.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent, highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "So far, this game is a treat. Combined with some of its expansions and balancing mods (all available on Steam), the possibilities for interesting gameplay are vast, both tactically and strategically. It's easy to learn and hard to master, so I recommend practicing your strategies on lower difficulties before diving into hardcore war gaming. I know I'm going to put a lot more hours into this game, there's just so much to see and do.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun and stuff and other review things",
            "review_score": "1"
        },
        {
            "review_text": "Like Civ 5 but with more combat.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly could not tell you if I was playing Civilization V or Warcraft 3.....and win!",
            "review_score": "1"
        },
        {
            "review_text": "If you like turn based strategy games this is a solid, awesome game. Now if you like them oriented to fantasy and combat this is actually the best that the genre has to offer. And with the expansions its a modern classic, the kind of games others compare to.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Heroes of Might &amp; Magick mixed with Civilization. You have to love it &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "after 10 hours of game play, I can say that this is a great game. I am really enjoying it. I wish they would have included an actual tutorial, but after playing the suggested rookie campaign, and tinkering around alot in all the buttons, windows and their version of a 'civilopedia', I finally think I got it figured out. I love the story line of the campaign mode, and the strategic battles are a lot of fun. Save often... buy this when you can!",
            "review_score": "1"
        },
        {
            "review_text": "I got this game during one of the Seasons sales * don't remember which one though :P* and i let it sit in my libary for a good month before installing it *GG college* But sense then i've come to realize that was a mistake. this game is a great take on a well thought out blend of 4x/Hero based tactical Strategy * the addition of the RPG level up system for your heros is very much welcomed and adds that little something to the game.*.   if you like the like of Endless legend or Civ game then you should add this to your libary. * Also just pay the 5$ more fore the deluxe edition, while it adds one scenario *a pretty good one* it give access to the 2 hours worth of soundtrack which is excellent. Honest rating. 8.5/10 * rating doesn't include multiplayer or the two expansions*",
            "review_score": "1"
        },
        {
            "review_text": "First played when it came out. I had a lot of fun with the first two/three iterations of the series and Age of Wonders 3 is certainly a great, modern update to the Age of Wonders series. I look forward to what the 1.5 update and expansions have improved upon when I give it another whirl in the future.",
            "review_score": "1"
        },
        {
            "review_text": "This is probably the best 4X game I have ever played",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but ftfs where are my undead? In upcoming DLC, that's where :(",
            "review_score": "1"
        },
        {
            "review_text": "Nice Fantasy battles game fun to play",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Turn Based Strategy games you can get.",
            "review_score": "1"
        },
        {
            "review_text": "This is a beautiful and quirky game, the setting is lush and exciting. However, the quirkiness can actually be something of a problem. A player is limited to a rather small army, especially at the beginning of the game. This limit does not seem to apply to the computer player, however. Again, this game is designed so that you explore the fascinating landscapes rather than 'hunker down' at your capital and other cities. The army limits also apply to your cities, so I found myself playing almost a completely defensive game with my armies in my capital and towns, and the immediate 'hex boxes' encircling those just waiting for massive computer armies to attack me. I'd have liked to see more of the world, but this was almost impossible because I found my explorers ruthlessly hunted down by the computer while at the same time wiping out my capital and cities. Also, you have to generate plenty of resources in your cities to fund and feed your armies, which precluded having armies to even match the size of a computer player. 3 out of 5 Stars.",
            "review_score": "1"
        },
        {
            "review_text": "If you really like spending your time playing strategy games. Games that sometimes take time to complete and you enjoy every process of it, this game is just great for that.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. I loved Master Of Magic and this game is very much like it.",
            "review_score": "1"
        },
        {
            "review_text": "Favorite fantasy turn-based strategy rpg since Lords of Magic. Waited 16 years for this - a true successor complete with modern 3D graphics and is notably hex based instead of grid/square based. That means six possible directions of attack/movement/defense/etc instead of just four. Makes for a more realistic game. I suppose circle based with infinite directions would be the most realistic but thats another topic.  You want to start from nothing and grow to a magnificent empire spreading your influence across the map - check. Level up heroes of different types each of unique races with several classes with many abilities - check. Research improvements to your units, new spells, and build fortresses, watchtowers, and even build new cities - check. Change the environment to suit your needs or make the land inhospitable to others - check. Participate in the defense of your cities defending against the monsterous hordes or lead an epic siege against the enemy - check. Can equip your heroes and leader with artifacts (items) to make them more powerful by increasing stats, granting new abilities, and even entirely new mounts for them to ride on - check  Yes Age of Wonders 3 is everything I wanted in a game and it actually turned out to be better than I expected! I eagerly await the next expansion which I hear will feature a new Frostling race.",
            "review_score": "1"
        },
        {
            "review_text": "I played the original, then the second, and now this. The game has made both incremental and drastic improvements over the years. If you're a fan of turn-based heroes of might and magic or civilization style games, this might be sort of up your alley. The 'best' part is the fact that there's a fairly complex turn-based piece battle system waiting there for you as well. The story line is the best kind of fantasy camp.  33% empire management, 66% tactical battles, 1% giggling as your giant/dragon/elemental bashes archers in their god damn mouths.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpeice and leaves stardocks attempts at this kind of game for dead.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fantasy style gameplay",
            "review_score": "1"
        },
        {
            "review_text": "My favourite 4x strategy game. This game has made it to my top 10 games of all time! If you enjoyed 4x games, or played previous games of AOW then this is the one for you!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good game, solid gameplay. The multiplayer is balls hard to get into with each other though. Since you're FORCED to have 'good internet' as determined by the game, to be able to host. No LAN.",
            "review_score": "1"
        },
        {
            "review_text": "It's a little different than just being a Civ fantasy, but the games can take a long time like civ. I really enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Playing this game is like riding a time travel machine. The moment you finished a campaign it is now the week after.",
            "review_score": "1"
        },
        {
            "review_text": "A very mediocre turn based fantasy game. Wait for sale prices and DLC (e.g. learn the optimal build order and roll your face across the keyboard and auto-combat carries you to victory as the combat is otherwise tedious and boring).",
            "review_score": "1"
        },
        {
            "review_text": "I've played every Age of Wonders. This is the Best.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great 4x fantasy game. The creators are constantly planning new content and making them 'expansions', releasing paid content in a very appropriate manner which is more than I can say for the majority of the games on steam that have DLC. So far, only 1 expansion and they are planning the second one and previewing it through dev blogs and the improvements they are planning look great. Even if you are not a big fan of DLC, it's not like you need to buy in order to have a complete game. When the first expansion was released, it came with a free patch for everyone who owns the game that fixed a few bugs and generally improved gameplay. There is already a lot to do in the vanilla game and expansions add a significant amount more.",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "A strategy game with spells? Hell yeah its fun.",
            "review_score": "1"
        },
        {
            "review_text": "I have got this game a little while ago and I must say its amazing! Here are some pros and cons...  Pros .good graphics .good gameplay .has a wonderfull mix of empire building and rpg. Cons .a little buggy at first but I messed around with the settings and it went a lot smoother.",
            "review_score": "1"
        },
        {
            "review_text": "Theres a ton already so im not gonna waste time explaining myself. Good game but idk I'm alil dissapionted. Maybe wait to buy when it goes on sale or something.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, fun combat. Not the most diverse units.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but a little shy on the empire building for my taste. There are no other victory conditions other than war. The spells are very cool. Your faction is a combination of your race and class although over all they are all very similar, seems more just for flare. The combat is decent if a little simple. I love the multilayer map, it reminds me of master of magic from years past. All in all a good game!",
            "review_score": "1"
        },
        {
            "review_text": "the game has alot of good potential..but for me right now. I can not stand the fact of the AIs being able to make movement during 'their' turn....and 'MINE'..... 'waiting on others'..is what you will experience the most within this game....First..you must wait 4ever for the AIs to take their turn..then...to make matters worse...you are constantly interupted while trying to take your turn because of AI enemy movements during 'your' turn of actions....just now...when it became my turn to play..I..on purpose..did not even touch my mouse during my turn..The enemy AI leader moved his forces within reach of my city during HIS turn..then during MY turn..he moved his forces in and attacked my city without ME being able to take ONE action...I was able to simply sit back and watch...again ..I must emphasize..that I 'DID NOT' perform a single action..the AIs simply DO NOT stop movement within the game..just a fair warning b4 you buy the game",
            "review_score": "1"
        },
        {
            "review_text": "It's almost criminal the way this game is underrated. This is easily one of my favorite strategy games of all time and I can't seem to understand why not many have noticed it. Instead of a cheap ♥♥♥ battle animations you actually get to take control of your units, so you'll be able to turn situations where you are outnumbered 3 to 1 and still pull out a victory (if you're good enough). Granted it's not total war levels of control but it's still better than civ5.  If you don't have this game, get of your ♥♥♥ and buy it already.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's a lot like Civ, if Civ were all about military stuff. In other words, less interesting Civ. Simplified economy, no culture, research only serves your military, diplomacy is only whether you're at war or not, the only reason to build buildings is to build units slightly differently. . . The turn-based combat is decent, but gets old real fast, with how much of it you do.",
            "review_score": "-1"
        },
        {
            "review_text": "I have declared War against my friend in this game. We have up to two weeks to practice... this is going to be chaos!",
            "review_score": "1"
        },
        {
            "review_text": "Boring, clunky and not fun. A disappointing game for someone who loved the classics.",
            "review_score": "-1"
        },
        {
            "review_text": "I really liked this game. You should try playing, if you like Heroes.",
            "review_score": "1"
        },
        {
            "review_text": "Named my theocrat Ken Ham. Immediately found an egg and it hatched into a dinosaur for me to ride!  10 ( commandments ) out of 10!",
            "review_score": "1"
        },
        {
            "review_text": "8/10 one of the better games ive seen and their currently adding new features.",
            "review_score": "1"
        },
        {
            "review_text": "Its pretty kewl",
            "review_score": "1"
        },
        {
            "review_text": "More of an sRPG than traditional 4X, but maintains some elements of the genre. It's like a Civ-lite on the strategic map alongside a surprisingly complex hero and class system with very different approaches. Combat is very much like XCOM and other such games, and has quite a bit of depth and thought put into it.  Barring all that, Kingdom of Dire Penguins aligned with Evil. Sole purpose the game is worthy of a buy.  Top game.",
            "review_score": "1"
        },
        {
            "review_text": "BEST 4X GAME EVER MADE BY MAN 9.7 OUT OF 10. BUY THIS AND THANK ME LATER.",
            "review_score": "1"
        },
        {
            "review_text": "Don't believe the hype. AoW3 is great.  You should get it if you like turn based fantasy strategy.  This game is NOT Civilization. It never was. Don't expect to be, or you'll be disappointed. THIS IS AGE OF WONDERS!  It's like epic chess. Vast board, upgradable pieces, magic and NPC's, and adventure. Everything you wanted chess to be as a kid! And like chess it can be brutally unforgiving. save well, save often!  There are precious few games I would pay full price for pre-release, but I was a HUGE fan of AoW 1&amp; 2. And I knew it would be worth it. For fans of the series - the same classic game is here, although certain aspects have changed. Much like between 1 &amp;2! I have yet to play through but have enjoyed it.",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game. It is bad. Do not buy it. Limited class options and every race has about the same units with different colors. There's no strategy really, it's just who has a bigger army. No depth at all. Just kill, kill, kill. Produce soldiers, take a city, repeat.",
            "review_score": "-1"
        },
        {
            "review_text": "My boyfriend gifted this game to me, as we were both looking for something fun to play together and it looked fun. Other people said it was fun too; the reviews seemed good. It's compeltely unplayable though. I checked the system specs before hand. I have a good computer. I've run other, more intricate games before with no problem, but the fps on this was like 2. I closed all the windows I had open. I checked all my stuff to see if anything needed updating. Nothing fixed it. So I thought, I've only had it running for 20 min, surely I can get a refund done so the boyfriend won't have completely wasted his money, but steam doesn't do that either. I wasted an extra hour just trying to figure out how. Now my only day off's almost over and my plans of having fun video game time with the boy all night are ruined and I don't think we'll buy anything from steam again.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has huge problems. I am not sure where to start. I was bitting my nails waiting for this game to release only to be disappointed when i finnaly got a chance to play.   The biggest issue for me is in the combat system its self. There is much less stragagy then i thought. If you have strong troops you win, if you dont you loss. no big troop unqueness. ranged or melee. fly or walk. I was really hoping for troops that had special abilities.  its no wonder they put in an auto resolve for battles. Battles are boring and the ones you need to fight cuz you cant risk losing are usually way too long.  i guess i was looking for an new kings bounty or might and magic. this game is more like civilaztion.    ",
            "review_score": "-1"
        },
        {
            "review_text": "I would not recommend this game, for singleplayer. There are a few issue's i have that cause me not to enjoy this game. Warning: this is highly subjective, based on personal experience. Therefore i recommend keeping that in mind!  - First the depth. When you start the game and see all the different races and the specialisations you may get the idea that there's alot to discover. However every race play's very alike, there are differences ofcourse but the general concept is the same throughout. (swordsman, archer, pikeman, horseman etc).  The specialisations do bring some variation but the research-tree's attached to them are short. The extra units for each specialisation is a welcome addition, however it's not quite enough.  - Combat/balance. The combat has some meat to it, it's the focus of the game. Some interesting mechanics suchs as attacks of oportunity and hero skills add to the strategic element. But because of the low variety of units it becomes more of the same much too soon.  -Pacing. The big focus in this game is as i said the combat. Sadly around turn 50-60 all units but tier 4 units get less usefull. Wichs results in tier 4 unit spam, it takes away from the already limited choise and variation. And for me that is were most of my games ended, because i did not feel like spamming one unit.  - Diplomacy. Diplomacy is barebone in this game, it's about declaring war or signing a peace treaty. You can interact some more with independant city's, like vasalisation. But when you tend to wage war everyone will like you less, making it harder to have good relations with anyone (as a war decleration effects every other player/independant) it's simply the most viable mechanic by far to just wage war as the only option.   - Strategic placement. This is combat related, you get to choose 6 unit's for each stack. Then you can fight with multiple stacks in one fight to up to (i believe) 48 units. This sounds very nice but there's a big problem that i personally have with it. If you fight with 2 stacks versus one the AI tends to advance towards one of them. That leaves the other to catch up since the distance between allied stacks is relatively large.  Because of that the reason to fight with multiple stacks becomes less important, your main stack is gonna do most of the work (hopefully, the AI might attack the other stack).  Or the AI splits it's army destroying it's chances on it's own.  In encounters (versus independants roaming or placed around the map) the battlefield is so small that ranged units can reach your army in the first turn. And they get to go first because you attacked. So they get a free attack in.... does not seem very strategic.  - City defense. This seems to be done by placing units within the city, wich cost upkeep. The AI will ninja your city, it even intends to do so. The only way is to use units wich should have bin fighting in your army, there should be a building for it, but none to find.  -Graphics. This is done fairly well, the game does look beautifull and the animation quality is high. It also runs very well and support for the game is good, the devs are very active and helpful!  All in all i expected something along the lines of Warlock or HoMM. But this is a different creature entirely. That said the issue's i have may not be a problem for others, as many people do like this game. And for good reason, i did like aspects of it very much. Sadly the points mentioned made it not so enjoyable for me personally.  I would not recommend unless none of the above is an issue, if you do get it i'd recommend to wait for a sale (it happends frequently)!",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game.",
            "review_score": "1"
        },
        {
            "review_text": "I would love this game, it is well crafted and enjoyable...BUT I am unable to access multiplayer at all. I can't connect to anyone, I cant host a game because of 'Poor Connectivity'. I have tried to troubleshoot everyway i can, disabling firewalls, portforwarding etc etc etc... but there is no way for me to play online. Which makes this game rather sub par.",
            "review_score": "-1"
        },
        {
            "review_text": "it would be really nice if i could play this game..... hit the register button as the forums imply you can do..... and there is this msg, cannot open acount invalid username, and even gone so far as to change my gog password to no luck....... this is not what i call a good time pls any assistance would be awesome thanx",
            "review_score": "-1"
        },
        {
            "review_text": "heck yes.",
            "review_score": "1"
        },
        {
            "review_text": "multiplayer is broken the devs are ignoring that it is, and wont respond in their forums. Dont buy it they just want your money for their brokken game.",
            "review_score": "-1"
        },
        {
            "review_text": "Fantastic game. That's all.  Super excited about their next 'secret' project - a new TB strategy game. Give it to me now!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you like a very hard game and lots of challenge by all means buy it. I found it way too hard, even the first map was undoable for me so I don't even want to know about the rest of the game. I finished 2 of the 3 previous games and only the last stage of AOW2 shadow magic was so extremely hard",
            "review_score": "-1"
        },
        {
            "review_text": "It has Dwarves :ss13axe::TalismanDwarf::cs_axe:",
            "review_score": "1"
        },
        {
            "review_text": "I just can not put into words how badly this game plays. I seriously wish i could return it but since I tend to buy games and then take time to get around to trying them I'm outside of the very short 2 week window, and the tutorial is longer than 2 hours and it takes that long to get a feel for the game. Sadly it's another bad fantasy turn based strategy game. There is little to no explaination in the campaign - i wouldn't call it a tutorial even if that word pops up when you start. It really is a throw you too the wolves style intro. Thing happen that the game just doesn't explain why it's happening or how to try and stop it. The game has potential but for anyone new to the genre they are left hanging out to dry and will get slaughtered and have little to no idea as to WHY they were being so easily killed.",
            "review_score": "-1"
        },
        {
            "review_text": "When the game works it's nothing short of amazing... when it works that is. I've lost 3 large map campaigns hours in, due to some mysterious crash. Even when I'm lucky enough to save a game a few turns before a crash I still can't seem to prevent it.  Shame on you AoW...  If it worked I'd give it two thumbs up.",
            "review_score": "-1"
        },
        {
            "review_text": "ask to creat accout and want your email",
            "review_score": "-1"
        },
        {
            "review_text": "Get Age of Wonders 1 instead. It's a superior game. You can't even make your own hero in this. This is just a dumbed-down, more limited, more annoying version of the first.",
            "review_score": "-1"
        },
        {
            "review_text": "the poor mans civ 5, its not bad but nothing special",
            "review_score": "-1"
        },
        {
            "review_text": "I would not recommend this game as it tries to be just like civilization with some uniqunees to it. This objective and principal weakened what made the great sound so amazing.",
            "review_score": "-1"
        },
        {
            "review_text": "Big long-time fan here of the Age of Wonder series. Still have them all. AOW1: awesome. runs on my old laptop so when I travel, nice to pull-up and play, map-editor rocked. AOW2: worst of the series, story stucked, mechanics sucked, bugs, glitches, clunky, weak, lame. AOW: Shadow Magic: Best of the series, stand-alone expansion, basically, super-fixed all the problems with AOW2s very well and a total classic. Map Editor rocks the house.  AOW3. The New One. With other series pushing ahead with the fantasy/4x-style games, it made sense for Triumph to go back and make a sequel. Immedicate CON: total lack of story, not cutscenes, totally DOA in this department but the gameplay itself more than makes up for this. It's more going towards a 'Civilization' 4X style of gameplay, like AOW:SM introduced to the series. NO PROBLEM WITH THAT!!!!  Sadly gone are the 'Wizard Towers' and the treasure trove of spells to troll any invaders into your domain. Gladly gone are roaming independent/allied units that take over parts of your domain without any resistence. Gladly gone are the over-powered doman spells that royally pwn any army that accidently enters your demain under peaceful circumstances.  Like the prior games, they push the graphics envelope a bit. However, this game does so most unfairly. Let me explain: This game runs like crap on newer systems even. It turns my CPU into a hamster wheel with Hamster-Cyborg 3000 running on it. What the hell. No time to optimize? The graphics are NOT EVEN THAT GREAT, they look about 5 years behind the times AT LEAST and this crap can chug at times. Solution: turn everything down, still looks okay, but so very disappointing. Lazy programming? Who knows.   Gameplay, if you liked AOW:SM, the the exception of the loss of wizard towers and a few minor things, you will feel right at home. Improved style of tactical combat mode looks great, it is nice. I hated AOW2 and AOW:SM removed all the blood/minute gore of AOW1. Same crap here, it's homogenized for you and your 5 kids in your nuclear family. I suppose that was to appeal to the kids who like The Hobbit and LOTR because there are art decision that seemed inspired by those movies, in my opinion. A bit too much in fact.  On that note, it seems about half of the races in the prior AOW:SM are totally gone. No more nomads, or Archons (they are Undead now) but the 'Undead' race is fully gone, so are the Shadow and those other guys that like the Shadows guys, no Dark Elves or offshoots, it all feels rather sucky now.  I KNOW, probably because at some point they plan to go the DLC route and play those stupid tricks/games with their fanbase. Time will tell, eh? Whether that's the case or not: BRING BACK THE OTHER FAAUKKING RACES PLZ!  So overall, it feels like a graphically amplied, but stripped down version of AOW:SM. It makes improvements, here, there, and overall I recommend it. It is a trusted, trial'd, true fantasy strategy game, with 4X elements because you can build new cities and grow them CIV-style. My complaints are not that big in the grand scheme of this game. I wish there was more options, more choices, and the engine was optimized which I think is far given the aging graphics. There is more to like than to not like, and to list what I like would make this 2 pages more.   Last note, it's a 'complicated' game like CIV 4, so don't expect detailed diplomacy AT ALL or too much detail in anything. It is rather simple on many levels but can be very rewarding and dynamic in its own right.    ",
            "review_score": "1"
        },
        {
            "review_text": "Game crashes making it impossible to play. very dissapointing",
            "review_score": "-1"
        },
        {
            "review_text": "Not bad, except the same old, can only play with these guys dlc ballocks!!!  All races where free in the original AOW, ♥♥♥♥♥♥♥ DLC",
            "review_score": "1"
        },
        {
            "review_text": "Age of Blunders  Like the other reviewers have pointed out, you need to rush to tier 4 units! The combat is very basic, you never miss, very short ranges and you get less units then AoE 1 and 2. I really think the developers were going for a faster MP style game play. That explains the rush feel, however this is terrible for the single player and does not feel like you have time to explore. The enemy spawns in areas that you knew you cleared out and there is no path for them. If you leave one of your cities empty it will get taken over without a fight. Walls are useless now because most units have wall climbing. This game is frustrating not because it’s hard but because the rush feel and the cheap spawning city attacks. The graphics are just ok, but some units are hard to see against the background as well as some of the places to visit.    Over all I’m disappointed",
            "review_score": "-1"
        },
        {
            "review_text": "combat is too slow.",
            "review_score": "-1"
        },
        {
            "review_text": "Expected Civilization, got Shitilization.",
            "review_score": "-1"
        },
        {
            "review_text": "Game lets you create a tyrannical waifu. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a game where you watch other people play the game, even when you're technically in the game with them. You don't move units, you don't choose what happens: you watch. This is repeated until you are eventually in a combat, then everybody else watches you! Even if you forego this option, your units might be screwed from manual combat because the AI in this game is atrocious.   I would not recommend this game to anybody.",
            "review_score": "-1"
        },
        {
            "review_text": "The game runs fine but once i start doing good it crashed my computer after making my third town. Maybe they will fix it I don't know but i think im going to stop playing this b4 it breaks my good computer... The gameplay was fun and the customization was Great! So ill just leave this game till next year maybe, maybe it will play then.",
            "review_score": "-1"
        },
        {
            "review_text": "Had somewhat high hopes for this game, and I was quite dissapointed. Very basic, unexciting city building provides a poor man's version of a poor man's version of Civilization V. Units have movement far greater than their line of sight, meaning you regularly lose armies to ambush as you literally cannot see them coming and are not allowed to retreat. Very annoying. I honestly haven't finished a single game yet because it keeps ♥♥♥♥♥♥♥ me off too much to continue playing.  I guess it's fun if you like games that ♥♥♥♥ you off.",
            "review_score": "-1"
        },
        {
            "review_text": "Decent game a little aged though.",
            "review_score": "1"
        },
        {
            "review_text": "It seems like a bad heroes game, i can't recommend this to anyone",
            "review_score": "-1"
        },
        {
            "review_text": "just downloaded the game, as soo as it goes to load a map the game shuts down, is this a common problem?",
            "review_score": "-1"
        },
        {
            "review_text": "DRM WARNING. Never even played the game.",
            "review_score": "-1"
        },
        {
            "review_text": "I just cant force myself to play this game. After hundreds of hours playing HOMM and Civilization this is unreally boring game.",
            "review_score": "-1"
        },
        {
            "review_text": "Serious problem with this game. It says I need to disable 3 mods. One is for middle earth, for example. I have NO mods imnstalled. I cannot play the game. It all worked fine earlier today.  What the heck is going on????",
            "review_score": "-1"
        },
        {
            "review_text": "This game would probably ok... If it didnt crash on me every time I quit or Alt-Tab it. Fix this game!",
            "review_score": "-1"
        },
        {
            "review_text": "I relly wanted to like this game but i cant play it i tear my hair out every time dont buy this game buy civ 5 or endless legend",
            "review_score": "-1"
        },
        {
            "review_text": "Requires you to port forward in order to host a game. Game that can be played by a ♥♥♥♥ing email requires you to twiddle with your connection just to be deemed worthy of hosting 2 players game. ♥♥♥♥ it and everything it stands for.",
            "review_score": "-1"
        },
        {
            "review_text": "crappy game no instruction no idea how to get move points no help would love to return game will never play. Don't bother with it. YUCK!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sorry guys, I tried to like this game, but it wouldn't let me play it the way I wanted to. (w/ friends)  Probably the worst mp release for a game I've ever personally experienced.   Besides that, the game is well optimised, and it's a blast. But I rarely play games in sp if they have a mp feature.   These developers need to really sit down and look at their service, and try to come up with something better.  OUR ROUTERS are not the problem.",
            "review_score": "-1"
        },
        {
            "review_text": "Dear all.  I have wasted 35 pounds at AOW3. Poor graphics, poor user interface. Not woth it.   Go for AOW or AOW2 Shadows of Magic.  Regards. ",
            "review_score": "-1"
        },
        {
            "review_text": "really great game",
            "review_score": "1"
        },
        {
            "review_text": "fun, love it, so much to do",
            "review_score": "1"
        },
        {
            "review_text": "Age of Wonders III is pretty good, city building of civilization with the combat from heroes of might and magic games",
            "review_score": "1"
        },
        {
            "review_text": "Solid game with the charme of a Heroes of Might and Magic mixed in with Civilization. City Management is not that great though, but the combat is very interisting. Can recommend this game overall, 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy games like Civ V but are looking for something a bit different then Age of Wonders III is definitely worth considering. Imagine if you blended Civ V with Diablo III and a little bit of World of Warcraft, Age of Wonders III is what you might end up with. There is a bit of a learning curve at the start of the game which may or may not frustrate some gamers but if you're patient and you play through a few of the campaigns then you'll soon find yourself in all out fantastical battle and conquest. Good hunting.",
            "review_score": "1"
        },
        {
            "review_text": "Nice fantasy based stratagy game. Once you get into the later part of the game, it's very easy to become crazy OP, which can be fun but doesn't provide much of a challange. Combat system can be quite frustrating but with practice it is very rewarding.  No real tutorial makes the initial learning curve pretty high.  Overal 7/10",
            "review_score": "1"
        },
        {
            "review_text": "An amazing turn based strategy. It most closely compares to Heroes of Might an Magic, but it ups the ante significantly from a fantasy chess like experience to a warlike experience. This game is a massive update from the original 3 Age of Wonders games. All 3 previous were great, and I played them all for hundreds of hours. This game takes the best of the originals, speeds up the game engine, adds 3D and stunning graphics, and grants you multiplayer that is smooth, and sophisticated.  The game gives you the opportunity to show off your abilities with strategy in war. For example if you rely soley on numbers of troops and go to war letting the computer do autocombat for you, then combat is a straight forward process of math with a minor amount of random probability assisting the outcome. However, as is true in real life, if you take control of combat, position your troops well, and take both advantage of your troops strengths while playing on your enemies weaknesses then a very small set of troops can successfully take out a superior force.  This game has a lot of replayability. Check it out!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, updates have fixed several issues with combat focus only for victory. This game is still more focused on combat than nodes than the previous versions, but my last game I finally ran out of mana for my spells. First time that has happened to me since I started playing this game months ago, and I always play as a sorc. I have over 250 hours in this game, regardless of what steam might display.",
            "review_score": "1"
        },
        {
            "review_text": "A worthy sequel for fans of Shadow Magic that is still one of my favorite games in the turn-based fantasy genre. However, it would not hurt having more races, objects and more varied locations and quests. The game is most fun in the exploration stage, early on to then feel a little repetitive later in the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game combines the fun of RPGs, empire builders, and Tactical combat in a TBS.  Winning a single map can take a long time, and they usually require you play aggressively, but despite the fact that I tend to prefer to build slowly and then attack with overwhelming force (which generally fails against the AI, who will often hit with their own overwhelming force first if you pursue that strategy), I still enjoy this game a lot. Sending your heroes around the map looting as many dungeons as possible while building epic cities is a lot of fun.  (I also enjoyed AoW 1 &amp; 2 back in the day.)",
            "review_score": "1"
        },
        {
            "review_text": "Would recommend this game to anyone. Takes elements from Civ 5 but with less emphasis on empire and city management and more emphasis on combat. The turn based combat system is done very well. 9.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Best fantasy TBS. RIP heroes and disciples for me.",
            "review_score": "1"
        },
        {
            "review_text": "Im so sorry for my life...buy this game = lose my life   make u want to play it over and over",
            "review_score": "1"
        },
        {
            "review_text": "Age of Wonders. What can you say. Great game overall. Interesting and long campaign. Interesting combat. Interesting management a la Civ. It's good. It COULD do with more unit variety though, since quite a few of the basic units seem to be shared between races. Also has 2 expansions out, which I haven't checked out yet...*sigh* So little time.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, would definitely recommend. Playing against the AI is okay, even on the hardest difficulty, isn't very hard, however this is the type of game that improves infinitely when you play vs. humans. Huge strategic scope and immersive gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Heroes of Might and Magic growing up you'll like this game",
            "review_score": "1"
        },
        {
            "review_text": "For someone who misses the original HoMM dearly, this wonderful little gem was truly a treat! Way too underrated by the gaming community IMHO. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Civ, Warcraft 3, and tactical RPGs, you'll like this. You'll like it even more if you like D&amp;D, as the world is very much in the style of classic D&amp;D fantasy.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Eats Heroes of Might and Magic for breakfast because of much better combat mechanics.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely good fantasy turn-based 4X strategy game that focuses on combat and empire building. AoW3 does a lot right and is extremely well optimized. There's plenty of prebuilt scenarios to play out, a very good random map generator, and some massive campaigns to enjoy. The DLC expansions also add more than enough to make them worth it.   Would definitely recommend to anyone who was a fan of the original or likes to play turn based strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic 4x strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly decent game",
            "review_score": "1"
        },
        {
            "review_text": "Best turn based strategy game I have played in years! If you are into fantasy themed strategy games this should be a must have!",
            "review_score": "1"
        },
        {
            "review_text": "this game is a lot like Might and Magic, slower paced, but with a lot more options. If you like turn based games I would recommend this game for sure.",
            "review_score": "1"
        },
        {
            "review_text": "Back to the roots! Very good game. (Played all games of the series.) Great soundtrack with some remixed themes from the first AoW (Could have been more in my opinion). But I'm missing some classic units of the series like the Orc Warlord with it's typical sweeping blow. The unit diversity and the usually 12 different races had to move for a better balancing I presume. The new Dreadnought machine fraction means a good contrast to the 'fantasy' nature side.",
            "review_score": "1"
        },
        {
            "review_text": "This wonderfully complex strategygame is a combination of civilization and Heroes of might and magic. Would buy agian.",
            "review_score": "1"
        },
        {
            "review_text": "Finaly, a true successor to Master of Magic. The first two age of wonders were not that good compared to this one!",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, easy interface and commands. I definitely recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Simply amazing!!!!  AOW3 is best strategy for now - it have evrything to make a hardcore strategist happy: - random maps - customizable leaders - huge amount of spels and units to play - it work flawless - not need to wait at all - superb graphics - superb music maybe will have a tablet version.... ",
            "review_score": "1"
        },
        {
            "review_text": "Tryed it and compared to similar games like FE:LH and Endless Legends it's just not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "The hidden gem of this year. I've always wanted to like civ 5 but it's too slow and the fighting takes forever and isn't satisfying at all. In Civ I just steam roll other cities once i get siege weapons and it becomes monotonous. AOW3 is the perfect love child of civ and xcom where awkward eye contact was made with battle for middle earth. It takes a streamlined empire building approach so you can make massive armies and then engage in awesome epic turn based battles. It also is fantasy with different classes and heroes who level up. The sense of exploration is unmatched in any other strategy game. Hey there's an unexplored tomb go send your army into it. HOLY ♥♥♥♥ EPIC WYVERNS. If you beat them your hero gains some cool new gear. I can't reccomend this game highly enough. It's the strategy game I've always wanted. Apparently there's multiplayer but who needs it.",
            "review_score": "1"
        },
        {
            "review_text": "Spawned next to Dragons. Dragons flew, burnt my city and began the lamentations of my women. When I tried to take it back I realised I lacked the units to destroy MY OWN WALLS. So Mr. Dragon sat on them laughing his ♥♥♥♥ off.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "After waiting for years for the sequel to Age of wonders I, II and Shadow Magic, this game certainly doesn't disappoint me in any way. The upgrade to the graphics is magnificent, the gameplay has been tweaked and made easier. Only play this game tough if you like a lot and then I really mean A LOT of new possibilities and options within the gameplay. It may take some time to get the hang of everything in the game, but it is totally worth it!",
            "review_score": "1"
        },
        {
            "review_text": "A great successor to the original AoW games...and after so many years! When I first heard that the game was going into production, and that the same ORIGINAL TEAM, plus new additions, were working on it...my mind was blown.This, I thought, is fan service done right. And I was not disappointed. The AoW franchise has always been a cult classic in the SRPG genre; hell, they helped CREATE the genre, and with AoW3, they show that they still have the magic. The game itself is beautiful, especially the battlegrounds, the voice acting is superb, combat is deep and highly strategic, and the hero customization is great. This is a fantastic game in every way",
            "review_score": "1"
        },
        {
            "review_text": "I don't normally write reviews but I feel like for this game I just have to.  This game is so good, im not a hardcore 4x strategy fan but this game just has me hooked, I have played Heroes of Might &amp; Magic 5 which is a similar game and didn't really find that game fun so I wasn't too sure about getting Age of Wonders 3, however im glad I got it anyway. This is in my opinion one of the best strategy games out there!  This game is a must buy!",
            "review_score": "1"
        },
        {
            "review_text": "Definitely worth it. It's an awesome, unique combo of Civilization style management, and Dungeons and Dragons style combat, and heroes.  The diplomacy doesn't really have many options, but other than that, it's fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Age of Wonders is hands down my favorite 4X strategy series.  Was an insta-buy for me to get the title on steam. I would describe the series as a fantasy-civilization type game, hexagon based but less focused on resource tiles - AoW 3 does incorporate the resource based tiles significantly more. The combat is where this game really shines. If you'd like to see it at its best take a look at TB's WTF is review of Age of Wonders 3 ... 'I am absolutely engrossed in the Single Player right now, the enemy AI is actually very savvy' 'Its everything I personally wanted in a Fantasy 4x that is very much focused on combat, it does that very, very well and thats fantastic' 'Its brilliant, absolutely fantastic, and I couldn't recommend it more'  You won't be dissapointed.",
            "review_score": "1"
        },
        {
            "review_text": "This game has tons and tons of replay value just from the random senario mode which is all I've played since buying the game upon release. It's also being constantly updated and is well worth it's full price. Even more so if you happen to catch in on sale. With the ability to make custom senarios, maps, and characters, there's a lot to make every game different. Lastly the thing I think is the greatest of all is the hotseat mode. I love playing this game with my girlfriend and she has a borderline addiction to it.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, it reminds me of the old Might and Magic!!! And that is saying it all :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic turn based fantasy strategy game very much in the spirit of Master of Magic. It doesn't have very deep city building or anything like that, in fact in a lot of ways the game is pretty simple. But the simple aspects of the game combines very well to create a rich and deep experience.  You never really feel overwhelmed or bogged down yet you also tend to always feel like you have important decisions to make even in the late game. It's a superb game by a developer that seems commited to supporting it with balance patches and new content down the road.",
            "review_score": "1"
        },
        {
            "review_text": "Magnificient strategy and exploration. Hadn't played AoW series before this game; this reminds me of HoMM 3 greatly. Definitely a great pick up for early HoMM fans.   First two campaigns from the vanilla are done now and going for the third, golden realms.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome Strategic RPG turn based game would recommend it to anyone that likes fantasy and 4X games.",
            "review_score": "1"
        },
        {
            "review_text": "Add Civilization to Heroes and you have Age of Wonders - a paradise for any strategist/tactician.",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun D&amp;D mixed with Civ. Kind of game that lets u Make your own Hero. also battle, build and travel land of fantasy. Battle in Dungeons, Clam loot and fight army to army battles Be it AI or Player. I love playing this game and I Recommend it to anyone who wants to play something little different.",
            "review_score": "1"
        },
        {
            "review_text": "The battles are a lot of fun and the world is like a less restrictive version of Civ. V where you can properly focus on conquest with a lite RPG aspect. AoW3 has the best DLC where price-content ratio is great. This game is very balanced and has one of the best story campaigns and storyline you'll ever come close to in a hex-grid strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "Such a great game, I don't spend much time these days playing video games, but when I do have the time, the first game that comes to my mind is this masterpiece. It's just a regular game for some people, but for me is just perfect!",
            "review_score": "1"
        },
        {
            "review_text": "First heard of this game on the co-optional podcast. Sat in my library for awhile and recently I finally installed it.   Oh man, it's been awhile since a game has stomped me once and gotten me to play again (no I haven't played darksouls). I am prety sure the AI cheats, but that has added to the enjoyment of the game. Each map so far has had a turning point, a rise or fall battle. The time I am beat pretty much meant I had to restart the map, the other times it signaled my opponents fall. Win or lose, I have really enjoyed those moments in the game.  My only real problem with the game is the fact its a time machine that only goes forward IE 'Start game at 4 pm and its magical 3am a short time later'",
            "review_score": "1"
        },
        {
            "review_text": "Wery well. Fully disclosed in the multiplayer.",
            "review_score": "1"
        },
        {
            "review_text": "I was excited to play this game, but I found it very annoying. Sometimes getting past the annoying parts of games can be very satisfying...for me it just stayed annoying. I found the UI to be choppy, and most parts of the gameplay less than fluid. Some may love it, but this one was definitely not for me.",
            "review_score": "-1"
        },
        {
            "review_text": "The great deal for those who like Strategy and RPG mixed turn-based games. If you like Heroes of Might and Magic, Disciples and other games like this, I think you'd like this game too!",
            "review_score": "1"
        },
        {
            "review_text": "In short, the best 4X around.  Deep, complex, it particularly shines with its tactical turn-based battles and unlike almost every other competitors the AI knows what it's doing and will provide a good challenge if that's what you're up for, otherwise of course you can tune it down for a smoother game experience.  Lots of replayability as you can combine many classes, races and specializations which also means a rather fine tunning of your setup along with the classical random map generator.",
            "review_score": "1"
        }
    ]
}