{
    "app_id": 226860,
    "name": "Galactic Civilizations III",
    "release_date": "2015-05-14",
    "developer": [
        "Stardock Entertainment"
    ],
    "publisher": [
        "Stardock Entertainment"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Online Co-op",
        "Steam Achievements",
        "Steam Trading Cards",
        "Steam Workshop",
        "Stats"
    ],
    "genres": [
        "Indie",
        "Strategy"
    ],
    "tags": [
        "Strategy",
        "Space",
        "Turn-Based Strategy"
    ],
    "achievements": 98,
    "positive_ratings": 6051,
    "negative_ratings": 1891,
    "price": 23.79,
    "description": "Build a civilization that will stand the test of time in the largest space-based strategy game ever! Choose from dozens of unique races and make a name for yourself across the galaxy through diplomacy, espionage, technological advances, and more.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/226860/header.jpg?t=1551108346",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: 64-bit Windows 10 / 8.x / 7 Processor: 1.8 GHz Intel Core 2 Duo / AMD K10 Dual-Core Memory: 4 GB RAM Graphics: 512 MB DirectX 10.1 Video Card (AMD Radeon HD5x00 Series  / Nvidia GeForce 500 Series / Intel HD 4000 or later) DirectX: Version 10 Network: Broadband Internet connection Storage: 12 GB available space Sound Card: DirectX Compatible Sound Card",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: 64-bit Windows 10 / 8.x / 7 Processor: 2.3 GHz Intel Core i5 Processor or Equivalent Memory: 6 GB RAM Graphics: 1 GB DirectX 10.1 Video Card DirectX: Version 10 Network: Broadband Internet connection Storage: 15 GB available space Sound Card: DirectX Compatible Sound Card",
    "reviews": [
        {
            "review_text": "I can not currently recommend this game for the full $50 price. Maybe later when the price drops or some patches come out to fix some things.   There is just some real irritating flaws in the game that when combined with the other problems drop the game down the the blah level. Most could be fixed easily. Two and five probably will never change which is what will keep this game not much above the blah level.  1. Capitals on a planet, The AI places them at random wherever it wants. Considering capitals give bonuses to surrounding buildings it makes a big difference on where it was placed. It seems to me that if I find an unsettled planet I should be able to choose the location of the capital. So because the AI chose a dumb spot for a capital you lose those bonuses because they go to waste. The best example would be if hexes were about the size of Australia and you were to colonize a planet with land masses like Earth, why would you place your capital in Australia and forfeit all bonuses?  2. No retreat option for combat. Similar games (Master of Orion and Endless Space) at least gave you the option to retreat during combat, meaning you could take some damage and/or losses but at least have a chance to run away. So later in game if the enemy is bigger and faster then you do not stand a chance of getting away. At that point you might as well concede the game. Simply because a fleet can attack as many times as it has movement points.  3. You can draw production in a shipyard from multiple planets over long distances to build colony ships, but somehow people just can not make that same trip. Yet these same people are going to climb into that ship you just built and travel ten times that same distance. So now you have to waste multiple turns just putting people into your colony ship.  4. Technology specialization. What was the point in this feature? The specialization technologies can traded and you can find the specialized in anomalies. Which if you receive a tech you have no made a choice, you lose that choice. So if you wanted to specialize in a certain bonus, but a friendly AI gives you a different specialization tech, then maybe next game, unless you get lucky and find another AI to trade for it. The fact that you lose your choice of specialization is extremely lame. Never mind how it can get exploited in multiplayer.  5. Battles are either 'quick result' or 'watch battle' meaning you have zero control on that battle. All of the battle tactics are based on what job tags you gave the ships in your fleet. Which means no singling out a target to kill first. The battles for the most part are not worth watching anyways because either option is going to give you the same outcome.   6. Construction ships and using the station option to call for one. Someone had a great idea to be able to have a space station go 'Hey I need a construction drone to build another module' and you click that button. Then a construction drone will be built and sent to that station. Sounds cool right? Real cool up to the point that this feature will clear any orders an existing drone currently has. So if you manually sent a drone to build a new station, it wont reach it. So that means you have to wait to use this feature until your manual drone is done. This feature will clear orders a drone already has, but will not clear guard or sentry, so makign them in advance and planning on using this feature does not work.  7. Excess research and production is lost. When the game calculates the end of a turn if it finishes building or researching something any points over that mark are NOT carried to the next project, the points are just gone. This just seems to make the game drag on and it also makes specialized manufacturing planets nearly pointless because so much can go to waste.  8. Ship designer spamming designs. Whenever you get new technologies the ship designer will spit out new ships designs, which later in the game leads to having way too many designs to sort through. Stardock solved this in previous versions and other games by adding a feature able to turn off the auto-designer. Considering that feature exists in multiple other Stardock games the feature should exist here.  9. Cultural expansion is ridiculous. It expands faster than you can explore early on. If you never explored it then how is your culture affecting it? About equal to the Roman Empire holding cultural sway over North America before they even knew it existed. The only way to catch up later is you disposable scouts with stacks of engines, lifesupport, and scanners which is about mid game. Since I have only played insane maps, then smaller maps probably run a higher chance of culture flipping.  10. Rush production is really flawed. If you rush a production in queue then no other production points are gained from that planet or shipyard for that turn. On top of that rushing production is a set amount, even if you have the production item almost complete.  11. The pirates are pointless. Four hundred turns in on a insane map size and I am discovering the same low tech pirates that were encounted in the first dozen turns. This makes them nothing but a nuisance, one that apparently the AI ignores. Not even sure if they attack the AI or not because the pirates will not attack anything stronger than them. So basically then end up as nothing but clutter to make your end turn processing longer.  These are the just the basic things I can think of that should have been ironed out during the beta.   Now for the technical aspects.  1. The sound for cut scene movies. Apparently someone forgot to include cut scene movie volume with the sound options in the game. So it just comes out as a bunch of mumbling.   2. End of turn processing on large map. This is really what kills the gaming mood. I made it up to around 400 turns on an insane map before it was just too ridiculous to play. The time to process became about 2-3 minutes a turn, which really sucks if the only thing you do on your turn is spend a few seconds to click next turn.  The other issue is every time the end turn process it kicks in all the fans in my computer into overdrive just to keep up with the processing. Meanwhile you can not touch much with getting the 'not responding error' from Windows. Which by the way if you are seeing that blue circle between turns, it aint a Stardock logo thing, that is Windows saying 'hey this program aint responding.' Which leads me to wonder if running the game is really good for the computer.  3. Ship designer, great feature (seriously.) One tip though, you might want to save your game before using it. Otherwise you could be sent back to your last autosave it decides to crash.   4. I received the achievement for the completing the first part of the campaign game simply by clicking to start it. Sounds petty and nitpicking, but think about it for a moment. That is really sloppy coding and testing. Where else in making the game were they sloppy? I think the first patch today fixed this along with a dozen other achievements, which basically proved my point.  5. After about 200 turns the text on the UI starts disappearing. Which is really annoying with diplomacy options.  I was one of those customers burned years ago by Stardock with Elemental: War of Magic. This release reeks of the same issues. The whole 'release it and patch it later' attitude. About the same effect as buying an early access game when they are on the .8x builds.   So in short, if you are on the fence on buying this, let me knock you off it. Wait and watch, in the mean time take a browse through the forums. Sure in six months of patch it might be a decent game, but news flash I doubt it will still be $50 price tag on it.  If you are mainly thinking about the game mainly because of the ship editor then do yourself a favor and go find a free 3d animation program like Blender and learn something in the process.",
            "review_score": "-1"
        },
        {
            "review_text": "As it is with all 4x titles that become great the first is always lacking. It should undoubtly get better with expansions however it will take time as it did with civilization 5.  Currently, I don't think its worth the full price but if it's on sale its worth it, party because it's the only 'next gen' true space 4x out there.  Pros -4x as you would expect it -multiple tech trees -custom races -awesome ship builder  Cons -you need a decent computer, and NEED 8GB of ram -Lacking in many mechanics  -no unit experience  -no government mechanic -descriptions are vague, finding detailed information is difficult",
            "review_score": "1"
        },
        {
            "review_text": "Not in love with this game at launch. It's not a bad game. It just isn't exceptional. Ship building is bugged currently. The game itself froze up on me a few times but after a fresh install seemed to run better. It still stutters at times, even on the small tutorial map. Combat is uninteresting. You have no capacity to command your units, not even to flee. So you send your guys in and hope for the best. Worse, the combat camera is fairly horrible and you spend a lot of the time listening to battles happening off screen. It's a bit chaotic.   I have read that diplomacy is a greatly improved in this game. If so I didn't see it. In the two games I have played so far my allies seemed fairly erratic, almost like a crazy person you find yourself dating after an online hook up. One minute they threatened to obliterate me for not following their doctrine. The next minute they are showering me with credits as though they feel badly about how they acted and are desperate for you not to leave them.   If there is colony management automation I couldn't find it. Managing your economy is a matter of moving a slider. Again, not bad. Just not interesting.   The Universe in the couple of games I have played seems fairly lifeless. At first black holes look really neat. But there are no civilian ships to be seen. No convoys. Besides some basic animation of a moon orbit or the odd comet it seems like you are looking at a stagnate game board. Again, not bad per say. Just not interesting.   Towards the end of the games I found myself clicking a lot to just shuffle through turns so I could finally get to the tipping point of overwhelming my enemy. This involved stripping his final system of defenders and then doing a sort of auto resolution troop invasion. Then a wall of exposition and a victory screen. It was around this point that I realized that finishing the game had been more work than actual fun.   There may be a solid core of a good game here that can be greatly improved upon with further patches and DLC. But for $10 more you can buy Distant Worlds Universe. With a bevy of mods that make it a living breathing universe. Or just play some Gal Civ 2. Or Sins of a Solar Empire. I do not recommend dumping $50 into Gal Civ 3 at present. It needs a lot of work.",
            "review_score": "-1"
        },
        {
            "review_text": "Do yourself a favor and get Gal Civ II. You will get more bang for your buck with a complete experience. Avoid this cash cow designed to milk the name of the franchise till it dries out. Releasing content that should be in the game, as overpriced DLCs.",
            "review_score": "-1"
        },
        {
            "review_text": "It looks beautiful. It is short so much content it is less than half the game gc 2 was. The content that is available is not even close to completeing it to what gc 2 is. The AI is poor. I was ranked as having less power than all my opponents and yet with 30 ships (3 fleets) i rick rolled all my competition. No balance in tech power to ship count. The the dlc released so far doesnt even fill in the missing races from gc2. This feels like stardock has taken on the EA marketing model. Better to wait a few years till the game is completed and sold at a lower price or wait till something better comes along.",
            "review_score": "-1"
        },
        {
            "review_text": "So apparently Galactic Civilizations 3 is trying to each me a lesson about life. I tried to play the good guy, not declaring war, only wiping out invasion fleets, then offering peace, if no peace, then I invade, if no peace, then I conquer, then I still offer peace. So after wiping out 1 race and having a 2nd make peace only after capturing their home world. So 11 hours into the game my ally decides to declare war on me. It makes a sneak attack on every system in my space, conquering some and just causing a super huge pain in my ♥♥♥♥ as my fleets were closer to my former enemy. I hit the retire button, lesson learned. EVIL is the only way win at life. Conquer all or be conquered. Peace is an illusion. God Send Death.",
            "review_score": "1"
        },
        {
            "review_text": "I'll preface this by saying I have purchased all of the GC games and like them all. The one thing that has become more obvious is the tendency towards releasing a very early, base game and using DLC to spice it up and make it seem more interesting. A 'Season Pass' is the standard it seems now....  This game, even after a year of being out and having been patched all the way up to v1.8, still has major bugs and memory leak issues. Any of the larger maps are not able to be played to completion due to memory issues and performance lag. The machine I have has 16gb of memory and still has issues. One bug (destroy a planet) has been in the support forums since early 2015 and still hasn't been addressed. The keyboard shortcuts and game documentation leave much to be desired. Not enough shortcuts and too much repetitive 'point/click' items.",
            "review_score": "-1"
        },
        {
            "review_text": "I really love this game but is it at all possible for you guys to fix the crashing? i mean sometimes i wait 5 minutes before realizing the game will never catch up i understand the game is massive and even more so depending on the size of the map but when a small sized game can last 24+ hours i expect to be able to sit and play for at least 2 hours before the game completely ♥♥♥♥♥ itself and crashes. Also it would be really nice if you guys were a lot more honest about the ram demand because if you have yet to purchase this game and you run with even 16 gb of ram the game cant wait to crash. This game is definately worth the purchase what little i can actually play before it crashes. The crashes have become even worse now with even more ♥♥♥♥ to populate the screen. Can we focus on one thing at a time i do not think we really needed mining facilities on the dead rocks but who the hell cares lets continue to add more and more ♥♥♥♥ so the game will never work unless your sporting 64gb of ram. I cannot at this time recommend purchasing this game for in its current state it is infact unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "As someone who is new to the series I was initially impressed with the game and I still am to some extent however there are rather griping issues that are bugging the hell out of me currently.  Ill try to list them:   1) the tutorial is not useful. Instead of it being about teaching new players or existing players about new or old mechanics and how they work and how your colonies work with production, manufacturing etc. it is instead used as a story spring board ready for the campaign.. which I really do feel like it should be for teaching as you know it is supposed to be a tutorial, Of course it has information on how things work but doesnt accurately explain it, in other words its extremely vague.  2) Lack of audio communication from Characters. When talking to another race for example, or something your research scientist is telling you about your recent upgrades. I really do feel like if they added some decent voice overs it would bring a ton of depth to the game. I realise many of the old school GC players would not like this that much is clear from what ive read on forum posts concerning this however its a different time now and you need to expect that immersion is important and right now Voice Acting even a little goes a long way, nobody wants to sit their and read paragraphs upon paragraphs while playing. Adding voice acting + a on/off option would solve this anyway. I believe the campaign would benefit heavily from some voice acting immersion. instead of 'oh look we're retaking earth lets click our way to victory yay'. I have a fine imagination I can imagine voices for the characters but it really doesnt do them justice. in a game this big and this well known they deserve a bit more 'soul' i guess would be the correct word.  3) Clarity concerning modifications to your ships and fleet 'military research'. While most of the research details you go through are fairly solid and easy to understand, things like ship hulls and shield strength and how much it actually adds on to your ships current shield or hull strength isnt carried over and communicated properly making things seem tedious and confusing as if your research something for no reason because you dont understand where it goes or what it does fully. Examples would help this or fix it. I appreciate the lack of hand holding in the game, but again for games to be popular in the current industry they need to accomidate new players not just the old ones. Which is why many feel that the game has not innovated on what had come previously.  4) Governance is ...outdated. Frankly with competition like Civ and others in the mix Governance is an expceptionally dull part of an otherwise enjoyable game. I personally think if they wish to rival Sid's civ games then they really should of though about going a step further than they have or maybe a few steps. Instead of giving a player a set ammount of tiles you should of been able to zoom in and actually build upon the planet you found place your city yourself and the various things you need to get production and influence going etc and by that I mean actually control workers to do thats etc and have way more than simply under 10 or 20 tiles per planet or even under 5. I realise that many will use the arguement of 'but its not trying to compete with it' or whatever however companies no longer have a choice these days unless they want to make money and frankly the changes ive suggested are hardly anything that would harm your experience if anything it would improve it. What had so much potential seems squandered.  5) Space battles. When launching real time battles between fleets its abundantly obvious that the battle viewer is extremely underdone, ships consistantly fly out of view..the free cam movement is extremely redundant as moving seems almost a chore rather than something you can enjoy as you watch your fleet tear the enemy apart, its clear that this needs to be dealt with and frankly if it isnt, it will be something that ruins the game.  Conclusion:  A game with enormous potential but fell short of it due to being stuck in the past, the graphics are updated and its new enough not to be called a 'reskin' based on what ive watched from other videos of GC II HOWEVER this game is stuck in its own past. Instead of innovating they simply stayed still all be it with a few side steps on a couple of things which I personally think is what destroyed my opinion of this game. Now its still possible a lot of the things ive mentioned will be changed or fixed so I will give this game a little more time but this game is far from what stardock hope to achieve which apparently is 'The largest, most advanced, strategy game possible.  Verdict?   Not recommended, especially at £30. As I have said while I largely enjoyed this game It frankly just did not hit the marks it needs too in this current day and age, Im glad a game is trying to stick to its roots but if a series is to improve itself it must go forward and not be stuck in the past, I will continue to play this game and try a bit harder to enjoy it though frankly if it was a decent game for the era I would already enjoy it thus I wouldnt have to try.   What is starteling is im finding im enjoying Beyond Earth more than this and thats for one reason:   Depth. Now I know what your thinking 'Beyond Earth, Depth? Don't make me laugh' but frankly its true if theres one good thing you can say about that alpha centauri mess up is that at least they tried to make the game at least seem like its got a bit of soul. While GC III does a great job of making the galaxy look beautiful (to an extent) and letting you decide what you want your civilization to be it losing out massively on the things ive listed perhaps bar number one as a tutorial shouldnt be the focus of a whole game. Until they add voices and more depth and explainations as to how things work in game by providing an in-game source and fixing the various new features to actually work properly I cannot actually immerse myself in this game not can I call it a good game beyond a simple 'meh its okay'. if you prefer the silent type and unnessasarily complex mechanics in games then this game is for you if you prefer much more immersion and a bit more ease so you can just have fun without having too feel like your reading a book rather than playing a game I would advise you not buy this until that changes. it is stuck in the past and frankly its sad, it has so much potential but falls quiet short of a great game in my opinion.  Clearly Stardock have put a great deal of effort into the game but they got too focused on 'sticking to the roots', you can stick to your roots and still evolve your game, however it seems they had no idea how to beyond improving a few small things and improving the graphics thats about it.",
            "review_score": "-1"
        },
        {
            "review_text": "I have purchased every Gal Civ title and expansion since the original. Overall it is an excellent 4x with tons of customization; you can create your own race/faction, ships, logos etc. The game plays as smooth as silk and has a very active community. I HIGHLY recommend this game!  I give it 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a lot to offer.     The ship designer is fantastic; I've had hours of fun with the this feature alone - will kinda depend on if you enjoy being creative with that    The modding opportunities are really appealing - I've never made a mod before, but for this game I'm working on one    Setting up your empire feels way more involved than in previous games, with placement of buildings and exploitation of local resources really making a big difference on each colony, and for each Starbase    The different AI personalities and priorities are interesting, I've made a number of custom factions and watched them interact with the rest of the game's stable of character in interesting ways.    It's really rather pretty. Tying in to the great ship-designer, watching your personally designed ships cut their way through your enemies looks and feels incredibly satisfying.   I don't see myself getting tired of this game any time soon.",
            "review_score": "1"
        },
        {
            "review_text": "My opinion after 16 hours of playing GCIII - game mechanics are almost identical to GCII, and the whole thing feels like a graphic remake of its predecessor, but it also feels incomplete. Here are few problems:  Beginning with Interface menus that do not offer even a half of the options you had before to customize your experience during gameplay. Resource icons for example make a mess out of the map when zoomed out, making it really hard to observe the gameplay. I haven't found any options to address this.   Taxing system for your colonies is removed and only way to manage your economical income is through single wealth/manufacturing/research slider. I don't yet have a definitive opinion on this, but for now this new income system feels little vague.   The hype about incredible AI that utilizes each core of your expensive i7 to provide you the best and most complex GalCiv experience is just hype. Reality is that for 16 hours of gameplay I haven't noticed any singe improvement compared to GalCIv II. The opponents react exactly the same in same situations, making same diplomatic propositions, and making same strategic mistakes as before (small example: just leave barely habitable class 5 planet next to your starting homeworld and AI rush to take it, spending a colony ship and bunch of money for improvements, just to loose the planet after few turns due to overwhelming influence of your nearby homeworld).  Spying is completely missing leaving you to guess what your opponents are doing, researching or building on their home planets. I read somewhere that developers plan to program 'deeper' spying system than before, so they left it completely out. Really? Releasing a full-priced game without a crucial feature that existed in its predecessor, with a promise that it will be included in eventual DLCs that you have to pay for additionally?  Why developer haven't taken more time to finish their ideas and then release the full version, or at least implement the old style feature and then improve it later?  Speaking to another civilization should lead to trading screen right away (99% of the time this is where player wants to go), rather than opening a pointless splash screen. It is eye candy, but it is very inconvenient as you have to click twice. Furthermore, 'trade with you', and 'declare war on you' are two choices just next to each other making it a miss-click accident waiting to happen.   There are more smaller and bigger issues to remark and I will edit this interview if I find more or if I change my opinion on it, but in its current state this release is not worth the money as it offers less than GalCiv II.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is great, been playing it for around 18 hours or so. It reminds me of the previous installment. The thing i like the most so far is you can have much larger universes now when playing. The largest map size is called insane. I always played custom games on the previous version on the largest map possible with max civs too. I love playing a grand, long game that takes forever to finish. I really can't say there is much i do not like about the game except that it does not come with a wide variety of pre-made factions but you can create all the custom factions you want to have more opponents if you wish. It's just all the good things i liked about the previous installment on a grander scale. More and bigger is better imo. Keep up the good work. I am looking forward to expansions that add more races and possibly more tech trees, or custom tech trees would be cool. The more techs and variety the better and more interesting the game will be. I guess the biggest weakness at the moment even though it's not a big deal, is the game needs more variety.  All and all 8/10 score.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastically deep 4X game. I can't comment on how similar this is to GalCiv 2 since I haven't played it, though. I really like the non-combat victory options, they are very well fleshed out which makes them very satisfying. I've been playing with a friend too and that's been enjoyable as well.",
            "review_score": "1"
        },
        {
            "review_text": "Qualified recommendation. If you have GC II I recommend waiting until they 'finish' III. It still misses some key features such as governors, and espionage.",
            "review_score": "1"
        },
        {
            "review_text": "A nice upgrade but graphics are very poor, especially on the galaxy map view (the main view) where there's way too much bright blue and purple that distracts you from any sense that you're looking at a galaxy instead of what looks like an old fashioned arcade game. So games like Civ5 and other more recent 4x games are far far more pleasing to look at.   As far as gameplay, it's very well done except, with the distances so large, and the ships movement so teeny tiny, it takes forever to get a ship or fighter or whatever, from point a to point b. I mean, each ship can only move about 2 hexs during the first 10 hours or so of gameplay before more research is done. Considering that typical planet is 20 hexes from the next nearest point, that's totally insane and feels really like you're in slow motion. That's about my only complaint.  It's too bad the graphics are so weird on the big map. They ARE useful and tell you what you need, but unfortunately are totally disgusting to look at.",
            "review_score": "1"
        },
        {
            "review_text": "While I miss the lovely battle scenes of the second game, Galagtic Civ III definitely ramped up the gameplay with new ship modules, more stuff to place into a custom race, and the United Planets aspect of things. I have nothing to say on the multiplayer, though. Haven't tried it.",
            "review_score": "1"
        },
        {
            "review_text": "Still has a few bugs...one bug that ruins the game is that for some reason, the mouse/cursor gets locked in perpetual 'hug the right side of the map'. Can't do much when confined to the edge of the Galaxy. Another bug is that the AWSD cursor control does not work. So...if the interface does not work, how can one navigate and enjoy the game? Wait for the Beta Testing to be completed and buy the game when it is on sale. (I'm not looking forward to someone commenting, 'oh, to get around those bugs do this, this and this.' Nope. I just want the game to work. )",
            "review_score": "-1"
        },
        {
            "review_text": "Do you have good enough friends to waste several months in one multiplayer match with?  Then it's your lucky day, since best spreadsheet space emperor simulator finally got multiplayer! There's a chance that you will need all computer power in the world to calculate AI turns if you're playing on biggest map option several days in, but space emperors must be patient, for there's whole hexagonal galaxy to explore! Full of intelligent lumps of Christmas lights and bloodthirsty Space Squirrels, of course. Just keep an eye over your survey ship, if it's brave captain decides to SURVEY A MOTHERFLIPPING WORMHOLE, it will take years for this ship to get back, their families will be long dead by that time and, most importantly, you will play through early game without anomaly bonuses.  Ever had a feeling that you will only play ONE MORE TURN before going to sleep? And then you realize you grew a beard and missed your daughter's funeral? That's exactly what's gonna happen if you get too sloppy! In Galactic Civilizations 2 i played until there would be either too much fleets to control every turn without overloading my brain or until i run out of RAM and won't be able to save anymore. It may be VERY specific kind of fun for VERY special  autists  players, but it's basically like Pringle's: you'll eat all of them even if you have whole warehouse full of these lumps of cancer.  There's traditionally not much fun in war and invasion, mainly because instead of controlling ships directly (god, i miss hijacking Antares ships in Orion 2 so much) we're getting pew-pew-laserbeams-sound-in-space-flying-bricks viewer, and so far it seems to miss really fun mathematics Endless Space had in that field (meaning a solid bunch of ship builds and fleet combinations to play around in multiplayer), but even if war mechanics aren't really top notch, AI in this game, that is probably much smarter than general public of this greenish-blue ball we live on, won't let you get bored.  One of the trademarks of Galactic Civilizations series is that AI is a DIIIIIIIIIIIIIIIIIIIIIIIIICK. On high enough difficulties they will try to turn absolutely any situation to their advantage. In previous game you could've spend weeks to annihilate powerful enemy which will later surrender to even more powerful enemy, giving them all their remaining worlds just to troll you (you can, of course, abuse savescam if it made you mad enough). Or long term ally will gradually build colonies around you to protect you from common enemy, and then they will ally to crush you because you had too much ascension crystals. On top difficulties you basically have no choice than abuse known loops in game mechanics to win. It will take time to understand how the whole deal works in long multiplayer matches, game after game of course, but it seems that there's not much diversity of playstyles to exist, even with multiple victory conditions.  Overall improvements in planetary and empire management seems to be really solid, but adding connection bonuses to buildings without option to choose initial colony building seems strange. I can't also find tax slider anywhere. Well, Stardock promised to polish things and add stuff even after release, so they will probably tweak minor gameplay inconsistencies.  I personally liked shipyards in space VERY MUCH.  I still didn't fully dig enough into all mechanics and, frankly, didn't reach actual lategame there, which always turns into hell incarnate at some point, but so far, i give this game 50 000 shades of infrared out of 50 000.  I miss helicopter jokes from old science robot tho.",
            "review_score": "1"
        },
        {
            "review_text": "Bugs, and not the good kind. Locked up when two attacking transports hit a heavily defended planet. They had 0% chance of success, but the game locked waiting for the other player. Needs patching.",
            "review_score": "-1"
        },
        {
            "review_text": "I got GC III on the summer sale and so far it was really great. There's plenty of possibilities and I discover new aspects and strategies with every game I start. Here's some of the more interesting aspects about the game:  Look at me - I'm a space race: You get to choose a civilization and go develop, expand, explore and conquer. Alternatively you can create your own species, which is a load of fun: Choose strenghts and weaknesses, splash screens and your leader's avatar, the look of your ships, the tech tree and some more things. I created Space Horses. Ahahahaha, their leader is actually a horse in a space suit. Anyway.  Many a way to victory: The game comes with 6 ways to win the game: You can conquer all other races, you can bring 3/4 of the galaxy under your cultural influence, you can win by negotiating alliances with all other races - and there's still a couple more ways! That said, the easiest way to win is with war. The other ways take a rather long time, so expanding through warfare is the only way that feels like you're making progress.   Diplomacy: What I really like is the possibility to trade technologies with other races. What I don't like is the limited influence you have of the diplomatic doings in the galaxy: Your allies will wage war against one another and you have no means at your disposal to stop them from doing that. Also it would have been nice if your allies automatically joined your side whenever an outside race declares war on you. Then what are alliances for anyway?  Pimp my fleet: The possibilities for outfitting your fleet are endless. The arms and countermeasures follow a traditional rock-paper-scissors-scheme. But there are plenty more things you can stuff in a space ship hull: warfare tools, fleet range enhancers, repare modules, exploration modules...but there's more to the fleet editor! You can select your races ship hulls from a range of sets. But when designing a ship, you can model that ship almost freely, scale and rotate parts and so give every ship type a unique look of its own. If you are patient, this is an awesome tool that adds a lot of player individuality to the colourful world of GC III.  One quick word about the workshop races:  You can upload your race to the steam workshop of GC III for others to download. That is really cool and I addded a lot of workshop races to my game to make games with up to 36 (!) factions more interesting. Some people delivered some really cool races.  Sadly, many players felt it necessary to add bewbs content. Dudes, you have the entire internet to your disposal and is densely plastered with pictures of bewbs! There's absolutely no need to add any to a steam workshop, so please please please keep that to yourself!  All in all: Try this game, it's awesome! Also, bring some time with you, GC is not a game you play for just 10 minutes.",
            "review_score": "1"
        },
        {
            "review_text": "So far GCIII is GCII on steriods. It took 472 turns in an imense, spiral galaxy to win an ascension victroy in easy mode. The game froze up a couple times, I was either away from the game too long, or it's my videocard. I had no battles, so I never used that side of the game. Occassionally a starbase would not show the ships to be built, but built them just the same. World builting mechanics work fine. Tedious. My kind of game. :) .bwj...  26jul15.. Still play some everyday. Been playing GC since beta GCII ! It's a solitaire for me. The first 150 turns move pretty fast, then there's a little slowdown as you give the game more to think about. I play normal mode and ally with a race. Win some, lose some. It takes awhile to play each game, Embarassing, but I've spent 12hrs straight on a game. I've been playing video games since the dawn of PC's, this is my best, all time favorite. Thanks GC team, at least one person on the planet is thouroghly enjoying your work! (ps: I also have a life!)",
            "review_score": "1"
        },
        {
            "review_text": "I loved GalCiv2, and I was very excited for this new game (I was a junior founder, I bought in early). Now I am not so excited. I think it is the best new 4X game space game out there, but it frequently fails to live up to its predecessor, and it certainly doesn't feel like it has benefitted sufficiently from nearly a decade of advancement in gaming. This game has great potential, but after waiting a year for it to be realized, I'm beginning to lose hope. If you like space 4X, sci fi, or galciv2, you might try picking this up on sale, just to see if you like it. Don't get too excited, though.  Here's a short breakdown:   Pro: Multiplayer (finally!)  Con: Multiplayer doesn't really work well Con: How long will the game keep making money and therefore being supported with limited multiplayer?   Pro: AI is what the developer prides itself on  Con: The AI is not very good Con: Worse, there are obvious exploits Con: Someone with a knowledge of basic probability needs to go over the game mechanics... there are some weird bits*   Pro: Huge maps and the ability to play over 100 opponents  Con: Only comes with a dozen factions. The rest are crowd-sourced on Steam, and they are generally lackluster. Con: Only a slow trickle of 'offical,' complete new factions from the developer, and they seem to actively avoid adding them Con: The first race they added in DLC is a species of super-aggressive squirrels that started in GC2 as a joke... seriously   Pro: Fine graphics  Con: The movies use proprietary software, so it is much harder to add new ones Con: Certain things, like lights for ships and faction map colors, are limited and difficult to mod Con: Clumsy interface   Pro: Lots of DLC support  Con: The DLC is mostly weak and disappointing Con: The first expansion was similarly weak   Pro: Delightful ship designer  Con: You can only design ships in-game, no independent shipyard Con: The designer is terribly organized and harder to use than the GC2 version   Pro: There is customer support  Con: You can't just record a bug, you have to send them a video showing them something they could reproduce on their own computer Con: And they will close a ticket if you don't get back to them very quickly (they are not so prompt themselves)   Pro: Extensive modding support  Con: You can't upload mods to Steam Con: Some programming shortcuts make 'obvious' mods difficult (not unique to this game, I'm sure)**   Pro: Design as many factions as you want, supports multiple custom civilizations  Con: But they are in an uneditable form outside of the game*** Con: There is no interface for editing factions, you have to start a game Con: Large numbers of factions become unmanagable in an administrative sense: how do you find the one you are looking for with no search and no rational order to the listing? Con: Odd choices in programming colors limits the customizability of ships, interfaces, etc. Con: Game still doesn't include all of the factions remaining at the end of GC2 (Drath, Korath)   Pro: Some 'interesting' new game concepts, like tourism (yawn) and mercenaries (yawn)  Con: Lacks, or nerfs, many of the features of GalCIv2, including spies (coming), asteroid miners (nerfed), terror stars (maybe someday) Con: Major features that came with the basic GC2, like politics and political parties, are gone. United Planets seems to be significantly nerfed.   Pro: The developer is very good about updates  Pro: The developer often throws new content into updates Pro: The developer is pretty clever Con: There seem to be a lot of glitches/ 'unadvertised features' that still haven't been resolved despite extensive documentation   * e.g., Class 8 and 11 planets are more likely to occur than an either 7,9, 10, or 12, and random planets cannot be class 17! ** Aquatic ability is hard-wired, adding new strategic icons... ** You can't get the text back out to, say, spellcheck, the the text boxes are too small, the formatting changes unexpectedly, the typing interface is glitchy, and you can't give custom factions everything a built-in faction can (mostly for Steam compatibility)",
            "review_score": "1"
        },
        {
            "review_text": "Version 1.6 Review  I thought the second one was a clunky, glitchy mess, but this one is even worse in every aspect. Worse UI, worse AI, worse gameplay, worse stability, less features, worse price... there's just nothing going for this game.  It took me five hours to beat the tutorial because the AI was so rigged against you. While it can easily take you half an hour to research a single technology or build a single ship, the AI starts with every technology in the game and can spam ships 10x stronger than yours, but to counter this they're ♥♥♥♥♥♥♥♥ and easily manipulated. Can't win via conquest, only through cultural assimilation.  And within those five hours, I crashed three times so yeah, just do yourself a favor and buy Civilization V if you like those types of games.  ______________________________________________________________  Version 1.9 Review  Figured I'd give the game another try since it's been ages and there's supposedly been a massive update. Reading the changelogs, I was discouraged since instead of making the Ai easier they claimed to make it a lot harder... but then I played the game.  It still takes ages to research or build anything, and the AI still have every tech in the game and spam ships every turn (despite the devs saying they actually focused on making 'em less spammy). But the AI also seems to have slightly less of an advantage in the campaign, so you can actually complete it.  Speaking of the campaign, remember GalCiv 2's massive campaign? This one has a whopping three missions, and they give you an almost invincible warship in two of 'em. Every other 'campaign' is DLC-only but even that is pretty minor compared to even GalCiv 2's very first campaign.  Only thing I've noticed is that the game hasn't crashed on me and seems to run a lot better, so there's at least that but yeah... overall this game is STILL a complete farce. Just do yourself a favor and buy Civilization VI is you like those types of games.",
            "review_score": "-1"
        },
        {
            "review_text": "I've thought about this game for awhile. I've always chosen the other game over this when I have compared both in reviews. I bought No Man's Sky over this game (huge mistake). Breaking it down, if you love Civilization (any series) you will probably like this game, if not, I give it a 50/50. I for one who spent over 2,500 hours in Civ must say that this game is worth it, like the Mod in Civ 4 but way cooler. There are some glitches, but for the most part works good. My biggest problem with this game, is that you don't get to fight your own battles, but my biggest win for the game is that you can design your own ships. Not getting into too much detail I rate it as a 9.1 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Had repeated problems with the game crashing.  No editor unless you want to get a DLC, booooo!  Last time I'll buy into GalCiv, so sad.",
            "review_score": "-1"
        },
        {
            "review_text": "Coming from other games, this has a definite learning curve. Had to learn about specialization of planets, which the game tries to discourage you from doing.  Bug wise, glitches are semi-common, but tolerable. Be careful about destroying a planet, as the CTD bug after that is the most annoying one I've found.  The campaign is not an epic of heroism and gallantry, instead a rather short and muted affair that essentially provides flavor text for a normal map.  Overall, very good game. The ship customization feature is really fun, hopefully they add more components for greater variety. More customizable than any other 4X I've ever played by a mile.  I bought this hoping for another Homeworld, so slightly disappointed in only 2D battlespace, but that's my fault for not examining the screenshots.",
            "review_score": "1"
        },
        {
            "review_text": "The graphics and overall appearance of this newest iteration of Galactic Civilizations is wonderful to behold. But this newest version adds almost nothing to what Civ 2 had, leading me to wonder why this game was given a 3rd iteration if a creative spark was lacking.  The interface is similar to galactic civ 2 in that the majority of the vital text necessary for gameplay is crammed at the bottom and left-hand edge of the screen. When one invents a wondrous new engine or social policy we are greeted with a gigantic picture of a server bot doing a repetitive hand display with the actual description of the invention a few terse sentences at the bottom of the screen as if it were an afterthought. Shouldn't the flavor text and practical statistics of a new discovery take precedent over a server bot? We have to look at this guy for hours and hours of gameplay.   More summaries are needed. Granted I do not mind sifting through Excel-like spreadsheets to feel clever about discerning a new way to refine my galactic macroeconomics, but a quick rundown is often necessary just to get a better jist of a planet's well-being, especially when the player is embroiled in chaotic conflicts with one or more opponents. The entire UI text is too small and ignored throughout.  On the subject of combat, I have yet to design a ship that consistently wins battles. This may be some sort of personal failing of mine, but I am having trouble figuring out what I should or should not do. Range on mass drivers seems limited, which makes no sense in the vacuum of space, and other races always seem to evolve faster than myself, as if they were optimally programmed to know exactly what to do or something. How strange! Granted additional time spent with the game will probably find me honing in on workable strategies, I have to note that playing several hundred turns into a game only to then find that my plan was flawed is depressing. A few failed attempts at various weapons and engines with little learned on how to improve has discouraged me from wishing to replay.   The relatively underdeveloped story does not allow me to enjoy the wonder of exploring a universe with any given race. Is it expensive to pay writers to add additional depth and creativity to a game? I honestly don't know, but I would be willing to forgive my military failures if I could at least love the universe a bit more.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are a fan of 4x games, and didn't play Galactic Civilization 2, then Galactic Civilization 3 is probably worth the money. If you have played Gal Civ 2, then I don't think there is anything in the sequel that justifies a $40 price tag. It's graphically updated, but the core mechanics and interface are remarkably unchanged.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is everything I could want in a Space 4X. I like the political mechanics and combat especially. They're fun and simple and fast. The adjacency bonuses for developing worlds is a nice little strategic addition to the game that makes colonizing fun. Ship customization takes a little while to get used to, but having that option is nice. It can really speed up expansion and development of star bases.  Great work, Stardock!   Peace,  -Troy",
            "review_score": "1"
        },
        {
            "review_text": "It might be the game I will be playing a lot in a couple of years. It's not there yet. You might want to read the reviews on the expansion to understand the current state of the game, bellow is my impression some months after release.   [Review from the game's 3rd major update] The game is far from what it should have been. I've backed the game in the alpha stage, but after reading into what they were planning to do, have avoided playing it too much prior to its release as, I didn't wanted to spoil my experience after that point. Now, in perspective, I should have waited even more for the game to be completed... but here we are.   As with the previous Gal Civ, I've spent most of my time playing this game in the designer mode. In this new iteration, the designer is even better, if you can believe it. If you like Sci-Fi, you'll really like designing your own space faring armada. And with the changes they've made, ships will look more smooth and you'll have more options in terms of angles and shapes. With mods, this can only get better in time. If the developer adds more artefacts, it would really be awesome.  However, this great feature isn't, yet, backed up by a balanced and immersive game. There are tons of little misgivings that ruin immersion and I won't go into details to avoid spoilers. Game balance is a big issue though. For me the experience started on the wrong foot, the map didn't spawned the resources required once I've changed the defaults of a new game. Think how it feels finding this out 50h into a savegame. Once you learn how to workaround all these issues and spend several hours to epxand, you'll run into the AI issues. In my case, the AI was passive in many playthroughs. I was the only player on the map with fighting capable ships for 1/3 of the duration of the playthrough in some of my games. I've tried changing my playstyle to see if anything changes. Nope. The AI does an aggressive job at some of the Xs out of the 4x. Exploration and expansion are performed gregariously by the AI, they don't know how to exterminate once they reach another player's borders, human or AI. Also, it's not clear to me how does the AI have the resources to spawn as many ships as it does (it might have been fixed with the latest patches, but it's really hard to playtest this, players don't have enough time for it and it should be counted as a negative for the developers for letting this slip by to begin with).   Improvements from the previous Gal Civ 2, like the hex pattern and adjancency bonuses, are nice and all, but they add too little to the gameplay to compensate. They're great ideas, but it's not enough and considering that the game feels poorly balanced, they don't really compensate for the shortcomings.   Other nitpicks. The UI looks nice, but it's not well thought through. Elements that are required are barely visible, while non-functional elements take most of the screen (in the designer or shipyard for example).   Diplomacy is rather childish and the text options are repetitive. Game length is too high considering what it has to offer. Customisation exists, but you'll be more likely to run into gamedesign limitations and functional issues if you attempt such a thing (for me it's a plus that a developer even attempts such a level of customisation, even if they fail, because it's a dying art in the game industry and I would hate losing it - still, people should know what they get into).   In conclusion: I will try to complete a game from time to time, but I'll be returning to GC3 because of the designer, unless it improves considerably.",
            "review_score": "-1"
        },
        {
            "review_text": "Good game, really goes for your hours played record. Will feel familiar to anyone whos played either of the previous 2.  New players may find the game a little difficult to get into at the start as the game doesnt really tell you alot &amp;  the tech tree is flippin huge!!!!! its worth sticking with &amp; the designing of your own ships is still one of the best features in a game (you really can spend hours on this without trying, more games should do this) I do think the single player game difficulty levels need to be tweeked a bit, the level between normal &amp; challenging feels a little too wide - normal often being way too easy &amp; challenging maybe a little too so with certain setups Still one of the better space strategy series out there  ",
            "review_score": "1"
        },
        {
            "review_text": "May 2015: ======== This game is unfortunately not what I expected: - not much evolution since Galactic Civilizations 2 - clumsy interface - crappy tutorial and manual that both do not explain much - uninspired campaign video sequences and story - crappy battle sequences - just OK graphics - somewhat buggy  Nevertheless playing is still fun it just hasn't that much evolved from GalCiv 2 and it is as of now by my mind not worth the price they are asking for. Therefore I can only recommend it for avid fans of the series but not in general.   UPDATE April 2016: =============== Not enough has changed since release. The game is still not nearly as good as Galactic Civilization II with its addons is. Wasted my money here on 2 Elite Founder Editions.",
            "review_score": "-1"
        },
        {
            "review_text": "To me this game is vast, requires a steep learning curve, and needs dedication before its beauty is seen. While I would consider my progress in this game in its infancy, I certainly like the playstyle. I haven't bought any of the DLC as I feel like I would get lost with all the extras when I don't know how to handle the current ones I own.  As far as gameplay goes, my laptop is starting to struggle with my 5 team, huge clustered, slow progress map on turn 500. I haven't seen any crashes or instability except for when zooming in and out of my map to look around.  One frustrating thing I have with the game is that the when you highlight a ship for movement and then move your cursor around the map, the ship is no longer highlighted for orders and it becomes an idle ship. Then when you tab to access that ship again, it refocuses on the same ship removing you from your position which creates the same scenario. The fact that the ship cannot stay highlighted infuriates me especially when I'm trying to get away from the Drengins.  On a positive note, the complex mechanics of the game keep the mind intrigued. Just when you think you had the fastest ships in the galaxy there will be a slow down causing you to rethink your long term attack strategy. This is exactly what I was asking for in a space management game such as this. While you do not control the performance of your units directly, knowing your chances and the risks associated with attacking the enemy fleet can keep the game exciting enough for the tacticians of the world.  I do find it lacking that special something, however. Maybe it's because I've only played 20ish hours of it (although it feels like I've spent more), but I haven't gotten hooked like I did with Star Wars Empire at War. Where is my giant class battleship that counts as 30 logistic points? Maybe that's something that I have to create in order to find.  The ship designer is cool, but I don't feel like many players, including I, know how to use it. It's just... there. If I had better instructions on how to use the tool that would be nice.  Otherwise I enjoy the game, and it's been fun to see how it has grown from Beta to the current release I'm playing now.  On a scale of golf cart to Lamborghini I give it a Mustang, one of those games that look sweet and sound sick, but just don't have enough juice to get you oogling over.",
            "review_score": "1"
        },
        {
            "review_text": "It's an alright game, however it still has a few issues. First the larger maps will slow to a crawl when you get further into them, eventually becoming unplayable. The game itself feels like a downgrade in almost every way to GalCiv 2 and it lacks some of the things that made that game great. The 'difficulty' aspect is non-existent, the devs basically just gave the AI such massive advantages even on normal difficulty that the player is always behind (though still easy to win because the AI is awful.) Finally it charges five extra dollars for a bunch of things that should've already been in the game. Those are only the major issues, there are a bunch of minor negative things about this game as well. Overall it just feels boring, I can't get involved too deeply into it despite spending a ton of time on GalCiv 2 and multiple other space-based 4x.  I recommend no if only because it's not worth $50+$20 dollar for the DLC.",
            "review_score": "-1"
        },
        {
            "review_text": "Had fun playing this one, recommend to anyone who is a fan of the genre and likes long matchs, (so those who like civ 3/4)",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a multiplayer guy. I'm a guy who expects to play in a sandbox, be challenged by competant ai and get the overall 'strategy' sort of feeling. I tried quite a few different 4X games over the years and only met disappointment with poor ai. Take Endless Legend for example which is akin to the Call of Duty of 4x. Flash, reviews, no substance. The devs had atrocious Ai for more than a year before releasing a single patch for it. You can't work miracles in a single patch and the ai still sucks. All the lore and graphics don't do me any good if I feel alone playing against brain dead ai.   Thats where stardock comes in. I respect them for putting in many more updates and tweaks focused on making the ai a damn good opponent. Are there imorovements to be made? No game is perfect obviously. But only in galciv do i get a true feeling of exploration, optimism when i make allies, caution because the ai can kick my butt, dread because an ai stronger than me WILL be a tough fight and finally wonder at amazing choices to be made, planets discovered and galactic events to witness. Will the Dread Lords come back and force me to make peace with my enemies so that we can work together to stop them or die alone? Freaking awesome diplomatic role playing there!  In short Galciv 3 should be the main 4x out there on your mind if you like space themed 4x games. I always come back to Stardock in the end because they're committed to making their game better in all the ways that make 4x really worth playing.   Disclaimer: Hardcore players, no matter what the game, will never be satisfied. I consider myself an above average to very good strategy player.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty much just Civ in space, worth playing if you like the Civ games along with previous Galactic Civilization games.",
            "review_score": "1"
        },
        {
            "review_text": "So, I am not sure why my last review isn't on Steam now... did I say something wrong?   EDIT (300+ Hours of Play):  WOW!   You know a game has you in its grips when you start scheduling your life around your game time!  I have now been completely sucked into GC3. I knew this game was pretty solid when I first started playing it, but now that I've had some serious time to play it and actually figure out what I'm doing (mostly), I just have to say that this is what a 4x game should be. A game that makes me say 'Just one more turn!' Just one more custom race tweak. Just one more try at a new build strategy. (etc.)   I have not been this addicted to a game since probably World of Warcraft (even though they are in two completely different genres), and I really have to give credit to Stardock for doing a great job at making a game that is infuriatingly addictive,has literally has kept me up until dawn the next day, bloodshot eyes and a sore mouse-hand.   I think that Stardock has found a happy balance between being so simple of a game as to be boring vs. being so deep that you need a 100 page manual just to understand the game. It's really easy to get into GC3, but once you play through a few games (400+ turns) on insane szed maps, you really get a feel for how this all works, and the game design is brilliant. The sheer number of potential win strategies on display is staggering. There is no 'best' tech tree utilization. Every decision has pros and cons and there is both short term and long term strategies that need to be mapped out. Between the map design, your race (custom or not) along with planet management and tech research, there are potentially billions of ways to attack this game.  Personally, I play my games with 'Conquest' or 'Alliance' as the win strategies just so some race doesn't outbuild me and ascend to a different dimension while I'm stilll building capital ships to wipe them out.   The planetary map mini-game is really the stroke of genius to me. SO much of your empire's success hinges on good planet management, and good planet management means paying attention to every detail, coming up with a solid build stretegy, having the right tech trees unlocked and then being able to switch gears on the fly. What you build, where you build it and when you build it can mean the difference between rolling over your enemies like a steam roller, or getting your butt kicked before round 200. The interplay between your research within the tech trees, your planet management and shipyard management are really where this game happens. (I haven't even begun to use the custom ship editor!!!). The planet mangement aspect of the game is very simple to get into, but this part of the game gets more and more complex as time goes on.   I haven't even begun to be an expert in this game even with 300+ hours under my belt. I see MUCH replay ahead!  One last note: The game has only crashed once on me in 300+ hours. THANK YOU STARDOCK!  ------  ORIGINAL REVIEW:  Anyway, I just wanted to provide an update to my previous review of GC3, and raise my score for this game from an 8.8 out of 10 to a solid 9.5 out of 10. (The .5 left over is really just bug fixes, but I have found the game incredibly stable at this point).  GC3 is a game modder's DREAM!   I just started poking around the various game directories last night, and you really can customize the crap out this game. Not only can you load in your own icons and photographs and backgrounds and videos for the races, but you can also use the ship designer todesign your own star fleets AND you can replace most of the game UI graphics AND they have included the ability to create 'total conversion' mods for the game, right out of the box.   So, even beyond an already flexible game (no modding required), the replayability of GC3 is great! Add to that the ability to tweak this game into the next century and that adds another whole dimension to it.  Next, I confirmed with some fans that Stardock has committed to 2 expansion packs and several bug fix patches along the way. This is a big deal to me because if you have seen the end result of GC2, you will realize that this released game is just the START of a development cycle that continues well after the game is released. Bugs will be fixed, new features will be added etc.  So, I'm not just happy about this game as is (and I am already addicted to it!) I am very much looking to the future as well.  IF you are a fan of 4x games, I think this is defintely a must have! I've been looking for a while for a decent way to burn time, and GC3 definitely fits the bill for me.   Hopefully my other review will go up at some point... I don't want to have to write all that again! =(",
            "review_score": "1"
        },
        {
            "review_text": "I'm on the fence over this one. My feelings toward this game are a bit like they were toward Civ V before the Brave New World expansion.  It's a good 4X space game and all, but there's not enough there to keep me coming back game after game to see how things can be managed differently. I'm not sure what, but it needs something more. Another level of complexity.",
            "review_score": "1"
        },
        {
            "review_text": "Filled with the same kind of niggling game design problems as its prequels.  The visual design is highly polished, but it feels like they never had anyone who understands game design sit down and play through the nearly-finished game for the first time. All of my problems with it are extremely minor and can be overcome, but the list is very long -- here's a sample:  Anomalies provide an odd incentive to change to your most expensive technology and improvement at the beginning of each turn. Tooltips about improvements provide inadequate or straight up misleading information, the buy tooltip shows your treasury if you have enough to buy something, but not if you don't. A guarded anomaly gives you an option not to attack if your ship has weapons, but there is no indication that this option will not be available if you do not have weapons until you try it. Improvement layout is incredibly important, but all the planets in the campaign have terrible layouts. I still can't figure out the logic for cancelling starbase improvements -- at one point it cancelled everything _except_ the one I had selected. Running out of cash auto-sets your government to max economic. This often brings in less money than the setting it was on before you ran out of cash and essentially results in a game over as you have no ability to pick the government setting that would bring your cash back to the positive -- I suppose this is a decent metaphor for austerity though.  These and things like them make the fun option and the optimal option often quite different and take away from the enjoyment of the game.  This doesn't make Galactic Civilisations III worse than its predecessors (on the whole, it has improved a little in this regard), but given the huge budget and fanfare I had much higher expectattions.",
            "review_score": "-1"
        },
        {
            "review_text": "I have mostly favorable thoughts about Galactic Civilizations III. I like the customizable ships and races. The in-game events that shape the theology of your race make each game feel different.  I find the interaction with other races confusing. The interface screen only shows an avatar of the race. I sometimes can't tell which race I'm talking to. The screen doesn't show the name of the race or any current or past agreements we've had together. Usually after loading a game that I played a few days ago I have no idea what is going on when I start the game.",
            "review_score": "1"
        },
        {
            "review_text": "If you've never played GalcCiv I or II and 4X is your thing you will love this so give it a go! If you've played GalCiv II steer clear and go back to GC2 - it's the same game with a worse UI and a worse AI. I cannot stress enough how bad the AI is.",
            "review_score": "-1"
        },
        {
            "review_text": "Master of Orion 2 is one of my all time favorites.  I play many of the 4x games in hopes they will have some of that spark. Galciv 2 is the best space 4x game contender, even though it didn't quite hit the same peak. I like Stardock, I like their Fallen Enchantress etc. series, they make good games. I find myself not liking this one. It feels bland somehow, though I note it's a better version of Galciv 2 more or less. I think the bar for a good game has moved, and it's still not Moo2. I waited for the DLC to go on sale, thinking that might fix it. Still not liking it.  It's one of the few games I pre-order at full price, that's how sure I was I would like it. Ah well.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is sprawling with detail. GalCiv fans will find lots of stuff re-designed and remade. It's not incremental; you'll relearn new things and see how they fit neatly. Game is still a tense race to power, and it'll keep you hooked.",
            "review_score": "1"
        },
        {
            "review_text": "Game is filled with bugs, to the point it's unplayable. All sorts of different issues that causes the game to crash to desktop, none of which in my experience are performance related either. Try to join MP and it crashes, try to perform certain actions within the game and it'll crash. With no real response from Stardock support.  Aside from the bugs it's not a deep game for a 4x, right now anyway. You'll see a lot of the same dialogue and events within your first game alone. AI behaves oddly as well, for example civilizations that are far weaker than you will demand that you make weekly payments to them.   The ship designer is very nice though and well done, basically a game within a game.",
            "review_score": "-1"
        },
        {
            "review_text": "A great addition to the ultimate 4x space collection. If you are returning to GC3 from a previous title, then the game will feel very familiar, the systems, mechanics and gameplay are all very much alike to previous versions, this game is about iteration not innovation, building upon an already successful and enjoyable experience from previous titles, with all new graphics and a wonderfully detail ship designer and the always welcome custom race options you will quickly find yourself at home in GC3. For newcomers there is no better time to jump into Galactic Civilizations than now, with fresh new graphics and a user friendly tutorial, it has never been easier to take your first step into this wonderful universe.",
            "review_score": "1"
        },
        {
            "review_text": "I Highly recomend this game.very deep and lengthy with many options of diversity.a little work needs to still be done on the a1,but i would think thats a work in progress. ",
            "review_score": "1"
        },
        {
            "review_text": "The one thing this has over the new civ 5 and 6 releases is despite being forced to use hexs, you are allowed to at least add more than one unit on the same hex. I have built a fleet of five ships so far travelling on the same hex. Civ is so boring now as you are forced to move around your own and enemy units to attack. The major downside at the moment is the game has bugs. I have had 3 crashes so far and they seem to occur after adding more than 4-5 civs on a small map. Further the ideologies have spelling errors as if the game has been rushed through production. The battles are lacklustre compared to sins of a se, however they are sometimes cool to watch if not a little predictable. Some sort of political ideology mechanics like alpha centauri would give greater freedom and make the game more engaging as like most modern dumbed down games it can feel as if your just along for the ride sometimes.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun for everyone who loves space!",
            "review_score": "1"
        },
        {
            "review_text": "It iws a very slow strategic game. If you are in it for the long haul, this game may be for you. If you are a cheap thrill seeker that downloads cheats from the internet to assist you.. maybe this game is not for u.",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for a bit and I like it a lot. The ship design is cool and I've used ships from Halo and Mass Effect in games I've played, I'm using Stargate next. There are issues though, build times for ships can get ridiculous to the point it takes almost 100 turns to complete 1 ship. The more you research new weapons and such the more adanced your ships become, but also the longer they take to build. Even with a ton of manufacturing buildings on my colony and a support station aiding in construction the build times were still ridiculous.   The diplomacy seems better than civilization but the characters have no life to them, they have no voice acting and they all use the same movements. Trading technologies can be a good way to stay ahead but if you want a ship from them you need to basically give up your empire for 1 ship. Even then it can be destroyed easily because the A.I. has no issues with construction. they can turn out fleets like they're nothing at all.  There are some game breaking bugs still, one I ran into in the campaign. I defeated the enemy and tried taking the homeworld back, but a bug prevented the game from recodnizing the ship was where it should be to win so i never did in that playthrough.  despite all of that though the game is fun, just way too long it certain areas such as ship building and has some bugs. I play this like i did Civilization 5 when it came out, all the time. Get the game and play with friends with your own designed ships, I like using the Alliance ships from Mass Effect against my buddy playing with his Star Wars ships. Its a lot of fun as long as some bugs dont bother you. ",
            "review_score": "1"
        },
        {
            "review_text": "Lots of improvements over earlier games. Economy/governence is much easier to understand. I have spent countless hours playing. Would not mind a more robust campaign mode.",
            "review_score": "1"
        },
        {
            "review_text": "Definently worth your time. The game still needs proper mod support when it comes to creating custom civilizations with their own style.",
            "review_score": "1"
        },
        {
            "review_text": "it's good game ... i'm the fan of this game serie so it good that they keep doing good job .",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, pretty decent AI so far (seems better than GC3 AI actually). As a big GC3 fan I do miss the spying though, and for some reason, the battles seemed more fun to watch. There were different options and were more exciting, plus smoother. I do enjoy this game though.",
            "review_score": "1"
        },
        {
            "review_text": "fantastic, I can finally be a race of pirate chipmunks bent on murdering my way across the galaxy.",
            "review_score": "1"
        },
        {
            "review_text": "This is an awesome space empire building 4X game. The only other space 4X game that comes close is Endless Space and that was released a few years ago, so I would have to say that until this point Galactic Civ 3 and Endless Sopace are at the top and among the best.",
            "review_score": "1"
        },
        {
            "review_text": "I love GC2, Love this game too.",
            "review_score": "1"
        },
        {
            "review_text": "its still pretty buggy so its kind of a huh",
            "review_score": "1"
        },
        {
            "review_text": "Besides the random crashing when your doing too much at once, this game is amazing. It would be even better if players could share their ship designs via Workshop.",
            "review_score": "1"
        },
        {
            "review_text": "I do recommend the game for those that played 1 and 2 or any of the Civilzation style games and liked them. I did find some of the extreme times on research a bit tedious and I did find the income remains a bit too slow to develop. I don't want to spend forever on the larger galaxies and that IS what it ends up feeling like when you make the research trees and income take that long while making the game start out at ridiculous sublight technology levels. Too slow to develop and way too economically pinched to remain fun for any but the most devoted. If you choose to cater to the extremists in this regard you will lose too many of the casuals. I love this genre and I loved so much about this game other than the slow research trees and restrictively slow economic growth. That being said my son, brother and best friend all played it once and I think the reiterated quote was 'It's no Masters of Orion' although they did admit to my defense of the wonderful new ideas, expansive ship design and beautiful graphics. You lost every one of them with one or both of my stated issues. Myself, I like it albeit with the caveat of those issues.",
            "review_score": "1"
        },
        {
            "review_text": "Great game if you want to pass the time. Very similar to Master of Orion 2 and Pax Imperia. Lots of options, AI is above average. If you like Civ or space 4X strategies you will like this.",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game as it is as big as you want it to be, with ship designs and strategy to choose from in so many ways. I took a break for awhile but it is nice to come back to many times.",
            "review_score": "1"
        },
        {
            "review_text": "A solid space strategy game. It has the exploration, expansion, economy, diplomacy and tech with multiple elements to a successful game. It also has a vein of humour I've appreciated.  I've had the odd irritation where something doesn't work properly (seems to often be related to having a ship with unused moves at a planet/station), but not enough to break the game. Designing your own race and ships is a big plus for me. I've won games because I tweaked ship designs to exploit my own available resources and negate my opponent's strengths. Recommend.",
            "review_score": "1"
        },
        {
            "review_text": "The game is challanging but once you figure out the mechanics it gets to be really fun with a large variety of play styles similar to Civ but with its own style and ways of doing things.",
            "review_score": "1"
        },
        {
            "review_text": "The first time I played I was destroyed by all the other factions within the first 40 turns. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Great fun game. And you can build your own starships! Sad I can make better looking star fleet ships than some paid designers for various Star Trek series ....",
            "review_score": "1"
        },
        {
            "review_text": "I played Galactic Civilizations II extensively - GalCiv II on OS/2, back in the late 90s. Other than a bug with the financial field that was only a signed 16 bit number, restricting how large of a universe and civilization you could have without it breaking. I discussed it with the author, Brad Wardell, someone that I knew as fellow Usenet regulars on an OS/2 newsgroup. I knew about the Windows migration and have had Galactic Civilizations II on a couple Windows boxes, played extensively, and followed the development of this version.  Like the WIndows version being a substantive interface update over what I knew on OS/2, this updates the interface, but also much of the underlying behaviour has been improved. I still recognise the personalities of the various species, but the AI is more complex and unlike the previous situation where you cannot assume that personality trends for a species would automatically continue. Maybe over time I will get to find trends that will let me gain an advantage, but this has moved from being what could be a familar time filler to now being a new challenge.",
            "review_score": "1"
        },
        {
            "review_text": "Its good",
            "review_score": "1"
        },
        {
            "review_text": "Great improvement on GalCiv 2. Loads of fun and looking forward to more content!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome continuation of an excellent series. A must for Civilization fans. If you like turn based strategy this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "was told by a squiral that i was trading with an infidel 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, it's better than MOO3, so there is that. Thanks StarDock for making it better.",
            "review_score": "1"
        },
        {
            "review_text": "Great 4X game, simple enough for new players; closer to CIV V than most space 4X strategy games out there.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good game. Has become even better with the steam workshop integration and the usage of player-made collections (Factions and corresponding Ships, sometimes even complete franchises)",
            "review_score": "1"
        },
        {
            "review_text": "a brilliant game with never ending possibilities. having been a strategy player for many years i can say this game surpasses all others. the graphics are really good. A.I. has worked out how i play on different levels and different strategies. this is a game that keeps you interested and wanting more.",
            "review_score": "1"
        },
        {
            "review_text": "It's good. Though they should probably fix the fact that there is no overflow for science, as wells as the growth not being about the actual size of pop, like growth being 10% of the current pop, instead of just being +.25.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Gal Civ 1 or 2 you should like this game. I am still playing on normal so i can't really rate the A.I but everything else has been fun to play with. I like the empire building and research aspect of this game. There are many techs to learn and a hugh galaxy to explore. I am currently playing on the 3rd from the largest setting. I am about 150 turns in and i have only explored about 20% of it. there are a few minor technical problems like spelling and spacing but i expect those will be corrected soon. The font size i find easy to read which is very nice as i get older.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful way to spend an evening.. Or 20!",
            "review_score": "1"
        },
        {
            "review_text": "Very similar to Master of Orion - excellent game, but no in game help menu. A bit frustrating because some apparent differences in the game aren't clear and there is no help menu to sort it out. Will likely be a long term commitment for playing this. Strongly recommend for people who are patient and don't need constant explosions and a graphically intense ride.  ",
            "review_score": "1"
        },
        {
            "review_text": "While I understand that many long time GalCiv fans do not like this newest iteration, for me as a first timer it is very captivating.",
            "review_score": "1"
        },
        {
            "review_text": "Custom factions, custom ships, mod support and a company I have always enjoyed. Though i debated a silly review for humor sake, this game is just plain good.",
            "review_score": "1"
        },
        {
            "review_text": "Master of Orion I +II were great, Galactic Civilizations II was great but this game is fantastic! You have different ways to win the game and is funny to create your own shipstyles in the designer.",
            "review_score": "1"
        },
        {
            "review_text": "Like his prequels an absolutly must have for all 4x players. Love it",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. I highly recommend buying this game at any price; you will be well rewarded. I will list some of the more interesting pros of this game. 1. Tech research: The game breaks the tech tree into 3 ages. In order to advance from one age to another the player has to complete a significant amount of research in all the tech trees of the current era. You might be a able to race to the end of the military related techs of the current age but you will not be able to advance to the next age in military techs until you have done about 85% of all the techs of that age. 2. Map size: On its largest scales I have never seen a game map with larger maps. 3. Ship customization: This game allows you the player to make your ships as complex looking or not depending on your desire to express your creativity. I for one like to make simple custom changes and then I just want to add components wherever they will fit. This game will satisfy everyones desire to create complex designs. 4. AI: At its higher settings this game will give you a serious run for your money.  Buy this game and play it.",
            "review_score": "1"
        },
        {
            "review_text": "Although I do recommend this game, being a vetran of the civs games.. It has a ton of bugs and the AI needs a serious overhaul, in many ways. There could be 3 new difficulties between normal and gifted, it has that large of a disparity. Besides that, it should be implemented in some way the possibility to simultaneously move in multiplayer. The game would move at double the pace and as it stands right now, multiplayer is way too slow.",
            "review_score": "1"
        },
        {
            "review_text": "A few minor glitches that make you restart the game. Otherwise, GREAT BUY!",
            "review_score": "1"
        },
        {
            "review_text": "Really great",
            "review_score": "1"
        },
        {
            "review_text": "While missing some of the options from the expanded GalCiv2 games, has a great single player campaign and move toward a hex grid is a most welcome improvment. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Galactic Civilizations is an all around good game. I would recommend picking it up during a sale.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, BIGGER than HUGE maps, it's mind boggling, I tell you. This is a huge time burner. If you want a very complex 4X game that is fairly easy to learn, get this!",
            "review_score": "1"
        },
        {
            "review_text": "great game best one of the 3 by far only down side is the random crashes",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I've been following Galactic Civilizations since the first one and they've all been good strategy games. My only wish is that there were more custom faction creation content included as one of the best things about the game in my humble opinion is the ability to customise your ships and faction. But overall a stunningly well done addition.",
            "review_score": "1"
        },
        {
            "review_text": "So many planets to colonize!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, few bugs still, but nothing that saving the game and reloading the map cant fix, Would like to see more options for space battles. Also would like to see if they can cleaning the coding up, seem to find the game stuggles on huge maps with performance, i'm running a AMD R9 290, AMD FX 8350 @4.5 GHz with 16gb ram (Win 10) and the game starts to really slow down and lag :-(  Apart from that, great game :-)",
            "review_score": "1"
        },
        {
            "review_text": "Decent game but needs some balancing. Starrbases are horribly underpowered and weak with pitiful range. You can play games with the AI to keep them from destroying certain assest where a Human player would just ignore. There needs to be tactics settings when your ships goto battle, at least some interaction rather than just watching random outcomes. The tech tree is confusing at 1st, there needs to be a little more explination on the benifits and detriments to a particular choice, otherwise you have to figure it out by trial and error and the games can be long and you find out you made a poor choice 5 plus hours into a game. You cant have mutilpe parties picking the same race on a multiplayer skirmish, why ? You can't change you ship color or Icon or Profile picture. The game has great potential, Im supprised the simple issues I spoke about havent been addressed.",
            "review_score": "1"
        },
        {
            "review_text": "Really good space 4x game. I love playing tbs's and this one is probably the most fun and addicting. And that's coming from somebody who's played 500+ hours on Civilization V. Really hope they add an expansion or more dlc. Good job Stardock",
            "review_score": "1"
        },
        {
            "review_text": "An excellent successor to Galactic Civilizations II. My only issue so far has been that the game will slow down to a crawl on very large maps after 500 or so turns, often taking 10 minutes or more for the AI to finish a single turn. UPDATE: slowdown is no longer a huge issue. It turns out that the bottleneck was my hard drive, so switching to a solid state drive sped up the game significantly. Still no idea why there's so much disk I/O between turns, though.",
            "review_score": "1"
        },
        {
            "review_text": "I normally dislike strategy games because they tend to actually be 'rush troops and kill your neighbour AI/player'. But in this game, diplomacy actually works well and I can place in a slower pace. Overall faction creation, ships, combat, diplomacy are very good. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. Very in depth",
            "review_score": "1"
        },
        {
            "review_text": "Rating 8/10  Pros:  In depth research tree/systems Game Mechanics Ability to play in a lot of different modes/configurations Ship Design System AI Gameplay  Cons: Only offers auto resolve for battles Required to consume transport ships to take over planets (at least I have not found another way). 'Soldiering/Troops' have very minimal actual game play mechanics ",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game since release i am going to have to also go with the minority(but we know what we are talking about) on this and say do not buy until they add more content that the company is not going to charge u for This game is just not worth the price unless half off. Three scenarios for a game?? Come on Stardock use your brain. I know i was expecting different campaigns for the different races or at least the major ones so to only have three campaigns for this game is a complete joke and then they will probably try to charge for them which makes it even less worth it. There are however some pro's to this came, the ships, technology tree's, different races, planet control are all Pro's, however the major con far outweighs the pro. Stardock if you are going to make a game then you make it in its entirety and not relase it until its ready whcih means actual campaigns. Additionally, one of the campaigns cannot be completed at this time if you choose a certain ideology path of getting another hidden planet because it tends to spawn on a game point you need to bring down the Precursor and the dev's comment was this was unforeseen and will be fixed later. Not a very good response. The initital earth campain only has THREE full campaigns if you want anything else beyond that you have to pay which makes this a total scam.  After further play time, my review is the same. which is DNB (do not buy). Stardock has failed to complete the original campaign and isntead after you pay full price for the original(still unfinished game) they are now creating downloadable contect which you have to pay for if you want to finish the game and this includes the original terran campaign. All they are doing is trying to draw out more money from players after they paid full price for the original game. If you get this game at 75% then its worth it because you will be spending the rest of that money on the DLC content they release over time to get more money. What a scam.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're a fan of games like Sid Meier's Civilization series, I highly recommend this game. Scale is fantastic and customisation is amazing. Designing your own units is what really makes this game great, both in look and strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Good 4X game. Still getting use to it but takes a while to figure out all of the options and capabilities necessary and available.",
            "review_score": "1"
        },
        {
            "review_text": "Edit: I've changed my review to positive as the easy alliance victory has been patched. It is now no longer possible to get most of the AI civs to sign an alliance after researching a few diplomacy techs. The fact that relations with the AI is now based more on your actions and the galaxy situation instead of your diplomacy skill bonus is a fantastic improvement. This is enough to tip the balance to a positive recommendation. My original review is below, I will update it when I have time.   I can't currently recommend Galactic Civilizations 3 for full price. While the game is certainly improving with patches it is still has a long way to go. I describe some of the major issues below.  There's a lot of micromanagement of planets. You need to adjust the global slider for research, social manufacturing and income. Then there's a separate global slider for social and military manufacturing, because buildings and military units have separate production queues. On top of that, each planet has its own individual focus for manufacturing, research and income. You're going to need to make lots of adjustments so that production and research are more efficient for each building and military unit you construct. Production times are quite quick, and you're going to have a lot of planets, so a good portion of each turn is spent on this. The time spent micromanaging isn't helped by the fact that the 'military subsidies' project which is used to build ships has a bug that causes your accrued production overflow to be lost in certain circumstances. You'll want to try to micromanage to minimise the lost production that occurs as a result of this bug.  Galactic Civ 3 has limited documentation in game which doesn't provide much information about how the mechanics work. The tutorial only touches on the most basic concepts. You're going to spend a lot of time alt-tabbing to look up game concepts in your browser. The documentation in game that does exist describes your research technologies, ideology options and random events. Unfortunately, this documentation often incorrectly describes the gameplay effects, for example many researchable technologies provide bonuses completely different to the bonus described in the written description for the tech. The research tree also describes bonuses that don't seem to apply. For example, none of the techs that claim to give bonuses to military manufacturing actually make any difference at present.  Some research technologies give you an option of specialization. You can only pick one choice per technology. Some of the choices are seriously unbalanced. For example, one of the specialization techs has a choice between 10% extra research or a 10% reduction in the maintenance of research labs. Research labs only cost about 1 credit per turn to maintain, so the maintenance reduction is a negligible bonus. Since you're stuck with your choice for the rest of the game, it's a clear choice in favor of the research increase. Stardock is likely to improve these unbalanced specializations in later patches.  Diplomacy is pretty broken at present. It is very easy to make an alliance with most other civilizations in the game and win an alliance victory after researching a few diplomacy techs. This is because the diplomacy techs provide a large diplomacy boost. Just a few of these techs can make an AI that would otherwise be neutral willing to pay through the nose to sign an alliance with you. There is also an issue with tech trading where civilizations can trade tech when they don’t have the prerequisite for it. Imagine having a game of Civilization where you can give another civilization “flight” when they haven’t discovered “the wheel”. Apart from the obvious lack of realism, it makes tech trading unnecessarily confusing due to the sheer number of techs that show up to trade. It also has the potential to allow civilizations to skip techs giving them a huge leg up the tech tree. You really shouldn't be able to give a civilization a tech unless they have the prerequisite first.  Sometimes, another civilization will make you an offer in exchange for a tech. Since the tech tree is complicated, you may have no idea whether it's a good trade or not. They might even be offering you poor specialization tech that will lock you out of better choices. Unfortunately, you can't check the in game tech tree without first declining or accepting the offer. This makes it difficult to properly assess any offers made by the AI.  The AI is not very intelligent. It will do things like build massive fleets of tiny vessels which have a very short range. It will then declare war on me because it thinks it has a stronger military, without realising that its ships can't even reach my planets. I've never seen the AI move a planetary invasion transport away from the shipyard in which it was built, even when there are undefended enemy planets nearby. This means that even if the AI could reach me with its other military ships, it can't actually invade my planets. Since the AI is incapable of invading my planets, I have no need to defend them. Even worse, some AIs don't build any military ships whatsoever, even late in the game. These AI are defeatable by sending unescorted troop transports directly to their planets. To top things off, I've even had these shipless AI declare war on me or try to extract tribute from me in the face of my overwhelming military power.   I find the back stories to the alien races to be quite interesting. It makes playing the game a richer experience, as you know why the races play the way they do. The only downside to the story is that there is a lot of use good and evil concepts. For example, your ideology stretches the range from 'benevolent' to 'malevolent'. Basically, you decide whether your civilization is 'good' or 'evil'. Several of the alien races are 'evil' while others are 'good'. Malevolent alien races don't hide the fact they are 'evil' and seem proud of it. It’s like something off Fox News or CNN, with humans as the good guys.  Overall, I'd say Galactic Civilizations 3 is an OK game, but Endless Legend, Civilization 4 &amp; 5 are better. If you're bored with the other 4X games and have time on your hands then it’s worth a look. The longer you play, the more issues and bugs you will notice, and the more it will detract from your enjoyment of the game. As it stands, the game feels like it should be in early access, which is a shame given it has been out for around a year now. Stardock do update this game so it will improve over time, and it's slowly approaching a level of polish that I would expect of a game at release. The game definitely has huge potential which I hope will eventually be realised.",
            "review_score": "1"
        },
        {
            "review_text": "Stardock's post launch support has made a good game even better.   It's easier than ever to manage multiple colonies, and spread your particular galactic seed.  Now if only they would let us rename starbases...",
            "review_score": "1"
        },
        {
            "review_text": "Great game that thanks to the dedication of the developers keeps getting better even after release as they contimue to balance, tweak and add features.",
            "review_score": "1"
        },
        {
            "review_text": "Likes &amp; Dislikes:  The designers went to great lengths to make game as all encompassing as possible with lots of features to control and manage. Love that about this game. However, the AI is a dirty little cheater and gets unfair advantages such as more resources and quicker build times of vessels etc etc. Wish the AI had half a brain and was able to come at me with challenging strategy rather than being able to amass vast fleets by cheating. Brillant ship design allows for really flexiable options based on your technology and can be successful on any path of the tech tree.",
            "review_score": "1"
        },
        {
            "review_text": "I can see why many people may not like this game but I love it. No other rts that i have played lets me create units in game right when i need a specified unit. it's core to this game that you make the units to counter your enemies units. My only complaint is that i wish i could start the game in a later technology.",
            "review_score": "1"
        },
        {
            "review_text": "I really like the game. I really don't have anything bad to say about it except. I can have it on beginner and I can still get my butt kicked really bad.... I found a planet that had 311 Building power on Beginner.... it was pumping out ships like crazy.   All in all a good game, if you have played one of these games in the series you won't be disappointed",
            "review_score": "1"
        },
        {
            "review_text": "I maybe doing something wrong but I think not.  I am playing a custom race on the impossible size galaxy. I have something like 85 planets many with 30 tiles. I am prepetually behind on tech and my best planets might produce 100 or so rp with a total of 6k. So, I see a couple of bad guy planets and they have 800+ in research going on and much more industrial and cash than I have. Once I take one of these planets, I get no benefits like this. I also noticed that taking one planet brings in a huge area to my empire not the 14 or so across hex that my planets generate.   I am not sure what the hey is going on.  Update. AI must also be able to spam ships and their fleets always seem to know where mine are.",
            "review_score": "-1"
        },
        {
            "review_text": "Empire building is top notch. Unfortunately for those like myself that enjoy fighting from time to time, the combat amounts to little more than taking two toy spaceships and mashing them together until one breaks.",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is great however it does have a quite a bit of problmems mostly which is multiplayer issues like crashes. however this game is amazing.    8/10 Only reason why i have it down 2 points is because of the mulitplayer issues if they resolve that this game would a 10/10 game",
            "review_score": "1"
        },
        {
            "review_text": "Can't say I do not enjoy the game I have played since beta. Do have some concerns, the game still crashes alot in the insane size map, save often. Ship to ship battle screen is just kind of sad. Look forward to someone doing it better. All in all still a fun turn based game. Good way to kill a few hundred hours. Enjoy",
            "review_score": "1"
        },
        {
            "review_text": "I've loved this series for years and so I got Gal Civ 3 when it first came out. At the time it just did not run well on my computer. Recently I've come back to it and it runs smoothly and is a whole lot of fun. Great work Stardock!",
            "review_score": "1"
        },
        {
            "review_text": "Im very split between if I should advice anyone to buy this game or not. Its one of those you might like or get very irritated by many of the small bugs and odd features it seems to lack. Good news is at the time of writing this its still supported game but the downside is that the DLCs are expenssive for what you get back from it. A bundle on sale maybe is a good solution.   Pros +The ship builder is decent and lets you create a lot of different ships in all shape and sizes. +You can add as many races as you like and play in a huge galaxies. (played on the largest map with 43 AI and it works well). +Tech tree lets you choose different traits in specialization    Cons -Ships change name seemingly randomly when they are upgraded. -When your ships are in a fleet and you want more info on it you have to take it out of the fleet to be able to view it. -No good way to manage starbases besides micromanaging which takes most of your time. If you use the ingame method it will basicly spam down your shipyards as it will build many constructors. -Roles of the ships are defined with the design and can not be modified prior to combat, if you have armed support ships or if you would like to engage with your normal guardians this really sets you up for failure, as they will wait to engage until the ones up front are shot up first. -After the AI turns you will not know if your ships saw any hostile ships inside their sensor range UNLESS you were looking at that spot of the map as the turn went and you didnt blink. This is a huge drawback and has forced me to build huge sensor platforms to actually know whats going on.    Personal preferences I personally would like to see the ships having different modifiers for weapons/defenses vs size, This to better reflect the differences between them. Also adding different docks inside the shipyard to create more ships at the same time. The docks would be different sizes so when you can build a larger class of ships you would need to build a larger dock. Smaller ships should be cheaper(as with their stats being lower). I would like to see the option to build custom tiny fighters to be carried in carrier modules and that could operate to a certain area outside the carrier fleet as well. the modules should have increased capacity but unable to regenerage fighters. Also when upgrading I feel that the way it works now is slightly ridiculous, I think that either there should be a rule that 75% of base parts have to be the same or preferably all modifications inside a shipyard.  I should have written more, but its late and Im sure nobody have read this far ",
            "review_score": "1"
        },
        {
            "review_text": "Just one more turn... Oh it is 3 in the morning and i have to go to work at 7... Great.",
            "review_score": "1"
        },
        {
            "review_text": "I can't stop playing it. It kicks my a$$ every single time, but, I still want to play. 10/10 - I need anger management now.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, loads of depth with the ability to control everything, or just skip over and speed things up.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Sci-Fi and Sid Meiers Civilization this is the game for you! I love the customization options, they really immerse you in the game. Create your own civilization, ships, civ traits, and even upload photos and videos for your totally custom civilization. Ship Designing is my favorite part. I would most definitely recommend this game to anyone who likes Turn Based Strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "I never played the other games so from a newbie perspective this game is great. Tutorial needs a bit of work but there is plenty of vids online. This is still early though so a few things could be worked on but overall very very good game for the money. You will spend at least 10 - 20 hours per game.",
            "review_score": "1"
        },
        {
            "review_text": "Love, love, love this game. Huge Civ fan and thought I'd make the jump to Gal Civ to see if there were similarities to the old Microprose game Star Trek Birth of the Federation.  There were some rough bits at launch but it all got patched really fast and now it runs like a dream 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Having lots of fun. Love that it supports Mods and such.",
            "review_score": "1"
        },
        {
            "review_text": "I'm big fan of Civilization like games. I already spent years playing them. Galactiv civilazations III is outstanding. The tactics are really deep and giving you many options. Unfortunately, I can't advise you to buy this game now. For two reasoms. First, AI. AI in this game is either stupid or very smart, nothing between. Second. Before latest patch released on the end of 2015, there was possibility to govern every planet in means of production, research and so. Kinda crucial feature of civ like games. I don't know why, but this feature was removed by the patch. Now, you can govern your whole empire at once or leave planet governance to AI. I consider this game unplayable now. Do not buy it unless they fix this feature.",
            "review_score": "-1"
        },
        {
            "review_text": "Needs random AI personalities. Good game tho. Looks like the ship customizer is kinda buggy.",
            "review_score": "1"
        },
        {
            "review_text": "Complex and hard. 4x at it's best.",
            "review_score": "1"
        },
        {
            "review_text": "Great 4x game in scifi mode. Takes a long time to master. Each game you play is unique.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game! It can be a bit tough, and it seems like the main way to win is to focus primarily on military might. I prefer a more economic warfare approach, but still overall fun, even when I lose.",
            "review_score": "1"
        },
        {
            "review_text": "Unfortunately, I can't say many true specifics about loving this game. However, it is very good. Two nitpicks- when you name a solar system for your capital, it gets named after your homeworld- Say, for example, the Earth system, containing planets Earth, Earth II (Mars), Earth III (Mercury), Earth IIII, and so on. Also, the biggest map size isn't quite big enough for me, for some reason.",
            "review_score": "1"
        },
        {
            "review_text": "The game has enough depth for the meta gaming micromanangers yes enough click throughs that you can just go on autopilot if you want. The diplomacy interactions are humorous. I have found that single player on the easy settings it's very easy to just crank up Influence and win that way without firing a shot, however not always and sometimes you can get zerged early on. I liked the choices by the AI for your ships when the game was released, after the patches the AI acts kinda stupid with armor/weapon allotment and I'm forced to go to the 'designer' to even things out, which is annoying. Also, some of the ships for the Drengin don't match (you click three different Huge ship hull types and the same exact picture comes up, which is a bug). Have had some issues with the AI hanging up while taking it's turn forcing me to force save and reload, hopefully fixed with future patches. The freigters are so slow you will need to redesign them yourself, again a lot of fiddly stuff in the micro when your should be more worried about the macro.",
            "review_score": "1"
        },
        {
            "review_text": "Still has some bugs. But not bad. Has a lot of potential. Ship options for construction could use some streamlining as it can get pretty confusing. UI isn't bad, but could use some tweaking. AI seems hellbent on going to war no matter what you do or say.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game but I do miss a longer storyline campaign like in the 1 and 2",
            "review_score": "1"
        },
        {
            "review_text": "Turn based space strategy game that has good quality graphics for the different factions involved. The custom designer for your own ship models could use some better tool aids and be more user friendly. I enjoy the games and have tried out the campaign but the AI for your opposing factions seem to be overwhelming even on the beginner settings as very quickly one faction had control of 75 percent of the map.",
            "review_score": "1"
        },
        {
            "review_text": "This franchise keeps getting better and better. The feature to request constructors from starbases single handedly makes the monster size maps viable for the non-OCD.",
            "review_score": "1"
        },
        {
            "review_text": "I tried ot really like it, I really did. The game is good, yes, everything seems to be fine. But the AI is so overpowered it's redicilous. Even on beginner dificulty, thier production levels are through the roof. they quickly build fleets of ships before you even start your own. They get larger ships quicker as well.   The game needs to be balanced more, in my opinion. Otherwise it's a great game. The AI needs a second look though, as I find myself not enjoying the game with teh AI as powerful as they are (at beginner, at that.)  As of now, I can not recommend this game. I do hope this changes in the future.",
            "review_score": "-1"
        },
        {
            "review_text": "Great part 3 of the franchise, so if you liked the first 2, you'll like this. GalCiv is kind of like Sid Meier's Civlization in space, but done right. Unlike Sins of a Solar Empire, the military is run more at the strategic level rather than the ship level, so if you like micro-managing your ships, you would like Sins better.  But if you like 4x on a massive scale with a space theme, GalCiv3 is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game back when Galactic Civ first came out. Basic play was enjoyable then as it is now. Ives peen about 40 hours in this version of the game. – That is the Good!  The BAD! The mechanics of play are pretty much the same as they were in the mid-90s. This means the game is pretty primitive by today’s standards. They have mostly just dug out the old game and added 21st century graphics. Graphics are nice for the first few hours but you spend most of your play at that old 20th century graphics level  Tactical combat is nothing more than a 70’s style arcade rendition of a coin-video console with combat odds resolution. PRIMITIVE!  Many of the games concepts are poorly developed (wormholes), diplomacy, tech tree, planetary development etc – none of which have progressed much past the mid-90’s  In short the reduced price of $25 is pushing it.  The game needs a lot of work- far more than is likely.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game seems good, but it's lost alot of content from GC2; also if you have a HDMI cable connected to a T.V. this game will not work on it.  The devs have no idea what they broke, and have no fix or workaround. For whatever reason the game scales outside of it's window (Both fullscreen and windowed) you'll only see the leftmost 1/2 or 3/4 of the game. Absolutely ridiculous.",
            "review_score": "-1"
        },
        {
            "review_text": "I am a big fan of the Civilization franchise, and of the Master Of Orion games (old school). This game reminds me of both. I am new to this series, and I want to say I look forward to the next game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awful. From the buggy and poor UI to the souless gameplay. This game is no good. Portions of the game that should be entertaining, such as ship design and planet management, are nothing more than tedious and uninspiring.   Dealing with the AI is the same during any playthrough due to little to no dipomacy options and poor intelligence.   Many issues that caused me to give up playing after the day one purchase are still rampant and no progress in gameplay has seemed to have taken place. Leaving me to believe the game support has been lacking since release and I doubt I'll install this again.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is awesome. I've been very impressed. I've been it once on normal mode. I haven't learned all the things you can do yet but I'm working on it.",
            "review_score": "1"
        },
        {
            "review_text": "Lacks intuitive GUI, so starting out amounts to reading the rules rather than playing them. Reading rules was fun in the early 1990s. It is not the 1990s.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is amazing! It reminds me so much of the glory days of Master of Orion 2! It is worth every penny you will spend on it. I also highly recommend that you check out Angry Joe's review on YouTube. After seeing that review and gameplay, I purchased the game and have been loving it!",
            "review_score": "1"
        },
        {
            "review_text": "Finally a 4X game with really HUGE map.  Absolutely worth to buy it.",
            "review_score": "1"
        },
        {
            "review_text": "There are too many bugs in this game. Selling a buggy Beta Game for 45€ is the way how Stardock is making money? I dont think this should be supported by Steam.",
            "review_score": "-1"
        },
        {
            "review_text": "it is too much like GalCiv 2 ",
            "review_score": "-1"
        },
        {
            "review_text": "Okay... So i know i don't have much playtime to this game yet. But that is only because of one simple reason.... The game won't start. It keeps crashing on me, right after the intro. I bought the game, and installed it, started it up. Got into the game on looked around the options menu a bit and twisted a knob here and there, then i restarted the game as it wanted. and the it started crashing. So i searched the interwebs, for a solution, which i found. So i deleted everything GC3 on my computer as it suggested. This and a new install of the game, got me into the game again, and this time i started the tutorial, and it was great, loved it. Then the dang sleepy eyes kicked in, and off to bed i went. Then i woke up this morning, and wanted to play again, but dangit it started crashing again. Therefor until that is fixed i am unfortunatly gonna give it a thumbs down.",
            "review_score": "-1"
        },
        {
            "review_text": "I have tried to play this game for the past week trying everything I could from you tube videos to following every steam support guide to get this game to work. all it tells me is Failed to Start Game (Missing Executable).",
            "review_score": "-1"
        },
        {
            "review_text": "I'm a huge fan of the civilization franchise and have been playing it for years. CIV5 remains the best! GCiv3 is a disapointment. The game launches and leaves you on your own to figure out the mechanics. There are no manuals or in-game help files. The technology tree is overbloated and again leaves you guessing what they mean. After a few days, you will realize that just about the only strategy is to rush early on empty planets and that pretty much locks the game. I have uninstalled the game on day 4 and wished I could get a refund :(  This game is not worth the high price - you are clearly paying for the name and nothing else.",
            "review_score": "-1"
        },
        {
            "review_text": "Galactic Civ III is a clunky memory hog with no in game help system. You get all sorts of icons and no info on what the blips mean. It is a robust game and I hope it will get patched into awesomeness. But right now I am unhappy I spent $50 for it. The game play is similar to MOO but not as fluid. The diplomacy options are very limited. The design system looks amazing but there is no info on how to use it. The reporting is really good. The tutorial really poor.   I was hoping for a game to be the game that Civ V Beyond earth was meant to be and missed.... I am still looking.",
            "review_score": "-1"
        },
        {
            "review_text": "its kinda like civ: BE minus the price tag and blatant copy paste from civ 5 (but in space this time), from your humble start you have total control, wanna play nice use flower power to subdue your foes, or will you become space hitler and create your perfect galactic master race, its totally up to you. many unique features -ship designer-hours of fun to create whatever you desire and theres generally no limits to what you can create (no EA fun limits here) -no censor- most aaa games will now censor everything you do but you can name almost everything whatever you want. -mod haven- -ships can have what looks like a giant weiner on them that 'shoots'- -isnt designed by aaa companies- -as of current excellent developer feedback-  cons. combat is a bit weak and slightly boring  can be confusing sometimes not designed for lower spec PC (this game uses more resources than BF4 on OCD lvl) N.B my pc runs this with 3,9 gig (yes its old) slightly unbalanced on some aspects (especially morale in large empires) micromanagement nightmare ^ ^ ^ turns become very long very quickly micromanagement nightmare ^ I do NOT recommend this game for those with OCD or those who believe in perfection",
            "review_score": "1"
        },
        {
            "review_text": "Having some sort of guide or encyclopedia to help you know how things work in the game would be very nice. There is also no online guide anywhere to help you understand game mechanics. I enjoy the game but this is very aggravating.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good 4x Space game. It's similar to Galactic Civilization 2, but updated. Gal. Civ. 2 was a great game, so there was no reason or need to revamp the entire game.   I look forward to the DLCs.",
            "review_score": "1"
        },
        {
            "review_text": "Best spaced-based strategy game now gets even bigger and better in the 4X 64-bit world of today. I played GC2 quite alot, but am even more impressed witht the size and scope Stardock has made for its 3rd installment of the series. Layers of details and posibilities, genormous maps and customization of ships as vast as spce! So glad to see this title as it evolved from Beta to now and eager for all the add-ons and ehanceements to come, it already has proven itself all over again! Worthy of the name 'best strategy title' FOREVER!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty great game, I played Gciv2 when I was younger, and I binged on it again before deciding to buy number 3.   Took me a while to fully adjust myself to it, but it's pretty good.   They changed the leaders around a bit, Yor still look as awesome as before with their new bodies, Terrans leader is so much better looking the previous one in the steam version.   Alterians look weird and dislikeable as usual, even more so now.   Kyrnn looks ugly now though, and I dislike how hostile they are, as compared to being neutral in the second game.   I can't quite get a grasp on trade routes, being used to simply sending a ship to another planet and then getting money.   I hope they continue to add more of the old races.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot overstate how much I've enjoyed making spaceships in Galactic Civilizations III.",
            "review_score": "1"
        },
        {
            "review_text": "awesome!!! suck hours of my sleep",
            "review_score": "1"
        },
        {
            "review_text": "I used to have a job, and a family. Now, I don't! Thanks, GC3!",
            "review_score": "1"
        },
        {
            "review_text": "I don't have the fastest computer but its better than the minimum and the game keeps on crashing. Beware if you try to run it with low system specs.",
            "review_score": "-1"
        },
        {
            "review_text": "I have absolutely no idea what I'm doing and I love it. ",
            "review_score": "1"
        },
        {
            "review_text": "I seriously do not feel much difference between this and Galciv II.  Thanks for the nostalgia, though.",
            "review_score": "1"
        },
        {
            "review_text": "I have had a bunch of fun with this game.",
            "review_score": "1"
        },
        {
            "review_text": "A bit too much on the UI, also there is a need to organized the shipyard by sizes of the ships and all that. There are so many bugs that need to be fixed. Let's say that the Snathi Slave pits use Dregnin tech when you research it. Also when i play the Civ that has drones protecting them as their trait everytime i get attacked the whole game becomes the enemy attacking my planets and i keep hitting quick battle which is obnoxious. Some words are mispelled like 'hone world' when i get agressive ideology points... Please impove the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is missing something, it feels unfinished and predictible. DLCs for £50 is bit insane, maybe once the DLCs are on sale i will give it another try.",
            "review_score": "-1"
        },
        {
            "review_text": "After playing several Games like Oblivion, Fallout-3, Skyrim, and Planetside-2, Galactic Civilizations III, is a completly different kind of game. I have not played a Turn based game sence the mid 1990s. I played for 4 hours, and I was unaware of anything going on around me, this is that kind of a compelling game. I did need to read the Player Guide to get started, and I need to read some more, so I can figure out how to do some more things in this complicated game. I will play tommorow, and learn some more. I recomend this game to anybody that wants a new kind of game challenge. Mr. K",
            "review_score": "1"
        },
        {
            "review_text": "Won't change your life, but it is good to kill some time. The highlights are designing your own ships and your own factions. Give it a few games before you make a decision. The tech tree takes a while to get used to.",
            "review_score": "1"
        },
        {
            "review_text": "They turned this game into a DLC delivery device. If you have GalCiv2, avoid this.",
            "review_score": "-1"
        },
        {
            "review_text": "Like the game very much. Wish there were more discussion options with the other races.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah its alright",
            "review_score": "1"
        },
        {
            "review_text": "Good game but overpriced and some of the DLC should be in the original game.",
            "review_score": "-1"
        },
        {
            "review_text": "A very fun and addicting game with enough functions to make planetary specialization be important but not carved in stone. Just because a planet is research-primary does not mean you can't shave off an extra turn on that all-so-important colony ship by concentrating the local populace on manufacturing. Very well done! The ship designer utility is not a vanity tool. There are vanity points in it, but in harder difficulties you need to design ships to defeat the enemy(s) you are fighting against. Drengin like rockets. Prepare your ships under contruction to deal with that and your enemy will be hard pressed to resist your 'influence'.  The only gripes I have are:  1. The galaxy is weirdly unrealistic. Although, if it was realistic, antimatter would be even harder to find:/ 2. That mini-map... Its functional, but very small colored dots showing my planets/fleets don't show up too well when showing my zone of control. A slight bother, but not too bad.",
            "review_score": "1"
        },
        {
            "review_text": "1. Galactic Civilizations III:  2. Too long, don't want to read: Very good gameplay and graphics. Needs more features like Civ V.  3. Sustains:  a. GC3 has excellent graphics and smaller maps perform well even on lower end computers  b. For the computers that can handle it, the largest maps are truly epic in scale and among the largest I've seen amongst this genre of games  c. Designing and updating custom ships is interactive and quite fun  d. Trade and diplomacy is simple  e. Interface is intuitive and very easy to slide into if you've played similar games  f. Hours of good and challenging gameplay  4. Improvements:  a. Soundtrack can get repetitive very quickly as it seems to be one or two long songs on loop and gameplay fills many hours  b. Diplomacy in my opinion is broken in almost every game in this genre  (a). The AI often displays characteristic irrational decision-making regardless of strategy  (b). Trading is almost always one sided favoring the computer. The only fair deal you'll get are open borders or with an ally and if you've boosted diplomacy skills like crazy  c. Lack of a world builder  (a). You can purchase a map editor with a $5 DLC. Unacceptable.  (b). The map editor lacks the developer tools to be able to create scenarios. Unacceptable.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game; however, I would like the story mode was longer",
            "review_score": "1"
        },
        {
            "review_text": "Good game, similar to Gal Civ 2 but more update with a few new races and better graphics, only downside is the overall lack of campaigns, the ones that exist are good but I prefer campaigns over multiplayers and npc battles",
            "review_score": "1"
        },
        {
            "review_text": "Good game in the Masters of Orion type of management builder style...",
            "review_score": "1"
        },
        {
            "review_text": "Good game! As always the ship designer, tech tree, and general look and feel of the game are great. The campain was much too short and really does not develop the story at all.",
            "review_score": "1"
        },
        {
            "review_text": "I really expected more, and I really hate to say that about a good franchise, but they missed an opportunity here.  1. Combat should of been more skill based. As it is, its basically a rng cenimatic. This leads to two 2. Numbers determines victory. At every stage of the game weither its planets or research, or the aformention combat.  You simply cant get behind or you lose. Very little in the way of tactics or mistakes can be made. Also, the wrong event can spell utter defeat for your empire. Where in say SD 2 or SoaSE you can actualy command your ships in combat, being able to use battlefield strategies to overcome a more powerful foe. In this game, who ever has more wins. Kinda like old civilizations IV except everyone dies in the combat as there is very little in the way of withdraw. At least in games like Endless Space you could use abilites or cards to change things up. That made combat more interesting and thematic. Gal. Civ III, i dont even care about combat i just do the auto resolve as I already know what the outcome will be. Very boring.  3. Its the same game as Gal. Civ. II. I know they improved some features like techtree, better graphics, and diplomacy, but once you are over the large customization of creation, you are basically playing the same game. Once again a missed opportunity. Its not like people said they didnt want more tactical combat. Its not like people didnt want More intersting invasions and such. They just took the easy way out and copied several parts of the game.   TL/DR: There are some nice things about this game, but they are the same things that were nice in the same quatities as their previous title. Boring and bland now, they try to make the same game.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoy grand strategy games, I enjoyed this one very much, on my first playthrough. Then the frustration and anger came! Why did they give me the tools to create custom races and ships but then neglect to add the button that combines the two? I've seen how it's done. You can do it yourself, if you take hours and hours to go through the game's code and actually force the game to acknowledge the ships that you've added. They could have scripted the option to create a custom fleet, themselves, without too much extra effort. If I do all that coding for them, in order to enjoy their game and partake of it's replayability, then I will have ruined the fun. Please finish your game Stardock, and realize it's potential. I find it maddening that you're releasing DLC, when the custom ships and custom races still can't be combined. OMG! Has nobody on the development team noticed the irony, here? Can't see the forest for the trees? K THX BYE",
            "review_score": "-1"
        },
        {
            "review_text": "Seems to be the same game as the last two only bigger. Is it worth it for me to spend the time to see if there is any difference? Please comment if you think so, because I paid for it.",
            "review_score": "-1"
        },
        {
            "review_text": "Galactic Civ 1 and 2 always felt very Solar Civ to me, especially compared to older Amiga X4 games of this type or even the Windows 95 Stars! game. But Galactic Civilization 3 finally lives up its name by offering a game that feels like a Galaxy at war.   Of course, there are issues linked to larger galactic maps and factions that are currently being resolved that did not exist on smaller maps. Stardock is fixing these issues very quickly so I do not expect them to remain a problem for long.  Over all I have to rate this as the most enjoyable X4 game since Civilization 4 and one of the deepest since Civilization 4 too.   Most of the X4 Civilization 5 clones are dumped down and simplified, they got old fast and simply back depth or backbone. I own most of the ones from the past few years and none of them can be described as even remotely exciting. Just the same old, same old....   Galactic Civ 3 is a return to old School X4 gaming, one of the few x4 games worth owning from the recent past.",
            "review_score": "1"
        },
        {
            "review_text": "The love of my life..... I really wish you could create more of those planet entering scenes where you can choose option a b or c. If those were in the workshop the game would have an infinite lifespan!!",
            "review_score": "1"
        },
        {
            "review_text": "As a long lover of GC2 ultimate edition I've been keeping an eye on the new installment. IS IT OUT OF BETA though it feels like buying Rome total war 2 all over again. 5 LOADS and Reeboots later I had made it past the opening and was in the game menu considering I run Attila tw and Rome 2 didn't think this game would be as much of a problem. I have a medium powered laptop so maybe I will appreciate this game more when I can do immense maps. I understand they continued the storyline from GC2 but no more Torians and Arceans in sandbox mode was a bit sad and no Drath the bane of GC2 who always seem to find a super powered Precursor artifact and become giants I enjoy grinding down, thats when I decide to give the others a chance and not include the Thalon in my GC2 games. Anyway GC2 rant can be left for GC2 this is GC3 and its a whole new ball game.  So after I finally started the campaign after my 5th try thank god. It running a bit smoother now. BUT although it has a similar feel (refering back to Rome 2) it seems like this game is really buggy After my colonies are fully built it won't let me end turn because they are idle I sense the streamlining That iniatially annoyed me in Rome 2 as well as GC2 you never had this. Graphics are better I can only run a Gigantic map though as that is what my current laptop is capable to do suprisingly as sins of a solar empire has far more detail and runs smoothly in enormous maps. Anyway different game not the biggest fan of how you research and manage colonies maybe being a bit nostalgic to GC2 and thinking the had it right the first time and I think I will look at this game as an investment I got it in a sale. I will wait for them to finish the bugs and also complete the campaign in GC2 first so I know why they killed of some awesome races and replaced them with a banking race. I'm more into the sandbox side of the game build an empire compete with normally the Thalons for technological supremacy as I play terran also you no longer can add in bonus traits or am I just missing the option?   Anyway to conclude good effort seems like they released a bit to early or I need a new a super powered laptop to play (I must play the biggest map otherwise you don't get the feel of really dominating a galaxy) I am liking that they can have like 100+ factions in a game, will just have to power through like in total war get use to the changes and hopefully WHEN it loads faster and plays a bit smoother and will let me end a turn without having to destroy a building and remake it I will replay it for now it's going to sit in my Library for a while till I upgrade laptops give them a year to basically fix the game, also took me a while to work out you no longer build starbases on the planets and they are in space and can be blown up mixed feelings on this, anyway see you in like a year GC3!",
            "review_score": "-1"
        },
        {
            "review_text": "I've played several hours, I recommend this game. Two reasons, such a great range of variations on the ships and a lot of different races with several ways to play. I can be a race who starts off benevolent but decides to have a change of heart, a la Anakin Skywalker style.... It's fun replaying and deciding to go at it a different way. The tactical curve is sharp and I do wish they had a more customizable planet governer, IE one you can customize for the majority of your worlds that can specialize in whatever you need, other than that, highly recommend to space strategists.",
            "review_score": "1"
        },
        {
            "review_text": "Good game - Played both old galcivs in the past so if you know them you can jump right in and know what you are doing. The AI will need a bit of tweaking especially in diplomacy but its going in an excellent direction. Other similar 4x games that I liked: Distant Worlds and Endless Space. Great era for 4x games right now!",
            "review_score": "1"
        },
        {
            "review_text": "awesome turn based strategy",
            "review_score": "1"
        },
        {
            "review_text": "It shouldn't be 'released' yet. It should still be in Alpha. Traditionally alphas are for bringing in new features (which they claim to still be doing), and 'released' means that the game is complete. DLC, and Expansions excluded. Since these features were promised as part of the main game, they should not be considered DLC, or Expansions, and thus not excluded. The game is not complete until all the features they promised are in the game.  However, even if the above weren't true, there are other downsides. The Devs don't take kindly to any sort of criticism, and are blindly and zealously defended by their fans (I am a fan of the series, but I can also tell when they half ♥♥♥ a game). And the game itself is simply bland.  I am posting this review because I'm tired of arguing with blind zealots about this. This is what I say about the game. Don't buy it unless it's really cheap, or they've finished the game, and made it interesting. Don't go on the forums because they're full of blind zealots. If you want to argue with me about this, block me instead, because that's what I'm going to do to you from this point on.  Edit: And the DLC? What a joke. Map pack? You can make your own maps! Mega Events? That should have been in the base game! The Snathi one, fine. The Soundtrack one? Fine. I don't buy Soundtracks. And that's pretty cheap for an expansion. But the other two are ridiculous.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like the Gal Civ series, you'll love GC III. I'm a 4x junkie and with under 10 hours in so far, GC III is already becoming a favorite 4x game of mine. If they add planet governors, I might never fire up another 4x game for quite some time. :) It's easy enough to get into, yet as much micro as you want it to be. The great thing is Stardock is always active in their forums and have already rolled out a patch. It's only going to get even better. If you like 4x space games, I don't think you'll be disappointed with GC III.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent 4x fun. Well made, great gameplay flow. Exceptional customisation.",
            "review_score": "1"
        },
        {
            "review_text": "CIV is SPAAAACE! That is what i would describe Galciv III, and if building huge sprawling empires and the attendant self narrated space opera that comes with it, this is your cup of tea, and more. Large tech trees, random pick me ups in space, culture, warfare, science, it's all here. BUT! if you are the impatient sort and want things to go down the RTS way, this might not be your cup of tea, as the turn based management can be rather long and tedious mid game. Either way, it is a good iteration of the Galciv franchise, and IMHO, a worthy successor to the game's lineage.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so far from complete it is ridiculous. I recommend to anyone considering the game, please wait until at least the first DLC is released or until modders have had a chance to fully development at least a few major mods.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a bit early on but Right now i think it was worth the $37 i payed for it. Only 5 hours into actual gameplay but it has a nice feel. Some of the mechanics i still do not understand but like any strategy game, there are always learning curves. Will get back to you all soon with a more updated review but for its current state I do feel it was worth the money I spent with me wanting to go back and play some more.  Cheers!",
            "review_score": "1"
        },
        {
            "review_text": "What can I say about it? For me it's a very nice game as it's the first time I play a Galactic Civilizations game. Pros: -Great graphics -Giant tech tree -Custom races -Custom game settings -Designer -Interesting gameplay Cons: -AI aren't very smart -Sometimes bugs occur -Ideal price would be 35€ instead of 45€ (The game is new, so it's ok, but I hope they will make it cheaper soon). If you like the gender then I reccomend it to you. Vote: 8,5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Don't waste your money here, CIV V + main DLC is a far better game. The only thing this game has going for it is its ship editor where you can design your own fleet.",
            "review_score": "-1"
        },
        {
            "review_text": "After playing for many hours, I can honestly recommend this game. Its an improvement over galactic civ 2, which was also a good game.  Note that if you like to control the ships in battles, this version only does quick battles that you don't control, unlike galactic civ 2. For the most part I did not control the fights in Gal Civ 2, so don't miss it in this upgraded version.  If you like 4x turn based strategy games, this is a must have for any true gamer.",
            "review_score": "1"
        },
        {
            "review_text": "GalCiv III is an excellent continuation of the franchise! With continued improvements and DLC/Packs this game by far already beats Civ hands down!",
            "review_score": "1"
        },
        {
            "review_text": "One of the better games I've played in years.  This wasn't the first 4x game I've ever played, but it is the first that made me see why the niche is so popular. I'm into RTS games, but honestly, this is one of the best games I have in general.   It has a story which unfolds the more and more you dive in and do research, both from in game speacies descriptions to googling at 4 AM the histories of previous games and speacies yet to be added,  The dev team is active, posting on forums and such, even from the CEO himself!   This is a game for strategy fans by strategy fans. While the game has a lot it can improve on, the dev team is getting there spectacularly.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay on this game is in my opinion the absolute best of this genre of games.",
            "review_score": "1"
        },
        {
            "review_text": "Painfully slow... and for others who like tactical battle games, this is not the right game for you (like endless space but smaller scale with no choices). I made a mistake buying it even on sale! Games like this need to let you start both sides with higher technology and money to make the pace faster. I built custom game and played with all options speeding things up, still way too boring. The weapon development on the ships is way too slow - the game might be over before get there. If you like pure economic games then you might like this game, the visuals are good, the battle visuals are very good (watching a movie). Once again, another 4x game where the strategy is just find as many planets as possible and use that math to win. I think the problem is with most of the recent 4x games they are being designed for multiplayer so single player gives huge advantage to AI to expand much faster than you can. One very good thing is they did opening develop a console cheat so you can give yourself more money and technology to balance the game if you want or just make a nice battleship and quickly kill everyone on the board. Just be sure to put shortcut on desktop with the last word being cheat in the path or the console will not open during gameplay. The ratio of fun to boring is about 1/10 for me. This game has been a lot of hype for very little fun! Oh yea, when you build military starbased they do nothing.... enemy went by them all the time with no action taking place - don't waste your points on them. They also need a way to skip the shipyard when you do not want to build anymore..... another helpful hint, keep you left hand on tab and Q, so can quickly go through turns when you do not want to take specific actions.... later in game you find yourself just hitting tab over and over again.... yea, that is about how exciting it gets! Again the plus, the battles are kind of fun to watch, but find lot of work to get to that stage! I would not buy this game, wait for a better game in next few months (I keep forgetting, when steam puts something at 1/2 price there is usually a reason for that - and do not trust all the +ratings - companies know to come here and hype their games).",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know if the makers of CIV could do a better job in creating the scale of galactic civilization building that is within this game. With so many paths to victory, and ways to play this is not a game that you can simply go through once. I love how the team is constantly improving it, and adding new features that increase the degree of challenges, and options that make this game so very enjoyable. This game has numerous customization options, and it is amazing to design your own ship but I wish the process was simplified a bit more for the sake of time.    On a personal note, I wish that they would add some kind of battle animation for the planetary invasions (I know this is primary a space based game but it would look really cool) Overall I have no regrets purchasing this game.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME. I haven't played it for awhile but that's not the games fault, just life got in the way. Anyway here's my review. When I played this game before it had a few typos here and there, rare to see, but probably gone now. Great strategy game, you get to customize your race using your imagination. And it balances your custom race so it can't be OP either. The only thing I could ask for is to bring back Terror Stars, or get something that is as destructive as it. I think they replaced the Terror Star idea with carriers, but to me, carriers is just another war ship. In the old game Terror Stars were my goal as I wanted to destroy my enemies without having to worry about approval problems. And I just remembered, I hate how there are Large Empire penalties to your approval, I feel there has to be a penalty for being so big, but the way they did it I could hardly get myself out of the hole of a saddened empire. Now remember I said I haven't played the game in awhile, maybe it changed.",
            "review_score": "1"
        },
        {
            "review_text": "Some great touches make this greatly replayable.  The ship designer is brilliant, letting you create and name ships throughout the game that you can easily modify as you develop tech. The tech specialisations are a great way of letting you try out new combos that work with whatever race you have chosen or created.  A great entry to the 4X genre.",
            "review_score": "1"
        },
        {
            "review_text": "Galactic Civ 3 is clearly a game made by gamers for gamers. The game utilizes a solid well-designed engine that provides strategic and tactical turned based game play. Players build a space empire from among 100's of worlds in galaxies that can contain 1000's of star systems and expand their empire as the game progresses. There are many game options when beginning game such as custom factions, custtomizable galaxies, customizable rules and the player can select the number and difficulty of the AI factions. Multi-player play has been implemented for the 1st time in Galactic Civ history and though there are still some bugs to be worked out with multi-player play, overall, it is relatively solid. The size of the galaxy is chosen be the player and this can lead to short games of only a few hours to long games lasting weeks or even months. One relatively unique feature of Galactic Civ 3 is that the games development team is very active and very concerned with the success of the game and the enjoyment of the players. Unlike nearly any other game out there, this DEV Team cares about your experience and they want this game to be the best that it can be. They have steadily patched every issue that has been brought to their attention and they actively pursue and new bugs that may arise. Overall I would give GC3 a rating of 9 out of 10 for its game play and the quality of the technical support and development team. When they get the AI working at par and iron out the last few major bugs, GC3 may supplant Masters of Orion 2 as the definitive Space Empire game of all time.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and fun.",
            "review_score": "1"
        },
        {
            "review_text": "this latest iteration on the galciv formula is the best yet  if ur looking for a scifi Civilization with a sense of humor (angry killer squirrals from outspace) this is the game for u ",
            "review_score": "1"
        },
        {
            "review_text": "Interesting and fun.",
            "review_score": "1"
        },
        {
            "review_text": "its worth selling your child for",
            "review_score": "1"
        },
        {
            "review_text": "As a longtime fan of GCiv franchise I was hooked on being the Founder for GC3 and I really enjoyed seeing the product take shape. I never once regretted it as with some other games that took my money and then sub-performed. I like the new game mechanics, the scarce resources mechanics and increased use of star bases, the new civs. I recommend this to anyone looking for a good turn based strategy.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game particularly if you like personalizing and/or modding a game. Graphics are a bit weak but it is a turn based strategy game, not a first person role playing game.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game. A sandbox map where you can create your own universe. I am looking foward to dlc content, and more civilizations the creators can make. Also love the fact that the player can create the own civs.",
            "review_score": "1"
        },
        {
            "review_text": "Civ in Space",
            "review_score": "1"
        },
        {
            "review_text": "Hi All  This game is for more chilled out gamers, who want to build and develop over long periods of time whilst perfecting your own strategy.   I fully recommend Gal Civ 3 to anyone who likes that kind of game.  Really great job on this one guys and I look forward to any future DLC you may develop.  Kind Regards,  Nick",
            "review_score": "1"
        },
        {
            "review_text": "Hours and hours of replayable space-faring fun. Played GC II 2 years ago and got hooked. The graphics are refreshed, diplomacy and trading rules are different, and still ridiculous amounts of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Sweet Awesomeness Brewed Fresh !!!! This game is just that great.  ",
            "review_score": "1"
        },
        {
            "review_text": "Giant maps, space battles, genocide against your allies when they let the Thalan go right to your planets through their territory, what's not to love? Miss the terrorstars tho.",
            "review_score": "1"
        },
        {
            "review_text": "Good 4x, AI can play out similar. Dipolmancy is bleh. Had a game going pure good, and another 'Pure good' Civ. Egg me on to a holy war with another 'Pure good (Minor)'. And rocked a nice debuff to diplomacy for the rest of the game. Twice!!! Going Evil and militarisic the game offers plenty of engineering(More in near expansions, Terror Stars &lt;3!!!!), and cultural victory points. With a team victory, I know it's a minor thing to add, but alot of 4x don't allow team victories...",
            "review_score": "1"
        },
        {
            "review_text": "It has enough things going for it that I am still playing it. That is the only true measure of a game. Besides...The Alignment/Faction blurbs when you colonize a planet are hilarious.  Continue to amuse me puny mortals of Stardock and I will keep buying your games... for now.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game, tons of replayability 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I play this game way too much. It is good, and it has that special something that makes you want to keep playing. One more turn....   I would recommend it to anyone who wants to get addicted to a game.",
            "review_score": "1"
        },
        {
            "review_text": "i like this game but it can take a while. i cant wait to see what exspansions they come out with. more pictures for races would be a good thing. even a map that has stars equally at distance like a go board would be interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Very good deep game with lots o ways to get to the finish line",
            "review_score": "1"
        },
        {
            "review_text": "Great game",
            "review_score": "1"
        },
        {
            "review_text": "It has enough things going for it that I am still playing it. That is the only true measure of a game. Besides...The Alignment/Faction blurbs when you colonize a planet are hilarious.  Continue to amuse me puny mortals of Stardock and I will keep buying your games... for now.",
            "review_score": "1"
        },
        {
            "review_text": "Good space strategy.   Simple, but interesting economic and scientific models.  Nice events and diplomacy. However, space battles are awful - it's just video, no control, no realistic behaviour, only stupid close fight.  Annoying bugs with production queue. And idiotic logic with building. If your planet have 30 production points and you need only 1 point for finishing of building, all 30 points will be spent for this 1 building. It's first strategy, where builders are so lazy :D  7/10 - It can be better, but I don't believe they will fix this problems.",
            "review_score": "1"
        },
        {
            "review_text": "birth of the federation",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad experience. Be prepared to commit -- -- -- hours of fun from each game, and tha is an understatemennt, not an exageratin.",
            "review_score": "1"
        },
        {
            "review_text": "Well, to keep this brief. If you're familiar with Gal Civ II and Dread Lords then you are well aware that there is no flexibility for play styles because of the lack of AI variability. So don't plan on economic gains, don't try to out research, don't think about out influencing or going isolationist. You need to go flat manufacturing and military production or you cannot keep up. Everything that irritated me in it's prior incarnations they have made even more glaring in this edition. It is a real shame that with so few 4X space strategy games exist, it would be nice to have a comprehensive one that doesn't put you to sleep like MoO3 did. Maybe I'll play a few more rounds of Star Drive.",
            "review_score": "-1"
        },
        {
            "review_text": "  Here's what you need to know for the sale. Is it better than gal civ 2? In my opinion, yes. It had a rocky start, but it's a lot more streamlined (in a really good way, starbases can have automated constructors. pick what upgrades you want on a starbase and the nearest shipyard will produce and send constructors) The ideology system will remind you of civ v's culture system, but with a lot more tricky choices and a lot less 'I pick x because y is bad'. The game also has a lot more feedback about victory conditions, so you don't lose to a surprise science victory etc.  Galactic Civilizations 3 is great. The only downside is the AI is bad at optimizing their planet layouts (Which ties in to another feature I really enjoy, the adjacency bonuses). Still one of the strongest and most atmospheric 4x games on the market.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Its just an update of Galactic Civilizations. Wait until its on Sale for what it really worth.",
            "review_score": "-1"
        },
        {
            "review_text": "Unfinished, buggy as all hell, no real improvement over Gal Civ 2, don't waste your money.",
            "review_score": "-1"
        },
        {
            "review_text": "After a few months the game stoped working. Iv tryed next to everything to get it to play again. Not sure why this happened?",
            "review_score": "-1"
        },
        {
            "review_text": "The Galactic Civilisations games are one I keep coming back to time and time again. Like other 4X Pillars such as Space Empires &amp; MOO, GalCiv has provided me with 100s of hours of entertainment and challenge. GalCiv3 is no different, pre-launch I was at 85 hours played.  Specifically about GalCiv3, AI work, Graphics Changes, Combat animations and the implementation of Strategic Resources have changed the feel in a positive way.  *Single player campaign *Custom games  * Stupidly large maps * Custom races * Multiplayer (Both synchronous and a-synchronous)  The developers are very responsive to the community and balance, bugs and other issues are quashed with their regular well communicated updates.  10/10 Would conquer the galaxy again. ",
            "review_score": "1"
        },
        {
            "review_text": "It really is awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Gotta start by saying - Definitely worth every penny! So far at 24hrs played and still have barely scratched the surface for this game! Love the ship building tools, the massive galaxy, the diversity of races and ships, and the absolutely stunning graphics. Hands down, best game I've played so far.",
            "review_score": "1"
        },
        {
            "review_text": "this.... this is f*cking amazing! i have no other words for it. Holy ♥♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "basically better than gal civ 2 in every possible way and gal civ 2 owned so many bones",
            "review_score": "1"
        },
        {
            "review_text": "I really want to play this game, it looks great, but it freezes every 5 or so turns even though my computer meets all the recommended specs. This game needs a patch before I will be able to play it:(",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this game when it was first released and ended up having to make a return after spending over 6 hours trouble shooting it to get it to just simply load. It unfortunately never did, even after me sending a full troublenshooting report and Error log to Stardock. Now here it is months later and issues are still not resolved. I read the patch notes and updates and players are still complaining of the same issues they had on release.   -Constant CTD's, with no error, or reason presented from the game engine. -Systems that meet or exceed system requirments (by hefty amounts) still crashing for no reason. -Memory issues, and save corruptions of larger games. -Failures to load or endless loading -Stuck processes, or things just don't work. -Constant Bug Fixes, but new bugs take there place.  The list goes on and on, and on...   The sad thing is I love GC2, and want to love GC3, however everytime I check the status things appear to be getting worse rather than better. I read comments of the patch notes and updates and its filled with crashes and people who would just like to keep the game running stable but can't.  These issues are game engine and development stability issues, not your PC.  When every other game in Our libraries plays flawlessly, and your game won't even get to the loading Screen thats on your code, not our PC's.  Stardock I don't know what happened here but this constant trend of releasing half QA'd Turd's has got to stop. Stop using paying players as your crash test dummies. Stop Releasing not even 'beta test' worthy titles as AAA games and then siphoning more money from players with Shotty DLC that should be included in the original games to begin with.  AND FOR THE LOVE OF SOFTWARE&gt; Please Fix your game before you try to sell DLC for it, because that really means your priorities are mixed up and makes you look like you have shady business practices.",
            "review_score": "-1"
        },
        {
            "review_text": "Really great.",
            "review_score": "1"
        },
        {
            "review_text": "Can't recommend the game at the current state. Many bugs so far. And one thing, if you want to design your own ships, don't do it. They will look like a mess on the map and your work will be for nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, but the 'Wait' hang bug definately needs to be fixed",
            "review_score": "-1"
        },
        {
            "review_text": "It's fun but needs the A.I to tone back on the aggression when it comes to military power. I've had games where the enemy has one more ship than I did and it declared war only to get wiped out and give up after 15-20 turns. My advice, build ships of quality and quantity.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "GC3 is less than it what could be or what I had hopd it would be, that it is not to say it is without merit.   Some of this may just be that it feels incomplete. It has a very small campaign, but a lot of room for customisation, modding, and user created content.  Some of it is due to over-engineering, so that things that should be at the fore-front of the interface are hidden away in obscure corners or just not presented to the user, as if the developers or the playing community just take these things for granted. Information on how the economy, combat, tourism, influence, etc works, is just not obvious or even explained in the game or the manual, and you could find yourself doing hours of research to find out simple stuff that should have been at the forefront of the interface. The game also has a very weak diplomacy interface, and a currently weak AI.  There are also some long standing conventions from strategy and turn based games that are (currently) not implemented in GC3. For e.g. you can't execute all ship movement without ending your turn, and if a ship has movement points left over you don't have an opportunity to use them before the turn is executed.   By design, you have no control of tactical combat. Not even a card system like in Endless Space. It is just a calculation with only a vaguely related animation (combat viewer) to go along with it which often has no bearing to the actual combat results, and the actual combat system is not explained anywhere in the game or the manual (you have to go to the wiki page for that).  Much is made of the ship designer, but actually 90% of it is purely cosmetic, in that you can pretty much draw anything you can imagine, but in terms of actual ship performance and stats, you just add a combination of basic modules (engines, weapons, sensors etc) to determine a ships combat attributes, but many other attributes you might expect to have control over are NOT in the game (weapon size, line of sight, power levels, repair rates, critical hits, subsystem taregting, etc.).   It's also so 1980's to be limited to a 2d galaxy map (the models may be 3d, but the stars are laid out on a flat surface), and the game could really do with a well-developed controllable 3d tactical combat engine, rather than just a plain hands-off combat calculator.  In the end I was somewhat disappointed that the game wasn't all I had hoped it to be, and therefore felt that I had not quite got my moneys worth, but it is engaging. I might have been happier had I bought it on a sale. If you are hoping that this is the ultimate space 4x game, then I didn't find it so. I do want it to be thouigh.  I would have scored it a 7/10 at release, with the potential for getting to 8/10 (maybe even a 9) after a few patches, some AI improvements, and a lot more user created content.   If customisation, mods, and user created content is what you are after, then you might be happy with it eventually. If you are expecting a well-polished game with all the bells and whistles and a decent campaign and strong AI for single-player games, you will be disappointed right now.  It is certainly not (yet) the 9+/10 that most magazines gave it.",
            "review_score": "1"
        },
        {
            "review_text": "I've run into a few bugs over the cource of the game, and it is very diffcult to learn, bu t overall, an absloute blast to play. Rulling a glatic empire, discovering the secrets of the universe, and finding ways to exists with your neighbors. Don't know a better way to spend hard earned money.",
            "review_score": "1"
        },
        {
            "review_text": "Should of waited till this game was stable. I thought it was out of beta? Once a couple patches are applied to it, I would recommend it. Its fun when it is not crashing or locking up on you.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome RTS. Been a While I havent had one that's challneging, unique in it's own right and not just another copy of CIV5. Thank you folks. ",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game only because it said that I don't need to be online to play it. Now I can't play it without being logged onto steam. I write a question about it on the forum and my post didn't get approved. I can find no information on how to play this offline even though when you buy the game it says you don't need to be online to play? I feel ripped off. I will not buy another steam game again. It is just more trouble than its worth.",
            "review_score": "-1"
        },
        {
            "review_text": "Great successor to its namesake.",
            "review_score": "1"
        },
        {
            "review_text": "After 7 hours of playtime, if feels exactly like GalCiv 2.   No new innovations, just upgraded graphics.   Regret spending money on it at even 50% off.",
            "review_score": "-1"
        },
        {
            "review_text": "Galactic Civilizations III is a game I've been looking forward to getting my hands on once i began to read and see about it. I got it for cheap £15 to be exact and I would pay that all over again, I felt there was a little bit of a steep learning curve to begin with but there's nothing sitting and staring at the tech tree for a while can't solve.   The sheer scale of the game is something i adore, even choosing a 'Huge' size map will guarantee you hours of fun in a single match! There are so many features in this game I love compared to other games of it's genre, like when you build a new ship and right click for it to move to a fleet of ships say 20 tiles away to meet up with them the ship will follow the fleet and not just go to the tile they were on, making it easy to manage fleets more effectively. The ship designer is a real neat feature, allowing you to customize your ships into whatever your heart desires, making your match yours in a completely unique way. As well as being able to make your own ships the ability to make your own Civilization exists in the game too, choosing unique personality features, creating the lore, having a unique tech tree all add to make this feature one that hardcore 4X fans will love!  In a nutshell i love this game, it goes without saying there are some AI balance tweeks needed and multiplayer from what i gathered is a little flawed too, but honest to god i can see myself sinking hours and hours into this title, hope you guys have fun with it too!   Peace.",
            "review_score": "1"
        },
        {
            "review_text": "I just can't seem to warm up to this game. It's completely soulless, it feels like I never quite know what I'm doing, and it's not interesting enough to want to learn better. It's not at all as engaging as Civ 5 which I spent over 100 hours on and would still go back to.   Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "Have always loved Gal Civ. This one is consistent with the others. Mostly a graphical update with some new features and structure. Same formula, just better.",
            "review_score": "1"
        },
        {
            "review_text": "Build your own ships or download community built ships, then dominate your galaxy!",
            "review_score": "1"
        },
        {
            "review_text": "Build your own ships or download community built ships, then dominate your galaxy!",
            "review_score": "1"
        },
        {
            "review_text": "A game with massive depth, and quite challenging. Definitley one of the best 4x games Ive played, although the tutorial needs to be more thorough. On very large maps managing assets can be a pain in the neck. But overall, a very engaging game with alot of depth.",
            "review_score": "1"
        },
        {
            "review_text": "Gold standard for interstellar TBS games. Remeber when you daydreamed about you own versions of Battle Star Galactica or Mass Effect? Now you can do way more than daydream.",
            "review_score": "1"
        },
        {
            "review_text": "its a board game without cleanup, what's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "First impressions:   This is a good 4x game, but I'm not to the point where I think it’s great. Stardock makes two very similar 4x games and I prefer Sins of a Solar Empire after playing this for a bit. I enjoy the space combat in Sins better, I like how you can zoom in and watch the fighters and bombers strife the big ships. The space combat in this game is not that detailed. You can change view top down, free, and a 3d type camera view, but most of the time the big ships just chase the small ships and oddly it reminds me of the 1st stage of Spore. I miss the fighters and bombers which you can build hundreds of in Sins, you can't in this game. Also the expansion model in this game takes away from my enjoyment. You can't send a huge fleet you've been hiding after the capital planet for a devastating blow. The ships have to be in range of one of your planets or space stations. So all you can do is slowly work your way into the enemy space and they totally know you're coming. This could be good or bad, because it is fun to expand and fight to keep your area. But I would like to choose, this game doesn't allow rapid strikes, you take space and take space and keep moving.   So this is a good game but prefer Sins better. Come on Stardock make a new Sins.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is good at being an immersive 4X. After the initial build up of your empire the play gets really interesting. It is advised to save alot of the time. Every time you make a descission only after does it become clear that 'oops it was the wrong choice to make' and relode the save that you did before. This way you can learn to adapt as the game unfolds. The AI is unforgiving so do not expect an easy game, when all is set to normal. It does seem that the AI is out to get you. One of the best that I have ever played against.   Strategy is just unparralled. It is awesome strategic planning and play. Adapting and adopting as the game plays keeps interest for weeks on one game.",
            "review_score": "1"
        },
        {
            "review_text": "Terrible. Same exact game as my Gold Editioni Galactic Civ II with less option to boot. Buggy as all get out .. are you sure this is out of Beta? When it crashes it freezes my entire computer forcing a hard reset. The AI is overpowered. They always seem to surround you imidiatly, get angry at you even when you give them EVERYTHING you can so war is completly unavoidable. You are forced to spear head your research into nothing but Military just to be overwhelmed by the AI's impossibly strong ship, and that's on Normal. This game may be a worth your time if it was free. Not at all worth $40 let alone $60. Save your money and you patients and avoid this game until its free or $10.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, but 90 bucks for the full gaming experience? ♥♥♥♥in nope.",
            "review_score": "-1"
        },
        {
            "review_text": "This is essentially Galciv 2 with a balance pass, refinements to the tech tree, a very few new items and ships, a couple tweaks, and it pushes my GeForce 970 hard enough to be at risk of overheating my system while somehow managing to look almost exactly the same as GC2. It also progressively clogs up my system until it refuses to respond towards the end of longer games, when there's a lot going on.  It's fun enough, but if you haven't bought it yet, just stick with GC2. This should've been a $5 DLC, not a separate game.",
            "review_score": "-1"
        },
        {
            "review_text": "Quite a bit of playability in this one. It may not be graphically rich, but it has decent gameplay and a (generally) sensible diplomacy engine. It is not too strageic, more like '4X-lite' and the enemy can be gamed quite easily.",
            "review_score": "1"
        },
        {
            "review_text": "Get GalCiv II instead.",
            "review_score": "-1"
        },
        {
            "review_text": "just kept getting wiped out as there was no real brakdown on how to play anywhere, yeah a couple of walkthroughs but even those didnt say anything about all the mining etc and wgat the hell to do with it all, I kept getting drengin power at over 2000 and mine at 132 when I had LOADS of world, starbases etc etc, was on the verge of packing it in completely but giving it another go, not hppy though at all. The ship builder also sucks big time as its almost impossible for a newbie to work out",
            "review_score": "-1"
        },
        {
            "review_text": "In case anyone occasionally reads this ... I was not a man of reviewing unitl sitting in a train having nothing to do this moment. The idea of Why not give reviews to all my games suddenly came to my mind and Bang! This is it.  Wow... Ship desiger is so cool, but I'm disappointed after failed in building a cat shaped battleship. And, wow wow wow,mods from the workshop is even cooler!",
            "review_score": "1"
        },
        {
            "review_text": "FANTASTIC. Wasn't sure my PC coudl run it with the whole '64-bit required' but i found out my pc is 64-bit and it runs like a charm. Very fun. If you have ever played civ 5 or beyond earth and were as disapointed with the limits beyond earth had this is the perfect game for you. Very in depth with the ability to design ships if fantastic. Very beautiful and fun. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I think this is an amazing game. It's a HUGE improvement over the previous GC games and I find the improvements well placed. The graphis are nice for this type of game, and the music is wonderful! Art is good too, I found myself really captivated by the worlds when I saw them.  The only bad thing is that things can get a bit predictable at times, but this is a rare occurance and only if you have a very LARGE map. A tightly packed map is very hectic and always keeps you guessing, it's a good challange.  I would highly advise this game to any strategy game lover, as it offers a good challange and can leave a lot to enjoy even after a few games. I would advise also those of you who like sci-fi to pick this up, even if your unexperienced with strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "Slightly unpolished gem of a game. Around 400 hours of multiplayer against AI opponents.   Memorable moments include things like...   Wiping out Drengin AI in early (MP) game. This was after they cornered me in the galaxy.  In multiplayer, barely surviving the most overpowering, runaway Thalan AI that had every advantage to win the game.  Creating the first custom race that felt good to (role)play.  First time, willing to destroy a planet to stop enemy advancement. You cannot just move your fleet everywhere, you've your influence borders and ships have ranges.   Completing the game, in singleplayer, with Yor, by turn 1000, and having fleets of the best possible custom ships. Got a pretty high score too.  Having a way too difficult Dread Lords first encounter, accidentally losing a lot of ships (Fog of War), then running away shamefully multiple turns, then finally destroyed them with more advanced ships.  Definately my favourite of 'one more turn' games... but not for everyone. There is no historic lines of famous bloggers, cute graphics or possibility to win the multiplayer game with only one planet. There is only Drengin with their bad jokes.",
            "review_score": "1"
        },
        {
            "review_text": "The game is coming along fine and fuctions well. The tech trees are well done. the worlds develope good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is F%$KING awesome!",
            "review_score": "1"
        },
        {
            "review_text": "as every precedent iteration of Gal Civ it is a reference in this style of game.",
            "review_score": "1"
        },
        {
            "review_text": "Decent game. One of the better spacey Civ games. Still exploring what the game has to offer after several hundred hours of play.",
            "review_score": "1"
        },
        {
            "review_text": "No other 4x game can come anywhere near how good this game is and the graphics are just as good.",
            "review_score": "1"
        },
        {
            "review_text": "Europa Universalis in space",
            "review_score": "1"
        },
        {
            "review_text": "Good build game a la Civ. AI is impossible at normal or above settings",
            "review_score": "1"
        },
        {
            "review_text": "Game seems good I would like a better auto move system with way points or somthing similar like the design options would like a design your own race feature. ",
            "review_score": "1"
        },
        {
            "review_text": "good game if you played star trek birth of the federation you will like this game altho i think that the star system layout should be more like BOTF for simplicity other than that i cant fault the game :)",
            "review_score": "1"
        },
        {
            "review_text": "Civ 5 on Speed",
            "review_score": "1"
        },
        {
            "review_text": "it is really interesting game with tons od options",
            "review_score": "1"
        },
        {
            "review_text": "was Just not my cup of tea",
            "review_score": "-1"
        },
        {
            "review_text": "Addictive",
            "review_score": "1"
        },
        {
            "review_text": "Great Game:)",
            "review_score": "1"
        },
        {
            "review_text": "I love the franchise, but I feel a little betrayed by this game. They just re-sold me Galactic Civilizations 2. There are some very minor differences, most of them are cosmetic. The diplomacy system feels half-completed, the combat system is buggy, and the AI behaves exactly the same every time I set up a new game. By today's standards, the AI should be much more dynamic. I'm not even sure why the offer a 'campaign', with its weak three maps.   If the developers come out with a major patch, I might be willing to recommend this game, but not as it is.",
            "review_score": "-1"
        },
        {
            "review_text": "Good addition to the series. Must have for any fans of the original 2",
            "review_score": "1"
        },
        {
            "review_text": "Great game!!! If you like the previous games you will like this one.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really no different than Galactic Civilizations II with fancy graphics. The lack of a distinct end turn button is really the nail in the coffin for me. It makes no sense why the game forces me to micro manage.  I would change my recommendation if they would just allow me to end the turn when I want to end the turn. I want my planet and ship yard to be idle. This was not a problem in Galactic Civilizations II.",
            "review_score": "-1"
        },
        {
            "review_text": "Everything you love about Civilizations on a larger scale and without super cheat'y AI.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, simply put. Not my first 4X strategy, but it is definitely my favorite. It has a great deal of depth and awesome lore. Overall 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Every time Stardock releases an expansion it seems like they get 2 things wrong, ignore 5 things, fix 200 things and drop in 5-6 things that make you wonder how you even played without them. And they continue supporting this, just like they have done with Legendary Heroes.",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed colonizing, exploring and designing my own ships ... but when the time has come to face the enemies in battle, the game becomes annoying as hell: You will feel cheated by the AI!",
            "review_score": "-1"
        },
        {
            "review_text": "From when GC3 was first released, it came out a pretty solid game. The dev team has done a great job improving the game with updates and some seriously awesome DLC. GC3 definitly has replayability value, which i respect the most, every playthru is completly different. Really love this game and the twist it has on the standard turn-based stratagy. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "From when GC3 was first released, it came out a pretty solid game. The dev team has done a great job improving the game with updates and some seriously awesome DLC. GC3 definitly has replayability value, which i respect the most, every playthru is completly different. Really love this game and the twist it has on the standard turn-based stratagy. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This back and forth.....sigh  They re-integrated the wheel, not so sure if I should change my vote but I'm tring to focus on the things I said back when this game was released, even with all its crap back then, the game was great and fun. The thing that bothers me is that they claimed that by removing the wheel the game was gonna be better, that it was an improvement and it was clearly not. However!! I'm changing my vote because I want this game to succeed.   ----------------------------------------------------------------------------------------------------------  UPDATE 1.4  In short TERRIBLE! Do not buy this game yet. I'm removing my thumbs up.   Why?  They removed planet specialization. (No more planetary wheel)  Consequences  Everything now work based on your global wheel. For example if I were to put 100% on production and you conquered a planet you wish to focus on Research, the only way you can do this now is by selecting a pre-stablished 'option' that 'focuses' 25% of your planet resources to Research; it sound good right? BUT IS NOT! In short, when your Research-Planet is done with all its little upgrades and buildings you'll be wasting 75% of your planets Research power because your global wheel is set on production, you'll be efectively losing 75% of credits, time and research power per planet and more on a global scale depending on how many planet you wish to 'focus' on research and wealth.   And something that REALLY BOTHERS ME is that they claim that the system is 'better' now because there is less micromanagment. NO! they are not making a positive change or even an intelligent or useful one, they are removing the ability to make proper decisions by handicaping player.   TERRIBLE, DO NOT BUY YET!! ----------------------------------------------------------------------------------------------------------   I'm giving this a thumbs up with some reservations.  PROS:  1. The strategy level you can achieve is awesome. Nothing works best like driving the opponents into a choke point or moving your conquering fleets from civilization to civilization.  2. Race customization is amazing. There is great balance when choosing an skill or perk. You can litteraly create a super race of dinosaurs, cyborgs or a technological advance otter race. What ever comes to mind. 3. The ability to actually manufacture your own designs puts the game at a different level. You can create your own Borg Cube, Star Destroyer, Starcraft Battle Crusier...etc etc etc. 4. Good Story telling and some funny dialogues.  5. Great ambient music. 6. Awesome cutscenes. Nothing tops the fun of having your supper carrier PACMAN face ship shooting lasers from their eyeballs...(not so great camera views tho) 7. Interesting Factions and Lore. Just the dive into the galactic civilizations wiki and metaverse already.  8. Map customization is also great, you can pretty much modify every variable on the map.   CONS:  1. The learning curve of this game is hard, tutorials are not good and any 'let's play'/'walkthroughs' on youtube is probably outdated. Plus the common joe wont invest 6-8+ hours of their lives to actually learn everything. 2. The AI is really dumb. This needs a lot of work, you'll have to play the game (once you get the hang of it) at suicidal level to actually feel some challenge. And yes the Ai cheats, but again you won't really notice it because you'll know how to exploit things. However this helps with the learning curve, you can choose a begginers difficulty and after a few matches you'll grab a sense of the game. 3. The game requires a better way to macro-manage your civilization. You'll feel this once you have more than 15 planets under your control. Every turn will feel like an eternity because you'll have to micromanage everything and once a few turns have passed you'll have to check each planet to recall what's actually happening and why you choose to build a particular building. This needs to be adrees urgently. 4. There are so many ways to exploit the game once you know how things work. Pls stardock I really have a problem with people being able to put colony modules on tiny ships. You can practically launch a colony ship every turn within the first 5 turns... 5. NOW this one really bothers me. There are NO Stargates in this game. The game allows you to choose a gigantic map but there is no mechanic or late-technology that allows you to fast-travel from point A of the Galaxy to point B. A simple solution would be to create a technology for late game that allows you to jump between one starbase to another. Why is this important? Imagine you have conquered half of the galaxy, you have 50+ planets under your control and your fleet is at east wing of the map, suddenly the second most strong civ drops war on yours from the west side. You won't be able to use your ships. You'll have to go block by block watching how the enemy conquers your worlds. If the game is gonna allow players to use gigantic maps then there should be ways to navigate through.  6. Regular Bugs. Planetary destrucion is bugged, jumping between the galaxy view and the tech tree view creates a bug.  I trust Stardock will look into this and other things and all in all the pros supersedes the cons after you get a sense of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Ok to start off this game isn't my type of 4X turn based ones are a hit and miss for me but that aside it's a pretty good 4X its challenging and easy at the same time which is weird but its easier in some ways and harder in others like actual war the AI somehow manages to produce powerful fleets in the early game while your left behind but i find i take the lead in tech and economics which allows me to destroy everything through buying planets and influence kinda OP in a way since you just take over the money for me i'm not sure if i'll revisit this game maybe in the future i'll come back and play it but if you like turn based 4X's this is probably worth the buy and as i always say if you don't like it and have less than 2hrs get a refund and get another game",
            "review_score": "1"
        },
        {
            "review_text": "Highly recomended. Game play is as expected. Very well suited to whatever your play style is. Most appealing to me is all the customisation available. If it turns out it is not exactly the game you want right out the box. It has the potential to become that game.",
            "review_score": "1"
        },
        {
            "review_text": "Bought for Multiplayer, after release alot of features not working, AI cheats insanely, it seems they don't even have to explore, I've had colony ships from AI heading to worlds they have had no chance to explore, and heading back as soon as I colonize it.  So much for the Explore part......  Another game from Stardock that's really just a paid beta.....",
            "review_score": "-1"
        },
        {
            "review_text": "- Just a GC II in disguise!  WARNING: This game offers almost NO ADDITION to the timeless and amazing Galactic Civilizations II. While I had the fleeting dream to play a 2015 version of an old favorite that I played for hundreds of hours, I was shocked with the extremely limited variation when it comes to mechanics, style, expectations and even the visuals (graphics are almost identical to the old one).  - Unstable and unpolished:  What makes it even more of a rip off is that the stability is terrible, the loading times are exaggerated (I have a monster of a gaming rig that almost always runs everything on Ultra with 5 seconds loading time at most), and it frequently crashes. Not only that, some aspects of the game makes it completely unplayable. Wanna design the proper fighter with chaff defense and mass driver weapons? Good luck with that, I spent 2 hours today trying to figure out why my normal non-prototype ship was refusing to be saved.  - Building over an old successful game. BADLY!  This is a marketing disaster. If this game were marketed as GC II Remastered, it might have worked if it were playable and priced at $19.99 at best. Imagine playing an Age of Empires 4 that turns out to be a remastered verision of 1 or 2 at $49.99!! Absolute disgrace.   - Shame on Stardock:  I am in shock over the decisions of this games developers, its early launch, its pricing, and that THIS is what the once amazing Stardock has come to. We could very well be seeing the end of Stardock with the production of such a game, which is nothing short of the recent failings that come to mind of Port Royale III compared to II.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was fun, right up until it randomly ended with my defeat. I don't play for speed, or points. I play for fun, and fun for me is building my borders, space stations, fleets, tech and planets. Expanding at my own pace, building my economy. Spent 3 day's doing it only to have the damn game end. I don't care about victory conditions! This spoiled my experience with this game.",
            "review_score": "-1"
        },
        {
            "review_text": "A fitting sequel to Gal Civ 2! Lacking features from Twilight of the Arnor, but you have to be realistic about these kind of things. With a brand new engine, it'll take them time to build up again. Gal Civ 2 had like 9 years of support to get to the massive game it is now. Gal Civ 3 has an even greater potential.",
            "review_score": "1"
        },
        {
            "review_text": "I've been a fan of Stardock products for decades. The GalCiv3 game has found a permanent place on my 'goto' list of games when I need a break. It's a 4X game but it's well-conceived engineering allow for expansion and participation in the creative process. Rather than keeping a game of Chess on tap. I'd rather have a game like this that allows me to participate in big decisions and diplomacy to change the result. The game will be re-playable for at least a few more years while the SciFi genre for gaming FINALLY returns to the forefront.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, unfortunately without Italian text ( i know that the audio is impossible, but the text is the minimum requirement for this game)",
            "review_score": "-1"
        },
        {
            "review_text": "Sins of a Solar empire on a grand scale. Much deeper tech and options. Galaxy is unimaginably huge. Haven't played long, but I recommend it if you like space civs. Its on a whole other level than anything I've played before in terms of scale and options.",
            "review_score": "1"
        },
        {
            "review_text": "multiplayer sucks",
            "review_score": "-1"
        },
        {
            "review_text": "Recommended to anyone who likes strategy. 9/10    This game feels great. Not easy to get into but once you understood all or most of the mechanics it's a lot of fun. Cant wait for some updates.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game so far I think I've finally learned the economics of the game play. Having a blast kicking ♥♥♥ for a change now instead of being forced by those ♥♥♥♥♥♥♥ Drengir to take it in the ♥♥♥. Finally decided to get Steam of my back and write a reveiw. There I'm done, now ♥♥♥♥off and let me play the damn game.",
            "review_score": "1"
        },
        {
            "review_text": "Dont buy it. Gal Civ 2 had mad potential. In its current state its still a better game. The story of the game caan be told simply by looking at the lack of attention the developers have paid to changing the fonts for the visually impaired. I run a NV 970 GTX card with 4 Gs on a 4 year old ASUS 21 in monitor and have tried numerous resolutions from 1024 to 1900.   When I look for a fix on steam I get the community advice to change the text in the UI files, but when I do, the font becomes too large to fit the UI and therefore useless.   I do not understand after about a year how the devs have neglected this simple issue? It's not like they have to change the AI or anything that difficult. All I can conclude is they just dont care.   What's worse is that I logged 2 hours of 'playing time' simply by entering and exiting the game - as IS REQUIRED to change the graphic settings....so guess what? Steam wont take it back.  Well I guess the jokes on me.  Maybe whenever I can buy a new desk with a 44 inch monitor I can finally play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "This Game just pisses me pff its imposible to win even on easy. not entertaining at all.",
            "review_score": "-1"
        },
        {
            "review_text": "The oppoents are all faster at tech, building, exploring, and fighting. There are no planets to actually colonize even on the highest frequency. Doing any improvements at all to the planet or setting up the starbases hardly improves production or research at all so as to make it nearly pointless to persue most strategies in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Worthy of the name it bears and of its legacy... I own all of them now!  Play it and see for yourself!",
            "review_score": "1"
        },
        {
            "review_text": "It's ok... got it on sale so I can't complain.",
            "review_score": "1"
        },
        {
            "review_text": "Takes too long. You will spend a few hours just colonizing and flying around before any action starts. Then you will find out the AI did nothing but military research and it will crush you while you watch helplessly as your well developed colonies fall :).",
            "review_score": "-1"
        },
        {
            "review_text": "Very good startegy game, almost like Civ beyond earth. But with a space empire feel to it. Only problem is that very intricate ships can make the game lag a bit in a big map.",
            "review_score": "1"
        },
        {
            "review_text": "frusterating and fun! lots of content to explore and replay. i will be playing this game for a while!",
            "review_score": "1"
        },
        {
            "review_text": "Meh, It's okay.",
            "review_score": "1"
        },
        {
            "review_text": "Having fun playing a game series I enjoyed for years!",
            "review_score": "1"
        },
        {
            "review_text": "Great game a worthy followup to Gal Civ 1 &amp; 2. More than worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "Ah reviews. How many have you read and forgotten? I bet we could have more fun talking about crappy reviews full of the writers personal ideas of what should or should not be in the game. But that is not the point of a review. You want to know what the game holds and does not hold how it plays and does not play so you can choose for yourself am I right? Well I am a big enough nut to know im right so we can skipp the aplause and get down to the dirty details. So get your pens ready and take notes this will blow your mind.  Style of play. Duh its a galactic civ. Wow I know right totaly blew your mind there. You play as a galactic power in a struggle to in one way or another outshine the other races. You can either beat them to death or overpower them in tech or culture or several other ways. But its really beat the others however you can find a way.  There are enough techs and tactics that you can find many ways to win against any kind of player if you have the skills and time to do it. This is not a fast game as some matches can go on for weeks for me. While others can last a few hours if set up right.  Government. Blah blah bla bla bla yeah there is some kind of system but hell who cares i found a shiny laser gun want to see what it does to a drags elbows? The thing it does to the skin so cool.   Combat. Yes it has it and lots of it. Its all auto batles no mater how you look at it though. You either have more power or you do not. So prep early and often cause by the time the attack comes its too late.  Diplomacy. Well it is politics. Ever had fun with that topic? Yeah me either. I say shoot them all and divide the spoils. Cause these guys are all liars. I mean who wants to please everyone and end up ticking some other group off with every action any ways cause thats what things boil down to you get one maybe two friends and everyone else hates you. So pick strong friends of be the strong one.  Customized units. Now the selling point true customized units. Awsome in more ways than can be said. Premade units are crap to a custome unit with the same tech all because you can tip the scale by tweaking things in your favor. I mean who would not want a super sized ship with nothing but sensors on it to act as a massive set of eyes that can see 80 spaces away? And a carrier that can hold more fighters than you can put in a fleet. Plus you just have not lived till you build a super dreadnaught. Total bad ♥♥♥.   In short you are the bad ♥♥♥ of a galaxy full of bad ♥♥♥ enemies who want you dead or who just want to use you to kill another bad ♥♥♥ in thier way. If this is your thing your wasting your time I am already in the lead if its not for you great I do not need any more subjects to rule I already have gient worms that works for me and on this one planet the dirt is my slave so yeah im good either way lol.  Have fun I know I will.. . . .nah i am having fun HA HA HA.",
            "review_score": "1"
        },
        {
            "review_text": "I love the freedom of this game; You determine how you play. will you kill your enimies with kindness or just kill them. you design your own ships and forge yourown warfleets.If you want more to play with too easy. the community modding support behind this game kicks up the replayability to the point that you could never play this out.",
            "review_score": "1"
        },
        {
            "review_text": "I loved GalCiv 1. Played it for what must have been at least a hundred hours, perhaps several times that. But this game just hasn't captured my interest. I don't know why, but it just hasn't. I doubt I'll play it again.",
            "review_score": "-1"
        },
        {
            "review_text": "new computer updated drives. recently got windows 10. game will not work no matter what i do. it freezes after about an hour of play. really depressing. do not recomend",
            "review_score": "-1"
        },
        {
            "review_text": "fantastic game. Just waht you expect.",
            "review_score": "1"
        },
        {
            "review_text": "A very addicting game. Has it's faults, but overall I very much enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is just garbage pacing is slow even for strategy game most of the time youl be stuck waiting 20 turns for a planet to get tis first production building which in turn will be used for another production building less you wait 100+ turns jsut to turn a planet into something worthwhile",
            "review_score": "-1"
        },
        {
            "review_text": "Once again I gave the effort in trying to learn how to play this game with the tutorial. To sum it up I didn't learn anything and was just meet with frustration. Tutorial doesn't tell you want to put on your planets, doesn't tell you where to place things on the map, doesn't tell you how to handle various situtation. Instead it just does very vague 'go colonize this planet and start researching(not what, just anything)'.   For me, 300 Turns in on the tutorial, the planet near the enemy they told me to colonize which I did was taken by the enemy and the enemy's fleets were now 3-4 times more powerful than any fleet I could eventually create. Even if I were to take out a fleet of theirs, there was another 3 mega size fleets just waiting for me so I could never beat the enemy. All my planets at this point hated me and even my supposed ally kept yelling at me.   Since the game doesn't even teach you how to play properly in any way shape or form and just hopes you know what you're doing it's just a game of frustration. I could spend hours I guess reading up online on better ways to play but this would be the first game I've ever needed to do that and a game this massive should have a functioning tutorial system.  Now I know why so few people play this game. It's terrible. If you can't do the basics of teaching your players how to actually play your game you shouldn't release the game in the first place.",
            "review_score": "-1"
        },
        {
            "review_text": "Love the game! Never played any of the GalCiv games before. I am a big fan of Sid Meier's Civ games and many other 4X games. My first two games were rough and just for learning how to play. I won by Influence on my third game. On my fourth game now and it is very addictive. It will keep be busy until Civ VI come out.",
            "review_score": "1"
        },
        {
            "review_text": "I am sorry. Stellaris got to me",
            "review_score": "-1"
        },
        {
            "review_text": "Difficulty settings are fundamentally broken  Picked 'baby easy not thinking never played before' difficulty and Iconians had a 30/33 fleet with 148 missile attack and 76 beam shields by turn 146",
            "review_score": "-1"
        },
        {
            "review_text": "Not a review, just a fav",
            "review_score": "1"
        },
        {
            "review_text": "At the moment: it's galciv 2 + fancier graphics + 30% chance of crashing when loading a game. I hope it improves.  *edit*  not well sorted for us with large high res screens with buttons shoved into each corner. the 'large gui' mode is a bit screwed up as well.  if my planet gets bonuses upon colonisation and the decisisons taken there I see no way of seeing those bonuses or negatives in the UI.  could do with faster ship speed or you end up me, uninstalling it because its a massive time sink!",
            "review_score": "-1"
        },
        {
            "review_text": "This is Galactic Civ II, but with better graphics. So if you own Galactic Civ 2, don't bother buying this. And if you don't own Galactic Civ 2 then buy it instead, its cheaper.",
            "review_score": "-1"
        },
        {
            "review_text": "I have never played the Galactic Civilizations series. That being said, I have extensively played Sid Meier's Civ 5, Civ 4, and Sins of a Solar Empire (The original disc version)  I am absolutely amazed by this game. Everything works as advertised, and phenomenally. Gameplay is good and balanced, and is a lot of fun. However, some of my greatest favor lies in the game's details. The galaxies are so detailed, I can safely feel that each faction is unique, the list goes on.  For any strategy games fan, just buy this ♥♥♥♥. It's worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Crash simulator -1/10",
            "review_score": "-1"
        },
        {
            "review_text": "10 of 10.  I recommend it for everyone who looks for real strategic game.",
            "review_score": "1"
        },
        {
            "review_text": "WHO the hell do you think you are that you can restrict how i chouse to play the game i paid for by not allowing me to create larger maps due to the size of my phisical memory. GET BENT you ♥♥♥ hats. its my damn game and its my damn computer, if i want to play a slow ♥♥♥ game on an insane map thats MY F**KING game to do so with!",
            "review_score": "-1"
        },
        {
            "review_text": "Great Game!!!!!!!!!!!!!!! BUY IT CUZ I SAY SO!!! IF YOU DONT BUY AND PLAY THIS GAME....THE GODS SHAME YOU.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  - No clue if there are any. As for why, see cons.  Cons:  - Small problem during installation. - Game quits to desktop 5 second in the loading screen. Lengthy fix on Stardock support website did not work.  Score: -10/10 (yes, MINUS 10). If Stardock gets the game to work out of the box I might reconsider this rating.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont even remember playing this game lmao",
            "review_score": "1"
        },
        {
            "review_text": "I generally don't write reviews but this game is hands-down the most disappointing purchase of my gaming career.  Constant bugs, almost no content in the base game and DLC after DLC this soon after release.  Please do not buy this game, just don't!",
            "review_score": "-1"
        },
        {
            "review_text": "This is basically like an early access game that doesn't completely suck. The community is active, the devs are on the forums, and they are releasing patches, and silly DLCs.   Pros:  - Ship Creator - Steam Workshop - Warfare (It has a cool battle animation video) - Technology  - Nice UI  Cons: - DIPLOMACY, much like Civ V at the start, but they are starting to improve it - Annoying Fog of War, it's like civ v's direct 9 - Minor Bugs - Takes up a lot of memory while playing - FPS goes all over the place, from 5 FPS to 62 FPS  It's not even $60, and they are nice enough to keep updating it, so I recommend it, at full price, and there's even an okay multiplayer (never really tried it out).",
            "review_score": "1"
        },
        {
            "review_text": "Only played for a little bit, but can see this game has gotten me hooked.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, simply put.",
            "review_score": "1"
        },
        {
            "review_text": "Great 4x space strategy game. It does have some annoying glitches and oversights, which will hopefully get fixed in future updates. Otherwise, the best space 4x strategy game produced so far.",
            "review_score": "1"
        },
        {
            "review_text": "Was fun until I was unable to progress through the game because the tech selection buttons are bugged (i get a ctd) and can't obtain the tech to invade planets. I've expereinced about 10 ctd in my first game (only on the tech screen). I am very optomistic about his title, but will hold off until another patch. Am happy with my purchase as I got a huge steam discount...  Update: Last Patch before release addressed just about all my issues. I now highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "I love this series and can't wait for the beta to be finished. The last update I played it on was horrible. However they probably fixed that by now. However don't let that be a deturent to playing this game and who knows you may really come to like it and get it to work. Highly recommend... :D",
            "review_score": "1"
        },
        {
            "review_text": "Fan of GalCiv 2. Struggles to run smoothly on 2009 dual core 2.8ghz, 512mb and 4gig of RAM (Not complaining just informing) Like the new resource mechanics, tech tree is good, AI seems solid so far if somewhat constructor happy to the detriment of other things.  Really looking forward to the AI getting polished and think in a few months will be a very good challenge which is what I look for in a game.",
            "review_score": "1"
        },
        {
            "review_text": "What a great little game... If you like 4x Strat games like Sins of a Solar Empire, or even Civilisation, give this a go. There seems to be a bit of a learning curve, as the tutorial is anything but, but it's simple enough without lacking depth. Well worth £30.",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game back in Alpha. I have followed Gal Civ since the first one. I was so excited to see this game was coming. I have watched this game come along and turn into a worthy follow up to a game i have enjoyed for 15 years.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most complex and most detailed 4X games of all time.  A true successor to Master of Orion  ..................  With the exception of a few flaws like :  1) Lack of espionage  2) Simple pop-up for invasions without much fancy graphics  3) Some mild stuttering and a few minor bugs  ...................  The rest of the game is as swell as it can get:  1) Superb tech tree (detailed and streamlined from GCII + unique techs for all races)  2) Wonderful grid placement for improvements  3) Galaxy wide resources + planetary resources  4) Improved tactics for battles over GCII  5) Beautiful cinematics  6) INSANE map sizes (though seriously a game may take a year to conclude at max size)  7) Impressive customization of spaceships + new carrier types  8) Improved AI + Diplomacy options  9) Transformation of 'galactic wonders' into 'buildings needing resources' (much better in my opinion, since buildings won't be 'snatched' by enemies)  10) Hex tile system is an improvement over square ones  11) Ideologies as new addition  12) Insane number of building types thanks to each civ having their own unique buildings  13) 100+ opponents - that's CRAZY  14) Dedicated company which does its best to improve it with patches etc. Stardock doesn't fail.   15) Extremely customizable custom civs  16) New galaxy 'terrain'  17) LOTS AND LOTS of random events + alignment events (I rarely see pics being reused!)  18) Quite stable (on an i5-3570K, 8GB, 1TB WD Black, R9 270X = no crashes so far in 10+ hours of play so far at Excessive map size + 8 major civs + 150-200 turns into the game)  19) Very atmospheric thanks to all the cinematics + events + survey events + beautiful diplo screens  20) Promises from company for future additions and features  21) 95% of its features are an improvement from Galciv 2: TA. 5% being lack of espionage and lack of graphics for invasions.  ......................  Overall, I recommend this.   FINAL VERDICT:  90/100   (Would have given 4 more points if espionage + invasion graphics are added in)",
            "review_score": "1"
        },
        {
            "review_text": "Are you a vet? Then you will do well. If not. Be prepared to die... again and again. Until you either find a useful guide or you have that eureuka moment!   If you are like me - old, senile, and can't recall Gal Civ II other than remembering it was 'fun!'...  Well it'll take a couple missteps and then will feel like an old glove with even more options but really the same old hat.  Do you want this game? Well it you want an epic journey that lasts 50+ hours of clicking and hitting keys... this is the game for you. If you prefer hitting ABABSelectStart... go find an old Nintendo.",
            "review_score": "1"
        },
        {
            "review_text": "Quite fun. A good addition to 4x games and a worthy successor to GalCiv II. I do think that some of the DLC ought to be included in the core game (galaxy events &amp; map pack). Although the other DLC is worth the extra price. I realize that the publisher has pay the bills ... so I'm not too butthurt about it.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game always getting better 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I find the game is a bit buggy when it starts up and the tech tree takes a lot longer to research in game thatn in galactic civilizations 2 however the graphics are a lot better and the game play although it seems to be reasonaby player friendly is a challenge to adjust to from galactic civilizations 2. Over all my experience has been prety good so far but only time will tell in the long run. i would rate the game a 3.5 star out of 5 stars at this time.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, this is a great strategy game, it feels tough to keep everything moving and still growing in power, but honestly the game is awesome. The different tech trees for each race gets me coming back. Every race has different building strategies and growth potential. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "3D Galactic view, and the ability to command your ships i.e. slow down so missles can hit longer and my ships out of range for longer",
            "review_score": "1"
        },
        {
            "review_text": "Gal Civ 3 is an excellent addition to the 4x space genre. I enjoy the ability to create truly epic galaxy sizes and the balance it tries to strike between simulation and gaming. I would like to see more races available for play and a better tutorial for new players.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent 4x strategy game that has returned with a fine polish. Although you won't find many new features from its predecessor, it is still a worthwhile purchase. It could do with a help guide which is pretty much non-existent, and forces the player to learn through a few playthroughs. I would advise either playing the tutorial campaign, or looking online for tips on how to play before embarking on your quest for galactic dominance!  Just on a feeling and with no real solid rubric I would give it an 8/10  ",
            "review_score": "1"
        },
        {
            "review_text": "Crashes so often it has limited my enjoyment of what would be a good game!",
            "review_score": "-1"
        },
        {
            "review_text": "Intricate and throroughly enjoiyable sci-fi turn based strategy game.This is the true meaning of a game that is true value and worth every penny as you spend hours playing for years to come. A definite improvement over the last game.",
            "review_score": "1"
        },
        {
            "review_text": "First time play but definitely got replay value. I feel there should be a community developed for this game. Perhaps setup an online server to bring players together.",
            "review_score": "1"
        },
        {
            "review_text": "Suprisingly addictive, and the devs are adding to the game every month or so. Just the tutorial + main campaign can provide over 20 hours of gameplay, depending on your skill level.",
            "review_score": "1"
        },
        {
            "review_text": "good game, i like it who is a bit of a jump from GC2",
            "review_score": "1"
        },
        {
            "review_text": "This is very much like Civilization. But in space. Love it.",
            "review_score": "1"
        },
        {
            "review_text": "While enjoyable to play, the constant crashing / freezing makes it almost unplayable.  After doing some research on my crash issues, I discovered that they've been reported since beta. Game developers really need to stop releasing buggy games and fixing them after release. It really makes me question if I want to buy future games from them.  Edit: Months later I thought I'd give this another shot, maybe the game had been patched by now? Nope still crashing all the time. Uninstalling...",
            "review_score": "-1"
        },
        {
            "review_text": "It's been good since OS/2, and still is.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game! Most likely not your thing if you want in deapth battles. However very strong in the Civilisation Style turn based games. If you like Civ, you should like this game.",
            "review_score": "1"
        },
        {
            "review_text": "I like of its variety of options and choises u can make. Compleate freedom in development. Still somthing missing in diplomatic aspect...",
            "review_score": "1"
        },
        {
            "review_text": "Very good game with large amounts of replayability. After 40 Hours I still am playing as the Terrans.",
            "review_score": "1"
        },
        {
            "review_text": "I like the challenge (even on easy), the variety, the strategy required, the balance (I know a lot of effort was put into this.), the replayability (thanks to the variety and random maps), designing my own ships, that it's turn based, that it's a 4X (eXplore, eXpand, eXploit, eXterminate) game, and that it's set in space.  I disliked the boring parts where you're waiting turn after turn for something to finish or be ready.  I love the game, overall.",
            "review_score": "1"
        },
        {
            "review_text": "Not as visually attractive as Civ 5, it has high customization both pregame and during, where you can design and customise both the look and armaments of your star fleets. There is no control over individual battle results this is a generals chair game, you direct where and when a battle will begin but how it ends is determined by force strength and ability. Technology alters the galactic frontier as much as numerical superiority, failing to advance key sciences in the advance of new challenges can be fatal whilst gaining a decisive tech early and captilising on its benefits before your neighbours do can ensure your dominance.  Fair warning, this game takes time to complete, and if you play on the appropriately named insane map size prepare to devote significant time to finishing it.",
            "review_score": "1"
        },
        {
            "review_text": "I find the game very playable but some of the controls off 2 are missing and make life difficult. All in all very good.",
            "review_score": "1"
        },
        {
            "review_text": "Civ in Space.................... Do you need more?",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, it is definately a worthy successor to galciv2. That being said there are a few things that i'de like to see in the game that were in gal civ2 that are not in this version, such as ship crews getting experiance. However this game is still very good and has a whole bunch of other features that galciv2 didn't have. Sooo you really cvan't complain to much lol.",
            "review_score": "1"
        },
        {
            "review_text": "Great next-gen update of a truly fantastic series. Deep, playable cosmic grand strategy and warfare.",
            "review_score": "1"
        },
        {
            "review_text": "Very great take on a 4X game.",
            "review_score": "1"
        },
        {
            "review_text": "Grinding my way through the first level of the campaign. Perhaps I was supposed to attack agressively at the begining of the mission, instead of waiting to build up my planets. Almost as addictive as Gal Civ II.",
            "review_score": "1"
        },
        {
            "review_text": "Loads of fun.",
            "review_score": "1"
        },
        {
            "review_text": "I've played most of the Civilization series, most of the Total War series, Age of Mythology, Star Wars Empire At War, and now Galactic Civilizations III. I enjoy long games with giant maps. It took me a couple play throughs just to get the hang of how this game opperates.  I've never seem this level of customization in a game, and if there are games this customizable, I doubt very much their customization is as essential in those games as it is in this one. Of course like any strategy game, you can customize what to build on each planet you colonize, but you can also customize ALL your space ships, from your colony ship to your huge capital ship. I'm talking about more then cosmetic changes by the way, you can customize what type of engines, weapons systems, defence capabilitys, and other odds and ends.  Anyway, it's the best game I've ever played, I'm on my 3rd playthrough and I expect it to take me roughly a few years to completely conqeur the galaxy because I chose the biggest size (Insane).",
            "review_score": "1"
        },
        {
            "review_text": "If this game looks appealing to you as a 4X game with empire management, and in-depth tech tree and a ship builder then buy Space Empires V instead. It came out in 2006, costs less than $5 and it 100 times better than this game will ever be.",
            "review_score": "-1"
        },
        {
            "review_text": "same game as before, the battle view really sucks, and you can't auto regen new map in the begining, but over all ok sorta glitchy",
            "review_score": "1"
        },
        {
            "review_text": "I highly recommend this game for anyone who enjoys turn based strategy games. In my opinion what has made this series so successful is the gradual changes largely directed by the playerbase. I have purchased every Galactic Civilzation game Stardock has made and I believe I will continue to do so in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Just to be clear i gave this game the thumbs up becuase a I love playing it, but i do not recoomend this game. It is HARD and freakin complicated with more layers to it then ive seen in any other game. So far playin it is the most fun i've had while playing a 4x but it is also aggrivating as hell. this game will hook you if you start playin it and youll love and hate it at the same time buyer beware ",
            "review_score": "1"
        },
        {
            "review_text": "Galactic Civilizations III is in a word, good. It is an improvement upon Galciv II in many ways (which is what you always want from a sequel), however this experience is still sometimes marred with the occasional bug, or lack of polish  For those that have never played a Galciv game before, let me give a brief overview.  For starters it is a 4X game (Explore, Expand, Exploit and Exterminate). This means that like many 4X games you will be creating an empire from, the ground up, researching new technology, making alliances and enemies and eventually destroying those enemies some times.  In many ways, this game resembles the popular Civilization franchise, however there are several key differences.  1) this game is in space. there are no hills, rivers, lakes or 'ideal' city spots. you cannot just create a colony where ever. it has to be on several randomly generated (and varing in quality and appearance) planets.  2) the colonies can specialise further than any city ever could. There are planet wide bonuses to certain things, and due to limited space on a single planet, you have to choose carefully what you place down. New to the series is the idea of 'adjacancy bonuses' which work similar to Xcom, in which there more buildings of a similar type you put down, they all give each other bonuses 3) you can create, design and upgrade your own personal ships. Unlike in Civilization where you have stock units, and Endless Legend where you can 'upgrade' units, in Galciv you literally design and build your own units from the ground up.  4) Also unlike other 4X games, there is very little combat early on. infact, rushing to combat usually means you lose. Galciv takes the approach of 'we just got into space, we are not going to immediatly start strapping guns on things' as such, races are much more likely to develop alliances with you, and trade, which leads to an overall more peaceful and relaxing game. Also, when war does come, it comes in force.  5) Finally, the Ideology system works a bit like beyond earth, but more subtle while at the same time granting greater benifits. You choose between Good, neutral and Evil essentially, and each tree has amazing benifits. not only that, but you are not confined to one like in Civ:BE, as you can take perks from all 3 trees at any time  So to wrap up this little intro for people new to the Galciv franchise, think of this game like Sid Meiers 'Starships' if that game was actually good and interesting  Now, for those who have played Galciv before, but are unsure about getting Galciv III.  It is more than just the graphics that have been improved. The ship creation kit is more in depth and advanced than ever before. The Ideologies are actually quite interesting, and while not game changing they certeinly make it more fun. Tech specialization, which is where you can choose 1/3 benifits for each tech (e.g. longer range laser or faster laser, less expensive components or less mass etc) adds a great deal of tactical thinking to the game, as it forces you to specalise your empire, although the other 2/3 techs can always be traded for. The addition of strategic resources adds a bit of a resource grab in the beginning, and can allow for some really powerful ships (which is always fun) However, the Ai cheats like always at higher difficulties to dont expect any groundbreaking innovation there.   There are also dozens of smaller changes, like rally point management or the ability to go to an empire screen and tell all ships empire wide of type a to upgrade to type b, or stop what they are doing and travel to point c is really handy.   all in all, if you like 4X games, or the Galciv series, I suggest you pick up this game. It may not be a 10/10 ign, but it is definetly one of my favourite games of the year",
            "review_score": "1"
        },
        {
            "review_text": "64-bit native support is great, allows for some insanely huge and long games.  Gameplay is painfully dated. Insane amount of micro especially at end game, numerous bugs and crashes, performance issues on immense size maps. Its GalCivII but bigger, and not necessarily better due to it.",
            "review_score": "-1"
        },
        {
            "review_text": "Its a bit confusing for new players,and isnt with its own problems,but its fun sitting there creating your own factions and playing as them and against them.I'd recommend it fully,just know it will take some time getting use to it,its a challenging game knowing how all the stuff works.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, great idea for a game. I mean, Civilization in space? Conquer a galaxy of hundreds of star systems with armadas of custom built space ships? ♥♥♥♥ YEAH.   Only thing is, you can’t. At least I couldn’t. My huge galactic campaign game just refused to end it’s 357th turn. None of my attempts to fix this issue succeeded.   6/10: It would be a great game if it worked.",
            "review_score": "-1"
        },
        {
            "review_text": "It is pretty awesome and isn't too hard to learn and play.",
            "review_score": "1"
        },
        {
            "review_text": "Best x4 turn base strategy in space if you love games like Civ, Master of Orion 1,2 GC1,GC2 and ES you will love this game  in my opinion better then Endless space and new Master of Orion but Tbh Orion is still in beta  only concern and bad thing in this game is that is to slow on bigger maps if you don't have really strong machine  i cant imagine how slow will be to play on bigger maps then Gigantic probably nightmare  also game have short campaign and don't have government and elections like in Gc 2 Any way i strongly recommend this game my opinion is one of best turn based strategy on market today",
            "review_score": "1"
        },
        {
            "review_text": "Wish you could do a playlist of your own music. Needed to disable music and use seperate music player.",
            "review_score": "1"
        },
        {
            "review_text": "Good game though it has a learning curve that is hard to deal with. Clunky interface, and slow play, but overall good.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. The best of the Three.",
            "review_score": "1"
        },
        {
            "review_text": "Very slow and in-depth TBS. Game-time is on par with Civ 5, but learning curve is slightly steeper. Focusing individual colonies on a specific field is a must, and the early game can be a bit grindy. Races play a major factor in gameplay style, but are well-balanced. Could benefit from unique bonuses like Civ Wonders or SOSE Artifacts. Ship designer is powerful, but needs an auto upgrade algorithm for custom designs. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "I dig it. It's a ton of fun. After running through a few time's I'd like some full scenerio mods though. Over all a great game good for many tens of hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game seria have own specific features, so it need a time while you get used to it. Graphics is good, you will not find anything astonished there.  Strategical part is very rich, I liked very much big galaxy with sparse stars, this encorage to built a cultural supporting starbases to increase empire flight range and influence zone. And this create impression of infinite space were you emprire rose up. I don't realy like tight universes, when distance between stars is ten movement points or so. Tech tree is good too, it one of the best i've seen. Each weapon tech have own starting point and it will splitting on multiple branches later, and each reseach branch give you something interesting. And this scheme applied to every aspect such as production, food, research, money, tourism. This is very nice. Only one thing missing - tactical fights like one's in MMO2. With tactical fights thig game will be perfect one. Of course this game have some other flaws. I don't like how to ships designs managed, i'm tied to switch to user's designs every time. And I can't see easily is that ship have a newest one design or it is obsolete already. ",
            "review_score": "1"
        },
        {
            "review_text": "Great Game Hours Of Fun",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game. Grab a drink, put on something to listen to, and prepare to sink hours into conquering the galaxy.",
            "review_score": "1"
        },
        {
            "review_text": "If you like turn based strategy games, you might find this crack-worthy. The cosmetic customization in the ship designer is insane, there's nothing better than running around late game with a fleet of star destroyers right out of Star Wars.",
            "review_score": "1"
        },
        {
            "review_text": "I've never played any games in the series before, started this on tutorial which tells you.....nothing. Really, nothing. New colonies on other side of galaxy with no ships that can get there, won't tell you how to get such ships. Quests of kill pirates but no idea where they are and wars declared with no idea what to do.  I could try to spend hours trying to figure it out myself or try to refund the game in 2 hour the time allotted before I found out --even if the tutorial was worthy of being called such-- how much I hated the game. I might have tried longer with a more generous return policy",
            "review_score": "-1"
        },
        {
            "review_text": "Its just not as fun as other games of the same type.",
            "review_score": "-1"
        },
        {
            "review_text": "Very well made and addictive ... 'just one more turn and then ill leave for work ' addictive. If you enjoy long term planning , cerebral, strategy games from a time when games were actually made to be hard .  This is a great reboot of the originals with better user friendly interfaces and graphics. 9 1/2 out of 10 stars  &gt;&gt;&gt;update&lt;&lt;&lt; Playing huge maps is not as fun as i thought it would be and take forever to complete... like a few weeks, mostly due to the program getting hung up between turns . the next DLC pack offered better have some amazing stuff and actually have a campaign that actually is a challange",
            "review_score": "1"
        },
        {
            "review_text": "If You loved the GalCiv II, then You will love this one.",
            "review_score": "1"
        },
        {
            "review_text": "This is the game that Civilizations : Beyond Earth should have been",
            "review_score": "1"
        },
        {
            "review_text": "Crashes to desktop all the time so 100% waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "I am disappointed. I think they will make this a great game with 2-3 DLCs. Right now, get your Space Emperor fix elsewhere.  You will sink many enjoyable hours into this game as it is, but you will be left hungry for more and unsatisfied. There is a lack of polish and some common sence features missing, like being able to tell the AI to 'get the heck outta my territory or else,' for instance... It is pleasant to look at and there are some great ideas in it, just poorly executed ATM. There are so many choices the player can make, that it makes choices meaningless. The battle view is a joke. I'm sorry to say - it looks really bad.  You'll want to wait until late 2016 and take a peak if they've release some major DLCs before picking this up. In the meantine I would recommend Endless Space, the final version of it is polished and immersive.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is fun, however i do believe the AI is not fair. no matter what stats i do, it seems all other races except the minor races progress alot faster than i do. Example, i went to bomb a planet with no ships defending, the next turn that planet had 3 ships, with one shipyard? Other than that, game is has not crashed. The Tech tree could have more info on what your researching.",
            "review_score": "1"
        },
        {
            "review_text": "Good game that builds on the features of the previous installment, but adds a litle more features. Would prefer to have the ability to customize the drones from the carriers, or the ability to customize the stations. If my computer was higher end I would really enjoy it more. I does feel like some features from past games are missing like some base ship models",
            "review_score": "1"
        },
        {
            "review_text": "Not a bad game, but in current state not worth the money. Its advertised on steam sa a multiplayer game, but the multiplayer is a totall mess.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has too many stability issues. Often freezes up and crashes way too often. Had I known I would not have bought this game. I would think twice before buying from the same developer.",
            "review_score": "-1"
        },
        {
            "review_text": "if you played Civ 2 this is an enhanced and somewhat improved version. It doesn't break any new ground. If you didn't play the previous versions then this is a pretty good game of space exploration and conquest.",
            "review_score": "1"
        },
        {
            "review_text": "Sound constantly stops working, even with the 1.2 patch. Never had this issue before with any other game.",
            "review_score": "-1"
        },
        {
            "review_text": "Singleplaer average, multiplayer a mess.  The singleplayer mode has some good ideas, like the tile system where neighbouring buildings increase each other's efficiency or the ship deisgner, but also some rather jarring bugs, like planet seed options that seem to have no effect whatsoever. Some aspects of the game are blatant copies of Master of Orion II or other classic games, like the racial trates, somewhat uninspired but at least they work.  But the by far biggest drawback is the multiplayer mode. It simply doesn't work, it crashes while loading old savegames, crashes while autosaving, multiplayer savegame files get unforseeably corrupted, if you want a game to play with some friends then better keep your hands off, you won't get past round 50.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought the game for myself and a friend just for multiplayer but it doesnt ♥♥♥♥ing work... Opens and crashes everytime. Why the hell is this in 'released' form total joke.",
            "review_score": "-1"
        },
        {
            "review_text": "If your video card sucks (such as something with 'shared memory'), don't buy this. It will crash very soon.",
            "review_score": "-1"
        },
        {
            "review_text": "i can play this game for days on end.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game altogether for the lovers of these kind of strategy games.  4/5",
            "review_score": "1"
        },
        {
            "review_text": "i didn't experience any major bugs whatsoever",
            "review_score": "1"
        },
        {
            "review_text": "like the game. need to better develop tech tree. I know what I want research to that goal. alert when pirates enter area of control",
            "review_score": "1"
        },
        {
            "review_text": "Good next step from gal civ 2, hopefully patches add some more polish as with galciv 2",
            "review_score": "1"
        },
        {
            "review_text": "I'm an avid player of the Civ series and its knockoffs, but this is my first foray into Stardock's GalCiv series. I have a kid now so I have limited time to invest in a game's learning curve.  My experience is that this game is crushingly hard. Even set to beginner difficulty I've been destroyed in the tutorial thrice. Finally I taught myself more and got more success by starting and restarting a skirmish game. I played that until the game ended after a set number of turns even though I had turned the turn limit off, sadly just as things were getting exciting.  GalCiv3 has a lot of features that make me think great things about the end game, but I can't reach the endgame even on beginner, so I'm not really enjoying it like I hoped. My review of the patch notes shows that the AI recently received a big bump: perhaps the beginner setting was bumped more than anticipated. I suppose the good thing is if you've got the time to invest becoming an expert at the game it will provide a lot of challenge.   I plan to put this game on the back burner and see if my enthusiasm regenerates or if some online strategy research helps my game enough that I can break out of the tutorial.",
            "review_score": "1"
        },
        {
            "review_text": "A worthy sequel to Galactic Civilizations 2 that actually improves on some of the faults. The new shipyard system and galactic resources are fantastic. The AI is pretty smart. The tactical combat is far more intricate and better looking. If you are looking for a turn based space empire game this is a good choice.",
            "review_score": "1"
        },
        {
            "review_text": "Nice long-term pasttime. Good detail. Makes you think.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very diverse with many different technologies and races. A great aspect about this game is the ships. While most games simple give you a set of ships to work with, Galactic Civilizations III also allows to create ships of your own make and desgin. You don't have to use their ships, you can make your own. There is also rich set of pieces to work with. There is a great history to the game and races. While I have not gotten too far into the game or campain, I look forward to seeing what else this game has. I give this a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game with a very responsive team. Improvements and fresh content keeps getting added regularly and the game itself is immersive and damn fun to play. If you like 4x games, buy it, you will not regret the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Only minor glitches once every hour or so. I have missed this game very much.",
            "review_score": "1"
        },
        {
            "review_text": "Really like it, a good upgrade to a good game. Worth buying and not much is these days.",
            "review_score": "1"
        },
        {
            "review_text": "GOOD SOLID GAME WITH A GOOD MODDING COMMUNITY, DIFFERCULT TO LEARN, BUT ITS WORTH THE EFFORT. i WOULD RECOMMEND OTHERS TO BUY IT.",
            "review_score": "1"
        },
        {
            "review_text": "Galactic Civ III is a pretty good take on the 4X genre. I picked it up on sale, and I have gotten my money's worth. The current (1.5 I think) patch suffers from a bug which causes the game to hang after 5-6 hours of play. This is on an otherwise rock solid machine with 32G of RAM. Frequent saves and a restart are needed for any serious play.",
            "review_score": "1"
        },
        {
            "review_text": "I like it. Its large, expansive, better then Sins of a Solar Empire. Its a nice ship RTS. Shipbuilding is really nice as well. The A.I is vast, some factions may try to rush you, others just focus on trade, which has a nice realistic feel.  It runs well on slow and old computers as well. Some have said that the DLC is small, however for 3$ a piece, I even own the events one.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoying the entire game!",
            "review_score": "1"
        },
        {
            "review_text": "after playing GC III (galatic civilizations 3) i have noticed only a few things that i do not like about the game and a lot of things that i do like about the game. to begin i should say i have only played GC III and none of the galatic civilizations games prior to this, so this is a first for me. i like the game-play of this turn based game, i normally don't go for turn based games but this one caught my eye.  the first game i played was a large scale game with just bots to get used to it. its slow when the game starts out, and there is a lot of times you are just clicking the 'next turn' button. however, once you get past the starting stage there is much mre to do. for me, i enjoy random events that actually impact the gameplay, and there is a good couple events that do just that. more over, the colonization of planets in this game and how you can build planetary infastructure is done extreamly well.  the one complant i have about this game is the combat. the combat in this game i think is done very poorly in the aspect that you have no control over your ships and where they go and what they do. i wish they would have put in a touch of RTS for the combat but they did not.  despite the combat, is still a great game.",
            "review_score": "1"
        },
        {
            "review_text": "I'm new so may not be aware of all that is available. I don't see an encyclopedia or study guide or FAQ to answer some basic questions. 1) How do you start a trade route? I deal with aliens, make agreements for trades, get the permit or whatever, see the route, but don't see that my transports are being routed. 2) When I group the ships I do not see how to ungroup them. Same situation when they get linked to a starbase I don't see how to detach them for other operations. 3) I may not be working this right, but when I do not want a ship to move I hit the space bar and typically this ends the turn, even though I have other ships that may have range left, or ones that I have not yet selected. 4) I am not clear on a lot of the planet development process about improvements, automatic upgrading or replacing existing objects. Can they be automatically upgraded.   More play may answer some or all of these questions, but as a neophyte I have these type questions.  Mostly it is one heck of a lot of fun, a lot of fine detail in the ships, so many directions to develop into all the detail is greatly appreciated.  I really like the battles, but don'e see any way to end them even if I should be able to outrun them when I have a speedy craft (with little or no fire power) that should be able to make a run for the astroids.  Too much fun, gotta go play.",
            "review_score": "1"
        },
        {
            "review_text": "Really enjoyed playing this game, but it slows down the longer the game goes with an insane galaxy size. However, this is to be expected.",
            "review_score": "1"
        },
        {
            "review_text": "I like the space stations and how they can help your civilization out. I would like to be able to pick and choose what type of scientist to have like a robot or cyborg or human male or female scientist/researcher to have who shows up after researching a technology. I suggest options to have at the beginning and after researching so much. I also suggest be able to change your leader and type of faction within the civ. like in the previous game. I liked a lot of what you could do in the other Galactic Civ. 2, especially the espionage. I wish you could have a pop up screen like in Galactic Civ. 2 where you can alter the way of spending for everything for faction. I do not like the pop up screen In Galactic Civ. 3 where you change the way of spending for the respective faction, it is not very realistic or fun. When I set the difficulty to normal in Galactic 3 the Drengin Empire somehow created over 600 ships in two years which was rather ridiculous even with 55 colonies I could not build that many attack ships in that time. I liked the galactic news pop up screen in Galactic 2 after every turn. I don't like the pop up screens for Galactic 3 after the survey ships find something. I wish there were a lot of Galactic 2 incoporated into Galactic 3. I didn't like the espionage pop up screen in Galactic 2 with that big weird looking operative. I do like the level of graphics put into Galactic Civ. 3, however I believe some of Galactic 2 should have put into Galactic 3 to make it better, especially the colony screen was pretty good in Galactic 2. I do like Galactic Civ. 3, however I recommend that some things could be changed to make it better and more intersting like the survey ships could find more stuff from different eras, different battles including from the precurser eras and battles or other possibilities or other civilizations. I wish colonists could find things while exploring every planet and there is a kind of short movie kind of like in Star Trek, that might make things more interesting. It is a big universe and many positive or negative possibilities and good, neutral and evil cultures and civilizations out there no matter what NASA says or does not say. They will have to tell the truth someday. ",
            "review_score": "1"
        },
        {
            "review_text": "The customizablilty of the game is fantastic I can play the way I like to win instead of just having a set course before me.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game, one of the best 4X games since....well....GCII",
            "review_score": "1"
        },
        {
            "review_text": "TLDR: Very good game, 4X done exceptionally well. If you like 4X, you will like this.  Caveat: The only 4X games I have played MOO 1-3, Ascendancy (it's a really old one) and Gal Civ 3.  +Lots of fun races, each with a playstyle. +Great race creator tool. +Starship modding is addicting. +A good variety of events and random elements that keep things fresh. +Long games where you keep saying 'Just one more turn.' +Steep but fair diffuculty curve.  -No espionage. Maybe it's in a DLC? -Ship combat could be a lot better. You will press Quick Battle every time once you realize you can't influence the action. -The campaign was a bit meh. -Long games where you keep saying 'Just one more turn.' -I did really mean steep, it's pretty murderous. I said it was fair before because by the time you play for a few hours you start to get the hang of it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. lots to build and research. big worlds to explore. nice improvements on the diplomacy. Until war breaks out. thats where this game takes a turn for the worse. No matter what I do the AI (even when set to there lowest settings) have a major handicap and expand and build much faster then you keeping tjeir power score thousands above yours. hich causes them to constantly declair war and when they finally reach you there is no stopping them.",
            "review_score": "1"
        },
        {
            "review_text": "Killing this is good.",
            "review_score": "1"
        },
        {
            "review_text": "It has been many moons since I have last played computer games. While searching Stream with my children we stumbled upon this one and were amazed as how challenging and intriguing this game appeared to be. After playing it we were surprised as how quickly time passes. This is a fantastic game but a terrible hinderence in getting household chores done :).",
            "review_score": "1"
        },
        {
            "review_text": "I'm loving it so far. The previous 41 hours have flown by. My only notable annyance is having to click the `Turn` button when I don't want to do anything that turn. I'd like to see `Turns` be automatic with the option of backtracking `x` amount of turns if I decide to carry out an intervention. My poor mouse and mouse finger are heading for an early pension.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game. Would say 8/10. Don't really know what I can say - if you have played Galactic Civ before then you know what to expect. If you haven't then you'll probably be better off starting with Galactic Civ 1 or 2 as a cheap way of getting into the series.",
            "review_score": "1"
        },
        {
            "review_text": "Quite good game, but sadly a bit worse and better than gc2.   The AI can see all the map, and that makes the game too predictable.",
            "review_score": "1"
        },
        {
            "review_text": "I love the game, I just wish it would stop crashing to desk top in multiplayer.",
            "review_score": "-1"
        },
        {
            "review_text": "larger maps with a high quantity of npc's frequently requires me to save and reload as it locks up during turns. the ai seems to be complete in a short time span and i've let the turnover last up to 10 minutes of pure stagnation. other than that, i love it. modern MoO2.",
            "review_score": "1"
        },
        {
            "review_text": "the game crashes a bit in multiplayer if the devs can work on that the game would be great  (update) the devs have yet to work on the crashes and with one of the last updates messed it up even more and now they have DLC out, i have one thing to say FIX YOUR GAME!",
            "review_score": "-1"
        },
        {
            "review_text": "Stardock has produced a game that will cause massive sleep loss as you will find it hard to resist playing 'just one more turn' and then realize that the sun is coming up, not setting...",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Love the different dynamics and strategy",
            "review_score": "1"
        },
        {
            "review_text": "This game is not what I was hoping for, but it was better than what I was expecting. I have been on something of a quest looking for a spiritual successor to Space Empires IV and it would seem that quest must continue.  Galactic Civilizations 3 has a beefy ship construction system, but with little actual instruction on how to use it it can be cumbersome and frustrating to get the hang of. The game itself plays almost painfully slow for the most part, with many an idle turn spent simply ending the turn. This makes it feel like either the game needs more to do or the time it takes for things to build/research needs to be reduced simply for the sake of expediency. It is actually somewhat easy to get bored with the constant ending of turns. The camera is also frustrating, as you have to click and drag it around and cannot simply move with the WASD keys like nearly every game allows you to anymore.  The combat is based around a Rock/Paper/Scissors weapons system where lasers are countered by shields, missiles are countered by point defense, and kinetic weapons are countered by armor. Simple enough, but the game lacks any kidn of tactical combat whatsoever, instead allowing you to auto-resolve battles or sit and watch them. The psuedo-cinematic battles are amusing to watch, but again the game is lacking in the 'something to actually do' category. You do have the option to build your own race, which is nice. It will even easily let you load in your own images for a faction leader, and coupled with the ship builder can let you have a pretty good time there. The campaigns are somewhat frustrating in that each 'episode' starts you in a default position instead of letting your previous accomplishments carry over, which means you can easily restart one if you lose without saving, but means that what you accomplish goes away at the end of each session, leading to more long waits filled with clicking the end turn button. There does appear to be multiple option to free-play, which may add some actual longevity to the game, but it isn't enough to make this game great.  In all honesty this is a mediocre game with a pretty great customization feature. If you are looking for a simple and straight forward sandbox gaming experience on a galactic scale, this isn't too bad. It does have quite a lot of DLC, which if you are dying for a touch of story with this game then by all means, go for it, but otherwise I would strongly encourage you to start with just the base game to see if its worth investing in all the rest.  I purchased the full package while it was on sale, and honestly kind of regret it. I think if I had only bought the core game I would have been happy with what I got for the money, but as it stands I am a touch disappointed, really.  Going to go ahead and thumbs up this only because it is just good enough to make me want to spend a few more hours in it, but I feel it is one that will eventually drift into that forgotten place where old games go to try and collect enough nostalgia to get you to play them again.  Seriously though, buy the cheapest option before investing into all the DLC's and expansion. Plunging straight into the whole kit may well lead you to regrets.",
            "review_score": "1"
        },
        {
            "review_text": "Okay i need to say i like the game before i go on and only have the basic game, no dlc , so why don't i recommend this game, well its just galactic civ 2 with a shiny new UI, its not really had anything major added and probably less that gal civ 2 did with all DLC.  It is essientially the same game just more buggy, better looking but slower running and it costs so much more so i cant recommend this because Gal Civ 2 is a better alternative.  IF both games end up a similiar price id advise going with that one but while this costs so much for the game (and the DLC) it is not worth buying   All the DLC for this game comes to £45 which is a lot to fork over and i will likely get it on the next sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Fix your bugs before launch new DLC!",
            "review_score": "-1"
        },
        {
            "review_text": "i like it! you can create your own race! you can create your own ships! ANYTHING!",
            "review_score": "1"
        },
        {
            "review_text": "Oh God there's so much to learn. Not for the faint of heart- but if you want some depth, you've got it!",
            "review_score": "1"
        },
        {
            "review_text": "If you like turn based strategy games, play Galactic Civilizations III, it's awesome. I like being able to design ships, build up worlds, expand empires and play at war (if need be). So many ways to go about playing this game: peaceful, diplomatic, technology focus, war driven, industrial, cultural... it's enjoyable. It's not a huge action based game, but I really like strategy games.",
            "review_score": "1"
        },
        {
            "review_text": "If you love to fantasize about being the ruler of an enormous galaxy, the commander of a massive and diverse naval fleet or a badass galactic conqueror, then buy this game. GalCiv 3 is the pleasent culmination of 4X Grand Strategy with almost too many little details to monitor. If decision-making and long-term planning are to your taste, then please, buy this game!",
            "review_score": "1"
        },
        {
            "review_text": "Hard to get used to. TBH I meant to buy Stellaris and accidently bought this, and was very angry. Now I really love it, its a great game, but horribly broken with its AI as they have huge advantages anything above normal. Like not having to pay matienience (AKA ♥♥♥♥ tons of money), but on Easy, where the AI has the same starting position as you, its kinda, well easy because once you know how to play you can usually beat them. It just seems like there is no in between difficulty, its either 2ez or What the ♥♥♥♥ mode.",
            "review_score": "1"
        },
        {
            "review_text": "I will say this it's a good game but as any good game out there it has it's faults. It's a fun space Civ game that allows you to custom build ships or you can use the pre built if you don't want to build your own it's completely optional and it has a great amount of parts that you can customize your ships with it's fun to play around with. The game play however is something completely different I like playing on largest maps cause I like space to play around in to do my own thing but I got to say that game play with that large of a map is sluggish there isn't much of anything to keep my attention, the tech lacks luster as well nothing really sticks out the tech tree seems to span out and doesn't seem like there's much meat to it. Base building seems lack luster as well yeah you can plan out your own planets and it lay out it's just dry after you plan out your planets there's almost no need to go back to your planets after your done planning it out the first time and you only do so if want to make small improvements to the capablity and the grade of planet just determines how much ♥♥♥♥ you can place on it and nothing else as well. This games is fun but if feels like it needs polish it needs meat nobody likes chewing on dry bones this game can be so much better and if it had lots of content it would be much better.",
            "review_score": "1"
        },
        {
            "review_text": "While I'm giving this a yes, it's actually more of a 'Not Quite Yet'. All the bedrock and core is here, and it is exceptionally solid, well designed, and all the other standard praise words, it's lacking compared to GalCiv 2 in terms of sheer content scope. Politics, Spies, AI fine tuning, and general balancing is still missing and there's a dearth of tech tree options at the moment. There's also some bugs.  Basically, the game is fully, absolutly functional, and its only real problem is that it's standing in the shadows of a game with two expansions and alot more time to be polished.  ----------------------------------------------------------------------------  Edit: The game has had a long time to improve and has not improved significantly in terms of its core flaws. Changing 'Not yet' to no.",
            "review_score": "-1"
        },
        {
            "review_text": "Great game! Sometimes a little buggy but they always seem to patch it regularly.",
            "review_score": "1"
        },
        {
            "review_text": "Although there's a few features missing that could easily make this game better than it is now, having bought it on sale, I would recommend it, but not at full price.",
            "review_score": "1"
        },
        {
            "review_text": "Love all the choices and the long-term stratagey.",
            "review_score": "1"
        },
        {
            "review_text": "Great game with very advanced AI. Its the best space 4x game around. I love it.",
            "review_score": "1"
        },
        {
            "review_text": "It's a solid 4x game with a lot of variety in building and strategic possibilities. There is good support for customization and modding. Gameplay can be rather slow at times. I think it needs more content to catch up with its predecessor, but I think the economy and the UI in general are easier to grasp in this one.",
            "review_score": "1"
        },
        {
            "review_text": "I would recommend this game, especially if you liked GalCiv 2. Pros. -Personnally I think Diplomacy is a little more thought out. -Ship design, production is stream lined. -Empire management for everything is much more convenient. Things like idle colony alerts help.  -Starbases are far more important now and rare galactic resources actually feel unique and important.   Cons.  -Still suffers from issues in massive maps that cause bugs between turns that force you to exit and reload. -The new range part of weapons can make certain weapon techs less useful than suggested in actually combat. (early game missiles give you the first shot and almost guarantee the win if the enemy is not missile tech even if their ships are 'stronger') -Creating custom races doesn't use your description. It just uses the description for your base race.   Overall it's a good successor to GalCiv 2 and I would recommend switching if you still play the old one.",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game",
            "review_score": "1"
        },
        {
            "review_text": "I think that there are too few real changes. It is still basically the same game. Slightly better graphics. But, the end game graphic is short and disappointing. GC2 gave you the ability to call up all the planets you have discovered and put them in order to make it easier to determine where to send your colony ships next. If 3 has it, I can't seem to find it. I just started playing the the mercenary DLC. Hope that adds more entertainment value.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been playing this game for about 60 hours now, and i cant stop! I think its Civ 5 ins space and its just an amazing experience. If you like games like civ 5 and beyond earth then you wil not be disapointed!!",
            "review_score": "1"
        },
        {
            "review_text": "Once the game gets going there are none in the Genre that can compete. I have over 400 hours of Civ 5 on the books. This is far superior. Hands down.",
            "review_score": "1"
        },
        {
            "review_text": "Having never played the previous Galactic Civilizations games I was hesitant to jump into the third. I had it recommended to me by a friend and I am glad I took a chance on it.   Pros: The high degree of customization for ships and player-made races, attention to detail of just about every facet of the galaxy, and the ability to take different paths to victory adds a lot of replayability to the game.  Mixed: The learning curve for the game was steep. Although there is a tutorial for the game, there is very little in the way of detailed explanation to help a new player understand why their production or research is poor or how to utilize starbases for things other than mining or gaining precursor relic benefits. The tutorial enemy AI is completely unforgiving and doesn't care that it is the players first time out. I was up for the challenge though and found it satisfying to dig through the various menus. Using trial and error to determine how the synergy bonuses worked for each structure, how to build better ship designs, make bold research path decisions, consolidate and improve or expand recklessly are all part of what makes this such a fun game.  Cons: Load times are long, especially when connecting to a multiplayer game, anywhere from 30 seconds to 2 minutes for SSD equipped machines with 30Mbit connections. Crashes are a rare but frustrating experience, best mitigated by lowering the auto-save turn counter. AI civilizations tend not to have much in the way of unique dialogue or interactive options, those who aren't at war with me are always glad that I'm 'walking upright', a response that seems oblivious to their various introduction messages. Warring civilizations don't seem to adjust their fleet composition to beat their chosen enemy, they also leave large defensive fleets spread throughout their occupied space even if they are needed elsewhere. I believe this leads to enemies who bankrupt themselves with high upkeep costs and build world impovements in seemingly arbitrary ways.  Overall, Galactic Civilizations 3 is an engrossing game that has already taken a ton of my free-time and will happily be given tons more.",
            "review_score": "1"
        },
        {
            "review_text": "The empire building is very good but the combat is sadly lacking, the player has no role in it other than building the ships.  A flee mode would be good, as the non-combat ships would not try to engage in combat.  This is a good 4X game, visually pleasing and challenging to play",
            "review_score": "1"
        },
        {
            "review_text": "While it's a break from previous games in terms of colonising the updated morality system is quite intuitive and once you get the hang of the colonies it plays very smoothly",
            "review_score": "1"
        },
        {
            "review_text": "The AI is particularly adept at kicking my butt, but the game is fun until then.",
            "review_score": "1"
        },
        {
            "review_text": "fun game waiting for more DLC",
            "review_score": "1"
        },
        {
            "review_text": "Awesome fun, can play this game for hours.",
            "review_score": "1"
        },
        {
            "review_text": "been playing a it now love the game even though i loose more than i win better than beyond tommorow",
            "review_score": "1"
        },
        {
            "review_text": "Great game, lots of customizability.",
            "review_score": "1"
        },
        {
            "review_text": "I´ve played Galactic Civilizations as youngling and this folowup met my expactations.  + Micrograment is great, from politics over managing planets to creation of your own spaceships to thrive in battle. It works. + Make your own race / Dominate the galaxy / Repeat + Many events spices up the game  - Battles could use a little more love - There is a lot to learn and the tutorial is poor, explanation of some technologies or how to use them is sometimes even missing and GC wiki doesnt help you with that  8.5/10 ",
            "review_score": "1"
        },
        {
            "review_text": "It seems that no matter what setting the Dregan empire is set on, it builds ships and weapons way too fast. They seem to be overly powerful. It takes too long to build defenses and offensive weapons on starbases. Game seems to not be really balanced. The attackers on planets always seem to win.",
            "review_score": "1"
        },
        {
            "review_text": "I have played The Galactic Civilization franchise for many years. This game is a great revamp of those franchises. If you ever played the others you'll love this game for the price that I bought it. Got it on sale with all dlc's for 26 dollars. Well worth the money for what you get.I understand what others are saying though. This version does not blow your mind with any new ideas. It is though a better deal at this price point than Civilization BE. That franchise has been doing alot of cookie cutter stuff lately and it hasnt been very good. For the money and the memories it brings me I think this is a good buy.",
            "review_score": "1"
        },
        {
            "review_text": "So I was having problems with the recent 1.8 update. Basically, the game was hanging during turning processing in a long conquest. It was quite frustrating.  I sent my save file on to Stardock support and they got back to me within a day telling me that an upcoming patch should fix it.  The initial 1.8 hotpatch #1 seemed to produce another issue, where mousing over an enemy freighter would cause a freeze. This seems to have been fixed in 1.8 hotpatch #2.  The 1.8 hotpatch #3 identified and fixed the freezing problem (it was the pirate faction at fault) so hopefully I can get back to my conquest victory.  Stardock has done well getting this fixed in just a few days!",
            "review_score": "1"
        },
        {
            "review_text": "I've played before the graphics were changed, needless to say. This version is a lot better.",
            "review_score": "1"
        },
        {
            "review_text": "Multiplayer no longer crashing.",
            "review_score": "1"
        },
        {
            "review_text": "The game is great although it takes a while to learn the functions of the game and how ot actually win a match against the a.i. If you dont mind a match taking days to finish then this is definetly a game for you because the money to play time is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "If you like tactical ship combat, this is not your game. If you hate micromanaging the endgame, it's also not your game (although they're working on that). If you like sprawling 4X games with amusing graphics and just need a ship design sub-system that's huge enough to devour your entire life, then this is your game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game very, simular to GC2. Still has a few rough edges but nothing too serious. Start on a very large map if you are new to the series, that way there is not a lot of pressure for the same planets and you can experiment and get the feel of the game before you meet any tough aliens. On average difficulty the A.I. is not real tough so that is a good place to start. Remeber to balance your military and social developement. Like the real world a stromg military requires a strong economy. The patches are making the game worse. 1.3 patch made it difficult to handle large fleets. A few more patches like this and it won't be playable.",
            "review_score": "1"
        },
        {
            "review_text": "OK, it's a OK game. i can't say it's bad or good it's just ok. evry1 mentioned about ship designer but its not so good engh. i prefer star ruler 2 style design. No real time combat it can be reasonable for this gameplay style but agin it's ok not bad not good. it's so smilar to civ 5 it's ok agin.   I am natural for this game but if u are a pro of 4x rts games u are not missing something new.  Maybe problem is i have so much expectations from this game but there is nothing to suprise me.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun strategy game.",
            "review_score": "1"
        },
        {
            "review_text": "very fun game much like the mod in civ4 which i think this was base on (at least in these series of games) would recomend any one who likes turn based games",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy playing this game. I play more on this game than others I have.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, time I updated this. I originally gave GalCiv 3 a scathing review because it was in pretty poor shape on release IMO. However, Stardock has consistently released patches for the game, improved manyof the issues I had with the original release and promise more down the road.   I plan on updating this review later with some more detailed thoughts but overall the game is good with ONE caveat: I'm playing with ALL of the DLC and that makes a huge difference in my opinion. Especially the Precursor Worlds and Lost Treasures. Those two spice up the game with new and interesting things.  The strongest part of the game: Planetary management. The adjacency bonus is sheer genius and if you top that off with the unique Precusor worls' expansion it makes for some interesting strategies. The improvments that they've made with starbase management have made things much easier   Weakest part of the game: Combat; plain and simple, just sucks. Stardock opted for hands-off combat mode so outside of ship design you have no influence over combat. Now, I consider myself more of a MOO guy than a CIV guy so not having tactical combat is a big downer to me but I understand why they opted for a hands off approach. That being said, it would be nice to have SOME limited options in battle or outside of battle to better direct my ships. Ships just charge at one another until they get into point blank range and slug it out. Also, the weapons are simply incremental improvments to each other. 'Laser does 10 damage, Plasma fart gun does 30' etc. There's no unique abilties or characteristics of weapons that gives it any flavor. Come on guys...you're the studio that gave us FE:LH and Ashes. Surely you guys can do better than this for combat.   Those aren't the only strengths and weaknesses of the game, but those are the main two for me. Overall, its a good game now but still a big uneven in places. However, Stardock has made greate strides since release and they plan to do so for several years to come.",
            "review_score": "1"
        },
        {
            "review_text": "Original review shown below for reference. The good news is that most of the issues I found to cause the game to be borderline unplayable have been resolved (finally, with v1.83, the minimum required keyboard shortcuts were included).   Brad (Forgboy/Draginol) has also just started putting some time into the game - and that means the AI will be getting a lot of attention. I'm sure I'll disagree with some of his balance changes, but they can easily be modded.  Not sure I want to risk a game with surrenders enabled again just yet, as I don't know if that behaviour has been changed - but overall things are looking a lot better.  ORIGINAL REVIEW: This is hard for me to write - I am a big fan of Stardock in general and the GC franchise in particular. I have literally thousands of hours clocked in GC1 &amp; 2, and feel I have given GC3 a good chance.   Somewhere in there is a great game, but it is going to need a lot of help getting out. The problems are too numerous to list in total, so I'll just point out the worst examples:  1. If there is a textbook telling designers how not to create a UI, then GC3 UI designers have followed it to the letter - constant moving from one side of the screen to the other with the mouse, as buttons / clickable options just seem to be randomly placed. Very limited keyboard shortcuts. Completely unsortable lists of ships / planets / starbases etc. You can't even change what a planet / shipyard is producing from these lists (like you could in GC2). The whole thing is a recipe for carpal tunnel!  2. Micro-management hell. The production wheel is a nightmare - setting anything to 100% is a game in itself, trying to drag the pointer on to the one pixel on the screen that does so. You can't progress to the next turn until every planet / ship has a valid order (even if that is just do nothing). Really useful when an AI surrenders to you and dumps you with 800+ ships. Yeah, thanks for that - quit game!  3. Diplomacy is so broken, it is beyond hilarious. As an example of what you can do... I just started a Suicidal difficulty game, gigantic galaxy, all stock AIs on 'Godlike' intelligence. I researched Universal Translator, then set 100% economy and built nothing. No ships, no planetary improvements, nothing. By turn 35 I had 182 planets, 54 starbases, and was earning 14000bc per turn - yep, the godlike AI just gave me everything they had as soon as they met me.  Time to move on - hopefully Stardock will fix this game, but I'm not sure I'll be back to check or not.",
            "review_score": "1"
        },
        {
            "review_text": "This game in it's current state is broken and not at all worth $50. It crashes every 30 minutes in multiplayer, has numerous lobby issues, ui issues, no private games, and many many more.  EDIT: This is no longer the case, game is great,",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Like a cross between Civilizations and Masters of Orion.",
            "review_score": "1"
        }
    ]
}