{
    "app_id": 227080,
    "name": "Papo & Yo",
    "release_date": "2013-04-18",
    "developer": [
        "Minority Media Inc."
    ],
    "publisher": [
        "Minority Media"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Indie",
        "Adventure",
        "Puzzle"
    ],
    "achievements": 10,
    "positive_ratings": 2405,
    "negative_ratings": 160,
    "price": 10.99,
    "description": "Quico’s best friend, Monster, is a huge beast with razor-sharp teeth, but that doesn’t scare Quico away from playing with him. That said, Monster does have a very dangerous problem: an addiction to poisonous frogs.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/227080/header.jpg?t=1452784250",
    "minimum_requirements": "OS:Windows XP, Vista, Windows 7 Processor:2.2 GHz dual core or better Memory:1 GB RAM Graphics:NVIDIA GeForce 6800GT, ATI Radeon X1800 or better DirectX®:9.0c Hard Drive:4 GB HD space Sound:Windows compatible sound card Additional:Game supports Multi-Monitor",
    "recommended_requirements": "OS:Windows XP, Vista, Windows 7 Processor:2.8 GHz quad core or better Memory:3 GB RAM Graphics:NVIDIA GeForce GTX 460, ATI Radeon HD 5870 or better DirectX®:9.0c Hard Drive:4 GB HD space Sound:Windows compatible sound card Additional:Game supports Multi-Monitor",
    "reviews": [
        {
            "review_text": "While not difficult or complex as a platform puzzler, Papo &amp; Yo offers visuals that are at times cartoonish and whimsical, but always hold an undercurrent of something truly sinister. There were times throughout the game, especially near the end, where I felt genuinely tense, and I found myself on edge in dreadful anticipation of what I knew was coming next- which is no doubt exactly what the story-tellers intended. Papo &amp; Yo has a story worth telling, and does not waste your time telling it.",
            "review_score": "1"
        },
        {
            "review_text": "What is a monster? What is a frog? What if your best friend was a monster? Papo &amp; Yo is truly a remarkable adventure, puzzle platformer which may make you rethink these questions. Truth be told, Papo &amp; Yo only caught my eye after a good friend of mine added it to his Steam Wishlist. As many of you may have done, I waited for this game to go on a 75%+ sale when it was released as Humble Indie Bundle X's beat-the-average tier. Luckily for me, rather than leaving this game to sit in my Steam Library to collect dust, I downloaded and decided to try it out.  What I discovered was one of the most captivating games I have ever played or watched. From the first scene, a black screen with white text: ''To my mother, brothers and sisters with whom I survived the monster in my father.' Vander Caballero,' to the ending of the credits, this game does not disappoint - it simply gets better.  Verdict: Papo &amp; Yo is simply an absolutely stunning game. It is symbolism at its finest and storytelling at its greatest. It is a visually gorgeous game loaded with an immense amount of creative ingenuity. In order to not reveal any spoilers, all I can say is 'this game is a must-play.' You know a game is good when all you can do is sit in awe, thought, and understanding through the entirety of the credits after you complete it.",
            "review_score": "1"
        },
        {
            "review_text": "Initially I thought Papo &amp; Yo was a platformer with simple puzzle elements intended for children, but I was greatly mistaken. The game appears to be very happy-go-lucky and easy on the eyes, but when you dive deeper into the game, you realise that every object and character around you are tiny pieces of a massive allegory, revealing a much darker tale. Hidden behind the pretense of a child's daydream, this game beautifully tells a tale of a child's fears, making use of brilliant composition and an amazing soundtrack. The fascinating level design displays a completely new take on the world. After playing through this masterpiece, I was incapable of finding a reason not to recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "The art in this game is amazing especially those graffities.Sadly puzzles are easy to solve and there is not challenge ... . But hey now you can get it for 1$ from HIB X and i can say this game worth more than that,So without any doubt go and get it. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "I was expecting this to be a small indie title that was rough around the edges, which is why it was such a surprise. This has the production values of a AAA title - whatever any of that means, but it would never be released and marketed as such. You'll see amazing, world-bending things, things that haven't really got an equivalent in other games.  But you'll also get the point, which is why this could never really be an AAA blockbuster. It's beautifully sad, and definitely not for everyone. Mindful of triggers due to the subject matter, but without spoiling anything, I'll just say that the ending is as redemptive as you want it to be.",
            "review_score": "1"
        },
        {
            "review_text": "One more game to demonstrate that telling stories without hurting interactivity (generally done using lenghty cinematics) is entirely possible, if not much more powerful. Here the non-litteral story is distilled progressively through various clues: short dreams allusion, characters relationship and interactions and a few metaphors. It just works.  As for the actual gameplay, this is a kind of ICO-like gameplay, using different mechamisms (with the usual switches, levers and the like...) The nicest thing about almost all puzzles is the ability to manipulate the scenery, which is almost a living thing.  This game is short (3~4 hours, more if you want to collect stuff), which is not a problem afaic, because why should story-focused games *need* 40 hours to tell a simple story ? Ihmo this game is no shorter nor longer that it should be, but, most importantly, the story ends in a logical but not quite expected way you will not easily forget.",
            "review_score": "1"
        },
        {
            "review_text": "We testes the Humble build on three Linux systems. BEHOLD!          YouTube™ Video:  L.G.C. |Reviews| — Papo &amp; Yo&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "To me personally this is like the film Pans labyrinth an absolute work of art which hits you right in the feels! at times frightening, others beautifly uplifting  the ambience, creativity, artwork are absolutely sublime! only played a little bit but its definitely a game i will enjoy for a long time",
            "review_score": "1"
        },
        {
            "review_text": "Papo &amp; Yo is an emotional experience about a young boys escape from the reality of his abusive drunk father via the power of imagination, told in the characters actions with the surrounding environment and Monster, the allegoral representation of his father. The story is not told with text, nor with spoken audio. It unfolds differently for each player, as you must imagine what you will as the visuals and character interactions further the narration of the story. While Papo &amp; Yo is short in length, it delivers in excellence a touching, beautiful, and heartrending experience. Visuals are top knotch, audio is clear, and mechanics are stable and concise. While not a AAA experience, Papo &amp; Yo far exceeds expectations both in format and design, and is an incredibly underrated title. This tear inducing social commentary in artistic form is a must have, and is well worth it's current asking price.",
            "review_score": "1"
        },
        {
            "review_text": "Wow... That is all I can seem to muster after finishing this game. It's just brilliant, This is truely an amazing game!",
            "review_score": "1"
        },
        {
            "review_text": "A welcome change from shooting everything and a moving story you will remember. Well done!",
            "review_score": "1"
        },
        {
            "review_text": "I dont think its fair to even call this a game. The level design is very linear, making it almost impossible to get lost or off track. There isnt much point to exploring during your first play through (second play through you can find hats), but what there is to see is very surreal. Its more of an interactive story then a video game, and a beautifully told one at that. I wish there were more stories like this to experience. 9/10 WELL DONE.",
            "review_score": "1"
        },
        {
            "review_text": "This game manages to be beautiful, haunting and very touching, while being fun and having interesting puzzles. The puzzles give enough challenge to keep you interested and are never so hard that you will get stuck, also I never got stuck because I didn't do the puzzle steps in the precise order intended by the developer. The graphics are beautiful and the controls are very smooth, I would recomend this game without hesitation.",
            "review_score": "1"
        },
        {
            "review_text": "(If you have read the review of this game by Mitch Dyer on IGN, please ignore that review. It is a horrible review and should not be taken seriously.)  Papo &amp; Yo is a 3-D puzzle platformer by Minority Media taht was first released for the PS3, but then brought to the PC. At first, you might not understand the story, but you will understand it once you get towards the end. The story is actually quite depressing and makes you sympathize for the main character. The game is only about 3-4 hours long, but it is an amazing and well made game. I feel the length of the story is perfect for a game like this.  The game is pretty basic since it is a puzzle platformer, but there are other aspects added to the game at some points. Some of these include trying to get a monster following you from one area to the other, or even jumping on his belly to get to a higher platform. The puzzles in the game are mostly easy, though there were a couple that I had to look up, personally. I felt the music used in the game was quite good and very fitting for the game. The graphics are pretty good and can be compared to some triple a games, in my opinion.  I didn't find many issues with the game, except for occasional bad frames and it would sometimes freeze for a couple seconds, though this could have been my PC. It mainly happened to me when I walked near where a cutscene would start, or occasionally when I hit a checkpoint. I must say that this is now one of my favorite indie titles, and I hope to see more games from Minority Media. If I had to give this game a rating, I'd give it a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, this isn't a children's game, it deals with some pretty serious issues that I was not expecting. But that's not to say that that it is a bad thing, in fact I'm glad a game like this exists. It's everything I've ever wanted from a video game story, I just wish I was warned ahead of time. The gameplay really isn't that amazing, the puzzles are pretty simple and more often than not you could solve them just by taking a glance at it. But I don't think the gameplay is what this game is about. The game is more about tone, story and emotional impact of which it does all 3 well.   Also the artwork is this game is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know, but i think this game should have a 'horror' tag! Every time monster runs after me i pause!! HOLY SHIIT!!!!  10\\10, amazing story &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "If you are into puzzle games you should try this out. The story of the game is very intresting too and it will be a fantastic journey in a gorgeus enviroment.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game really captures the magic and imagination of growing up, the puzzles aren't hard and feel more part of the exploration. The level design is AMAZING! The game feeling is AMAZING! The soundtrack is AMAZING! The game does have a deep undertone, and for me was very personal. All in all, a great symbolic, light puzzle platformer with a touching story. Clocks in at under 6 hours, perfect length for the experience. Totally worth getting the soundtrack version!",
            "review_score": "1"
        },
        {
            "review_text": "An emotional, metaphoric platformer with gorgeous graphics, Papo and Yo explores subjects like alcoholism and domestic abuse through chalk line magic, voodoo houses, a living toy/jetpack and one seriously addicted monster. Not to take a back seat to aesthetic and theme, the action itself is very satisfying.   Papo and Yo is brief, but it is so dense with symbolism and striking scenes that it seems much longer. I guarantee that you've not played a game quite like it!",
            "review_score": "1"
        },
        {
            "review_text": "Papo y Yo is a textbook example of 'Games as Art'. In terms of gameplay, you won't get much and it's incredibly short; I beat it in less than 3 hours. However, the concepts/ideas and visuals are nice and there was one or two surprises that I didn't see until right before they happen. The development team is fairly creative and they do succeed in capturing child-like wonder and exposition though atmosphere, though that's their only major successes. The 'big reveal' is blatantly obvious halfway through the game and it should have balanced more on the characters/backstory than just the message. My biggest complaint is that there is no real payoff to all the buildup; it kinda just sits unresolved and quite frankly, is unsatisfying. While that may have been the intention, the rest of the game isn't satisfying enough to justify leaving it that way. Overall, the game is simply 'pleasant'. Don't go out of your way to get this game, but if it stumbles upon you for cheap, it's worth a single afternoon.",
            "review_score": "1"
        },
        {
            "review_text": " Papo &amp; Yo  is a puzzle-solving game taking place in a surreal Brazilian shanty town. As Quico you must interact with Monster, a large horned creature, to progress. It is made clear from the dedication at the beginning of the game that Monster is an allegory for the creator's father, who was an abusive alcoholic. In the game, Monster is driven into a rage by certain objects in the environment and will violently fling Quico about. It becomes Quico's goal to remove this anger that flares up in Monster, with help from a mysterious girl and his robot companion Lula.  I found the environment to be a unique dream-like experience and I really enjoyed exploring it. The puzzles varied in quality and were fairly simple, but a few stumped me for a little bit. I did unfortunately need to restart from previous checkpoints twice due to glitches that made puzzles unsolvable. Fortunately this didn't set me back too much.  I liked  Papo &amp; Yo  and I felt it was just long enough to not wear out it's welcome. I found the conclusion to be quite powerful, although I wonder if it might have been more meaningful if the dedication was saved for the end.",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzler with wonderful depictions in a child's imagination; but a very, and unexpectedly, heavy game! Manly tears were shed.",
            "review_score": "1"
        },
        {
            "review_text": "A surprising theme, tactfully done weaves through Papo &amp; Yo. The game, while simple in its control and play, was intriguing enough that I played through the game in a sitting. While some gamers may not appreciate this game for what it is, Would have a lot more to say, but the story and the experience make this game, and I do not know that I could do it justice without spoiling it. I highly suggest at least one playthrough.   So long as you can go more than 30 minutes without killing an alien/terrorist/animal/robot, you will find a unique experience.   Storyline: 7/10  - the underlying story kept me intrigued  Music: 7/10  - the music added to the experience, and I enjoyed it, Walking away from the game I can't say that I remember much of the music, though.  Sound Effects: 8/8  - simple, non-obtrusive, but felt organic to a surreal scenario- especially the 'dialogue' sound effects.  Graphics: 8/7  - A fairly charming visual experience. Was not hard on the eyes. :P  Overall, I give Papo &amp; Yo an appreciative 7.5/ 10.",
            "review_score": "1"
        },
        {
            "review_text": "An adventure/puzzle-platformer that's light on challenge but heavy on quality story-telling. Excellent presentation and beautiful Latin American-themed artwork/music make Papo &amp; Yo both a visual and audible pleasure. While the puzzles aren't anything that'll test your mind, it's less about figuring out how to solve them and more about watching and admiring the solutions as they unfold. The way you can manipulate the world with the push or pull of a lever is a neat sight to behold and has a 'child-like imagination' feel to it. There are a few technical issues present (noticeable framerate drops here and there), but nothing significant.  Overall, an impressive game that does a great job of using metaphors and symbolism to tell a powerful story full of dark subject matter in an accessible manner. Short, but still well worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Papo &amp; Yo is a very interesting Puzzler RPG.. There are many tasks to take on in order to figure out how you will get to the next area. If you're looking for achievements then this game is fairly easy to get 100%, however some may provide the extra challenge. I had to play this game through twice to get 100%. Overall a very short however great to play game.",
            "review_score": "1"
        },
        {
            "review_text": "First time I was staring speechless at credits after a game.   Before playing this game I assumed it would be a fun game for kids with crazy moving houses, but I was wrong. Yes, I got moving houses and many more weird level design ideas (which on its own would make a great game), but the story blew my mind. It's not happy at all but bitter and sad. After getting attached to all of the characters, even a robot toy, I was close to tears when anything would happen to one of them. The ending was hard to finish, not because of puzzle complexity, but because of extreme emotional load. The only downside to game is how short it is, but I was not expecting anything longer. I would recommend it to anyone who likes weird level platformers, unusual characters and wants to experience a game that has a deeper meaning. ",
            "review_score": "1"
        },
        {
            "review_text": "Strong personal story presented in a very interesting way. Unique gameplay mechanics with, sometimes, abstract elements, that will surprise you from time to time. Visual style and graphics of the favela environment are refreshing and interesting to explore. Also, development of the relationship with the Monster in the game through gameplay is very good and original.",
            "review_score": "1"
        },
        {
            "review_text": "At the core this is a puzzle-platformer. It took less than 3 hours to beat and the puzzles were pretty easy. I scored this game for a couple dollars and it was totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "I cannot recommend this game enough. It is a very special puzzle platformer full of childlike wonder that explores the effects of parental abuse. It is a beautiful, healing sort of game with a very emotional ending. It is very personal to me because it actually helped me to heal from my own childhood issues. This is a rare gem in the gaming world that you shouldn't pass up.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game! Worth buying! Nice graphics, very enjoyable gameplay!",
            "review_score": "1"
        },
        {
            "review_text": "A magical realism platform/puzzler with a largely symbolic plot that manages not to be heavy-handed. You explore the city and use magical chalk drawings to manipulate the colorful environment. Meanwhile, your character gets more and more bedraggled as he interacts with his friend, Monster. Monster, alternates between a playmate and a villian/obstacle, depending on whether he has indulged his addiction to poisonous frogs. Good, intuative controls and a sensible camera along with a thoughtful story make this platformer worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "This is an A+ game. Its a Original one of a kind.  To me its right next to Okami with its creativity and game play.",
            "review_score": "1"
        },
        {
            "review_text": "This is an A+ game. Its a Original one of a kind.  To me its right next to Okami with its creativity and game play.",
            "review_score": "1"
        },
        {
            "review_text": "This indie game is amazing,not for gameplay,not for good graphics.STORY!. At the end u will connected all parts and finally find out what in the game frog means,who is the monster and learn the story of the author's childhood, what he's been through.  10/10 !",
            "review_score": "1"
        },
        {
            "review_text": "This may very well be the first example of magic realism in a videogame. More than a little rough around the edges, Papo &amp; Yo still deserves enormous respect for its brilliant handling of metaphor, unerring focus on the strengths of the medium and other fancy concepts like that while managing to not be too snobbish and arty-wanky about it. Add painterly, enchanting visuals and culture-fusing music to that and you've got something quite unique on your hands.",
            "review_score": "1"
        },
        {
            "review_text": "Gameplay isn't anything special (it's not bad though) but the setting, aesthetic, and everything else is really nice.  Also manages to pull of the 'actual meaning' part of storytelling without being ridiculously pretentious (looking at you, Dear Esther)",
            "review_score": "1"
        },
        {
            "review_text": "Again a great example, how much more games can be. Hit me more than 'Brothers'...",
            "review_score": "1"
        },
        {
            "review_text": "If I were to made a list of nice things about this game I would have to mention that graphics are nice, the visual design of the game is fantastic, the soundtrack is amazing and the puzzles are rewarding. But that would leave out the fact that this is an incredibly moving and touching game. It deals with a very serious and personal issue of the game creator's childhood and transforms it into a heartfelt game as a sort of personal therapy. The ending is specially cathartic. A must buy if you want to take a look at what games can do when they go beyond the usual thematic conventions of gaming.",
            "review_score": "1"
        },
        {
            "review_text": "This game is rad. The story is so complex and interesting, and the art is spectacular",
            "review_score": "1"
        },
        {
            "review_text": "*sniff* SHUT UP! SOMETHING JUST GOT IN MY EYES! LEAVE ME ALONE!",
            "review_score": "1"
        },
        {
            "review_text": "I cried. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty good. Apparently your daddy used to hit you with a belt but honestly no one cares m8",
            "review_score": "1"
        },
        {
            "review_text": "[GENERAL]  This game is a true piece of art, the gameplay is interesting and fun. The puzzles in the game are easy enough to enjoy but hard enough to give you a challange. This is one of the few 3rd person puzzle games where you do not get frustrated or annoyed just because the obvious is not possible. The story is interesting and even though a typical story, it has a great way of portraying it.  I got this game on sale, but the original price for 15,00 is acceptable but still a bit steep for the length of the game. You will not waste your money, but I would recommend getting it on sale. [FAMILY] This game is in my opinion acceptable for kids of younger age too, though I would not suggest letting kids play this alone below the age of 10, the story and puzzles are not easy enough and the Monster might scare and confuse the younger kids. Other then that, if you play this together with your children, they will enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Just great!",
            "review_score": "1"
        },
        {
            "review_text": "the strongest example of mechanics as metformin in a game. slow colorful beautiful, if you are interested a new experience get it if you like guns and ♥♥♥♥ get it to maby you will fall in love.",
            "review_score": "1"
        },
        {
            "review_text": "Short, but very very good.",
            "review_score": "1"
        },
        {
            "review_text": "Papo &amp; Yo is a delightful platformer/puzzle game with a very interesting theme. Though the game might at first look seem like a fantasy story of a boy and a monster he befriends, it really is about growing up and coming to terms with your childhood. It is a game about how our imagination can help us cope with difficult times, until we are strong enough to take the masks off, see things for what they really are and accept reality for what it is. The game itself isn't very challenging, but the platformer controls can be a bit finnicky from time to time. The environments of the game are well made and it is fun to see how the world shifts as you solve the puzzles. The game is fairly short but it definitely keeps you invested in it until its very appropriate and memorable ending. In essense, Papo &amp; Yo is not an extraordinary game, but it is a very good one. It has a strong and very personal message, one which I believe most people should be able to relate to one way or another. You can't go wrong with it.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, what to say about this game! When I bought this game, I did not know what to expect. To be very honest, I did not even know what the game was about, other than it was an action/platformer game. The story of this game is rather deep for such a childrens style game.  I don't really want to post any spoilers, but you run around as a kid named Quico whose father is an alcoholic. You are in what seems to be a dream world where you have to solve puzzles and platform your way across each area to progress the story. The puzzles are not overly hard, but the game is just fun and the story is a big metaphor.  The game is relatively short, but I believe you can play through twice just for the achievements. Overall, this was one of the most enjoyable games I have played in the last year. I did not want to stop playing! Part of me wishes it were longer, but another part is glad it was the length it was, because it did feel just right.  Anyhow, if you are looking for a action/platform/puzzle game that has a pretty good metaphoric driven story and is fun to boot, well I think this is right up your alley!",
            "review_score": "1"
        },
        {
            "review_text": "This game's original, relatable storyline is a breath of fresh air. Both the graphics and music really capture the player's interest initially and the storyline keeps one interested until the very end. The ending is incredibly powerful and the puzzles throughout the game are not too difficult, yet very enjoyable. This game is worth playing through at least once! Collectables are unlocked after the first playthrough, so a second playthrough is also viable for those achievement hunters!",
            "review_score": "1"
        },
        {
            "review_text": "While easily one of the more heartfelt games I've played in a long time, it takes awhile to get into. It's puzzles, if you can call them that, are more tedious than anything I can think of from current gen gameplay. The upside? The story is really touching if you can get through the crappy puzzles and the music is some of the best, especially for the style of the game as a whole.  Overall I would recommend this game if you have the spare cash. Main reason is it's got no replay value what-so-ever.",
            "review_score": "1"
        },
        {
            "review_text": "Great exciting game with lots of cool features! Original! Worth a try!",
            "review_score": "1"
        },
        {
            "review_text": "great atmosphere tho",
            "review_score": "1"
        },
        {
            "review_text": "It had black people in it.",
            "review_score": "1"
        },
        {
            "review_text": "A must play if you're disappointed that The Last Guardian doesn't exist.",
            "review_score": "1"
        },
        {
            "review_text": "Really interesting game. The game mechanics are cool and reminds me of 'Tiny and Big: Grandpa's Leftovers', a little.",
            "review_score": "1"
        },
        {
            "review_text": "Great storytelling and fun puzzles. Very short but well worth it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Papo &amp; Yo is a surreal puzzle platformer set in an urban landscape, seen through the whimsical imagination of a child. Beneath the surface however is a darker theme. Think Life of Pi meets Inception.  While the game is a bit lacking in terms of graphics and animation the story and it's delivery along with the unique and fun mechanics of the game more than make up for it.",
            "review_score": "1"
        },
        {
            "review_text": "Papo &amp; Yo is a metaphorical story played out within a child's imaginative mind. Adhering to its theme, the gameplay and puzzles are simple and childlike. The story progresses, driven by the nostalgic innocence of childhood, and ultimately unfolds out into a darker, more mature theme.   Recommended to those who can appreciate an emotionally engaging storyline, vibrant visuals, and a uniquely magical soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "While offering little new in the way of game mechanics, it is still engaging enough to keep you moving forward into a story steeped with symbolism. It is a moving story and one that can prove very powerful. It doesn't take long to complete, around 4 hours max, it is well worth the time to check out.",
            "review_score": "1"
        },
        {
            "review_text": "9/10 Strong story and great puzzles. They loose some of the strenght in that the puzzles may be too easy. Also the art in this is amazing and this is great to show people who mean games is not art.",
            "review_score": "1"
        },
        {
            "review_text": "At times, the game can extremely slow-paced due to the load of running you do, but it's all worth at the end. Most of the graphics are beautiful and the controls are simple. Probably gonna rate it 4/5 .",
            "review_score": "1"
        },
        {
            "review_text": "Best interactive sound i've ever heard.",
            "review_score": "1"
        },
        {
            "review_text": "It's a short, more casual gaming experience, but very poethic, with a beautiful setting, and a relateable story.",
            "review_score": "1"
        },
        {
            "review_text": "Papo &amp; Yo is a fantastic and well put together game that will take you on a small journey into a young boy’s imagination. It is obvious every detail was thought about when making this game and the message that is present throughout the game is well thought out and smartly expressed. I would recommend everyone play this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Shadow of the Collossus for the giant building-like creatures or the general look of Brazil's favelas , you'll probably like some of the imagery in this. Ultimately though, the puzzles more or less were busy work, the monster lacked any sort of intimidation once he catches you once, the story was frustrating and the conclusion bludgeoned you with its meaning, leaving no ambiguity.   Still, it's not a long game, it's charming enough that it doesn't deserve to be completely panned and ignored. Pick it up for cheap if you can.",
            "review_score": "1"
        },
        {
            "review_text": "Game that overcomes its rough edges with art direction. Worth a try at least.",
            "review_score": "1"
        },
        {
            "review_text": "Truly incredible aesthetic design, a handful of clever puzzles, and an effective-if-blunt metaphor come together into a charming, short game that I wish did more. Papo &amp; Yo stumbles in a lot of ways – many of the 'puzzles' require little more than noticing a switch somewhere in the environment, and after playing I'm left wishing I had been better able to empathize with the creator's childhood experiences. Nevertheless, it's an admirable game for what it is, even if it doesn't fully explore a lot of its ideas.",
            "review_score": "1"
        },
        {
            "review_text": "Very Unic Puzzle game",
            "review_score": "1"
        },
        {
            "review_text": "The oscar movie of video games (emotional, not your usual action game). Definitely worth a play through.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't know a game could be this beautiful",
            "review_score": "1"
        },
        {
            "review_text": "This quirky little game really left an impression on me. I reccomend it. it has a nice story. definately not GOTY or whatever but its okay :D really enjoyed it personally.",
            "review_score": "1"
        },
        {
            "review_text": "Elegant, succint, simplistic and beautiful. An enchanting puzzle game that tells a story on more than one level. Bravo to Minority media for taking the bold step to deal with such a serious subject.",
            "review_score": "1"
        },
        {
            "review_text": "I grudgingly give this game a thumbs up. It's not that good. The character models are unintentionally creepy (and crappy), the controls are horribly floaty, the puzzles are boring, there's barely a game to it and it's fairly short (you should be able to beat it in under two hours). Many of the things this game has attempted have been done before and better.  But... I do think this game deserves some praise for trying some weird things. It fails, but it tries. If you like artsy games, you might enjoy this. Otherwise, steer clear.",
            "review_score": "1"
        },
        {
            "review_text": "I was sceptical of the game at first and only had it in my library as part of a humble bundle. Upon starting to play it as it was in my library anyway, I noticed that it had a great Soundtrack as well as nice animation. Even though the game seems like it is directed at children sometimes, it is still moving and at points very complex. Parts of the game actually did make me cry. I can only recommend this game to anyone.  ",
            "review_score": "1"
        },
        {
            "review_text": "Touching Story. Enjoyable 3D Platform Game.",
            "review_score": "1"
        },
        {
            "review_text": "The controls can be a bit clunky but the game is cool, the story is OK, the gameplay is original and the visuals and music are great.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun. It is also kinda sad. You feel alone. It is metaphorically dark. It starts with a dedication reading: 'To my mother, brothers and sister, with whom I survived the monster in my father.' Obviously his father is the monster in the game. It is pretty easy to decipher.   Playing through the game is fun. The graphics are great, and the game is simple and easy. Since the subject matter is kinda heavy I just have a bit of weight on me while playing, so I have to play in short chunks (hard to describe).  Anyway, good game, good story.",
            "review_score": "1"
        },
        {
            "review_text": "This game cant be any better 10/10 ......1 of the best games have ever played completed 100% all achievements  totaly worth it",
            "review_score": "1"
        },
        {
            "review_text": "A great game that I highly recommend.  The gameplay mechanics are well thought-out with enough variety to keep you going. The musical score and the overall flow of the game makes it a very relaxing experience.  The puzzles are somewhat straight forward with very few of them requesting any 'brain-time' whatsoever. That's not really a bad thing however, gamers looking for a challenging Puzzle game should probably look elsewhere.   Roughly 4-5 hours to clear.  What really makes Papo &amp; Yo shine is the way it tackles its metaphoric plot with maturity and class.  Worthy of a Wishlist!",
            "review_score": "1"
        },
        {
            "review_text": "Does the ending imply the boy killed his father drunk? Abso-f_uking_lutely present to take revenge on society! My little companion and i were terriby shocked. Seriously, it's amazing when i first saw the appearance of steps when pulling the ???(whatever it called). This is important! This is important! I said twice cause it's so important. To getting the achievement 'Don't need no hints', remember to complete the game in a sitting and NEVER reload the last checkpoint!",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful game with a touching story and excellent music. A tad rough around the edges with some rough animation and stiff platforming can't keep this game down. Truly magical, touching and ultimately worth a shot. Give Papo &amp; Yo a try!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Story and Exploration game. I really liked the level design and the unique style of challanges",
            "review_score": "1"
        },
        {
            "review_text": "I dont remember playing this game but i have 2.3 hours in it. what? ",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable visuals and music. Fun and simple gameplay, albeit with somewhat clunky controls. The premise and conclusion nearly killed me.",
            "review_score": "1"
        },
        {
            "review_text": "The puzzles are quite straightforwarded but some of them are pure art, e.g. skybending favelas.  Buy and you will get emotionally hugged by someone's unpleasant childhood.",
            "review_score": "1"
        },
        {
            "review_text": "cool game, without physics)",
            "review_score": "1"
        },
        {
            "review_text": "Good game if you get it on a steam sale. The actual gameplay and puzzle solving is pretty easy throughout it, but the art style, audio effects, and music really saturate you into the game. Seeing how it comes together into the overall storyline is nice as well. I would definitely recommend this game for the experience.",
            "review_score": "1"
        },
        {
            "review_text": "This is an odd game to recommend because to explain what it is is to spoil it a bit.  Basically it is a puzzle game and a short one at that; it took me about 3 and a half hours to complete it one time. Personally I'm glad I played it but if I hadn't got it on sale for £8 my view might be different.   It's a very refreshing game, making a point while giving you some really cool puzzles. it tries to engage you in the 'story' and, for me, did this quite nicely with subtle metaphors and imagery. Different people will experience this game differently, if you want a game that is just about the action or puzzles, this might disappoint, but I found it to be an incredibly chilled out game, you can't die and the music is very well done, fitting the atmosphere without becoming repetative. The graphics on the trailer look really poor, but I was surprised by how nice it looked.  When I finished the game I felt like it could have been longer with more puzzles, but at the same time, I played it through in one night and it was a cool little game that kept me entertained start to finish. In some ways, the fact that it's short makes it more enjoyable.  If you can get it on sale then I recommend it, it's very different and if you can think of it loosely like paying for a film, in this case a puzzle 'experience', then it's well worth £8.  ",
            "review_score": "1"
        },
        {
            "review_text": "I would give Papo &amp; Yo a 4/10. I absolutely love the concept of the game: an abused boy escapes into a world of his imagination where he grapples with Monster, a representation of his step-father. The way that the puzzles work and the idea of the white and how it works is wonderful. However, the character's interaction with the world is odd (ledges I get my feet above but still can't land on, things like that); many of the puzzles are clever and interestingly done, but once the method is discovered, the tasks become monotnous and overextended; and the end plot in which his fantasy touches his reality is portrayed in a way that I can only describe as cheesy. In short: great concept, executed poorly. I would play it if presented to me for free, but I would not recommend paying to play it.",
            "review_score": "1"
        },
        {
            "review_text": "There aren't enough superlatives to describe the feel and look of this game! Absolutely loved it. The puzzles or the platforming aren't particularly challenging - they aren't meant to be. Exploring the surreal world of Papo &amp; Yo is more like experimenting with laws of a different reality than testing your skills in a familiar one. It's like being a kid again, getting lost in a playground full of possibilities.  Traversing the dreamlike slums as a little boy while trying to tame a wild Monster goes from enchanting to touching when you realize the Monster is a representation of the boys alcoholic father. The ending was especially powerful. Soundtrack fits the game perfectly, making the whole experience even more immersive.  I'm really curious about Minority Media's next game called 'Silent Enemy' (dealing with bullying).   V e r d i c t : AWESOMESAUCE, which means nearly perfect",
            "review_score": "1"
        },
        {
            "review_text": "Well, my first ever steam review. I HAD to review this. A of hardcore gamer for over 30 years, this is the only one that warrents my time writing and promoting. This game is beutiful. It is really clever, artistic, imaginative, visually stunning, charming, wierd, warm, cold, gripping, mesmerising, refreshing, and has a deep emotional story line like no other game before it (or probably ever will ). And on top of this the gameplay is excellent, the puzzles are clever, amusing and addictive. A lot of care and thought has gone into this game. Its a true escapist adventure. Its on a par with A Tale of Two Brothers, another meticulously crafted, emotional and beautiful adventure puzzler game. I found both games evoked similar emotions when playing. I'd rate TOTB as the greatest game I've ever played (from from all genres). Its hard to explain why other than the powerful emotions it evoked. This game nearly steals that title for the same reasons but not quite. I would definately rate this as the most original game I've ever played. Worth every penny. Truly Stunning. Basically you just have to play it! Limbo and Machinarium, great as they are, have been bumped down the list. ",
            "review_score": "1"
        },
        {
            "review_text": "it is a simple puzzler game. but the story is really good and the end reveals more to it than you can already assume early on",
            "review_score": "1"
        },
        {
            "review_text": "Okay. Papo &amp; Yo.  My first attraction to the game came with its visuals. The bright, colorful design of the favelas instantly caught my attention in a market saturated by grays and sepias. It stood out, it was new, it was charming. I picked it up, played it for a short while, and then set it down for a week. This should not speak poorly for the game but, rather, for my lack of attention. It took a little bit to get started. But when it did get started, oh man. It got started.  I have since finished the game, and I can now safely call it one of the most important games I have ever played. Not because of anything that it does in the gameplay that is new. The gameplay is only ever average, an affair of finding gears to push and plungers to pull. It has its difficulties - the frame rate will sometimes skip for no reason, and the platforming elements feel strange. Quico, the protagonist, has a strange weight to him, making jumping a bit of an unusual effort. The gameplay is the weakest part of this game.  But it is everywhere else that it shines. It can be terribly dazzling when it wants to be, offering a magically real landscape of favelas that twist and turn and defy gravity, and houses that walk on legs made of chalk, and an enormous pink monster with sun-cracked skin and a dangerous addiction to tropical frogs.  And for every wonderful moment there is a counterpoint, a realization that this experience is inspired by Creative Director / Writer Vander Caballero's relationship with his alcoholic father. Later in the game Monster finally gets his hands on one of those irresistable little frogs, and gobbles it up. He is instantly wreathed in red flames, and he turns on you with a stomach-gnashing roar. Poor little Quico suddenly seems very small against the rampaging Monster, very fragile.  The story's focus is on Quico's quest to cure Monster. You go on a journey to find a shaman, aided by a mysterious girl and an endearing toy robot named Lula, and of course Monster. Sometimes things go quite well. Sometimes they go very wrong.  There are moments were Papo &amp; Yo is absolutely childlike in its wonder.There are moments that are dark and threatening. And there are moments where you have to do things that are painful and liberating. This is a game of powerful, startling, painful moments, strung along to lure you deeper into its narrative.  I feel Papo &amp; Yo is best experienced in a single sitting. The puzzles never become inhibitingly difficult, and you can finish it in about 2 - 4 hours. Which, honestly, you should.  If you want to know more, read the reviews put out by Rock Paper Shotgun and the New York Times.",
            "review_score": "1"
        },
        {
            "review_text": "Only one word can truly describe Papa &amp; Yo: 'Beautiful'. This gem of a game left me smiling, laughing, even crying at times, as the amazing work done by the Minority team played out before my eyes. Between the cleverly designed puzzles, the stunning artwork and delightfully implemented mechanics, my journey through young Quico's imagination was a joy ride for my inner child. However, this bright and cheerful atmosphere goes hand in hand with a rather heart-wrenching, yet masterfully told story. My only complaint is that I wish the game were a little longer, but that is a minor complaint; this game is well worth both the time and money.",
            "review_score": "1"
        },
        {
            "review_text": "A rather quick and simple game, yet having a haunting story. The puzzles are a tad easy, and you can finish the game in about 3 hours.",
            "review_score": "1"
        },
        {
            "review_text": "A fun game with a serious underlying message.  The artwork on the walls throughout the game is phenomenal!",
            "review_score": "1"
        },
        {
            "review_text": "I adore this game. Such an interesting take on such a grim subject matter. Beautiful visuals, a gripping and truly touching story and a very enjoyable game mechanic. Definitely recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "A decent puzzle game with a nice, metaphorical story. Very good environments and sound. Puzzles were simple but they looked good doing what they did.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the most beautiful and sad games I have ever played, 100% 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Finally took time to run through anf complete this game. I must say, it is indeed very beautifully done! Artisitc world and character design, vivid colors, poetic soundtrack, this is a game everyone should play!  Though on the surface Papo &amp; Yo appears to be one of the most abstract of games with no direct meaning, playing further into the game (and nearing the end) tells you the imaginary story of a boy, Quico, and his life of being bullied and abused (probably on a daily basis).  Monster, poisonous frogs, the robot Lula, all have their reason and place in Papo &amp; Yo. The story will form really well when you play it through, when you will uncover the mystery of this awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "Beautifully imaginative. A rare game that is as touching as it is enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "This game was fantastic. It's short, which means the mechanics don't get old. The locations are beautiful, and the story is amazing. I'd highly recommend it to anyone that has any passing interest in puzzle platform games or games as art. Two big thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "This game will take your heart out of your chest, spit on it, step on it, burn it and throw the ashes in a dumpster. Although it is, a very short game (finished in less than 3 hours), every second is very deep and worth more than 30+ hours in more 'elaborated' games. Papo &amp; Yo has what many of the current generation games lack: a good history, with powerful metaphors. Congratulations to the development team for providing us with a game that is compatible with EyeFinity setups (7680x1600).",
            "review_score": "1"
        },
        {
            "review_text": "Half hour into this game and already I feel its Such a beautiful and creative game with more to it then meets the eye, amazing music also.",
            "review_score": "1"
        },
        {
            "review_text": "Magical and really beautiful landscapes.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very personal game about a boy trying to befriend his abusive parent. It has an unexpected and emotionally powerful ending, just like Brothers. Papo &amp; Yo also excels in gameplay - lots of exploration, platforming and puzzles in a surreal ghetto, where the chalkboard drawings of children magically come to life. Also, it's an indie game that tries and almost succeeds at having a triple A quality and polish. One of the best games that came out this year.",
            "review_score": "1"
        },
        {
            "review_text": "Does the ending imply the boy killed his father drunk? Abso-f_uking_lutely present to take revenge on society! My little companion and i were terriby shocked. Seriously, it's amazing when i first saw the appearance of steps when pulling the ???(whatever it called). This is important! This is important! I said twice cause it's so important. To getting the achievement 'Don't need no hints', remember to complete the game in a sitting and NEVER reload the last checkpoint!",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing compared to games of recent times. Sort of reminds me of Ratchet &amp; Clank, being a puzzle-platformer where you have a tiny robot on your back that helps you. The art in this game is ~*~beautiful~*~, and the story is equally as good. The game made me smile in a way games haven't in a long time. If you're looking for a 'different' platformer that makes you think and feel, get this game.",
            "review_score": "1"
        },
        {
            "review_text": "This is, without a doubt, one of the best games I have ever played. It takes a lot for a game to make me shed a tear. Papo &amp; Yo did it like it was their job; a job they did very well..*sniff*",
            "review_score": "1"
        },
        {
            "review_text": "One of the most inventive and interesting games I've ever played, and incredibly powerful.",
            "review_score": "1"
        },
        {
            "review_text": "This game plays like a third person Portal meets Inception (you'll know what I mean if you play it). A gorgeous looking puzzler that I can strongly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "such an awesome game you should totaly buy it its worth the price",
            "review_score": "1"
        },
        {
            "review_text": "Although short, this platformer is interesting. I like that it is creative and mostly alludes to its story through much of its imagery. This game has a lot of easy puzzles and easy platforming.",
            "review_score": "1"
        },
        {
            "review_text": "I was able to guess the 'big reveal' of the ending from pretty much the very beginning of the game, but it still had an impact despite that. In addition the game offers a little bit of a challenge (not alot but enough to keep my interest to finish this in one sitting)",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that shows the problems that some children suffer daily, it can be played by anyone to explain that not everyone is as fortunate as others and the true nature of how our imagination works to get away from our problems to be in a better place. I would recommend this to anyone that has a few hours to play this fantastic and inspiring game.",
            "review_score": "1"
        },
        {
            "review_text": "I knew this game was great as soon as I hugged my first frog.   ",
            "review_score": "1"
        },
        {
            "review_text": "Best story.",
            "review_score": "1"
        },
        {
            "review_text": "When this game was first released I did not think it would be for me. I'm happy to admit I was utterly wrong. It really is lovely and captured my heart instantly (Be warned though that there is some sadness here too!).  Papa &amp; Yo is a dreamy, beautiful and slightly melancholy gentle platformer that takes on a difficult subject. So far I've enjoyed every second of it - there have been many moments of delightful wonderment and the puzzles are not hard but they are quite a joy to explore. The environment of the dream favellas reminds me of City of Lost Children with a Brazilian twist. Simple. Elegant. Well crafted. Lovely soundtrack too - if you like videogame OSTs check it out.   More games like this, please! Definite thumbs up! ",
            "review_score": "1"
        },
        {
            "review_text": "A nice game full of some wonderful imaginations. Remind me a little bit about the great adventure game ICO in playstation 2. The story part is just okay but the setting, visual(art), musics and sounds are wonderful.   At the beginning, there are new gameplay element introduced regularly and the level design is great but you can see they begin to run out of ideas near the end. The game is quite short and can be finished in one or two sittings.   If you can get it in sale, don't miss this interesting interactive art.",
            "review_score": "1"
        },
        {
            "review_text": "A gorgeous and interesting 3D puzzle platformer with a subtle story which is told through the gameplay. Papo &amp; Yo offers up a great looking, fun game with a depth of story substance which never once interrupts the great gameplay. The game treats the player with enough respect to draw their own conclusions and is never overt or crude in its approach. It's a hands-off story which compliments the gameplay, and it's wrapped up in a gorgeous world with good mechanics.   Highlights",
            "review_score": "1"
        },
        {
            "review_text": "great 3d puzzle platformer and meaningful story.",
            "review_score": "1"
        },
        {
            "review_text": "so far i think this is an awsome game, cool story , interresting gameplay just in all a good game  ",
            "review_score": "1"
        },
        {
            "review_text": "Bawled like a baby. Seriously, it's a beautiful game with an amazing soundtrack. Just prepare for it to hit you in the feels.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and heartwrenching. Not a terribly long game but I would play it again for the story.",
            "review_score": "1"
        },
        {
            "review_text": "This came to my attention due to Feminist Frequency. Puzzle and platform mechanics are mediocre but the way it treats child abuse is very well done and should be applauded. I really like the favela-inspired fantasy world and how it feels just like a child's imagination.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a life changer for me",
            "review_score": "1"
        },
        {
            "review_text": "Surreal and cheerful story about letting go of your relationship with your abusive alcoholic father.  Monster's path-finding broke once, losing about 10 minutes of progress, but otherwise an excellent game.",
            "review_score": "1"
        },
        {
            "review_text": "The tale of a small african stripper and his dog 4 out of 5 origins",
            "review_score": "1"
        },
        {
            "review_text": "When i bought this game i did not expect that much of it. But after finishing it i have  to say it has a superb atmosphere and great story!",
            "review_score": "1"
        },
        {
            "review_text": "About a boy with an abusive father which is depicted as a monster. A monster who sometimes is very angry but otherwise will help you. A dream like puzzle platformer with a beautiful soundtrack. This is a game who will leave you with a teary eye and a lot of emotions. Loved it!",
            "review_score": "1"
        },
        {
            "review_text": "Just like 'Brothers - A Tale of Two Sons' and 'Among the Sleep', this game is more like a movie than a game, your character will never get hurt or die. However, the developer has a very important message to send out:   Spoiler ==&gt;   'Alcoholism'   is one of the common social problems in nowadays, and chid abuse is a by-product of it. Damage to a childhood has no cure, the only solution is up to the child to forgive and let go of the past. Thus, prevention is very important.    Be a Responsible Parent! ",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game! As a 3D platformer its got some occasional control/camera issues, but it more than makes up for that with a real and engaging story told through gameplay. Its got style too.",
            "review_score": "1"
        },
        {
            "review_text": "The ending of this game dazzled me. For people who like story driven puzzle games this is a must play.",
            "review_score": "1"
        },
        {
            "review_text": "The ending of this game dazzled me. For people who like story driven puzzle games this is a must play.",
            "review_score": "1"
        },
        {
            "review_text": "First of all, let me just say it got this game through humble bundle about a month or two, but never had the time to play the game until recently. i have not watched any review or let's play of the game, but heard of it through a friend who enjoyed it. other than that, i was completely clueless to what this game could be. also this review is  SPOILER FREE .  Papo &amp; Yo focuses heavily on story (according to me) and tries to connect it with the surrounding enviroment both in terms of immersion and key elements in gameplay. This sounds great in theory... however the game itself is a mess. The art alone is wonderful and i would definitely recommend Papo Y yo as an art exhibiton rather than as a game. This is because the controls feels very clunky and slow and i personally feel that the lack of 'ledgegrabbing' could be... mildly infuriating. Not only that, but the puzzles themselves could be a bit painful due to backtracking without any other mechanic than simply 'walking', 'climbing' or the painfully slow 'getting a box 2 feet away to an adjacent square in the ground'.  However as i mentioned earlier, Papo &amp; Yo wants to (i think) focus on story and immersion, not the gameplay. When i got the humble bundle, i also got another game that did the same thing and it was called 'To the moon'. To the moon had half the staff and budget (probably) that Papo &amp; Yo had, but delivered in so many more ways in that.  What im trying to say that Papo &amp; Yo doesn't have a story good enough to 'carry the game'. It feels very rushed, and the immersion just isn't good enough because of it's poorly designed gameplay. There are so many other games (such as 'To the moon') which does story much better than Papo &amp; yo, so if your looking for that, i suggest another game.  That said, the game has some beautiful art and some great tracks. if you find a deal where you get the game AND the soundtrack, like humble bundle, it could be worth a dime. Buying the game solely on it's own? Not worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "The game was boring. Just, so boring.   It looks alright, the music is good, it covers unique themes (for a video game, albeit in a heavy handed manner), but it was too easy. I'm just glad it's over.",
            "review_score": "-1"
        },
        {
            "review_text": "weird adventure game with puzzles.",
            "review_score": "-1"
        },
        {
            "review_text": "Super short and boring, this is yet another indie game that tries to portrait main character's trauma as a weird, surrealistic world. I can only guess that melow music, cute chalk drawings and serene amtosphere were supposed to be charming, but since game doesn't try explain itself until the very end, you're being left wondering what this weird ♥♥♥♥ was supposed to mean. And when it finally reveals itself, you'll only find dissapointement in abrupt and meaningless ending.  If you looking for a similar game that has been done well, try Brothers: A Tale of Two Sons instead.",
            "review_score": "-1"
        },
        {
            "review_text": "Played the game to completion. Although the game has a very cool aesthetic, the puzzles are all fairly simple and get repetitive by the end of the game. Not a complete waste of a few hours, but your time is most likely better spent elsewhere. Probably most enjoyable to a casual gamer who isn't frustrated by some repetitious gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Not very good puzzle/platformer.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad game. Not worth any money.",
            "review_score": "-1"
        },
        {
            "review_text": "0/10",
            "review_score": "-1"
        },
        {
            "review_text": "I honestly do not even know why I bought this game in the first place.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I have enjoyed what I have played of this game so far. Unfortunately I haven't been able to keep any of my saves. The game auto saves at checkpoints, but when I exit the game and return to it, my saves are gone. There is a sticky thread in the forums about this but this did not help in my case. It's a shame because Papo &amp; Yo has some great reviews.   I may attempt to complete this in one setting, because according to  howlongtobeat.com  it will take about 3.5 hours.",
            "review_score": "-1"
        }
    ]
}