{
    "app_id": 227160,
    "name": "Kinetic Void",
    "release_date": "2014-11-21",
    "developer": [
        "Badland Studio"
    ],
    "publisher": [
        "Badland Studio"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Steam Workshop"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Space",
        "Simulation",
        "Indie"
    ],
    "achievements": 0,
    "positive_ratings": 298,
    "negative_ratings": 1138,
    "price": 14.99,
    "description": "Kinetic Void is a 3D space adventure with a focus on customization and enjoyable space simulation. The shipyard allows players to construct their ship piece by piece. Ships can be as simplistic as a cockpit, a hull, a engine and a gun, or as complex as a player wants.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/227160/header.jpg?t=1447357131",
    "minimum_requirements": "OS:Windows XP Processor:Dual Core 2 Ghz  Memory:2 GB RAM Graphics:<a href=\"https://steamcommunity.com/linkfilter/?url=http://en.wikipedia.org/wiki/GeForce_400_Series\" target=\"_blank\" rel=\"noopener\"  >Nvidia 400 or equivilant DirectX®:9.0 Hard Drive:2.5 GB HD space",
    "recommended_requirements": "Processor:Quad Core 2.3 Ghz  Memory:4 GB RAM Graphics:<a href=\"https://steamcommunity.com/linkfilter/?url=http://en.wikipedia.org/wiki/GeForce_400_Series\" target=\"_blank\" rel=\"noopener\"  >Nvidia GTX 400 or equivilant DirectX®:11 Hard Drive:2.5 GB HD space",
    "reviews": [
        {
            "review_text": "Kinetic void had shown promise when first announced. I have experimented with it's features at all stages of development, and was happy to see progress being made each time.   However, as of this writing (Nov 22/2014) I would not recommend this game in it's current state. Many of it's systems still need some time in the oven, features are missing, and there is a lack of purpose or motivation in continued play. Shipbuilding is entertaining if you have a creative side, but not enough to keep me engaged.   An excellent concept hindered by pushing this game out before it is ready. I'd hold off on buying this unless it's under a deep discount or after significant updates and patches.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, with 8 or so hours on record I feel like I can write a review on something quite a few other reviewers spent less than an hour on.  Anyway, I agree with the general consensus: The ship builder side of the game is very functional, and the Workshop is full of awesome ships (and mechs even!) built by members of the playerbase that can be downloaded for your playthroughs. (After you fix them - don't forget the fact that a number of Workshop ships are technically incomplete, with not all of the subsystems set, and often with far too many subsystems than the other parts can handle. Too many hangar bays is a common example.) The learning curve for the shipbuilder is kind of steep, but like I said, quite functional.  Outside of the shipbuilder, it's cool that you can set up a randomly-generated sandbox galaxy to mess around in according to some parameters that you set during generation - namely, galaxy size and number of factions. It gives a lot of play area, though there's no guaruntee your ship (even the workshop ones) will have the warp range to reach other parts of the galaxy. There are missions, pirates who nobody cares if you go hunting, and faction-relations mechanics - all of which are good.  The thing is, outside of that it just feels bare. In 8 hours of play I've only encountered 'go hear and kill what you find' missions. I haven't delved into the economy or career mode, true, but no 'sandbox' should ever feel like there's nothing to do - and that's exactly how this game makes me feel. Sure, I can warp across the galaxy into pirate-held sectors and go to town with a downloaded Star Destroyer or HMS Warspite, sure I can rescue traders from pirate fighters and kill a smuggler or six, and sure it can be enjoyable all the same - I was giddy when I launched in my downloaded Super Star Destroyer and found it to be larger than the space station it was docked at, but all in all I can't really recommend this game.   I bought it summer of last year, expecting it to improve in time, but it really doesn't seem to have gone anywhere. Whether or not the devs are still working on it behind the scenes I'm not really sure. I am sure though that this game has huge potential, but as it is now fails to live up to it. Right now all it's really good for is destroying everything you see. While enjoyable by itself, it gets old when you run into an enemy or 6 using the same ship as you, and that ship is some form of battleship which had until then slaughtered helpless foes. Especially when those enemies are pirates.   I have limited hard drive space, and I am afraid that I'm going to have to uninstall to make room for other, more fleshed-out games. I might still come back to it eventually, see how it's changed (if at all). I just hope the potential here doesn't remain wasted.",
            "review_score": "-1"
        },
        {
            "review_text": "Well first off, i was an idiot and bought this game without reading the reviews.  I bought this because it looked fun and had the aspects of games i love, sandbox, space and ships you can build piece by piece (And customize it even further). I started it, and i was having lots of fun building my little ship.  The problems started when i left the station, not only did my FPS drop to around 4, there is a complete lack of content and atmosphere.   That's my short review.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a truly horrible game.   I bought into this early access version a couple of years ago because I believed the developers were committed to delivering a high quality space-sim experience. I found the ship building workshop a cool introduction to the game too. All was looking promising and I cooled my interest while the developers worked away.  Well two years on (three for the kickstarter backers) and Badland Studio have churned out an ugly, half-baked, poorly optimised, insubstantial product with almost nothing to recommend it.  To those who have yet to put money in the pockets of Badland Studio, seriously don't bother. To those who have already paid for/backed the game, you have my condolences. If Steam routinely processed refunds, I would be asking for my money back right about now.",
            "review_score": "-1"
        },
        {
            "review_text": "I would keep my distance from this game. standard early access scam, will never be finished and the content that is in the 'game' atm is lacking to put it mildly.  Easily one of my worst purchases.",
            "review_score": "-1"
        },
        {
            "review_text": "Finnicky ship designer allows you to put together some intersesting (or just plain ridiculous) designs, but that's about it. Gameplay is essentially non existant at time of writing",
            "review_score": "-1"
        },
        {
            "review_text": "Abandonware. Never updated. Developer website is offline. Game is unfinished.",
            "review_score": "-1"
        },
        {
            "review_text": "Developers abandoned the game and left us with an unfinished game. There is literally nothing to do in this game other than constructing ships",
            "review_score": "-1"
        },
        {
            "review_text": "This game is an absolute piece of ♥♥♥♥. Believe me, I tried to build a ship, but couldn't figure out how to ♥♥♥♥ing change the controls. There are some you can and some you can. I can't express how disapointed I am. Glad the developer of this game spent more time making graphics then basic video game mechanics. Those fancy graphics lag the living ♥♥♥♥ out of my computer anyway, even if you can turn them down. There is a special place in a pile of ♥♥♥♥ for this game. Iv'e had more fun getting kicked in the balls than playing this game. It's not a game if you can't ♥♥♥♥ing play it. 0.3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Kinetic 'Void of Content'. The game was originally under development by four guys. Three of them left, and now we are stuck with an incomplete shell of a game that looks suspiciously like EVE Online without the 'online'. Updates are non-existent. Oh well. It was a pre-release purchase. Lesson learned. File this one under 'zombieware' - it's dead, the devs and the game just don't know it.",
            "review_score": "-1"
        },
        {
            "review_text": "I got the game a while back while it was still in alpha because I liked the concept of the game: build your ship and explore the universe. However, it was rather raw then (and understandably so at such an early stage), so I put it aside with hopes it would mature into a great game. I wish I could say that that is what happened, but when I played the 1.0 release of it, my hopes quickly vanished. They've improved the UI somewhat since the game was in alpha, but the game and the UI are still somewhat glitchy and feel clunky.  The biggest failing that I see in it though lies in what I (personally at least) expect in a sandbox type game. To work a sandbox has to provide an immersive universe in some way such as the building mechanics in space engineers or enough universe lore and detail that the player can feel like a part of everything around him or her. Without this, what would be a glorious sandbox becomes a sloppy game with no objectives. Unfortunately, I see kinetic void as a sloppy game with no objectives right now.  I'm sorry to give such a negative review. I hope some people find enough good in the game to still enjoy it, but for me it was a waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "As an early-access, I would have recommended it for its potential, however as a full-game I would avoid it. The only clear selling-point to this game is the creative ship-building one could do, but outside that realm, the gameplay gets tedious and monotone.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't bother. This game is total garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "Had this deep into EA , the devs hardly updated the 'game' now it's a broken shell with hardly any content.  Gabe sold his soul to the devil letting rubbish like this onto steam, hope it was worth it.",
            "review_score": "-1"
        },
        {
            "review_text": "Another early access abortion. DO NOT BUY its basically a prototype ship builder that actually had quite a bit of work go into it, other than that it's pretty pointless. You're better off putting your $20 towards Elite:Dangerous or something similar.",
            "review_score": "-1"
        },
        {
            "review_text": "Avoid at all costs. This game and its devs are all dead.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ game that has been abandoned by the devs. Do yourself a favour and DO NOT buy this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Christ... I don't know what i payed for this back in the day but whatever it was, it was too much.  I never had any fun at all with it, had trouble figuring out EVERYTHING and in the end, its just not a good experience on any level.  Avoid like the plague.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont buy, unfinished and left behind.",
            "review_score": "-1"
        },
        {
            "review_text": "Abandoned by the developers, this game should not be out of early access.",
            "review_score": "-1"
        },
        {
            "review_text": "Not really a game. Cool shipbuilder. I was told there would be a game, though. I was incredibly shocked when I saw the other day that they are claiming it's out of EA. It's plainly not, they just stopped working on it. Exactly the kind of thing that gives EA games a bad name.  Edit: It appears I was wrong to say that the devs had halted work on the game completely, thanks for the correction. As I looked into it it seems they have still been working on some monthly bug fixes and improvements. Though I don't think that any of the things I've seen listed in the change log really implore me to spend more time on the game even if many of the potential features that the devs have stated they'd like to add were to be added in the future, I'm happy to hear that the devs are still putting in some time.  While I'm glad to hear that the devs are still working on it, the statement of calling it a 1.00 version as well as the specific avoidance of promises about what will or will not make it into the game still turn me off enough to wish I had put my money somewhere else, though I admit there's an outside chance I could reinstall on a whim in a year or two and be pleasantly surprised.  So to sum up, the shipbuilding aspect is very well done and I'd say it's probably a lot less confusing than it might seem at first if you just take a few minutes to adjust yourself. It might still be a little obtuse at times, but you only have to check out the workshop to see how expansive it can be. However, the gameplay to my taste at least, still felt very underpolished and generally uninteresting to the point that I can't have a lot of hope it could ever be anything but outdated at best as of only one patch ago.  If I've missed anything, please feel free to let me know so I can correct it.",
            "review_score": "-1"
        },
        {
            "review_text": "Abandonware, the game is unfinished. At this stage it is only shipbuilding simulator.",
            "review_score": "-1"
        },
        {
            "review_text": "This game has been in slow, casual development for years... and needs years more or the same pace. The only reason why the alpha tag was removed and it was taken off early access is, and I quote, 'Because of how early-access games work, keeping it off the store front and preventing sales.'  The game is not finished, the developed is a hack and is just scamming you for money.",
            "review_score": "-1"
        },
        {
            "review_text": "UI is bad and hard to control Not many options for ship parts Even when you start to finally play the game world is empty",
            "review_score": "-1"
        },
        {
            "review_text": "Farting is more fun than playing this pile of poo.",
            "review_score": "-1"
        },
        {
            "review_text": "This should be and should always have been no more than a couple dollars.",
            "review_score": "-1"
        },
        {
            "review_text": "I picked this game up again recently, thinking it was still in Pre-alpha phase, but have just now read in another review that it is actually already released as a full game. To put it simply, I noticed no improvements that blew me away enough to even notice that this was the finished game, even after forgetting i owned this game and reinstalling it. I particularly don't like the way the ship-building interface is; it looks cheap and ugly. The game as a whole is difficult for me to play, as the controls seem nearly as ambiguous as what I should even be doing. I don't think I'm a terribly picky person, I understand a game does not need to rely heavily on complex themes or dazzling art styles and graphics to be playable, but this seems to be one of those games where it looks so sloppily put together, that it puts me off from wanting to even humor what gameplay is present. To tie a bow on it, I don't believe this game has any real potential anymore, so i don't recommend that anyone purchase it, and I regret buying it.",
            "review_score": "-1"
        },
        {
            "review_text": "Incomplete garbage. Do not buy.",
            "review_score": "-1"
        },
        {
            "review_text": "Basicly EVE Online, but only if EVE was singleplayer only and halfway complete. Ship construction is kinda fun, unless you want to build ship out of size 4-5 parts, mostly because of slow-moving camera. And except for ship building, there ain't much to do. Trading and missions do not work correctly, mining is boring, and winning a fight depends not on your flight skills, but how much dakka, hp and shields you have.",
            "review_score": "-1"
        },
        {
            "review_text": "What happened......WHAT HAPPENED!?!?! THIS USED TO BE AWESOME!! I USED TO LOVE THIS GAME SO DAMN MUCH!!! AND THEY ♥♥♥♥ING ♥♥♥♥ED THE ♥♥♥♥ING ♥♥♥♥ER PONY!!! THIS WAS SUPPOSED TO BE GOOOD!!! HOW DID THYE ♥♥♥♥ IT UP THIS ♥♥♥♥♥♥♥ MUCH!?! -28/3 STAY FAR AWAY FROM THIS",
            "review_score": "-1"
        },
        {
            "review_text": "Great screenshot generator. Long way to go before it deserves be called a 'game'.",
            "review_score": "-1"
        },
        {
            "review_text": "Abandoned, Unballanced, thief developers. Fun for 10 min.",
            "review_score": "-1"
        },
        {
            "review_text": "The last update was Jan 30 2015. The game is incomplete and abandoned. Edit: now been over a year and some since last update.",
            "review_score": "-1"
        },
        {
            "review_text": "Liked: ship building possiblities   Disliked: Everything after building ship   So no i wouldnt recommend after the devs have left it for dead   Bad Devs sit in corner and learn from mistake oh and give us our money back",
            "review_score": "-1"
        },
        {
            "review_text": "This game had a lot of promise originally and then, like a lot of Early Access games, seemed to hit a developmental quagmire. The game went from alpha to finished almost as though it were a spontaneous decision. I don't want to beat a dead horse here and go through a long enumeration of all the things I disliked and liked about the game; on the balance, it's not worth buying.",
            "review_score": "-1"
        },
        {
            "review_text": "Loved it when it was being developed. However, it's been abandoned.",
            "review_score": "-1"
        },
        {
            "review_text": "I got this game back when it was in Early Access. Right from the start everything is more complicated than it should be, and nothing is explained properly. Thanks to that you spend way too much trying to figure out the simplest things and everything felt counter intuitive. There really wasn't much to do, and game breaking bugs were everywhere. It recently came out of Early Access, and I decided to give it another try - I see no difference apart from somewhat helpful tutorials you now get. The game is still broken and empty.",
            "review_score": "-1"
        },
        {
            "review_text": "I payed £4 for this game hoping for a fun space Sandbox... I want my money back but I know i'll never get it back because, judging by the development, the developers are going to earn a bit of money then abandon the game. DO NOT BUY THIS DON'T FALL INTO THE TRAP Nothing like the trailer  3/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "Backed this game and it had a lot of promise...then, rather than follow a 'typical' update/upgrade through EA, alpha, beta, etc., they started trying to 'fix' things that were not 'broken' and adding convoluded layers to some of the more elegan/simple parts of the game, that were not 'broken.' Oh, well. It appears to be an abandoned project at this point. If you can get it for the option to build your own ship and fly it around do so on the cheap...this is not worth the 2$20 US. I moved on to Elite Dangerous and never looked back.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't even figure out the build a ship screen. Super unintuitive UI, this is mostly a broken game.",
            "review_score": "-1"
        },
        {
            "review_text": "Bought it when it first went into early access... checked up on it from time to time to see what had changed... now it will just never be finished.  Complete waste of money.",
            "review_score": "-1"
        },
        {
            "review_text": "Kinetic void, watched the video read the forums in very early access (2013). Realised that it had massive potential bought the game. Played it, shelved it and like many others waited for a better game to come to pass. What Ive learnt since then, again like many others, I'll watch the video read the comments look at game play, read dev blogs and decide (usually correctly) that the game in question is just too over ambitious and throw my money at something else.   Now the dev's are a smaller team this is one of the games that, personally, cant seen to be ever finished to the point where I could turn around and say 'buy this'. The game is difficult to get into, difficult to play because it still is and possibly awlays be an unifnished product. Dont treat this as a full release (it pushed out of early access for many reason im sure). Love building ships? (great looking too), Love flying em about with partially completed gameplay? Then buy it. looking for something that doesnt require a lot of reading up on tutorials, bug workarounds and shallow gameplay then sorry, just look somewhere else.  What money I did spend on this game helped me save huge amounts of cash not spent on other early access games no matter how good the sales pitch is. So every cloud and all that...",
            "review_score": "-1"
        },
        {
            "review_text": "Overpriced spaceship creation game.    You can go into space, but there's literally no point.    You make your ship, admire all the time you spent on this really neat craft, then reconsider your life choices.   Backed this game on Kickstarter and it's been literally exactly the same since then. There have been some UI edits to make it a bit easier to build ships, but that's it.",
            "review_score": "-1"
        },
        {
            "review_text": "really wish they had finished this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Not sure what is worst...This game or that my best friend gift me Bad Rats...I think this game is worse...",
            "review_score": "-1"
        },
        {
            "review_text": "big no go.. horrible, and no visible change since its early access.",
            "review_score": "-1"
        },
        {
            "review_text": "Normally I'm interested in getting in on a game before it's considered 'finished,' but it's been waaaay too long since there's been any substantive updates (or any updates at all for that matter).   There are a lot of folks out there calling these guys 'cheats' or some permutation of such, and I have to say I think that's unfair. I don't think they went into this planning to cheat anyone. Lots of folks dream about making great games, but there are so many things that have to come together to make that happen, and sometimes all it takes is one or two things falling apart. That said, I can't recommend something this unfinished, though it looked like the vision here was pretty grandiose, maybe too much so?   If it's on sale for less than $5, you might buy it, build some ships, download some modded ships, and play around a bit, but don't go into it expecting Elder Scrolls in space or anything of that nature. I've been in the market for a good space sim and the best I've found is Starpoint Gemini 2, (and even that's not quiiiite what I was hoping for) so if you're reading this, you might go take a look at that instead. Is it a low blow or improper to recommend another game during a review? Maybe? If through some miracle this game ever gets finished, I will absolutely come back here and edit this review.",
            "review_score": "-1"
        },
        {
            "review_text": "such a great game teaches you to be careful with your money and not purchase early access",
            "review_score": "-1"
        },
        {
            "review_text": "It was fun when it was initially out. Completely abandoned by devs.",
            "review_score": "-1"
        },
        {
            "review_text": "Half-♥♥♥♥♥ attempt at a game. The dev's own incompetence and laziness lead to this mess.",
            "review_score": "-1"
        },
        {
            "review_text": "Still has more features than No Man's Sky",
            "review_score": "-1"
        },
        {
            "review_text": "When I first reviewed this game it was mostly positive reviews, somethin in the 80%.  I expressed my concerns and my opinions about the game, that it's controls were clumsy and the game play lacking any motivation to move forward.   I also expressed my concerns on the base game engine, the overall lack of inovation and the old look and feel of the game.  after many months I can safly say that I continue to support my opinions and having seem a dramatic drop in positive review %, and having read many other reviews that most people feel the same.",
            "review_score": "-1"
        },
        {
            "review_text": "I want my money back...",
            "review_score": "-1"
        },
        {
            "review_text": "Long, long way to go on this one. The premise is good and one day it may be realised...but not yet. One thing the developer oes do is listen to the community and continually works on the program. Unfortuantely, it should have stayed in the hangar another 6 months at least.  EDIT (July) - With the upcoming July patch the game looks to becoming a game. Up until now there has been nothing enjoyable about KV, my opinion oly, but with this patch the sim/game might finally be closer to a completely playable package than previously. Looking forward to what comes next and as such have rated the game a 'tumbs up' at this point.  EDIT (March 2015) - A concept with much promise in the beginning yet left to fail and die as a 'game'. The 'Build' element was tragic and problematic from the beginning, but all there was to the title. Now, even it has been nerfed. This is NOT a 'game' but a broken concept. Beware!",
            "review_score": "-1"
        },
        {
            "review_text": "This game is no where near finished. The UI is clunky, the tutorial is a mess. I still have enough frame rate issues, and sound bugs that I can't even comment on whether or not the flight mechanics are any good.  If you want to build space ships and fly around the universe there are a million games better than this one and most of them are probably cheaper. I love space sims but not this one.",
            "review_score": "-1"
        },
        {
            "review_text": "unfinished, overambitious kickstarter game. a shame really",
            "review_score": "-1"
        },
        {
            "review_text": "Not sure what happened. Had potential. Seems abandonded now.",
            "review_score": "-1"
        },
        {
            "review_text": "Looks like the game is not being supported anymore and was never finished.  In addition one of the devs, LumberingTroll, deleted my post questioning if they are supporting the game and then perma banned me. Basically, they got tired of supporting this piece of junk and took the money and ran. No integrity whatsoever. STAY AWAY!!!",
            "review_score": "-1"
        },
        {
            "review_text": "get your wallet, go to a gun store, and buy a shotgun. then go to google and research how to kill yourself via shotgun.",
            "review_score": "-1"
        },
        {
            "review_text": "I have no idea why bought this game, and I sure as hell didn't like it.",
            "review_score": "-1"
        },
        {
            "review_text": "cool I bought some more early access abandonware. Hope you overdose from the money I gave you :)",
            "review_score": "-1"
        },
        {
            "review_text": "My first Early Access purchase. Not a good one. Bought it in early access when it first appeared on Steam since I thought it would be a great game when its complete. No idea why its out of its Alpha stage. At the current state it should still be in Alpha v0.5. Not even Beta.  The idea was great, the game was okay-ish, but incomplete. In the early days they had some patches every now and then, and it seems like the game was on the right track. After a while the updates stopped, and i stopped hoping.  At this point I had bought a few other EA games and learned a lesson on supporting EA games, that is only support ones that is trustworthy.  The game lies forgotten in my Library, part of me hoping it will be complete and a part of me wishing i could just uninstall the darn thing so i can have my free space back for a better game.  Just remembered i had this 'thing', uninstalled it and decided to give a belated review, so people would be informed and not buy this incomplete 'thing'.",
            "review_score": "-1"
        },
        {
            "review_text": "Don't get cancer",
            "review_score": "-1"
        },
        {
            "review_text": "I would definitely recommend Kinetic Void, however with a warning. The game as it is, is a lot of fun in my opinion. The ship building aspect is very entertaining and allows players to create whatever sort of ship they please, from small one-man fighters to giant hulking cruisers. Once out in space the game can get a little empty. There are missions to do which give you an immediate objective or you can go out and sort of do your own thing. There is mining for resources and diplomacy which allows you to go into a hostile system and hunt enemy ships for bounties. It can get a little old though. In my opinion, more diverse missions should be added as well as an option to select mission based on what kind of playstyle you have (maybe a mission interface at space stations?). This would allow players who want to play as a pirate to do raid missions, miners to do resource gathering, etc... I also think smaller stations should be implemented that do not have shipyards, but rather some sort of other funtions (ie. Smugglers' dens, military instalations, trade centers, etc?). One more thing I would hope to see is more interaction with friendly faction ships, because as of now, friendlies just sort of drift around space and don't do much. I'd like to see something like, escort missions for friendly factions, or the possibility of hiring wingmen to fly around with you and assist in combat.  I think the game is deifitely on the right track, it IS a fun game as is but it still needs some work, I hope a DEV gets the chance to read this review and think about the suggestions I've made. I think implementing some of them would make the game feel fuller once the fun of ship building wears out or you've run out of ship ideas.",
            "review_score": "1"
        },
        {
            "review_text": "One word: Atotalpeiceof♥♥♥♥♥hatnevergetsupdatedandisacompletewasteoftimeandmoneyandtherforeshouldnotbeboughtbyyouoryourfriendsunlessyoulikegamesthatareboringtastelessandugly...",
            "review_score": "-1"
        },
        {
            "review_text": "Nice interface and massive possibilities for the future.  The ship building function is alot of fun allowing you to customise your own ship and take on the galaxy.  Can't wait to see what the future holds for Kintetic Void.",
            "review_score": "1"
        },
        {
            "review_text": "This is the only game I have ever played that has a warp drive of sorts (except star trek online). You can build your own ships from scratch, and make truly any design you desire. NPCs will also have these ships available, meaning you can give them ships that equal your own in terms of power (so the game changes as you become more inventive). It is tricky to manage the subsystems along with the space of the ship, but once you know what you're doing everything should be fine  The worst thing about this game would have to be...the repetitiveness of placing weapons. You have to select your turret each time, and place it so it looks right. The mirroring isn't as finely tuned as the mirroring in Kerbal Space Program. Additionally, once the turret is down you must go into the weapons subsystem and select what each individual turret should be equiped with. Making large ships with lots of subsystems can get tedious and/or confusing, especially if you want everything to look even (which I do).  A good point, the galactic relations allow you to make enemies and allies, which can be fun. Trading is something that I haven't yet figured out, which leads me to believe that it's poorly explained, however overall this is a fun game if you want to build your own ships and fight others in space.  The main thing that would make this game a massive improvement would be multiplayer, better controls, better graphics, simpler mechanics to build ships, and getting rid of a few mission scripts that don't work.",
            "review_score": "1"
        },
        {
            "review_text": "well. took it apon myself to design my cool own ship :D  i undock after saving it... then just open space..................................  3 hours of jumping around... no players, large quadrants of NPCs, or the such. id expect a little bit of EVE in this but its not.  i quite after so long.... and after my internet stoped fluxtuating",
            "review_score": "-1"
        },
        {
            "review_text": "I remember when i had 1 minute on this game, now by my hours you can tell i love it...",
            "review_score": "1"
        },
        {
            "review_text": "the game has progressed alot since i played last  the game is good if you want to build starships, it could use more varity of parts (like that misc option is barren)  little bit more documentation and reimplemt of that copy placment button  other then that i still love going out in my ships and killing things",
            "review_score": "1"
        },
        {
            "review_text": "  I dont know what others have against this game.  Its an open world Space game were you have to choose what you are doing. There is no story you can do what ever you want. Fighting Mining Trading Exploring. I have played this game alot and its one of my favorites. So i recommend to try it out.",
            "review_score": "1"
        },
        {
            "review_text": "Its fun making your ship in such detail but that is all the game offers.. gets boring.",
            "review_score": "-1"
        },
        {
            "review_text": "Would be really fun if Multiplayer was added...",
            "review_score": "-1"
        },
        {
            "review_text": "Total crap. Would avoid.",
            "review_score": "-1"
        },
        {
            "review_text": "Let's compare my first review to that of my current, shall we? Just about 0% of this game's previous playerbase now still has anything positive to say about this game, so my voice is just a drop in the bucket... But I realized I needed to edit this.  - - - - - (Old Review) - - - - -  This game is amazing. Hands down the most fun in a space game I've had in a long time.  What I like about it is the sheer massiveness of the things you can create and the massiveness of the galaxies you can explore. I've also found out that you can create your own factions, and if you wanted to, delete the starters and make all custom ones that have their own unique ships and all.  If you're into space or large-scale wars or both, look into it. It won't disappoint.  - - - - - (New Review) - - - - -  The game has been dead since January 2015. The developer, 'Badlands Studios,' is now some stupid game retail store somewhere in the US, owned by 'LumberingTroll' (aka Sean Pollman) I suppose... But it's been almost a year since last I even looked at this game's page.  Let's pray that these developers never live this embarrassment down - no group of coders who took advantage of hopeful fans so disgustingly should ever create games again. They released a massive list of planned features they intended to implement before suddenly (disregarding? ignoring? re-writing?) this list and passing their half-baked - no, too kind - utterly broken and pathetic project of a game as 'complete' and then abandoning it after two or three further bug-fixing updates. ...which didn't even scratch the surface of what all was wrong with it. They took their money and split. Never in my life have I felt so horribly cheated, and it was only what, $20?  I couldn't sit and let my once-positive review sit and be seen by other poor folk... So, here it is, over a year later. If anyone else ever sees this, you be sure and avoid any game that has Sean Pollman or 'LumberingTroll' and friends listed as developers. You'll thank me later.",
            "review_score": "-1"
        },
        {
            "review_text": "Seems abandoned with nothing to do. Luckily I made my money back by selling a rare card dropped from the game so whatever.",
            "review_score": "-1"
        },
        {
            "review_text": "Changed review to NOT RECOMMENDED. Appears the development has been abandoned.   (Original positive review) Great. Steam Workshop already, and a developer who joins in with the community. This game is going to be superb. They are concentrating on all the right things first. Procedurally generated universes which you can save and come back to, user made ships, plenty of videos and tutorials to get you started. There is more to this one than meets the eye. With this solid foundation the rest of the content will fall intro place. If they are not careful they'll give Early-Access a good name ;)",
            "review_score": "-1"
        },
        {
            "review_text": "Do not buy this game. They never finished the game. Such a scam.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is officially dead the last update was 30.1.2015 and from that time nothing happened. This game should be deleted from store. I was lucky to buy game for half the price but still i want refund. Don´t buy this game the sites of devs are dead and game too.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is the perfect reason not to trust any kickstarter or early acces games. Because everything looked perfect on paper but the actual game is junk. Never buy any of those games unless you completely trust the developer or you have actually see some gameplay videos so that you'll know what you're getting into.",
            "review_score": "-1"
        },
        {
            "review_text": "TRASH TRASH TRASH TRASH TRASH  this game is not what you expect, i like most of it but the gameplay LACKS objectives SEVERELY its horrible DO NOT BUY",
            "review_score": "-1"
        }
    ]
}