{
    "app_id": 227200,
    "name": "Waking Mars",
    "release_date": "2012-12-13",
    "developer": [
        "Tiger Style"
    ],
    "publisher": [
        "Tiger Style"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Sci-fi",
        "Adventure",
        "Exploration"
    ],
    "achievements": 17,
    "positive_ratings": 919,
    "negative_ratings": 113,
    "price": 6.99,
    "description": "In 2097, life is discovered on Mars. When your mission of first contact becomes trapped by a cave-in, you must master the alien ecosystem to survive. Soon you stumble upon more than anyone expected, and with time running out, you will make a decision that determines the fate of a lost planet.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/227200/header.jpg?t=1447357132",
    "minimum_requirements": "OS:Windows XPProcessor:x86-compatible, 2-Ghz or fasterMemory:512 MB RAMGraphics:OpenGL 3.0, or OpenGL 2.1 with framebuffer extensionsHard Drive:400 MB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Can't believe I never got around to writing a review for this amazing game but here goes something.   Waking mars is basically an adventure/action exploration based game that delivers a really nice sci-fi story about a planet in perpetual slumber that you must kick start so that a ecosystem of alien flora can thrive once more and then you can start to unravel the mystery of mars... who or what set this system up inside of a dead planet?  The music is topnotch, that bears a mention as well.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best xenobotany game. Solve puzzles and enjoy relaxing Martian cave gardening.",
            "review_score": "1"
        },
        {
            "review_text": "A sci-fi indie game, no real enemies, except for environment hazards. Basically, you plant stuff until the requirement is reached to cross to the next area. If you are looking for a non-violent game, with once in a while side missions, then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great and addictive game of exploration and experimentation. On normal mode it's very easy as you can 'fly' and have mostly to elude some dangers and catch some objects. The development of the story and the new elements you found were a strong draw to keep me playing this.  Very, very, recommended.  The only minor flaws I found are 1. At times you have to go back to previous rooms and wait a little to collect some things but at least there is a map that make this easy. 2. Sometimes even if you are seeing something on screen and your character is clearly seeing something, you have to stand in certain spots so that your character or your companions acknowledge this and you can continue. ",
            "review_score": "1"
        },
        {
            "review_text": "Simple, relaxed game 7/10  Pros: 1. Nice atmosphere 2. Unique gameplay 3. Nice sci-fi feel overall 4. Easy and smooth controls  Cons: 1. Odd transition screens 2. Gameplay is lacking 3. Dialogue and voice acting is only ok 4. Boring soundtrack  Overall, it was an easy enough game that I found relaxing. Not a lot of depth here but that's not always needed.",
            "review_score": "1"
        },
        {
            "review_text": "Waking Mars is as good as long as you can stand it. If you don't like exploration and growing ecosystems, you're going to think this game is ♥♥♥♥ing boring. If you like science and running around exploring what a long-dormant ecosystem does, then this is a game for you! It's fun and relaxing, and getting an ecosystem to work together to support itself in your favor is satsifying. The only real two flaws I can think of are those awful plants that shoot spores and ♥♥♥♥ everything up, and your AI partner which I can charitably describe as 'irritating Claptrap'. ♥♥♥♥ Claptrap. First he's the worst character in Borderlands, and now he's here ♥♥♥♥ing everything up. ♥♥♥♥ YOU, CLAPTRAP.",
            "review_score": "1"
        },
        {
            "review_text": "A really interesting take on the puzzle-platformer. Innstead of killing enemies or pushing blocks you're balancing ecosystems to progress.",
            "review_score": "1"
        },
        {
            "review_text": "I picked this up on sale and couldn't be happier. It is a short game. I am quite pleased with the level of polish for this game. All of the animations are very smooth. The physics game play is natual. The unique aspects of the game, the aiming and culitvation of the ecosystem, is very well balanced. I liked the game so much I played through to the end. This is a great game at the price. There was some hic up with the audio at a couple of points where it clipped and produced and annyoying chirp. But it did not take away from the other audio. The gamepad integration was a nice touch. It does make for a better experience when playing a platform type game. I expect this game to have some staying power. If it is on sale or your looking for something new, pick up this game for a weekend play through.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine a game with Metroid-style exploration of a world, except instead of shooting everything that moves, you're a scientist on an expedition to explore Mars, you've discovered life in an underground cave system, and the only way to procede is to plant seeds and create little ecosystems in each chamber of the caverns to open up access to new areas. You have no special powers or abilities other than the seeds you collect and the jet pack on your space suit, and it's fairly interesting what that changes about the way a game like that plays and what things stay the same. There are lots of different ways to solve the rooms, depending on how they're laid out and what you're in the mood for doing with them, whether it's friendly and cooperative or antagonistic with everyone eating each other, micromanagement-heavy or something that sprouts from nothing and grows all on its own because of a couple careful decisions you made. The story and voice acting are pretty decent too, and it's worth spending the extra couple hours to get the 'real' ending(s) if you're into the gameplay, both to find out more of what's going on and because figuring out how to make the most of what you've got in each room is usually what's the most fun.",
            "review_score": "1"
        },
        {
            "review_text": "A great game! Excellent gameplay and graphics. The story makes you want to find out more, and the characters are cool. Only the end is a bit abrupt. I would love to have an ending sequence with the characters reflecting what happened.",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent exploration &amp; puzzle game. Great story line and smooth playability really make me want a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "This was perhaps the most peaceful and relaxing game I've ever played. Serene music, tranquil and colourful ambience, a botanist-role type of character in side-scrolling gameplay where you plant, grow, and breed lifeforms underneath the surface of Mars, all the while swooping around caverns with a jetpack strapped to your back. Great character dialogue and interaction, and a good basic and interesting story with multiple unique endings. For a planet that represents war and destruction, this ironic game made Mars seem like a prosperous, creative heaven. Waking Mars was a breath of fresh air from all other games, and I highly recommend it to anyone, esp. to those who want a different, unique, and relaxing game to play.",
            "review_score": "1"
        },
        {
            "review_text": "Lovely game from the Humble Bundle, nice painterly art style. It's a relaxed story driven puzzle game I guess, all about sorting out eco-systems and stuff.  Very relaxing, worth taking a look at, took me around 6 hours to 100% so it wouldn't take too long to run through even for a peek. Give it a go~",
            "review_score": "1"
        },
        {
            "review_text": "An awesome indie game on all points. The graphics are simple but nonetheless nice and colorful, and the environment, though only made of caverns most of the time, is varied enough. The gameplay is as simple as the visuals but original and interesting since it is aimed at creating and controlling a martian environment. I could say the same regarding the story. The voice acting and soundtrack are good. I could add that if you are curious and like to explore, you'll find a few secondary objectives to do, which will tell you more about the story or the characters.  Waking Mars is not really difficult, but plants and wildlife do not remain passive and they can make environment control tricky if you're not careful.   What I find really enjoyable is the whole scientific background, as your character does research on the flora and fauna while making progress, and all the findings are written in some sort of database that you can consult anytime. The theories and explanations regarding the environment are quite interesting.   Needless to say, a game that invites you to create instead of destroying is more than welcome.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. Engaging and unique story with a relaxed and calm pace. The characters and voice acting are fantastic, especially the actor voicing the main character. The only slight mark against the game is the AI that travels with you. Could game and movie designers please stop thinking that giving a computer an annoying voice somehow equals comedy. Unfortunately it completely ruins the atmosphere the game is trying to set up.   However that is the only complaint I have with the game. The control systems, game world and graphics are all top notch and who knew alien gardening would be fun? Very much recommended, especially if you'relooking for a more thoughful gaming experience.",
            "review_score": "1"
        },
        {
            "review_text": "EXTREMELY AWESOME GAME  Very creative gameplay Awesome Music Awesome Voice actors Very well done level design Lots of secrets Multiple endings",
            "review_score": "1"
        },
        {
            "review_text": "I can highly recommend this alternative and relaxing exploration game! Good story and surprisingly fun gameplay when you get into it. It does require grinding though if you want to get all achies.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome hard sci-fi. Also, metroidvania with a gardening twist!",
            "review_score": "1"
        },
        {
            "review_text": "I recommend. awesome platformer.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very enjoyable game to play with an interesting world full of puzzles and wierd alien life. However, even with everything fully replenished, the ending leaves much to be desired (it's a slow zoom out on a still picture while credits roll). Not knowing this before hand was very frustrating, but, as long as you keep this disappointing eventuality in mind when playing this game (and in life), the sting of the end isn't as daunting.  EDIT: It appears that I have missed a 'Special ending,' one that, upon further research, is a bit more interesting than the normal one. New lesson, everyone: double check that you haven't missed an important aspect of a game before writing a review about it.",
            "review_score": "1"
        },
        {
            "review_text": "Here's a 2D Indie game that is most likely nothing like anything you've ever played. In a great way, I must add!  In Waking Mars you're an explorer of Mars' caves and its newfound life. As you interact with more and more life, the game registers your findings in a log, showing the amount of work that has been put into designing everything about this game. Every piece of life is highly detailed, and it's worth reading the information you gather as you play.  BUT this isn't a merely exploratory game, despite that being a big focus. After you learn about the life you encounter, you learn how to use it to your advantage, creating the most aproppriate habitat for a certain type of plant or animal to live. In doing so, they'll eventually interact with each other, prospering further and further, that being the main mechanic of this game. Each room has a certain Biomass level requirement for you to progress, a mechanic that makes sense in the context of this game , as the caves' natural defense is to block the exits until there's self-sustainable life in it.  The story was there merely to guide you through your adventure deeper and deeper into Mars, giving you a helping hand in this journey. As you progress, you start grasping the game's mechanics, and you'll be able to create some pretty cool environments and interactions with everything at your disposal, which feels very satisfying.   So, I'd advise anyone to definitely try out this game. The sense of discovery is present at all times, keeping you emersed in the world from start to finish. There's a constant drive to keep you moving forward and exploring more and that's a really big plus! The game's world and mechanics fit perfecty, which is fairly rare, so yea, give them your money already and... enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "The feeling of isolation and discovering life in a new planet is so unique! Throw your money their way, you'll be glad you did.",
            "review_score": "1"
        },
        {
            "review_text": "87/100",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that has been ported to the PC. From a Tablet/phone game it's pretty good. From a PC game standpoint it's a bit of a letdown. It's not a good platformer it's based around touvh controls and you can feel it. It's slow and very easy to avoid things with a control. It's more of a puzzle game that anything else, the story is decent but due to it pausing the game every time there is something to say it really slows you down and personally takes me out of the experience. Don't buy this for a plattformer game it's really not. Being a port some of it feels rushed the menu isn't very good with a controller and it can be difficult to deal with at times.   Final though is it's not bad but not great, play it more for the story then the game play. 6/10",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome game. I can't recommend it highly enough. Unique experience and yet there are some familiar Metroidvania style elements. In this game those you are creating life instead of taking it away.  It looks and plays really well on the PC and there's controller support as well and keyboard and mouse. Played through it recently on Desura and it really drew me in in a way few games do. The ongoing story elements mixed really well with the exploration and ecosystem puzzle elements.  I'd definitely like to see more games like this.",
            "review_score": "1"
        },
        {
            "review_text": "The game is utterly and completely broken. It launches on both my screens at the same time, and the mouse is just unusable. the game itself seems nice, but i just cant play it. i also have framedrops every 15seconds.  this is a joke.",
            "review_score": "-1"
        },
        {
            "review_text": "Best Deep space plant Farming simulator i ever played",
            "review_score": "1"
        },
        {
            "review_text": "Surprsingly good game. Well polished and uinique. Easy controls and great graphics. A real sleeper title and I reccomend.",
            "review_score": "1"
        },
        {
            "review_text": "This game was pretty neat with its concept. Kind of like real time strategy in a way. You are an astronaut trapped in the caves of mars and you have to use your seeds to raise the amount of life which opens the next cave. There is a bunch of stuff for completion oriented gamers and it has a nice set of choices that affect the game. For example you can choose to either leave the cave and escape or go back and search the cave more. However now that i have played through it I can not figure out how to return to the beginning or start a new profile.",
            "review_score": "1"
        },
        {
            "review_text": "Not bad...Graphics aren't great but get fun if you continue playing..",
            "review_score": "1"
        },
        {
            "review_text": "Thought provoking and fun. Good experience.",
            "review_score": "1"
        },
        {
            "review_text": "Written like a high-school creative writing assignment, with completely uninteresting gameplay, this game left me thoroughly bored. Perhaps it gets better after a few hours; I wouldn't know, since I couldn't stomach it. The only positives were the surprisingly good art and voice acting, the latter unfortunately wasted on trite dialogue.",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay idea is fresh new, but the implementation is poorly done. The game becomes boring after an hour and does little to improve past that point.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the idea of this game, but it got fairly repetitive and dull quite fast.",
            "review_score": "-1"
        },
        {
            "review_text": "If i want to plant things i have my garden. 10/10 would delete again",
            "review_score": "-1"
        },
        {
            "review_text": "Now where to begin... Oh Yeah!! Game is a ♥♥♥♥ing masterpiece. It don't really got any replay value to it, but you have to admit that it's pretty fun to find new Lifeforms and do some experiments with them.  Only thing I would want more of is more interactable objects and perhaps better Sentinels! still a great game! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a clever, fun game. At its core is simple platforming, and a sort of 'gardening' strategy game, but the design and story are well-planned and appealing. It's not a very action-oriented game--those looking for their alien first contact story to be filled with bullets and lasers should look elsewhere. 'Waking Mars' has been compared with 'The Dig', but 'Mars' is more fun as a platformer and puzzler, not so much a 'gather and use items' adventure time.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, fairly cheap with a great plot and amazing gameplay. Will keep you playing until you finish it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Instead of killing endlessly you need to figure it out how to raise your plants and get the maximum on each scenario. The gameplay is solid and the art is quite good. Definitely a game that you will not forget.",
            "review_score": "1"
        },
        {
            "review_text": "I almost judged this game by the graphics, and I'm glad I didn't. The controls work well and the levels are very well designed. Fast travel seemed like a strange addition at first, but it's almost open-world, with in-game reasons to go back and fix places you've already been. The dialogue is well-written, all characters are well differentiated, and I'd say the highlight of the game is the story -- which is a lot harder scifi than I expected. A pleasant surprise.  Gameplay is based off of studying and manipulating an alien ecosystem, with no weapons to speak of. In particular, figuring out how to make each life form produce its seed pod, which can be used for many different functions, is vital. It's one of those games that puts you in an unfamiliar situation, where you have to figure out what you can do all by yourself -- and unlike some of them, it pulls it off neatly.  The game IS short though. It took me a little under 10 hours for a blind 90% complete playthrough. Since I got it on sale for $2, it blew my socks off. If I had to pay the full $10, or maybe $5-7 on a cheaper sale...? It might still be worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Why hunt down alien life when you can cultivate it for your own needs?",
            "review_score": "1"
        },
        {
            "review_text": "A fun xenobiological platformer. I'm surprised by how much I enjoyed this.",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, engaging, and has an interesting plot line. It's a puzzle game of sorts, using arow keys and the mouse to help you repopulate plant life on Mars. It takes a resonable amount of time to play through, and is worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "A fairly easy somewhat-Metroidvania-style 2D platformer about bringing things to life in caves on Mars to progress to more rooms to do the same. There's a bit of a charm into doing all that especially when listening to one of the best voice actors I've ever heard in an indie game going through the story. Everything's quite simple here, gameplay, plot, even the animations are done with minimal effort though nothing really negative to say about any of these. If anything I guess it's very short, quite a bit of backtracking may occur, and a few bits of dialogue regarding your objectives may be a tadbit misinforming or don't leave enough info as to what do do next (i.e. you're supposed to gather Item A and take it to Point B though there was no confirmation that you actually gathered Item A but the objective was to actually just go to Point B and the game will do the rest because apparently you already picked up Item A)   Other than those I think the game ain't bad. ",
            "review_score": "1"
        },
        {
            "review_text": "Different in a lot of good ways; refreshing. Worth playing through to at least the 'good' ending. The mechanics will likely grow stale by the time you push for the best ending, however, and the voice acting is a bit stiff.",
            "review_score": "1"
        },
        {
            "review_text": "Creativity/Uniqueness: 8.5/10 (A very unique concept for gameplay) Controls: 5/10 (Basic and easy, but it felt a little limiting) Entertainment/Immersion: 8/10 (It's easy to get immersed, and is not super repetitive, a mix of puzzle and adventure)  Overall, this game was great. Absolutely worth it, even at full price (of which I got on sale for $2.00  If this game is on sale, buy it quick. Save it for a time when you just want to relax and forget about stuff. It is not a game that will cause you to get frustrated, but is pleasantly challenging. Compared with the anger caused by FPS games, or the frustration of challenges in games such as Myst, Riven, any mystery game, etc. However it is not so relaxed that you can zone out too far, such as Minecraft played in Peaceful. It simply is a pleasant game that is enjoyable without the need of solving your problems with excessive bloodshed.  I would highly recommend this game. ",
            "review_score": "1"
        },
        {
            "review_text": "The jetpack platforming strangely relaxing alien garden growing genre was getting a bit stale so I'm glad this came along! A solid iOS port with surprisingly likeable and well voiced characters.",
            "review_score": "1"
        },
        {
            "review_text": "A few rough edges and really very easy, but it's a very original game and worth playing if you're looking for something a bit less hectic than the norm. Don't be put off by what appears to be bad english translations in the dialogue, it's supposed to be like that.",
            "review_score": "1"
        },
        {
            "review_text": "Unique and fun. I look forward to seeing more from this developer",
            "review_score": "1"
        },
        {
            "review_text": "This game is a piece of art and is very inspiring to say the least. Anyone who hasn't tried this, should put it into consideration. It's a short trip you will most likely not forget in the long run.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun gardening puzzler on Mars.  It's interesting using the different 'plants' to create a thriving eco system.",
            "review_score": "1"
        },
        {
            "review_text": "A surreal and quite unique platforming experience in a beautiful organic world.",
            "review_score": "1"
        },
        {
            "review_text": "Waking Mars is a 2D platformer with gorgeous art, pretty good voice acting, and an interesting (if not-so-original) story. You play as a scientist exploring some of Mars' underground caverns when you're trapped by a cave-in. In order to escape, you must cultivate the local wildlife to reach deeper into the caves, where you encounter even more bizarre lifeforms, and uncover some of Mars' past.  The story is intriguing enough to drive you to play to the end, even though the gameplay itself gets a little grindy. All of the Mars flora and fauna are well designed and fleshed out, with your research on them helping you make your way through the various puzzles.  The game is pretty enjoyable, but $9.99 is pretty expensive for the maybe 6 hours you'll get out of it. Buy it on sale to enjoy it the most.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good break from a lot of the high adrenaline games out there. The story is great and the artwork is beautiful. I found myself wanting to see what else the game would reveal, and wanted to get all of the research before the end.  You create your own biome within this cave on Mars, finding the best ways to get max mass, if you're a completionist. The whole process is paced well, and none of it feels like a chore. Backtracking is almost nonexistant, since the map includes a quick travel feature. I also really appreciate that the devs created an auto save before the two endings, so you can go back and get the other ending without having to restart the whole game. That is a big plus for people who want to play once and move on.  With that said, I really enjoyed this game. The length is perfect. The only way it could go longer is if the writers could keep throwing up new discoveries and mystery. However, they go quick, to the point, with no useless filler.   While the journey begins as a scientific expedition, there is much more purpose to be found in the depths. To find all of its secrets is up to you. Will you wake Mars?",
            "review_score": "1"
        },
        {
            "review_text": "A really compelling game. I found it impossible to put down and once i was hooked, i had to see the story through. An interesting set of gameplay mechanics encouraging experimental thinking and a thought provoking story. Tight controls, good characters, good voice acting. Seven pounds well spent!",
            "review_score": "1"
        },
        {
            "review_text": "It may not *look* like fun, but it's one of the most enjoyable games that I've played this year. Very unique non-confrontational gameplay and surprisingly good dialogue. I usually don't like discovery centered gameplay but this story made me interested in it.  Definitive play recommendation!",
            "review_score": "1"
        },
        {
            "review_text": "Short playtime.. but much fun.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice game, much better than the android version due to easier controls. Or maybe I'm a biased PC gamer. Not sure if there's another game quite like it.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most peaceful and stunningly well made and fun games I have played in a long time. If I call this an Action Tactical Gardening game I am only describing the most basic facet of it. The story, gameplay, and characters are all unique, comfortable, and perfectly done. I HIGHLY recommend this game to anyone who actually has a brain.",
            "review_score": "1"
        },
        {
            "review_text": "This game has a great idea, and perhaps not the best execution. But come on. Space gardening. Also it's one of those rare times that in-game scientists actually seem like legit scientists. Rather than MAN WHO CAN USE GUN who also knows a few things. Yiss. Space gardening.",
            "review_score": "1"
        },
        {
            "review_text": "Very different and atmospheric. The puzzle element is deceptively interesting (at first, it doesn't seem like there's anything to it). Protagonist feels a bit flat at times but it's still interesting. Multiple endings; I think I missed one so I'll probably be loading my save to see if I can get at it :o)",
            "review_score": "1"
        },
        {
            "review_text": "An excellent sci-fi exploration game with gardening. No combat, just wander around, grow plants and admire the beautiful sights.",
            "review_score": "1"
        },
        {
            "review_text": "Space botany? ♥♥♥♥ YES.",
            "review_score": "1"
        },
        {
            "review_text": "Simple gameplay, but a rich experience!",
            "review_score": "1"
        },
        {
            "review_text": "Interesting short game with a good concept, writing, voice acting, and mechanics. While I found the strategy of the game as a whole a little repetitive, it was nonetheless fun to play through. Probably the most endearing thing about the game was the world they built in it -- the ideas and art to back up those ideas are fantastic. If you like science fiction, and especially xenobotany, you will probably like this game.   Recommended for: Plant-lovers, sci-fi junkies who like a good story, casual strategy and puzzle game enthusiasts.  Don't do it if: You want gore or violence, need replay value (there's not much to this one), don't like comic relief robots (this one is particularly annoying but not too intrusive), or want complex strategy.",
            "review_score": "1"
        },
        {
            "review_text": "This is what I call and original game. It could be called a platformer, an action game, or and adventure game, but it is really about biodiversity and ecosystems. Yes that is right. In Waking Mars you will learn to grow and maintain stable ecosytems. And you will have fun doing it. I promise. You will also uncover shocking discoveries about Mars at the same time, but that is just side stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Suitable for 7-10 year olds, but thats about it.",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely loved this game. It is charming, well made, and a fun puzzle platformer. Great if you like exploration and science fiction.",
            "review_score": "1"
        },
        {
            "review_text": "Well worth the full price. Waking Mars is thoughtfull, relaxing and engaging with a great story delivery. It's a little rough around the edges as far as graphics are concerned, but that's only a minor issue.",
            "review_score": "1"
        },
        {
            "review_text": "Fascinating exploration game about building ecosystems on Mars to uncover a scientific mystery. Grow plants, avoid being eaten, fly around with unlimited jetpack fuel!",
            "review_score": "1"
        },
        {
            "review_text": "In Waking Mars, you play as an astronaut floating his way around the caves of Mars. It's a 2D Metroidvania kind of. The upgrades you get is pretty much the jet pack. The goal of the game is to use seeds you find laying around to fertilize the various plants that are underneath Mars. It takes a while to get into the game, but you have two other characters to keep you company, and there are many types of life on Mars.",
            "review_score": "1"
        },
        {
            "review_text": "It's a decent game. Should add steam trading cards.",
            "review_score": "1"
        },
        {
            "review_text": "Slow pace discovery game. Good for relaxing and appreciate the discoveries unfolding.",
            "review_score": "1"
        },
        {
            "review_text": "I didn't know what to expect from this game, so it really came as a surprise to have so much fun. So, this is mostly a story-driven exploration game, with a part of action/platform which is not crucial to the game but very well done and quite enjoyable. The real thing here is the atmosphere, especially if you like science-fiction, and I don't mean Hollywood action movies, I mean novels about space and planet exploration, science and discovering ancient civilizations. While this is not a Ray Bradbury novel, the story and voice acting are quite good, creating a very nice background for the game. Discovering and re-building the mars ecosystem is original in itself, but the developers have made it quite enjoyable too.",
            "review_score": "1"
        },
        {
            "review_text": "A neat little puzzle game, good for exploring over a few hours and enjoying the atmosphere. The voice acting isn't perfect but it's alright, the music is forgettable but makes for appropriate ambiance, and the methods of meeting the biomass goals are completely up to you. Of course, altering the terrain and farming your favorite zoa species will mean fast traveling back and forth a lot, which can break the immersion a little. I'd give it a solid 7/10.",
            "review_score": "1"
        },
        {
            "review_text": "This is an... okay game. It starts out pretty strong, there's a solid story throughout, the visuals are decent, the planting mechanics seem pretty interesting. For the first three chapters the game is quite linear, and the fourth (and longest chapter) opens up a little though I would never say it's that exploration-heavy, or much of a metroidvania.  But the game really starts to drag around chapter 4, with increasingly tedious work needing to be done to hit 4 and 5 level biomasses for the rooms. Thankfully there's an event that doubles the effectiveness of these right near the end, so if you hit 30 you're basically done. But it still takes a lot of work and some of the rooms can be really tedious and frustrating, the AI on the moving lifeforms is not very good.   There's also a number of glitches, stuff getting stuck in walls etc. but also game-breaking bugs that can ruin your file; thankfully I did not encounter this but I did get a kind of buggy ending the first time via skipping a large chunk of the endgame sequence by having enough core power to trigger the normal ending. It's a really weird oversight, honestly.  But yeah, this game is... solid. I've wrung about as much enjoyment out of it as I think I'll ever get though and I doubt I'll ever go back and replay it. Get it on sale, not full price.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly a good way to pass time. Story is mediocre but the mechanics are fun.",
            "review_score": "1"
        },
        {
            "review_text": "Everyone should play this game, seriously.  This game is very unique and fun. Good playing mechanics. I enjoyed playing it. Nice voice acting and history. The gameplay is rewarding. Give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "Indie 'Action Gardening' game; Metroid meets botany. Mad fun.",
            "review_score": "1"
        }
    ]
}