{
    "app_id": 227380,
    "name": "Dragon's Lair",
    "release_date": "2013-05-17",
    "developer": [
        "Digital Leisure Inc."
    ],
    "publisher": [
        "Digital Leisure Inc."
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Casual"
    ],
    "tags": [
        "Adventure",
        "Action",
        "FMV"
    ],
    "achievements": 12,
    "positive_ratings": 312,
    "negative_ratings": 92,
    "price": 6.99,
    "description": "Haven't heard of Dragon's Lair?! Well, you play the heroic Dirk the Daring, a valiant knight on a quest to rescue the fair princess from the clutches of an evil dragon! Originally released in the summer of 1983, Dragon's Lair has solidified itself as a cultural icon in gaming.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/227380/header.jpg?t=1551942531",
    "minimum_requirements": "OS:Windows 8 Processor:1.8 GHz dual core CPU Memory:2 GB RAM Graphics:256 MB GeForce 8800, Radeon 3850, or Intel HD 2000 Graphics DirectX®:9.0 Hard Drive:2 GB HD space Sound:DirectX Compatible Sound Card",
    "recommended_requirements": "OS:Windows 10 Processor:Intel Core i Series Processor Memory:2 GB RAM Graphics:512 MB GeForce 220, Radeon 4550, Intel HD 3000 Graphics DirectX®:9.0 Hard Drive:2 GB HD space Sound:DirectX Compatible Sound Card",
    "reviews": [
        {
            "review_text": "In a nutshell: this release of Dragon's Lair is as perfect a version of the original laserdisc game from 1983 as you're likely ever to need, for better or worse.  Here's some longer thoughts on the game...  For anyone old enough to have frequented arcades in 1983 you'll undoubtedly remember the stir Dragon's Lair caused when it was released. I vividly recall seeing the local game with a second television monitor mounted atop the cabinet so that the crowds of people standing around could still see the game playing even from a distance, and when *anybody* made it to the end to face off with the dragon there's was a clamor of excitement. That was 30 years ago. Video games were so primitve back then that not only were characters limited in visual appeal and animation but gameplay too was barely more than a joystick moving in 4 directions and tapping a button. In that context Dragon's Lair soared above the rest with its genuine cartoon animation and even the stilted mash-buttons-and-learn-patterns gameplay wasn't too off putting.   In 2013 however Dragon's Lair has little to offer anyone who didn't fall in love with the game back then. The gameplay is only slightly more compelling than hitting the fast forward and skip buttons on your DVD player, and there's grade school fan fiction of King Arthur that's deeper than the plot put in motion here. The animation is very competent and Princess Daphne is a riot of laughter with her breathless exclamations and anatomy that should be poking holes in her costume. Thankfully there are options to make the game easier to play from on-screen prompts to just watching all the sequences play automatically... a much appreciated choice because it gets really tedious playing some sequences over and over because the timing isn't split-second accurate. There are 'achievements' for playing the game in arcade hard mode (no audio or visual prompts) but that's strictly for the masochistic.  For the life of me I can't understand why the video files aren't in 1080p HD quality... it's 720p instead which makes me wonder if there's going to be yet another release somewhere down the line. I also would have liked to get a proper freeze frame mode in order to do animation analysis, and for some reason I wasn't able to take any screengrabs while playing. Very odd.   But, I did pay money for this and I definitely feel like I enjoyed my purchase.",
            "review_score": "1"
        },
        {
            "review_text": "QTE: The Video Game",
            "review_score": "1"
        },
        {
            "review_text": "A faithful recreation of a early arcade classic that would eat so many quarters it was nearly impossible to finish on a 80s kid's budget. The animation in this game still looks amazing to this day, short of finding a working laser disc Dragons Lair (good luck with that) this is as good as it gets. I would give negatives for the lack of steam overlay (this game is begging for screenshots) and trading cards etc. Bare bones but functional version of this classic gem, now please give us Thayers Quest. lol yea right.",
            "review_score": "1"
        },
        {
            "review_text": "This game isn't what I thought it was when I was 10. It was ok.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most fun classic arcade games I've played. It's actually more of an interactive cartoon, but definitely has a certain replayability with the ever changing randomised order of rooms and the QTEs themselves.  The game is full of QTEs {quick time events}, you don't really get to do anything else than to wait for QTEs, as in you're presented an option with a time limit and you will most likely die if you don't act quick enough. So I think it's safe to say there's constant action that requires quite a bit of hand-eye coordination in this one. It can be frustrating and very hard at times but if you don't mind the QTEs, fun is guaranteed.  The most important factor that got me into the game was the beautifully hand-drawn visuals and animation quality, not to mention the main character 'Dirk' sounding like Homer Simpson. This is what they call a FMV {full motion video} game and they don't do good stuff like these anymore. Definitely a gem of a game worth trying.",
            "review_score": "1"
        },
        {
            "review_text": "The first time you play it is vital that you turn off the move guide for the full challange of the game. half the game is just figuring out what the proper command is based on the screen. And often you have to pay close attention to figure out exactly what to do. Having the move guide on ruins this by simply telling you what button you're supposed to press. It's still somewhat fun with the move guide turned on but it really ruins the full experience.",
            "review_score": "1"
        },
        {
            "review_text": "We're knights of the Round Table, we dance whene'er we're able. We do routines and chorus scenes with footwork impec-cable, We dine well here in Camelot, we eat ham and jam and Spam a lot. / We're knights of the Round Table, our shows are for-mi-dable. But many times we're given rhymes that are quite un-sing-able, We're opera mad in Camelot, we sing from the diaphragm a lot. / In war we're tough and able, Quite in-de-fa-ti-gable. Between our quests we sequin vests and impersonate Clark Gable / It's a busy life in Camelot/ I have to push the pram a lot!",
            "review_score": "1"
        },
        {
            "review_text": "This game coninues to be one of the most influential games of all time. Though by today's standards it doesn't offer much, this game paved the way for games being on discs and helped boost the dying arcade business after the market crash in 1983. Whether you call it 'just a bunch of QTE's', or 'the quarter guzzler', no one can deny that they at least had fun looking at Don Bluth's beautiful animation. Highly recommended for any gamer, young or old.",
            "review_score": "1"
        },
        {
            "review_text": "As someone who feeds off of classic arcade games, Dragon's Lair was no exception. This innovative gem revolves around laserdisc technology and that you can play in conjunction to the cutscenes happening on screen. The concept for newcomers is a little trifling, but the controls are very basic. Use the directional keys (WASD or arrows) to move you knight in shining armor, Dirk, to avoid any hazard that occurs in the cutscenes. The one thing you need to be careful about is how you perform these inputs. A sound effect will give you the indication whether or not you made the right action. If you get a buzzing sound, Dirk will die in comedic fashion and you will have to start from the beginning of the cutscene. Three lives and it's game over. This game will require you to remember each of these cutscenes as they follow specific input patterns. One thing to take note of is the fact that this game has the habit of making you repeat certain scenes. It can get very obnoxius when you return to the same room for the third time, but at least by then you will have a pretty good sense and muscle memory of where to go. High scores can be saved and the game also features the option to play on a beginner mode such that the game will flash specific directions just in case you haven't gotten your footing quite yet and still need more practice. This game is not very long, but it will challenge you to keep playing until you get to the dragon's keep and save an unrealistically beautiful princess. For long-time arcade fans, this game is a must. For those looking for a challenge or just want to play something old school to pass the time, give this game a go.",
            "review_score": "1"
        },
        {
            "review_text": "Great, quirky game from the 80s. If you're into old school games or just bored and looking for some silly fun, definitely something to play through. Simple mechanics and a straight forward plot; slay the evil dragon and rescue the princess!",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia, nostalgia, blah blah blah Showbiz Pizza when I was 7, holy crap so many of quarters, etc.  Now that we've got that out of the way...  I like this game and I'm not sure why, because it epitomizes nearly everything I dislike about modern gaming. Quicktime events? Check. Quarter-chewing continue button-mashing difficulty? Oh yeah. Unskippable cutscenes? Creepy hypersexualized damsel in distress whose primary mode of communication is breathy squeals accompanied by the presentation of her ample, barely-covered butt? Paging Princess Sideboob, your close-up awaits. Seriously, add DRM and forced multiplayer and it'd be a sweep.  And yet...I had fun with it. Somehow QTE are less offensive when they're expected rather than jammed into what's supposed to be a completely different type of game. The art, as with pretty much everything Bluth ever put his hand to, is gorgeous. So is the character design (Princess Perkynips excepted, perhaps). Dirk the Daring is instantly painted as both stalwart and supremely doofy, setting the tone for the whole thing. And there's a great surge of satisfaction you get the first time you complete the game in a single run.  That said, I'm fully aware this is nostalgia talking. If someone came out with a game like this today I'd be shouting. So if you're of sufficiently advanced age to have memories of Dragon's Lair going in, pick it up on sale and have a go. Pretty much anyone else will want to steer clear.",
            "review_score": "1"
        },
        {
            "review_text": "Dragon's Lair is interactive cartoon where you have to press the right button at the right time in order to dodge,move or use the sword .  Personally I like to turn off the on screen tips so I can react to visual hints instead . The game does give you split second clues on how to advance but solutions are not always obvious ;)  Game sometimes flips screen to mess with you and can select stages randomly so you can get a different experiance each time . Sure it gets easy once you beat it but most games do . There are many point grind games on steam and none of them have a well animated cartoon to go along .  Despite not playing this game before I have enjoyed it even without nostalgia .  Its animated death galore which made me laugh my ♥♥♥ off all the way .  I loved it .",
            "review_score": "1"
        },
        {
            "review_text": "This was an easy buy for me, I've already paid over $40 for this game in quarters from my youth. It was good to live the nostalgia, I loved replaying it -- but I'm hard pressed in my decision of whether to give this as a recommendation.  I recommend this game only if you have the nostalgia for it, but then if that's you, you would buy it despite any recommndation. So I guess my recommendation is sadly, 'no'.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I'm sure I was among the many that were excited to finally see this game as a playable title on the PC. This was an arcade game from the 1980s that had something special to set it apart from the others: The animation. Don Bluth was the man most notably responsible for this, as he had worked with animated films for Walt Disney, and numerous ones outside of the Walt Disney company. The gameplay is simple; it's all QTEs (quick time events). There are other games where the gameplay solely revolves around QTEs, or a majority of the gameplay does. I've played a few, and to be honest I enjoyed them. So why can't I recommend this game? It's due to the fact that despite the game having an easy difficulty setting, there are times when the QTEs feel broken. They are barely on screen for half a second before disappearing. So if you miss it or happen to press the wrong button, you die. Sometimes you might even accidentally press a button. The result? You still die. I personally feel that if you're going to include an easy and hard difficulty option, the easier one should be slightly more forgiving. Otherwise, what's the point? The home mode offers checkpoints after each room is cleared, allowing you to pick up right where you left off should you die. However, take the the broken QTE timing on easy, and factor in the arcade mode where are there are no checkpoints... It's frustrating. Sadly, not the good kind (I know, oxymoron) of frustrating either, where you want to keep playing. It's a 'I feel cheated' frustrating. There is also the lack of controller support. Which is something I find very strange for a game that was in the arcade. Nostalgia can only go so far, and had these two things not been issues I would've gladly gave it a thumbs up.",
            "review_score": "-1"
        },
        {
            "review_text": "Classic fun, but just an interactive story. I played this for 56 minutes and will never replay it.",
            "review_score": "-1"
        },
        {
            "review_text": "Why...? Why did I spend money on this pile of complete ♥♥♥♥♥?   Repeated and mirrored scenes, split second timing, how lazy can it be?  Seriously, 30 minutes to complete it for £5? I got more worth from the Binding of Isaac. This is the worst price to gameplay ratio I have ever had in my life.  To anyone thinking of buying it, DON'T. Watch the entire game on Youtube, and feel a little less dirty.  I think I'm going to be sick...",
            "review_score": "-1"
        },
        {
            "review_text": "Activate your nostolgia, defeat the dragon, rescue the girl, and save your quarters!",
            "review_score": "1"
        },
        {
            "review_text": "Not quite the arcade game i remember, but, looks almost the same and has the quick death if you don't do something fast enough.  I Do so much miss the death sequence when you die.",
            "review_score": "1"
        },
        {
            "review_text": "This videogame wrote a page in the history of the videogames. A must to have Masterpiece for any videogamer in the World !!! Timeless.  My Final Score is     80  /100",
            "review_score": "1"
        },
        {
            "review_text": "An extramly difficult and addicting game. Highly recomended for everything from the it's gameply to it's retro nostalgia.",
            "review_score": "1"
        },
        {
            "review_text": "Quality game from the '80s.  love those arcade games.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing, exactly as in the game rooms. very very good.",
            "review_score": "1"
        },
        {
            "review_text": "The 'game' doesn't hold up, but at least it's still briefly fun to put  it in view mode and watch.",
            "review_score": "-1"
        },
        {
            "review_text": "An extramly difficult and addicting game. Highly recomended for everything from the it's gameply to it's retro nostalgia.",
            "review_score": "1"
        }
    ]
}