{
    "app_id": 227560,
    "name": "Scourge: Outbreak",
    "release_date": "2014-04-02",
    "developer": [
        "Tragnarion Studios"
    ],
    "publisher": [
        "Bitbox S.L."
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Cross-Platform Multiplayer",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Third-Person Shooter",
        "Indie"
    ],
    "achievements": 43,
    "positive_ratings": 321,
    "negative_ratings": 166,
    "price": 5.59,
    "description": "Blast your way through Nogari Island as Echo Squad. Utilize a devastating array of weapons and special abilities to crush everything that stands in your way. Features a fully Co-op enabled Campaign for up to 4 Players, as well as a variety of 8 Player Versus multiplayer modes!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/227560/header.jpg?t=1478162856",
    "minimum_requirements": "OS: Windows XP (SP3), Windows Vista (SP2), Windows 7 and Windows 8 Processor: Processor Intel Core 2 Duo, AMD Athlon X2, or equivalent, running at 1.86 GHz or greater Memory: 2 GB RAM Graphics: Video Card DirectX 9.0c compatible, 256 MB of VRAM; NVIDIA GeForce 7900 GS, ATI Radeon HD 2600 Pro 256 MB, or greater DirectX: Version 9.0 Network: Broadband Internet connection Storage: 5 GB available space Sound Card: Soundcard DirectX 9.0c compatible, 16-bit",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Outbreak is a huge improvement over the original Scourge Episodes and, for the price, is a bit of solid TPS action. You can't easily get Gears of War on PC so this is the next best thing.  Problem is, it still has a long way to go. Guns feel weak because enemies are Gears style bullet sponges and guns have Gears style spray patterns, and some of this feels Gears-style just because that's what the devs loved and wanted to emulate. The shotgun may as well be a confetti cannon.   I can see where this might be fun in co-op, and it's not especially bad otherwise, but it just does not excite me. For $7 worth of Unreal Engine shooting, you can have a good time, but I have so much trouble picking this over other decent TPSes.  All that said, I DO commend this game for not wasting your time. Precious little of it is scripted. It is quick to funnel you from room to room and give you loads of things to shoot. Very few other Gears-style shooters really have this focus, instead throwing QTEs and cutscenes and slow-walking segments at you and too much other boring crap.  It is not quite fun enough for me to recommend, sadly, but it is still good enough that it is worth playing if you come across it or crave some co-op TPS action.",
            "review_score": "-1"
        },
        {
            "review_text": "Hmm... this game... how should I put it....  It tries to be serious and likeable but at the same time it slaps you with a raw fish in the face... ( Just go along with it )  What I meant by that is : This game is flawed ( animations feel a bit awkward no one runs like this, like a sexy model moving hips and shoulders creating those curves... gah.... ) weapons at times feel underpowered for example burst rifle can take more shots than a smg with dmg mod... ) However on PvP with bots combat is rather intense and its important to use skills and cover. Its the AI enemies in Campaign that feel like bullet sponges...  How I like to think of this game is : Poor's man Mass Effect.  You have your special abilities, weapons and a story ( which is a bit ....insignificant? )  But you are here for combat and Co-Op experience not the story! So this is where this game shines :) If you have buddies pick this game up it's fun with other players and you can play the whole campaign :) Plus this game is quite cheap!   Oh the amount of times i spent a lot of money on early access games just to regret it... but I don't regret buying this game.",
            "review_score": "1"
        },
        {
            "review_text": "Scourge: Outbreak is a headache-inducing third-person co-op shooter designed for four players. The game features terrible gun-play, poorly implemented powers, terrible game-play mechanics, bad voice acting, and strange level designs.   Being a shooter, the game revolves heavily around gun play, its a shame than that this game falls short on pretty much every aspect of the gun play. The game has plenty of guns to offer, but due to every enemy essentially being a bullet sponge, including the very first grunts of the game, most weapons are either useless or only useful in set situations. Limiting players to only two guns at a time discourages experimentation since the risk of doing so is punished by encountering bullet-sponge enemies. Shotguns have an astoundingly short range and snipers cannot kill anything in one hit by the time you get them which makes the shotgun highly situational and the sniper essentially useless. Grenades have no throwing arc and the result is guess work when trying to hit specific targets at any distance, a tedious affair when grenades are required to kill something. One of the essential parts of being a shooter, the placing of bullets into enemies, is one of this game's weakest attributes.   The powers that the four main characters receive in the game end up feeling more than a little disappointing when you get them, primarily due to an antagonist's teleportation powers being the teaser to your personal powers. Each person is supposed to end up with different powers, according to the voice over, but what ends up happening is that each character has different versions of ground blast and shield. Ground blast is only useful near enemies, with the exception of Amp who can somehow throw her blasts like magic grenades, and shield is fantastic since it lets you not die when reviving allies that will inevitable fall due to lack of cover or the AI running into the open. All of this is only possible if you have enough Ambrosia, which you only get from green barrels of goo that explode if shot, meaning you could end up without a source of energy and as a result, no powers. Overall the powers are neat in concept, but you likely wouldn't miss them if they were removed.   The mechanics and concepts in the game show that inspiration has been taken from several shooters, most notably the cover system taken straight from Gears of War. A problem that arises from this is the implementation of most of these ideas are done terribly or simply aren't designed well. The cover system doesn't work well if you don't include the cover to go with it, or the ability to use your guns properly from cover. The result is that most enemies behave in such a way that locking to cover is detrimental to the game-play experience and likely to get you killed unless there is no way to be flanked. Worse is the alien enemies that have to melee you to hurt you, making cover a dangerous affair. It is strange then that the aliens are introduced in a cramped corridor with nearly infinite amounts until you kill the lead aliens. For a single player this section is virtually impassable as the AI can't cope with the amount of enemies and reviving the player at the same time. The strangest part of the introductory area of the aliens belongs to the end of it, where you have to defend against a rush of them while a door is on a timer to open. During the defense there are defenses on the wall helping you hold them off, giving you time to fight the aliens without getting swarmed while still feeling as if you will. These strange decisions continue to appear in later stages, such as a boss you can't kill unless you remove barrels of Ambrosia that are healing him after a certain damage threshold. Those are the very same barrels used to regenerate your own powers so by destroying them, you lose your powers shortly after receiving them. Another boss requires you to throw grenades at specific parts from a distance, which is immensely tedious without a throwing arc and should not have been included without a useful launcher of some kind. The game could have benefited greatly with fewer but more focused mechanics, but opted for more is greater.   The voice acting in Scourge: Outbreak is not so much terrible as it is inconsistent, such as the lead character having an accent constantly change from sentence to sentence and occasionally in the middle of speaking. It sounds like they had multiple voice actors and forgot to decide on a specific actor. Other examples are lines delivered from antagonist's that often sound unrehearsed or as if the reader is perplexed by the writing. The result is an inconsistent delivery of vocal work that ends up jarring and pulls you out of the games world.   The level designs used in this game seemed to vary between corridors and big open rooms, with corridors taking the stage the majority of the time. One area of the game has you wait in a corridor while the game scans the protagonists, the door than opens to another corridor that leads to a cut-scene. Corridors leading into corridors appears to be their way of slowing the pace down after combat; it's a poor method since there is no sense of progression, just going from fight to fight. Some sections have what appears to be water slowing you down, though as it is walked through, it moves away from the player as if jumping in a gelatinous substance. Having the character slow down in water is unnecessary, especially in rooms that have nothing in them which is always the case. Sadly most levels are poorly designed, either with too much cover, making it detrimental in the search of enemies, or too little cover, making it hard to survive the enemy's onslaught.   This game is not recommended, even on a budget due to many frustrating moments and poor enemy design. The game is pretty much unplayable alone and renders you powerless when in a group since there is a lack of Ambrosia. I recommend not buying this game at any price.",
            "review_score": "-1"
        },
        {
            "review_text": "I think it is best to describe this Cover-Focus Shooter as a Mystery, Sci-Fi, and most importantly, Horror B movie with a plot to match it. The game starts out as a simple 'get in, get out' mission with the goal of freeing an informant from a corrupt science facility while stealing an alien rock that company found. In classic mystery format, the plot progresses with unexplained actions, characters purposefully not being clear for the sake of suspense, and tons of gore not fleshed out well to make it bearable to watch. It has a major plot twist that I won't spoil, followed by pretty much petty revenge for the sake of it when the plot twist is revealed. If you can stomach the lackluster and borderline terribad plot arc, the rest of the game portion is quite good with minor flaws to get used to.  (quick score: 7.5/10 Well done with major story holes but a satisfying 5-6 hours worth of time with friends)  Pros:  - Most important: Online Co-Op works great. I've had no issues playing with people from the other side of the world, so consider it an easy pick to play with Steam friends.  - The dark and mysterious atmosphere they try to give in the game is well presented. I was interested in finding out what was in the building as I went further down to try to complete the objectives.  - Some of the best free aim shooting I've seen in a third person shooter. Often these style of games that encourage cover systems make shooting without aiming down the sights practically impossible to fire. With this, you always have 100% accuracy with blind firing, but aiming will provide a reticle and improve the potential accuracy zone as an incentive to aim. This gives shotgun blasting a great sensation and I often used it even during sections of the game that didn't benefit using it.  - Map progression has some slow points, but difficulty as a whole matches up nicely as each chapter continues to the next.  - The guns have a distinction from each other and an easy to understand desire for when to use them. The Firefly is great for mid range sustained burst fire, the Reaper is for power shots farther away, .etc .etc  Cons  - Wasted potential with the flashback scenes. Quite literally the scenes are there to make you question what is going on and don't really solve anything in the plot. They are slightly summarized during the plot twist, but are written off as a throwaway idea than cool to know.  - The cover system itself has some problems with how the character commits to cover. When using cover, the character will stand or sit pending what the object is. The issue is some cover makes them stand instead of kneel, making it useless and endangering players.  - The cover system also has problems with blind firing in cover. there are specific arc ranges the blind fire works and limits how useful it can be. Luckily blind fire isn't integeral to beating the game, but it is nice to be able to use it from time to time.  - After the plot twist, almost the entire story is inconsistant with what happened during the mission. I won't say how it does to avoid spoilers, but it is easy to say none of the things you'd see in the antagonist's action would realistically occur if the plot twist was legitimate.  - If playing with AI bots, the AI is almost useless. They do take more damage to compensate for how much they endanger themselves for a cover based shooter and do a decent job being field medics to revive downed players. For actually killing foes to prevent a need to revive, they are awful. Highly encourage playing with 1-3 friends.  - The story itself feels rushed. The initial objective, or at this point, the McGuffin, never gets mentioned again throughout the game and becomes all about hunting down Alpha Squad and oh yeah, maybe, eventually, rescueing Reisback as stated at the start of the game.  - Whoever came up with the game portion of the Dropship boss fight, I hate your guts and hope you don't do that again. That fight took 30 minutes of chucking grenades and missing the majority of the time. It is the worst section of the game, by far.  - HP feels inconsistant for both foe and yourself. The game makers give no hard stats to see health or damage and some the game uses locational damage as a factor, making it even harder to figure out how safe one is when they have to take damage. Head shots feel like a make or break against most enemies, especially later on when they can start taking a lot of bullets if hitting everywhere but the head.  Overall  Scourge: Outbreak is a decent game with a muddy story but worth the price of admission if played with a game mate. It doesn't have high replay value and some questionable spikes in difficulty here and there. Still, I would recommend people play it for both fun and inspiration to get the ideas flowing on the genre this game tries to be. It left a positive affect on me.",
            "review_score": "1"
        },
        {
            "review_text": "The game might be a bit short compared to other games and the multiplayer part is just a regular addon, but the game is an underrated gem with a really fair price and enough attention from the developers. I am hoping for a sequel!",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Hard to play alone with no helping(bots not doing any s**t)  But that more easy to play multi, Hard to find multi player servers somtimes lol But afterall that very fun game and it's reminds me L4D2( but L4D2 is better xD. L4D2 IS 10/10!) And Checkpoints are not real they are just insane. I mean the checkpoint you only can see is when the 4 at the elevator or when the mission is over lol.I guess that what make that game more harder that it should be.. Why not make checkpoints after every war or something.. That game have some more cons that I not mantion them. ..-BuuuuuuT!--.. I got this for free (Ambrosia Bundle) :P  anyways my score for that game is 6/10 anyone who want to play with me add me lol..",
            "review_score": "1"
        },
        {
            "review_text": "Very distracting tight pants worn by the female character. I love this dating sim.",
            "review_score": "1"
        },
        {
            "review_text": "One of the alien boss' has female genitalia showing... 100/1... i came..TWICE!  Third Person shooter, Squad based, meaninggggg up to 4 player Co-Op!!!!!!!  Delicious graphics, smooth gameplay, a little clunky with the 'getting against walls for cover' but still good :D.  Best played with friend or group of friends! Also looks fun playing by urself huehuehue.  There is also versus mode if u just wanna spank your friends in the behind. OH and u can toggle friendly fire in Co-Op Story..so that makes it more challenging!!!!!!!!!!!  Brought to you by Huggies Diapers...You're a big kid now!  ",
            "review_score": "1"
        },
        {
            "review_text": "First, I like the gameplay, and then the music.  Somewhat make hints even easier to understand!",
            "review_score": "1"
        },
        {
            "review_text": "I was lured into the game because of the price and all the positive reviews on steam. The game is not bad but its just kind of dull after awhile. The story is pretty generic and then it tries to add a twist at the end. Its a really bad way to tell the story. We know throughout the game that things aren't as they seem but then to just puke out information for two minutes at the end isn't good story telling. You could tell they had some good ideas and maybe wanted to tell more but the execution was poor. The ending tries to leave you on a cliffhanger but all it feels is like a waste of time.   You are going to spend a lot of time running around and shooting stuff and the combat never really feels that satisfying. There are a few weapons that are fun to use later on in the game but the same four you end up using for most of the game are just unexiciting. It just goes back to that dull feeling, especially with the shotgun.  Honestly, there is just no good reason to spend money on it. You are better off spending your money, your time, and three of your friends time playing something else.",
            "review_score": "-1"
        },
        {
            "review_text": "Well, occasionally buggy, cover system sometimes does not work as it's supposed to, companion AI is still pretty much ♥♥♥♥♥♥♥♥, some things need more polish.  So what? Really cool characters, awesome guns and really intense gameplay!   Moreover, this game proves that some developers actually CARE. They knew that they will not make a lot of money on this game, they knew that the first Scourge wasn't a very good game, still they fixed most of the bad things, redesigned the levels, added more features (I really like the XP and skills system), improved pretty much anything, for instance the enemy AI (they really are pain in the ♥♥♥ since the half of the game!), shooting and cover system. They even gave away this game for free for everyone who owns the first Scourge.  And that's why this game is worth a shot. Yes, it is a generic Gears of War clone with Mass Effect elements. Yes, the low budget is visible in every inch of the game, and yes, it still needs some fixes. But as I said - developers really CARE about the players, unlike pretty much every single one of the BIG companies, so I guess such rarity deserves some support from us ;)  And with such positive attitude, energy and enthusiasm I hope they'll make it big some day.  Thanks for your time and effort, guys! Keep it up!  PS. And screw Metacritic, IGN and other 'big' reviewers. Seen other players' reviews? Yes, this game really is a good one :)",
            "review_score": "1"
        },
        {
            "review_text": "I'll keep this short and sweet: this is a very fun game, especially in co-op, and a fantastic relaunch of the original with some added polish, content and stability.   The combat is reminiscent of the Mass Effect series (combination of gunplay and cooldown-based powers) and it tells an interesting story, but never lets the story get in the way of the game.  Its absolutely worth the price if you enjoy 3rd person action games, especially if you can play with a friend.   ",
            "review_score": "1"
        },
        {
            "review_text": "Let me preface this by saying that I know my played time is low to be reviewing it, but I bought it for myself and my wife and we haven't had much time to play together in the past few days. This game is an excellent combination of deadspace, mass effect, and left for dead. Very fun, very intuitive controls, exp/levelling system could be a bit more developed. Very little difference between the characters, but that's mostly a good thing in a co-op game like this. Single player is alright, but I definitely recommend it for playing with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "Its the kind of game where its going along good, with tactics and battles, with goals and things. Then the developers give up trying and just throw in infinite-generation of mobs of stupid globular monster things with no way to clear and move and secure areas. Its just an endless spawn fest of BS.  Will I ever finish this game? Doubtful. Thank goodness I got in for less than a dollar on some crazy sale, because anything more and I would actually be upset about the loss of money spent on this piece of trash.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun as hell, seriously addictive. Rough as hell at times but worth every cent.",
            "review_score": "1"
        },
        {
            "review_text": "Here’s what you should expect: low-budget, Gears-of-War-like, third-person shooter with added sci-fi elemental attacks and defenses. The campaign can be played solo or with up to three other players.  I beat this game back when it was called 'The Scourge Project.' That title is gone from the Steam Store now, and this new game sits in previous buyers' libraries, effectively erasing our play time. The re-release adds some Dx11 effects and a few minor clean-ups here and there. It's ultimately the same game, though.   The story is passable, but it takes the back seat. Some of the voice actors are good, most are not-so-amazing. There's a touch of character development, delivered in flashbacks, throughout the campaign - which is kind of neat considering it begs multiple playthroughs to learn the true background of all four playable characters.  Back when it was originally released a year or two ago, I took around nine hours to beat the campaign once (one character) because I tend to drag my butt and stare at everything. I think average for one campaign solo should be closer to seven hours.  This title focuses on action and cover-based shooting mechanics.  Is it as solid-feeling as Gears of War? No.  Is the story as good as GoW? No. Really, no.  This game won't change your life, but for eight dollars, it scratches the console shooter itch.   7 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for only an hour and already had multiple freezes that forced me to force quit the game. The audio-graphic voice sync is aslo crap and enabling subtitles is a waste. Most dialogues cut out before they are finished and it really takes away from hte story (or lack of development). My experience was on the dishonourably discharged Ranger. When I was landing on the Island and went to open a door, some two or three second clip had the resitance leader saying 'You think doing this will clean your record.' then the subject was never touched again. This game need serious updates to fix this unplayable game. For now I won't recommend anyone to buy this, even if it is on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "Scourge: Outbreak sadly falls short of a mediocre Gears of War clone. In the first 20 minutes I was tempted to turn it off and uninstall, due to the fact that the story became stale from the get go, as well as how the hit reg was implemented. Soon after you empty your clip into a dumb enemy, you'll no doubt notice that it takes more than half a clip for the enemy to go down. This is due to the first few bullets which register, which then triggers an animation in the enemies model so you know you're hitting them, but sadly the animation also negates any other bullets to register until such animation is done executing. Once you notice this, you'll find that firing in short bursts, spacing your shots so that the animation finishes through, then fire again is more effective, but also ridiculous. I also haven't come across a game in which an enemy needs 2 - 3 headshots before a death...  Scourge: Outbreaks story is also unoriginal and has been told many times before. Basically a mega corporation has monopolized a vital resource but by a sinister means, and thus you are tasked to fight your way to the grand dismantling of said corporation. This story has been told in the 'Alien' universe to some extent, and is way more interesting.   The AI is, for the most part, stupid. Think of the Dreamcast or Nintendo 64 days, in which the AI ran around blindly or jumping for cover in which you are behind, taking such cover, then realizing that you're the enemy and then starts to shoot you. The story tries to reconcile this by telling the player that 'They are under psychic control!' which basically means that the developers decided that it was easier to implement a stupid AI than to implement a stronger one, and try to reconcile this through the story. Thankfully, most of us gamers see through ♥♥♥♥♥♥♥t and laziness when it comes to games like this.  Though I've only played a brief bit of the game, I feel confident that this doesn't break any new ground, or even old cracked ground for that matter. The story is worn, the graphics are unspectacular, the voice acting us below sub-par, and the feeling that this game is a waste of time is enormous. If I were you, I'd save your money and buy something more worthwhile than Sourge: Outbreak.  UPDATE: After 3 more hours of playing this game, I can truly say that this game sucks. Infinite spawning enemies, grenade spam by the AI, the part in which you gotta destroy a dropship becomes more and more difficult (Dropship fires increasinly more rockets) as you try to destroy conduits which take forever to destroy. Oh, and the ally AI likes to group together and take cover behind each other, as that's what we do when we real people play these sort of games.",
            "review_score": "-1"
        },
        {
            "review_text": "For 2 quid, buy it, for more, do not.  ONLY PLAY WITH FRIENDS, AI IS TERRIBLE!",
            "review_score": "1"
        },
        {
            "review_text": "Third person tactical shooter with some RPG elements and 4 people coop feature. Sounds great right? Sadly this game is huge disappointment (at least for single player experience). Since this is 4 people coop game then playing solo you will accompany with 3 brain dead AI. Terrible skill trees which also means auto level up and no there are no character stats only skills which game will assign for you. No manual save which means auto checkpoints at the worst places.  Combat. It is tactical and simple? No, there is nothing simple in it. Game just spawns bunch of mobs and that's it and forces you to sit in cover and from time to time enemy AI throws some grenades at you for ♥♥♥♥♥ and giggles. In second chapter where you encounter new alien enemy types is just plain dumb, because it took me about 15 restarts to finally understand what i have to do in order to get further. In other words you have to get some kinda DNA but to get to that you must kill bunch of aliens. Simple? No, game just keeps spawning them, does not matter how many you killed they keep coming at you. Aliens have ranged and malee attacks, ranged is much weaker but still annoying because if i'm correct they slow you down and malee is just brutal, if they jump on player 3 hits is enough to kill you.   Weapons. Simple. Lack of weapons. There are 7 types of them. And you can't upgrade none of them. Because why would you right? It would be too easy. Almost forgot, you can't insta kill anyone with shotguns even better assault rifles have more damage than shotguns.  Overall. I was really looking forward to this game, but sadly i was frustrated by it.",
            "review_score": "-1"
        },
        {
            "review_text": "Surprisingly good game, story is better than the majority of the shooters and co-op works really well. The voice acting and AI isn't that great but for a game this price it's more than fine. Visually, the game didn't look that great at the beginning of the game (mostly tutorial) but becomes way better when you get more into the game. Some really great environments too. Would recommend with 7.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game has more bugs than the seconds I spent to beat it",
            "review_score": "-1"
        },
        {
            "review_text": "  6/10 TJBs",
            "review_score": "-1"
        },
        {
            "review_text": "It's cool if you play it with friends. I'd never play it if we didn't have four people though - not enough variety. With four people though it's fun to work with your team to come up with strategies for the hard parts.  Definitely get it on sale though, I paid $3 for it.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the homeless man's version of Gears of War (if he also had a gimpy leg). The main issue is that co-op is forced upon you from the start, thus making you rely on your 3 incompetent AI idiot partners (don't bother trying multiplayer since it's completely dead). Even if you don't die, they will and you will be forced to start from the last checkpoint (in which there are far too few in a game that heavily relies on bad AI). Issuing commands is useless because rarely ever will they attack the enemy they are supposed to. All of the guns seem underpowered (at least in Gears, a few headshots to the Locust grunts will put them down quickly; in this game, it doesn't matter if you shoot them in the head or legs, there is no difference in damage). The cover system is passable, but your character oftentimes will slide to another wall or obstacle that you don't want them to. Don't bother wasting your time or money - play Gears of War instead (or wait for it to be released on Steam, however long that may take).",
            "review_score": "-1"
        },
        {
            "review_text": "I initially tried to play Scourge Project 1&amp;2 and failed, mostly because the screen resolution was desperately set to 'lowest'. It was a blast to play Doom like this, but in full 3D, you just feel visually impaired. Anyhow, Scourge : Outbreak solved this problem, so I finally was able to play it.  Aside Left 4 Dead, it was the second time I played a 'third person / team based / tactical fps' but since I love real-time party-RPGs like Dungeon Siege, or turn-by-turn tactical RPGs like FallOut Tactics, this one sounded engaging.  The gameplay is pretty straightforward : choose one of the 4 characters, use a tutorial if you need and get some backstory (nice addition), then run into action with your fellow heavily armored buddies, receiving mission updates along the way.   It seems that the game makes a good use of modern FPS tropes like choose-2-weapons-to-carry and glue-yourself-behind-boxes. The orders you can give are contextualized : depending on where, who or what you are targeting, you can have the closer team member take cover, focus on an enemy, open a door, use a turret, revive another team member ; without losing the pace of the fight which is great. Overall, each team member is a decent shooter and never forgives to save you even under heavy fire.  The special abilities are kinda neat, but for me, the real pleasure of the game was to consider each confrontation as a puzzle : where should I position each team member in order to assault or defend? Sometimes an sub-optimal line of sight could cost your team frequent death/revive cycles.  The enemies are challenging enough, even in beginner more. Soldiers can take advantage of the level and bosses requires some strategic planning. But the strange design decision of infinite critters that mysteriously vanish when you reach the next checkpoint somewhat disrupted the experience.   Since the storyline is purely functional and the characters kinda stereotypical, playing solely for the story won't reward you. It seems that there is a leveling mechanic, granting you points in different categories like 'short range kill', 'head shot', 'assistance' but I don't know if it grants you with bonuses except for the powers.  To wrap it up, Scourge Outbreak is a decent team-based shooter, with a nice game flow, and correct level design. Nothing truly memorable though, so it feels more like a filler.",
            "review_score": "1"
        },
        {
            "review_text": "I love the way Indie games growing. This game isn't so bad, it was my first game in Steam in 2010. It's kinda trash, but I buyed a 4-pack with my friends, then we just played it for a couple hours. It was fun! I can't say nowadays that I'd spend even a 3$ for this, but its free for whos already have the original game. Maybe, you'd try to find very low price on the sale. One of the thing I'm glad to see is the languages. There is even russian. Another one thing is 4-player coop. I know, the developers just wanted to see their game awesome, but, you know, the graphics is like in 2010, (hi-res textures, wut?), gameplay is boring (shoot-cover-shoot), an awful scenario (and classes? lolwut, ♥♥♥♥♥ please) THE GAME KINDA 'GEARS OF WAR FOR 2 DOLLA' So, now, in 2014, the nostalgy comes back.   5\\10",
            "review_score": "-1"
        }
    ]
}