{
    "app_id": 227580,
    "name": "10,000,000",
    "release_date": "2013-01-15",
    "developer": [
        "EightyEightGames"
    ],
    "publisher": [
        "EightyEightGames"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie",
        "RPG"
    ],
    "tags": [
        "Match 3",
        "Indie",
        "Puzzle"
    ],
    "achievements": 14,
    "positive_ratings": 1573,
    "negative_ratings": 187,
    "price": 3.99,
    "description": "10000000: The Dungeon Crawling Matching Game",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/227580/header.jpg?t=1555588905",
    "minimum_requirements": "OS:Windows XP Processor:Core2Duo Memory:1 GB RAM Graphics:Any 3D capable card DirectX®:9.0c Hard Drive:50 MB HD space",
    "recommended_requirements": "OS:Windows 7 Processor:Core2Duo Memory:2 GB RAM Graphics:Any 3D capable card DirectX®:9.0c Hard Drive:2 GB HD space",
    "reviews": [
        {
            "review_text": "I was quite drawn to 10,000,000 because of the promise it showed in mixing RPG and puzzle elements. While the game delivered less depth than the concept seemed to allow for, I still got a very fast-paced, addictive, and satisfying puzzler. It was cumbersome using a mouse to play a game that was clearly designed with touch screens in mind, but the gameplay was enjoyable enough at its core to ease that pain most of the time. The music was catchy, and the variety of things to level up provided enough incentive to make it through most of the game. What I most appreciated was the fact that you're unlikely to brute force your way to the 10,000,000 point goal by simply grinding enough to level everything. Success is ultimately the result of strategy, speed, and good fortune, which was refreshing after the way so many other smartphone ports that have made it to this platform just hand victory to the player after a significant enough investment of time and virtual currency. It's unlikely that you'll want to revisit this one after beating it, but the asking price is very reasonable for a game of 10,000,000's overall quality.",
            "review_score": "1"
        },
        {
            "review_text": "Uggggghhhhh, Have you ever played an rpg that had too much grinding? That's 10,000,000 'strong' suit. Don't buy this, it's barely even phone quality and isnt worth the tiny price tag. It combines rpg and puzzle elements and attempts an endless runner approach... which sounds cool on paper but it ultimately doesn't work. The upgrades are tedious to obtain and barely make a difference. 10,000,000 gets a 4/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "'Keep doing these menial tasks and you can buy things that help you do the menial tasks for longer, and we'll congratulate you!'  My job could learn so much from this game!",
            "review_score": "1"
        },
        {
            "review_text": "Family Friendly version of HuniePop, trading in sex for skeletons  10/10",
            "review_score": "1"
        },
        {
            "review_text": "10,000,000. An RPGish, Bejeweled-like game. Well... ok...  While the game does have an interesting concept it annoyingly relies on luck and what tiles the game decides to generate more than anything else, much like Bejeweled or similar puzzle games. If a monster is in your path, you'll have to quickly match sword or staff tiles to do damage. A locked chest requires matching key tiles. And as tiles are random, one might find oneself stuck, matching any tiles at all, hoping to match enough of what is needed before time is up.  At the start of the game, be prepared to lose, quite often, until enough materials are gathered to unlock upgrades. While initially the upgrades that can be purchased come in handy and allow one to make quick work of monsters, the upgrades have a max level which in my opinion is too low. Especially during the latter ranks, and especially when fighting bosses. Even completely maxed out requires, more often than not, way too many tile matches and wastes way too much time. However, there are items to find thru out the dungeon run which can help somewhat. Scrolls that will change wood or stone tiles to keys, swords, or staves. Various weapons and orbs to hurl at monsters. Skeleton keys to easily unlock chests or locks. And food items that will give you a time boost. With that said, the weapons, orbs and skeleton keys must be used rather precisely; if used a split second too early when arriving upon a chest or monster the item does nothing and disappears. The same can be said for tiles too. It would have been nice if there was some leeway as making sure the dungeon runner is close enough to an obstacle before using items can waste valuable time, even if just a split second.  And possibly the biggest time waster in the game, combos. Match some tiles, more fall down and they match. Combo! They are sometimes handy like during a boss fight. Except when the tiles continue to fall and continue to match it becomes a potential death trap. Yes, I've lost more than once awaiting tiles to stop falling and matching others because during this time nothing else can be done. And if the reason I lost wasn't because I ran out of time, it was shortly after because the combo completely used up tiles that would have came in handy just a few seconds later.  Replay value? Prepare to spend several hours upgrading everything before even attempting a run for 10,000,000. But after one does achieve freedom by getting to a score of 10,000,000, the only reason I can think of to come back to this game would be to try for a higher personal score (no Steam leaderboards), or to earn all achievements. Personally, once I complete all the achievements I doubt I will ever play this again.  Is 10,000,000 fun? Sure, it can be. Would I recommend it? Hmm. Not at the full price of $4.99. I picked it up on sale for less than a dollar. At that price it was worth it. While I don't really want to vote thumbs down, I'm going to have to since Steam has no neutral option.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is one of the best games for thos of us that enjoy a good puzzel and it has a good amount of action and challenge but at the same time not so hard you want to rage quit it is also very addictive so yes i do enjoy this game tremendously",
            "review_score": "1"
        },
        {
            "review_text": "OVER 10,000,000! Yes, that is the goal of this game.   Even though the concept of match-3 puzzle have been use hundreds of time, the addition of RPG and action element make this game stand above all. The gameplay is very simple because is a match-3 puzzle, but unlike other, you have to focus more on your charactor and the next objective that you have to clear, if a monster stand before you, you need to match attack tiles, if a door or chest you need to match keys. There is also material tiles, after every run end, you gain the materials and experience points to help strengthen your charactor, which help you on the next run.  Unlike the mobile counterpart, the PC port does not feel like endless at all. Once you upgrade everything to the max, which is fairly easy grind, and reach 10,000,000, the game feel finish because of lack of a leaderboard. I must note that the achievement does add extra challenge but once you get use to the control, you shouldn't have problem clearing them.  Overall, I must say this game is a good buy for the listing price, can even be a must buy when it on sale. You may want to play this game on your phone though, is it a phone game afterall.",
            "review_score": "1"
        },
        {
            "review_text": "very interestng puzzle matching game with some rpg rougelike elements in it. Ye",
            "review_score": "1"
        },
        {
            "review_text": " Match 3 as Action RPG...",
            "review_score": "1"
        },
        {
            "review_text": " Introduction",
            "review_score": "1"
        },
        {
            "review_text": "High speed puzzling with a nice retro soundtrack, and shockingly addictive gameplay. I recommend picking this one up if you're willing to burn some time and only have five minutes to spare. Also, its title is named after a score, so that's cool too.",
            "review_score": "1"
        },
        {
            "review_text": "A sliding, Match Three puzzle game is basically what you have here. While that sums it up, it's not nearly all that is going on in this game!  Cute 8-bit graphics in the style of many old/ retro computers which are somewhere between the Atari 2600 and the NES complete with music to match it. Action RPG elements involving weapon, armor, shield and magic upgrades, items, monsters, spells, treasure, etc. That sums the game up even better.  Basically you are trapped in a dungeon and can escape if you reach a score of 10,000,000 hence the title! This along with the puzzle mechanics and upgrading system make this one of those 'Just One More' games! Play it.",
            "review_score": "1"
        },
        {
            "review_text": "This puzzle/dungeon crawler combo is great fun, for about a couple hours. The overall playtime is a bit short(perhaps cause it's a mobile port?) but still fun. Imo you should only get this one when it's on sale :3",
            "review_score": "1"
        },
        {
            "review_text": "If you're fond of Bejewelled (or similar games) and games with RPG elements, this may be for you. The video gives a basic rundown of the gameplay - slide rows and columns to make matches of 3 or more of the same item, and your character will use it to attack with sword and staff, open locked chests and doors, etc. I finished this in a little over 6 hours, but it was thoroughly enjoyable. (Then again, I have played quite a bit of Bejewelled Blitz so I was already fond of the control system - the hardest part was adapting to sliding rows/columns rather than swapping individual adjacent tiles.)  If you're looking for a casual game with an RPG feel, I certainly recommend '10,000,000'.",
            "review_score": "1"
        },
        {
            "review_text": "Very addictive and dynamic game, really short though. Nice variation of 'match 3' games. Absolutely worth trying!  ------------------------------  Очень затягивающая и динамичная игра, хотя и короткая. Отличная вариация на тему 'match 3'-игр. Определённо стоит попробовать!",
            "review_score": "1"
        },
        {
            "review_text": "Bejeweled, RPG edition.",
            "review_score": "1"
        },
        {
            "review_text": "Fast pace RPG flavored puzzler with upgrades abound!",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but better play it on a tablet.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun and addictive It's hard to really understand this game without playing it yourself. The tutorial wasn't entirely clear but it was all pretty self explanatory after playing a few rounds. Only complaint is that it doesn't last that long (just over 3 hours total game time, not using the score multipliers) although it could be played forever for a high score if you really wanted. I can see it having replay value. Definitely worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "The biggest RNG I have ever encountered. Played for hours, very addictive. The entire time though I was near boiling point with rage at starting over a million times due to RNG really hating me. I don't know if I would recommend it or not, had fun for alittle while, then just raged until eventually I gave in to the RNG gods and quit.",
            "review_score": "-1"
        },
        {
            "review_text": "The biggest RNG I have ever encountered. Played for hours, very addictive. The entire time though I was near boiling point with rage at starting over a million times due to RNG really hating me. I don't know if I would recommend it or not, had fun for alittle while, then just raged until eventually I gave in to the RNG gods and quit.",
            "review_score": "-1"
        },
        {
            "review_text": "I had forgotten why I did not care for this game ---- if you don't have intuitive M3 skills (as I don't) you're pretty much out of luck, So, for me, trying to accomplish the same objectives over and over gets tedious and boring pretty quick. And the help in the game is minimal, with messages quickly flashing by, then it's play immrdiately with no time to ponder.  I don't mind grinding ---- do it all the time in some games ---- but the goals are inordinately high, and there is too much about the game that seems stacked against the player.  I won't say that it is not a good game, it's just not for me. But, since tastes are so diverse, it might be just what you're looking for.",
            "review_score": "-1"
        },
        {
            "review_text": "This is the most insanely addictive game I've played for a long time. It makes you think laterally unlike any other tile match game that I have played. I feel like my brain is getting stronger with each frustratingly awesome run. It has RPG elements too!  A RPG tile match game!   Win!  The music is fantastic as well. Bouncy and happy, eases the frustration when you just miss that sword match, or have too many stone tiles.  ",
            "review_score": "1"
        },
        {
            "review_text": "Fun little matching game, nothing you wouldn't expect here.",
            "review_score": "1"
        },
        {
            "review_text": "The sequel to 9, 999,999.",
            "review_score": "1"
        },
        {
            "review_text": "A casual relaxing match3-esque game. If you fail the round it doesn't matter, you can start again immediately to continue earning currency. After the round you buy upgrades with your currency and that's kinda cool.   10,000,000 is worthwhile only when it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I spent WAY too much money on this, and i'm pretty sure it cost me less than a dollar. This is free app store garbage.",
            "review_score": "-1"
        },
        {
            "review_text": "piece of ♥♥♥♥ the game want to kill me  I will die",
            "review_score": "-1"
        },
        {
            "review_text": "a game that should've been kept to ios. I did get it for free though, and even if it was 75% off (hasn't gone on sale as long as i've known) I still wouldn't get it. Borring and repetitive with very little to no replay value (that is if you even play it through once). It does have decent music though.",
            "review_score": "-1"
        },
        {
            "review_text": "Thats a simple and good game, but it's more fun on mobile :)",
            "review_score": "1"
        },
        {
            "review_text": "I really nice puzzle game that puts your mind to work so you can survive. You start out as little man inside a cave with a bunch of blocked room and as you start ravaging through the caves you start collecting gold,wood,stone and gems but you also encounter monsters that will try everything to stop you. Its pixel style make it a simple in the eye game to play and can help to get your mind working. I would recommend this game whenever you have some minutes to spend in your free time.",
            "review_score": "1"
        },
        {
            "review_text": "A very decent time-waster. Don't expect much - yet - don't pay much. Worth the price, and the time.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting take on match 3. Can be frustrating at times.",
            "review_score": "1"
        },
        {
            "review_text": "- playable on Low-end windows 8.1 tablets - fun if you like matching stuff - i like the music",
            "review_score": "1"
        },
        {
            "review_text": "This game is epic retro fun. Like, I actually had a moment of true nostalgia. Get this.",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a Skinner Box -- all it's about is empty upgrades and 'level ups.'  I don't have any playtime on Steam since I plaid through it on Android. If you must play this, then get it on your phone where you can play it in 5 minute increments waiting on the bus or something.  Recommended price: $0",
            "review_score": "-1"
        },
        {
            "review_text": "Match three and upgrade your way to a high score and freedom. Then try the sequel You Must Build A Boat.",
            "review_score": "1"
        },
        {
            "review_text": "Really puts the 'R' in RNG.",
            "review_score": "-1"
        },
        {
            "review_text": "I think I would actually *rather* play this game on a mobile device than on a PC port. This game clearly isn't designed for point-and-click on a mouse, and viewing it on a 22' monitor delays the necessary reaction time you need in order to succeed in the game. Okay, so I only played about 20 minutes of it, but honestly... I don't need to play any further. 2/10",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of money unless you like these kind of games...",
            "review_score": "-1"
        },
        {
            "review_text": "I have one minute played in this game, and that's the way I plan on keeping it.",
            "review_score": "-1"
        },
        {
            "review_text": "Mindless grind, extremely repetative.",
            "review_score": "-1"
        },
        {
            "review_text": "DON'T READ THIS. YOU WILL BE KSSED ON THENERESTPOSSIBLE FRIDAY BY THE LOVE OF YOUR LIFE.TOMORROW WILL BE THE BEST DAY OF YOUR LIFE.NOW YOU'VE STARTED READING THS. DONT STOP. THIS IS SO FREAKY.1.say your name ten time's.2.say your mom's name five times.3.say your crushes three times.4.post this to four other games.if you do this your crush will kiss you on thenearest friday.but if you read this and do not paste this you will have very bad luck.SEND THIS TO 4 GAMES IN 143 MINUTES.WHEN YOU'RE DONE PRESS F6 AND YOUR CRUSH'S NAME WILL APPEAR IN BIG LETTERS ON THE SCREEN . THIS I SO FREAKY BECAUSE IT ACTUALY WORK LOL",
            "review_score": "1"
        },
        {
            "review_text": "                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      ",
            "review_score": "1"
        },
        {
            "review_text": "A relatively simple match-3 style game where you match tiles to execute various commands while adventuring through a linear dungeon hallway: attack, block, magic, get item, use key (for doors and treasure chests), and a few resource gathering things. Get cash, XP, and resources, upgrade your character, and repeat. Get a score of 10,000,000 to beat the game. Nowhere near as forgiving as something like Bejeweled, but the hallway really just boils down to a timer mechanic that forces you to match certain types of tiles in order to add time to your game.  Worth skipping a soda with lunch to buy, but not enough here to recommend further.",
            "review_score": "1"
        },
        {
            "review_text": "one of the most addictive games since tetris. i got the 10,000,000 but still haven't uninstalled it because it's so much fun.",
            "review_score": "1"
        },
        {
            "review_text": "A lot better than expected, an amazing little time-waster.",
            "review_score": "1"
        },
        {
            "review_text": "It's not everyday you see a game named after a number, let alone one hitting 8 digits, so of course my eye was attracted to this pitiular title right off the bat. I've always been a passive fan of board matching games such as Pop Cap's cashcow Bejewled, but 10,000,000 does one of the wierdest genre crossover games I've ever soon - they somehow crammed in a Fantasy-RPG dungeon cralling game into my puzzle game. The tiles you match on the board causes your character to perform an action - locked door in your way? Match key tiles to unlock it! Generic bad guy attacking you? Sword his ♥♥♥ or magic his face in by matching sword or rod tiles! It goes deeper than that, but just that alone make it totally worth the low price it is selling for right now. If you're into really fast paced action, get this thing!",
            "review_score": "1"
        },
        {
            "review_text": "*pfft* What a great timewaster! Like matching games? Then this is definitely up your alley. Definitely requires a bit of thought as you don't just switch blocks to match: you have to slide them. Great change from Candy Crush or Bejeweled!",
            "review_score": "1"
        },
        {
            "review_text": "The game 10,000,000 is really quite fun. If you hate grinding though, STAY SO BLOODY FAR AWAY FROM THIS. This game is a weird mix of bejewelled puzzle action while your character is running through the dungeon slaughtering baddies and opening doors/chests. You match swords to attack, keys to unlock things etc. and that's how your character progresses through this endless dungeon. The entire game is a big'ol grind to the top, running dungeons over and over till you accumulate enough stone/wood/gold/experience to unlock abilities, better gear and better shops. I've only spent a little over an hour when writing this review but if you're looking for a great way to spend your time without breaking the bank here it is!",
            "review_score": "1"
        },
        {
            "review_text": "A fun little puzzler. Good amount of challenge. Kinda scratches the same itch as Puzzle Quest. ",
            "review_score": "1"
        },
        {
            "review_text": "10,000,000 is a great way to blow some time if you need a quick game and like working twords upgrades. A great easy puzzler that can get pretty difficult as you go.",
            "review_score": "1"
        },
        {
            "review_text": "A simple and good game to pass some time. Good for those who likes puzzle and RPG games =)  8/10",
            "review_score": "1"
        },
        {
            "review_text": "This game was seriously bad for my carpal tunnel. It wasn't nearly fun enough to offset the damage it did to my wrist.",
            "review_score": "-1"
        },
        {
            "review_text": "Started off a little slow, but once you get going this is an addictive little puzzle game. I'm not sure if there will be much in the way of replay value, but there's lots to keep you going to the end of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Fairly generic match 3 puzzler, decent enough for casual play. Don't bother playing for 100% achievements though since some of them are bugged and can be completely unavailable.",
            "review_score": "-1"
        },
        {
            "review_text": "I haven't played very long but it's very fun, and it has interesting progression mechanics. It's a quick and dirty rogue experience. Perhaps the largest departure from other rogue games is that you don't lose materials when you start a new run, so you're constantly accumulating. This game seems to be balanced for this kind of system, though.",
            "review_score": "1"
        },
        {
            "review_text": "Second best game to play with one hand.",
            "review_score": "1"
        },
        {
            "review_text": "Achievement completion at time of writing: 100%  This is a port of the mobile game of the same name. It is a match 3 game where you either slide a row or a column to make matches for whatever is needed at the time. Locked Doors and Chests require keys, Monsters require Swords and Staves, Shields are used for defense, Stars for items to help, and Stone and Wood for building your home base afterwards.  The objective is to go as far as you can in a dungeon, and upon failure you take all the resources you gathered to upgrade your home base to allow even further runs. The main goal is to have a total score of over 10,000,000 in one run of a dungeon.  It's fun for a few hours, though the game is pretty short. If you can get it cheap, it'll be good value.",
            "review_score": "1"
        },
        {
            "review_text": "A combination of tile matching and dungeon running, it takes pieces of different game styles, mashes them together, and lobs them at your head. Not only are you matching tiles to defeat monsters, open doors and unlock treasure chests, but you have missions to accomplish in order to advance and upgrade your equipment. Sometimes they come easy, sometimes you want to grab the little Indiana Jones look-alike by his 8-bit feet and swing him around, screaming 'RUN FASTER, &amp;#@%&amp;!* YOU!!!'",
            "review_score": "1"
        },
        {
            "review_text": "Addicting. SO. VERY. ADDICTING. A combination of RPG and match three. Oh, but there's a twist: instead of moving pieces, you move the columns and lines of pieces to make the matches and defeat your enemies. If you are into fast paced puzzle games, 10,000,000 is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Good time waster",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly fun little game. My first run wasn't very fun and ended pretty quickly. Then I realized that as you buy upgrades, your stats get better and you can run further. What keeps me going is to keep upgrading my home. Beyond that it is simple match-3, but with some progression. Give it a try past a few upgrades. By the time I had most of the upgrades, it takes a little grinding to get the rest, that bores me a little near the end. But for the price, I found it enjoyable. I never did get 10,000,000 (just 9,600,000) when I upgraded everything. After 6 hours or so, I had enough. It was fun while it lasted.",
            "review_score": "1"
        },
        {
            "review_text": "Good game to play when you're bored of everything else and want a little break",
            "review_score": "1"
        },
        {
            "review_text": "It's a very simple and easy match-3 game. Some aspect of this game is very novel, like how to control the warrier by matching different blocks. The graphics is typical pixel. Through it is a good time killer, to achieve all achievements requires real skills and some luck.",
            "review_score": "1"
        },
        {
            "review_text": "So to start off my review I award this game with the 'broke me of going after achievements' award.  The game is a simple puzzle sliding game with rpg elements thrown in. It is extremely addictive and incredibly challenging as the game progresses. The game has a satisfyingly simple goal that any gamer could appreciate: Obtain 10,000,000 points and gain your freedom.  If you're a fan of puzzlefighter games then you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very rarely do I 'want' to like a game more than I do this one. The style's fun, matching games in general are addictive, and I really do want to keep progressing. But the balance feels wrong and much more often than not the game really frustrates someone just looking for a good time. It's a matching game but if you're not matching the blocks you're supposed to be matching to defeat a monster or unlock a chest or whatever the game is throwing at you, then you die. And you die pretty quickly at that. You can go from full health on a great run to dead in just a few seconds if you haven't matched the tiles that you need. Most of the time you can't find the blocks you need at any given moment, without having cleared other tiles first. The game simply has one block type too many obstructing combo flow. Two of the seven block types have no function in the dungeon crawl except to impede your progress, at any given enemy encounter only two of the blocks might be useful to you. With less than half of the screen being useful and enemies eating your time you'll frequently die in less time it takes to read this review.  It wouldn't be so bad if it gave you more time to plan combo chains. Or maybe you could stockpile matched blocks so that items like keys would stay in your invetory for unlocking doors and chests. Instead you can only match blocks at the moment you need them with previous matches disappearing uselessly. Mind you, it has to be at the very moment you need them, if you make the match too fast before the character runs up to the encounter, it also doesn't count wasting valuable blocks.  If you somehow ended up becoming a master genius at the game, or if you've grinded enough hours to buy enough perks, it could be great. But the early stages are just no fun and only succeeded in frustrating me. After a while I lose interest in mastery. The game just feels too unfair.",
            "review_score": "-1"
        },
        {
            "review_text": "A fun little game to waste your time with here and there. Simple game play and even simpler graphics, not surprising for a phone port. Still its cheap, direct and more then worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Nice casual little puzzle rpg. I liked that you can customize your equipment and skills along the way. Enjoyable all around.",
            "review_score": "1"
        },
        {
            "review_text": "Well well well, where to start with this game?  Awhile back I heard about 10,000,000 and I was looking forward to getting my hands on it to play, after I got it, I spent 2 or 3 hours playing it nonstop, soon after my play session ended I relised I felt really weird, so I tryed to stand up, and I felt so disorentated dizzy to almost the point where I felt intoxicated, I couldnt understand it.  That aside, the time spent playing 10,000,000 has had its frustraitons, but it was very fun, what ever it may be, getting huge combos going, to the silly hints, everything about it brings such a retro feel, the music and audio compliments the game.  In a nutshell, the top side scroller looking area of the screen is a cleverly disguised timer and health bar. Your character runs through a dungeon, and all of his actions are controlled by the blocks you match. Need to unlock a door or a chest? Match some keys. A monster blocking your path? Physical attacks are executed by matching swords while magical attacks fire off by matching staves. Standing still by not matching causes the timer to tick down, pushing your character to the left, and getting hit by monsters also pushes you to the left. The damage aspect can be mitigated by matching shields, which are absorbed instead of pushing your character. Fall off the side of the screen and it's game over.  To supplement these mechanics are a set of shockingly deep loot, item, upgrade, and experience systems. Monsters can drop loot, and you can also get loot by matching backpack tiles or unlocking chests. Loot can either be gold to buy upgrades or actual usable items. A few items you'll come across are a red orb that'll damage whatever monster is in front of you, a key to instantly unlock a chest or doorway blocking your path, scrolls to spawn more tiles of a certain type on the board, and much more.  Every time you start up your game and get ready to explore, your character lierally Jumps out of bed and is ready to rock, I first noticed the score and the goal, which reminded me of one of those Awful motivation posters that were en vogue in the 90's and acts like one too.  You really need to think about the games mechanics, because 10000000 doesn't tell you much beyond the qwerky loading hits, and leave you on your own to explore, I find that this works perfecly with short playt sessions, and adds a sense of discovery that I found fun.  If you have one of your 10,000,000 runs that lasts more than a minute or two you are doing considerably well, it gives you a chance to catch your breath and break down what you learned during your last attempt to reach your goal of 10,000,000.  This is a game with a protestant work, and you have to Aceept failure as part of the Journey, and try your best to do a little better every time.  I have really enjoyed my time so far playing 10,000,000 and I hope everyone else can have some fun with it too.  I would rate 10,000,000 a:    4 out of 5  As it does what its intended too exactly as it should.",
            "review_score": "1"
        },
        {
            "review_text": "Fun enough for what it is. Worth the 99 cents I spent on it, but wouldn't pay more than that.",
            "review_score": "1"
        },
        {
            "review_text": "Good fun to play a quick casual game. It's challenging and takes thought and a splash of luck.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "Match tiles to perform all your actions in dungeon runs, whether it is to fight enemies, open chests, loot, collect resources... yes, it's all about tiles, and these tiles will be branded on your eyelids and haunt your dreams whenever you close your eyes.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely. Get it while it's still a dollar! After that I would say you shouldn't get it for five if you're saving up. But if you have just one buck you're itchin to spend, put it into 10mil. This game has provided me plenty of entertainment, and it will give me more as I continue to play. It can get frustrating at times, but you don't really lose anything permanently, which means you can only move forward. QUICK GO GET IT",
            "review_score": "1"
        },
        {
            "review_text": "It was worth the dollar I spent for it. 100% easily achievable, if it's your first game of this kind it's ok, else it falls behind Puzzle Quest.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty great take on the Match-Three genre. I'd had my fill before I finished it, but was fun. :)",
            "review_score": "1"
        },
        {
            "review_text": "This is a stupid game. Boring, boring and oh boring. Don't buy it. Wasn't even worth the $0.99 I bought it for.",
            "review_score": "-1"
        },
        {
            "review_text": "High-speed match 3 game, with progression elements but little in the way of customization due to its you-can-have-it-all perk system. All the same, for a cheap diversion it's quite engaging. Hopefully the future holds a more in-depth sequel with meaningful choices to be made when it comes to equipment and skills.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little puzzle game with RPG trappings. For the small asking price you will get a good few hours of entertainment out of this one and its great for when you have a few minutes to fill and dont have time for something more substantial.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun little game but a little bit to easy for my liking. More of a 1 euro mobile game i guess.   Still giving it a dislike, but be my guest if you are a 3-match fanatic. You will get your fix.",
            "review_score": "-1"
        },
        {
            "review_text": "The game is simply and really nice to play when you want a simple and fun momment. The game si highly based on luck of having the good peices at the good palces, and also knowing how to move them in effective ways.  I find it to be a good game to play when you want to relax your brain and just have some fun with out the complex puzzles ofsome other tittles.",
            "review_score": "1"
        },
        {
            "review_text": "Apparently it's cheaper on iOS. Had I known that, I would have got it on my ipod instead. Regardless, it's quite the run 3-match puzzle with a blend of RPG to it. Quite the simple game and yet it keeps me playing from time to time. Music matches the game well too.",
            "review_score": "1"
        },
        {
            "review_text": "10,000,000 Is a really fun action/puzzle/rpg game I like it more than freaking cs:go i can tell you that now.I like how theres a dungon and all the rooms you can unlock and all of that And most of all you have to save these things up i forgot what they are but you have to save these things up you earn to 10,000,000 and i think Thats why they named it 10,000,000.But i recomend this game for Evryone who like puzzle/rpg/action games. Or i should say evryone out there on steam.",
            "review_score": "1"
        },
        {
            "review_text": "Way too grindy and not enough variety. Match 3 hell. If you REALLY like match three, get it. Otherwise skip this one.",
            "review_score": "-1"
        },
        {
            "review_text": "i dont know what everyone is complaining about personally i love this game and find it hard to put it down.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle game with RPG elements. The RNG is strong with this one. Fun to play and great work from the devs.",
            "review_score": "1"
        },
        {
            "review_text": "I Find this game to be quite the challange since im not used to matching style games. But It is very fun to play once you get the hang of it. It is a fast pased matching game with tonnes of upgrades at your disposal. Working your way to a 10 Million score will deffinatly give you the definition of a badass :P",
            "review_score": "1"
        },
        {
            "review_text": "Addictive little time waster. I mean it's nothing special, feels like a facebook game. Yet with the little dungeon and stuff you kind of want to do well, and feel bad when you try to use a sword to open a lock... but other than that, it is what it is.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AWESOME!   As soon as I got it, I couldn't stop playing it. Very fun game, and only 5 bucks!",
            "review_score": "1"
        },
        {
            "review_text": "It's a match-three game with RPG trappings and treadmill progression. May God have mercy on our souls.",
            "review_score": "1"
        },
        {
            "review_text": "This is a puzzle game mixed with an RPG mixed with a dungeon runner. The tiles you combine are shields, keys, swords, wands, treasure chests, rocks or wood. Do damage to an enemy by matching wands or swords, protect yourself by matching shields and collect resources/exp/items with the rest. I like this game :)",
            "review_score": "1"
        },
        {
            "review_text": "A fun little Match-3 RPG hybrid. Sorta reminds you of Puzzle Quest. Very addictive and fun for a few hours.",
            "review_score": "1"
        },
        {
            "review_text": "A new spin on bejeweled meets rpg. Highly addicitive gameplay along with RPG elements keeps you coming back for more. Very fun and catchy soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "Never has so simply of a game taken more of my unavailable time. A high recommend for anyone to play while avoiding the important things in their life.",
            "review_score": "1"
        },
        {
            "review_text": "Although it has a lot of things going against it (Match 3 puzzle game, iOS port, etc) this game is loads of fun. Don't be fooled by the store page, this isn't actually an RPG, but simply a match-3 puzzler with RPG elements.   While most M3 games have you moving one symbol around in one of 4 directions, this one has you rotating columns/rows to match 3. It takes a bit of getting used to, but well worth it.   Most gameplay is spent on the dungeon crawling. You look up on the screen, and match the symbol needed above. eg: If theres a chest, match 3 key symbols.  You cannot pass until you match the correct symbol, and theres an advancing wall that kills you (Keep ahead of it!). There are also monsters that you must kill using either Magic or Physical matches (Different monsters have different weaknesses). There are different items you can use too. Overall, a great timewaster/puzzler, but not really a puzzler.   17/20",
            "review_score": "1"
        },
        {
            "review_text": "Looks like a ♥♥♥♥ game but actually its addictive, fun and amusing. I played this game when i was bored of the games i usually play and also when u have like 5 minutes before u have to go somewhere. Good game!",
            "review_score": "1"
        },
        {
            "review_text": "This is a super short, casual game that feels like it would be best suited to your phone. The controls are a little wonky with your mouse, but overall I enjoyed it. I wouldn't spend $5 on it though.",
            "review_score": "1"
        },
        {
            "review_text": "So, 10,000,000. It's hard to make a decision. First, this game is good. It's ported from mobile devices. And it's ported well. It's more easier to control with your mouse. Also it has Steam Achievements. It's good. And it's bad, but I'll tell you about it later. But besides it, this game is awesome puzzle adventure. I thought that playing puzzle games is very boring. I think some Pokemon casted Confusion on me. Puzzle can be interesting. If you'll bring RPG elements to it. It's cool to repair and upgrade your castle, it's cool to learn perks and to upgrade your skills. It's cool to play puzzle game. So I can recommend this game for you. But if you're not '100% Achievement Hunter'... Second, this game is making me nuts. I'll never play it again. I'm tired of puzzle games after one little thing. The Jose. That's it. I HATE THIS THING. Achievements in this game are cool and funny, BUT THIS ONE WAS MADE IN HELL. YOU WILL JOIN THE EVIL DEAD. YOU WILL BE RUNNING AND SCREAMING 'JOIN US' WHEN YOU'LL FINALLY GET THIS ACHIEVEMENT. I'VE SPENT ABOUT 15 HOURS FOR THIS. 15 HOURS FOR PUZZLE. I HAD NIGHTMARES... STAFF, SWORD, KEY, WOOD, STONE. Damn, if you're fond of 100% things, don't buy it. GO AWAY. YOU SHALL NOT PASS. BTW, they're making the sequel. You Must Build A Boat. They said, it will be bigger and better. You can even put your saves from 10,000,000 to it. You'll get it for free, if you own 10,000,000. I'll get it, but if they'll make something like The Jose, I'll never play it. That's it. My review. You have a choice.",
            "review_score": "1"
        },
        {
            "review_text": "10 ♥♥♥♥ing million. That's the score you need to get to beat the game. And that's all you gotta do...  ...I might be oversimplifying things a little bit, since it will take you a good couple of hours to beat it (around 7-8h).  The game is very easy to understand, you have a guy running on your screen and once you get an obstacle, you have to take care of it. If you have a door, you will have to combine 4 keys, if you have an enemy you can either combine swords or staves. The idea is to never fall behind or you lose.  Once you reach preset milestones, you will have the option to play harder levels, that rewards you with higher score multipliers. The higher the level, the higher the score you will get, and the harder the monsters are.  This is a game where you will fail 99.9% of the time, and once you get that 10,000,000 score you are likely not to touch this game again, but it's so extremely addictive and at the same time frustrating. After each attempt you can spend your resources (wood, stone and experience) on power ups that will help you get through the levels...  Pros: - Very addictive - Decent RPG elements  Cons:  - Music - Story... or lack of. - Price, the mobile version of this game is much cheaper...  7/10",
            "review_score": "1"
        },
        {
            "review_text": "More tile matching with more of frantic twist. The game gets repetitious long before you hit 10 million, but it was worth the time I spent and more than worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good, but takes time to gert used to.",
            "review_score": "1"
        },
        {
            "review_text": "It's fine as long as you aren't expecting too much. You frantically match-3 until you die, trying to complete the tasks you're faced with by matching specific tiles (e.g. unlocking chests with key tiles). You also collect resources tiles while you play and use them to upgrade everything after each game. It's a little annoying that you simply can't progress very far until you get enough upgrades no matter how well you play, but it adds to the addictiveness of the game, to complete everything.",
            "review_score": "1"
        },
        {
            "review_text": "3 Match, action packed, Something?  The game is great in the 3-matching concept, killing monsters as you match, the feeling of acheivement at the end of a long run is really good. But I do not understand the story behind the game.  To me the game could have done better in the story department, but where it lacks in that it picks up in the 3 - match.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "This [10,000,000] is incredibly engaging in the vane of sliding puzzle games like Bejeweled. But unlike the sliding games of the past, there is complete freedom of tile movement. Tile matching, monster killing, and item gathering. Level up your armor, weapons, and abilities through the dungeons and difficulties until you reach ... 10,000,000. [You really won't want to stop playing till you reach ... 10,000,000]",
            "review_score": "1"
        },
        {
            "review_text": "Symbol matching game with slightly different mechanics than others in the genre. A splash of rpgish level up elements and bonus objectives. On the whole a fun time waster.",
            "review_score": "1"
        },
        {
            "review_text": "the crack cocaine of casual games",
            "review_score": "1"
        },
        {
            "review_text": "A fast-paced, engaging puzzle RPG. Grind, grind, away toward your next goal!",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little puzzle game. I played it for 9 hours before beating it fully. Decent value. Would buy 10,000,001 if it ever comes out.",
            "review_score": "1"
        },
        {
            "review_text": "For what the game is, it kept me occupied for a good time. It's bejeweled with a hub world and rpg mechanics. There are, not so much difficulty curves, but there are some grinding curves. It never feels like too much though.",
            "review_score": "1"
        },
        {
            "review_text": "I played 11 hours too many.  Did it for the achivements. :P  I recomend this game if you like matching tiles over and over.",
            "review_score": "1"
        },
        {
            "review_text": " This game is worth playing and worth completing (getting all achievements).",
            "review_score": "1"
        },
        {
            "review_text": "I like the concept of a Match 3 Roguelike, but this game doesn't really pull it off. It's quite tedious and repetitive, and the upgrades are so simple and straightforward that they don't feel RPG-ish.  Pros: + Passable game mechanics if you like Match 3  Cons: - Repetitive, not very fun - No depth to make replays worthwhile - Graphics feel crappy more than retro",
            "review_score": "-1"
        },
        {
            "review_text": "A great game for what it is. I beat it twice on Android, which is probably where the game belongs. A bit too casual for PC.",
            "review_score": "1"
        },
        {
            "review_text": "Meh.  Boring gameplay, may work on a phone but not on pc. May be good if like this kind'o game and if you got it in a bundle, but no more.",
            "review_score": "-1"
        },
        {
            "review_text": "It was 9 hours of grinding for me to (almost) 100% this game, and I really mean grinding ― actually quite unpleasant in the middle, when you're too far into the game to deal with cheap upgrades, but still too weak to be able to farm resources easily. My impression is that 10,000,000 relies too much on luck, and is a little too fast; you don't have enough time to think and are just relying on intuition and quick matching. Sometimes it just made me want to play Puzzle Quest instead. Still, I guess it's alright to kill some time, although it's probably better on a mobile device.  PS. If you want my advice for this game, never don't be matching.",
            "review_score": "1"
        },
        {
            "review_text": " If Candy Crush was an RPG it would be this",
            "review_score": "1"
        },
        {
            "review_text": "I was skeptical at first that you could have a puzzle and RPG mix that would be fun and functional, but as I started upgrading my equipment, I could not stop playing. I was there were challenges available after scoring ten thousand to keep playing.",
            "review_score": "1"
        },
        {
            "review_text": "Well, it's cool. Watch some videos and the game is exactly what it looks like, Good to spend some time.",
            "review_score": "1"
        },
        {
            "review_text": "I'm really only doing this for the Steam Awards badge, but seriously you should play this, it's good.",
            "review_score": "1"
        },
        {
            "review_text": "A simple game, but the frantic pace and the great music can really get you into a flow at times. It's pretty random what tiles you get but it feels awesome when things go your way and you score some sweet combos. I really liked this game.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would accidentally 16 chain again",
            "review_score": "1"
        },
        {
            "review_text": "Fun for an hour or two lol",
            "review_score": "1"
        }
    ]
}