{
    "app_id": 227800,
    "name": "Retrovirus",
    "release_date": "2013-01-31",
    "developer": [
        "Cadenza Interactive"
    ],
    "publisher": [
        "Cadenza Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "6DOF"
    ],
    "achievements": 14,
    "positive_ratings": 120,
    "negative_ratings": 44,
    "price": 7.19,
    "description": "Retrovirus is a six degrees of freedom shooter which sends players into the depths of a computer on a search and destroy mission against an invasive virus. Retrovirus is being created by Cadenza Interactive, the indie studio behind the popular tower defense game Sol Survivor.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/227800/header.jpg?t=1447357170",
    "minimum_requirements": "OS: Windows XP, Windows Vista, or Windows 7 Processor: 2.0 GHz dual-core CPU Memory: 2GB Hard Disk Space: 1.5 GB free space Graphics: VNVIDIA GeForce 8800 GT, AMD Radeon HD 2900, or higher Sound: DirectX compatible sound card DirectX®: DirectX 9.0c",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The game supports LG 3D monitors",
            "review_score": "1"
        },
        {
            "review_text": "Retrovirus's gameplay has a quiet confidence about it. Taking inspiration from games like Descent and Portal and the classic CG show Reboot, Retrovirus puts you in the shoes of a no nonsense antivirus program living inside a computer. What makes it stand out is how injects its own sense of self into the gameplay to rise above these inspirations.  Take the gunplay for example. While the game features six degress of movement ala the original Descent, meaning you can fly around in any direction, the game has health and ammo regeneration similar to what you find in today's cover based first person shooters. You can store a limited quantity of ammo packs and health pods, but most of the time you'll be doing your best to manage your health and ammo as the viruses try to kill you. There's also a skill tree that lets you customize your agent's powerset and weapons loadout, and you can opt to switch your talents around as well for when you run into situations that require some abilities over others. That said, oftentimes in combat I felt like I was always exactly one bullet too short to wiping out a virus, which can get frustrating when you're fighting a swarm. Fighting feels much slower in the beginning until you can start acquiring upgrades and more weapons, but the ammo problem leaves a bad first impression. It does eventually bring the awesome.  Level design is another area where the game shines. While mostly linear, they create good arenas in which for you to fight. Cadenza Interactive has helped make navigation a snap most of the time; the paths through the levels are marked with red and green portals. Green portals mark the way to go forward; red portals mean you're going backwards in the level. In some of the twistier levels where all the rooms start to blend together, this makes finding your way a lot easier. There's also an auto-levelling feature where your ship orients itself to the 'ground' depending on the room you're in, also helping to keep you aware of your surroundings. Finally, there is a 'help' function that guides you to your next objective path, but it's not always helpful for finding the last enemy in a room you have to clear. It also won't help you with any optional objects that the game can throw at you, but half the fun in these instances is hunting down the missing monsters or collectibles themselves.  The viruses themselves look like real monsters and things you might find in Aliens or the Matrix. However, I found the bosses disappointing in the design; they just look like bigger and beefier versions of the little creatures you've fought before. Some variety here would have been nice. In addition to the viruses, there are nodes of corruption that have sprung up all around them that give off a distinct neon purple glow. Clearing these isn't just for show; hovering around them damages your ship. Taking them out gives a satisfying crunch as you sanitize an area not unlike shooting Aliens in the original Aliens Vs. Predator PC game. Unwillingly fighting alongside the viruses are program constructs, most of which look like variants of the AIs from Portal. They give off sad whines when attacked and can be even more dangerous than the viruses themselves when in groups. They add another wrinkle to the shooter formula as you have to manage the zombified AIs while taking down the viruses. It would be nice if they helped you but it's only in the late stages of the game that you encounter other programs that will join the fight. Most of the time they mingle and get in the way, which can be annoying.  The story is what it is: an excuse to get you into fighting a lot of nasty bad guys. What starts as a typical day for you and your handler, Oracle, turns into a nightmare when a worm invades. There are twists here and there, but they are expected for the most part and you won't be seeing anything new here. That said, it's well done and entertaining. The AI programs you meet all have their own personalities and help push the computer story along well, from a bubbly web client to the gravel and static voice of the AV Vault's Warden. The plot is a chase throughout the computer system, and you get to see the inner workings of a city inside your computer. The file systems of the email client give way to the rail systems of the web browser, and the environments do a great job of being varied so you never feel like you're retreading ground... until you hit some levels late in the game that recycle content. Level recycling dampens the impression of the game because it wasn't hurting for content, but the level retreads make the experience feel a little fat. At least the game has a sense of pace to break up the super heavy infected levels with quiet strolls where you get to rearm and plan your next move. One set of levels introduces stealth mechanics that are serviceable enough for what they are. Inside the computer things are never dull.  You can uncover the real world story behind the virus by finding emails hidden throughout the levels. While not as compelling as the game itself, they do add an extra level to the narrative even if it's not as great as the invasion story playing out inside the computer. The humor found in the spam emails you find is too over the top to be funny, but they serve as nice breaks when you don't want to read about hackers getting in over their heads.  Retrovirus clearly has its faults. The game's narrative over-extends its welcome, and some mechanics, such as using your system scan setting to activate alternative uses for your guns, feel tacked on rather than integral to the experience. There is also multiplayer and co-op, which I cannot comment on because I haven't played it. That said, the game makes for a complete packaged experience and the stats screen and Steam achievements will make this game good for die hard completionists. The world of your PC is well realized and full of neon glow wonder. Retrovirus is a breath of fresh air to a long dormant genre while striking out on its own.  Now if you'll excuse me, I'm going to go track down my copies of Reboot to watch again...",
            "review_score": "1"
        },
        {
            "review_text": "So, I thought I should give this game a go, since I thought it would be quite short. Well, it wasn't. Actually took me quite a few hours to clear it, although I wanted to 100% it more or less.  I liked this game a lot, for various reasons. For one, you're taking the role of a little anti-virus software agent that is sent on a mission to rid the host computer of a malicious worm/virus, which is an incredibly interesting premise. As you float along the corridors and tubes of your beloved PC, you find e-mails scattered all over the place that will slowly but surely unveil the bigger picture behind this attack. Major sympathy points for the cheeky web browser Qat that can't be fed enough cookies. I love how the characters build up and change throughout the story, obviously affected by the virus.  Gameplay-wise, well a word of warning here: the steering takes a little getting used to, especially since the first few minutes will most certainly give you some kind of motion sickness. Once you get the hang of maneuvering your little ship though, you'll start enjoying hunting those evil corruptions. The difficulty curve stays steady throughout, bar the last fight which took some trial and error but it was at least a good challenge. Progression is really tough going though. Many passages seemed a bit too stretched and the fighting very repetitive at times - omniscan a certain area, find out where the intruders are, take them out one by one, rinse repeat. But it's fun, you do have a bit of choice with six weapons and several skills that you can tune to your liking. The music is good, could have used a bit more variety though.  All in all, this is a cute game worth playing. Especially computer nerds will definitely like wandering around the OS.",
            "review_score": "1"
        },
        {
            "review_text": "so this is what mcafee does every day",
            "review_score": "-1"
        },
        {
            "review_text": "Really great game, very retro and fun to play. Reminds me of a few old classic 360 shooters I used to play.",
            "review_score": "1"
        },
        {
            "review_text": "I tried it on one of steam's free game rent things, it lagged so hard and my computer made so much noise that i got a fire extinguisher and ctrl-alt-deleted it!",
            "review_score": "-1"
        },
        {
            "review_text": "Antivirus the game, especially fun if you remember and liked Descent.",
            "review_score": "1"
        },
        {
            "review_text": "There has been a hole in the gaming world since 'Descent 3' in 1999, thanks to Cadenza Interactive that hole has become a bad memory with the introduction of 'Retrovirus' to the world.",
            "review_score": "1"
        },
        {
            "review_text": "bats have the flu",
            "review_score": "1"
        },
        {
            "review_text": "Now that I've had this game for or a while, I can say that this is a Descent offshoot for old people (like me) that played Descent like crazy but now need a slower paced version for our old decrepit reflexes. Ha ha! Yeah I said it.",
            "review_score": "1"
        }
    ]
}