{
    "app_id": 227940,
    "name": "Heroes & Generals",
    "release_date": "2016-10-18",
    "developer": [
        "RETO MOTO"
    ],
    "publisher": [
        "RETO MOTO"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Online Multi-Player",
        "MMO",
        "Online Co-op",
        "In-App Purchases"
    ],
    "genres": [
        "Action",
        "Free to Play",
        "Indie",
        "Massively Multiplayer"
    ],
    "tags": [
        "Free to Play",
        "World War II",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 65856,
    "negative_ratings": 34416,
    "price": 0.0,
    "description": "Shoot, blow sh!t up, fly or bark orders in the ultimate Free-to-Play, large scale, multiplayer, shooter experience. Thousands of players in multiple battles fighting one massive war of nations. The first to capture 15 cities takes the glory.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/227940/header.jpg?t=1553867096",
    "minimum_requirements": "OS: Windows 7, 8 or 10 Processor: 2GHz CPU w. SSE3 instruction set- dual-core Memory: 3 GB RAM Graphics: ATI HD 4810/NVIDIA 9600 GT or above (with &gt;512mb RAM) DirectX: Version 11 Network: Broadband Internet connection Storage: 2 GB available space Sound Card: DirectX compatible",
    "recommended_requirements": "OS: Windows 7, 8 or 10 Processor: Intel i5 processor or higher / AMD Phenom II X6 or higher Memory: 8 GB RAM Graphics: NVIDIA GeForce GTX 560 series or higher / AMD HD 6870 or higher DirectX: Version 11 Network: Broadband Internet connection Storage: 3 GB available space Sound Card: DirectX compatible",
    "reviews": [
        {
            "review_text": "I have paid for hundreds of games yet I have spent the most time playing this free to play game.",
            "review_score": "1"
        },
        {
            "review_text": "For New players  If You are looking to get into this game you need to be aware of few things  1 yes, it have pay to get stuff real life money shop, but you can get all of it with in-game money. Yeah, it will take time and so on, but after you get what u want it feels great, as well better stuff won't make you play better(i bought scope with gold and found out that i suck with it, while with iron sight i'm pretty good.) so only thing what recomend is veteran, it will give you some exp boost(it is if you like game)  2 You will die a lot, at least in begining, till you learn how to play, well i still die a lot, but i make some enemy players die a lot too :D what i meant is, head shoots, grenades, road kill - in time it may feel unfair, but you will learn how to stay alive long enough to take out 2 enemy tanks with panzer-snacker, kill rogue sniper and steal their stuff :D  3 i have heard that game have cheaters and ect. But as far i can tell, it have some skilled players too, and by investing time in it, not cash you can be one of them :)  4 grind, yeah, you can say it's grind fest, but which mmo isn't? And i will put it simple, if you like game, that grind won't matter for you, cose as you play you unlock stuff and as like i said, better stuff won't make you better(i'm rank 5 infantry, loving my starter G43, taking out higher rank players with their ‘’uber’’ guns, just need to play smart)  5 HaG, is not your standard FPS, you run straight to enemy- you die, you try to be next ‘’rembo’’ - you die, try to take out tank with standard grenades - die, so what you do is flank, take cover, prone, run in z style, use mother earth as your ally, report snipers to your team-mates, play as team, use suppres fire, smoke them out with grenades etc  6 you start out with 1 loadout, after a while you can customise to your playstyle, found what works for you  7 game isn't for all, especially not for 10-14 years old cry babies or short temper ppl and impatient persons. You need to take time with this one, take it slowly, set your goals and work hard to get them.   My first impression.  When i picked it up i didn't like it, i meant i died instantly in all possible ways, headshot, legshot, torso shot, roadkill, grenades…. And that money shop.. I with my friend was like, it's p2w, you can't do ♥♥♥♥ without paying rlm, enemy is op (playing as german and german only), and so on. But as we played we wanted to see how THE big war looks and we aimed to get on rank 5 and on the way till rank 5 some changes happen, not to game, to our playstyle … i stopped to run straight on enemy positions, stopped to stand up or still in 2v1 fights, stopped to aim for most kills, instead i start helping team in big picture. Capture objective points, kill rogue snipers, defend our points and so on… and the more i kept playing the more i enjoyed game, like now if i can get 1 good match out of 5 ♥♥♥♥♥♥ ones it's worth it and the atmosphere of game are perfect, airplanes roaming sky, tanks rolling over land and me as infantry in middle of it all :)  + one can customise his character to his play style (be brave, be sneaky, be tanker, be pilot and so on) + rewarding unlock system what responds to your playstyle + great game to play with your friends (make a squad and you can team crush your opponent)  + think your enemy have better guns? Kill him and pick it up to see for yourself + game strongly rewards team play and tends to punish rambo wannabe’s  + nicely done progression system which will make you busy + good use of repair system which won't allow to spam op equipment( could be more balanced though)  + for f2p game are well balanced, u can get all what you need with ingame money, what leads to point where your opponent can't have something what You can't have (well it will take time, but then again more you play this game, more better you will become)  - vet. Bonus is overpriced, i need to spend 15£ to get it, so yeah, devs should make it down on 5£, cose i personally don't like to use gold, it's make me feel cheap  - only 2 tier system, so after you get rank 5 game kicks you out in big pot with high skilled players what makes it feel unfair sometimes, they could add tier 3 and and let tier 2 be mid ground for lvl 5-6 or 5-7 players to get around of things or something like that.. - game isn't friendly for new players, i mean if they don't get how to play it in first 10h they will leave it cause if you try to play it as regular shooter you will lick bottom forever… - no training grounds for tankers, pilots and ect … i mean, i would love to see what is what before i spend shitloud of my hard earned in game cash to switch my infantrymen on different branches, so that should be fixed.. - upper point and some other design choices tend to lightly hint on more cash in, then delivering most to players enjoyment and it's sad.  For dev ….  I got it, that one needs earn money to keep supporting game and making it better, but if one truly says that they have players first before cash in you should fix some things, first make it separate vet. buying option, so one can spend ~5£ to get vet. Not 15£ to get vet and leftover gold.(one day saw over 10k players on steam, if half have a vet it's already reasonable cash on month) In my opinion it would be nice sub model for beta game and still would make money. As Well player should be able to see all clases himself in advanced training so they know what they are getting because now it's buying cat in bag…  P.S.   Great game, eager to see it expand and become better:) 8/10",
            "review_score": "1"
        },
        {
            "review_text": "+ Free to play + The weapons are almost balance + Large maps + Update weapons ---------------------------------------- - High costs explosives - Defender won 95% - **** Maps after HALLOWES UPDATE ( The only thing you can see is plant ) - Tank driver class is only good income ",
            "review_score": "1"
        },
        {
            "review_text": "Many people call H&amp;G a grindfest; and that's really hard to answer, H&amp;G has no end tier equipment, so it's a constant grind, you can recruit more and more soldiers to get your dream loadout, there's no end, there's no 'best weapon', there's no 'best career', there's no 'best tank', there's no 'best camouflage'. You choose what you'd like to own, you can't have it all, unless YOU deside to own another soldier, another weapon, another tank... although owning one is more than enough.  People also confuse H&amp;G to be P2W; Heroes and Generals is NOT P2W, it's Pay-25-Bucks-To-Skip-5-Hours-Of-Grind and there's not a single item exclusive to 'P2W' players (Unlike WoT and WT), which debunks the 'This is P2W/has Paywalls' arguement (unless you really think that paying 25 bucks to skip 5 hours is a serius advantage).  As for the gameplay, it's Fun &amp; Addicting. Which is exactly why paying in H&amp;G is more of a way to support Reto than skip a few hours of playing.  However, I do admit the optimazition on this game is ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "I didn't really like the game when I first played it, but it grew on me. Now I'm really enjoying it.   I don't really understand why the reviews are mixed. I'm usually pretty harsh on games, but this one gets a recommendation from me.  It's free to play, so what do you have to lose besides your time.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game because you can play as a infantry man or a tanker or a paratrooper and when you get rank 12 you can unlock assault teams and take part in war with your assault teams.Thats just the start of this game theres much more you can do.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best first person World War II shooters I've ever played, plus its free!!",
            "review_score": "1"
        },
        {
            "review_text": "BEST WW2 FREE FPS SHOOTER. 9.5 iron crosses/10",
            "review_score": "1"
        },
        {
            "review_text": "Gritty, hardcore gameplay that reflects the horrors of the European Theatre during WW2.  If you organize your team, it's almost impossible to lose.",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best fps games i have played on steam, if not the best.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever you can jump from a plane.",
            "review_score": "1"
        },
        {
            "review_text": "Best free game",
            "review_score": "1"
        },
        {
            "review_text": "The game has huge potential, but iIt still needs massive upgrades, polishing and stuff, hope it will get better soon. Playing it alone may be not so fun. The best way to play it it's in a squad with friends, it gets super fun.  I wish good luck to the developers!",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game for over 200 hours and I still love it hence the first day. I would encourage everyone who likes WWII shooter games to play this. Of course this game has a grinding aspect to it but it really fun and you feel that you accomplished something at the end of the day. 10/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "I played this a while back and stopped because everything was too expensive, and would take around 70 hours of play time to earn. I've been playing again since yesterday and things look much better. But as always, try and judge for yourself. It is free.",
            "review_score": "1"
        },
        {
            "review_text": "The game is not ideal, but its pretty fun once you get into it. Yes you have to grind for a while to get anywhere on your load out but I think it pays off. My only major complaint is that there is no decent way of communication (no mic software). Typing is the only way to communicate with team members and lets face it in a modern age of multiplayer mics are a must.",
            "review_score": "1"
        },
        {
            "review_text": "First off this game is different then any other game I own--or have ever owned. I have about 100 games installed on my comp right now and have spent good money on well over a 1000 games since pong caught my attention--closer to 1500.   If it looks cool, if its different, if its well liked, if it looks better then other games, I buy it.   Sad to say, most the games I have bought, I have played less then an hour. Looking at my steam collection is a good sign of that. When a game clicks with me, I play countless hours. Star control, Panzer General, the first Res Evil and so on. I'm guessing there are a lot of players like that--playing only a few games even though have many to choose from.   Ok why did H&amp;G suck me in? Almost 1600 hours. Pretty sure that is a record for me.   Well to tell a painful truth, I not that good at shooters. Because of that I have played very few --for more then an hour at least. I bought a few hundred but I was frustrated with them because I suck.   I played the first WW11 online from the day it came out and for many more months after. 45 minutes to get into a battle, running or riding on a tank to get there. 1 to 5 minutes later dying once you found one. Why would someone do that for months on end? Because those 1 to 5 minutes where unmatched and unrepeated by any other game. I did that all day long and lost all interest in all the other games I owned at the time--had over 600 at this point.   Years later, along comes H&amp;G  I was beyond excited to download it on Steam and dig right in. I started well over a year ago and back then, it had a very different shell but was the same game you play today at its core. Lots of toys have been added, looks a lot better, but feels the same and plays the same--I'm so happy they stayed true to that.   A mid-level player can own with knowledge and practice...that is not very common in an on line game. You don't have to be a super good player to top charts. You just need to play smart and learn as you go. Point A to B at a certain spot on the map is great for getting kills and so on. Moving every time you kill someone in that area and knowing which way they will try to flank when they come for revenge. Very few games let you make up the difference of poor shooting with well thought out strategies. It's awesome.   If you get past the part when you have no idea what's going on and what's going to happen next, you will see a huge difference in the game. If you're already a super good FPS player you will do well right off and do even better later. The leaning curve is tiny and hung at the same time--very hard to explain. The first weapon is super deadly in a person a knows the game well, and very hard to get kills in a noobs hands--even one that rocks at FPS's normally.   That is why it's nothing like other games. The balance is spot on. The weapons are hard to use until they are familiar, just like real life.   This is my favorite game of all the games I have played since pong. I'm picky. I'm ♥♥♥♥♥y. I don't just go with the flow if I'm not happy. I have been sucked into only a few games over the years but none have kept me going like this one. It's simple. It's difficult. It's awesome.  Lisa Eve  10/10 +",
            "review_score": "1"
        },
        {
            "review_text": "The extremely quiet gunshots are off-putting, but the game is otherwise a very nice WW2 game.",
            "review_score": "1"
        },
        {
            "review_text": "Please add so Mac can play this awesome game",
            "review_score": "1"
        },
        {
            "review_text": "Better than those which are worse.",
            "review_score": "1"
        },
        {
            "review_text": "This game has changed alot . Those who are crying about the grind let me tell you this as experienced player. The grind on current stage : its more easier. im not trying to sound like the old guy who prefers his old stuff *Back in my days.etc * but the grind we had before was much i mean MUCH harder than this. The game became more Newbie friendly. The game will still continue to develop more and more updates with more weapons, tanks and vehicles .etc  *im hoping for new faction like britain to be added cause it would fit this game quite good* overall i would recommend this game *p.s : the queque time is a bit troubleish but its fine nonethless.",
            "review_score": "1"
        },
        {
            "review_text": "My clan's favorite game",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. very realistic and has the best ww1 experience in a game.",
            "review_score": "1"
        },
        {
            "review_text": "Played 501 hours...  Pros:Fun game, war is the best, especially if you have Assault Teams that you command.  cons:large grind, and high pay to unlock prices   overall: Recommend",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and good game, if you like World War 2 games this is definitely one you should try out with a friend.",
            "review_score": "1"
        },
        {
            "review_text": "Good gameplay and realistic shooting, but sometimes pay to win",
            "review_score": "1"
        },
        {
            "review_text": "like this game very mush just like in real world war 2 but if you put British and Japan army maybe it is more fun to play.i hope you put British and Japan army.Again...Thank you for making this game.",
            "review_score": "1"
        },
        {
            "review_text": "I honestly love this game. It brings such realism (to a certain point) of what it's like to be in war. I am having audio issues that just happened a day ago and am trying to fix them. If I can talk to any support team, that would be great!",
            "review_score": "1"
        },
        {
            "review_text": "Bicycle simulator 1944 for free :D",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, but items are too expensive, credits are kinda hard to get and it's hard to buy an item because you always have to repair your weapons and vehicles.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, it is from my top 10 every played, but the recommended settings are a lie! I have GTX460  8G Ram and an i7 processor  and still the FPS is horrible at LOW video options!",
            "review_score": "1"
        },
        {
            "review_text": "Bicycle simulator 1944 for free :D",
            "review_score": "1"
        },
        {
            "review_text": "Funny You gotta play it",
            "review_score": "1"
        },
        {
            "review_text": "Not played for a while, but was fun when I did.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Really addictive, well balanced goals for extended play.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good, i have no doubt that it will get netter. ",
            "review_score": "1"
        },
        {
            "review_text": "- poor balance. - combined arms not thought out well at all if at all  Other than that enjoyable if you can put up with the above problems. Designed to frustrate a player at lower levels to goad them into spending money to advance (otherwise it's very slow).",
            "review_score": "1"
        },
        {
            "review_text": "The game introduces you to basic units at the start, and makes sure you learn everything before moving to the higher levels where there is a bigger diversity of weapons and vehicles and maps. The maps are huge, but the gameplay is simple and fantastic. Get some friends to play it with you and you can chat over Discord, providing endless amounts of fun.  9001/10 would be a Russian again XD",
            "review_score": "1"
        },
        {
            "review_text": "One of the best F2P games worth looking into",
            "review_score": "1"
        },
        {
            "review_text": "Very good and realistic game. I enjoy every hour i spend on this game and would rate it 8.5/10 Downside is that it requires a good pc but i have one Would recommend it!!!",
            "review_score": "1"
        },
        {
            "review_text": "Very well made WW2 Sim, especially for being free.",
            "review_score": "1"
        },
        {
            "review_text": "This is really the only WWII game worth playing these days. The new maps are amazing and will take many days to learn all the diffrent parts of. A vast selection of vehicles and weapons. The RTS side of the game as a general may take some time to get to but it is quite fun as well.",
            "review_score": "1"
        },
        {
            "review_text": "Best cycling simulator 2016",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the best World War 2 shooters",
            "review_score": "1"
        },
        {
            "review_text": "This games is one of the best games I've played on steam! I'd recommend it to anyone who wants a fun online game to play with their friends! It's by far the best free game I've ever played ",
            "review_score": "1"
        },
        {
            "review_text": "One of my fav games it really should win the 5 more mintues awared if you don't like grinding the gtfo thats it :D",
            "review_score": "1"
        },
        {
            "review_text": "Good game, love the gameplay, graphics maybe a little better but GREAT outstanding.",
            "review_score": "1"
        },
        {
            "review_text": "This game is really fun and even though it seems repetitive the gameplay is awesome, the graphics are ok, and the guns are cool!",
            "review_score": "1"
        },
        {
            "review_text": "This is a brilliantly well balanced Free to play game. I've played from the beginning which means I have several rank 15 characters, and can say that all it takes in order to be good and always have the funds to buy something new (Even cosmetic things yes) is dedication! My friends and I can easily get a character from rank 1-7 in a day no matter the area of expertise. Once the player is at that rank with the proper early game budgetting and has learned their way around the game. They can easily support any playstyle they wish the more than enough funds to even try out new things.   The people whom I normally see complain are the ones that actually put money into this game.. I have not spent a dollar and nor do I plan too Its not necessary and in my opinion ruins things like goals 'Im gonna get to that STG-44 some day I just know it'   Also to all those who think its hard to get going cause 'My starter gun sucks' Learn how to upgrade it for your playstyle. I only use the Gewehr on my Rank 12 Paratrooper and it has an accurate rank of 50m but can kill in 1-2 shots.   Basically Heroes and Generals is a great game for you and some friends to get involved in. Remember its War. Itll suck sometimes and be awesome some other times but all it takes is you to be awesome.",
            "review_score": "1"
        },
        {
            "review_text": "im not very good at close combat so i prefer to use scoped wepons. thats a good thing about the game, the combinations of weapons and vehicles",
            "review_score": "1"
        },
        {
            "review_text": "it has improved but still needs some work, I reccomend it",
            "review_score": "1"
        },
        {
            "review_text": "The menu and leveling system can be a bit overwhelming to start, but I really enjoy the system of progression for both your character and the different weapons available. I feel it's well-balanced, I didn't feel like I was getting destroyed by high-level players with superior weapons right away and I like that the amount of weapons and gear you carry affects your ability to sprint. It's nothing groundbreaking in the FPS genre but for a free-to-play game but it's solid, good fun and balanced so far. Can't go wrong with this one.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very very good game but i think there are a few cheaters.",
            "review_score": "1"
        },
        {
            "review_text": "this game is very enjoyable if you are willing to grind to get the object of your dreams which can take a while and money is hard to collect also. I think thsi game is great",
            "review_score": "1"
        },
        {
            "review_text": "game is okay though my frame rate is ♥♥♥♥ in this game",
            "review_score": "1"
        },
        {
            "review_text": "Good game, just remember it's free to play.......so queueing etc when uneven teams and it takes a while to unlock things if you don't pay extra cash....",
            "review_score": "1"
        },
        {
            "review_text": "Well, I'm enjoyed this game, but no really. May they improve the graphic optimization so anyone who have a mid-end computer could play it smoothly? I mean not in High Quality but it's ok, though.  Second is, I read some reviews, told which this game has a hackers in it? Really? I played it at first time and not found even one.  Thanks and Best Regards   BribeMaster",
            "review_score": "1"
        },
        {
            "review_text": "i lovw this game!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty slow progress for casual players, decent graphics and much better than that CoD ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Starting off is extremely hard as you will need to get 'ribbons' to progress and unlock new things, this is hard as some of the ribbons are hard to get; tank destroyer is on of these, without anti-tank mine this is extremely hard, and to get anti-tank mine you need to unlock a couple of tank destroyer ribbons. The only say to progress this is if you find a Panzerfarst or whatever and blow them up (2 hits for sh*t tanks)  +FTP +Good Graphics +Good gameplay +Different roles/characters +Reasonably good anti cheat  You are required to progress by playing a lot to have access to other ♥♥♥♥ (Slighty pay to win)  -HitReg -Some ribbons are nearly impossible to get unless getting items off dead bodies and using them or finding them in the map -No girl characters -No Feminazis -Slighty Pay to win",
            "review_score": "1"
        },
        {
            "review_text": "One thing i want to make very clear is P2W (Pay To Win) AND Pay To Skip are two very different things. Unlike world of tanks or some other free games out there there are no vehicles or weapons that only paying customers can use. A free game cannot simply live, even if it the best one made ever, withought having something to buy and some incentive too. BUT EVERYTHING CAN BE GOTTEN FREE. Is there a grind? Yes. But it is as it must be in any free game. It is an enjoyable enough experience that i wont spend a dime and ill work hard for that shiny carbine and satisfaction, but not so much a grind its unbearable. Is this game for everyone? No. But dear god jesus above stop calling it P2W, becasue it is not. You can't buy a win.",
            "review_score": "1"
        },
        {
            "review_text": "Edited* Great Game!",
            "review_score": "1"
        },
        {
            "review_text": "I've played this game for more than 600 hours, and I will say that I have enjoy the game a lot, and will continue to. It's the best free ww2 game I've played so far. It is a team based game, so playing by yourself won't get you so far mostly. You get to play as different classes (Tankers, Pilot etc.). There are indeed a few bugs and irritating gameplay in this game, but I believe that the devs will fix these problems, and other stuff the community know of (Since this game gets big updates once every so often). So yea, I recommend this game :)",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game. But there are some issues which could be easily fixed.. That is the grind. This game is NOT newplayer friendly. I think they need to reduce the credit costs on weapons + perks by half.  Other than that, they should make more Encounter maps instead of constantly remaking the same maps.  And 24 hour membership is a joke. It costs 1/5th the amount of the 30 day membership, wtf? At least make it 3 day or lower the cost.",
            "review_score": "1"
        },
        {
            "review_text": "Nice Game Like it Alot",
            "review_score": "1"
        },
        {
            "review_text": "This game is really advanced in terms of of free-to-play games. It is currently my favorite game, and it is just amazing. The graphics are pretty good and the gameplay is super fun and immersive. People keep saying this game is pay to win, but thats not true.   Heros &amp; Generals is not pay-to-win!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun for a free game, only problem is that it takes a while to get a scope and some new guns. I rate a 7/10 for a fun time.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun game. But there are some issues which could be easily fixed.. That is the grind. This game is NOT newplayer friendly. I think they need to reduce the credit costs on weapons + perks by half.  Other than that, they should make more Encounter maps instead of constantly remaking the same maps.  And 24 hour membership is a joke. It costs 1/5th the amount of the 30 day membership, wtf? At least make it 3 day or lower the cost.",
            "review_score": "1"
        },
        {
            "review_text": "A bunch of prepubescent teens completely rekking each other, over &amp; over again. ",
            "review_score": "1"
        },
        {
            "review_text": "Was good but seems to have a few issues at the moment such as I can be shot through a concrete wall by a Grewher, I get shot in the leg once and died as well as the insane amount of glitching!",
            "review_score": "1"
        },
        {
            "review_text": "Free Battlefield 1 Game boiz",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game for quite a while. I only play American and I must say that the Soviet and German forces have superior power when it comes to the battlefield. American side seems to lack the teamwork and communication. I am now a Pilot and Tanker (have two characters). Piloting is a challenge and the German planes seem to rule the sky. Battle is good and game runs great otherwise. It has come a long way since I forst played. I have earned all my character perks and stats without purchase of gold as the price seems steap to me. That is my main complaint.",
            "review_score": "1"
        },
        {
            "review_text": "WW2,TANKS,FRIENDLY FIRE,MINES,LONG GAME,RUSSIANS,GERMANS + FREE= fps ww2 good game 69/69",
            "review_score": "1"
        },
        {
            "review_text": "Nice Game Like it Alot",
            "review_score": "1"
        },
        {
            "review_text": "This game is HARD! deal with it. And BTW, it's FREE, so ofc the developers have to make money, but sayin it is P2W is so damn wrong, in this game you can buy everything for in-game credits. Also it's P2W only if u have like 1000€ to invest in a game, if u do it's up to you, but let me tell you, nobody is going to waste 10€ to buy a gun, the guys that use real cash, use it for veteran memberships, that's the only thing that's cheaper in gold than in credits. When u start this game for the first time, u probably gonna make scores of 1/10 but it gets better in time. If u are looking for a real challenge and love fps then this is for you, if u are a easy quitter thats looking for a 1evening in-game and master everything, get over it, but don't insult the developers, because this game is awesome.",
            "review_score": "1"
        },
        {
            "review_text": "good graphics, needs improvement on hit boxes, u can barely kill most people tho, overall its a pretty good game",
            "review_score": "1"
        },
        {
            "review_text": "i leik when i run down my teammates in carro beep beep outta my way nerd",
            "review_score": "1"
        },
        {
            "review_text": "&gt;name your soldier Anne Frank &gt;Camp at some attic &gt;????? &gt;die 5 seconds before end of match &gt; profit",
            "review_score": "1"
        },
        {
            "review_text": "SPEAKING PURELY FROM SOMEONE WITH A PASSING INTEREST THAT ONLY PLAYED SOVIET INFANTRY  Is H&amp;G a   balanced   game? No, I would be lying if I told you that certain U.S. and Germany weapons take as much skill to play as frankly most of the Soviet Weapons.  Is H&amp;G a   fun   game? In my opinion, this is a very fun game. There are definite goals to work towards, usually guns or badges, and when you get there you feel accomplished because they really do change the game. The level to get in War Battles aka 1337 $KI11S has been getting higher due to recent updates which is good news for the people that actually pay for each deployment in War. IMO, the realtime strategy is for nerds who like doing nerd things like playing the realtime strategy. Without people deploying squads in war though, there would be no war battles, so do what floats your boat as both the strategic game and the action game are neccesary for success.  A tip for players starting out,   dont go into war battles trying to grind.   Staged battles are for farming kills and getting xp for that new badge or gun, but everytime you deploy in war to not do the objectives, or worse still, try to suicide run the objective, a general has to pay out of his pocket for your ♥♥♥♥♥♥♥y. After you have a character you like and are comfortable playing, then I suggest you go to war. Your mark of maturity will come after you see three krauts go flying in your triple nade kill. Also wear headphones or earbuds because hearing and subsequently running away from the sound of grenade is a skill you will have to learn quickly.                                                   please join su everyone is memeing on the koreabine and mlg3420   ",
            "review_score": "1"
        },
        {
            "review_text": "Its good fun.  If you dont run around out of cover, and know how to work in a squad, you'll have a good time playing this. People who get irritated with multiple spawning, because you ARE going to die, shouldnt try this.  The entry level weapon is perfectly fine even unmodded if you use it in one of two ways. Careful aiming while in cover, or hip fire and move like a mexican jumping bean. Altough dont jump, coz you cant shoot while you do that!  Later in game you can play as a paratrooper, tank commander, pilot or specialised sniper recon. All fun in their own ways, all with pro's and cons.  The 3 factions USSR, German and US are mostly balanced, but you'll find it boils down to play style more than anything else.  Give it a go! Its free and fun and if you can find 2 friends to play with, REALLY good fun! ;)))",
            "review_score": "1"
        },
        {
            "review_text": "Soooo fun but laggy for me cause my space i think",
            "review_score": "1"
        },
        {
            "review_text": "this game and its opportunities are amazing. The theme and all... Just great!! So many roles, weapons, vehicules, customization and much more!!! There is place for everyone in there but PLZ ADD A CAMPAIN ASWELL AS TRADING CARDS... +its freeeee!!!!",
            "review_score": "1"
        },
        {
            "review_text": "this game and its opportunities are amazing. The theme and all... Just great!! So many roles, weapons, vehicules, customization and much more!!! There is place for everyone in there but PLZ ADD A CAMPAIN ASWELL AS TRADING CARDS... +its freeeee!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Fun.Chalenging.Stable and reliable.Active Devs with periodic updates, including new content. As for the 'grind' you'll see in the negative reviews. This should let you know that you won't be playing with 'I want it now! Spoiled brats.' You'll be playing with a mature community looking to have fun and working hard to acheive mission goals together... as a team.  This game costs you nothing to download and play. But if you have to have that sniper gun with the long scope now it'll cost you. I look forward to playing with and against you players with a team like mind.",
            "review_score": "1"
        },
        {
            "review_text": "A rich man and a poor man have the same wedding anniversary.  They're both at Madison Avenue shopping for their wives. Poor man says to the Rich man, 'What'd you get your wife this year?'  He says, 'A Mercedes and a huge diamond ring.' The poor man says, 'Why'd you get her both?' The Rich man says, 'If she doesn't like the ring, she can take it back to store in her new car, come home and still be happy.' The Poor man says, 'O.K. That works.'  The Rich man says, 'Well what did you get your wife?' The Poor man says, 'A pair of slippers and a ♥♥♥♥♥.'  The Rich man says, 'Why'd you get her a pair of slippers and a ♥♥♥♥♥?'  The Poor man says, 'If she doesn't like the slippers, she can go ♥♥♥♥ herself!'",
            "review_score": "1"
        },
        {
            "review_text": "Hey that's pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "I want to give a 100%, yes, play this game, but I simply can't. It's a great game, but, unfortunately, updates have completely ruined it. Although I still recommend it, as it's a good game, it is infuriating. Playing Germany is impossible after everything they had got nerfed. Americans are overpowered, Soviets are even more powerful, and then Germany is just horrible. I'll expand this later, have to do ♥♥♥♥ now.",
            "review_score": "1"
        },
        {
            "review_text": "playing since early access what i want now is just voice chat or quick command like in csgo",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, definitely recommend. The only problem I have with it is the matchmaking time.",
            "review_score": "1"
        },
        {
            "review_text": "You can play this game without spend a money, approved",
            "review_score": "1"
        },
        {
            "review_text": "THIS IS NOT P2W, DON'T CRY LIL' BABIES  ONLY YOU NEED COMMON WEAPONS AND A GOOD TEAM TO WIN",
            "review_score": "1"
        },
        {
            "review_text": "After more than 500 hours in this game, I think I have enough experience to write a solid review for this game. Disclaimer: This is my opinion, I'm not saying that this is the correct one, so neither should you.  Now, lets start    Basics of the game",
            "review_score": "1"
        },
        {
            "review_text": "Very good WWII FPS game. It certainly is a lot of fun playing with friends especially now the game has launched.",
            "review_score": "1"
        },
        {
            "review_text": "best game ever the only reson that peopel rate the game down is because they dont like the play stlye. Some people say the starter rifles are unfair well i have no modifactions to my starter rifle and i have 278 kills and 121 deaths. I play in gold match making and am usialy top 5 in my team, so dont tell me the starter rifle sucks, it just dose not suit ur playstlye. and dont rate the game down because of that. And pay to win my but if ur a desent player and know how to save money then u should have no problem geting all the guns.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is action packed and amazing. ",
            "review_score": "1"
        },
        {
            "review_text": "it is good for fans of WW 1 and 2",
            "review_score": "1"
        },
        {
            "review_text": "GREAT GAME ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty cool game",
            "review_score": "1"
        },
        {
            "review_text": "having problems with my driver destroying grafics or creating grafical bugs or gliches recently but the game is really fun and well made",
            "review_score": "1"
        },
        {
            "review_text": "I havent played it in a while... But! Its the BEST, and i litteraly mean the BEST World War Sim ive EVER played. I recommend this to ppl that like WW Sims, it has litteraly everything you want! Snipers, plains, tanks, And. Much. MORE! 11/10 Would recommend again. xD",
            "review_score": "1"
        },
        {
            "review_text": "Pros : - Has a good attachment system - Allright ranking system - Realistic (kind of) Cons :  - Bad physics and gravity (when you jump you float for 2 seconds or something) - Nades are OP, i have been in so many games where there is just one guy spamming nades across the map and getting tons of kills because the nades are a 1 hit kill in a span of about 5 meters. - Horribly weapon system, you can play 8 games and get a super OP SMG but then you would not be able to play in the noob fights, but you can also pay real money to get an SMG like that and ♥♥♥♥ noobs with ♥♥♥♥ guns in the game. Final judgement : Allright, this is a 6/10 for me right now but if the devs make the grenades do less dmg, or the range less and change the gravity and currency system a bit it would become a 7-7,5/10",
            "review_score": "1"
        },
        {
            "review_text": "Pretty garbage after the last patch isnt bad for being a free game tho, its pretty good but pretty bad",
            "review_score": "1"
        },
        {
            "review_text": "hey all this game is really good it has awesxome graphics and is fun to play since you have creativeiy with the weapons",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Fun to play, graphics and sounds are great, Especially through a good headset. Starting soundtracks are fitting and enjoyable. It occasionally has some issues with lag, but its is minimal. Ideas with ribbons and rank are top, its great to finally have a decent idea and concept behind this game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing feel to it, although it is you're generic shooter, i doesn't have the feel of COD or Battlfield, but somewhat inbetween, the arsenal choice complements everyone's playstyles, snipers, heavy support, riflemen, CQC adn the such, so in all my experience so far is brilliant, plenty of things to do in the game. Customization? so far its only the camo of you're guns and uniform, but thats better than nothing. I have to say the only probelm with this game is that it lacks graphics, and i know know, gameplay outrules graphics anyday, but when you have a brilliant game like this, all we can do is wish for more better, up to date graphics, im not asking for someting like Battlefield 1, but something more, rejuvenating? I tink thats the correct word for it. But seriously, download it, the great feel to it and low deman for PC power makes it a free to play game you wont be embarassed about having in you're libary. ( If i have any spelling mistakes, feel free to correct me, i dont tend to pay attention to details when im typing unless its grammar. ) ",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun, but dont expect to get anything really fast, it may seem like it takes forever but stick with it for a little bit it gets better over time.  This game is not great to go into blind, look some things up on youtube, the game has alot to take in all at the same time but dont let that stop you.  if you want balanced battles dont do war do staged battles.  not P2W as you can do very good with the starter rifle and the grind is way less than it used to be.  i give it a 8/10 still needs some work but good so far. Devs arent as bad as people say.",
            "review_score": "1"
        },
        {
            "review_text": "Been around since utz update and this game has had its ups and downs with its updates, but now that its released I feel as if the game has come a long way  Pros  WW2  more weapons  more tanks  Went from pay to win to pay to get ribbons AKA if you want a weapon prepare to spend big bucks redone maps  half the grind by ranking up faster   Cons Toxic community that demands everything in 5 seconds flat and gets whiney when they dont get their way.   needs more factions/ planes.  minor balancing issues",
            "review_score": "1"
        },
        {
            "review_text": "It takes you longer to get a thompson in this game than it takes in real life if you have a job.",
            "review_score": "1"
        },
        {
            "review_text": "great game... could do with more game modes",
            "review_score": "1"
        },
        {
            "review_text": "so fun to play... finally",
            "review_score": "1"
        },
        {
            "review_text": "Still teething, but looks like it has a lot of potential",
            "review_score": "1"
        },
        {
            "review_text": "Have been playing the game since almost alpha. Still enjoying it!",
            "review_score": "1"
        },
        {
            "review_text": "If you're looking for a free WW2 FPS, I'd recommend this. If you're looking for a hardcore FPS game with a WW2 theme, I'd recommend Red Orchestra.",
            "review_score": "1"
        },
        {
            "review_text": "At first it seemed like some mediocre WW2-Shooter wannabe. But after playing a time with friends, unlocking new items and game modes the game gets really exciting and immersive. If you play with friends the game can have some hilarious moments. Like driving bicycle romantically together through explosions and overall World War 2 hell.  If you want a free, fast-paced fun WW2 shooter with some minor problems, download it. Come on it's just 1 GB and it's free don't be so harsh with your critique.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game, idk why people hate it, i have a ♥♥♥♥ computer and the fps always stays at 61, unless theres a lot of particles",
            "review_score": "1"
        },
        {
            "review_text": "me not play why? ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, I would highly recommend it over Battlefield 1. Sometimes can be a bit grindy, but every match is full of action. There are a lot of career options to choose from, each class has a vast amount of weapons, explosives, tools, vehicles, etc. 10/10 AND ITS FREE :D",
            "review_score": "1"
        },
        {
            "review_text": "incredible game BEST GAME I EEVER PLAYED",
            "review_score": "1"
        },
        {
            "review_text": "for as long as this game has been out, a few things have gon unaddressed.   no voice chat.  no all chat  unbalenced frames  extremely slow rates of fire on semi auto weapons  no compass  poor bullet travel time     i love this game, but it was in no way shape or form ready for full release.",
            "review_score": "1"
        },
        {
            "review_text": "it is fun even though not great of graffics but still fun sry bad english",
            "review_score": "1"
        },
        {
            "review_text": "Fun for a free to play game. It has some flaws. Aiming feels weird, pace is slow. Overall, a good game to play",
            "review_score": "1"
        },
        {
            "review_text": "Its a fun game. And good for a f2p. Recommend over new Cods.",
            "review_score": "1"
        },
        {
            "review_text": "its fun if u know what to do",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome! This game has a lot of potential to become the new world war 2 simulator fps game. Just continue updating it, fix patches and add new maps. Just dont make it P2W. Dont add supply drops. Dont add skins and the game will be the best fps out there...!",
            "review_score": "1"
        },
        {
            "review_text": "It would be a great FTP game if it's queue time wasen't longer than the actual games you played in. They seriously need to fix this.",
            "review_score": "1"
        },
        {
            "review_text": "I do not know why people are so negative about this game. I played it for about 18 hours before I hit a gold level and it was good fun. 18 hours play for 0 bucks is a good thing. After this you end up being matched with other people with sniper rifles, tanks etc and it is basically impossible unless you are prepared to grind many losses for some decent equipment.  Still 18 hours for zero to pay is good value for money. Just be prepared to stop at this point unless your going to start paying for a half decent load out..",
            "review_score": "1"
        },
        {
            "review_text": "It takes you longer to get a thompson in this game than it takes in real life if you have a job.",
            "review_score": "1"
        },
        {
            "review_text": "Decent game and its free!",
            "review_score": "1"
        },
        {
            "review_text": "its fun to slaughter clueless nazis",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, needs more players.",
            "review_score": "1"
        },
        {
            "review_text": "the game is good but the respwon is so suck fix that PLZ _____________________________________ _______________________________  and no small map in left or right fix that PLZ :(",
            "review_score": "1"
        },
        {
            "review_text": "This game will give you an experience of a world war 2  it has a classic bicycle, truck, tank, plane of US Russia German try it!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 this is a fun game to play kinda better better than BF 1,2,3, and 4 but wht they need to add in is where you can be able to chat in game and add it where friends can send money to each but still this is a good game to play",
            "review_score": "1"
        },
        {
            "review_text": "I can't even describe with words how good i think this game is. It simply makes me speechless. Yes, there is a bit of grinding ahead of you if you haven't played the game before. But once you really get into the game, you can never completely 'get out' of the game.",
            "review_score": "1"
        },
        {
            "review_text": "A def must for those special moments with your friends or alone when you get bored of playing your usual game. Throughout the changes and upgrades I'm still usuing it as a go to when I need a break.",
            "review_score": "1"
        },
        {
            "review_text": "Game is OK! Not good not bad, it's OK. So first things first: -Good graphics, cool design of weapons, no skins :) -Realistic sound and customization -Whistling and bike riding And here comes the bad stuff: -Floaty jumps (moon mode), sprinting for 5 sec... -Poor damage and sometimes aiming (recoil)... -Grenade spam and APC/Jeep with 50 cal. spam... -Etc.. try it...",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great free game but it freezes on me every single game after like 3 minutes or less ",
            "review_score": "1"
        },
        {
            "review_text": "Can't afford Battlefield 1?  -Play this.",
            "review_score": "1"
        },
        {
            "review_text": "Great game but it takes for ever to unlock a new gun or sight. would not recommend this game for impatient people.",
            "review_score": "1"
        },
        {
            "review_text": "Just a great game. A modern throw back to the classic World War II games I first started playing on so many years ago.",
            "review_score": "1"
        },
        {
            "review_text": "It's a fun free to play game. In the beginning is everything is a bit slow paced and it is hard to get used to the gameplay and lighting, but a fun game nonetheless. Do try it.",
            "review_score": "1"
        },
        {
            "review_text": "they need to add to this game campain and zombie that will be awsome ",
            "review_score": "1"
        },
        {
            "review_text": "Some people call me a pig because I roll around in dirt, well don't be fooled thats just me when I play this 2016 hit classic game that takes place during the WWII time ya goofball. Overall, I would say it's better than CoD.",
            "review_score": "1"
        },
        {
            "review_text": "great game ",
            "review_score": "1"
        },
        {
            "review_text": "Great F2P game.",
            "review_score": "1"
        },
        {
            "review_text": "Can't afford Battlefield 1?  -Play this.",
            "review_score": "1"
        },
        {
            "review_text": "Will anyone be my friend?",
            "review_score": "1"
        },
        {
            "review_text": "The only thing that this game needs isw a price Balancing System",
            "review_score": "1"
        },
        {
            "review_text": "Besides some bugs and bush wookies, Ive had no problems with the game, it is a hardcore shooter you will die easy and often but u do so the same to the enemy, the gunplay could use some work but if u cant buy Battlefield 1 this is a more realistic World war shooter",
            "review_score": "1"
        },
        {
            "review_text": "After too many hours, I cant say it's bad! It is still under development. It has great Potential as a whole, but lacks of good Physics. For example, a tank cannot run over a mailbox or a fence. Or even a tree or small rock. It's quite comical at times, but gets annoying too! There is a lack of large maps and planes but maybe the next updates will implement more aircraft. Overall one of my favorite games :3",
            "review_score": "1"
        },
        {
            "review_text": "This game is very nice gameplay experience and best part it is free for everybady !! =)",
            "review_score": "1"
        },
        {
            "review_text": "as a player who has who has over 100 hours of game time a feel i have gotten used to this game the game is a great to play with friends but over emphisises on grinding to get any where it takes a while to get started and a lot of game time if you dont want to pay to win it took me 60 hours of gameplay for me to get my tank to a reasonable level without useing the pay to win option if you have the time to put into this game and a good group of friends youll have a great time if your looking for a game where you can start emidiatly this is not it uless you are prepared to pay a lot of money on in-game currency it is still in develpment and as a player who has played from the begining i have loved to see it develope over time a good game that keeps improveing (slowly right now XD)",
            "review_score": "1"
        },
        {
            "review_text": "OK First of all let me get something out of the way. 90% of the reviews I've seen of this game are outdated since, in the last year, 2 GAME CHANGING updates have been released so double-check the reviews you're reading are from the past 3 months.  This game is ♥♥♥♥. You die a lot. Teams barely coordinate. People are trolls. THIS IS NOT A GAME FOR PEOPLE NEW TO PVP-FPS GAMES!!!!  That said, the game offers a unique experience (and since people are XP hungry in all games and totally lack coordination it's not that strange).  While this game is, indeed a major grind if you're not the PAY2WIN shitehole, that just means there's plenty of time to pick up weapons before buying them and there's more significance in attaining a powerful weapon (hard work pays off).  Also it is because this game is ♥♥♥♥ that it's hilarious (real war isn't). I mean seeing a (intact) corpse flying up 40 feet and hitting a plane when you drive over an anti-tank mine is comedy gold!  This game is NOT an accurate WWII simulation game because there are spawnpoints, YOU AS A SOLDIER PAY FOR YOUR STANDARD-ISSUE WEAPONS, Privates (low rank) can end up as the squad leader in charge of Captains (high rank), and the performance of different vehicles, weapons, etc... are heavily influenced by complaints from the community   (example: the Jumbo heavy tank that is only competative because its frontal armor was realistically too thick to be penetrated, but people commanding the most over-powered tanks in the game complained and the DEVS nerfed it out of being competative).  NOW FOR THE PROS!!!!  The game is still (despite no longer being BETA) improving! Major updates fixing/adding certain features are coming out (assists are actually less than a month old in the game while beta left 2-3 months ago)  You can play as a 'General' once you get to a certain point in the game. The Generals side is a REAL-TIME-STRATEGY component of the game. To describe this side, imagine the game Civilization or Sins of a Solar Empire : You command Units known as Assault Teams and send them to cities where players spawn using those resources to fight their 'Heroes' side.  The maps are so detailed (and in-depth) that players who have 2000+ hours on tha game (played for 2+years) still find new features daily (NOTE: one of recent game-changing updates remodeled all maps to help spawn-camping issue so that reference is pre-Garmon update)  There is a large Twitch Streaming community that provides the only real TEAM-WIDE coordination in battles.  There is now a way to report abuse in-game  There is a universal way to quickly ask for a ride - 'F' - whistle - when whistling outdoors most vehicles stop to let you hop on. Indoors it's used to relay info such as 'Point Clear' or 'The area by me is clear'  Lastly any and all headshots, even by the weakest weapon in the game, is instant death.     IMPORTANT NOTES FOR THE NEW PLAYERS!!!  any explosives will cause repair costs to skyrocket.   First weapon you try to buy should be the T1 SMG for your faction  anti-tank weapons are especially expensive per use  first new soldier you buy should be a Tank crewman - Killing tanks with a tank is the most practical way to get credits for average skilled players  DO NOT BUY A PILOT!! The price per spawn is more than anything else in the game (500 each)!! Also the flight controls are abnormal so first time flying you'll be lucky with just 10 suicides via collision (5k creds lost)  Be mindful of upgrades to weapons (like high-damage high-precision rifle rounds) to increase Rate of Fire and Damage   Be sure that when the rest of your team pushes to the next point, you stay behind to defend. It's not uncommon to have 12 people (2/3 team) capturing the next point and have your push stopped by 'Ghost cappers' that capture the previous point while your team is traveling/capturing the next point.",
            "review_score": "1"
        },
        {
            "review_text": "Recommended, just try it, it is free. :) I have been playing this game since early spring of 2013 (if I am not wrong). It had its ups and downs, great joys and great losses. Personally, I do not play it anymore, for now, mostly because of two things (and no, pay2savetime is not one of them):  -1 issue for me is that stupit spotting system, look at the random location, you can`t see ♥♥♥♥, but still you can spot an enemy - Good God. Can`t be stealthy anymore. Back in the days, (when Amendeon was first on the scoreboard for a long time and when Fontan was German top tier ♥♥♥♥, he was on fire; that stupid get off a bicycle air catapult bug; F5 button; press space to speed up time counter in a battle; and much more :) ) you could spot an enemy only with your binoculars. -2 thing that bothers me is that Scoped update (do not know when it happened), now any mothertrucker can camp to its full potential. AIDS at its best... But, I am looking forward to see how this game will evolve. Hope it will be fun again (at least for me).  Thanks to Reto-Moto for providing me with tons of fun in past 4 years. See you on the battlefield, maybe, sometimes...  And Reto please, don`t drop the soap! (do not mess up the game, please)  Best regards, Nikola.",
            "review_score": "1"
        },
        {
            "review_text": "Items too expensive... one needs to play a long time to get one single item.  To GameMaker: 'Give us cheaper price to buy items or give us daily spin for Money Boost'",
            "review_score": "1"
        },
        {
            "review_text": "I love this game a lot, its a really great game. People say its uneven, but once you get good at it you realize its as even as they could make it and keep the game diversity. I've also seen reviews where people say there are hackers but i've never been in a game with one, they're probably just getting recked by a skilled player. The only problems I have with this game are the xp and some squad problems. You have to grind for hours to rank up, its unbelievable how much xp you need once you reach past rank 10. The problem with the squads is that i might join a game and have a squad leader who is rank 0! If i'm squad leader we get aux seats and I can assign attack or defence on the objectives for extra xp BUT NOOOO LETS GIVE HIM A SQUAD LEADER WHO DOESNT BENEFIT THE GAME AT ALL!",
            "review_score": "1"
        },
        {
            "review_text": "This game is pretty fun. You feel rather immersed as you walk onto the battlefield with your m1g, an appropriately dim and grey aesthetic surrounding you. The combat is well done, the weapons handling as they should with tons of upgrades available. There are a few classes each with their own vehicles available, including armored vehicles tanks and planes.  This game does have its cons, tanks own the map and are more effective snipers than the recon! Capping objectives is slightly annoying I find as you have to actually be INSIDE the building, not around it  The biggest killer is that it is practical impossible to make serious progress without buying into it. I have 36 hours on H&amp;G so far and for every single one of them I have been using the same damn weapon, the meg. I have been saving up to get the recon class which is absurdly expensive. So I have only just got the recon, purchased a sniper and I have just found out I cannot even afford a scope, got another 20 hours of grinding before I get to that. 36 hours and I have only just got a new weapon. Wow  Try the game and have a blast, but have fun only using the 1 weapon!",
            "review_score": "1"
        },
        {
            "review_text": "Very good game for me with my limited time to play each night.   Upgrades too expensive... one needs to play a long time to get one single item.   Needs more clan/guild involvment. Make joining a clan to play worth it.",
            "review_score": "1"
        },
        {
            "review_text": "great game. ",
            "review_score": "1"
        },
        {
            "review_text": "WHY DOES IT TAKE SO LONG TO GET A AUTOMATIC GUN?",
            "review_score": "1"
        },
        {
            "review_text": "The game is good but there need to be a server browser instead on the game choosing the server for you. Apart from that the game is good.",
            "review_score": "1"
        },
        {
            "review_text": "Good with friends. But only 3 can play :(",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite difficult to review, or get an overall picture of how it is. Since the majority of people enjoy something 'EZ' because nobody got any patience for anything these days. The game is a grind, and there is no denying that. It'll take a long time to unlock a gun, and even longer to unlock it's attachments to make it suit your taste. It can be difficult to learn, as there aren't really much explaining how the squad system works, so you'll have to Google it. Unless I missed something.   But it's a great game. There is microtransactions, but it's not as bad as one might think. You can buy gold to purchase guns, attachments or vehicles. After buying whatever your heart desired, you'd still have to unlock the attachments which would be even more gold. So it'll easily be quite a lot of money than it's even worth, as players who chose the easy way still doessn't have any knownledge how the gun performs. So it's not as bad as it is in some games. You can also chose to just grind out everything, I've only obtained 18.5 hours at the time writing this and I've unlocked an SMG, sniper and a Jeep. So it's not impossible to unlock a lot of stuff if you're decent at the time.  But overall it's a pretty great game, as microtransactions doesn't really seem to be an issue, atleast not in my eyes. Everything is easily unlockable if you just grind for it a bit.   ",
            "review_score": "1"
        },
        {
            "review_text": "Early impressions:   Standard controls   Not too much of a resource hog - 60+fps on an early i5 and GTX 750 Ti @ 1080   Decent graphics   Recoil more realistic than most shooters  ",
            "review_score": "1"
        },
        {
            "review_text": "I unlocked the paratrooper with an smg in a day, im in gold and still get top 5 on the score board, its not as bad as some people say but it is grindy. Second day I got a tank crewman, now im saving for a medium tank. As a new player I still enjoy this game I will probably play it for a month, Im sure you know why.",
            "review_score": "1"
        },
        {
            "review_text": "fun and realistic(ish)",
            "review_score": "1"
        },
        {
            "review_text": "Best WW2 shooter game out there, worth getting.",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever but mabey someone should explain the waiting time to get in a game for new players.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "                                                                                                                                     .                                                                                                       Do you suspect any thing?",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would hide in gutter again.",
            "review_score": "1"
        },
        {
            "review_text": "The Coolest WW2 Game i have played (i am not talking about Battlefield 1) its a lot of fun to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "am i the only one that listens to sabaton and thinks of this game?",
            "review_score": "1"
        },
        {
            "review_text": "i never played a game this much in my life......so yeah",
            "review_score": "1"
        },
        {
            "review_text": "Well, now that the game is fully released, I have to do re-re-review.  Even though much isn't different now that the game has been fully released, but many things are probably going to change. There are definitely going to be more people now. (I mean, that's a given) Also, when I logged in after the release, I got a ton of in-game money and xp because I was a veteran player in the early access game. I hope H&amp;G does extremely well in the future, and prospers immensely. Good luck Reto Moto.  Pros: -Plays well (For Me) at max settings and 20 fps -Simple, easy to pick up gameplay -Varied choice in playstyle (Sniping, Kamikaze, Stealthy, etc.) -Overall fun to experience -I get to ride a freaking bike -I also get to run people over with cars  Cons: -Lots of time to get more things -Sometimes gets boring and repetetive  (I'll probably add more to these lists when I have time)",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game for so long, i am undecided whether or i love this game, or if i hate it.  Dont listen to any of the reviews, this is a game you have to experience YOURSELF, this game is literally a mountain, and not everyone has the ability to climb it, which isnt a bad thing either.",
            "review_score": "1"
        },
        {
            "review_text": "good achievment system, not the best physics, intersting maps, many variants of weapon",
            "review_score": "1"
        },
        {
            "review_text": "am i the only one that listens to sabaton and thinks of this game?",
            "review_score": "1"
        },
        {
            "review_text": "i like this game it is fun espacially if they ad more weapons but for a beta very good",
            "review_score": "1"
        },
        {
            "review_text": "Really good game! (some Times :I) 7/10  -Bad things: the spawns, the hit registration and the pay to win (its ok but the gold cost to much and you dont get so much for your money...) The team balance if the game had it.... have tried some really boring matches Tanks And Plans Vs infantry Only...   -Good things!: i like all the weapons, tanks, cars and plans... And that you can upgrade all most everything, and still only in early access ;) But have also bin that for a long time ;i",
            "review_score": "1"
        },
        {
            "review_text": "they should put thison console :P",
            "review_score": "1"
        },
        {
            "review_text": "Lots of content and updates. Not sure if there are hackers like alot of people say but it is very difficult at times.",
            "review_score": "1"
        },
        {
            "review_text": "(Edited as I wanted to put the review in more depth) Okay, so I've played Heroes and Generals for some time now. I really like the concept of the game, though it has its flaws.  Things it did right:  - The game. The game itself is a wonderful concept that has been made to the liking of many players.  - The guns. You can play as you want. You can buy a semi-auto or an auto rifle depending on your playstyle and upgrade it to your liking  - The modes. There are three main modes of play in Heroes and Generals: Assault, War and Skirmish. Each has its own difficulties and tactics.  Things it did wrong:  - Anti-cheat. This flaw is blatantly obvious, and can be noticed withing 10 or so games. There are a few main types of cheating in this: Wall hacking (Where the player can see other players through the walls), Aimbotting (The cursor tracks players), and XP / credit farming (where one player lets another get a LOT of kills on them, to farm XP and credits).  - Currency. This is well thought out in most places, but when the cost to repair your sniper rifle is more (Per shot) than you gain from a kill, it becomes an issue and you just end up waisting money.  - The players. Most team-mates dont actually care about winning the game or the objective. To them it is more of a CS:GO type of game than it is a strategy, which is what this game tries so hard to be, most players will either be absolutley terrible (Which I can understand, but the matchmaking levels (Bronze, Silver, Gold) should be sorted out) or they will be trolls and team kill or greif.  - Grenades... Oh boy, this one pisses me off. Grenades are not only the most over-powered pieces of ♥♥♥♥ in the game, but you can carry 3 per item slot (Meaning that a normal player can carry a max of 9 with no gun). Players seem to find it enjoyable that you can just throw these ♥♥♥♥♥♥♥♥♥♥♥♥s one after another until you kill the player you are trying to kill. I find this extremely stupid, as not only do these cost more to use than you get per kill, but RETO enforces the idea of using them.   RETO complains about losing money, but they only really have themselves to blame. You need to listen to your players. Think about adding / changing:  - The amount of carriable grenades  - The cost of repairs on certain weapons (As the recon class is now useless)  - An actually somewhat useful anti-cheat system  Aside from that little rant... love the game... would recommend..",
            "review_score": "1"
        },
        {
            "review_text": "Let's just get this straight: Over half of the negative reviews complain about issues that are already fixed, stuff you would expect in a F2P game(like hackers), or just personal issues with the game, which is okay, but try to criticize their reviews a bit. Anyways, there is nothing to lose playing a F2P title.  Here are some positive sides of the game: -F2P, so it is free to try, and you won't lose anything if you are patient enough to not spend money -A large variety of classes, weapons, and vehicles to use -pretty good graphics for a F2P title -Grind is not too bad, just learn to enjoy rather than just get XP, but that is hard for credits -All classes hava a role, like planes kill tanks, and tanks kill infantry, while infantry is still fun to play -New content is released pretty often  And also some negative sides: -Some weapons are deffinitely better than others, like the STG44, which is absolutely brutal at most ranges -Though they are fun, the physics are very bad -Credit gain is too low, and you have to spend a bunch on repairing, seriously limiting the amount of weapons you can use to grind credits -Loading times are horrible -Unbalanced tank gameplay in many cases, the chaffee doesn't have any weaknesses if the matchmaker is on it's side -Matchmaker is pretty bad, always listing good players against bad players -I have not noticed any anti-cheat, other than the 10-report ban -Although they are large, there are too few maps -The new content is not always useful, and often just breaks the game more, adding grind to certain weapons and making grinding credits hard because your own weapon has to be pretty unupgraded  If you just learn to enjoy grindy games, you can definitely have fun in this one. Keeping the thought of XP and credits in your mind all the time just makes you bored. If you want a fast-paced shooter, this is not the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "INFANTRY The best JOB,ever !!! you can use ultimate weapon dan bomb special for destroy tank,and have 3 vehicle  THE RECON / SNIPER dont try this job,,like a SHIIIT !! better infantry with scope weapon  TANK CREW Better job for destroy anything,long range  PARATROOPER Better job for FARM money !!  PILOT hard for control flight &gt;.&lt; and kill enemy  GENERAL best strategy !!  4 / 5 after update iam always DROP FPS",
            "review_score": "1"
        },
        {
            "review_text": "Played it for a little bit, Im not very good, But ill keep playing",
            "review_score": "1"
        },
        {
            "review_text": "  I love the game and everything about it, You may have to play it for a while to get more skilled at it but Its awesome!",
            "review_score": "1"
        },
        {
            "review_text": "  Pretty good game im good at it as well",
            "review_score": "1"
        },
        {
            "review_text": "really ♥♥♥♥♥♥ and grindy when you start off, but once you gain some momentum it gets really fun!  UPDATE  the new update makes it less grindy, spawncamping is a lot less common, and i can finally play as infantry without getting fustrated from being spawnsniped. it also allows me to play with players of similar veiws",
            "review_score": "1"
        },
        {
            "review_text": "So many people cry and wine about this game i have played for maybe a total of 30 hours and only put in $10 bucks and i have a soldier that is competative with the others . This game is great , its free and playable being free too and also has a great consept to how the war is played out . I would easiley say one of the best WWII mmos out there .",
            "review_score": "1"
        },
        {
            "review_text": "Great game not p2w recomended for all fps lovers and freebies alike.Great gameplay mechanics and they are very uniqe",
            "review_score": "1"
        },
        {
            "review_text": "IT WONT LET ME PLAY!!! But if it did I saw it and it looked super fun :D",
            "review_score": "1"
        },
        {
            "review_text": "Very Fun If You Cant Afford Battlefield 1 Than This Is Your Game Very Team Based No Trolls Either",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ ♥♥♥♥ ♥♥♥♥ ♥♥♥♥ ♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ shit♥♥♥♥ ♥♥♥♥ ♥♥♥♥ ♥♥♥♥ good ",
            "review_score": "1"
        },
        {
            "review_text": "Just scroll up and download it !  Its free dont wait !",
            "review_score": "1"
        },
        {
            "review_text": "H BUILD IS THE GODPATCH!  GG M2 KOREABINE FINALLY!  GG MG42 LASER FINALLY!     and soviet still lose in stage.",
            "review_score": "1"
        },
        {
            "review_text": "What I like about this game is how realistic it seems . I could how e soldiers in World War 2 felt.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is amazing, so good. HEAPS of fun. specially for a free game ",
            "review_score": "1"
        },
        {
            "review_text": "i did not play this game but ik that the game is a game...    review of the year",
            "review_score": "1"
        },
        {
            "review_text": "...",
            "review_score": "1"
        },
        {
            "review_text": "Even though the game has quite a few things they should improve (adding tutorials and a better interface,better hud), it's very fun to play and very adictive.",
            "review_score": "1"
        },
        {
            "review_text": "A very good shooter for a f2p. Like the combat system. Allot have changed since last time i playd this game and thats like a year or more so.",
            "review_score": "1"
        },
        {
            "review_text": "For a free game, you can have a ton of fun with this one. Heroes &amp; Generals may seem like a generic shooter but is actually very enjoyable. I especially love the big maps and different soldier classes. Don't get me wrong, the game isn't perfect. It has many glitcheds and bugs, but they don't effect the game too much. Most revews I've seen say that there are hackers but i've played for long time so far and have never seen any. Plus, this is a free game that doesn't beg you to pay some disgusting fee to actually have fun with the game. So basically if you're craving something that isn't pew pew fly around with lasers than I really recommend trying this out. And since it doesn't cost anything, there's really no harm in trying it out.",
            "review_score": "1"
        },
        {
            "review_text": "There's still tonnes to be done to improve this first person shooter, but it's very promising. Reviews are full of the fact that it's pay to win and it is if you want to progress quickly, but in this sort of game you don't have to. I like the way that your soldier progresses and you can build your squad. The anti- cheating mechanism seems to work well and players are encouraged to get stuck in. I'd like to get a bit more out of the graphics, but I guess that will come.",
            "review_score": "1"
        },
        {
            "review_text": "great game",
            "review_score": "1"
        },
        {
            "review_text": "they can make it very better",
            "review_score": "1"
        },
        {
            "review_text": "its ok its just everytime im in queue it takes 10-15 minutes to find a game Good for a free to play free battlefield The weapon system sucks also 200k for a simple gun and 2k from each game",
            "review_score": "1"
        },
        {
            "review_text": "its free ww2 game",
            "review_score": "1"
        },
        {
            "review_text": "my game wont load this is some ♥♥♥♥♥♥♥t",
            "review_score": "1"
        },
        {
            "review_text": "When this game is gonna be release on Mac OSx? any idea?",
            "review_score": "1"
        },
        {
            "review_text": "very fun now not fu**ing pay to win anymore ty reto!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! i still want the brtish and the japneses",
            "review_score": "1"
        },
        {
            "review_text": "I read through alot of the reviews with a thumbs down and i realized that these people must not know how to play the game I mean like yes there is grinding and all but this is a long term game not something were you can expect to get some of the best guns right away. Also after i got the m1/m2 carbine (one of the best US guns) it was still hard to use I had to get good with it and i dont mean with modifications I mean just practice. Same for some of the german LMGs Ive used them quite a bit but there really not OP yes they can seem that way but its more of how the player uses this gun.   Also that pay-to-win stuff is crap you still have to unlock the weapons through diffrent badges like infantry assault, Smg assault, lmg assault, handgun assault, and tactical (and a few others...) also with the modifications you still have to unlock them by getting kills (recent update also with kill assist) so you can get your lets say M1 garand specialist up so you can unlock those. The only only only way you can 'pay to win' with that is if you happen to have around 300 dollars to use on a free game and buy 1st to 12th specialist for one gun but even if you did that still buying modifications and even if you did all that.................................. you still might suck with the gun and even if you didnt suck with and were amazing it still wouldnt be OP just skill but even if it wasnt skill it wouldnt matter because very very very few people would ever be stupid anough to do that.  good maps, good squad system, good guns, good vehicles, bad reviews (not sure why) good updates (people say this game is going down hill but i think its going in the other direction.",
            "review_score": "1"
        },
        {
            "review_text": "its a great game so fun, sometimes it feels slow and clunky but its a good game listen to a band named sabaton while playing way better game then",
            "review_score": "1"
        },
        {
            "review_text": "Wanna jump outta a plane? Play 16 hours of this and you're there!",
            "review_score": "1"
        },
        {
            "review_text": "I'll probably agree it is pay to win in some degree.  But only if you define pay-to-win as 'pay real money to gain advantage.'  Pay close attention, 'gain advantage' doesnt really guarantee win.  If you enjoy kicking 'pay-to-win' players that doesn't have any FPS skill's ♥♥♥, this game is for you.  But the connection problem is the real issue though, I need to repeatly pressing launch key to get in the fight, on a regular basis...",
            "review_score": "1"
        },
        {
            "review_text": "This game needs some optimising for low end PC (i have GTX960 and i3 6100 16gigs) and thsi game needs better graphics and ofc making the mrket abit cheaper in overall the game is good and as i said it needs optimising for weak computers",
            "review_score": "1"
        },
        {
            "review_text": "Whilst the premise of this game is good. We are being treated like cash cows! everything is about buying more and more Gold!...............God knows how much it might cost to complete this title!",
            "review_score": "1"
        },
        {
            "review_text": "The graphics may not compete with Battlefield, but the gameplay is what battlefield used to be. It can be slower paced and more strategic. This game may not have building destruction but the gun mechanics are very nice and you almost feel like you are in the game. prices for items may be high but thats no big deal. The real time war is a really nice feature with this game to look forward to when you reach rank 10 but it may take a while to get there.  Overall the game is amazing and has tons of potential. with some more maps and some building destruction this game would destroy battlefield.",
            "review_score": "1"
        },
        {
            "review_text": "a good game that lets you learn its like the first Call of Duty landing on that beach off the landing craft was nuts, i like this game as you can develope your avatar is good",
            "review_score": "1"
        },
        {
            "review_text": "If your game has a login que....you need to do better.....login ques these days in gaming is like trying to play call of duty on dial up....just an unwritten rule of 'you dont do it' have servers....something..up the capacity..",
            "review_score": "1"
        },
        {
            "review_text": "Still just as annoying as it was in open beta. At least matchmaking and the graphics are better.",
            "review_score": "1"
        },
        {
            "review_text": "Get Rekt Simulator 2016. Install and die today :D",
            "review_score": "1"
        },
        {
            "review_text": "This game is the very definition of a WW2 FPS. The developers are great and they keep players always wanting more while they deliver. I may not be able to play the game at its full potential cause of my ♥♥♥♥♥♥ ♥♥♥ computer so I canèt say if the game runs well or the graphics are good. But this game is good. The only thing that some players may not like is how there is a big grinding aspect in this game unless you wanna pay micro transactions. But other than that I would recommend this game for anyone.",
            "review_score": "1"
        },
        {
            "review_text": "cool",
            "review_score": "1"
        },
        {
            "review_text": "Ok...  heroes and generals IS a pay to win game, but only for the veteran membership. this membership allows you 2 badge slots, and also a 4th inventory slot. (but noone cares about that) the badge slots allow you to to gain some perks, like faster reloading, and damage resistance. if you do not buy veteran (which only lasts for a maximum of 90 days)*fact checkers welcome*)) you will only get one badge slot, which makes you choose between a faster reload speed or damage resistance, longer sprint duration, etc... and one would argue that you could get the veteran membership using in-game credits, but buying a membership for a short period of time with your hard-earned credits is the dumbest thing you could do with them. i guarentee that you would rather buy something like a lazer gun (mg42) for your nazi, rather than a couple days of an OP loadout, and increased experience/credits.  to summerize the rest of my arguement, this game has me absolutely addicted! i love mowing down countless commies, yankees, or whatever faction you choose to play. the updates are definately not killing this game, the elaphant in the corner of the room (reto.) thinks that having these exclusive 'veteran' features in the game help improve the quality of the game by allowing the dev team to have a salary for their work. And i can completely understand their logic! i would absolutely love to contribute money to this games development, but not if it means that i would have a competative edge over other players. and that is the reason why i have never once purchased gold for anything. i would much rather pay something like $20 for this game if it meant that this p2w system was abolished.   as this game stands, i give it a solid 6/10, primarily due to the pay to win setup, otherwise it would be a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "Heroes and Generals a great game. I have over 1k on record on my old steam account however I have recently lost it. It is a bit of a grind to have fun but once you have a decent weapon it becomes fun. It is much more fun to play with friends though.",
            "review_score": "1"
        },
        {
            "review_text": "I’ve decide to review this game after the last update took place (Garman), because it really improved the game in my opinion. Got about 30+ hours after Garman. I will show you some pros and cons.  Pros:    Free-to-play: of course you grind faster when you pay, but why should you do it if it isn’t necessary. You chose, your time or your money.    Big arsenal of weapons, vehicles, tank, … .    Verity of factions: US, SU, Germany.    Different types of soldiers at each faction: Infantry, recon, tanker, pilot, para’s.    Spawn protection. God thanks!    New maps with bigger capture point. Gotta cap them all!    Amphibious vehicles.    The forum, beside the trollers and some guys complaining about (almost) everything, you have the nice guys who will be pleased to help you out with your problems.    Anti-cheat, report system, …    Nice strategy side of the game (generals side).    Nice graphics    Decent frames per second (could by my computer)    Sounds: guns, walking, breathing, driving, and funny horns.    And many more …   Neutral:    Balance, some say it isn’t balanced, some say it is. Ones you start to play each faction, you will notice that the game is balanced, but that some factions have OP weapons, but hell yeah every faction have some. so it’s not a big deal.    Example: Germans and SU will complain about M1/M2 carbine, will US and SU hates MG42, meanwhile PTRD isn’t loved by Germans and US.    Price of weapons, vehicles, … some things doesn’t seem logic like a handgun that is more expensive than a tank. but comparing a tanker to a infantry just isn’t making any sense. Would you like it if your starter tanker needs to pay +150.000 credits to buy the second tank, hell no!    Aux-seats, lot’s off people don’t use them or just don’t have one due to squad leader and squad member ribbon.    Servers are often down (after updates): they’re down for a reason, to improve! So just wait and see what new goodies they will bring.    Cons:    Price of camo’s they’re pretty expensive, but it’s just a luxury item so no big deal, I would recommend you to safe your gold to but some fancy camo’s.    You could have a long matchmaking queue, when you start to play the game from zero. Ones you go to a higher matchmaking group, this will be solved (bronze, silver, gold). This is more a starter problem.    Squad 2.0: just joking, after all this hours I played with it I couldn’t say anything bad about it.   I probably forgot somethings, but they aren’t that important.  Conclusion: So If you want to play a free-to-play WW2 FPS, I would recommend you to give this one at try. It might be hard in the beginning, but after some hours, you should improve quickly. If you want to improve more quickly, You should find a friend to play with.  Last but not least, sorry for bad English you grammar nerds.   bski   TLDR: nice FPS, just play and have fun. ",
            "review_score": "1"
        },
        {
            "review_text": "Very slow paced at the begining, also reqireing a half decent computer and some knowledge on how to use certain weapons effectively. overall, very fun when you get better weapons and bigger maps to play on.",
            "review_score": "1"
        },
        {
            "review_text": "Heroes and Generals is a World War 2 shooter similar to Battlefield. I have watched people complain about 'Pay 2 Win' my entire playtime, and need to clear a few things up. H&amp;G is NOT Pay 2 Win. i have over 120 hours and have never spent a single penny, at first you will struggle, this is a difficult game. However, i have saw people dominating 60+ with the starter rifle. All weapons have the potential, dont blindly buy the more powerfull upgrades, each upgrade comes with a sacrafice, Higher fire rate = Less accuracy, More damage = greater recoil. Once you reach Rank 5 you will be brought out of the N00b Pool. you will then face against tanks, planes and specialist forces. i suggest getting the American, German and Soviet soldier to level 4, that way you have a rough idea what you are going against before hitting rank 5. the grind, gets easier, your main source of income is your soldier salary, as you rank up this increases. 1 hour of game time give you however much, right now im getting around 20k per hour. upgrades are getting easier to afford. The game is most cetainly not pay to win, the amount of people stating this are the guys who just suck in general. if you want some tips, Kotton Gamer on YT is a good watch, he plays H&amp;G. But dont let the noobs put you off. this is an Epic game, with frequent updates adding new Maps, gear, Bug fixes. the Devs are fairly dedicated. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Love the game. Graphics arent on par with other new games but for free to play i cant get enough of it.",
            "review_score": "1"
        },
        {
            "review_text": "nice gameplay , nice theme too (world war 2) like the old weapons",
            "review_score": "1"
        },
        {
            "review_text": "I love this game overall. Yes it does have some quirks but once you have some friends to play with. Its ALOT of fun! No its not PTW... Just like any other online game like this there will be a membership where you can get extra experience and extra credits after each match. BEWARE though, this game is rage inducing.   The only con about this game I have is that its so easy to get an aim bot. It says it has 'anti-cheat' software but it doesnt work....and this is where the rage comes in. You may get shot with a sub-machine gun from across the map....BUT other than that its alot of fun if you enjoy Multiplayer Shooters",
            "review_score": "1"
        },
        {
            "review_text": "People say this game is Pay to Win. Well, it is, but it was much worse about a year ago. Nowdays it's not that noticable and if you have problems like 'THAT BI*** JUST KILLED ME WITH NO SKILL AND OP GUN THAT IS PAYTOWIN!!!' Then you are almost for sure wrong. All weapons, tanks, and stuff like that can be earned faster that it seems. You just need to decide what you want because if you spend your cradits on random crap and don't focus on something then you will end up running around with starter gear and a few weapon mods that don't make any sense and are useless. As for an example after 20 hours in-game I was going to the battlefield with one-shot sniper rifle, and AP grenades. And what is also important IT IS NOT CS:GO! you can't rush forwards shooting you need to think, if you run into someones trap the you are done even with the most OP machine gun that you just spent 50$.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, but really bad video setting customisation options. Has improved with updates.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game and its a blast to play, i have one reommendation, can you please add controller support? ",
            "review_score": "1"
        },
        {
            "review_text": " Heroes &amp; Generals is a great game.   All these casuals with 1 to 2 hours of the game complaining they don't get everything they want for free right at the start. What do they expect from a free game?   'Starting weapons are not competitive'  I sometimes play with the starter weapons cause they are very good, two hit kills to chest and they are very accurate.   'It takes too long to grind the weapons'  I have 500 hours on the game. Some might consider it alot of playtime, but for me it's mediocre. I nearly have the best tanks and all the most expensive weapons in the game without paying a penny. To the guy who complains that he can't use other classes in the game, it literally takes only 5 hours of gameplay to get any class you want.  Pro tip; Recruit many soldiers and make each soldier a different class, that way you don't have to worry about 'not having' a class anymore.",
            "review_score": "1"
        },
        {
            "review_text": "this game is so grindy but it is worth it i would highly recommoned this game.",
            "review_score": "1"
        },
        {
            "review_text": "Thiefing ♥♥♥♥♥♥♥s won't let me login fom steam. Put money into the game and cannot even get to my account. don't play. Everthing solved and having fun",
            "review_score": "1"
        },
        {
            "review_text": "Knowing Now That the game is alive and updating. As seen in the link at the very bottem. I will reconsider my last review and review this game Again. Hopefully they will balance Prices In game so its not such a Pay to Win like the last review.         YouTube™ Video:  Heroes &amp; Generals – The Ultimate WW2 Game [Launch Trailer]&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": ".",
            "review_score": "1"
        },
        {
            "review_text": "Its quite fun if you are looking for a fast paced shooter however beware of the P2W players and automatics.....",
            "review_score": "1"
        },
        {
            "review_text": "this game is so grindy but it is worth it i would highly recommoned this game.",
            "review_score": "1"
        },
        {
            "review_text": "Omg it used to suck and be P2W but now it's fully viable!  I give it 9/10 needs a bit of optimizing...",
            "review_score": "1"
        },
        {
            "review_text": "It's fun for the price, (Cough) (Cough), It's free so don't complain.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say im really sad to see this game not having very positive views. for a free to play game, this is without a doubt my favorite. I would honestly pay money for it. Not a full 60$ but if it was like 20-15$ it would still be worth it for sure.   The actual FPS part of the game really is alot of fun, different movment style and physics feel different, but really good. The vast amount of guns, vehicles, attatchments, and character classes add an element that i dont feel like any other WW2 shooter has. Good clean gameplay, very impressed. Again, especially for a free to play game.  Now, the one thing i was very confused about was the menu and how the game works, how to get in the game, how to choose characters etc... the menu/loudout screen was very hard to figure out at first. I would higjhly reccommend looking at some community guides before playing. However, once i got the hang of it, it is an easy to use system and i dont really have any complaints about it.   Since it is free to play, my biggest concern about the game was 'is it play to win?'. I can honestly answer, not at all. The game has gold, which you can buy for real money and use that to buy weapons and gear, but you dont have to. It is only a shortcut. You earn an in game curreny called credits and you can use that to buy weapons and gear, etc. Earn it buy playing matches and doing your best. It takes a while to accumilate but nothing a little but of grinding cant fix.  All and all i really really enjoy this game. Feels like a mix of CoD 3 multiplayer, battlefield 2, and a hint of red orchestra. My only critic would be to maybe add more maps and gamemodes in the future to keep gameplay intresting. Very well done! My hat is off to you devs. 4 out of 5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "I don't really recommend this game for people who like to grind but its well worth it. You dont necessarily have to pay to get the best gear and there is pretty good weapon balancing. You also dont come up against experienced players if you are a noob which is an ideal start to easy grinding if you are an experienced fps gamer. The Grinding for the Stg 44 took me all summer and september so it ain't too bad. recommend it to new and experienced players looking for a ww2 game to try. Don't have to enjoy it though. 7/10 the grinding WILL ♥♥♥♥ people off.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing :)",
            "review_score": "1"
        },
        {
            "review_text": "Very nice and friendly game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It's a well made game with a fairly nice community. Unfortunately it's ♥♥♥♥♥♥ HARD!!",
            "review_score": "1"
        },
        {
            "review_text": "so much fun.  it nice casual shooter and is good fun with friends",
            "review_score": "1"
        },
        {
            "review_text": "When i'm browsing the newest games i see all kinds of unrealistic shooters such as Black Ops 3, COD Advanced Warfare etc. But thank god this game showed up, compared to the others, this one's realistic at least",
            "review_score": "1"
        },
        {
            "review_text": "Make items cheaper, and people with veteran are OP Give a better starting weapon",
            "review_score": "1"
        },
        {
            "review_text": "I hate this game.. 1000 hours later.... screams 'LOAD APCR Fegelin ! Time for more hunting !'..",
            "review_score": "1"
        },
        {
            "review_text": "Great game for a f2p",
            "review_score": "1"
        },
        {
            "review_text": "If you don't like CTDs every ~40 minutes, a complete lack of useful communication from teammates, getting teamkilled by bicycles, fighting enemies that will throw every grenade they have at the drop of a hat, being PTRD-41 zerg'd by the Soviets, having inept edgelords lose every single War battle for Germany, being forced to use matchmaking that can queue you for anywhere between 10 seconds to 10 minutes on average, being placed into games with 150+ ping, or grinding your unmentionables off to get anything... I maybe would stay away. It is good, free fun though, when you get passed all the poor design decisions.  If you have friends that are decent in pretty much any shooter, have a VOIP server you can use (no VOIP in game, and there's a char limit for textchat), it's pretty alright. The grind isn't as bad as it used to be, Credit farming can be a pain, but playing the objectives and taking out enemy assets will get you there faster. The inability to edit your loadout midmatch is still something that irritates me, but if your fireteam accounts for most possibilities, it isn't the end of the world if you don't have your own AT weapons or are stuck with an SMG.  'Repairing' your grenades is still one the dumbest things I have ever seen. 6-7/10.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game,but it needs more wepons and vehicles in my opinion",
            "review_score": "1"
        },
        {
            "review_text": "this is a decent ww2 game  you can play as Germany USA and SU  the game needs more factions  it also needs to be more realistic  its free so you might as well try the game out",
            "review_score": "1"
        },
        {
            "review_text": "Lots of Updates, Spawn Killing isnt solved but it has become more playable game , very enjoyable Fps game",
            "review_score": "1"
        },
        {
            "review_text": "played game in early alpha, got a sniper within a day, played it all the time, did good, account got accused of havking and i was banned, comes out on steam, dont tuch it, finally releases, plays it, scope for rifle costs 90000+ credits, 12th rifle ribbon, credit card information, first born child, and half of bodies blood",
            "review_score": "1"
        },
        {
            "review_text": "Fine game for a gaming amateur like me. Graphics are okay, handling great and so on. I play this for fun, not for winning, so for people like me I can recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "great game ",
            "review_score": "1"
        },
        {
            "review_text": "if you love FPS.... download this, it truly is free and not freemium credit card gaming.  most titles who claim to be free to play really gimp their titles to such an extent the game is almost unplayable and forces you to pay real money to unlock stuff.  heroes and generals doesnt do that at all, you really dont have to pay any real money at all since even starting a new account from scratch in a few days for the casual gamer you will be rank 10 and above which means you can now play the elite maps which give more rank and ribbon xp and credits.  you will have more credits than you know what to do with after a week.  the one thing that really stands out for me and that is the ingame sound .... all weapons and vehicles all have their unique sound, even if you can't see where the vehicles are or where you are being shot from and by what.. you can tell exactly where someone is and what weapon it is. use your headphones and crank the volume up and see what i mean...   this title beats many other so called AAA titles in fun gameplay / replayability.  dont miss out .. get this downloaded!",
            "review_score": "1"
        },
        {
            "review_text": "This is a really good game and I highly recommend it to whovever LOVES world war 2 games",
            "review_score": "1"
        },
        {
            "review_text": "really fun game worth downloading",
            "review_score": "1"
        },
        {
            "review_text": "It is a good game but the framerate could be improved for lower down pcs but it is playable in 'General'",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game play took time to learn but really fun",
            "review_score": "1"
        },
        {
            "review_text": "My only complaint is that progress is slow and it takes a good PC to play this game.",
            "review_score": "1"
        },
        {
            "review_text": "my game wont load this is some ♥♥♥♥♥♥♥t",
            "review_score": "1"
        },
        {
            "review_text": "In´s not bad but 60fps looks like 20 with that animations. + fix the servers",
            "review_score": "1"
        },
        {
            "review_text": "Good Game! Very interesting with friends.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesomely fun. Yes, you are weak at first, but you can select the type of fights you will be in, so you can avoid getting thrown in with the tanks and the airplanes. Take the time to learn the options before you trash the game. ;)",
            "review_score": "1"
        },
        {
            "review_text": "Been playing from their early days and the changes from then to now has been big and good. The effort and work they put in this game is why i recommend it. Enjoyed all the hours played.",
            "review_score": "1"
        },
        {
            "review_text": "Eeeh. Lag everywhere",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed this game so far. Play way back since Closed Beta.",
            "review_score": "1"
        },
        {
            "review_text": "This game is Free-to-Play.. Yet I still feel ripped off. :D",
            "review_score": "1"
        },
        {
            "review_text": "Amazing! This game really makes you feel like you are in an actual battle! The graphics are amazing and the best part is that it's free! 9 out of 10! The Mechanics work very well and it's cool that you can evolve and make your way up to becoming a general.",
            "review_score": "1"
        },
        {
            "review_text": "Its my number 1 casual shooter, 3 playable factions, great arsenal of weapons, tanks, planes, cars. Unlocking weapons, profesions and badges gives a greats sense of progresion but also feels very grindy. Unless you pay real money for subscription or weapons, geting anything new (weapons, cars, tanks....) will take forever. Also there is the Generals gameplay where you command army units on the map, but progresing these units and actualy getting them into the play also takes a very long time. So players who cant sink a lot of time into this game will miss out on a lot of its features but besides that its a very fun WW2 shooter. Also very much P2W in a sense that you can simply buy all the best weapons and upgrades at rank 1 while the F2P player will have to play for hundreds of hours to get same things.",
            "review_score": "1"
        },
        {
            "review_text": "Love the game however. I say it looses points for the ability to kick people being in one persons' hands. (Meaning if they have a party of their friends and just want to play with them odds are you are getting kicked.) Also, no controller support; For some reason I expected controller support.",
            "review_score": "1"
        },
        {
            "review_text": "Not the greatest but you could do a lot worse for paying nothing to get a game I guess.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing :)",
            "review_score": "1"
        },
        {
            "review_text": "Great Game 10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "This is a really fun game and its a blast to play, i have one reommendation, can you please add controller support? ",
            "review_score": "1"
        },
        {
            "review_text": "Fine game for a gaming amateur like me. Graphics are okay, handling great and so on. I play this for fun, not for winning, so for people like me I can recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "I have played this game for a long time. I love this game so much and like how the devlopers actually update the game. It is fun to play and is not pay to win though their are micro transactions. I would recomend for people who love planet side and the original call of duty. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game, it is tactical and somewhat pay to win but it is still none the less fun, you can become a sniper, pilot, tank driver, or just be a regulary infrantry. great game to play with friends",
            "review_score": "1"
        },
        {
            "review_text": "The most rage inducing fps i have ever played, yet its so much fun i cant stop playing. if you like games like battlefield, then you should definately give this a shot.",
            "review_score": "1"
        },
        {
            "review_text": "i think heroes and generals is a good game",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun to play together it`s good game !! &lt;3&lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Have many weapons and transport. Playing it for a long time.",
            "review_score": "1"
        },
        {
            "review_text": "Its good but pls the ranking system is broken evry time i go in to a game i only get pros on the other team and they have op weapons !",
            "review_score": "1"
        },
        {
            "review_text": "Since playing this before Steam release, I have had the opportunity to see this game grow and boy has it!  New maps, new weapons, constant tweaks, the works but yet to see game optimization due to it running like a giant potato...  However these are some developers who actually listen to the community not because they want your money but also because they love the game.",
            "review_score": "1"
        },
        {
            "review_text": "I have to say im really sad to see this game not having very positive views. for a free to play game, this is without a doubt my favorite. I would honestly pay money for it. Not a full 60$ but if it was like 20-15$ it would still be worth it for sure.   The actual FPS part of the game really is alot of fun, different movment style and physics feel different, but really good. The vast amount of guns, vehicles, attatchments, and character classes add an element that i dont feel like any other WW2 shooter has. Good clean gameplay, very impressed. Again, especially for a free to play game.  Now, the one thing i was very confused about was the menu and how the game works, how to get in the game, how to choose characters etc... the menu/loudout screen was very hard to figure out at first. I would higjhly reccommend looking at some community guides before playing. However, once i got the hang of it, it is an easy to use system and i dont really have any complaints about it.   Since it is free to play, my biggest concern about the game was 'is it play to win?'. I can honestly answer, not at all. The game has gold, which you can buy for real money and use that to buy weapons and gear, but you dont have to. It is only a shortcut. You earn an in game curreny called credits and you can use that to buy weapons and gear, etc. Earn it buy playing matches and doing your best. It takes a while to accumilate but nothing a little but of grinding cant fix.  All and all i really really enjoy this game. Feels like a mix of CoD 3 multiplayer, battlefield 2, and a hint of red orchestra. My only critic would be to maybe add more maps and gamemodes in the future to keep gameplay intresting. Very well done! My hat is off to you devs. 4 out of 5 stars.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay isn't bad but the Grind to level up and get credits is horrible...",
            "review_score": "1"
        },
        {
            "review_text": "pay 2 win game.To an extent but not as much as i thought good game",
            "review_score": "1"
        },
        {
            "review_text": "short review: its good...",
            "review_score": "1"
        },
        {
            "review_text": "You can ride a bike into war.",
            "review_score": "1"
        },
        {
            "review_text": "Yes it's a free to play game, yes you have to grind till your ♥♥♥♥ falls off, yes everything is really expensive but if you invest the minimum amount of money into the game it will be easier. Also it's a game that rewards you for more playing, more playing means higher rank, higher rank means rewards and higher pay, higher pay means less time spent grinding away. The one thing I do recommend is fix the cheating system.",
            "review_score": "1"
        },
        {
            "review_text": "To start off, I've played hundreds of other games that are similar to this one, and this is in the top 5. This game becomes the most fun after getting out of the infantry. I would highly reccomend this to anyone, because of its mechanics, team play, and the fun you have with a group. Take my word for it, this is well worth the download",
            "review_score": "1"
        },
        {
            "review_text": "Just a great WW2 fps shooter game , with a lot of diversity in it...",
            "review_score": "1"
        },
        {
            "review_text": "i like the game i wish the ywould make the coust for ranks cheaper",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy madness and chaos and the fun of WW2 combat this game is for you.  I would give this game a 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "By far one of the best free FPS games on the market with an amazing progression system, and the best part being seeing your friends ragdoll body fly out of the map.",
            "review_score": "1"
        },
        {
            "review_text": "add some sort of character customization like gas masks and slightly different uniforms, like for germans they had multiple types of uniforms for different reasons, add that into the game and that would make it more interesting to play because everyone looking the same with different colours is pretty boring, like VERY boring, lets say the Splatter mask used for face protection but that was kind of ww1, you make the games, you improve the games, do this and there will be something to work forward to. it gets pretty boring to play sometimes",
            "review_score": "1"
        },
        {
            "review_text": "Just absolutely fun to play!",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome the graphics are amazing, i will recommend it to other people who enjoy 1st person ww2 games.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game love the graphics, the choices (of tanks guns and so on) and the maps. Hardley any glitches ( apart from floating tanks on hills). Maybe could add a British nation to select( I would love that :) ). Plane of Britain: Spitfire. Tanks of Britain: Light: Cromwell, Crusader, Meduim: Matilda, Meduim 3 M3 grant Heavy : Churchill 1 , Carnavern Tank Destroyer: Tortoise , Achillis . Please consider this as I will like to play as the British forces. Many thanks, Player of Heroes and Genrals",
            "review_score": "1"
        },
        {
            "review_text": "Grab your mosin, grab your vodka and have fun",
            "review_score": "1"
        },
        {
            "review_text": "A game within a game. Day of Defeat means Risk!. Hours of game play, Pay to lazy, not a pay to win. This is my go to FPS game!",
            "review_score": "1"
        },
        {
            "review_text": "I have almost 400 hours of in battle play time with this game. I really enjoy the different vehcles, weapons, and large maps. Many inprovment could be made though such as more planes, larger battles (more people), and maybe some new spawn machanics. There is a large variety of things that happen in each battle depending on the amount of players, how many tanks, planes, recon, or reagular infantry, and more. Overall it is a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing WW2 fps game :D",
            "review_score": "1"
        },
        {
            "review_text": "Not for the faint of heart.  ...member your best FPS moments? This will make more memberries for you.  Does not deserve the (67%) review it's getting at all. I think, they are the salt left behind by kids, who wanted to be men. The tears of boys who realized they wanted to go back home..  If you're looking for a rewarding/addicting FPS challenge constantly being maintained and updated. with great realism, mechanics and gameplay and have time to play, or a few bucks to spare..  Nobody is going to hold your hand from here on out, soldier, who knows, maybe you'll become a hero, and influence the war or maybe you won't be good enough and leave a bad review. Either way, Unless you have a bucket under that chair, I'd keep scrolling :-)",
            "review_score": "1"
        },
        {
            "review_text": "I nominated for 'Best use of a farm animal'.... why? Because you can use a cow as cover!",
            "review_score": "1"
        },
        {
            "review_text": "no its not hard.",
            "review_score": "1"
        },
        {
            "review_text": "Issues matchmaking and long load times but all around good game.",
            "review_score": "1"
        },
        {
            "review_text": "i love it but the guns are ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "good fun. could be better for match/squad finding.",
            "review_score": "1"
        },
        {
            "review_text": "wery nice game :) &lt;3 ",
            "review_score": "1"
        },
        {
            "review_text": "+ Fun to play + Many weapons + Many in-game career possibilities (tank crewman, recon....) + After some recent changes, rank grinding is not so hard anymore + It's FREE   - Weapons are expensive. Usually you unlock many weapons quite fast, but don't have money to buy any of them... - Graphics aren't anything spectacular, but they're not bad! Remember,H&amp;G is free! - In my opinion, this game lacks some realism. Vehicles just explode and disappear when they get destroyed, ALL tanks (even those with 100+mm guns) shoot extremely fast (reload times are lower than 7 secs), you can shoot machine guns while you are standing as if they were normal SMGs...  ",
            "review_score": "1"
        },
        {
            "review_text": "10/10 the most fun game I evered played and its free",
            "review_score": "1"
        },
        {
            "review_text": "I like the size of the maps. Flanking unsuspecting enemies never gets old.",
            "review_score": "1"
        },
        {
            "review_text": "AMERICANS, GERMANS AND RUSKIES ONE FIGHT EACH OTHER  WHAT MORE CAN YOU ASK FROM A GAME ???",
            "review_score": "1"
        },
        {
            "review_text": "I rate the game a 7/10.   It's free, you can play and do great without paying a dime. The grind can be intense, but it is worth it. I played for over a year without ever paying and loved the game. The membership is worth it, but it is not balance breaking.  Reto has a good game. The best game? No. Good? Yes. The updates bring new stuff every few weeks. There are some broken weapons/forgotten weapons that the devs ignore.   The matchmaker is trash. You can end up in a game with 5 enemy planes vs 1 friendly plane. You can end up with 14 snipers and 3 infantry. It's a mess.   There are tons of guns and tanks to choose from. There is always something to do.   I suggest trying the game.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game, but teamates love to run you over with their vehicles all the time. Combat is great, but not when you get run over by your squads cargo truck. The cooperation in this game is amazing. Except when teamates run over your body when you want to be picked up. Whistling is a great feature. It attracts all kinds of people. Yet when you whistle in this game instead of someone stopping, your teamates decide to run you over. All together my 'squad' brutally destroyed my ragdoll body across the map seven consecutive times. They don't always just run me over. The last time I was just trying to unlock a vehicle and my 'teamate' decided to launch my crouching lifeless body into the air. But they also run other squad members over aswell when they leave his truck because they fear for their lives. This individual decided to run over mulitple teamates for the 'hell of it' because thats how he rolls. #NotFunAnymore.",
            "review_score": "1"
        },
        {
            "review_text": "Fun takes a second to get used to.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Get it now before they start charging for it!!. Very good WW2 FPS 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Nov 11 , 3:18am  Sadly , whenever I start the game with steam , it says ' Server Down For Maintenance ' . Fix this problem -_- _ _ _  Dec 17 , 4:41 pm   The game now works after the update . After a long time, I can now open the game from steam rather than the browser .",
            "review_score": "1"
        },
        {
            "review_text": "If you're not grinding your paying. If they are dominating you, get better and punch them in the face with SI weaponry. I do it all the time. Be that ♥♥♥♥♥♥♥ that destroys the ''noob-killer''.",
            "review_score": "1"
        },
        {
            "review_text": "Yet another edit : THIS GAME , IS ANNOYING . One update breaks everything , another fixes it and then another one breaks it and finally this update fixes it . The game is more balanced , still some problems , but enjoyable . The weapons have been fixed , soo i guess it is good .... for now ? .I say this game is good , for now",
            "review_score": "1"
        },
        {
            "review_text": "This game have improved alot. I love it more than the past. I really recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Anti-cheat policy is an empty bag of wind : - no automatic system; - no manual reaction even when cheats are obviously used in game.  It is now more than 2 years I'm playing this game (1447 hours in battles, more than 4000 h connected, Steam and web browser) and the problem is becoming more and more sensitive. I'm fed up!!!!  La politique d'anti-triche est du vent: - pas d'outil automatique; - pas de réaction aux dénonciations en jeu, malgré l'utilitaire intégré dans les parties.  Après 1447 heures en batailles du jeu (j'ai rejoint il y a deux ans, soit 4000h sous Steam et en Stand-alone), j'en ai marre!",
            "review_score": "-1"
        },
        {
            "review_text": "How to get rid of your 80% negative reviews: get the game out of beta.   You have to repair your grenades.   When the game came to steam they didn't bring content first, they came up with the P2W crap so you could pay for this unfinished java crap.   They banned people ingame because they talked to much on reddit about the bad balance and crappy development. And again, they came out of beta just to trick people, so that their 'very negative' status was gone, just for a while anyways.   Well played Reto, well played.",
            "review_score": "-1"
        },
        {
            "review_text": "I somewhat enjoyed this game, a little, simply because it fulfills a kind of niche no other game has filled for me in quite some time, that's probably the only reason I kept playing as long as I did. however this game is also extremely frustrating as it is full of glaring balance issues and has a run away monetization system that absolutely ruins the entire game and any fun you might have had as soon as you reach the 'gold' tier of matchmaking.  Once you get into Gold Tier matchmaking all enjoyment your first ten hours gave you is going to leave instantly unless you are an extremely patient person or really enjoy this type of gameplay, you will from then on be matchmade with people with weapons twice as powerful as your own. People in tanks and planes which you have no good counter to and snipers that can one hit you with a bodyshot which is ridiculous, the rifles should do 99 damage maximum with a headshot needing to score you the one hit kill. This game isn't CoD and a rifle shouldn't one hit kill someone to the torso up to the distances that they do in this game but this is only one of the many glaring balance issues facing new players.  The base weapons when you buy them  should not  be half as powerful as the same weapons but with upgrades leaving you at a distinct disadvantage to those who have spent more time in the game than you, or someone who has thrown money at the game. The fact a game with this much potential is being held back by what seems to be blatant greediness by the developer is a real shame. You can really feel a good game under all this somewhere but this game's monetization model absolutely and completely ruins it. If you've ever played Planetside 2 you know what to expect from this game, fork over the cash or be at a disadvantage forever. Actually the thing Planetside 2 has going over this is in Planetside 2 you don't have to pay free credits to repair your weapons, a system that absolutely goes to show just how greedy the devs are.  I'm going to give an example of what you can expect as a free player with no intention to pay money, or if you are someone without access to a means to pay for things.  I saved up to get the Mosin Nagant because I wanted to be a bolt action infantryman as semi-autos are really not to my taste, I buy it only to find it does around 50 damage a shot, thus far it has taken me about 5 hours of gameplay with a lot of matches where I have done insanely well and I still have not unlocked any of the upgrades which increase it's damage meaning I have been stuck playing at a serious disadvantage and at the rate I get the free currency even when I do unlock the upgrade, I will not be able to afford them for quite some time.  I am left using a bolt action rifle with iron sights, that does 50 damage a shot while the majority of others in the game have rifles that kill in one shot to the torso or have semi-automatic rifles that do 75 damage a shot or sub machine guns that mow you down without you having even a remote chance at fighting back.  Oh and the pistols cost a stupidly high amount of the credits so don't think you'll be having a backup sidearm any time soon.  Do not play this game unless you enjoy grinding or are willing to fork over some cash to get onto the level of everyone else.",
            "review_score": "-1"
        },
        {
            "review_text": "Too much grind.  If you want to have sniper either you play for a years straight without speding coins (which is impossible due to repairs) to unlock the class, the weapon, the modifications, etc.. or you pay 30$ for it instantly(like most of the people do)   Not really a pay2win but really a pay4fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Wait - Spawn - Run - Die Simulator 2016. - 10/10 IGN  Seriously though, what a load of crap. The only reason I've put 40 hours into this game is because of the damn progression addiction and ranks. All I see are try-hards with LMG's named Get Rekt Nab or I love Adolf.  So yeah if you would like a game where you spawn and in the space of 10 seconds you get bombed by a plane, blown up by a tank, sniped by a recon, run over by a jeep or 2 shotted by a camper with an LMG then by all means give it a play.",
            "review_score": "-1"
        },
        {
            "review_text": "(I HAVE RESUMED PLAYING THE STEAM VERSION)  This game has the potential to be something great, it really does. Unfortunately that potential is wasted.  The balance in this game is ♥♥♥♥ poor, mostly early on when you are just starting off. For tanks it is painful, especially for Germany as you can be fighting light tanks from 1944 while driving a tankette from 1934, a full decade behind. Tanks with machineguns should only be fighting tanks with machineguns, otherwise they are ♥♥♥♥♥♥♥ useless. Even later tanks are pretty badly up tiered, with an M3 Lee, a tank from 1941 that only lasted until 1942 because it was obsolete the moment it was put into service, is fighting Panthers, T-34-85s and other tanks from 1944. Low tier tanks mostly involves being seal clubbed, that's all it is until you get lucky and fight stuff on your level or get a better tank.   The grind is hilariously bad, you need to put in twice the time to get ANYWHERE in terms of progression with equipment, and most of that as stated before is just getting seal clubbed a whole lot. Credit income is VERY low and you have to pay for ammo and repairs for vehicles and weapons alike so that just makes it worse along with the RIDICULOUS prices of stuff you need to buy. You pretty much HAVE to buy veteran membership to progress without grinding for days on end, and that costs a lot of money. From what I have been hearing some people have been getting banned for 'cheating', when it's just a broken ♥♥♥ anti-cheat system or a scam so people will make a new account and spend money on it to progress.  Short version, this game is terribly imbalanced and the devs need to get their ♥♥♥♥ together and fix it becuase it's not getting any better. Go ahead and try it, first few hours in you will realise how painful the grind is from the bottom. I'm not saying not to try this game, do try it, it has great potential and can be quite enjoyable at times, it just becomes painful to play rather quickly if you dont advance or get uptiered.",
            "review_score": "-1"
        },
        {
            "review_text": "Conceptually:  Amazing war simulator with a fairly good strategy element to it as well as a decent focus on team play to take objectives. Classes of soilder are pretty awesome and fairly well balanced when everything comes together properly, couple snipers, some tankers, plenty of infantry, a few paratroopers, and a general heading the team. The period accurate weapons function exactly how you'd hope, innaccuarcy and all which can add to the feel of the game. The potentional for full war campaigns between the different nations present offers limitless battle possibilties.  Reality:  Teams generally end up unbalanced with your tanker being level one and having a crappy tank that gets one shot by the enemies max rank god tier vehicle which can also make things worse when just starting out in any class other than infantry. You end up just constantly losing over and over again to people who you really have no chance of beating no matter how good you are and then you level up at a snails pace but even after you get there you'll never earn enough credits to actually buy the stuff you need (credit costs for anything are insane and then they even threw in repairs). Yes your vehicles should be stronger the higher up you go, no you shouldn't be matching veterans with basically brand new players, especially when your equipment actually makes a noticable difference in your ability to play and when the servers are so unbelievably overloaded that there are 4k man queue times just to log in this kind of tier mixing shouldn't be happening.  While I'm talking about the servers being overloaded, I should also mention they're complete crap...sometimes. As in every match you get into its a complete roll of the dice as to if your 5 ping actually means anything. With a constant 120 fps and an average of 10 ping I can barely move half the time because I'm getting ruberbanned left and right and even if I play sniper and just crouch down somewhere my targets are just warping everywhere so I still can't do anything. There have been multiple requests by the playerbase to prevent matching us into games where this is going to happen which would also level out the teams and possibly boost the community and overall player experience but these pleas seem to fall entirely on deaf ears.  Overall: No, I can't recommend it because I simply can't see anyone really enjoying this game with its numerous problems. I know you see the good reviews scattered around but those people are, quite honestly, just lucky. They don't get placed in the games where suddenly nothing you do matters and everything is just going to warp around regardless of your connection. They don't get the games where your entire team is gimped with starter level players against a team of seasoned veterans. For most of us, at least half the time, we get into a horrible game with no chance of winning and barely an ability to move around just to try and at least enjoy our loss.",
            "review_score": "-1"
        },
        {
            "review_text": "The development of the game is only terrible. It is obviously accepted that russian hackers are tolerated. Many pictures as well as videos were made documenting this unfair playing. It is ironic that during start of game it shows you a 'anti cheat cheking software'.   Russina clans like 'Red alert' exists of a majority of players definitely using hacks regularly. A so well designed game gets destroyed by stupid management.  Balancing between fractions is no more existing. axis was nerved over the hole line. russians are able to kill vehicles with ptrd with 1 shot whil others even with tanks needs 2 shots. As you can see realism is also no more given.  I just can recommend nor to waste time or money in this game any more!  Regards,",
            "review_score": "-1"
        },
        {
            "review_text": "Heroes &amp; Generals has great audio. That's pretty much the only thing about it that is not unbelievably bad. I'm at a loss to explain how anyone, anywhere, can recommend this game to anybody. It's horribly unbalanced, the UI is awful, the weapons cost an unreasonable amount of in-game money (and real money, come to think of it) and of course subscribers get advantages over plebs in a PvP game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I have 35 hours flight time, over 1500 kills, I consistantly dominate the leader board and try to teach new players how to be a pilot since before the latest 'warbirds and tail gunners update'. I have mastered flying in this game and I can tell you 100% that it is FUBAR. this game is now only about letting the old players shame and dominate the new players. I know i'm guilty of it my self. IF you play this game some one like me is going to dominate you and laugh the entire time. If you were a pilot chances are you've probably just quit. This new flight model is rediculous, If you hold control W (accelerate) immediately becomes your nose down dive into death button. same with shift. This was my favorite get away game and after this last update i'm uninstalling.",
            "review_score": "-1"
        },
        {
            "review_text": "128 hour grind to get to Elite level without paying for anything = Fun  Now it's basically bring a tank or die, the fun has gone :(  Great fun starting off at low levels but as soon as you're matched with higher players it becomes a tank battle.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, played it with friends and solo a bit. A real war game with good physics and stuff in it. I noticed that the matchmaking is kinda bad and u get in games where people have way better loadouts then u and sometimes its a 5vs14. Its in my experience also a kinda pay to win game, and everything cost way to freaking much ingame. U bearly make any money ingame from matches and when u make some stuff cost way to much.  END OPINION: Its a fun game for solo or friends, u do have to deal with some stuff butt there is nothing to do about it.  RATE: 7/10    DATE 2-10-2016  Just as my last review this one is also gonna be criticizing the game. It got some new updated and stuff. Tried it out with my friends. It simply said sucks, i dont say about alot of games this but this one is the worst i have played in a while. The games take whay to long u get spawn camped by everything and enemys have tanks snipers cars and all we had where cars and bikes all game. This game is so bad and so complicated i rather play COD. This game has every aspect to blow ♥♥♥ and its doing a great at sucking. I dont care if the devs will ban me after this review but the game sucks ♥♥♥♥.  Score: 1/1",
            "review_score": "-1"
        },
        {
            "review_text": "Tried this game again and brooded over the mechanical issues besides the horrible execution of the pay system. (Seven American dollars for a semi-auto sniper or a month of grinding on a normal healthy one hour of play a day give or take)  The ironsights are at least four feet from your soldier's face, making the only reason to actually pull to aim the accuracy bonus you get in the RNG rather than any player aim. Additionally you'll get frustrating cases of running across half the battlefield to get to the fight. If you die after fourty seconds of fighting, you spend the next two minutes walking back to where to fight. And if you factor in that sometimes the other team will have a sniper on a hill half a KLK away outside of the five foot high detail draw distance regardless of rig. You spend more than that time away from having any fun.  They also can't balance armor. SU-76 came out and has been already sold off as a cheaper, weaker version of other tank destroyers. Even though the gun on it should be scaled the same as the T-34 with more accuracy they failed to do so.  Recon is irrelevent because in map games no recon divisions exist from the generals. Completely useless branch unless you exclusively play on normal matchmaking.  They also appear to have a lackluster matchmaking system, frequently having a match with strong seasoned players bouncing on top of the heads of unskilled players. A small portion of the fault going to the playerbase itself since the good players seem to gravitate to the German faction for one reason or another (False sense of superiority I suppose)  The map wars are usually pretty uneventful. Not even worth paying attention to them really, it's the same story with slightly different preformances. Wehrmacht player stack Italy with thousands of thousands of troops on the chockpoints and Abandon Berlin to the race between Russia and the Allies. Then night hours roll around and the Russian faction who is populated by mostly Russian players come online, pressure, then either they win in that time or they log off and the North American players log on, butt heads, kill Russia, and the US or Germany wins. Usually depends on who killed Russia.   TL:DR, it's all honestly just a blob of outdated ideas and more of a game about walking from point A to point B without getting shot with false depth and false ironsights that don't exist.",
            "review_score": "-1"
        },
        {
            "review_text": "Unbalanced, P2W and a big grind fest.",
            "review_score": "-1"
        },
        {
            "review_text": "This game used to be really good, and even though it was hacked out, the game makers claimed it couldnt be hacked, and now with the new update the first thing to load is the anti-cheat function, go figure, guess it couldnt be done. This game is full of WALLHAX AimBot users and truly most of the time is a waste. Looks better than ever with the newer update, but has even more of the bs for yet another fps online hacked multiplayer game. The H&amp;G game makers need to fix it once and for all. Fun if you can get into a clean game, otherwise a waste.",
            "review_score": "-1"
        },
        {
            "review_text": "This game ain't worth for playing anymore. It used to have a great potential and was really enjoying for long time. The updates realeased during 2016 made the game worse and eventually broke it so badly it's barely playable. I have spent 2614 hours in it so I know what I'm talking about.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is almost unplayable, you'll get killed 30 times before seeing the first enemy, and what about that fog?, you can't see anything. Maps are too big, you have to walk a minute from spawn to get to a battlezone only to be killed by invisible enemies in 3 seconds, everyone seems able to see you but you can't see anyone, it's just too difficult for beginners, as much as I love the idea of a ww2 free to play shooter, this game is a failure.",
            "review_score": "-1"
        },
        {
            "review_text": "The new update has done nothing to fix the proplems that continue to presist with H&amp;Gs. PTRD nerfs is berraly recognizable and it's effectiveness at shooting down new planes is astonishing. The Russians don't even need AA because of the PTRD. Further more the new plane controls are 'easier'...but not any better then before, and planes in general are still a USELESS resource that contributes NOTHING to battles. I litteraly took a fighter pilot spot for nothing since the game was on the ground and I died more from PTRDs then to any russian pilot...it's absurd and needs a actual nerf...AKA make it realistic. Force the PTRD as a prone weapon only...realisticly you would no longer have a shoulder to shoulder if it was fired from ANYTHING but prone...not shooting it at slow planes that have NOTHING to defend against it. Another horrid update that brings so much but hardly brings anything at all to the table. I'll go back to my cave and count my unspent gold as I wait for something good to happen.",
            "review_score": "-1"
        },
        {
            "review_text": "plays first game leader kicks me rages uninstall heroes &amp; generals plays minecraft",
            "review_score": "-1"
        },
        {
            "review_text": "49% of players are snipers, 49% are tankers, and the remaining 2% are all the other roles.",
            "review_score": "-1"
        },
        {
            "review_text": "Alright, a little disclaimer first. I'm not gonna bash on H&amp;G. It's a pretty decent game however later I'll discuss why I wouldn't recommend it.  Positive aspects of H&amp;G: + 'FREE' + Great Visuals for a non-3A title. + Good customisation. + Decent Gameplay  So here are the negative: - *bad* perfomance and bad graphical customisation - Weird UI and Menus  Most important for me - Really focuses on in-game purchases. It's really difficult to unlock certain weapons and it'll take you a LOT of time. Therefore there is a payment system which i don't think is worth it.  ",
            "review_score": "-1"
        },
        {
            "review_text": "You have to repair a ♥♥♥♥ing grenade.",
            "review_score": "-1"
        },
        {
            "review_text": "well first of all it has billions of bugs and glitches which makes this game just unfair and so on. the game is a total arcade, nothing to do with wwII, it has guns that can shoot down tanks, kill cars in one hit, king tigers go down to 3 sticky anti tank grenades, physics in the game feels like you are on a moon, basicly, NEVER spend money on this, its a game made to rip you off. when in forums the community cries for 2 years, they maybe fix it. the only new thing coming in this game is stuff you need to buy. instead to fix sound glitches they will add a camoflage to your car, so you can buy it. i have 760 hours playing it, believing they will make it better, but its not happening, evry new update has given me less fps and so on... long story short, game is dumb and you get dumber playing it, thats about it.",
            "review_score": "-1"
        },
        {
            "review_text": "I swear this game has so much potential, however there are many things that are broken. Case in point, leveling system. It's a total grind fest. Want to do something other than fire a M1 Grand into the distance at everyone? Well, good luck being a newbie. Better start playing and gttin guud n00b... Plus should I even mention there's no tutorial at all? Just throws you into the game and hope you figure it out. Plus, I like the idea of squads like in Battlefield games however it kinda forces you to be put into one before you find a game (which takes a few minutes each time) then youre thrown into the midst of battle. I will give it to the game the battle system is fun and all it's just not exactly fun after a few times if you start out with everyone shooting single shot rifles everywhere. Which now brings me to another pet peeve of mine, the game LOVES to shoot me in and out of games just because a squad needs one more person or it constantly switches from fullscreen to windowed mode.... which the settings dont really help with. Plus theres no REAL control interface where you can change settings aside from volume and resolution.  TL:DR the game is okay at best, TONS of potential and CAN be fun (if you pay to get everything...) just with the shotty leveling grind fest worse than any MMORPG and no REAL replayability (let alone the annoying configuration, lack of tutorial, and the annoying jump cuts for squads and kicking me out of games into new groups for NO rhyme or reason or warning)",
            "review_score": "-1"
        },
        {
            "review_text": "FIX THE DAMNNNNNNNNNNNN MATCHMAKING   played 2 days and already in the gold tier matchmaking which is impossible to even play.  ",
            "review_score": "-1"
        },
        {
            "review_text": "I'll reiterate the highlights of what I read in other posts, since I like the idea of the game, and if it could be balanced, it would be really fun. The game has real potential, but the grind is abysmal (especially eqpmt repair costs??). It stopped being fun when I ranked up to 'gold group' matchmaking, which put me against all the long-time vets and their crazy equipment after about 10 hours of gameplay. Basically cannon fodder. I get that it's free-to-play and you buy into benefits, but it's horribly unbalanced right now.   TL;DR: could be awesome, but matchmaking for newcomers after about 10 hrs of play is broken, and ridiculous grind is ridiculous.",
            "review_score": "-1"
        },
        {
            "review_text": "If you are looking for good tank combat experience then look further because you will find none here.",
            "review_score": "-1"
        },
        {
            "review_text": "Still better then No Man's Sky",
            "review_score": "-1"
        },
        {
            "review_text": "this games was better in the beta they should fix the long loading time",
            "review_score": "-1"
        },
        {
            "review_text": "Run run run&gt;shot by sniper&gt;respawn&gt;run run run&gt;shot by sniper&gt;respawn&gt;repeat. So yeah who thought having big maps and no vehicles other than rare ♥♥♥♥♥♥ bicycles for new players was a good idea? Fire them.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a game i'd like to give a 'neutral' review, as there is definitely the foundations of a great game here, but the combination of the truly biblical grind for any fun gear and the ♥♥♥♥♥♥♥ GOLD TIER MATCHMAKING the game throws you in if you have more than ~10 hours meant i've mostly given up for now. Suddenly facing T-34's, fighter planes and terrifyingly skilled paratropers with ppsh-41's makes me feel like an AI in someone elses shooter.  A gentler entry system for new players where we could be introduced to armor and aerial elements would be nice, as would a more cohesive organisiation system so I actually know what to do rather than being left to fend for myself versus the pro platoon.  A possible solution here would be to remove the F2P element and charge £20-25 up front, but at the moment the game is crippled by the grind meaning that I can't motivate myself to work for any good stuff, when that might be tens if not hundreds of hours away.  Seems like the core of a really solid world war 2 shooter is already here, but at the moment there really is more bad than good . My recommendation for the time being would be to play until level 8 and then stop, because until that point the game is great fun, followed by dive bombers and despair.",
            "review_score": "-1"
        },
        {
            "review_text": "Farmfest.  It's frustating to play a game that throws you into matches against vehicles and airplanes that camp and farm to the end of times. The progression is reeeally slow, the gameplay would be fun but the downtime is too long: when you get killed (and it will happen a lot since a couple of upgraded rifles 1shot you) you will respawn either inside a friendly vehicle parked close to the enemy base or you will have to run the infinite plains of boredom only to get sniped as you run or bombed by an airplane. In conclusion i'm very disappointed. Could be a great game but for now it's only a boring rage fueler",
            "review_score": "-1"
        },
        {
            "review_text": "ok so lets get started this game has a very 'unique' game play, when ever your close to the wall you cant shoot, its like when you die the game says stuff you and sends you back to the beginning almost, or if your lucky a guy on a bike has a spare seat for you so you spawn there only to discover he was a bad player and gives your possition away, so you are screwed with a massive INVINCIBLE tank up your ♥♥♥ taking random shots trying to kill you. rapid fire weapons are way to op when clearing out places and are way too hard to get as with each game you get around 10xp (dont really know much) and get little to no coinage out of it, so getting high weapons is a challenge. this game had many bugs 1. the icons block your enemies at some points 2. you can barely ever see your enemies 3. somehow you get shot with the first weaopn that you get right in the head with no knowlage of anyone being near your area 3. pretty sure there are cheats 4.like how the weaponry (vehicles that can shoot down other vehicles) are so bad thet you cant even see the enemy plane/(havent played much so i dont know the rest) 4. que time takes way too long unless your with a part of 3 wich is not enough at all like 5 would make it good but no ;)   so yeah most of the mechanics do not make sense DO NOT RECOMMEND if you are a highly skilled fps player such as cod or modern warfare or csgo",
            "review_score": "-1"
        },
        {
            "review_text": "Are you tired of getting killed by those pesky enemy snipers? Here's what you gotta do. Take your bicycle and ride it downhill, look for an enemy sniper and run into him at full speed, and have a laugh as his corpse flies through the air.  Now, for the serious &amp; detailed part of the review  Pros (What I liked in Heroes &amp; Generals) + Free to play (duh) + Good camouflage mechanics + Infantry, tanks and aircraft fight together + Combination of a first-person shooter and strategy game  Cons (What I disliked in Heroes &amp; Generals) - Long queue times - Matches that end a second after you joined - 'Balanced' matchmaking pits a team of stock riflemen against a team of heavy tanks and snipers with upgraded one-hit kill rifles - Vehicles use health bars - Lack of variety in some vehicles. e.g. each faction has only one type of attack plane, and the one available to America is the P-38 which looks and handles more like a cargo plane than a fighter. - The grindfest - If you changed your role, it costs to downgrade it back to rifleman if you found out that the role is not your thing. You won't get refunded either - If you want to own several soldiers with different roles, you have to buy new soldiers and do all the grinding for each individual soldier - Lack of World War atmosphere: There's no voice acting at all, other than the soldiers' faint grunts when they get hurt",
            "review_score": "-1"
        },
        {
            "review_text": "why? LMG Just Why every soldier have lmg? its not even logical if you think about war just wtf?  I dont mind getting killed by players who paid for better guns. But it feels like bs when you see everybody uses lmg I just dont get it. İf this game is all about auto rifles then its a BİG NO FOR ME  its have to be limited or something like that maybe less ammo.   One shot snipers are ok tanks are ok planes are ok but every soldier has lmg really ? in which war something like that happened tell me? an army with full of lmgs oooh cool idea ......",
            "review_score": "-1"
        },
        {
            "review_text": "to pay to win i cant get anything without forking over $20 or playing for 5 hours and you will get destroyed by people who have or are A: given the game $400 to make your life a living hell with wepones you can't get or B: shoot someone 3 times in the back and they shoot you once your dead ( doen't matter what gun you or he has this will always happen) or C get killed out of nowhere by someone you didn't even know (and no way of knowing he is there) and yea it is a one shot",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay is not bad but the fps and graphics are ♥♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "A short and breve introduction for those new guys who wants to play this game ;-) enjoy   there're 2 types of victory in game :  1. Your team had successfully captured all your enemy team's victory point (which is a targeted alphabet marked with a star )  2. Your team had successfully exhausted all your enemy team's resources , like men , tanks , planes , vehicles , they all have a certain number at start and when it's all used , you can no longer use it .  there're 5 types of units you can choose to play in battlefield :  1. Infantry , the basic of all army , can carry all kind of weapons and purchase vehicle like jeep or motobike as a mobile depolyment base , taking AA gun or buy AA truck to shoot down the plane , using RPG destroy armor , slaugthering you enemy with SMG/LMG or anti-snipering your foe with rifle and a scope... learn how to use it , and let it bring you glory and victory .   *Although as a new player you could be killed by nearly everyone you can see .  2.Paratropper , assault squade , born in air and out from plane , can depoly to anywhere you want , but remember its an easy target and everyone can see you before you successfuly landed on the ground . usually got only one object : kill everyone you see in the victory point zone or die try it .  *Sometimes you may be killed while falling , but at least you can still redepoly to your carrier plane -----because sometimes , your team's carrier plane could be all killed by enemy pilot , then you can no longer jump and will be removed from the game.  3. Tankcrew , of course you're imaging a fortress , a fierce beast , an unstoppable tiger tank , but stop it . veterans have ten thousands ways to ruin your tank but they usually use one : take a moto or jeep to your side , throw some sticky mine or AT grenade and you can say goodbye to this world while he resupply his ammo by using the ammo crate behind his car or bike and start a journey to another poor guys in another iron coffin . pray not to meet soviet soilders on the battle field , they are all the experts on this .  *dont forget the planes , their bombs are lethal to you as well as enemy Tank Destoryers .  4.Recon squade , light infantry , head hunter , the best and easiest to earn money ,only one thing , dont try to push the line with your armor car , you may think its something swift and cool even with pretty good firepower but hell no , everytime i see it in my canno scope I can take it in one round of shot . so unless you like trekking and flanking and can always appear from enemy's behind , then better drive it away from people and ambushing enemy within the cover of forest .  5.Pilot and its plane are the worst part of this game . You can wasted your hundred hours before becoming the master of the sky , then get reported by all the otherone . If you want to know why , it simply because there's only handful ppl who can plays the plane very well , and their score will easily become 3~4 times more than the guy behind him .   It is too hard for me to endure such a incomplete air battle system after played some real good WW2 air battle like War of Thunder or IL-2 Sturmovik: Birds of Prey , but if you dont want to see this 'masterpiece' you can only play infantry men , otherwise you can only prey that your opponet pilot are not that good to slaughter all of you .  this part is the only reason why I want to uninstal the game , it is too shocking and amazing that I dont even know how to describe further ,   As for the General , it will took you some months' salary to purchase ,and after that you'll have to buy some troops with your own warfund and then pay the warfound to resupply the one who voluneered to fight for your depolyment on map . what you can play you can just look at Ironheart 3 or 4 , of course H&amp;G didn't make it that well but the most difference between this two was the veterns , a group of vetearns on TS or skype vs a group of noobs and newbies , the war can be lost even you have 100 division counter 1 div. on a conflcting area .   Alright , if you have the patience to read until here , then I'll give you my last suggest :  If you enjoy the WW2 as a soilder or sniper, you'd better try Red orchestra ; If you enjoy the WW2 as a general , you'd better try Iron Heart ; If you enjoy the WW2 as a pilot or tank crew , you'd better try War of thunder ; Only if you wants to be a paratropper then this game might still have something good for you .  H&amp;G puts them toghther , I have no doubt that this company have an hornorable goal that wants to emerge all the good elements of WW2 games toghther , to represent us a total world war 2 game that we can play every role within . And I've already given tons of gold to show my respect to the idea even tho its a free game and if you play in some vetern's way to earn the money and exp you dont need to buy anything at all .  But I still strongly not recommend to play this game . Its still awful , time wasting , can ruin your good mood in a single hour , yes , I just bought another day of membership and I've come across some flight demonstration teams . now i still have 23 h of membership but I've already grown tired of this game . Maybe I'll not open it anymore .  HF in this game , I'm tired .  ",
            "review_score": "-1"
        },
        {
            "review_text": "This is almost a great game, if not for being jammed with hackers, it would be. Lots of peeps on here say this game cant be hacked or that players are just that good, they are usually the ones hacking. Go watch you tube and see the hacks for urself. So, if you wanna enter a game where you die repeatedly without a hack, then by all means, join in, but if ur more about fair play, find a good FPS or MMOFPS that you have to pay for, because only there will you find minimal hackers. I truly believe that around 85-90% of the players on here are hacking.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool Pay to win Horrible grinding game...",
            "review_score": "-1"
        },
        {
            "review_text": "Very laggy and buggy. Takes a long time to get 1 item. Toxic 12 year olds always joining Russia team and spamming 'Cheeki breeki!' in chat. Tanks, guns, and WWII. 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "I think you guys released a little prematurely. There are plenty of bugs and glitches that need to be addressed.  1) Kubelwagons are made of glass, and handle like a bull on meth. Go over a small hill, and you wipe out 180 degrees. Bump into a wall, or another vehicle at .5 miles an hour and it explodes. Get stuck on a rock, under another vehicle or in a ditch, and you have to F11 suicide to leave the vehicle.  2) Recon Class. Laying prone to have a steady weapon is twitchy. Half the time you end up with Parkinsons, and a cannot even site your weapon.   3) Balance. This game heavily favors US and USSR teams. While having these 2 sides face off and battle each other, keeps the game from being a 2 way domination, balance is severely lacking. The German Heer, does not have a steady semi or automatic weapon. Both the M1M2 and the AVS are vastly superior in performance to anything the German team has. The German fighters lack the mobility of both US and USSR planes, leaving the german side with a SEVERE handicap in air power.  You guys may have released your game, but it needs a lot of work to be up to par. I have waited months for balance to be brought to the game, and honestly was shocked when the release date was announced. I hoped there was to be one last update, but once again was let down. I feel you still have huge potential, but these factors are making it hard for this long time player to continue to feel good about the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Good idea, Terrible gameplay, you need to grind for a month or 2 just to be able to get kills. Seriously a bolt action rifle is not a 3 shot kill from 10 ft away",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game. But I can list down a lot of reasons to not play this game: 1. The equipment in-game is just overpriced. You'll want to quit before even earning half of the price of the chosen item. 2. Some weapons/vehicles are too OP. Devs need to nerf those. 3. It's really unfair. 4.For a free game, the gold coins are a bit overpriced. 6 euros for 1400 gold coins is too much. 5. DAMN BLOODY GERMAN FACTION. 6. I prefer the previous maps for skirmish mode. ( just my opinion ) 7. I know german weapons were good during WW2, but devs should make it more, 'realistic'. The fact that the germans have these, 'monsters', and they're point blank too, makes it totally impossible to kill them. 8. DAMN BLOODY EQUIPMENT POINTS. And thats about 10% of my reasons. The main problem that everyone face, is the overpriced system. I hope you devs can lower the weapon price or increase battle pay. Thank you for reading.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst games ever seen in my life. Not as a gameplay and graphics but the hackers in this game are full. The devs must be idiots cause the guns are not even in the true power. What i mean with that? Well IT ISNT ♥♥♥♥ING POSSIBLE to shot 1 ♥♥♥♥ING clip to the enemy and he on shots you in the chest. WHEN YOU HAVE A ♥♥♥♥IGN MACHINE GUN. Never mind,the game is funny until a level. What i suggest you. DO NOT DOWNLOAD IT. (Plus ofc a pay2win game)",
            "review_score": "-1"
        },
        {
            "review_text": "It's clunky as hell, it's ugly as ♥♥♥♥, and it's boring as ♥♥♥♥.  Gmod Army mods are better than this. Arma 2 is better than this.",
            "review_score": "-1"
        },
        {
            "review_text": "total garbage, played it when it came out, i had a lot of fun, log back in get sniped across the map every time i go outside the base. you need more then 10 hours just to unlock a god damn scope for your sniper rifle. movement system clunky, you can sprint for max 4-5 seconds. they just ruined it",
            "review_score": "-1"
        },
        {
            "review_text": "100 hours of farming an d other players pay money and have laser wepaons. the balancing is crap  ",
            "review_score": "-1"
        },
        {
            "review_text": "One of the most terrible games I've played. The graphics are bad and the sound and handling of the weapons is absolutely aweful. Your soldier also jumps for like 3 seconds because the gravity in this game seems to be reduced. Then there's also the cluttered interface. The game constantly nags you that you didn't buy into the veteran tier even if you're just starting out and every time you play you unlock some useless ♥♥♥♥ you'll get notified about, This is worse than BF's Battlepacks.",
            "review_score": "-1"
        },
        {
            "review_text": "Heroes &amp; Genitals.   Oh yes it is a free to play game and yes they need an income of some sort and yes lots of F2P games offer ingame purchases bleh blah, well this game takes it a step too far.   If you want to unlock a new gun then that will take you ages, oh you want a scope on it? nah dude play some more or use your creditcard a bit.  If you want me to spend money on a F2P game then it is not supposed to be covered in ingame purchases, first you need to catch my interest = check, make me play it = check, make me unlock some items which will make me stick with the game even longer = No, Match me against people with long range scopes and rifles better than mine = check, if you make me bored this quickly then I would say that it is not a good game, you need to reward the played atleast a little bit just a tiny bit otherwise it is not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "the new maps have ruined the game.",
            "review_score": "-1"
        },
        {
            "review_text": "When I first saw this game I was really exited. And I admit that the first hours of gameplay are rather fun. But once you get to a high enough level, the game really needs work. My first hours of WAR MODE really sucked. You never get the chance to do anything because one is always being mowed down by tanks or higher level players. This area of the game needs work. And for some reason the germans are Invincable. Hopefully the game will fix its problems and create the ww2 realism it wants to create.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Heroes &amp; Genitals.   Oh yes it is a free to play game and yes they need an income of some sort and yes lots of F2P games offer ingame purchases bleh blah, well this game takes it a step too far.   If you want to unlock a new gun then that will take you ages, oh you want a scope on it? nah dude play some more or use your creditcard a bit.  If you want me to spend money on a F2P game then it is not supposed to be covered in ingame purchases, first you need to catch my interest = check, make me play it = check, make me unlock some items which will make me stick with the game even longer = No, Match me against people with long range scopes and rifles better than mine = check, if you make me bored this quickly then I would say that it is not a good game, you need to reward the played atleast a little bit just a tiny bit otherwise it is not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is really frustrating and after the recent updates matches take way too long, after 1hour the match wasnt finished yet so i said f*** this and i have not played since then. I even uninstalled it.",
            "review_score": "-1"
        },
        {
            "review_text": "I had played over 70 hours of this game in alpha.. it was great.  Now that the game is 'Releast' everything has gone to hell. Let start with the ping. Game starst&gt; check ping &gt; full bars &gt; 1 minute later &gt; player is having a stroke &gt; check ping &gt; 1 bar &gt; leaves game &gt; repeat  And i have not even gotten started with the FPS i have a OC (MSI Twin Frozr Gaming GTX 750TI) (16GB Ram) (Quad core: 3.7ghz)  Planetside 2: Ultra settings (90FPS) Battlefield 4: Ultra settings (112FPS)  and then there is this game Low settings (53FPS) and the frame drops are.... harder then a brick   ----------Maybe in another year i will try again----------",
            "review_score": "-1"
        },
        {
            "review_text": "The first hours were amazing... but then...  1. No balancing at all, German troops are totally underpowered, their weapons do like no damage.   2. why are there only so few maps ( round about 7 maps).  3. Some sort of covered p2w. You can buy anything with the ingame currency, BUT the things are so damn expensive, that you would have to play for months until you get a half - useful equipment.    Guys: please implement more maps and raise the damage of German Weapons ",
            "review_score": "-1"
        },
        {
            "review_text": "I don't like it because, there isn't that much video settings to get more fps. Fps is a crucial thing, and I don't get that much in this game.",
            "review_score": "-1"
        },
        {
            "review_text": "I would like to write an actual review for this game... but I can't even play since the lag is so unbearable ¯\\_(ツ)_/¯",
            "review_score": "-1"
        },
        {
            "review_text": "every time me and my friends try and play. i just says 'loading plugin'. then you check your files and says over 5000 have faild to load. and then it re downloads the hoel dam game. please fix your plug in's or soemthing",
            "review_score": "-1"
        },
        {
            "review_text": "It takes absolutly ♥♥♥♥in forever to join a match. I hop on, try to join a match, 10Mins later im still in match making. Fix this and I will change this.",
            "review_score": "-1"
        },
        {
            "review_text": "The small maps are kinda boring once you get to the larger maps game is more fun. It is confusing at first on how to join the battles",
            "review_score": "-1"
        },
        {
            "review_text": "Seriously just don't even bother with this game, you have to pay in game cash just so you can have bullets for your guns and it literally would take someone their entire lifetime to get any meaningful progress into the game so you can have a decent gun.  This done so that you fork out cash to the greedy devs, this game is horrifyingly designed to be that way. Oh look you want to kill that tank thats been spawn camping your stupid ♥♥♥ you either A) find one of the free AT weapons laying on the map which are completely useless against most tanks or B) once you have killed enough tanks with the crappy weapon you can buy an actually useful tank killer, but its going to cost you 5k per game to do so.   Of course you can bypass all of that and pay real money up front to get it right away, oh yeah and earn more in game cash as well while being able to level up faster.  This game when i first started plaing it was kinda fun, a silly free to play game with wonky physics and a slow but meaningful rate of progression; now its just a ♥♥♥♥♥ fest of PAY REAL MONEY OR GTFO.  The devs don't care about the players, just their wallets and you can find all sorts of info online with a quick google search, it comes up with players being banned for criticising the game which is absolutely not acceptible for any sort of company service.  So please don't waste your time or money on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is pretty fun but honestly, I've never done so much grinding for so little, 25 hours only to unlock one ♥♥♥♥♥♥ weapon, and I was at the top of leaderboards most of the time. I wouldnt recommend this till it stops going full p2w mode",
            "review_score": "-1"
        },
        {
            "review_text": "The gameplay is pretty fun but honestly, I've never done so much grinding for so little, 25 hours only to unlock one ♥♥♥♥♥♥ weapon, and I was at the top of leaderboards most of the time. I wouldnt recommend this till it stops going full p2w mode",
            "review_score": "-1"
        },
        {
            "review_text": "I think this will be helpful for a review; taking the description of the game and editing it to be true.  Heroes &amp; Generals is the ultimate WW2 game – a free-to-play Massively Multiplayer Online First Person Shooter.   (With an average of 8000 players at a time.)  No matter if you play as Infantry, Tank crew, Fighter pilot, Paratrooper, Recon, or as a General taking strategic decisions – everything you do makes a difference in the war.   (It wont matter what you do, unless you take part in the war gammode.)  There is a great variety of authentic weapons and vehicles accessible in the game such as the effective US M1A1 Thompson submachine gun, the legendary German Panzer V Ausf G. ‘Panther’ tank, the excellent Soviet Yak-9B fighter plane, and even a bicycle!   (There is a varity of authentic anti-tank weapons, knives, and civilian bicycles.)  The arsenal is constantly growing as updates for the game are released regularly.   (There will be no updates within 2 months of each other.)  In Heroes &amp; Generals your team always has your back.   (In Heroes and Generals, your team will always try to run you over in a civilian truck.)    Every single player makes a difference, but you win, lose and make friends as a team.   (You will lose and make enemies as a one-man army.)  With a growing and welcoming community and a focus on teamplay, Heroes &amp; Generals wants to bring players together and have them make friends from all around the globe.   (With a growing toxic community and a focus on solo play, Heroes &amp; Generals wants to seperate players and make enemies from your own country.)  [You must have you Specialist Commenting ribbion to level 9 before you can comment on this post.]         ",
            "review_score": "-1"
        },
        {
            "review_text": "You know whats killing the game more than anything? the playerbase. Especially on the german side, people will pick a lower leveled player and make direct verbal attacks against them, and then defend the person making the attacks 'if you cant handle it, get out'. and some of these attacks are pretty toxic aswell. And apparently reports just arent handled anymore because there are quite a few players who receive report after report and are still in game every day for months trashing it up.  im done trying to get friends to pick it up, and done trying to make other friends stay. i wanted to like the game, i kept coming back to it. its gotten better in some areas, mixed in others, but the community has only gotten worse.",
            "review_score": "-1"
        },
        {
            "review_text": "This game unless you're willing to drop money into isn't for you. The controls are horrible. The progression is impossible unless you're williong to pay. This game is a textbook difinition of pay to win. I would never recommend anyone to play this game unless you're a known wallet warrior. Really forget this game go play anything but this game I've had the worst experiences in gaming ever on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "pay2win and horribad developers that can't (or don't want to) fix some utter ♥♥♥♥♥♥♥t in this game",
            "review_score": "-1"
        },
        {
            "review_text": "All around trash.",
            "review_score": "-1"
        },
        {
            "review_text": "Written 11/6/16  So heres my basic thoughts about the game. I will address the most obvious pros and cons that I experienced about the game.  PROS :  - ww2 - upgradable weapon system - plethera of weapons and vehicles - good map design  This is a game that most peopler who like ww2 should try out. I have personally had good time running through a village with my M1 Garand, shooting krauts. I have also had bad times though.  CONs : -still pay 2 win, although its much less than it used to be. -paratroopers can drop themselves anywhere on the map, with any weapon. -poor graphics -poor physics engine -sounds are wonky -♥♥♥♥♥♥ ranking, xp and money system  Its still a pay to win. Even though the devs sort of fixed the ranking system, it still sucks, it still takes you forever to get enough credits with out paying for them to actually improve things. For example, a skin for your M1 that makes a darker shade of brown costs 79k. Imagine what an actual trigger or barrel or god forbid, even a sight mod would cost. Now consider that your default salary as a soldier starts at 8k per hour. PER HOUR. Yes, you heard it. You earn cash based on how long you play the game, not how well you do in it. No matter how many points you cap or people you take out or games you win, you literally need to play for hours and hours and hours on end to even see a visible improvement. Now, about the whole wonky sounds and graphics. The graphics are bad. They are, and there is no excuse. War Thunder, another free to play game, has beautiful graphics, so H&amp;G cant hide behind that. Now, lets put this into perspective. There is a sniper in the hills hiding in foliage. He can see you through his scope perfectly fine. You can't even see his gunfire because even on max graphics the games render distance is horrible. Unsuitable for the large, strategic maps thats you find in assault and war gamemodes. The sounds are even annoying. Planes dropping bombs are some of the most annoying sounds, and the gunfire sounds are poorly done. Literally firing .22s in person sounds cooler than the rinky dink sound the M1 makes. Its really just a poorly done game. It has great potential, but would honestly need a different ownership and a complete revamp to make what I would consider a 'good' game   ",
            "review_score": "-1"
        },
        {
            "review_text": "Gave me so many problems from the start. First, When I created an account from my email it was denied and I had to make a new account particularly for this ♥♥♥♥♥♥ game. Then there is no server browser and there is only one playable map for beginners and I had to wait 10 minutes in the queue. Shooting and graphics are absolute garbage. Dont get caught to fake ss in the store. tl;dr Game is ♥♥♥♥ and not worth your time.",
            "review_score": "-1"
        },
        {
            "review_text": "after this ♥♥♥♥♥♥ update : more spawn kill by tank  spawn suck more than before !!!  ♥♥♥♥♥♥ spawn area where you cant kill but can be killed spawn system suck (time especially)  lots of cheater  tank cancer  unbalanced weapon   ",
            "review_score": "-1"
        },
        {
            "review_text": "very, VERY bad hit-detection horrible balance and p2w bad matchmaking tank and plane mechanics are ok",
            "review_score": "-1"
        },
        {
            "review_text": "All around trash.",
            "review_score": "-1"
        },
        {
            "review_text": "First things first, anyone who says this game is not pay 2 win is a dirty ♥♥♥♥ing liar, a simple grind for everything? you have to learn how to do amazing with a ♥♥♥♥ weapon while others get a ♥♥♥♥ing automatic that can literally kill you within seconds, not even getting a ♥♥♥♥ing headshot. And even if you do have the time and patience for this game to grind without paying, after you learn how to use a weapon you get another one that you have to learn. I can't even get close to an objective without dying. Due to the enemy having ♥♥♥♥ing snipers galore, and yes I mean the tank busters. The only thing this game has going for itself is the bikes and the cars, but even then to use a car well, you must upgrade your driving skill because it takes your character 5 hours to make the car forward, once again do not download this game. Get something better like h1z1 please. And even then H1z1 has a lot of flaws but its better than this ♥♥♥♥ game.",
            "review_score": "-1"
        },
        {
            "review_text": "Takes too long to grind one weapon. Not recommended.",
            "review_score": "-1"
        },
        {
            "review_text": "How about you do something with the PTDR-41 rifle?Gun is too much efficent as it wasn't in ww2,for example:You cant shoot it while standing up or crouching cause it will break your shoulder immediatly and send you flying 20 feet away but in H&amp;G a guy is just casually standing in a bush firing 3 rounds and destroying you which is a pain in the ♥♥♥ when waiting 200 seconds to spawn and then get killed in 10 seconds. And being able to carry 20 bullets for that?One bullet is large but 20?thats just no logic.And being able sprint with it?It weights 38.1 LBS which may not sound like much but that plus other equipment?No way.Also,you need to people to operate with this gun,not one. And PTDR REAL VERSION can penetrate 40mm armor maximum,so why it can penetrate lets say Stuart Tank which has 51mm rear and side armor,and 60mm frontal armor or M24 Chaffe with 45mm rear and side armor?For German armor i understand cause Panzer 1's armor is 7-13mm and Panzer 2 is 5-14.5mm.But for americans?I dont get that.So please can someone just do something about this ♥♥♥♥ing gun or just get it out of the game,The game is too unbalanced with it.And i know a lot of Usa Players will agree with me on this.",
            "review_score": "-1"
        },
        {
            "review_text": "I like the game but theres a few things wrong.  1. the spotting is crap and you cant see any thing and get killed 2. it is hard to eran money to get guns tanks cars ect.  other then that its a good game i would not download yet because its a hard game to start playing and the light tanks are useless no matter what you do",
            "review_score": "-1"
        },
        {
            "review_text": "This game has devolved into people running and jumping around with smgs and spawn camping with aa trucks",
            "review_score": "-1"
        },
        {
            "review_text": "Played one round and lost. which is fine. Went to play another round and waited for 5 minutes.. Nobody joined. Graphics are poor. Not visually appealing. There were no directions showing you what to do. It just drops you in, sink or swim style. People playing the game were saying the game was bad in chat. Very laggy. The game felt tossed together without any effort put in to it. Needs a lot of work. Would recomend they pull it off steam until it reaches it's full potential.",
            "review_score": "-1"
        },
        {
            "review_text": "Its Cod 4 on veteran, grenades everywhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Devs try to steal your money, you either buy op weapons or spend years grinding to get them, then you find out you need to use the crap stock version of the gun to get new mods for it. Overpriced everything so the above will happen and give the devs one of two things, money or high playtime to get a single gun/mod/vehicle. Community are pure cancer, met a large group of friends in the game and some of those have been attacked by the community with a certain ringleader we all know and hate leading them, and we have all since abandoned the hope of rejoining or this game getting any better...... just stay away",
            "review_score": "-1"
        },
        {
            "review_text": "It was a good game but it becomes a nest of cheaters. The worst is that it makes many month we ask reto dev to do something against that but.... The spawn areas are very very bad so you are forced to waste vehicules and AT or to run run and run again....  Ability to play in squad but not balanced weapons (or play german if you want the best weapons), many vehicules and tanks and possibility to play strategic with general maps.   Graphics are not so impresive but fps can be good. Good sounds and sensation.  With less cheaters, better spawns and more balanced weapons it should be one of the best !    ",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted this game to be something awesome! The fact its out of early access it something special.  pros: - WWII FPS  cons: - sounds tend not to play on gun shots (people can unintentionaly sneak up on you while shooting) - Very clunky arma feeling animations/mechanics - The game starts you off in a new player pool until you hit a specific rank. After which it becomes extremely difficult. how can a brand new player be asked to take on tiger 2 tanks",
            "review_score": "-1"
        },
        {
            "review_text": "ERMAHGURDD NOT GOOD DDDD: Can be improved :D",
            "review_score": "-1"
        },
        {
            "review_text": "Reto-Moto Games:'Optimization...WTF is Optimization'",
            "review_score": "-1"
        },
        {
            "review_text": "Unrealistic ballistic and ballistic effects. It is a war fantasy for pubescent phone gamers.",
            "review_score": "-1"
        },
        {
            "review_text": "800+ hours, I think it's time for a real review.  I've had alot of fun on this game over the years. Joining a match and messing around on the over-sized maps. Coming up behind people and trolling them. Trolling teamates, teamkilling, and topping the leaderboard. Its a very classic simple FPS game. Aim down sights, shoot the gun, get a kill. But, some people have alot higher standards for video games. Many people complain about pay to win, that the game is a grind. Yeah, it is. But it's not as bad as everyone makes it to be. If you are good at FPS, you will not have any trouble getting new gear.  You can have alot of fun on this game, but many people have trouble getting past the decent graphics. This game doesn't have the greatest graphics out there. The same creepy guy for all 3 factions. The maps are very bland and colorless, and the trees look like paper. This game used to be the only WW2 game out there. Many people like to play this game because there is no future theme as many recent year FPS games have had. But, with the release of Battlefield 1, this game really is going to have to step up its graphics, as Battlefield 1 may have the best FPS graphics we've ever seen.  This game is still fun for me to play, but do I recommend it to someone who doesn't have much FPS experience, no.      ",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible Game. Unbalanced vehicles. WAY too much trolling still going on. Weapons aren't balanced either. Case in point Garand shots at close range 3 hits to kill someone, 1 shot from a bolt action. Aircraft are cancer, getting off or out of vehicles is too slow when enemy is near, you get killed and can't do anything about it. This game was better in Beta but now that it is live it is horrible.",
            "review_score": "-1"
        },
        {
            "review_text": "terrible system. the spawning sucks. You will join game after game where your either easily winning, or no matter how hard you try it is pure impossible to beat the enemy team. for example, i join a round where it was me(a tanker) with 2 other tankers on my team and they had 5 recon with anti tank grenades. No matter how hard you try in that round you will lose. and lets say you are doing good and the enemy team starts rage quitting so your team has 15 players and their team has 10. Now, only 10 people on your team can be alive because they have 10 people alive on their team and so you can be waiting in queue WHILE YOU ARE IN GAME for about 2 minutes. And in order to join that game you have to be sitting in queue for 5 minutes. And on top of that its a pay to win game. Dont waste your time please.",
            "review_score": "-1"
        },
        {
            "review_text": "10/10 game just spawn and get spawn camped by tanks almost every game and cant get anywhere",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a plethora of flaws and probably the most significant is the extreme grind required. If you are patient enough to wait for the developers to polish the game and don't mind playing with low tier unlocks give this game a try. Otherwise don't bother.",
            "review_score": "-1"
        },
        {
            "review_text": "the lag is real.... it may not seem like it while driving or running, but when you shoot someone so many times with blood flying and they one shot you, then you will figure it out fast. also the aim botters are terrible and no one is doin anything about. if you dont believe me then try and when you are about ready to throw the comp out the window ... think about it then. so many reports on same players by soooo many diff players and nothing is being done about it. the game is also bias agianst american troops, there is even a channel from youtube named Birnyx that done a spoof video on it and he is from over seas somewhere near germany. good luck to new players.... your about to get spanked.one more thing... zero spawn protection, no matter what they say, you will also find out the hard way. spawn killing for days.  forgive the typos and bs like that just read it",
            "review_score": "-1"
        },
        {
            "review_text": "this game is fun at the start but way to pay to win for better stuff and more fun ways to play. it also takes way to long to find a game,",
            "review_score": "-1"
        },
        {
            "review_text": "Game is a mess with all this great RPG and Strategic overlay but horrendous casual/arcade game play.  LMG with RPG, bunny hopping and hip firing.  Everyone spawns a personal vehicle.  Tanks at mercy of bikes/personal vehicle: Spawn vehicle, follow edge of map, chase tank, jump out at high speed, bunny hop if someone shoots, spam anti-tank, rinse repeat. You literally see swarms of players doing this tactic whenever someone spawns armor.  Disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "somebody help me how to kickflip?",
            "review_score": "-1"
        },
        {
            "review_text": "matchmaking takes so long , and you can't change graphics settings on main menu",
            "review_score": "-1"
        },
        {
            "review_text": "This game is for me soo bad.. yes its free to play game it´s good but only for childrens... This game had very bad resolutions and more graphic fail..",
            "review_score": "-1"
        },
        {
            "review_text": "I tried this game for quite a while, and I must say that even after 710 hours, I cannot recommend this game.  Why?  It could have been one of the greatest games of all time, but the creators have done nothing but tilt the game in the Americans favor. Their weapons, armor, and camo are all better than the other sides. Now, before you say, 'Just get better!', I am a very good player and end up near or at the top of every match. I always have way more kills than deaths, but that is not the point. When you have a 1911 pistol that is more accurate and hits harder than a scoped rifle, something is wrong.  Every single update has done nothing but make American weapons and gear better than they were.  I will not play this game again, EVER, unless the creators do something to balance the game.  CREATORS, FIX THIS GAME!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I use to to love this game, but the more updates they have added the more I have become against recommending it. I completely hate the new squad concept. Since when does a Capt. or Lt be in squad lead by a Sgt., it has really screwed up the game play to have have added the stupid squad concempt . I should have a choice which squad to join and leave one that totally sucks. Goes to show the programers of this game do not have the gamers in mind when the keep screwing up a good thing.",
            "review_score": "-1"
        },
        {
            "review_text": "**This review is also a guide on making credits in the game. Some fruity mod kept deleting my brilliant and honest guide.**  This game is fun and addictive, its a mess of bugs and issues and unbalancement though. I dont know what the grind complaints are on about, I have 7x hours on steam but ingame its more like 43. I'll say 20 of those hours were played without veteran status the rest has been vet. If In 43 hours of game time I was able to get a 2 shot kill semi auto rifle, a 1 shot kill bolt action, an OP automatic (AVS) much anti tank equipment, and unlocked 3/4s of the tanks and own some 4 of them, I cant complain about this 'grind' people speak of as I havent encountered it. Sidenote, 42.1 hours are as soviet...its torture to lose every match.  How2MakeDemCredets  Step 1: Accept the fact that you won't have nice things til VERY late in the game even with Vet status. (Except 2shot semi rifle, that shiz don't take that long and its a MUST for this 'guide')  Step 2: Aquire Infantry Assphault 12 so you unlock your factions automatic 'assphault ryfle' (AVS-36, StG 44, idk what 'Murica gets sorry never even looked).  Step 1.5: Hopefully you saved ALL your credits on your way to step 2.  Step 8: Purchase said assphault ryfle, and get the necessary mods to make it 'OP'  Step 22: By now you should be around rank 10-11 (hopefully) so just play the objective and have fun spraying down enemies when they show up netting some 9-13k per good assphault match IF you win and 4-8k per skirmish IF you win and its like 10min+.  Step 69: You could theoretically use the SMG's instead all you really need is something automatic with a high ROF, but my AVS-36 repair cost is some 8K at full red borken 6 matches later, and my PPD is like 30K 3 matches later.  Step 420: If you suck at the game in general please don't expect the above to work some sort of magic, though...honestly automatic weapons=instant +80% increase in kills.  By following these easy steps+my vet stat I got enough credits to buy the PTSD(PTRD) which is 284,000 shiny credits If I recall correctly in only 3ish probly 4 days of roughly 4-6 hour play time per day. I started at 2,258 credits cus I was a recon before I tried to save my money (dem repair costs doh). Sidenote: I know this might seem 'sarcastic' but its how I honestly do it and im pulling in more than decent credits now.  Cheers.",
            "review_score": "-1"
        },
        {
            "review_text": "Its not how it looks from The trailer",
            "review_score": "-1"
        },
        {
            "review_text": "Waste of HDD space.",
            "review_score": "-1"
        },
        {
            "review_text": "One of the clunkiest games I've ever played. Movement is terrible.   To add insult to injury it takes ages to unlock anything but of course you can buy stuff to get it immdeiately.   I don't think it's P2W cause frankly I haven't played it enough.",
            "review_score": "-1"
        },
        {
            "review_text": "I would love to recommend this game but I can't. It is so unbalanced it sucks any fun out of a decent concept. How is it fun to be surrounded by enemy tanks that ♥♥♥♥ the spawn? How is it fun to be pitted against massively over powered weapons that are going to take months of grind to be able to defeat? How is it fun to hit an opponent three or four times then for him to one shot you in the arm....NO FUN AT ALL!",
            "review_score": "-1"
        },
        {
            "review_text": "I like this... wait no! I LOVE this game. It's just that the developers are capitalist f*cks (no offense) ;). Basically everything in this game is the devs trying to get you to pay to have any consistent fun, meaning that if you want to have fun 100% of your time in this game you'd have to fork over some of your dough. Like really everything costs too much and like 60-70% of your time in the game is farming credits for that item you want to buy so bad. You have to PAY to be a veteran, i'm not sure if thats how actually being a veteran works and only for 24 hours minimum. I technically belong in the category of veterans, i played this game when it was a browser based game REALLY early on.  To sum this up- Yes! I do recommend you get this game, it's really fun, just the prices on everything are stupidly high and that's basically it, the game is PHENOMENAL for a F2P game, i would pay atleast 15-20€ for it, if it ment getting rid of the capitalistic nature of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "All they want is $$$,playing for 100+ hrs just to unlock a useless barrel(and it's Ficken expensive) Paying $10000 just for a little knife, LMAO(you got one on your back, Jimmy/Ivan/Hans, why didn't you use it?) 1 gernade = $3000(GG gernade spmmers) My tank rammed into a tree = lost half hp, the tree keep standing still(tree 1, tank 0) P2W, worst bolt-action rifles i have ever play(no 1 shot 1 kill unless you pay to unlock or waste so many hrs in this game to unlock all the OP parts) Bad garphics, look at those trees, i thought i was playing Minecraft with WWll guns Good game, bad company, every ptatches making this game more and more P2W This is a good game before . . . . But now it's just a Piece of Scheisse.",
            "review_score": "-1"
        },
        {
            "review_text": "So this game has some good potential, with constant development, but it is sooo much pay to win. It used to not be too bad, noobs had 3-4 maps to play, and it didn't take too long to unlock stuff. Now, noobs are stuck with one small map that sucks. You start out with literally one, single-shot weapon, no other items. period. You have to unlock things, such as attachments, camos, vehicles, weapons, by taking lots of time to do the required activity to unlock it. Then you have to pay for it after you have spent hours of in battle time to unlock it. and nothing is cheap. I unlocked my first item, a barrel for my m1 garand, and I barely have enough money to buy it. This unlocking format really kills the buzz. Note, I have played this game since it was first released on steam. Now, I could barely play (3-6 fps) it since I had a laptop then that had about the specs of my toaster. Later, I got a decent gaming laptop that was a couple years old, and I could play the game well, although, I had to restart my account, even I had played enough that it shouldn't have been deleted. I was soo close to getting to go into the 'big leagues', in other words, the big maps, with more experienced players. I had a jeep and everything, then they raised the rank requirements to get moved up. Later, in the next big update, they added in a couple vehicles and my framerate went from 60fps (with lag spikes that took me down to 40fps) to 6-15 fps. No joke. So i didn't play for a month or two, simply because you can't shoot someone when they have already seen you long enough to land almost 2 shots on you before my screen even updated that they were there. Then I was able to get a desktop with i7 and a gtx 960. I downloaded the game, which had also just had an update then, and my account was GONE. That totalled 3 times, my account had been reset, along with having the requirements for obtaining anything having gone up with the amount of points and money earned per round staying the same. So, I tried to rebuild my account since now it should be a breeze to play with steady 60fps, only its taking a while (even with a decent k/d of 9:3), I only have one weapon, no other choice, no decent melee, no grenades. Weapons that come standard in any FPS. And I am forced to only one tiny, dumb map. It is such a GRIND to unlock anything. There other games with the unlock and pay for it model (wot to name one), but it isn't that bad on those games. This game requires dedication and patience, especially a game that is grind heavy, but has appalling matchmaking times. This game is way too slow, and I can bear through grinding for stuff once, but having to grind again to simply unlock basic items of war, its too much.",
            "review_score": "-1"
        },
        {
            "review_text": "P2W cancer.",
            "review_score": "-1"
        },
        {
            "review_text": "Well its free, but what is the whole system or engine doing. I dont have really good computer, but at the lower graph its not even doing any boost to fps on high it dont even look good :D So guys dont waste your time because you need to grind ♥♥♥♥ really long. And one more thing.. SVT-40 or other first guns are like hunter guns with hard hitting bullets and it shouldnt kill a lone soldier in 3 hitts leaving him in 'half a heart' some times.",
            "review_score": "-1"
        },
        {
            "review_text": "Awsome game but one thing that always bugs me. The United States planes. There the WORST at ability in the air, and the enemy planes always kill me in the air for the TERRIBLE PLANE!. This is a HUGE problem to the games because the main idea about the games is having fun, fighting enemys and others things but having terrible planes in the game, No! We want to have fun in the game and having terrible thing like the planes and the enemy's have better ones. If the creaters (might spelled wrong) of the game put more than one plane in Germany, Soviet, and United States, I would recommend this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Full of lag ",
            "review_score": "-1"
        },
        {
            "review_text": "I loaded this game up and my friend called me a nerd",
            "review_score": "-1"
        },
        {
            "review_text": "I waited more than 30 minutes and there is still no match found?",
            "review_score": "-1"
        },
        {
            "review_text": "Honestly this game shows a sense of not knowing what it wants to be, if it wanted to be realistic it wouldn't have a health bar and be in a vain similar to Red Orchestra. Not to mention that while it has a weight system that effects stamina, it would have been more interesting if every weapon had different weights like they had in real life and effect much more gameplay wise (example being M1 Thompsons being heavier than the M3 Grease gun). If it wanted to be arcade, well it shouldn't have things like bullet drop and long wait times; nor be based on a long slow game process while trying to have aspects of other fast paced FPS.  Initially it did seem fun, but as time went on I'd say the game had moved to a position where you must have friends to even have any enjoyment from it, thus pusing away solo players from this. Nor are you able to help your team if you had other classes but were never in the appropriate squad, regardless if you had a soldier fit for that squad. Also tank combat is pretty bare compared to other games that specialize in it (world of tanks and War thunder providing appropriate aspects to arcade and realistic respectivly)  If you have friends and have no problem spending lots of time grinding while you get shot up by players sitting around your deployment zones to kill you, go ahead. Other wise, there are other games that provide better experience for realistic and arcade respectivly (the aformentioned Red Orchestra series is a better realistic game compared to this where teamwork is much more important).",
            "review_score": "-1"
        },
        {
            "review_text": "So one night i was looking for a good wwii mmofps. found H&amp;G and was surprised that it was free. i remember watching youtubers play and it looked fun. Downloaded it and started playing. not 3 days later i got rid of it and here is why.  1. NOT BEGINNER FRIENDLY, load out starts okey but you quickly see the disadvantage of not buying gold. yes this game is free to play BUT it's pay to win.  2. Class system is BROKEN, i quickly found myself playing with guys who where Way ahead of me. while i was still with the beginner gun i was with guys who had gun vehicles, SMG'S and grenades. try'd playing a different game mode and was getting sniped and sprayed down when all i had access to was grenades and a shovel. not fun respawning and getting sniped 5 time in a row withing 5 Min.  3. MATCHMAKING IS STILL BROKEN, I don't care what the Developer's say. i shouldent have to wait 6 min on average to play a round. before anyone say's it's my internet speed i also play WT and World of Tanks and have no trouble there. alot of people i have asked says its the Norm, well i Dont' want to play only five matches in a hour.  4. Currency is too slow. between maintenance,upgrades and new gear i dont get enough income to have fun playing this game. the whole hourly wages is BS. its a good idea but the cycle is too far apart without enough payout. cant get money from games because cant get IN THEM.   All in all i'd say i would play this again IF they fixed some stuff. but at its current form i'd say, Unless you have money to throw away, DON'T PLAY THIS GAME!   Final score 4/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game literally makes me wanna die. It is absolutely filled with micro-transactions. These micro-transaction absolutely make you op as f***. Pretty much every team EXCEPT the US are op russians have mosen naget's and germans have kar 98k's. This game is nothing more than a cash grab.",
            "review_score": "-1"
        },
        {
            "review_text": "This guy was shooting me through the window right, killed me one shot to the foot... I look at him with a bazooka and ONLY WOUND HIM!!!! 10/10 would kill my self again...",
            "review_score": "-1"
        },
        {
            "review_text": "TO BATTLE!  wait ~1 mins to start  wait another 70 seconds for round to start  ring ring bike f1 to report that guy battle ends after 3 mins even though i wait 4 to get in PAY ME GOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLDGOLD GOLD enjoy....",
            "review_score": "-1"
        },
        {
            "review_text": "Friend say i should play this game  crashes when logging in  validates the game cache 5633 files need to be downloaded checks downloads  sees Heroes and Generals 0/1.2 GB remaining realizes it's almost the entire game that iv'e already downloaded",
            "review_score": "-1"
        },
        {
            "review_text": "Worst FPS I've ever played in my life. Not even joking, DO NOT WASTE YOUR TIME! It's a ♥♥♥♥ing joke, and a really really bad joke at that.",
            "review_score": "-1"
        },
        {
            "review_text": "pay2win as ♥♥♥♥. Would be better if they sell this game without this p2w ♥♥♥♥♥♥♥t.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been playing since alpha and this game showed a lot of promise. Gameplay is exellent i'll give them that! If everyone had an m1 Grand the game would be amazing and have a good skill gap. However, any fool with his mom's master card can buy high end weapons or tanks and crush new players.   Even anti-tank weapons require you to pay cash. (I suppose if you suicide spam grenades for a week you can theoretically earn enough explosives points to unlock them.)   If you can accept that this game is going to suck $100 minimum out of you, before you're alowed to have fun then you'll be okay.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Toxic Community, no voice chat, pay-to-win.",
            "review_score": "-1"
        },
        {
            "review_text": "Ehhhh. What can I say about Heroes and Generals? It was a very nice game is beta, and I remember seeing the Yogcast's challenge videos for the game. Those were the days. But just like the Yogscast this game has gone downhill. Not a lot of people play it anymore and it's become Pay-To-Win. I relish the days of a simple Free-To-Play where there were no microtransactions, but alas those days are gone and now all the companies follow in the steps of EA. So please do yourself a favour and go play something else.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst gun mechanics i've seen in a video game. Not worth the bandwith.",
            "review_score": "-1"
        },
        {
            "review_text": "P2W as ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Couldn't figure out how to get in the game. Gave up after 10 minutes. Needs a better user experience :/",
            "review_score": "-1"
        },
        {
            "review_text": "Awful. Just awful.",
            "review_score": "-1"
        },
        {
            "review_text": "Dont do it, dont download, waste of time unless u wanna pay to play and it will still be waste of time Worst Game Ever",
            "review_score": "-1"
        },
        {
            "review_text": "So ive been playing para for a while now and i must say - I want to ♥♥♥♥ing hang myself. Playing para in a skirmish is almost pointless the most effective thing you could do as a para on a skirmish is sit in the corner of a point shoting anything that moves. Playing as Infantry is just a grind you'll be there doing the same thing every time you log on, killing and capping and a tank means you just kill infantry and get killed by bigger tanks and or killed by infantry with big ♥♥♥♥♥ the most fun class to play is possibly the recon? But i wouldnt know because getting recon and pilot is almost impossible now playing as a pilot is... confusing... you get given a flak jacket (wtf?) and you have to get used to the really confusing movement but after a flying into the ground and into other planes you get used to it, welldone! you a qualified kamikaze pilot! The credit system NEEDS to be changed it costs 150k TOO CHANGE YOUR ♥♥♥♥ING NAME! and it costs 200k TOO CHANGE THE COLOUR OF YOUR UNIFORM! the fallchirmjager (The only reason people go down the paratrooper tree) costs over 200k WTF! Its a pay to win REALLY ♥♥♥♥ing faster if you spent 20£ on gold for the game you can basically get a gun that would take people who didnt buy gold about 150 hours trying to get while you can buy it instantly. Its infuriating i might as well go play my trial of WoW...",
            "review_score": "-1"
        },
        {
            "review_text": "Alright this game was fun you spind hours and hours for that new scope or that new sniper once you get it BOOM YOUR ♥♥♥♥ING BANNED FOR NO ♥♥♥♥ING RESON. You make a apeal then they dont accept so you make a new account saying *its not so bad and that it will only take you about a day or two of constant grinding.* Then you finnaly get your stuff back and even pass from where you were at then BOOM ANOTHER ♥♥♥♥ING BAN. So what do i think about this game? I think it should go ♥♥♥♥ its self and its ♥♥♥♥♥♥ ban system",
            "review_score": "-1"
        },
        {
            "review_text": "Told me to make an account to play. I left and played Call Of Duty instead. 10/10 Would do again.",
            "review_score": "-1"
        },
        {
            "review_text": "I dont think so m8 its a ♥♥♥♥ on toast and it tastes like toe nails not very good if you download your eyes will come out of your ♥♥♥♥ and you will die the end of my generic story about a sad game who was made by a potatoe.",
            "review_score": "-1"
        },
        {
            "review_text": "it's not bad, it's just that there are way more better free shooters then this",
            "review_score": "-1"
        },
        {
            "review_text": "i get good fps of 250-300 ",
            "review_score": "-1"
        },
        {
            "review_text": "I earned so much money for the recon guy so i thought ill unlock him with the sniper rifle but no i only get the character and i can buy a normal sniper scope but that costs 107000. ♥♥♥♥ that ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "If they will upgrade this game it will be fine but now its very hard simply u cant play normal...",
            "review_score": "-1"
        },
        {
            "review_text": "spend half my time loading",
            "review_score": "-1"
        },
        {
            "review_text": "it's not bad, it's just that there are way more better free shooters then this",
            "review_score": "-1"
        },
        {
            "review_text": "sucks its garbage i waited way to long horrible game ",
            "review_score": "-1"
        },
        {
            "review_text": "Cant login... Its a ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Most of the players are a$$hats horibley unbalanched econamy and prices for equipment and way to much server lag.  I dont recomend",
            "review_score": "-1"
        },
        {
            "review_text": "Cant wait to play battlefield 1",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a giant steaming ♥♥♥♥ upon the great genre that is WW2 shooters. There is nothing good to say about this game. It is absolute rubbish and I regret every minute I've spent on it.",
            "review_score": "-1"
        },
        {
            "review_text": "Why did you remove the Career Pathing, it was the best way to get an advanced class from the infantry class. A Recon for example requires at least over 10hours on a rank 6 infantry to get without buying gold. If you think players enjoy doing that then I say to you: Enjoy your decreasing player count.",
            "review_score": "-1"
        },
        {
            "review_text": "This game banned peoples for no reason. They banned me 3 accounts.",
            "review_score": "-1"
        },
        {
            "review_text": "I liked the game the fist few hours and the first few levels, but then after like lvl 5 or something everyone keeps grenade spamming in encounter, so i decided to go skirmish, and then everyone has ♥♥♥♥ing snipers with giant ♥♥♥ scopes, because they paid for them, totally pay to win, hud very confusing, no tutorial, only thing good in here is the bicycle. The guns until lvl like 20 are ♥♥♥♥, the only thing you will play with is the m1 garand, pls dont install this, it sucks",
            "review_score": "-1"
        },
        {
            "review_text": "This game has no atmosphere, no communication, nothing to really fight for  with majority of player wandering clueless thanks to shi**y tutorial. ",
            "review_score": "-1"
        },
        {
            "review_text": "Why am i in the walls?",
            "review_score": "-1"
        },
        {
            "review_text": "all the time say's 'server under maintenance' -_-",
            "review_score": "-1"
        },
        {
            "review_text": "Servers are allways down!!! I think they are situated at Haiti and if an earthquake starts they go down.",
            "review_score": "-1"
        },
        {
            "review_text": "An okay game, but there are much better fps games out there.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥ game with a ♥♥♥♥ ton of unbalanced things guns sounding like toys PLEASE JUST HAVE MERCY AND DONT MURDER YOUR DESK IF YOU PLAN TO PLAY THIS PIECE OF ♥♥♥♥ get onehitted across map when you leave your spawn planes bombing your spawn your team not using any vehicles while the enemy has 14 no teamwork the grind takes weeks (i still have my standard M1garand) and these ♥♥♥♥♥♥ developers silence people who complain by banning them for hacks even if they have played for years!!!! and if you question my number of hours played i only recently got it for steam",
            "review_score": "-1"
        },
        {
            "review_text": "I played the beta and hated that. I just got it today to try it out, it still sucks. In order to get anywhere in the game, you need to grind for possibly close to 50 hours. This is due to the absolutely ♥♥♥♥♥♥ starting guns. Without premium, you can get about 1000 in game coins with base gear. Any decent gun costs well over 100,000. There is NO matchmaking. In any game you'll be up against people who've logged hundreds of hours. Tanks are indestructable with base gear. You'll have to rely on your team to kill them. Because of the disgusting greyness of the game, people are pretty much invisible. It takes me almost 5 minutes for a game to load. Unless you want to grind for hours on end, all while screaming because of the unbalanced gameplay, go ahead and get it. Other than the broken gameplay, ♥♥♥♥♥♥ guns, awful net code, less than stellar graphics, and pay to win features, its a good game.",
            "review_score": "-1"
        },
        {
            "review_text": "Not so good. Tons of noobs.",
            "review_score": "-1"
        },
        {
            "review_text": "I hate this game -5/10",
            "review_score": "-1"
        },
        {
            "review_text": "TOTALY F***ING USELESS  Go f*** yourself in the bum, it is more pleasant than playing this cancer game. 10/f**k would not play agian",
            "review_score": "-1"
        },
        {
            "review_text": "Extreme Pay 2 Win and balancing issues between firearms.",
            "review_score": "-1"
        },
        {
            "review_text": "Too much grinding even after the 'fix'. You have to play so much just to get 10k",
            "review_score": "-1"
        },
        {
            "review_text": "this game is ♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "So wonderful game where I grinded for the sniper class and payed a butload of credits for it, only to find out the sniper class does not come with a sniper rifle...really..no sniper rifle? why not just stay a frontline troop and by the scope for cheaper than the sniper? Also shovel has more killing power than a rifle because pay to win. 0/10 never by crap again.",
            "review_score": "-1"
        },
        {
            "review_text": "Takes a million years to unlock anything. Somewhat fun, but again the almost complete lack of any meaningful progression sets the value of this game incredibly low. Don't get this game. Looks great, great concept, but the complete lack of progression alone is what screws this game over tremendously.  Rate: 3/10 Pros: WWII setting, decent realism, decent playerbase. Cons: progression is on same time table as evolution, pay to win.",
            "review_score": "-1"
        },
        {
            "review_text": "Was a great game in the beta, now it is just like any other f2p game... Stay away from it.",
            "review_score": "-1"
        },
        {
            "review_text": "Takes a million years to unlock anything. Somewhat fun, but again the almost complete lack of any meaningful progression sets the value of this game incredibly low. Don't get this game. Looks great, great concept, but the complete lack of progression alone is what screws this game over tremendously.  Rate: 3/10 Pros: WWII setting, decent realism, decent playerbase. Cons: progression is on same time table as evolution, pay to win.",
            "review_score": "-1"
        },
        {
            "review_text": "I have been playing this game for a while now, and i have to give it a thumbs down  This game is mostly a loading screen simulator  When yo ustart the game it asks for you to login, as soon as you login, and anti-cheat loading bar starts and it taks about 1 min After that the main page opens since this page is more like a browser it takes some time to load all the images after some time when everything is displayed properly you go through your inventory now you cant buy anything since evrything is blocked No when you press join a game its give you a loading delay, WHAT !!!? a 30 second loading delayjust for the map to staart loading and after everything is loaded and you join a game it gives a 2 min countdown just for you to join the game.  AND WHEN YOU SPAWN and after walking 20 steps BOOM TORSO SHOT dead from a 1 sniper from a mile away who yo ucould not have killed form tha distance even if you would have spoted him before he spoted you, because your starting weapon is ♥♥♥♥.  Well after hours and hours of grinding for credits annd making like 200k credits so taht i can purchase this gun i like for 200k credits YES it costs 200k , the gun is still locked because i have to kill around 2000 peopel with your starter weapon.  ANd no one will help you when in game every one will run off to some corners of the map and start caping and sniping from miles away.  ",
            "review_score": "-1"
        },
        {
            "review_text": "SUCKS TOO LONG IN Q WAITED 3 PLUS MIN AND NO START I PICKED THE GERMANS SO GO FIG",
            "review_score": "-1"
        },
        {
            "review_text": "shadow ♥♥♥♥ theatre",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible GRIND!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Boring... I rather play CS:GO, it's much better.",
            "review_score": "-1"
        },
        {
            "review_text": "im sorry devs this game was 'awesome' but now its trash :/ R.I.P Heroes and Generals",
            "review_score": "-1"
        },
        {
            "review_text": "im sorry devs this game was 'awesome' but now its trash :/ R.I.P Heroes and Generals",
            "review_score": "-1"
        },
        {
            "review_text": "it dosnt sign me in i cant do a thing it keeps saying wrong password when i put in my normal password please change but anyways i love the game",
            "review_score": "-1"
        },
        {
            "review_text": "Cant even get in the game...queues take forever...menus sucks theres no pointing directions...and its a generic stuff.",
            "review_score": "-1"
        },
        {
            "review_text": "i cant enjoy this game cuz my computer made out of wood :( ",
            "review_score": "-1"
        },
        {
            "review_text": "This game.........                                                                    is ♥♥♥♥ing awful. Buy Infinite Warfare instead. AKA, probably a decent game but I'm ♥♥♥♥ at it so it's crap. Buy Infinite Warfare anyway haha (this review is funny, give it a good rating please (that was also funny))",
            "review_score": "-1"
        },
        {
            "review_text": "i give this game a 5/10 theres alot of noobs that dunno how to play like me its so hard to get used to i do not recommend this game for non fast learners",
            "review_score": "-1"
        },
        {
            "review_text": "This game is anything but massive. When played there was about 6k. The visuals are boring as hell, grey on grey, crap animations, just bland. Gameplay is your average multiplayer lobby based shooter. You can find better anywhere else. General pay to win/get an edge market. It screams your ♥♥♥♥♥♥ f2p game.",
            "review_score": "-1"
        },
        {
            "review_text": "i deleted it one minute after I tried to play it",
            "review_score": "-1"
        },
        {
            "review_text": "i loved this game when it was still in beta, now it's broke, like me using the U.S Faction for 1 day and the next day i dont have a member to play as the U.S",
            "review_score": "-1"
        },
        {
            "review_text": "you guys made it look so much better than it actually is. i would say it runs on 2 frames per second. plus the starting weapon is so bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Pay to play all the way! would of been better to just charge for the game upfront and do away with ingame purchases ",
            "review_score": "-1"
        },
        {
            "review_text": "Pay to win garbage",
            "review_score": "-1"
        },
        {
            "review_text": "I can't do this. Please no. Someone do something.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Free to play  decent graphics  feels good shooting ppl  a lot of different gears.  Cons: pay to win (if you have just few hours to play and do not intent spend money here you will be infantry forever)  pay to win  pay to win  takes few days farming credit to buy some stuff unless you pay for it. (pay to win)",
            "review_score": "-1"
        },
        {
            "review_text": "The game is so American biased that it isn't even fun to play as anyone else half the time. If you get this game choose Americans. The Germans lose to everyone and the Russians lost to the Americans. It's rare to find a game where I win as Germany at this point. 10 games later and Americans have won them all. But although being so overpowered I still see American players crying about how they need buffed games and better weapons and bs. The Americans had beat Germany in WW2 due to help from every nation, rush tactics, and numbers. In this game the Americans win 1 on 1 to a German in most cases. When realistically that would never happen ever. And Russians had pure numbers and could almost never beat Germans 1 on 1 but that also isn't the case. I imaginet that since the Americans and Russians and the Allied forces won the war so that must mean they were really good. No the Russians only won because of the sheer amount of units overwhelmed the Germans. The reason Americans won was also because of numbers that overwhelmed Germans. In this game the German tankers can be overwhelmed by 2 infantry troops as it often happens. I wish I could play more to get a good taste but it's horribly hard to when you get back to back losses.",
            "review_score": "-1"
        },
        {
            "review_text": "- No tutorial - Boring  Don't waste your time",
            "review_score": "-1"
        },
        {
            "review_text": "literal worst game of all time ",
            "review_score": "-1"
        },
        {
            "review_text": "absolute ♥♥♥. just dont bother.",
            "review_score": "-1"
        },
        {
            "review_text": "The game could have been fun. Unfortunately the micro-purchases, the headache that is their menu/UI, and the game systems killed it.",
            "review_score": "-1"
        },
        {
            "review_text": "Current from of Heroes &amp; Generals is bad. Developing team is promising to fix biggest problem - The brainlessly planted spawnpoints. The Dev team has announced that next build would fix the spawn system but the glance what they have given to you, is not promising anything magnificent in near future.   It looks like that some other game will get my attention during coming holidays.  In order to play game it should be fun. Not a target practise simulator for snipers, infantry (scope) snipers and hip firing machinegunners (from over 100m distance).  This game still has potential, if they just could remove scopes from infanty - there are binoculars - why you need the scope in every weapon.   The spawn system.  You spawn behind approx 200m behind every capture point you capture, while defending team seems to spawn in your flank or closer to capture point.  I sinceraly do not understand why such mechanic needs to be kept alive.  The Dev team has brought to game 5 different trucks or armored personel carriers which does act as mobile spawn points.   My wishes to Santa Claus is that Reto-Moto developement team would reduce amount of scopes, add tripods(?) to machineguns and boosts strategic need of APC's by removing all spawn points except the main Bases (f.ex: O1, O2, A1, B1, C1, D1, E1)  Still for now thumbs down, I do not recommend this game to anyone.",
            "review_score": "-1"
        },
        {
            "review_text": "This game would be good if you took the stupid ♥♥♥♥ing bicycles out of it. It takes away EVERYTHING that this game could be as soon as I see someone on a god damned bicycle in the middle of a firefight riding around like an idiot.",
            "review_score": "-1"
        },
        {
            "review_text": "this game was alright when it was in beta, but now that they have launched it, it lags so bad that it is literally unplayable 0/5",
            "review_score": "-1"
        },
        {
            "review_text": "Everything is expensive and you have to grind on your ♥♥♥♥♥♥ gun while others get better tanks and more fun. BTW, if you accidently buys an extra character, good luck, you are stuck with it forever. No selling back, no discard. basically eye sore",
            "review_score": "-1"
        },
        {
            "review_text": "It used to be good, but the D-build killed the game. They have made some fixes, but I won't change my review until they bring back class switching.... good for me though, as I could bomb everyone without worrying about an enemy pilot spawning lol.  Edit: ehhhhh it's a little better now.",
            "review_score": "-1"
        },
        {
            "review_text": "no.. just no  you get more out from korean grinding MMOs from 2004 than this piece of ♥♥♥♥..  dont.. just dont",
            "review_score": "-1"
        },
        {
            "review_text": "Crashes a lot.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible, The game has ♥♥♥♥ mechanics and unfun to play. If you had the patience just to get to lvl 10 i clap for you",
            "review_score": "-1"
        },
        {
            "review_text": "No balance whatsoever. You will get decimated if you don't pay. It's fun in the beginning but then it's just horrible.",
            "review_score": "-1"
        },
        {
            "review_text": "i absolutely reccomend playing this game. ive been playing for years, but the devs are just too much, there is a such thing as over development. the origonal UI was greatm but they changed it. the origonal deploy system was great, but they changed it. they changed so many things in the game, and for veteran players like myself, it sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "They make the grind waaaaaaaay too much to make it playable. You have to spend money but if you even 40 bucks it is only enough to unlock 3 tanks for one faction. either Invest over a hundred dollars, or grind your life into oblivion.",
            "review_score": "-1"
        },
        {
            "review_text": "game is trash obvious P2W.",
            "review_score": "-1"
        },
        {
            "review_text": "If you're cool with putting down some money then this game might be fun, however if you're free to play than this game is incredibly boring. You hvae one weapon and literally everything is locked behind a pay wall. You have to pay to unlock anything that is even remotely awesome unless you're okay with speeding countless hours grinding the same map with the same weapon over and over again. And oh yeah, there are only like 2 maps available to F2P players. A disappointment to me.",
            "review_score": "-1"
        },
        {
            "review_text": "This has to be one of the most toxic, communities of the whole gaming world appart from league of legends. There are broken weapons in the game that no developers are looking at, and grind to earn credits is by far the worst of any game I have seen. If you wish to rip out your hair trying to capture a point or run the entire map only to be 1-shot at the destination you wanted after spending around 5 minutes of running there, then only having to wait for 10 of your team mates to die so you can do it all over again. DO NOT PLAY THIS GAME!!!",
            "review_score": "-1"
        },
        {
            "review_text": "I Very much believe that this game would be Amazing and a one of a kind WW2 FPS but wating 45 minutes, every single time i want to join a game,  sorry but i can not recommend this game! ",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is just a world of headaches if you would to have your time wasted then go right ahead and play this game",
            "review_score": "-1"
        },
        {
            "review_text": "I cant't fix the overlapping window even thoug I already closed all windows",
            "review_score": "-1"
        },
        {
            "review_text": "This Game is Trash its Very Bad . Lag Spikes with GTX 1070... lol anyways the 1st gun you get the game is HORRBILE takes 7 or so shots to kill a person depending on the range your shooting . W A S D move on there own which kills you if you have low health and on top of a building . Matching making takes for ever longer then CSGO much longer the most i ever had was 20 mintues ... i can have sex and eat pancakes and brush my teeth in 20 mintues ... so thats what i did . anyways enough joking this game in ♥♥♥♥ing bad and did i mention that is PAY TO WIN it takes hours to get the amount gold or sliver to upgrade you 1st gun which is trash don't waste 1 mintue of your life loading the game it takes 30 seconds for game to start loading . 15 seconds for the game to load (Depends on PC hardware) and also trucks and bike are hard to ♥♥♥♥ing control your gotta hold down W/S and D or A at the same time! and also the bike moves slower then running lol",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ game waste of my time dont even try to downloading it just buy any battlefield.",
            "review_score": "-1"
        },
        {
            "review_text": "IDK what to say I mean, the game won't run on my laptop for some reason, looks amazing but won't run",
            "review_score": "-1"
        },
        {
            "review_text": "I have atlon x2 2,7 ghz 4 GB ram and amd r7 265. Lag any map. old update is ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "i can`t recommend this with the grenades in the game.",
            "review_score": "-1"
        },
        {
            "review_text": "Its okay I guess.",
            "review_score": "-1"
        },
        {
            "review_text": "this game is now ♥♥♥♥, i loved it in 2015 but they ruined it. its worth a download and try since its free but if you had to pay for it, i would have wasted money",
            "review_score": "-1"
        },
        {
            "review_text": "Day 1: Alright here we go... my first game on my new laptop *Hype*  Day 2: Why is it hard to aim? Well at least im good at throwing gurnades  Day 3: Nice... i need more money now to change branch  Day 4: Still needs 50k more... around 15 matches if im good...  Day 5: Alright its all about 15k left for pilot... not going to took long time  Day 6: 'Hey bro, which one's better?' 'I would say tank is the best' 'But you get more fun they say being a pilot?' 'You do, if u can aim...' 'Shut up'  Day 7: Alright here we go... tough decision... i want to be a sniper instantly but i also want to have my own bird and get experience as a pilot support... but i also want to be in action fast paced on the ground with the tank, but its also amazing to jump off a plane tho... OMG which one should i choose?  Day 8: I JUST WASTED 50K BEING A PILOT... WHATS WRONG WITH RETO'S MATCHMAKING?! IM A LVL 3 PILOT AGAINST A MAJOR LIEUTENANT (Pardon me for mistype), RETO FIX THIS!  Day 9: Gosh i regret all my choice... let me just change back to Infant, there you go...  Day 10: I just realized that it tooks such a really long time just to make 10k... they say being a tanker can do faster tho  Day 11: *Farms for tanker*  Day 12: *Farms for tanker*  Day 13: *Getting depressed for Reto's matchmaking*  Day 14: *Thinking about making a new account so that its going to be easier*  Day 15: FINALLY I BECAME A TANKER, YEAY OLEH  Day 16: DANM son! 60k a day! what you gonna about that?!  Day 17: Boom headshot, boom headshot with my tank i boom headshot everybody  Day 18: LVL 11 now! yeay as a tanker!  Day 19: Why is the America's bazzooka so OP  Day 20: Nein Nein Nein! No sticky bomb! No NO NO NO neither Hafthohalldug (H3) at my tank! CURSE YALL  Day 21: WHY IS THE AMERICANS SO OP WITH THEIR STICKY BOMB! AND THE AXIS WITH H3?! (Me playing as Soviet)  Day 22: You know what? Let me try to be a German tanker  Day 23: WHY IS THERE AMERICAN'S CHAFFEE EVERYWHERE?!  Day 24: OK now i get it how to destroy a chaffee, GOT ONE!  Day 25: Still doing good... time for Luchs  Day 26: *Farm till day 30*  Day 30: OH MY GOD OH MY GOD OH MY GOD MY FIRST TRULY OP LUCHS HERE WE GO  Day 31: MAN IM SO GOOD WITH THIS  Day 32: That's a sick looking AUSF.H let me buy it...  Day 33: Why am i keep fighting the American's tank destroyer?  Day 34: F OFF M10! RETO PLS I WANT TO FIGHT SOVIET ONCE AT LEAST PLS! IM TIRED OF M10 AND HELLCAT I WANT TO FIGHT MEDIUM TANK ASWELL NOT TD  Day 35: PLS RETO JUST UN-OP THE DAMN M10 AND HELLCAT! EVEN GERMAN'S TD CANT PULL THEIR HULL AWAY  Day 36: *Opened steam* *News: Heroes &amp; Generals have been released*  Day 37: Yeay i can meet more new peeps!  Day 38: Helping the newbies and peoples in support, U maybe know my name familiar as imFDL  Day 39: 'ImFDL, how to start a game?' *explains stuff*  Day 40: Men... i like being kind to those peeps  Day 41: Now i need more money to buy a recon unit  Day 42: The server getting more laggy then even before...  Day 43: RETO PLS UPGRADE THE DAMN SERVER  Day 44: Quit from H&amp;G  The summary is, the game is truly badass to be played, until you get high lvl and the matchmaking just F you up by matching you with more high lvl peeps and player...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun and a good time passer, but getting better weapons take to long and it is basically pay to win.",
            "review_score": "-1"
        },
        {
            "review_text": "crappy graphics too confusing!!!!!!!!!!!!!!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "No game balance. Takes a lot of grinding. Hackers, hackers everywhere.",
            "review_score": "-1"
        },
        {
            "review_text": "as much as i want to love this game i cant due to bad fps and the devs wont help anyone + this game is a bit of a pay to win game i would give it a 50/100. i will change my reveiw to a thumbs up only if it could run better",
            "review_score": "-1"
        },
        {
            "review_text": "This game is one big cancer. After it come to Steam it's full of pro-gamerz and full of noobs as in a lot of games. But despite the people words that this game is 'realistic', it really isn't. It's maybe the most realistic shooter but the players behavior and many others contradicts this words. The luck is veeeeeeeeeery (maybe the most) important thing in this game.  H&amp;G is in beta version from 3 or more years (when it will be done?!!) so Finally but it's still bugged (confirmed). I think the balance never existed. And this feeling when you finally joined the game but your team is losing... and you can't exit the battle and search for new. You MUST end this annoying shitbattle and then you can do anything other. You can often see the situation in 'BALANCED' battle where opposite team have planes or/and tanks but your team haven't got any tank or plane. The next problem is then, when you get the second level (after i think 10 hours) . You can play even with general who have the best and full upgraded gun and you have poor, useless MP34 or not even better Gever43.  You must have nerves of steel to play this or play with friends.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is fun and a good time passer, but getting better weapons take to long and it is basically pay to win.",
            "review_score": "-1"
        },
        {
            "review_text": "EDITED: It's was a good game.. but seriously this game need optimisation for 'Minimum Specification Player'",
            "review_score": "-1"
        },
        {
            "review_text": "I can't play myboton virus protector won'tlet me playthis gamessucks!",
            "review_score": "-1"
        },
        {
            "review_text": "5/10  Pro's: -You get to shoot and blow stuff up  -Game had a good idea, different from anything else out there. -Game mechanics are solid for the most part -Game is actually free.  -Graphics are pretty good  Cons: -No Tutuorial, Just messages all over the place when starting, HUGE learning curve. -No Anti-Cheat,  -When choosing Jobs, IE Paratrooper, tank, fighter pilot etc... system does not tell you before hand (or at least its not clear, like the small lettering on the bottom of a contract) what kind of weapons you can use. -Most maps you play you wont earn enough credits to repair the equipment you use.  -Game almost forces you to pay for weapons and veteran account. -Getting out of vehicles Needs to be fixed. Game runs good until someone rolls up and hops out of the vehicle, then they turn into Nightcrawler and start teleporting 5ft. -Credits in this game are HUGE to players that dont want to pay to win. When you get thrown into an already started map and dont expect to earn many credits, in fact you may actually LOSE credits.  -The way you rank has a lot to be desired. You could go 30-0 and get less points then someone who went 0-30. Snipers really get screwed here. I often sit in a shady place and get a lot of kills, but not much experience. Also to capture a point sometimes it's a small tiny room, so you have 10 guys all cramped in this tiny room to get their capture points only to get killed by one tank hit or gernade. It's all about capturing points. My buddy isn't the greatest at this game, but he can sit in a room so he usually gets more xp than me, even though on average I triple his kills and 1/2 his deaths. -Bazooka's, Horrible, 3 sometimes 4 hits to kill a tank while penetrating armor each hit,  If you shoot a bazooka at a person and it actually hits them, you kill them, If it hits 2 inches away from them, like the wall behindor next to them, or the ground, not even 1/2 life woonded. give me a break! but a gernade will kill? - Oh and USA allways loses in the Wars, Go figure right.  This is a free game but a shooter without an anti hack, thumbs down.   Suggestions: -dont make it take a century to hit LT and a 1000 years to make general, I wont live that long. -Fix Bazooka's Not killing infantry -Lower repair and ammo costs for your weapons or increase in game Credits earned -Fix Defending Zones, make it so if you kill someone in the radius of a zone you get defending points. As a sniper it makes me SOOO mad killing someone outside of a door, when 1 foot inside I would get defender points.",
            "review_score": "-1"
        },
        {
            "review_text": "Very unbalanced game.",
            "review_score": "-1"
        },
        {
            "review_text": "ita not a good game there is no explanaiton on how things work",
            "review_score": "-1"
        },
        {
            "review_text": "DONT WASTE YOUR TIME!!   Hacking and cheating are out of control! Reporting players does zero good, (and it's so obvious)..Pay to win game totally, the Americans are so horrible in this game they hardly ever win, the Russians win EVERY battle over and over!! BORING!! Graphics are sub par, waiting to get into a match takes at least five minutes on avarage, the pay outs for battles are just a 'slap in the face' junk, costs so much to resupply and fix your equipment you make little or no profit at all, prices for pay items WAY to high! Now all the guns that were any good are being nerfed...WAY to many BETTER games out there for me to waste my free time on.. Count me out!",
            "review_score": "-1"
        },
        {
            "review_text": "Launcher is broken, cannot start a game.",
            "review_score": "-1"
        }
    ]
}