{
    "app_id": 2280,
    "name": "Ultimate Doom",
    "release_date": "2007-08-03",
    "developer": [
        "id Software"
    ],
    "publisher": [
        "id Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Classic",
        "FPS",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 3705,
    "negative_ratings": 257,
    "price": 3.99,
    "description": "The complete megahit game that set the world afire. Plus All-New Episode IV: Thy Flesh Consumed. The demons came and the marines died. Except one. You are the last defense against these hell-spawned hordes. Prepare for the most intense mutant-laden, blood-splattered action ever!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/2280/header.jpg?t=1533064907",
    "minimum_requirements": "A 100% Windows XP/Vista-compatible computer system",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "The best FPS ever made.",
            "review_score": "1"
        },
        {
            "review_text": "best fps game. its story and dialogue are beautifully written. into the title.",
            "review_score": "1"
        },
        {
            "review_text": "Doom is a household name for good reason. It's a game that brought the gaming industry to it's knees and changed the landscape of video games and software forever. Doom resulted in the widespread adoption of the Windows operating system and later the creation of DirectX. Doom popularized the first person shooter, which is now one of the most popular video game genres. It directly lead to custom maps, modifications, source code releases and online multiplayer being a thing.  Most importantly, Doom is a symbol. It's a symbol of everything good in video games. It is the product of nights spent computer programming, playing Dungeons and Dragons and wishing fervently to make, 'That game'. That game you fantasize about playing in the back of your mind, that game you think people will judge you for playing, that game that you play 20 years later and find it's still as fresh as the day you bought it.   Doom; 'That game'",
            "review_score": "1"
        },
        {
            "review_text": "you cant say DOOM without caps lock or yelling it!",
            "review_score": "1"
        },
        {
            "review_text": "Kids, let me tell you about an ego shooter of yesteryear. One of THE ego shooters of yesteryear, to be precise: DOOM!  It may not look like much nowadays, but it's still a fantastic, fast-paced shooter with (rather) open maps, great soundtrack (seriously, I love it!) and lots of hellspawn to take apart! And not only is it still a great game, but it still has an active modding community. If that's not amazing, then I don't know what is!  I've played through the game with the Brutal Doom mod, btw., which makes the game EVEN better! Seriously, give it a spin! DO IT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Oldchool shooter. Simple, fun, challenging. You just start the game and having fun, killing enemies, using powerful weapons, finding secrets. - No cover. - No health regeneration. - No checkpoints. - No useless cutscenes. - No talks. -------- Just you and mayhem.",
            "review_score": "1"
        }
    ]
}