{
    "app_id": 229480,
    "name": "Dungeons & Dragons: Chronicles of Mystara",
    "release_date": "2013-06-18",
    "developer": [
        "Iron Galaxy Studios"
    ],
    "publisher": [
        "Capcom"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Beat 'em up",
        "Action",
        "Arcade"
    ],
    "achievements": 24,
    "positive_ratings": 785,
    "negative_ratings": 180,
    "price": 11.99,
    "description": "Dungeons &amp; Dragons: Chronicles of Mystara brings reworkings of two of Capcom’s classic arcade hits - Dungeons &amp; Dragons: Tower of Doom and Dungeons &amp; Dragons: Shadow over Mystara – together in one definitive digital package.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/229480/header.jpg?t=1550021101",
    "minimum_requirements": "OS:Windows Vista (Does not support Windows XP) Processor:Intel Dual Core 1.8GHz (or higher) or AMD Athlon II X2 (or higher) Memory:1 GB RAM Graphics:nVidia GF6600 (or higher) or ATi X1600 (or higher) with 256MB of RAM DirectX®:11 Hard Drive:350 MB HD space Sound:DirectSound compatible, DirectX 9.0c (or higher) compatible Other Requirements:Broadband Internet connection Additional:DirectX 11/Shader3.0 or higher",
    "recommended_requirements": "OS:Windows 7 Processor:Intel Dual Core 2.4GHz (or higher) or AMD Athlon II X2 (or higher)  Memory:2 GB RAM Graphics:nVidia GF8000 (or higher) or ATi X1800 (or higher) with 256MB of RAM DirectX®:11 Hard Drive:350 MB HD space Sound:DirectSound compatible, DirectX 9.0c (or higher) Other Requirements:Broadband Internet connection Additional:DirectX 11/Shader3.0 or higher",
    "reviews": [
        {
            "review_text": "As someone who has never played the old arcade games I can still recommend this one - it's challenging but fun and full of secrets that aren't shoved down your throat. I've yet to try online multiplayer so I can't comment there, but the single player and local co-op is fantastic.  It makes me wonder why fantasy brawlers aren't more common, I'd definately pay for a modern brawler like this.",
            "review_score": "1"
        },
        {
            "review_text": "A couple of classic arcade beat 'em ups bundled up with online co-op and achievements and other goodies. These games will kick your ♥♥♥ to next week, but don't sweat it! There's no quarters involved here.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an excellent example of nostalgia. I used to play this game to death back when it was in the arcades. It was so much fun then and it still is. Huge recommendation from me.",
            "review_score": "1"
        },
        {
            "review_text": "Dungeons &amp; Dragons: Chronicles of Mystara is a port from the classic arcade games of my youth to our current digital age. The gameplay is how I remember of the games though I wasn't one to have many quarters to blow back in the day.  If you have any love of old-school side scrolling brawlers with a touch of the D&amp;D mythos, then this is a fantastic game for you.",
            "review_score": "1"
        },
        {
            "review_text": " The pair of games in Capcom's Dungeons &amp; Dragons: Chronicles of Mystara collection may very well be the best of its beat-'em-up games from the '90s arcade era, and these ports from Iron Galaxy are the most robust versions of the duo of Tower of Doom and Shadow Over Mystara to date. The 1999 Sega Saturn ports were exclusive to Japan and were unfortunately downgraded from four-player to two-player co-op, but these new HD ports are upscaled versions of the four-player arcade originals with a few modern additions, such as visual filters, unlockable rules, and concept art. Of course, the real draw is the co-op beat-'em-up experience, which has stood the test of time surprisingly well. It's a return to form for these nearly 20-year-old games; for players who remember them, and even those who don't, Chronicles is worth the time it takes to wrangle a party of warriors and suit up for battle.  Coming toward the end of Capcom's stint in side-scrolling brawlers, these games are far more advanced than was typical of the genre at the time, when their contemporaries included only temporarily equippable secondary weapons and a small selection of combo attacks and special moves. Capcom took a more role-playing-game-like approach by including elements of level progression, optional equipment, and supply shops. There are branching paths and conditional events, and even the name you give your character determines certain factors of your character's skill and equipment loadout. These nuances, especially in Shadow Over Mystara, with its advanced Street Fighter-like inputs, provide plenty of depth. There are moments when fighting common enemies becomes repetitive, but it's not difficult to find new ways to play to keep the experience fresh; it's often as easy as choosing a different character and exploring their distinct moveset.  You and your co-op cohorts have four character classes to choose from in Tower of Doom: fighter, elf, cleric, and dwarf. Shadow Over Mystara contains those four and adds the thief and magic-user classes to the roster. The classes differ quite noticeably in speed, power, and abilities, and though you can charge your way through the game with any selection thanks to unlimited continues, it's a far more rewarding experience to plan and build a team of complementary characters. The availability of unlimited continues is good in the sense that it lets you see everything the game has to offer, but it ultimately cheapens the thrill of victory.  Typical thief. Picking up loot while everyone else does the dirty work.  Both Tower of Doom and Shadow Over Mystara were designed for co-op play, and though playing solo can be enjoyable, it pales in comparison to the fun that can be had when joining up with a team. Without expert knowledge of the nuanced controls, such as the proper timing of a riposte with the cleric, it's not uncommon to die quite frequently when fighting monsters on your own. Each class's default abilities are detailed in the main menu, but it will take considerable practice to memorize, and consistently perform, some advanced but crucial maneuvers, a task that's more easily done when someone has got your back.  Health pickups are few and far between, but again, the unlimited-continues system negates their worth. Don't bother spending money on health in shops between levels (unless you're chasing a high score); you're fully revitalized the next time you continue after death. It's the nature of a direct arcade port that doesn't include a coin limit. The unlockable Elimination mode does away with the default continue system--entirely. Once it's enabled, you die the first time your HP runs out. This is good for those trying to prove their mastery, but it doesn't really resolve the hand-holding nature of the default system in a desirable fashion.  And people wonder why dragons get such a bad rap.  Of course, judging classic games by modern standards is tricky. Ultimately, it comes down to expectations. Tower of Doom and Shadow Over Mystara were revered upon release, but their classic traits can be off-putting without a nostalgic perspective to give them context. Players who have graduated from the past and are looking for a more advanced experience may view this collection as a lighthearted diversion. However, for anyone who has waited the better part of two decades to play these games, their arrival on modern platforms is nothing short of awesome. Dungeons &amp; Dragons: Chronicles of Mystara is a great port of two delightful games, and unsurprisingly, they're the very best versions that you can get your hands on.  The Good  Two sought after arcade games in one package.   The classic gameplay holds up better than that of their contemporaries.   RPG elements add necessary depth to the beat-'em-up formula.  The Bad  Unlimited continues sully the joy of victory.   Too few enemy types.  7/10  Good ",
            "review_score": "1"
        },
        {
            "review_text": "Yes, it is possible to play this for free on MAME. But honestly, you should support this game. It's rare to see Capcom actually making PC ports of games like these. Especially on Steam, with full Steamworks support. The netcode is very good and both games run smashingly as they should. Iron Galaxy needs to continue making more of these kinds of Capcom ports on Steam. Must buy if you like Capcom beat-em-ups.",
            "review_score": "1"
        },
        {
            "review_text": "This is an arcade game with more secrets than a souls game.",
            "review_score": "1"
        },
        {
            "review_text": "are you a bad enough dude for some kickass arcade combat i used to play the crap out of this as a kid i cant wait to play the ♥♥♥♥ out of this",
            "review_score": "1"
        },
        {
            "review_text": "Classic arcade action with surprising depth and A Lot of replay value with the different classes and paths to take. Also, you get two games in one, and nice, fun unlockables to reward your play. If you have any interest in the great arcade classics, this is definitely one for the list.",
            "review_score": "1"
        },
        {
            "review_text": "These are some of the greatest arcade game memories of my youth right here. I used to go to The Copper Que and pump quarters into this game like it was going to save all of Mystara! This along with other fighter and side scroller arcade games are the prime time of Capcom in my eyes, a glory that it has yet to reclaim, but at least we can play these old classics.",
            "review_score": "1"
        },
        {
            "review_text": "where insert coin",
            "review_score": "1"
        },
        {
            "review_text": "This brings back so many memories  very well made classic arcade game",
            "review_score": "1"
        },
        {
            "review_text": "Classic Arcade Game that Never Gets Old",
            "review_score": "1"
        },
        {
            "review_text": "It is hard to describe the awesomeness that is this game. Frankly...........I worry the people who coded it cared too much and I would like to hire them. For LET'S PLAY! please watcH:          YouTube™ Video:  LET'S PLAY!: D&amp;D&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "You can switch between the two games, Tower of Doom and Shadow of Mystara. Tower of Doom's game play is slow and clunky. But Shadow of Mystara feels nice, like good ol' times. No tutorial, throws you in first level and then learn the buttons as you play, unless you go to the controls settings first.",
            "review_score": "1"
        },
        {
            "review_text": "For anyone who 'members.... Pumping quarters into these machines trying to beat the final boss. This is a much cheaper alternative. Hold up amazingly well.",
            "review_score": "1"
        },
        {
            "review_text": "Fun 2 games in 1. Check it out.",
            "review_score": "1"
        },
        {
            "review_text": "I got this off game fly with a coupon form retailmenot for a total of 4.99. So worth.",
            "review_score": "1"
        },
        {
            "review_text": "A Shadow of Mystara review  At first, this game might seem bland and out of balanced, yet if you give it some time you discover how much fun it can be, that is, if you like the genre. For a beat em up you have tons of variety in spells, items, classes and different paths you can take on, adding lots of replayability. It should be noted, that some people have some crashing experiences in the main menu, but I haven't heard anyone dropping from the game yet, so all things considered, it gets a pass in my book.  Multiplayer is for up to 4 players and there is 6 classes to choose from: Fighter, dwarf, elf, cleric, thief and magic user. They have some of the basic things in common, like basic combo and slide, but there is major differences in how they actually play. For example, dwarf has a lots of tankiness but is somewhat slow, while thief is weaker but can backstab, double jump and steal items.   Game rewards people for teamwork, and a right team saves of a lot of continues, since every class is tailored for something: Fighter, dwarf and thief are good for killing standard mobs, while cleric has a heal and stat boosting abilities, lastly Magic user and elf are useful for killing bosses. This doesn't mean you can't solo the game with any class without dying once if you have played it enough and know it's gimmicks.  At the moment of this recommendation, there is a a few players in online, so you still have a chance to play this on multiplayer even if you can't get your friends to play this. This game is made in 1993, however, it has aged well since it was made for the arcade board. Just remember to change filters and resolution from the options first.   For a nitpick, I'd say it is a bit on the easy side, because you get unlimited credits by default. You can later change survival mode on, which causes everyone to have only one life, but it would've been better, if you could set the amount of credits yourself.  With it's good replayability, animation and presentation, this title was a classic of it's time and before Dragon's Crown comes out, it doesn't get better than this.",
            "review_score": "1"
        },
        {
            "review_text": "I first played this game in my town's arcade when I was a wee little tyke, so maybe I'm looking through some rose-tinted glasses here, but I love this game. 'Shadow Over Mystara' specifically, since this includes both Shadows, and 'Tower of Doom'. The controls if you're using a keyboard are rather wonky, so I highly recommend using a controller. If you've played either of these games before, you know what you're getting. My favorite option though is the inclusion of a scan lines options and removing the HD smoothness for that pure nostaglia feel. If you're looking for a new age beat'em go play Dragon's Crown, this game is still fantastic, but it is dated.",
            "review_score": "1"
        },
        {
            "review_text": "A Shadow of Mystara review  At first, this game might seem bland and out of balanced, yet if you give it some time you discover how much fun it can be, that is, if you like the genre. For a beat em up you have tons of variety in spells, items, classes and different paths you can take on, adding lots of replayability. It should be noted, that some people have some crashing experiences in the main menu, but I haven't heard anyone dropping from the game yet, so all things considered, it gets a pass in my book.  Multiplayer is for up to 4 players and there is 6 classes to choose from: Fighter, dwarf, elf, cleric, thief and magic user. They have some of the basic things in common, like basic combo and slide, but there is major differences in how they actually play. For example, dwarf has a lots of tankiness but is somewhat slow, while thief is weaker but can backstab, double jump and steal items.   Game rewards people for teamwork, and a right team saves of a lot of continues, since every class is tailored for something: Fighter, dwarf and thief are good for killing standard mobs, while cleric has a heal and stat boosting abilities, lastly Magic user and elf are useful for killing bosses. This doesn't mean you can't solo the game with any class without dying once if you have played it enough and know it's gimmicks.  At the moment of this recommendation, there is a a few players in online, so you still have a chance to play this on multiplayer even if you can't get your friends to play this. This game is made in 1993, however, it has aged well since it was made for the arcade board. Just remember to change filters and resolution from the options first.   For a nitpick, I'd say it is a bit on the easy side, because you get unlimited credits by default. You can later change survival mode on, which causes everyone to have only one life, but it would've been better, if you could set the amount of credits yourself.  With it's good replayability, animation and presentation, this title was a classic of it's time and before Dragon's Crown comes out, it doesn't get better than this.",
            "review_score": "1"
        },
        {
            "review_text": "When I was a kid I sunk countless hours and quarters into an arcade version of this game that was stationed at my local comic book shop. Even if I were to time travel back to myself and say 'Hey you, don't waste your money, you'll be able to play all you want for free when this game hits steam in your distant future' I probably wouldn't have cared and gladly sank all my quarters into the arcade slot again. Just like I endearingly remember it.  Also, total 4 player co-op fun! I got a USB hub and some cheap logitech controllers and had some friends over for a very nostalgic evening of orc whooping.",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia that's pleasantly pleasing with its replayability. Unless you're playing with Xev. Then that ♥♥♥♥er never wants to stop.",
            "review_score": "1"
        },
        {
            "review_text": "Greet arcade port - lots of fun! This is also a very well-done 90's beat em up.",
            "review_score": "1"
        },
        {
            "review_text": "The game is very short, but also very entertaining. Well worth the sale price.",
            "review_score": "1"
        },
        {
            "review_text": "Easily the two best beat em ups that Capcom ever created.",
            "review_score": "1"
        },
        {
            "review_text": "Nostalgia that's pleasantly pleasing with its replayability. Unless you're playing with Xev. Then that ♥♥♥♥er never wants to stop.",
            "review_score": "1"
        },
        {
            "review_text": "Well... What there's to say? One of the best beat-em-ups ever, DnD-packed 4 players coop fun. Freakin' classics that's what it is. If you like newcomers such as Castle Crashers or, for example, Fist Puncher- you must do yourself a favor and pick this up. On the downside- there is crappy graphic filters, and kinda overpiced tag to spoil the fun.. Well, i encourage you to wait for sale and get this marvelous gem of beat em up genre. It rocks. Really.",
            "review_score": "1"
        },
        {
            "review_text": "Greatest RPG Ever Made Hands Down",
            "review_score": "1"
        },
        {
            "review_text": "EEEEEEEEEEEEEEEEEEEEEEEE! *Takes A Deep Breath* Ok, I'm good now. I remember wasting hundreds of hours on these games back when they were in the arcade. Sure, my delight may be partially due to the nostalgia factor, but there is still lots of fun to be had, and best of all you don't need any quarters!",
            "review_score": "1"
        },
        {
            "review_text": "Great arcade game. Solid enough port. Also cheap to boot. If you liked the arcade version, this'll keep you occupied.",
            "review_score": "1"
        },
        {
            "review_text": "Classic arcade beat 'em up action with RPG elements. Chronicles of Mystara keeps the gameplay fresh on every level, and keeps you pumped to push forward. It's almost rewarding to hammer into the enemies with the fighter, or blast them away with the magic user. Plenty of classes to choose from, exciting co-op. Local co-op so you can play with your friends in the same room, and option for online play make this a wonderful title to own. Bought it at full price, and worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "Capcom's best beat 'em up, and the milestone by which all others are measured. If you don't like this game please let me know so I can remove you from my friends list and/or block you.",
            "review_score": "1"
        },
        {
            "review_text": "Old-school arcade beat-em-up with modern game mechanics and retro graphics. Very nicely done. This is not for people who like fluid, highly-responsive action combat, as the controls are (intentionally) period-specific to a frustrating extent. Great for small get-togethers, as it supports up to 4 players who can drop in and out freely. Definitely has something to offer beyond the nostalgia value, but likely not for $15. Pick it up if you find it discounted and you're really itching for a good party game.",
            "review_score": "1"
        },
        {
            "review_text": "It feels like playing the arcade game! If you enjoyed playing this game, you'll love it here. Beat 'em up action, incredibly faithfull to the source material. Its all incredible. 8/10.",
            "review_score": "1"
        },
        {
            "review_text": "You will all go to hell if you don't get this game.",
            "review_score": "1"
        },
        {
            "review_text": "Real solid gameplay. My only problem is that I bought this game for me and a friend because we wanted to play it together. But he can't run the game at all. Apparently some glitch that Capcom hasn't patched yet PLEASE FIX THIS BUG, CAPCOM",
            "review_score": "1"
        },
        {
            "review_text": "Dungeons &amp; Dragons: Shadow over Mystara is my favorite arcade game. No competition. If you have any interest in arcade beat'em ups I recommend checking both these games out.   There is controller support. Use an Xbox360 controller to slay fiends with your friends.  Multiplayer works perfectly. Change your PingThreshold to 500 in matchmaking setting to make it easier to find a game.   STICK TO SNAKES!!!",
            "review_score": "1"
        },
        {
            "review_text": "Loved this game in the arcade back in the olden days   Still fun but not really a solo game.",
            "review_score": "1"
        },
        {
            "review_text": "best old school arcade i can remember....now i have it at my desposial MUAHAHHAHAHAHAA!!",
            "review_score": "1"
        },
        {
            "review_text": "Very good beat em up with branching paths based on the choices you make between the levels.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite arcade games as a kid still holds up today. Combat depth with every character playing very differently,  as well as the controls still being as intricate as they were on the cabinate.  speaking as a fan, if you were into this back in the 90s... a must buy.  though they did remove the continue sound bite, 'welcom to a dnd world!'  as a modern gamer... This is a traditional arcade port in the sense that the development sensibilities remain the same... meaning, it was made to kill you. you need to get use to  the controls as some of the more expected simpler actions may seem complicated to pull  off in various scenarios, i.e. blocking during combat against a horde of enemies may  frustrate you. you hold attack then move Backward to block... pulling off a slide is worse lol.  for me, its not a problem... its like getting into marvel v capcom 2 again... but for the modern gamer... it might take some effort.   all in all, it is pretty true to basic dnd and the controls are tight and responsive.  the games are both pretty content heavy, with multiple choices and routes to take or  discover on your adventure.  The game functions very well... No framedrops as far as I've seen... and no crashing. I bought this as soon as it came out... played it for like an hour or two... and loved it...  as of this review... I only recently hopped back into it after taking care of some of my backlog... and am full hooked again... its a great game to jump in and out of...  if your not into playing any of your games atm but still want to just play something...  This is it.",
            "review_score": "1"
        },
        {
            "review_text": "I just can't recommend it. Brilliant game let down by a terrible port. Multiplayer is impossible to get working, i've had better lucking MAME emulating through a Raspberry Pi. Total waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "Does not support USB controllers outside of dedicated XBox controller. Amateur stuff.",
            "review_score": "-1"
        },
        {
            "review_text": "While it has some nostalgic value, the graphics looks fuzzy (due to scaling) and old and very unimpressive. 'Tower of Doom' has a slightly better gameplay where magic/skills is involved, but still far from what modern controllers are capable of. Also, I'm pretty sure I the graphics to be better in the arcade machines. maybe this is a conversion of the console versions...",
            "review_score": "-1"
        },
        {
            "review_text": "The Chronicles of Mystara features D&amp;D Tower of Doom, a god effort that feels poor when faced to his sucessor, Shadow Over Mystara, wich IMO is the core game of this pack. This game (Shadow over Mystara) was so amazing back in his time. Nowadays still brings good memories filled with nostalgia and bread with nocilla, plus crapcom did a decent work with crappy HD pixels, adding a nice interface and new features in the style of actual games (items list, achievementes, online scoreboards, statistics and challenges, online gameplay and all that stuff that makes replayable a game. Two things I would not forget to mention, you CAN PLAY fullscreen, without the border frame showed in the store pics &amp; trailer, that's something I didn't see mentioned already, the other important thing is that ONLINE MULTIPLAYER CANNOT BE PLAYED WITH LOCAL BUDDIES, you'll have to choose wether you go online or play couch coop.  I will not recommend this game cause we all know it won't offer nothing really new, they only made a pixelpolish, added a poor interface and few tweaks without really revamping this game. Anyway still offers the same fun that made it one of my all time favorite games. If anyone should buy this it will be old school gamers in a nostalgic rampage (just like me)",
            "review_score": "-1"
        },
        {
            "review_text": "The controls are bad and awkward. No controller support? And who the hell uses the arrow keys to move anyway? People are *used* to WASD, why couldn't this game at least stick to that?  I bought this because it hit me right in the nostalgia, but I'm just disappointed.",
            "review_score": "-1"
        },
        {
            "review_text": "Unlike 'Injustice: Gods Among Us' (which has full controller support correctly coded), Capcom decided to only support Microsoft Xbox 360 controllers! Its the 'games for windows' equivalent of PAIN. You will need to download another guy's program (x360ce) to get this game to work with anything else. Bad job, Capcom, really bad job.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst game remake i have ever played in my life  This game isnt worth a dollar",
            "review_score": "-1"
        }
    ]
}