{
    "app_id": 229870,
    "name": "ShootMania Storm",
    "release_date": "2013-04-10",
    "developer": [
        "Nadeo"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Multi-player",
        "Steam Workshop",
        "Partial Controller Support",
        "Includes level editor"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Action",
        "FPS",
        "Multiplayer"
    ],
    "achievements": 0,
    "positive_ratings": 648,
    "negative_ratings": 101,
    "price": 16.99,
    "description": "ShootMania the FPS “Powered By Players”ShootMania Storm is revolutionizing the multiplayer FPS by adding a community dimension and unlimited replayability. Developed by the Nadeo studio, renowned for community racing game, TrackMania, ShootMania Storm boasts quick-fire matches and epic battles, where only your talent will distinguish you...",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/229870/header.jpg?t=1494322434",
    "minimum_requirements": "OS:Windows XP / Vista / 7 / 8 Processor:1.5 Ghz Memory:1 GB RAM Graphics:256 Mb, Pixel Shader 2.0 / Intel HD 2000  DirectX®:9.0c Hard Drive:2 GB HD space Other Requirements:Broadband Internet connection",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Currently the best competetive FPS game experiance on Steam. The FREE demo lets you play competitive, so its easy to convince your friends about giving a chance for this game. If you sick from cheating (like me), this is still your game, because the cheater population is pretty low. I play this game for months, and never met a single cheating person in SM, and this is a very memorable thing nowadays. As you can see on the pictures, this game don't contain automatic rifles, so don't expect anything like it, only laser, rockets, every weapon pinned to a location, so its your call what to choose, but be smart. It's an 'unreal' arena battle with low gravity, walljump ability and various team managment (1v1,3v3 - and theres a solution for 2v2) It's not easy to aim here, but the full game containts DM, where you can become skilled, with some practice. Also if any of your friend buy the full game, ask for the Super Invitation. It's free (only cost LP, but not real money) but whitout it, you can only play a few matches/day, which can be very irritating, especially if you close the day with a loss (who likes that? :D) After playing with various games on the highest competitive level for more than 10 years, I recommend this game as much as I can. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Short review, bc i played this game a short time for now:  Fast Paced first person arena shooter. So far. So good. It´s a really fascinating game, making points with an interesting cartoonlike grafic (+), a lot of different mods(++), players can create their own mods and maps(++), and the most important a good fighting system. You can improve a lot even after thousands of hours playtime.  Easy to learn - hard to master - a key principle for a competitive game.  BUT (-!) the community is quite small. The only Servers, that are played on recently, are in Europe. So it´s up to you to fill this small game with life, to improve in it and to improve the game itself.",
            "review_score": "1"
        },
        {
            "review_text": "Quake with trackmania physics.",
            "review_score": "1"
        },
        {
            "review_text": "Should rly pick up this game^^",
            "review_score": "1"
        },
        {
            "review_text": "Hi, everyone, check out my profile for more helpful reviews!    I was so excited about this game when it came into Steam. It was going to be a worldwide game, which was exciting, supposed to have its own tournaments, and was made by the same guys who made TrackMania. The trailer looked fun, intense, and fast, which is just the kind of game I like. The only problem with it is when it launched.   It had many members/players at first, and it was easy to find a server with your friends on it. Overtime, though, it seems like everything sorta went downhill from there. Less Americans (I'm American) played the game, and soon, there were only players from certain regions. Honestly, if I knew that, I wouldn't have purchased the game. It has different gamemodes and fast gameplay, probably would've been one of my favorite games on PC, but sadly, I couldn't understand anybody on my servers. Once a month, it seemed like, there was finally someone that spoke English, but over time, the probability of finding someone in your country became as small as a grain of sand.   It's not a buy to win game, thank goodness, and has seperate gamemodes that you can download. However, there are excessive ads on TrackMania2, and after a while, that gets kind of annoying. There are three different weapons, one's similar to a sticky bomb launcher, which you get underground, the lightning gun, which you get in long range gamemodes, and then you have the plasma shooter, as you can see on the title picture, which is the deault weapon you use all the time.   I'd give this dying multiplayer game a 7.5, and please consider this review before you purchase the game. Thanks for reading this, and again, check out my profile for more reviews!",
            "review_score": "1"
        },
        {
            "review_text": " 10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "love this game &lt;333",
            "review_score": "1"
        },
        {
            "review_text": "Extremely addictive, needs more maps as I've already played this to death. Doesn't stop me from coming back though. Best FPS in a long time!",
            "review_score": "1"
        },
        {
            "review_text": "Great Game +++",
            "review_score": "1"
        },
        {
            "review_text": "This is an excellent game for those who are thirsty for some new challenge! It´s not just shooting you have to learn, its also jumping and usage of your 'boost'. You just can't master them all at once, but once you master you can even challenge the top players of the game.  I recommend this for any European player who likes to parkour, shoot people from mid air, trying to be Tarzan or who likes lasers and rockets!",
            "review_score": "1"
        },
        {
            "review_text": "it's best game",
            "review_score": "1"
        },
        {
            "review_text": "this game is totes amaze",
            "review_score": "1"
        },
        {
            "review_text": "Although is a really solid FPS game with an arena feel it's pretty much dead, unfortunatly.",
            "review_score": "-1"
        },
        {
            "review_text": "The first FPS and THE BEST FPS for me. Why? Because it challenges me, it`s not easy to play and you have a LOT of FUN. There are some awesome Cups where you can win money. The community is not big but also not the best. You have to play this game for 1year until you are really able to play competitive!!! ",
            "review_score": "1"
        },
        {
            "review_text": "This game is, in my opinion, absolutely frustrating. However, the more you play and the better you get the more fun it becomes! By the time you reach gold it is just fantastic.  I recommend watching some competetive match on youtube, e.g. the 2013 ESCW finale aAa vs Lemondogs, as they are highly entertaining and will give you a glimpse of what the game can be like. Although I do advise playing it together with friends, rather than solo q-ing. Also it has a small community so expect the playable time to be limited to the normal EU peak times in elite matchmaking and the other gamemodes.",
            "review_score": "1"
        },
        {
            "review_text": "this was my favourite game back in the day when it was new now there are just no players ,this was one of my favourite games plz get the servers back",
            "review_score": "1"
        },
        {
            "review_text": "Speed, Reaction, Aim = Must Have",
            "review_score": "1"
        },
        {
            "review_text": "Recommended !",
            "review_score": "1"
        },
        {
            "review_text": "Hardly anyones plays this and it is boring very fast. Just play TF2, it is free!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Servers are dead and if you finally find one you can't join the game. This game is not worth a buck. I made huge mistake buing this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Fast action packed game - so fast movements and reflexes are required - 8/10",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game it has fast pased action and alot of replayability",
            "review_score": "1"
        },
        {
            "review_text": "Best Arena Shooter ATM!",
            "review_score": "1"
        },
        {
            "review_text": "I really appreciate this game and maby you will to it inovates the 'fast combat shooting' wich at my point of view is just amazing ",
            "review_score": "1"
        },
        {
            "review_text": "Very fun game actually, Better than i expected, with free shooting + flowing. This is worth getting it",
            "review_score": "1"
        },
        {
            "review_text": "Lightning fast and responsive controls melt together to create an adrenalin pumping smoothie tricked out with neon lights. Deathmatches induce arm pit sweating tension while the team based modes fill you with glee that make you want to shout out loud like a little girl. I recommend this to anyone interested in the genre or for those who just want to blow some steam, from their wrists.",
            "review_score": "1"
        },
        {
            "review_text": "This game really pushes the boundaries of teamwork in a game. you can go it alone, and not assist your team, or coordinate at all, but by doing so, you put yourself at great risk. with it's '2 hit elimination system' you really need to watch out, and defend your teammates, as each of you can only take 2 hits. If you are looking for a game that pushes you, and tests how good of a team player you are, then this is the perfect game for you. If not, i still recomend it, as it's gameplay and comminuty are super friendly, and the game itself is extremely fun.",
            "review_score": "1"
        },
        {
            "review_text": "Fast paced, action packed, and a rewarding skill curve.  In my opinion one of greatest FPS deathmatch games to date, overshadowed by the Quake/Unreal tournament series, but it brings a unique style of play in a way which is so easy to pick up but takes a lot to master, the Engine is excellent, has LAN support.  If your on the fence with this game, I'd recommend this game, you won't be sorry.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic Adrenaline boost combined with great e-sport features, ShootMania Storm is as every bit addictive as Trackmainia! 9/10 a must have for every old school shooter fan!",
            "review_score": "1"
        },
        {
            "review_text": "I like the gamemode called Obstacle. I always meet good people there and they help me finish the level. Love the game, love the mechanism of the game.",
            "review_score": "1"
        }
    ]
}