{
    "app_id": 2300,
    "name": "DOOM II",
    "release_date": "2007-08-03",
    "developer": [
        "id Software"
    ],
    "publisher": [
        "id Software"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Cloud"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Classic",
        "FPS",
        "Action"
    ],
    "achievements": 0,
    "positive_ratings": 2517,
    "negative_ratings": 182,
    "price": 3.99,
    "description": "Let the Obsession begin. Again. This time, the entire forces of the netherworld have overrun Earth. To save her, you must descend into the stygian depths of Hell itself! Battle mightier, nastier, deadlier demons and monsters. Use more powerful weapons.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/2300/header.jpg?t=1449848674",
    "minimum_requirements": "A 100% Windows XP/Vista-compatible computer system",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Behold the glory that is Doom 2.  The end all, be all of first person shooters. Let's be honest, this can be reviewed in one word: Perfection.  This game has all you will ever need: - A BAD-A$$ selection of Weapons. - Legions of Monsters, Demons, and Zombies to slay. - Mazes, Secrets, and Rewards o' plenty. A game that has yet to be surpassed in over 20 years.  If Steam vanished tomorrow and I only had one game to play for the rest of my life, this would be it.  DO NOT play this using DOSBOX.  There are several emulators that run Doom 2 perfectly. They add many new features that weren't available in 1994 like high resolutions! I personally use Zdoom and fully recommend it. Go to  Zdoom.org  and grab this legendary title!",
            "review_score": "1"
        },
        {
            "review_text": "iddqd idkfa idclip  :D :D :D Do not tell me you do not know it !",
            "review_score": "1"
        },
        {
            "review_text": "If you're going to play this get the Zandronum client. You'll get Doom seeker for multiplayer and great mod support.",
            "review_score": "1"
        },
        {
            "review_text": "The fastest shooter game ever, Doom is a timeless classic that I have played on and off for more than 15 years. It's easily my favorite and most played game of all time. On my hard drive I have hand-picked community-made levels, textures and mods and together they are about 130 times the size of the base game. This is literally enough content to keep you playing for years. Talk about free DLC, especially considering most of the community maps are of a higher visual standard than the originals! God bless the Two Johns and the most wonderful fruit of their labor!  Now with 100% more Steam Awards 2016 nominations for the 'Test of Time' award!",
            "review_score": "1"
        },
        {
            "review_text": "You couldn't save Daisy, but you can still save Earth. This game, and it's predecessor, set the bar on PC gaming and helped set the stage for a quality of game that consoles could not, and still can't, compete with. Hours of challenging game play for just the price of a coffee. And it's frequently on sale! Unless you just simply don't like FPS games there's no reason not to own this truely classic piece of gaming history.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a masterpiece any gamer should play. It's old school, so what? Some retro games are actually better than modern games.   The objective? KILL. COLLECT. DEFEAT.  You're like a serial killer for aliens.  11/10, really great game, although you should get GZDoom or Zandronum otherwise the customization, music, and graphics are complete trash. I expected Steam to actually give the graphics clearly, as it looks like it's just smoke blocking your sight.",
            "review_score": "1"
        },
        {
            "review_text": "Doom was a series that blew me away when I was younger. I was born right before the advent of 3D gaming, so I grew up with the progression from 16-bit to 32-bit and then full on polygonal games. It felt like technology was moving so fast and that I was at the cusp of creativity.  Even though Super Mario 64 had changed how I viewed gaming, Doom came into my life and changed what I thought of my PC. I now wanted to master the keyboard and mouse so that I could become a Doom god. I eventually got my own PC and Doom became my best friend.  What I found was, I had a stronger fondness for Doom II. I couldn't explain it then, but I felt like the game was more intense. It seemed to move faster, had bigger levels and a greater variety of enemies. Even if it bared resemblance to the original Doom, it felt like a totally different game.  I can now explain why I felt such a way. ID Software were always looking to outdo themselves. All of the creators had become masters of their own game, so they looked on how to up the challenge. Throwing simply more enemies would be cheap, but it also could work with some slight modifications to the gunplay.  This brought about the Super Shotgun (or Double Barrell), which has such a significant impact on combat scenarios and level design. Since you basically have a gun that is close range with the damage of a rocket launcher (and no splash damage), you can destroy lesser foes in a single shot.  It turns some of the drawn out encounters from the first game into lightning fast executions. You can clear out rooms of weaklings in mere seconds, where the original Doom required you to carefully plan out whom to attack first. That does still factor into Doom II, what with the enemies retaining their simplistic designs and the new enemies being super deadly; the change is now that there are dramatically more enemies.  The levels are much larger than anything from the first game, so you will encounter hundreds of foes in single levels. Your arsenal will grow over the course of the game and you'll eventually find yourself with a large amount of ammunition. If nothing was done to even the odds, you'd be overpowered within 5 levels.  While not every map is a masterpiece, the majority of this game has more in-depth designs. Vertical spacing is delved into; differing level heights play a bigger role; there are even some gimmick levels that throw large bosses at you with a small puzzle to kill them. It's definitely not just bigger = better.  The game also does away with Episode selection and has you play all 30 levels back to back. If you get good at the game, you end up never losing your inventory. Most of the levels have ammo backpacks, so even if you do die, you're never left underpowered. You may run out of ammo, though.  The newer enemies help flesh out the roster a bit. The original game nearly blows it's entire line-up in the first Episode, saving the really big bosses for the later levels. Doom II introduces one weaker version of a previous enemy (the Hell Knight) and some real pain in the ♥♥♥, priority targets.  The Mancubus is basically a walking tank with double rocket launchers; the Pain Elemental acts as a mobile spawning point; the Revenant is hyper fast and strong (though with low health); finally, the Chaingun Guy has impeccable accuracy and speed with his chaingun. It introduces a more steady difficulty curve that doesn't need to reset at the start of every 8 or so levels (like how the original Doom handled it).  The Steam version of Doom II is also limited to being a DOSBox emulation (much like it's predecessor), so that does suck. With the aid of a source port, you can also get some co-op going. You can even clean up the visuals a bit and add some more modernized controls.  Overall, Doom II may not be as brilliantly made as the first game. I still enjoy the combat and larger levels more, but there is a sense that ID Software got a bit too ambitious. Regardless of that, there is no reason to pass up on playing this.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "The game alongside its previous iteration that pioneered the modern PC gaming modding scene. The community is still crazy active and the modding scene still creates amazing mods to play to this day. DON'T PLAY IT ON VANILLA DOSBOX, GET YOURSELF A SOURCE PORT LIKE GZDOOM OR ZDOOM  If you want to know how to use these source ports for things like playing vanilla Doom and Doom ll or playing community made mods/wads I made a minute long tutorial if you are interested. It's got 'some' humor in it, let's just leave it at that... Enjoy!          YouTube™ Video:  How To Install Doom mods In Under A Minute&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "It's DOOM 1.....but bigger....with more weapons.....and its doomier!   10/10 would doom again.",
            "review_score": "1"
        },
        {
            "review_text": "Best shooter game of all times . you are lucky if you was glad to play this game in 90s.",
            "review_score": "1"
        },
        {
            "review_text": "Blast your way through into the Martian nether whilst listening to the music that they made for DOOM...  But why should I tell you guys to buy the game? Of course you bought it, everyone has at one stage of their life.  No please buy it  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game just like the first. Get a sourceport.",
            "review_score": "1"
        },
        {
            "review_text": "Play it. Play it now. This is a classic. DooM is a god among FPS. It's like a great grandaddy that I love and cherish. I never get tired of its fast paced, pixelated goodness. Among that, it's got loads of modded content and game modes. See Skulltag to bring DooM into modern, with actual aiming and look, jumping and crouching.",
            "review_score": "1"
        },
        {
            "review_text": "At the time of writing there are over 400 positive reviews and about 30 negative ones. This game is still good after 20 years! Yes it shows it's age but the gameplay and level design (not to meation the kick @$$ soundtrack) all made up for the graphics. Even then the graphics are appealing to look unlike the gray, unispired modern day shooters.  Weapons are easy to switch between and like in Serious Sam and Duke Nukem (That were inspired by this game) you'll find yourself switching weapons on the fly. Use Shotgun on the Imps, chaingun on Picky demons, BFG on cybor demon, etc. And with many types of enemies you'll have to learn what gun works best or'll you'll have a bad type. The story is almost non-existant with John Carmack thinking that stories in games weren't important (Oh John we would not have been friends) but like the graphics can be forgiven for the great gameplay overall. So should you buy? Sure. You might need to fix a few files because of DOS box but the steam forms have many a soultion for you. So what are you waiting for? Buy it and kill some demons all ready!",
            "review_score": "1"
        },
        {
            "review_text": "Ask yourself this, what's better than a shotgun? A double-barreled shotgun. What's better than a double-barreled shotgun? A double-barreled shotgun that shoots both of its shells at once.  Hence, the birth of the Super Shotgun, the best weapon you'll need to rip and tear through an entire army from Hell, all without regenerating health and no two-weapon limit like a classic FPS game.",
            "review_score": "1"
        },
        {
            "review_text": "This game brings back it all cheap and fun to play and classic controlls I suggest this and if you have zdoom GZdoom etc. I will go through the files and get a HD makeover and add mods etc. :)",
            "review_score": "1"
        },
        {
            "review_text": "Doom was the successor of the Wolfenstein series, and the second in its series was released in 1994 and will run on any computer system on the planet - unless you're exceptionally unfortunate.  Doom 2 is a fun, action packed monster slaying journey. The game has spawned an entire series and several variations have been officially made along with a still-active modding community similar to the still-active modding community of the original Wolfenstein games from id software.  In a twist of fate for those of us who understand it well, the story is that Earth has been completely invaded by the monsters of Hell and any survivors were sent into outer space to preserve the human race. Working his way through the hordes of Hell, Doomguy comes to fight the Spider Mastermind, Cyberdemon and finally the Icon of Sin. The icon of sin is the interesting twist, where the icon of sin represents John Romero - the games artist who was disinterested in the games art style and subsequently left id software. There's an easter egg for if you use no clipping and go to the right place, you can see the head of John Romero on a spear and even has animations for when being shot.  There are epic fights with countless monsters, and the fun and challenge is nostalgic, undeniable and instantly classic. It should be noted that many of the difficulties of the array of mods and releases feature difficulties intended to be impossible to complete - where some people have actually achieved victory. I find these victories quite impressive.  It's cheap, fun, nostalgic, action-packed and runs well on any system, have you any reason not to play Doom at least once in your life?",
            "review_score": "1"
        },
        {
            "review_text": "how 2 get betr duum 2 gampley: 1. instal brutl deem mod 2.find out tht brutl dum mod is amzing 3. win 4.profit 5win agian 6.profit again 7. KILL CYBERDEMON",
            "review_score": "1"
        },
        {
            "review_text": "Needs more John Romero okay... you can go now... review is over really go NOW   Fine The Ultimate doom, i find better mostly because it isnt riddled with  -hidden buttons (that need to be shot instead of pushed...) -unfair enemy -unfair enemy placement wait am i talking ♥♥♥♥ about a masterpiece? okay lets try again The ssg Best weapon they could add  The Revenant: it shoots heatseeking missiles... they suck so bad The Archville...: I have no words its the worst of the worst, its nightmare in a demon, It resurrects dead demons ffs, plus its attack is deadly as hell but easy to dodge (thank god) and... Thats it, Folks! buy it now or die in hell",
            "review_score": "1"
        },
        {
            "review_text": "There's not much to say. It's one of the best shooters ever made, and it just doesn't get old. Developers were nice enough not to just port the game with original graphics, but also include Steam Cloud integration, so you don't ever have to worry about losing your save games again. Obviously it also works with all the mods just like non-Steam version too.  NOTE: The game is obviously runing on DOSBox so Steam overlay won't work.",
            "review_score": "1"
        },
        {
            "review_text": "If ya looking for FPS AND good thougth out levels, buy this. That and rage, as ya gonna die a lot, more if you don´t get used to the almigthy Doom guy speed ;).",
            "review_score": "1"
        },
        {
            "review_text": "Just makes me want to shoot up my school!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, I'm pretty sure you can buy the whole set for around $10 :P",
            "review_score": "1"
        },
        {
            "review_text": "Ahh, a classic. The father of fps's. Seriously recommended (I have played this game off-steam for so many hours)",
            "review_score": "1"
        },
        {
            "review_text": "Argueble one of the best sequels to any video game DooM II continues what DooM did great and then some.The muisc is top notch and is insipred or blantly ripped off from big metal bands like Metallica, Slayer, Megadeth and etc. DooM II introduces new enemies such as Chaingunner (a.k.a. Heavy Weapons Dude), Hell Knight, Mancubus, Revenant, Arachnotron, Pain Elemental, Arch-Vile, and The Icon of Sin. This gameis truly one of the best made fps and sequels ever  My rating: 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is one of the best in the DOOM series. Sequall to Ulitmate DOOM I think this game is no waste of money but, the dos box emulator for this game sucks so you will have to use source ports.I recommend the zdoom source port because it still fells your playing the original game when you use it also, you can make the game a bit modren by adding, jump,crouch,and swimming in the controls.Works great on windows 8.Before I forget when i bought this game it came with the master levels.Overall i give this game a 10/10 because of the outstanding levels,new textures, and the super shootgun.If you are a Doom fan this game is a must buy",
            "review_score": "1"
        },
        {
            "review_text": "dank game would play it again",
            "review_score": "1"
        },
        {
            "review_text": "Doom is an old school FPS, therefore you will need some preliminary tips coming from your hand-holding modern military shooters otherwise your transition will be too jarring.  Doom Tutorial         YouTube™ Video:  PRO DOOM MONSTER STRATS&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Best shooter ever. Play with Brutal Doom.",
            "review_score": "1"
        },
        {
            "review_text": "Doom 2 is my favourite FPS EVER! It took the elements that we loved from The Ultimate Doom and made them better. More enemies to fight, more challenge, faster gameplay, more mods. It's a must own.",
            "review_score": "1"
        },
        {
            "review_text": "Classic fun. You should only buy this to legally get the WAD for ZDoom/GZDoom, as the DOSBox emulation is garbage and hard to configure.",
            "review_score": "1"
        },
        {
            "review_text": "Best childhood game ever. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "I really like how the screenshots on the Doom II store page are the exact ones from the original retail box.",
            "review_score": "1"
        },
        {
            "review_text": "  This is one of best Doom games out there and also get any mod for this game",
            "review_score": "1"
        },
        {
            "review_text": "One of the best classic FPS games ever made, Doom 2 is even better than the original Doom, you still might have a floppy of this game in your dad's attic but you should definitely buy or rebuy this game just to have access to all the custom .wads that are being made and that have been made in just the last year alone.  I mean there's still people playing Doom 2 online multiplayer through a mod in 2014, if that doesn't speak volumes about how great this game is, then nothing will.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ING DOOM 2! ITS LIKE DOOM, ONLY A LOT MORE OF IT, DOOM ♥♥♥♥ING 2!  ♥♥♥♥ING DOOM 2!!!",
            "review_score": "1"
        },
        {
            "review_text": "Purchase this game and download Brutal Doom. Best mod ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Yes Yes YES YESS YESSSSSSSSSSSSSS! (love blowing crap up)",
            "review_score": "1"
        },
        {
            "review_text": "Do I even have to tell you why I should recommend this?",
            "review_score": "1"
        },
        {
            "review_text": "awsome game but only playable with gzdoom and with mods like brutal doom :D oh and the reason why i only have a few hours played on steam is because i only play with gzdoom istead of the ugly dosbox version :p btw this game has endless replay value with the project brutality mod still better than doom 2016",
            "review_score": "1"
        },
        {
            "review_text": "Best games are made in the 1900 so cant beat the classics",
            "review_score": "1"
        },
        {
            "review_text": "It doom what more do you want?",
            "review_score": "1"
        },
        {
            "review_text": "I love this classics fps games 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Its 22 years old but its still amazing to play.  (Only 0.1 hrs because I play on ZDoom)",
            "review_score": "1"
        },
        {
            "review_text": "DOOM II is such a good game! But why am I telling you? Why aren't you playing DOOM?!",
            "review_score": "1"
        },
        {
            "review_text": "Well, the game itself sucks. Obviously, it was mind-blowingly cool for when it came out, but for todays standards...  I mean, the graphics are crap, the gunplay is unsatisfying, you have access to all your guns but you only use the best one you have at the time. The maps are maze-like, you spend half of your play time wandering around looking for key-cards.  But, for the mods?  The mods make this game way better. You have a little tiny bit of installer work to do, but once you do, it's totally worth the price.There's mods that simply improve the games mechanics and graphics, to mods that completely overhaul and change the game. They stretch far and wide, from anime-style demon slaying action, magic spells, punching people in the face, MAP PACKS, and of course straight up rip and tear brutality. The community has kept this game alive. On some particular mods, like Zandronum, the game even has an active multiplayer community. Wow.  You need to buy this game for the mods, by the way. No pirating for you!  Yeah, as long as your willing to do a little digital labour, this game is totally worth it. This goes for all of the other Doom games too, most if not, all mods work for all of them.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Jews For Life.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Doom II is the most classic of classic shooters. The mother of all shooters. I love this package.",
            "review_score": "1"
        },
        {
            "review_text": "Does this game really need a review? It's such a classic FPS! Loads of guns and demons, and it's also cool to speed run.",
            "review_score": "1"
        },
        {
            "review_text": "It's DOOM; I ain't gotta explain sh*t.",
            "review_score": "1"
        },
        {
            "review_text": "Who needs shiny textures and other useless fancy decorations when all that matters is shooting everything that moves and running like a maniac? Even today, it's still loads of fun, not to mention there are thousands of mods for it!  Get this game NOW; you won't regret it, I promise.",
            "review_score": "1"
        },
        {
            "review_text": "Back when carmack was interested in innovation, this was a great game. And today it's perfectly playable. The stock version just lacks the 'mouse look' feature that came with newer shooters. Plot: Absent Action: Present Gore: Present Fun: Present",
            "review_score": "1"
        },
        {
            "review_text": "Good enemy designs have always made video games interesting. They not only appeal to the eye and offer challenging opponents. Doom II does both very pleasingly. The level designs are not the most realistic by comparison to the ones of the games today, but they offer effective battlegrounds. The weapons remain unchanged, but the double barrel shotgun adds an impressive new tool. Getting to spray pellets over a large area gives players the chance to kill several monsters at once in a rather spectacular fashion, well rendered by the many spirits.  Doom II was among the first titles to introduce interactive three dimmensional objects and settings. They were still developing, but at the stage ID Software was, Doom II brought the seeds that would later blossom into the modern FPS shooters. It certainly presented some interesting concepts of physics, such as the BFG and the artificial goat's head that spawned living creatures from cubes.",
            "review_score": "1"
        },
        {
            "review_text": "The greatest PC game of all time. Nothing else you can really say about this.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is ♥♥♥♥ING AMAZING I AM SPEECHLESS",
            "review_score": "1"
        },
        {
            "review_text": "play the damn game already",
            "review_score": "1"
        },
        {
            "review_text": "This game equivalent to riding down a mountain on a unicorn while drinking from a goblet filled with the laughter of children.",
            "review_score": "1"
        },
        {
            "review_text": "Its got the double barrel shotgun.",
            "review_score": "1"
        },
        {
            "review_text": "'Go ♥♥♥♥ yourself if you've never played this.' - Chaos",
            "review_score": "1"
        },
        {
            "review_text": "You pretty much need this to play any major DooM sourceport mod, so I'd get this first. Everything else about the game is self explanitory: The brother to Descent and X-Wing/TIE Fighter that allowed gaming to get where it is today.",
            "review_score": "1"
        },
        {
            "review_text": "With the power of modding, this $5 game has more content than any full priced game released today.  The gameplay is fun, especially with the Brutal Doom mod.  The game looks pretty good, even better with GZDoom.  The game is pretty long, even longer with the swarms of megawads released since this game came out in 1994.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic follow-up to a classic!  PROS: - everything done well from 'DOOM' - improved level design complexity - double-barrel shotgun - new enemy types  CONS: - level designs sometimes became a little frustrating - made me have to go online for 'how-to's' for later levels - lack of more new weapons  RATINGS*° - gameplay: A - controls: B - graphics: A - sounds: B - music: A - replayabilitiy: B - enjoyment/cost: A  Overall Score: A  Recommended to Buy: A Recommend getting DLC (if applicable): B Excited about playing the game's direct sequel: B  __________ * graphics &amp; sound ratings based on relative quality with respect to the game's release date.  ° using standard letter grading scale: A &gt; B &gt; C &gt; D &gt; F [ A=Awesome ... F=Fail ]",
            "review_score": "1"
        },
        {
            "review_text": "awesome game but only if u download zdoom otherwise the game is utterly unplayable.",
            "review_score": "1"
        },
        {
            "review_text": "Rip and tear... until it is done.",
            "review_score": "1"
        },
        {
            "review_text": "Doom II is a classic in which you are sure to like. This is one of the greatest retro games of all time and I'm sure you'll at least like it",
            "review_score": "1"
        },
        {
            "review_text": "Nightmare mode is hard",
            "review_score": "1"
        },
        {
            "review_text": "Its Doom.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games... EVER!!! :)",
            "review_score": "1"
        },
        {
            "review_text": "DOOM II will NEVER stop being my favorite game ever. Never. I love everything about it, from melancholic yet energetic music, psychodelic style, grotesquily creepy 2D demons, insane pace, deeply satisfying multiplayer, mapping community, unbalanced yet so delicious weapons, to every single bug which was prefected by players and mappers into becoming a feature, SKYMAYBE.WAD and impse.  Sweet, sweet impse.  And for people whining it doesn't work: grab a source port. On Steam, you're buying the game's content. Yeah, I guess Steam should care about whether the product they give you works or not as it is, but, come on. Some tiny amounts of googling doesn't hurt.  (If you want a brief explanation: you grab doom2.wad from game's folder, copy it to folder of source port you downloaded, done. Most popular ports: Chocolate Doom and prBoom for the classic feel, ZDoom for single player/mods, Zandronum, Zdaemon and Odamex for multiplayer (though you can play single player on them as well))",
            "review_score": "1"
        },
        {
            "review_text": "The Brutal Doom Mod Is Life!",
            "review_score": "1"
        },
        {
            "review_text": "A classic FPS, genre defining",
            "review_score": "1"
        },
        {
            "review_text": "A timeless classic. Been playing this off and on since the mid 90's. One of the best FPS ever made.",
            "review_score": "1"
        },
        {
            "review_text": "It's good.   Everybody knows this.",
            "review_score": "1"
        },
        {
            "review_text": "You should play this because of the community",
            "review_score": "1"
        },
        {
            "review_text": "Way more cryptic then Doom 1 was, but the Super Shotgun and more enemies make up for it. Again, so much fun either vanilla or with mods.",
            "review_score": "1"
        },
        {
            "review_text": "awesome, awesome game. played on Gzdoom engine, loved the super shotgun. was pretty much the only gun i used lol. i will admit however, the last few levels got hard in terms of figuring out where to go/what to do. these older games dont hold your hand! you need to figure it out yourself. it was challenging. Im currently on a old school game playing spree. finished ultimate doom, this and now quake 2... debating on quake 1...",
            "review_score": "1"
        },
        {
            "review_text": "Used to play this in coop with a null modem cable back in the day and race eachother to the end of the level. Must have finished it a hundred times or more and it's still fun today. Get GZdoom for the best experience (anyone having trouble running the game as is from Steam: get GZdoom, it's the best source port out there and works like a charm while adding a wealth of options).",
            "review_score": "1"
        },
        {
            "review_text": "While I DO recommend this old school classic I actually DO NOT recommend Steam's Dosbox'd port of this. The controllers and keyboard are unconfigurable in this version unless you use Joy2Key and besides that the picture is blurry and washed out. ",
            "review_score": "1"
        },
        {
            "review_text": " ...RIP AND TEAR YOUR GUTS! YOU ARE HUGE! THAT MEANS YOU HAVE HUGE GUTS!  RIP AND TEAR!  ",
            "review_score": "1"
        },
        {
            "review_text": "Doom 2 is the best old fps game and buy it",
            "review_score": "1"
        },
        {
            "review_text": "Classic FPS with lots of exploration and tough, fast paced action. It may be old, the controls are weird, and you can only rotate, but that's all what you need. this is all a videogame need to be, Fun.",
            "review_score": "1"
        },
        {
            "review_text": "It's not really that different from the first DOOM, but it's still kick ♥♥♥ and a hell of a lot better than the Call Of Duty games.",
            "review_score": "1"
        },
        {
            "review_text": "  This is a pretty fun and quite challenging game, as well as a nice way to kill boredom and waste away some time.",
            "review_score": "1"
        },
        {
            "review_text": "It's DOOM 2. It helped to create gameing as a whole. FPSs were once called Doom-clones. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "play the damn game already",
            "review_score": "1"
        },
        {
            "review_text": "Besides being historically significant and something you should have played at least once in your life to earn the respect of your PC Gaming peers, DooM II is still really fun to play. Steam obviously won't show how many hours I have played since I've owned DooM II since well before Steam was a twinkle in Gaben's eye and it also doesn't keep track of non-Steam versions of the engine. I have been playing Brutal DooM on the gzdoom engine and it is a crazy good time. Get your DooM/Hexen/Heretic game files on a Steam sale and then grab an after-market game engine. Well worth your time and money.",
            "review_score": "1"
        },
        {
            "review_text": "a great FPS that never gets old                    (i is writing for da badge)",
            "review_score": "1"
        },
        {
            "review_text": "Dosn't run on my coumputer 10/5",
            "review_score": "1"
        },
        {
            "review_text": "Really good game! Interesting level design, hard puzzles, and blasting away demons with shotguns! What could be better?",
            "review_score": "1"
        },
        {
            "review_text": "Great game, even today. Superb!",
            "review_score": "1"
        },
        {
            "review_text": "This game only belongs to classic lovers. Best game ever made 100/10  Now the doom 4 is coming can't wait for it. 😎",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the best shooters that I remember playing as a little kid.",
            "review_score": "1"
        },
        {
            "review_text": "great game to play, its like playing history, the good kind",
            "review_score": "1"
        },
        {
            "review_text": "Best game ever!! With the amount of user-made levels, this game will be different everytime you play it.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite Doom. The first Doom I ever played multiplayer. Only good for nostalgic appeal these days.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, harder and longer then the original ;). But i like the first game alot more because of its very memorable level design. I just prefer the levels of doom 1 over doom 2. Doom 2 has a lot of levels where you get stuck at and takes forever to find out where to go next which breaks the flow of the shooting. The original also had these moments from time to time but it happens alot more here because the levels are more open then the original and they feel like mazes. I wasn't very fond of some of the new enemies they added as well. Gameplay is identical to the original they just added the super shotgun which is one of the greatest weapons in gaming history. This is a great sequel and a very fun game i just had even more fun with the original with the reasons i stated. 8/10 (Great)",
            "review_score": "1"
        },
        {
            "review_text": "a great FPS that never gets old                    (i is writing for da badge)",
            "review_score": "1"
        },
        {
            "review_text": "One of the all time best",
            "review_score": "1"
        },
        {
            "review_text": "Better graphics than Factorio.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't completed Doom but I had to just play it and it is awesome. Everything is improved greatly. It has some of the old mechanics but improves. Some say that nothing can beat the originals and those people ****ing wrong. This is by far some of the best gameplay I have ever seen in videogames in a while. This is game has replayabilty just like its predecessor and it will suck you in. I should mention Doom the classic collection are the only set of FPS I have ever cared for. I have never loved the call of duty but this has actually made me like these kind of games and apprecaite them. I have always loved games similar to skyrim but this has changed my view. Doom  is one of those games that just changes everything. It was the first FPS to grab everyones attention and you can see that even today. Most people probably want to know does this stand up as a good game these days and I can safely say that it is and Master levels for Doom is basically Doom 3. So instead of getting Infinte Warfare or The new Doom get this because this has ten times the replayability of any Call Of Duty game to date. If you are a fan of FPS games or just games in general get this game. It has something modern FPS' don't have, fun.",
            "review_score": "1"
        },
        {
            "review_text": "Until i decided to get all the old school doom's i was having trouble adjusting to fps's using my steam controller, but after playing ult doom and doom 2 I've found that doom has helped me adjust to the new style of input and has made me a better gamer. RIP &amp; TEAR my fellow Doomguy's",
            "review_score": "1"
        },
        {
            "review_text": "It's Doom II, The grand daddy of onlne multiplayer. Even today this game still holds up. The controls are nice and tight. The level design is fun and interesting. The graphics are very dated but they have their own charm in my opinion. On top of all that it has the largest library of mods ever seen and a modding community that is still finding new innovative ways to push the engine to it's limits.  Definitely would recommend to anyone who doesn't already have it. I would suggest using a sourceport like Zandronum or GZDoom",
            "review_score": "1"
        },
        {
            "review_text": "You should play this because of the community",
            "review_score": "1"
        },
        {
            "review_text": "favorite game so far. Tightens, really addictive .. is extremely difficult to break away. Well, about the sound and say nothing. This game is excellent, I think the other word and no need",
            "review_score": "1"
        },
        {
            "review_text": "Still one of the best FPS games ever made whether you play it vanilla or modded. And it's better now than ever, as you can have mouse-look and other modern additions.",
            "review_score": "1"
        },
        {
            "review_text": "I play Doom II from time to time on my owners printer. I can't use a keyboard with my paws, so I use a toaster instead.",
            "review_score": "1"
        },
        {
            "review_text": "It's a good classic.",
            "review_score": "1"
        },
        {
            "review_text": "Mindblowing game that definetly deserves to be played to this very day! Great fun, many secrets, many demons, much gore, much fun! Play it and have a go (I recommend you use the GZDooM port with this so it works better). :D",
            "review_score": "1"
        },
        {
            "review_text": "Timeless classic, best run with a source port of the game instead of the steam default method.",
            "review_score": "1"
        },
        {
            "review_text": "Pure FPS ! The skill actually comes mostly from the movement than the shooting. It's a great first FPS game for any gamer with multiple difficulties! Ultra Violence is a true challenge. Highly recommended, with 23 years of DLC! The Brutal/Project Brutality mods are INSANE.",
            "review_score": "1"
        },
        {
            "review_text": "The number of times I've seen Entryway's two zombiemen... that image is forever etched into my brain. Some of the best maps I've ever played are immortalized in this game. The Crusher, Dead Simple, Tricks and Traps, Circle of Death to name a few. Most PWADs on the internet require DOOM II (Final DOOM works with the same PWADs but with distortion).  The two official expansions, Master Levels and No Rest For the Living are great as well (especially Master Levels). DOOM II may have been rushed, but it's still the best in the entire series in my opinion. It's just too good.",
            "review_score": "1"
        },
        {
            "review_text": "I use different launchers to play this game, so I have no time logged in this instance of it, but I find my self at bare minimum doing one full playthrough of this game every year.  It's still my favorite game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the original, and still one of the best.  One fo the first games I ever played, and still one that I play today (especially thanks to the Butal Doom mod -almost 200 hours in the mod -hence the low playtime here).  Don't think, just buy, thrive, and survive.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely brilliant game",
            "review_score": "1"
        },
        {
            "review_text": "When I bought this game, I was expecing to play for hours once again, just like the old days.   First time starting it up. No problem. I played for about 10 minutes until the game closed itself. Bummer. I tried to get it running again but no matter what I did, I was unable to get it working again. I even redownloaded the game but nothing worked.  Don't get me wrong, I love this game so much. However, I do not recommend that you buy this game because apperently the game is too old to be played well on modern devices. Which I think is also weird, since I was able to play for those 10 minutes.  Conclusion: Don't buy this game unless you're willing to alter files and download other programs to get this game working. ",
            "review_score": "-1"
        },
        {
            "review_text": "All of the classic Dooms (Ultimate DOOM, DOOM II, Final DOOM) on Steam are all amazing and still fun to play today, however these builds of the game look raycasted as if it was running on SNES. Things like sprites and buildings gradually more pixelated. This may have to do with Dosbox as the source port, but you can fix this by using Zandronum or GZDoom to make the game look more 3D, including display options to change the resolution. DOOM's still playable on Steam and fun as hell, but useing GZDoom or Zandronum will partially enhance sprite quality and and looks better overall.",
            "review_score": "-1"
        },
        {
            "review_text": "Not able to play game! Loads to the main screen then crashes! Can not play game and can not contact support!!! This is the last game I buy from ID!!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Glitchy and buggy to all hell.",
            "review_score": "-1"
        },
        {
            "review_text": "great game but too old to run on modern system - careful about buying",
            "review_score": "-1"
        },
        {
            "review_text": "Would be nice if it worked...",
            "review_score": "-1"
        },
        {
            "review_text": "This game is a MUST HAVE. it's the father of FPS games and great in every sense. Just don't grab the steam one , the port work is REALLY lousy and I bet GoG has a better one. Other than that, you can download an alternate engine like GZDoom and stick it in the doom folder within steamapps, and edit the .bat to run the gzdoom exe",
            "review_score": "-1"
        },
        {
            "review_text": "bad i cant play it i just stays at the beginning",
            "review_score": "-1"
        },
        {
            "review_text": "For when your a kid, not so much as an adult.",
            "review_score": "-1"
        }
    ]
}