{
    "app_id": 231160,
    "name": "The Swapper",
    "release_date": "2013-05-30",
    "developer": [
        "Olli Harjola, Otto Hantula, Tom Jubert, Carlo Castellano"
    ],
    "publisher": [
        "Facepalm Games"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "Sci-fi",
        "Atmospheric"
    ],
    "achievements": 10,
    "positive_ratings": 5699,
    "negative_ratings": 242,
    "price": 11.99,
    "description": "What if someone knew your mind better than you did? The Swapper is an award-winning, narrative driven puzzle game set in the furthest reaches of space.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/231160/header.jpg?t=1530095887",
    "minimum_requirements": "OS:Windows XP SP3 or later, 64/32bit Processor:Dual Core CPU (2.2+ GHz Dual Core CPU or better) Memory:1 GB RAM Graphics:GeForce® 8800 or Radeon® HD4800 series, 512 MB of memory,  OpenGL 3.0 support required Hard Drive:1 GB HD space Additional:Intel HD Graphics are not officially supported. But if you've got yourself a 3000 or better then there is a reasonable chance it will mostly/sorta work. No promises, but we've been working hard on it, at any rate.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "This is a puzzle game unlike any other. The clay animations are really well done and the whole concept of creating clones to solve puzzles, is a really neat idea. Add in the ability to swap between these clones and things become very interesting.  You'll get about 5-7 hours out of this game depending on how good you are with the puzzles. They are varied and challenging in the later stages as you become more comfortable with the gameplay.  The atmosphere is really moody, with a full spectrum of white light to pitch darkness. They really do a good job to make you feel like you're in space and completely isolated.  The Swapper is a genre defining leap for puzzle platformers. The developers have shown originality and passion, which are the first two things I look for in any game.",
            "review_score": "1"
        },
        {
            "review_text": "Even though  The Swapper  is only a four-hour puzzle game, it's still an atmospheric experience that both sci-fi fans and puzzle lovers will absolutely adore.  The Good: + Gorgeous clay-molded visuals with stunning lightingeffects. + A unique science fiction story. + Incredibly atmospheric, especially for a 2D puzzle game. + Phenomenal soundtrack. + Though puzzles bases on a clever clone-swapping concept that works perfectly...  The Bad: - ... but once you've completed the game there's not really any replayability. - Very short. Four hours should be enough to play through it.  The Ugly: - The visuals may take some getting used to, but in the end they perfectly fit the game's chilling atmosphere.  Final verdict: For a pricetag of 13.99€, you get unfortunately little content. Wait for it to go on sale (around 6.99€ looks like the perfect price), then definately pick this up if you love atmospheric games or puzzlers. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game. You can feel space when you play it. And really soft music for feel the game. If you like puzzles in games this game best for you.",
            "review_score": "1"
        },
        {
            "review_text": "It is weird... Like, mindblowing... I sure enjoyed this... But... Still... 9/10 (The Swapper is not a game for everybody, it is highly for those of metaphysical interest)",
            "review_score": "1"
        },
        {
            "review_text": "I could write a lot about this game, but lets just say that if you love Braid (mindblowing puzzles and philosophical story), you would definitly like Swapper. Dark and mysterious, beautiful and puzzling, depressive and truly smart. Swapper, Ladies and gentlemen.",
            "review_score": "1"
        },
        {
            "review_text": "A great, unique game that I thoroughly enjoyed playing right until the very end. It proved to be an excellent puzzle platform game with excellent puzzles, excellent gameplay, a good atmosphere, and an intrigueing story. The art style is unique, but very well done as I think it suits the game and it's atmosphere. And to further add to that, I believe the soundtrack to be something pretty nice that also suits the atmosphere and setting of the game as well, with takes place aboard a space station in space. The puzzles in this game are definitely noteworthy and something not to think of lightly. They provide quite a challenge. Not an impossible, frustrating challenge, but a good challenge that really gets you to actually think and want to push to get the puzzle done. I had my fair share of stumps where some puzzles took me quite awhile to figure out, but I managed them in the end. Adding on to the puzzles, I also found gameplay to be another great feature of this game as well. Basically, the main feature and what this game revolves around is the Swapper device, which enables you to make clones, swap with them, etc. It's something fresh and interesting brought to the table of game mechanics. The story should also not be taken lightly either. A story if looked into enough by paying attention to the game, collecting logs, and actually thinking about it, is something that's pretty deep, good, and thought-provoking. I know it did have an effect on my emotions, which is something I really appreciate when a video game is able to do that to me.  This is a game that definitely deserves a lot of praise. It's a great, beautiful game that was not only a lot of fun to play, but also appreciate things like it's story, philosophical-related stuff, atmosphere, and more. I can easily see myself coming back to this game to play again down the road and would have no issues at all with another playthrough of it. It took me about a solid seven hours to complete the game, which I think was a decent length. Overall, my hat goes off to this game. A game I have no problem recommending to other people, as I believe it will provide a good challenge with a fun, but rewarding experience. Kudos to The Swapper!",
            "review_score": "1"
        },
        {
            "review_text": "My video review:         YouTube™ Video:  The Swapper Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "It's difficult, it's atmospheric and it philosophical.  And it's really good.    To be a little more in-depth. This game is a pure puzzler. It contains puzzles that require solution using yourself. Multiple times. It's atmosphere is dark and eerie and the story behind is very well written and makes you question certain aspects.  Get it if you like puzzling or a pretty good story and something to think about.",
            "review_score": "1"
        },
        {
            "review_text": "Game is ♥♥♥♥♥♥♥ masterpiece, going straight to favorites. 10/10. Be patient and don't let walkthrough's ruin your experience.  Puzzles are smart and intuitive, right after you learn the basic concept of swapping and traversing.",
            "review_score": "1"
        },
        {
            "review_text": "@8hrs &amp; 12h: This magnificently presented, executed and challenging puzzle platformer takes a hold of the player from the very first cut scene and holds their imagination until the last puzzle is solved.",
            "review_score": "1"
        },
        {
            "review_text": "A puzzle platformer that evokes Metroid and Limbo in loneliness and atmosphere, Braid in its bend-your-brain mechanics, and Bioshock Infinite in its ability to make you question the nature of existence and reality. The graphic design has a unique feel to it that I liked quite a lot, looking sort of like models or a play set. Music and sound effects were appropriately haunting, and what little dialogue it had was well written and performed.  Definitely worth a look if you're after a brief, thoughtful, experience.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant Puzzle-Platformer!  You take over the role of an unnamed astronaut who finds a mysterious device, which can create a clone of yourself and also swap yourself (your soul?) into it.  You have to make use of your swapping-device to solve puzzles and overcome obstacles. You also get some background story through log-entries and narration, which i found pretty fascinating (almost philosophical and very mature).  If you like puzzle-platform games, then this is highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I'm not a fan of platformer games but this one was an exception. The visuals, music, and intriguing story was enough to keep me interested. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "Ok I'm done,.................enough.    I really love it, the graphics, atmosphere and those little piano moments that just crush you inside with beauty.  But this game is really hard... I wanted to complete it but ended up using a guide, 5 times and sort of lost heart at my own failure.  I tried to hang on to the story and all the special little moments (piano) but the difficulty overpowers it all.  Still well worth it, for the beauty of it all. The story was getting really interesting but just lost heart. :(",
            "review_score": "1"
        },
        {
            "review_text": "Fresh puzzle, amazing background with almost perfect soundscape. Great atmosphere. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Do you want to solve puzzles by killing thousands of your own clones? THIS IS THE GAME FOR YOU!  Gorgeous artwork and smooth claymation. Great game.  GOTY 2013, for sure.",
            "review_score": "1"
        },
        {
            "review_text": "I finished this game, and just sat there for a good five minutes, pondering my life. 10/10  It is a puzzle game; The puzzles are good, the story is better.  P.S. I would recommend turning on subtitles, the voices are very unclear, and if there is noise in the background, it is very hard to hear.",
            "review_score": "1"
        },
        {
            "review_text": "Just wanted to add my vote to the pool, even if the reviews are already overwhelmingly positive - and deservedly so! The game is very unassuming at first - even more so by the screenshots - but once you're a bit into the story and mechanics, it's hard to put down. The puzzles are pretty clever and the story is quite interesting. And the ending... oh, the ending! Don't be surprised if you complete the game without getting a single achievement. They're not broken, they're just deviously designed. Easily recommended!",
            "review_score": "1"
        },
        {
            "review_text": "At first glance the game looks like a nice idea with amateur theatricals developed by a small, inexperienced team. However, believe you me - this game is an outstanding and magnificent masterpiece, which has a consistent, well-thought, well-placed and wonderful aesthetic atmosphere with brilliant innovative mechanics! It is a mysterious cinematic adventure, in which you are the main character, unraveling puzzles with an utmost eagerness to get to the bottom of everything! It is a joyous experience in which everything is put together in unison and the pioneer developers should be proud of this! An absolute MUST!",
            "review_score": "1"
        },
        {
            "review_text": "This is a hauntingly beautiful game where you solve puzzles by cloning yourself and swapping (hence the name) main controll between the clones. The atmosphere built up combined with the gripping story makes this one of the best games I've played in a long time. It reminds me a bit of Limbo in it's simplicity and beauty. And did I mention that all the graphics are made out of actual clay? Games like these are uncommon, and you really shouldn't miss it!",
            "review_score": "1"
        },
        {
            "review_text": "I wanted to write an actual recommendation instead of single sentence I previously wrote. So yeah, I liked this game a lot. The Swapper obviously draws comparisons to similar gun-based physics-puzzlers Portal or Gateways, but with the twist that you are creating and killing your own clones to progress through the space station. It's not the most innovative or complicated puzzle mechanic, but it is backed up by a great sci-fi story and some increasingly challenging obstacles. I'd like to boast that I completed the game without the help of any guides, but that would be a lie. And every time I had to reference a guide to complete a room, I always thought: 'well, durr, of course that's how it's done.' So, challenging but not cheap or too complicated.  I would put the story in the same vein as the film Moon or the novel/film Solaris. It's great sci-fi that gives you enough to get the gist of what has happened but leaves plenty of blanks for you to fill in. Worth the price if you are into these types of games, but I wouldn't be surprised to see it in a Humble Bundle at some point if you wait. And, holy crap, the ending!",
            "review_score": "1"
        },
        {
            "review_text": "A nice puzzle-platform (no shooting, no time to beat) where puzzles are based on your ability to create and control clones of yourself. Storyline is OK, graphics are nice and controls are very good. Mechanics of cloning may resemble Cloning Clyde but works in a different way:  - Clones are not created beside you, instead you aim your one-of-a-kind gun and 'shoot' to create them on the place you want (must have line of sight);  - Number of clones is always limited to 4 (you need to delete clones to be able to create other clones on other places);  - All clones mimick your moves, so you control everybody at the same time (some puzzles are based on this);  - If a clone dies, there's no problem, but if you die, you'll return to the last checkpoint;  - You can 'shoot' at a clone to 'transfer you soul' to that clone, so that the body you were becomes a clone and the clone you shot becomes you;  - Time slows down when you're aiming to create a new clone, which is very useful. If you're falling from a high place to certain death, you can slow down time, create a new clone on the ground and transfer your soul to it before you hit the ground thus avoiding death, or you can 'climb' through the air by creating clones above in the air, transfering your soul to it and quickly creating another clone even higher, soul tranfering again, repeat);  - There are some plates that invert gravity only for those who stepped on it, so that you'll sometimes have clones walking on the ground and others on the roof at the same time (again, some puzzles demand this);  The game may be a bit short, but mostly enjoyable. Two possible endings (decided on the last scene), so save often to see both without need to play all over again.  Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper seemed to me on its surface like some kind of subdued indie horror game. Its visuals and presentation piqued my interest.  I was pleasantly surprised to find that its core mechanic was really the star of the show. In a genre so awash with titles that try way too hard to be innovative and not hard enough to actually be a good game, it's refreshing to see a game with genuinely unique gameplay that's genuinely fun to play at its core.  It's short, and the plot isn't all that interesting, but the puzzles are great, swapping is simple but has a wide bredth of uses, and looks gorgeous.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is an atmospheric puzzle game that takes place in a mysterious space station. The hero will have to find his way out by resolving puzzles with the 'swap-gun', an unique device that allows the player to create clones of itself. But the scenario is way deeper than that.  Every detail has been polished, giving the game this unique and magnificent atmosphere that reminded me of Super Metroid.  More than just a game, The Swapper is a life changing experience, that has been made with love and talent. Give it a try, it's brillant.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper seemed to me on its surface like some kind of subdued indie horror game. Its visuals and presentation piqued my interest.  I was pleasantly surprised to find that its core mechanic was really the star of the show. In a genre so awash with titles that try way too hard to be innovative and not hard enough to actually be a good game, it's refreshing to see a game with genuinely unique gameplay that's genuinely fun to play at its core.  It's short, and the plot isn't all that interesting, but the puzzles are great, swapping is simple but has a wide bredth of uses, and looks gorgeous.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game. The puzzles started out slow, but the last few puzzles are really quite hard. It has a nice atmosphere to it and the message that is told through the game is quite interesting. The steam achievements were deviously hidden, and I had to quickly play through it a second time to get them.  All in all it was an ejoyable 5-ish hours I needed to finish the game. When it is for sale again for a few dollars, it is worth picking up. It might not be long, but it is worth playing through once if you like puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not much of a puzzle games guy but this is, no doubt, the platform puzzle I've ever played. Totally recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I really like this game. Puzzle is so fun and creatively. Also I like soundtrack of it, very nice ambient.",
            "review_score": "1"
        },
        {
            "review_text": "Difficult puzzle game with an eerie theme, great storyline in the medium of memory logs. The ending is well worth the struggle to reach and should not be spoiled for anyone. Overall great experience playing.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, I really enjoyed playing The Swapper. It has an interesting story with a beautifully isolated atmosphere. The puzzles weren't always simple and I found myself sitting at certain puzzles for about half an hour trying to figure them out. I easily became immersed in this game. I would deffinately recommend it to anyone looking for a fun Indie puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Great 2D side-scrolling puzzler. Has good game mechanics, immersive atmosphere and interesting story. 6 hours+ playtime. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Only the highest praise I can give to the developers of The Swapper - an atmospheric puzzle/platforming exploration title that delivers an intense solitary experience, where as the protagonist[s] you must uncover the mystery behind the disappearances of Theseus Stations crew members - and the possible recovery of whatever project they were working on.  The plot may seem a bit vague at first (such as the withheld information on who your character is, and how/when the story begins), but eventually forms into clearer understanding. The questions that are asked and 'relatively' answered are: Who, what, when, why, and how? The Swapper is a story of very personal elements, which attempt to invoke self-thought and reflection. The game boasts a fantastic ambient soundtrack, gorgeous claymation visuals, and fluent mechanics. The puzzles you solve are made possible by cloning the player (the clones imitate the precise movement of the original), so careful movement and planning is required.   In the end The Swapper is a beautiful, artistic, and stellar creation and is absolutely a must have for any fan of the science fiction genre!",
            "review_score": "1"
        },
        {
            "review_text": "I started playing this one just before procuring a short-term office job - one which walks that thin tight-rope between being utterly mindless and requiring just that teeny weeny bit of mental concentration - and I'm afraid that this game has been a temporary casualty of said event. In other words I've thrown in the towel for the time being, but most certainly NOT because this isn't a ♥♥♥♥ING EXCELLENT GAME.     See, I'm over 40 now, and despite having not consumed all THAT much alcohol for a human of my years, I still only have so many brain cells to go around...and a large number of them have recently been dedicated to the practices of getting up ridiculously early (like, before MIDDAY, for ♥♥♥♥'s sake), showering and dressing (in more complicated clothes than a pair of shorts and a t-shirt with holes in it), brushing my teeth and hair, spraying on some deodorant, then getting on a bus and doing a six hour shift - that's SIX MOTHER♥♥♥♥IN' HOURS, goddammit - in which I fiddle with reams of paperwork. So when it comes time to drag my weary ♥♥♥♥ home and put on some well-earned games, I'm really not up to anything which requires as monumental a mental effort as this absolute little GEM of a puzzle-platformer. This game is SMART, yo. Almost too smart for me at the best of times, and frankly way over my head in its current state of cerebral short-circuit.    So yes, after getting, I dunno, maybe half-way or so through it, I've had to put this game aside for the time being...but believe me when I say I WILL be coming back to it. Between the ingeniously imaginative clay-built visuals, the cleverly-implemented cloning device your character uses to multiply himself, and the completely logical yet sometimes mind-♥♥♥♥ingly hard puzzles themselves, this game has QUALITY written all over it. Highly recommended to anyone with an IQ at least slightly above that of a well-bred chimp (which isn't me right at this moment in time, sad to say)...   Verdict: 9.5/10.",
            "review_score": "1"
        },
        {
            "review_text": "Nice little puzzle game on a space station. You can clone yourself 4 times. Unfortunately the graphics are very blurry. But the atmosphere is quite good and creepy. Like thinking stones, talking brains and a huge lonesome labroratory in space. You must explore the whole map and collect orbs to finally leave it. The only way to die is to fall down from a high gap. Sometimes there are random astronaut radio chats played.",
            "review_score": "1"
        },
        {
            "review_text": "This game revolt around a single theme: loneliness. The only gameplay mechanic rotate around this theme. I've never felt okay with using the 'Swapper Device', but you need to do what you can to get out of here. A really wonderful game that match atmosphere, story, music and gameplay into a simple yet engrossing game.  Ce jeu tourne autour d'un seul thême: l'isolement. La seule mécanique de jeu complète le thême. Je ne me suis jamais sentit à l'aise avec l'utilisation du 'Swapper Device', mais tu dois faire tout ce que tu peux pour t'en sortir. Une jeu passionnant qui agence atmosphère, histoire, musique et jouabilité dans un jeu simple, mais intriguant.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game! idea, story line, sound tracks, atmosphere.. didn't finish yet but i'am so excited!",
            "review_score": "1"
        },
        {
            "review_text": "Some great puzzles, and a really interesting story. The voice over got confusing at points because many of the characters sound the same, and it was hard to tell who was speaking.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Atmospheric sound and interesting puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Cool atmospheric sci-fi / space puzzle platformer. It somehow feels creepy but without really being it.. Good job.",
            "review_score": "1"
        },
        {
            "review_text": "Short, sweet, innovative, fun and great music. I love puzzle games. This one is definitely on my must play list.",
            "review_score": "1"
        },
        {
            "review_text": "The puzzles in this game were just right. I had to shake my head and give up on a few, but when I came back to them later I was always able to figure them out. In other words, they're really satisfying.   Likewise, the setting, atmosphere and story all align perfectly with the exploration the game calls for.  Finally, after finishing the game and contemplating the story for a while, I noticed that I had failed to get any of the games 10 achievements. Apparently these are comprised of secret rooms that I had no idea existed. I'm looking forward to playing through again in search of them.",
            "review_score": "1"
        },
        {
            "review_text": "I can't fathom how a team of 3 (4? something like that, definitely fewer than 10) people could craft something so intricate and polished. It's beautiful: the graphics, the music... Not your average side-scrolling puzzler. It definitely kept me on th edge of my seat for a long time, trying to figure it all out. It's underrated, this one.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is a masterpiece for your ears, your eyes, oh and even for your brain too. It's an amazing atmospheric game which is clever, smooth and truly grasps the concept of feeling completely alone in an environment. The ambient soundtrack and lighting really polishes this game, a definite for those who simply love solving puzzles. If you're going to play The Swapper, you really have to turn off the lights and put on your headphones now you're ready to dip into one of the most atmospheric games in this genre. I found this game well worth its price very early in, and held the feeling all the way through.",
            "review_score": "1"
        },
        {
            "review_text": "  The Swapper Review",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzle game with an interesting but unintrusive story. If you would like Portal-like challenges in a platformer context then this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT little indie platform puzzle game. Has an awesome art direction along with some really unique audio and soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "This has to be one of my favorite games I have played in a long while. It is a beautiful looking game and add to that the soundtrack, it completely immersed me into the game, something that doesn't often happen for me. I really enjoyed the game mechanics too, well polished. It was a very enjoyable puzzler that didn't get stale by the last puzzles. As the puzzles got harder I felt as if I learning and progressing along and those harder puzzles gave me a chance to show off my new knowledge. The story was equally enjoyable. It was pretty heavy on the philosophy, which I can't say I minded. It gave me something to think about as I wandered alone in an abandoned spaceship :)",
            "review_score": "1"
        },
        {
            "review_text": "The swapper is a game for your ears, your eyes, oh and even for your brain too. If you´re going to play The Swapper, you really have to turn off the lights and put on your Headphones now you´re ready to get into one of the most atmospheric Games!",
            "review_score": "1"
        },
        {
            "review_text": "The first thing you'll likely notice about The Swapper is its incredibly unique visual style, which eschews computer generated animation in favor of stop motion animation and photographs of real life objects. Beyond that, the gorgeous visuals combine with an amazing ambient soundtrack and superb sound design to create a foreboding atmosphere, which suits the game's dark science fiction setting and story. And this game's more than just a pretty face, it's one of the most superbly designed puzzle experiences I've had in a while. The game's central mechanic is the swapper device of the title, which allows you to create and control up to four clones of yourself, and swap control between them. This fairly straightforward conceit is well-utilized in the game's many clever and satisfying puzzles. There's only two things - not even cons, really - that one should be aware of before buying this game, however. The first is that in spite of the Metroid-style map layout, it's not really a Metroidvania game. You don't gain new power ups, and there's not much in the way of branching paths or open-endedness, beyond simply being able to choose the order in which you solve certain puzzles, or skipping an especially tough one. Rather, the entire game is simply devoted to telling its story and exploring the possibilites of the swapping mechanic. Which I feel is to its credit, but it's something to be aware of anyway. Last, it's a short game. Like, super short. I finished it in four hours, if you have a lot of trouble then maybe call it five or six tops. Nor is it especially replayable, beyond taking the time to finish every single puzzle or find the ten secret terminals hidden throughout the game. It is highly satisfying for its length, however. Whether or not you should wait for a sale isn't something I'd want to decide for you, but one way or another I do highly recommend playing this game, it's a fantastic puzzle game that did a great job at making me feel really clever as I figured it out, and I enjoyed every minute of it.",
            "review_score": "1"
        },
        {
            "review_text": "+Fantastic sound design. +Wonderfully stylized presentation. +Polished graphics. +Iterative innovation on proven game-play concepts. +Mind-bending puzzles.  -Too short. -Story misses a few minor beats.  The Swapper has quickly become a favored indie title of mine, surpassing top-notch titles like Fez and Braid. I am subjectively biased by the more serious tone and sci-fi setting though. The story is light, but engaging. The derelict space-station setting provides a miraculously haunting atmosphere. Characters are voiced adequately, though the performances border on becoming too withdrawn (which is part of the story/setting, but felt extreme at times). Very short, though still quite fulfilling. If most plot driven titles are novels, then The Swapper is ultimately a great poem; metered, personal, and interpretive. A beautifully sad journey and a striking metaphor for real human struggles with individuality.  Comparable games: Braid, Super Metroid, Portal",
            "review_score": "1"
        },
        {
            "review_text": "Good game, simple yet addictive",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper   Short words: Beware of own brain damage   'You litterally have to swap your mind with somebody genius to be able to solve the puzzle here'   Complete Review: If you like sci-fi and puzzle , this is the game for you, i repeat, if you really like sci-fi and puzzle , this is the game for you, you have to buy it ! Not only the story elements and the sci-fi elements that amaze and interest me the most, they have successfully combine the puzzle elements in it. They stuck the science inside your mouth, and you will likely stare at your screen for 30min thinking.  The mechanism of the puzzle is what really makes this game stands out from the other puzzle game. Among the most dificult puzzle mechanism i found from all puzzle games. Very unique puzzle mechanism which is nowhere to be found these days. 200% recommended for puzzle games seeker.   10/10 - couldnt beat this game, (yet....)",
            "review_score": "1"
        },
        {
            "review_text": "really fun puzzle game with an intriguing story",
            "review_score": "1"
        },
        {
            "review_text": "A well done puzzle platformer. One of the more intriguing elements in the game is that they incorporate the philosophy of mind in the story. They use Daniel Dennett and David Chalmers as the protagonists for their respective positions (merely referred to by their last names in-game). Dennett does not believe in consciousness (soul in the game) and Chalmers is an advocate for consciousness (soul). Although the pro/con soul/consciousness debate is largely lacking the kind of robustness seen even in an elementary exposition of their positions in philosophical writing, it does a fair enough job to be provocative even for the veteran of philosophy. Additionally, experiencing it in an already mind-flexing puzzle game is icing on the cake. Therefore I don't dock them points for oversimplfying the philosophicals issues touched upon in the game. Even without the philosophical debate, the puzzles are enough to warrant the play through.",
            "review_score": "1"
        },
        {
            "review_text": "Cloned. Swapped. Finished. Depressed.",
            "review_score": "1"
        },
        {
            "review_text": "GREAT little indie platform puzzle game. Has an awesome art direction along with some really unique audio and soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "A highly atmospheric 2D puzzle game involving clones and swapping consciousness. It's incredible!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely intriguing game, the atmosphere pulls me in and the story thus far runs quietly and smoothly in the background pulling you along.",
            "review_score": "1"
        },
        {
            "review_text": "Without a doubt, this game is a hidden puzzle gem. The story is short, but will blow your mind. The puzzles are nice too. The game itself is quite short, but I still have to recommend it! If you like puzzles and a good story, this one won't let you down!",
            "review_score": "1"
        },
        {
            "review_text": "Like Portal, but darker and with sentient rocks.",
            "review_score": "1"
        },
        {
            "review_text": "This is probably one of the coolest, most beautifully imaginative games I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A really good and difficult puzzle-platforming game. The twist? A moral-choice ending.",
            "review_score": "1"
        },
        {
            "review_text": "One of the deepest story I've witnessed in a video game about soul and meaning of life, great puzzles, amazing soundtrack. 10/10. Definitely going to play again.",
            "review_score": "1"
        },
        {
            "review_text": "If you like tough puzzles in the vein of Braid, where you really need to take a step back and think - then give this a bash. Beautiful looking, very atmospheric, and at times headslappingly frustrating.",
            "review_score": "1"
        },
        {
            "review_text": "Phenomenal bit of science fiction, and pretty tricky puzzles too! Very highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "The game idea is to solve puzzles by cloning the character you control and swapping positions between each one. This remind me of  The Misadventures of P.B. Winterbottom . Both are worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle-based games rarely offer the depth and atmosphere The Swapper provides. The game takes place in a beautifully realized science fiction setting; as you traverse an enormous yet desolate research station orbiting an alien world, you begin to piece together an understanding of the events which led it to such a state. However, with each bit of information about the past that you uncover, new questions about the present begin to appear.   Overall, The Swapper is a game that accomplishes a lot without overstaying its welcome. It's short enough (roughly 3 - 6 hours) that despite puzzle mechanics that are fairly limited in scope, it rarely feels repetitive, and it leaves you satisfied but wanting more. I'd highly recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Very eerie Metroidvania-style which has a really cool plot about the philosophy of metaphysics, the mind, the sense of self.  It's also gorgeous and fun to play. Definitely recommending.",
            "review_score": "1"
        },
        {
            "review_text": "Deep. Like deep space. Do your choices affect others? Only yourself? Are they one and the same?   Play if you like puzzles, sci-fi, and isolated self-reflection.",
            "review_score": "1"
        },
        {
            "review_text": "Phenomenal bit of science fiction, and pretty tricky puzzles too! Very highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Phenomenal bit of science fiction, and pretty tricky puzzles too! Very highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "It's always nice to be introduced to a new game mechanic.  It's also nice to have to start thinking.  It's even better if you're thinking because of what the game mechanic makes you do.  Swapper does it all, and then some. Brainteasing puzzles, philosophy course required. You want this game. You need it. And once you're done playing this beautiful game based on clay-made backgrounds you may end regretting your final decisions. And play it again.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing puzzle game with a nice story. 11/10 - Would swap again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing, the quality is way higher than i expected, i should have bough full price for this masterpiece.  Edit:  By masterpiece i meant really good atmosphere, and in space themed games, atmosphere is everything. (no pun intended) Gameplay is tradicional multi-unit control/swap puzzler",
            "review_score": "1"
        },
        {
            "review_text": "Deep. Like deep space. Do your choices affect others? Only yourself? Are they one and the same?   Play if you like puzzles, sci-fi, and isolated self-reflection.",
            "review_score": "1"
        },
        {
            "review_text": "A+ game, a true hidden gem, As you progress, you realize the true potential of the clone gun and the power it provides. Puzzles are challenging, artwork is great, atmosphere is amazing, overall joy to play.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper's core game mechanics are bizarre but straightforward, and you learn most of the tricks very early. The game is clearly delineated into a nonlinear collection of puzzle rooms, but the pacing is managed well by filler sections that advance the plot and showcase the game's gorgeous atmosphere. The actual puzzles are elegant and each very short, which helps with the pacing. The game's story is cerebral and complements the atmospherics nicely while tying everything together. Overall, it's a short but well-put-together puzzler that will leave you thinking.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is a 2D Puzzle Jump&amp;Run in which you have to clone yourself and swap control with your clones. All clones do the same action though, that means if you move left, all your clones move left, too. - I won't write much about the story to avoid spoilers but let's say it is well presented in my humble opinion and is even a bit philosophic. - The music is very atmospheric but fitting. Speaking of sound, you should enable subtitles, because at times it might be hard to understand all dialogue. - The graphic design is very nice it revolves around a lot of blue and dark tones and adds to the isolation the game is going for. - the difficulty keeps rising as in every good puzzle game, I got stuck at some riddles but it was not frustrating enough that I had to look up solutions. - For all achievement hunters: You won't unlock any achievements by finishing the game or puzzles. I won't tell you though what you have to do :P",
            "review_score": "1"
        },
        {
            "review_text": "The swapper is a decent puzzle platformer with decent ambience, fresh gameplay mechanics and in my view, some of the most beautiful backgrounds yet seen in a sidescroller.   My one major gripe with some of the game's design choices center around the developers decision to use really thin fonts in the logs that expand on the story. Probably won't be an issue for most users, but if you have problems reading in low light, you may need to occasionally head over to a wiki to read up the terminal logs.. otherwise you might end up missing a rather thought-provoking story. Still highly recommended however.  p.s: The achievements in this game be maybe impossible to find on your solo playthrough. Unless you are extremely lucky, you are going to need a guide. Go for it, as you can't revisit the unlocked stages to get them once the credits roll.  Good luck.",
            "review_score": "1"
        },
        {
            "review_text": "simply one of the most beautiful and intriguing puzzle games I have ever played. it gives you a wonderful, atmospheric world to explore (with a very cool and unique main game mechanic) filled with beautiful and sometimes chilling soundtracks to accompany you. this game is a must play.",
            "review_score": "1"
        },
        {
            "review_text": "A very nice sci-fi storyline embbed with really great puzzling action using a 'clone-gun' to solve the 2D puzzles. A must play for every puzzle fan player.",
            "review_score": "1"
        },
        {
            "review_text": "Short, but reasonably entertaining with a unique art style. Pick it up if it's less than five dollars.",
            "review_score": "1"
        },
        {
            "review_text": "From Polygon: 'You are every clone, and every clone is you. And yet, every clone is dispensable. Death is the gameplay. The making and disposing of clones is as necessary as walking and jumping.'  Gorgeous visuals, a creepy plotline and the unsettling feeling of killing hundreds of copies of yourself make this quite the experience. It's easy to get drawn into the sensation of exploring this beautiful, still world. And the sound design is just brilliant.  The gameplay introduce new elements to you at a good clip, but not so fast that they become confusing or overwhelming, and the cloning mechanic means that it's not a simple rehashing of stuff we've seen before; puzzles are original, and engaging.  Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Steam Cleaning - The Swapper&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "The more I play this - the more I like it!   You look at it and think 'Hey look, a puzzle - cool i like puzzles' but until you play it you don't see the amazing detail of the world you're exploring and see how the puzzle actually fits-in with it.  Then there's the way the game opens-up leaving you with some options as to how to proceed and encouraging exploration instead of just 'solve another puzzle - get an Orb - unlock a door - solve another puzzle'.  I cannot really recommend it enough - if you have the remotest interest in puzzles, you need this game.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful piece of art, smart game, a lot of complicated puzzles that you will have to go through, using your 'Swapping' technology, music fits just right, sometimes when i run around it gives me the great memories i had with the old Abe's Oddysee. A great game anyway, if you have enough money, and you are into puzzle games, this one won't disappoint you.",
            "review_score": "1"
        },
        {
            "review_text": "truly one of best indie games.",
            "review_score": "1"
        },
        {
            "review_text": "the real dead space",
            "review_score": "1"
        },
        {
            "review_text": "Pros: +Immersive athmosphere +Amazing graphics +Good gameplay +Nice soundtrack  Cons: -Too short -Some puzzles are too hard  8/10",
            "review_score": "1"
        },
        {
            "review_text": "Visually and audibly pleasing, but with so much atmosphere and fun braining tickling puzzles using a very unique play method to tackle each platform based problem.  I've lost interest in most platformers, as I grew up on Nintendo Manic Miner, Mario Brothers, Giana Sisters and hundreds of other 8bit to 16bit, which over the tens of years has washed down this once fun experience, yet with  'The Swapper'  it feels so original and fresh. Original A tough things these days, but always possible of course and this game proves that.   *3/3*  -  A tried and test formula that actually feels fresh and very playable ",
            "review_score": "1"
        },
        {
            "review_text": "Good game but not worth 11.99. What is it with Steam? as soon as a game gets positive reviews they hike the price up.  I recommend the game but it is too pricey for what it is.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "It is a very good game fun puzzles and fun to mess with your dupelacits only thing i dislike about this game is the story it confused me. i also dont like the background noizes but that is all other wise great game :D",
            "review_score": "1"
        },
        {
            "review_text": "a very interesting and enjoyable puzzle platformer, with some interesting subject matter. great puzzles and graphics",
            "review_score": "1"
        },
        {
            "review_text": "This game is the definition of atmospheric. It looks great. It sounds great.  Story: I have to say, I am impressed as to how they came across telling it. In Swapper you explore the Station Theseus, in a Metroidvania style, solving the mystery as to what happened, and why it happened. (If you don't know what a metroidvania is, just google it)    Beware, there are 2 endings to the game at the end. Make the right choice.     Gameplay: The game itself is a collection game. Get # orbs to activate # things. You solve these puzzles to get these orbs to advance the game and therefore the story. I honestly don't care about this. I enjoyed the game mechanics as much as I enjoyed the story of it all. The puzzles were great. They utilized the game mechanics perfectly. In order of game mechanics appearing: cloning/swapping, buttons, lights that prevent you from cloning/andor/swapping, gravity changing. Slowing down time is a vital mechanic that made this game so much fun as well. Mid way through the ramped up the difficulty of the puzzles. I admit I had to use a few guides to figure them out.  Visuals/Sound: This game looks so good. The claymation was fantastic, I didn't even know it was clay at first until I read it somewhere. And the sounds were satisfying to hear. I sometimes ran forward/back just to hear the doors slide open/closed.    The achievements in this game are secret terminals that you have to search for. Make sure you try to find them before you activate the 124 terminal though, that's the point of no return.     7/10 This game impressed me. The storys great. The puzzles are great. And it looks and sounds great. Why are you still reading this? Buy this game already. It's also available for PlayStation now if you're into that.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyable puzzle platformer. Not too long, not too difficult or too easy. ",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game. Game looks absolutely amazing and the musics are astonishing. The atmosphere is really creepy in a good way and the story makes you want to finish the game at one sitting.  I have never seen a game quite like this one. One of the better indie titles that are out there. ",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Super fun game. I had the same feeling I had while playing Portal for the first time. Some of the puzzles are really hard to figure out, but that's what makes it rewarding. Awesome story and great music. The best short game I've played in a very long time.",
            "review_score": "1"
        },
        {
            "review_text": "I don't play a lot of platformers but when I do, I play The Swapper. Genuinely fun and the puzzles go from 'I got this' to 'I have no idea what im doing' relatively quickly. Im about half way through and the story is definitely very Sci-fi, but the soundtrack and animations are top notch. Very good ambiance that the devs created. Definitely worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "This game was really great! The puzzles had a great range of challenge, the atmosphere was spooky, and the story was great. It definitely did not overstay its welcome either, and had a very satisfying ending.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, I just started playing this, but I can already see that it's going to be an awesome game. Thanks for putting so much into this, guys.",
            "review_score": "1"
        },
        {
            "review_text": "amazing game, you swap between yourself and 3 other holograms. this game needs to be played while stoned.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game.  Fantastic graphics, a really unsettling setting (and mechanics, once it kicks in), and some really really brain-twisting puzzles.  Highly recommended!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzle platformers I've played",
            "review_score": "1"
        },
        {
            "review_text": "WHY DOES NO ONE ELSE OWN THIS.  One of the very best platform/puzzle games I've ever played, and I'm not usually a fan of these. Excellent atmosphere and music. Very smart puzzles that are fun even when they're hard. Very nice and slow learning curve. A must buy if you like games like Portal.  Near perfect/10",
            "review_score": "1"
        },
        {
            "review_text": "Not bad if you can get it for like £2.00 or so. It's 4-5 hours long. Shorter if you're a genius.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute fantastic puzzle\\platformer with atmosphere, a great soundtrack, intuitive puzzles\\level design; and with just enough of a story to keep you interested. The game shines from it's simplicity; but yet challenging enough that it's not a cakewalk.   I beat the game in ~7 hrs; and most of the puzzles took ~5-8 minutes average (longer for the last few that really make you think).  My only con is that there isn't more!  If you like simple puzzle games with atmosphere, then for the price (especially if on sale) you can't go wrong.  8\\10  ",
            "review_score": "1"
        },
        {
            "review_text": "This is one of my GOTY candidates for 2013. Even if it doesn't win, it is certainly within my Top 3. Reminiscent of Limbo ever so slightly in terms of presentation, but better than it in basically every way. I love the eerie atmosphere, the provoking storyline and the puzzles are do-able (not too easy, not too difficult). Expect around 7 hours of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful, compelling, and just the right amount of challenging.",
            "review_score": "1"
        },
        {
            "review_text": "If you have a tolerance for fiddly puzzles, play this because it's pretty. Comparisons to Amnesia, Metroid, etc are inexact-- the creep factor evaporates quickly, and the platforming is almost literally point and click. If the thought of going back to first year Philosophy makes you break out into a cold sweat, avoid, avoid, AVOID. It's very much a 'games as art' game, one that makes noises about asking about the nature of the soul and consciousness, but one that comes across with only slightly more depth than a stoner freshman wondering if he really exists.",
            "review_score": "1"
        },
        {
            "review_text": "Nice puzzles, some are very challenging.",
            "review_score": "1"
        },
        {
            "review_text": "This has been a really enjoyable puzzle game. The mechanics are great. The world that it builds is beautiful and errie. Not what i expected at all, very glad I gave it a chance!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and captivating. One of the best indie games ever made.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is a new twist on the puzzle platformer genre. It combines a great atmosphere with excellent storytelling and unique gameplay mechanics to form a well-crafted game.  The gameplay revolves around the use of the swapper device, which creates clones of yourself and allows you to move your consciousness between them. Clones are used to get to locations you wouldn't be able to reach otherwise and to press switches. Different colored lights block the swapper functions so you have to think carefully about how to use the swapper in each puzzle.  The graphics are very good for this sort of game. They have a bit of a hand-made look, like they were constructed out of physical materials and then scanned into the game. It creates a very unique style which fits the game perfectly. The game mixes these elements seamlessly with graphical effects to create a very immersive world.  While the game is rather short (4 and a half hours seems to be about average) it is a very high quality experience. I highly recommend it to anyone who likes puzzle platformers.",
            "review_score": "1"
        },
        {
            "review_text": "This game really good. Nice graphic and a great story. If you're a fan of sci-fi. You'll love this. Only a downside is if you don't good on puzzle. You'll get upset when struck before the ending. Because you need to solve all puzzle to get to the ending.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most innovative and satisfying indie experiences I have untertaken in a long time. The surrealist interplay of light and sound compliments the clever and outright fun (remember fun?) gameplay mechanics, amounting to something more than the sum of its parts.",
            "review_score": "1"
        },
        {
            "review_text": "Couldn't recommend this game enough. It is just another puzzle-room game, but with a core game mechanic that is both original and deeply disturbing when you think about it. Looks and sounds great. Can do no wrong in my book.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game.  Great puzzle game. I found it chalanging and fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorite games of 2013. It's just all-around excellent.",
            "review_score": "1"
        },
        {
            "review_text": "If you love a good space mistery story, with great music and some good puzzles, you should REALLY try this game. And if you dont, you should give it a try as well!  It's a great experience in any case, i enjoyed every minute of it!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent atmosphere and interesting and fun puzles.  + Music + Core game mechanics + Nice sci-fi atmosphere and narrative + Fantastic ending + Interesting visuals  - Some might find it short, but I like it that way - Very structured in a sense that mostly it's puzle rooms set in a large space - Map can be a bit confusing  I definitely recommend this game and I'm waiting what these developers will make more.",
            "review_score": "1"
        },
        {
            "review_text": "'You can die here, or you can do what you have to to go on.' These haunting words are all I could hear resounding my head during the final choice of the game The Swapper. Neither option was good, but they were both equally viable. So why was it such a big deal to me? Because The Swapper had swallowed me whole, and I was in it's world and this felt like a real decision.  I first saw this game earlier this year when it first launched on Steam. It's trailer intrigued me and I love puzzlers, so I added it to my wishlist. Come Summer Sale, my friend gifted the game to me when the price dropped. And now I have to thank him wholeheartedly because The Swapper is the one of the most intriguing, thought-provoking, puzzling, and, at many times, fun experiences of not only this year, but that I've yet played.  The story is set far into the future, and you have just arrived on the derelict Space Station Theseus. There is no indication to who you are, what the Station is there for, or where everyone went. You simply enter the Station and find the enigmatic Swapper device. And here lies the game's central gameplay mechanic and moral dilemma: you can create and swap into clones of yourself and use them to solve puzzles aboard the ship, however in doing so and exploring the station, you often have to kill the clones. The game then goes from there, taking you on a puzzle-filled tour of the station, as you investigate what went down on Theseus and follow the instructions of a mysterious woman that is also aboard. Both lead you on a quite a ride, all the way to the mind-blowing ending I referred to earlier.  I am pleased to report, that the puzzles are the best puzzles this game could have. It's the sort of puzzle that is Portal-esque in nature, simple but difficult simultaneously, but always logical. I only had to look up solutions twice, and both times I immediately facepalmed myself (likely where the developer's name originated from) for not realizing the solution that was staring me in the face. I was quite okay with this, because it was never frustrating at all when playing, and when I absolutely couldn't figure out to solve it, I'd just go to the other availiable puzzle to solve and return to that one later with fresh eyes. And when I did solve them, there was always that joy of 'Yes! I DID IT!' accompanying it.  The Swapper is a game I must insist you play. It's fascinating and thoughtful plot and well-crafted swapping mechanic and puzzles demand a playthrough. I don't often say a game simply has to be bought, but here it is. The Swapper is a wonderful adventure, puzzling from story to gameplay, that questions the true nature of the mind and soul, and the extent of what it means to have one.",
            "review_score": "1"
        },
        {
            "review_text": "Like the athmosphere, subtle light and color changes in the background, the mechanic sometimes tickles my brain more then I had expected. Achievements are a bust for me, though. Couldn't make any sense of them and didn't do one by chance. For all the slower paced people who don't need 64 people shooting at them, this will keep you happy for a while. I like it very much. A 'coldheartedly discarded clones' counter would have been nice :).",
            "review_score": "1"
        },
        {
            "review_text": "I just finished my first completion of this game. Took just under 8hrs.  I concur with the high reviews it's received. The atmosphere created in this game is awesome. Both in visuals and audio/music integration to the storyline.   The puzzles get progressively harder peaking with the ennagon rooms. I actually had to take a break at one point because I hit the 'I swear I've tried every permutation' mark, but then you come back and see the new thing it requires, and it helps with the others. In retrospect, this is how the entire progression happens.  The Storyline is very well done, and digs into existentialism and metaphysics in a way that really makes you think about identity and what actually defines it. And ultimately you must decide what that definition is by the end of the game (and why I want to play it through again, beyond trying to find the other hidden areas).  The physics and perspective (creating not only a sense of 3d, but a well done transformation of a centerless 3D space onto the 2D UI.   One takeaway I'd give it is the way the achievements were done, but that's more of a Steam integration aspect, and not about the game itself. The other is how difficult it is to find hidden things, even with actively looking for them. It makes Capsized's hidden rooms seem obvious.  All in all I'd give it a 90+% Highly Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "Short, but had some decent puzzles, especially toward the end. Great atmosphere. Definitely worth the time and price.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very good game. The end.",
            "review_score": "1"
        },
        {
            "review_text": "Would you like some legitimate philosophy of mind with your densely atmospheric puzzle sidescroller? YES.",
            "review_score": "1"
        },
        {
            "review_text": "good stylish puzzle platformer",
            "review_score": "1"
        },
        {
            "review_text": "If you like desolate space games, then this is for you. It's not about mutant monster aliens or laser shooting space ships, but about humanity and what they found when they set out to the last frontier. They found technology. They used it. But they did not understand...",
            "review_score": "1"
        },
        {
            "review_text": "Indie sci-fi side-scrolling puzzle platformer with a surprisingly excellent, well paced story. The approach to puzzle solving here is very refreshing. Instead of the rudimentary puzzles found in most games, (find and place the key here, turn a crank there, solve a riddle and open sesame) this reminds me of the thought process involved when solving logic puzzles. ie: a rubix cube, tile puzzle, tower of hanoi,etc. These become increasingly challenging toward the end, though the progressional story is well worth it.  The story is intially laid out in an archaic manner, progressively connecting the dots in a relavatory fashion, ultimately leading to a profound choice in the end.  Highly recommend buying! Well worth the $!",
            "review_score": "1"
        },
        {
            "review_text": "If the definition of insanity is doing the same thing over, and over expecting different results - this game is a good representation of that. To say the least this game has numorous puzzles that will keep you puzzled. I had to stoop so low as to go on Youtube searching for the solutions. I still have yet to beat the game so I cannot review the story in the game, but still it's a very well constructed puzzle game! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Oh. My. God. Have you not played this game yet? Why? It is absolutely stunningly beautiful. The graphics are entirely made of clay, and the soundtrack? DAMN. Not to mention the insane, complex storyline. The dialogue is thought provoking and brings the characters to life. I used to think the 'Portal' series was the best puzzle games ever. Now... I just don't know. Chell might have a run for her money. 10/10 would replay (have).",
            "review_score": "1"
        },
        {
            "review_text": "Nice art style, fairly short and most importantly, challenging. Good game - would recommend if you want something to keep you busy for a day.",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game with superb puzzles. The best puzzle games have simple mechanics, but from them come deep complex puzzles which just require thought, and that's what this has. It's beautiful too, which helps.",
            "review_score": "1"
        },
        {
            "review_text": "Very unique, atmospheric game with good puzzles. Interesting plot (and ending).",
            "review_score": "1"
        },
        {
            "review_text": "Puzzes are great, atmosphere and music is even better.",
            "review_score": "1"
        },
        {
            "review_text": "Solid spacial puzzle game, great atmosphere, gorgeous graphics, some nice gameplay and plot twists. Very enjoyable. 4hrs was just right, music also fantastic. Loved all the time I spent there and didnt want to leave.  My only gripe is I would have liked to be able to experience the alternate endings and explore the station without having to begin the game again.  Achievements very well hidden",
            "review_score": "1"
        },
        {
            "review_text": "Good puzzles. Great atmosphere. Nothing trying to jump out and kill you. Very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "You'll love the satisfaction of each puzzle solved. The soundtrack is so amazing. This game is not very children friendly though, they will soon be bored/frustrated with the puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper was one of those unusual surprises to play. The game starts off simple enough and keeps an eerie vibe where you know very little about what´s going on and even who you are. Enter 'The Gun' and everything changes. The gameplay becomes a series of amazing puzzles that are only interrupted by little bits of story that grows into you and develops until you reach a mind blown ending. Being a plataformer fan myself and a gaymer who prefers story over bling this quickly became an instant favorite.",
            "review_score": "1"
        },
        {
            "review_text": "Just brilliant",
            "review_score": "1"
        },
        {
            "review_text": "Great Game..., very addictive",
            "review_score": "1"
        },
        {
            "review_text": "THE SWAPPER is a puzzle plattformer that does everything in perfection. In THE SWAPPER you have the so called swapping gun. With this gun you can create clones. The second feature of this gun is that you can swap your soul with one of the clones. For example: You see a high plattform you want to reach - you create a clone on top of the plattform and then swap souls with the clone to get on that plattform. The catch is that only the clone with your soul has the gun. First of all the Level design or puzzle design is the best I've ever seen. No game can't top these engenius puzzles. No not even PORTAL. Every puzzle is a challange to overcome and if you find the solution after dozens of tries your mind will be blown. Oh and you know what your are fighting against in this game? Stones. Stones that began to think and communicate with each other. As stupid as it sounds those stones called 'The Watchers' are the most ♥♥♥♥ed up things you will ever encounter. Humans are able to hear the thoughts of the Watchers. And those thoughts are really creepy. I never thought that a stupid rock can be so scary. The game also talks about alot of philosphical questions. Of course the all have to do with the soul and the body. Is the soul really a part of your body? So you see that I like this game. I don't like it, I love it. It's really the best game I've ever played. I'm not kidding! And trust me I've played a lot of games. THE SWAPPER is a hidden gem that a lot of people missed.",
            "review_score": "1"
        },
        {
            "review_text": "Very intriguing game. Definitely gives food for thought, so you won't be going hungry. Not having completed the game, I'm still puzzling at the implications the plot brings up. But then again, I'm not the purplest sword in the inventory...",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzle games with an intriguing atmosphere. A must play If you like science fiction..",
            "review_score": "1"
        },
        {
            "review_text": "Being a game that you finish in around 5 hours, give or take, it manages to pack a lot in a little.  The game feels a lot like a platform version of Portal where instead of shooting portals you shoot up to four of your own clones. This mechanic is used throughout the game to solve puzzles which grant you orbs. These orbs are used to open up the next areas and progress through the story.  Pros: - Artistic style and animations are beautiful. - Some of the puzzles are really mind boggling. (That's a good thing!) - Story is good for a puzzle game but one might need a few college degrees to fully grasp it.  Cons: - The achievements for this game are all 'achieved' by finding very well hidden messages. These messages are probably the best way to understand the story yet they are hidden so well that the only way anyone would find them is looking for their location on the internet.",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet game.  Interesting puzzles that ramp up in difficulty nicely. The combination of an interesting story and cool puzzles drives you on through the mystery that unfolds.  The ending is really quite interesting and forces you to think on some of the wider issues around cloning, the human mind and your very soul.",
            "review_score": "1"
        },
        {
            "review_text": "It's neat, play it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is as good as its name is bad.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic puzzler - puzzles actually feel rewarding, instead of unnecessarily difficult. Heartily recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful. Makes you think about everything. This game gave me chills. 10/10 (Can't say anything bad about it, I personaly really liked it.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game that will have you scratching your head and sometimes smashing it on your desk. The story is simple but interesting and it's like nothing I've seen before come together.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is one of the coolest looking games of the year, a sci-fi-noir puzzle platformer with a unique clone/teleport core mechanic. I found it a little easy, but I loved playing and exploring the game's world. The puzzles are well-crafted, they have a good variety and are fun to contemplate and solve.",
            "review_score": "1"
        },
        {
            "review_text": "Solid puzzler. Really interesting world and environmental limitations. I would recommend it anyone that enjoys solving unique puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "This game is an absolute joy from start to finish. It is a great concept for a puzzle game to begin with but everything else around it is so well put together. The game is designed so that it flows like an adventure game rather than a puzzle one and it all comes wrapped in an eerie atmosphere. Its been a long time since I enjoyed a game of this type so much and that is a testament to how well made it is. Care has been taken to create a world around the puzzle to provide a complete package that just must be played.  10/10, an absolute classic amongst puzzle games for me. Its not long but its beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "I've only played 15 minutes of this game and i can already tell you that this is the best puzzle-sci-fi game since Portal. Buy it. Now!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. It is worth playing if you love Sci-fi and puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this game.",
            "review_score": "1"
        },
        {
            "review_text": "So good, must play!",
            "review_score": "1"
        },
        {
            "review_text": "GET THIS ♥♥♥♥ING GAME RIGHT NOW.",
            "review_score": "1"
        },
        {
            "review_text": "A very unqiue game experience. Well worth the price.",
            "review_score": "1"
        },
        {
            "review_text": "Very atmospheric, puzzles can be infuriating at times but its only because its forcing you to think outside the box, which makes it all the more rewarding when you finally crack the puzzle. can be comfortably beaten in about 6 hours, and thats getting stuck on several puzzles. worth a play for sure",
            "review_score": "1"
        },
        {
            "review_text": "An extremely good game.  I seen it on the store when it was released and the main image made me click it right away but to my disappointment it was a platform game so I took no further interest.  Again, I got this in a humble bundle so decided to give it a shot and I was really surprised. This is a really fun game that doesn't require a lot of thinking but can give you some nice puzzles. I'm only on the first chapter so I don't know the full extent of the game but it's great so far so that's a good sign.  I'd recommend buying this if you like portal.",
            "review_score": "1"
        },
        {
            "review_text": "atmospheric (enigmatic and little scary) sci-fi puzzle platformer. Original and smart puzzles based on your replicas. if you like Limbo, you will like this too.",
            "review_score": "1"
        },
        {
            "review_text": "Very unique and very fun game. The puzzles get harder and harder as the game progresses. The Swapper isn't very long - took me about 6-7 hours to finish on my first play through and I like to explore everything - but it is definitely something I enjoyed playing for every one of those hours. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A nice atmospheric puzzle solver where you'll be banging you head against the desk only to realize the solution is much simpler then you thought. In a landscape of crap indi games this one is easy to miss, but definitely worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzle game with a fairly unique mechanic of cloning yourself, up to four times, and swapping places with said clones. It has some fun with gravity too so expect the game to change up how to solve puzzles frequently. The atmosphere is great for a particularly sombre and intriguing story. There are some pretty good implied plot twists if you like to think and speculate about the characters. The controls are spot on for mouse/ keyboard(I didn't use my gamepad however the game does support my Afterglow xbox controller).  There really isn't any replay value....except to get all the achievements. I personally guarantee that you will get NONE of the achievements on your first playthrough of the game. My first playthrough lasted about 5 hours and the achievement hunting lasted abou 1-2 hours.  Overall I thoroughly enjoyed this game and recommend that everyone play it. ",
            "review_score": "1"
        },
        {
            "review_text": "A unique and haunting atmosphere, simple gameplay mechanics and genuinely interesting puzzles make The Swapper a fantastic game. Though the narrative can be vague, it raises interesting questions about the concept of identity. Play Swapper if you like puzzle games with a decent narrative.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Just finished it and I really wish I had spent more money on this thing. Bought it on a humble bundle and now I feel bad cause this game was Great! really diserves some success. Dark story good puzzles. This is a game to get you thinking. Deffinatly a good work of art.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper did its thing and did it well. The puzzles are a great difficulty often leading to me spending longer than i'd like to admit on some however finding them greatly rewarding once having that eureka moment. Was a great length with a interesting range of tatics required to over come variuous puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Excedllent puzzle game. Good story too.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent experience. Wonderfully dark environment with an interesting story. The in-game puzzles were very challenging. Ultimately, a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Smart platform puzzler with excellent art design and audio in a lonely sci-fi world. 3/5 clones.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is a beautiful and immersive puzzle game, with a throwback to 90's point and click PC games.  Every puzzle poses a challenge, but none are too difficult to require looking up the solution. I think the only puzzle that REALLY stumped me was the last one.  I am not big on 'stories' in gameplay, but The Swapper remained interesting, while never interrupting gameplay. However, like most games, the storyline seemed to borrow too much from film.  Overall, I definitely recommend The Swapper to anyone that enjoys puzzle solving games. ",
            "review_score": "1"
        },
        {
            "review_text": "Everyone that only slightly enjoys puzzle games should pick this one up. The atmospheric and philosophical rollercoaster of this title is so unique and immersive. It reminds me of old sci-fi films like 'Solaris' (1972), Stalker (1979) and 2001: A Space Odyssey (1968). PS: The ambient music is amazing!",
            "review_score": "1"
        },
        {
            "review_text": "This unique twist on the side-scroller puzzle game presents a protagonist with a distinct case of multiple personality disorder transposed into the game world.   PROS: Very atmospheric interesting textures good lighting effects  CONS: Could use a better side view for the head of our intrepid self-cloning explorer A few glitchy areas requiring point-and-click precision to make progress",
            "review_score": "1"
        },
        {
            "review_text": "Loved the mechanics of The Swapper along with its eerie atmosphere and incredible soundtrack. The story was surprisingly dark and deep. The puzzles felt fresh throughout the story, with a few challenging ones here and there. Overall a great short game; recommended to anyone who loves a new puzzle and a good story.",
            "review_score": "1"
        },
        {
            "review_text": "This is absdolutely the best game to come out since Portal / Portal 2. Taxing on the mind and beautiful atmospheric graphics. Simply awesome... ",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper! Doesnt matter the price! IT IS WORTH IT!",
            "review_score": "1"
        },
        {
            "review_text": "this sidescrolling puzzle game is beautiful and sounds even better, dont overlook it",
            "review_score": "1"
        },
        {
            "review_text": "That is a frigging amazing puzzle game that delivers the brain into new dimensions. I thank the developers for this challenge. Keep them coming.",
            "review_score": "1"
        },
        {
            "review_text": "100% of Achievments. Almost 7 hours of gameplay.  Pros: - Creepy atmosphere, but don't worry... You won't sheet on ur pant - Some hard puzzles (Am I dumb?)  Cons: - None  Suggestions: - The achivements are secret roms. It's impossible to find the 10 of them without guides. - As always, a good Two-player campaign would be sweet. ",
            "review_score": "1"
        },
        {
            "review_text": "An incredible game. I put the swapper off for a long time before I played it and wish I hadn't.",
            "review_score": "1"
        },
        {
            "review_text": "Fun puzzle game with a solid plot.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game to make your brain think. Looking forward for 'The Swapper 2'",
            "review_score": "1"
        },
        {
            "review_text": "A fun puzzler with great atmosphere. You create clones and can switch between them using a 'swap' gun.",
            "review_score": "1"
        },
        {
            "review_text": "This game really challenges your brian.",
            "review_score": "1"
        },
        {
            "review_text": "Its suprisingly addictive, the puzzles are fun yet sometimes difficult. Won't say much about how it ends, but yeah. Its all up to you, pick your poison so to speak!  Only downside is that Beating the Entire game doesnt give you a single Achievement!?! That was a little bit of a let down. Apparently you need to do special things during the game to unlock the Achievements.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best puzzle platformer game since Braid. This game def on my top 5 indie games list, the Sci-Fi estrangement element is killer atmosphere too.",
            "review_score": "1"
        },
        {
            "review_text": "So I just sat down to check this game out for a moment, and before I knew it, 4 hours had gone by. This is a gem of a modern puzzle-platformer, emphasis on the puzzles.  I reminds me of games like portal &amp; fez, in that the player is forced to alter their perception in order to progress. The mechanics are simple in principle, and then combined in intriguing ways.  The learning curve felt very natural to me, with puzzles increasing in complexity on a fairly even scale, without any hand holding on the way.  While I was sorely tempted twice to rage quit and google the solution to a couple of puzzles, this game delivers the reward of that 'Aha' moment very well. It's also obvious that the developers paid a lot of attention to the tone that they wanted to set with this game. The story that is revealed as you progress is a mystery wrapped in a sci-fi package, and I was surprised to find myself contemplating the nature of the human soul while moving from puzzle room to puzzle room.",
            "review_score": "1"
        },
        {
            "review_text": "An extremely good game.  I seen it on the store when it was released and the main image made me click it right away but to my disappointment it was a platform game so I took no further interest.  Again, I got this in a humble bundle so decided to give it a shot and I was really surprised. This is a really fun game that doesn't require a lot of thinking but can give you some nice puzzles. I'm only on the first chapter so I don't know the full extent of the game but it's great so far so that's a good sign.  I'd recommend buying this if you like portal.",
            "review_score": "1"
        },
        {
            "review_text": "Download this game, now. Play it, when it's done downloading. No questions.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game. Unique platform puzzle and very good visuality...",
            "review_score": "1"
        },
        {
            "review_text": "Not only great puzzle design, but also great storyline that rise great question about life.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is a fantastic puzzler with an eerie and thought provoking atmosphere. The art style uniquely resembles claymation which gives it a homemade yet alien appearance. The sounds and music are topnotch and compliment the atmosphere quite nicely. Aside from all the visual and audial queues that make up the chilling atmosphere, the difficult and brilliant puzzles define the gameplay. Overall, one of my alltime favourite purchases on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "It's really satisfying to complete these puzzles! Sometimes they can really twist your mind and you feel you're thinking outside of the box when you solve them. The game looks really eerie and the soundtrack is quite soothing. The voice acting is a bit naff, because it seems like the one chick doing most of the voices, but she's good.  Watch out for those mysterious rocks, though!",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is an Amazing game. It has astonishing graphics and enviroments, and an awesome story. The gameplay is pretty simple but its great and smooth. The game is all about puzzles and its story kept me all the way and since i opened it i had to finish it ( it took me 4 hours).   I truly recommend this game, its a piece of art, its is incredible in all ways it could and i never thought the story would catch me so hard.   The only thing that i didnt like it is that all achievments are secret and they are actually 10 stations that are extremely hard to find and those stations have some pieces of the story.  i'll give it a 9/10.  Play this game.",
            "review_score": "1"
        },
        {
            "review_text": "It's a cool little atmospheric puzzle game. I thought it was awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game. The puzzles were very challenging and head scratching. The story was fantastic and loved every minute of the game.",
            "review_score": "1"
        },
        {
            "review_text": "A truly gorgeous platformer which sucks you in its atmosphere and doesn't free you for a while.",
            "review_score": "1"
        },
        {
            "review_text": "Short and sweet.",
            "review_score": "1"
        },
        {
            "review_text": "LOVED The Swapper. With rewarding puzzles and a thought-provoking story, if you're into space sci-fi, this is a must play in my opinion. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "This game was amazing. It has been a long time since a game has captured my attention and imagination like this did. It was so powerful that it even convinced me that i need to write a REVIEW on it. The Swapper puts you through a story that makes you think in forms of puzzles and games, while also leading you through a story of deep moral questions and infrences. I strongly recommend this game to anyone who is searching for a good story while also being tested mentally.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good puzzle platformer. Keeps introducing tiny changes as you go on so its main mechanic doesn't get stale. Took me about four hours to beat; worth looking at if you're into puzzle platforming games. A word of advice that you need to complete all the puzzles to finish the game, so while you can leave areas and come back to them later I suggest you try and do them in the order you come across them and stick with them no matter how stumped you are.",
            "review_score": "1"
        },
        {
            "review_text": "This game very well may be my favorite game of all time. It combines the very clever puzzles of Portal 2, the very deep story line of Deus Ex: Human Revolution, and the beautiful setting of space from Gravity (You didn't think I would include a movie reference here, did you?) I finished the Swapper in a matter of about 6 hours, and the ending gave me the same feeling as finishing Deus Ex. I thought on its meaning for days. The Swapper means to make you think about the difference between the mind and the brain, and how far would you go to survive. I was deeply inspired, and I think anyone who appreciates art in any respect will be too. The Swapper exemplifies how a tiny 4-person indie developer can create a work of art that knocks any triple-A game out of the water. I absolutely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Puzzle platforming at its best. Challenging, atmospheric, and hypnotic.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best puzzle games I've ever played, presented with a great sci-fi atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "Very unique animation and a nice atmosphere. A good little puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent experience. Wonderfully dark environment with an interesting story. The in-game puzzles were very challenging. Ultimately, a great game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really cool puzzle game where you can create clones of yourself that copy all your movements. You can also switch which clone you're controlling. It's a really neat mechanic that leads to really interesting puzzles. Definitely worth checking out. It's a really short game, though, so maybe wait for a sale",
            "review_score": "1"
        },
        {
            "review_text": "When I first witnessed the trailer for this game immediately I put it on my wishlist. And needless to say as soon as I got it I was not disapointed. The game's story is an aura of a creepy 'what the hell happened here' isolation that you're character plays.  When I diverged into its atmospheric gameplay I found the controls very smooth feeling for the type of game that this is, the way this game works is as if the Portal games and old school Metroid bumped into each other.  You're dependant on using a weapon that clones your character but they also follow your exact same movements. I like that you can switch between each clone and that you have to solve a puzzle with the number of clones you're allowed to display and work with each puzzle that hinders at least one thing towards your success.  The sound and once in a while music fits with the complete feeling of isolation, fear and comfort all at the same time. The storyline is very driving, it almost confuses you but makes you feel like you're aware of what's going on and that several times you feel a sense of danger but safe space which is surprising for a game to accomplish.  I practically have nothing bad to say about this game, I'd highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, well done on the idea",
            "review_score": "1"
        },
        {
            "review_text": "Its suprisingly addictive, the puzzles are fun yet sometimes difficult. Won't say much about how it ends, but yeah. Its all up to you, pick your poison so to speak!  Only downside is that Beating the Entire game doesnt give you a single Achievement!?! That was a little bit of a let down. Apparently you need to do special things during the game to unlock the Achievements.",
            "review_score": "1"
        },
        {
            "review_text": "An amazing game. Great story, great soundtrack and voice overs, fantastic atmosphere and some quite challenging puzzles. For all I care it was worth every cent. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I came upon The Swapper in a Humble Bundle, and decided to play it first of the many games I recieved. This was a good decision. The game throws you into a practically abadon space station setting a tone of isolation and moody darkness. As you solve your way through this creative platformer, you begin to realize more and more about what happened, solving the curious situation that had occured. The themes and feelings the game potrays are some of the best I have played in a game, with a soundtrack that is second to very few others. By the end of the game hopefully having sidetracked your main mission more than a few times to discover journal logs and 'talking' rocks, you put the final pieces together and realize the controversy that exists in the game, and now will challenge you to reflect on the theme of a soul and being and individual human.  I would give The Swapper a 9.5/ 10 and HIGHLY recommend sitting down and immersing youself in a fantastic experience.",
            "review_score": "1"
        },
        {
            "review_text": "I really liked the gameplay mechanic in this. I'm also a huge fan of puzzle games that don't use time as a component of the puzzle (as in, the only reason a puzzle is hard is because you have to do it quickly). The story does impart a sense of urgency, but there isn't an actual clock you are fighting. Speaking of the story, it was pretty solid. I was really enjoying it right up until the end. I'm not going to go into why, since it requires spoilers, but I was just left very dissatisfied by the ending. The game overall, however, is very worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't just another platform puzzler! The atmosphere is wonderfully dark and good story that makes you want to discover more. The core mechanic of Swapper, making clones and swapping your conscience into them, and works well. The puzzles are interesting, some quite cleaver, and at least one will definitely have most flummoxed for a while.",
            "review_score": "1"
        },
        {
            "review_text": "A great engaging game. Kept me right to the end. ",
            "review_score": "1"
        },
        {
            "review_text": "10 / 10. Brilliant. Immersion and story score in this game is through the roof. Some puzzles do actually require out-of-the-box thinking.",
            "review_score": "1"
        },
        {
            "review_text": "Not incredibly far in but loving the ambiance and game mechanics. Art design is solid and engrossing, as is the audio. So far so good - it's a sci-fi Braid for me so far. Will update.",
            "review_score": "1"
        },
        {
            "review_text": "Worth the money! This game has this otherwordly Star Trek like feel and an ambience that is difficult to describe! The artwork is great! 9/10 in my book!",
            "review_score": "1"
        },
        {
            "review_text": "A great little puzzle platformer, with a surprisingly deep message.  It is not every day you hear a game talk about the 'great chain of being', or dealing with very profound spiritual ideas and eastern and western philosophy. If you have any of those interests, you'll probably catch them here and there in this game. I think it is brave to snuck it in a game, where probably most will never catch these ideas though. But, there is no coincidence that the 'big face' looks like a certain 'eastern religious' figure. And the 'dialog' found in this game has loads of philosophy/spirituality. I also noted hints, pointing out how futile culture-wars really are, and that the arguement of 'matter versus spirit' ultimately misses the point; none replaces the other, but they complete each other. I very much agree, how refreshing!  But if you have absolutely no idea of what I am talking about, don't worry. You don't have to know any of these things to enjoy this excellent game. In a way, I think those ideas are the point of the game, but they are still sneaky enough that you might never care about it and just enjoy the game, which is totally fine. And you might still find the story and the questions intriguing. Even the game mechanics should make you ask some interesting questions. And of course I think this game can be rightly interpreted in many ways, which is even greater in my mind.  A really intelligent game, whith at some times very difficult puzzles, although the overall experience is not too difficult.",
            "review_score": "1"
        },
        {
            "review_text": "Great story and really Brain bending puzzles. If you are into Portal and Psychological thrillers pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "Very nice graphics, mind bending format. Sort of a slower Portal in 2D, but not with Portals. Atmospheric. Basically, 'Good job'!",
            "review_score": "1"
        },
        {
            "review_text": "Atmosphere is one thing I value the most in games, and this game definitely has it. The creepy, gorgeous, and mysterious setting meshes perfectly with the sound effects and ambient sountrack.  While it did seem a bit short, I did not enjoy it any less. The puzzles provided a decent challenge, and the primary game mechanic molds right into the storyline which in itself is interesting and thought-provoking. If you liked Portal, you'll like this.",
            "review_score": "1"
        },
        {
            "review_text": "Hey a science fiction story that takes 3 seconds to get interesting! I wish I could show this to that fool at my writing class who said good scifi is only good 100 pages in.  Fun well utilized gameplay mechanic - check story that asks quick simple questions that make you uneasy - check info delivered in unobtrusive audio playback you can listen to while you solve puzzles - check a creepy climax that leads to a cataclysmic horror show - you can't win them all  Oh! it looks nice too I guess...",
            "review_score": "1"
        },
        {
            "review_text": "Exc game play! Nice graphics. It was so good, I started playing and did not put the game down until I finish it.",
            "review_score": "1"
        },
        {
            "review_text": "Swapper is a nice puzzle game that will keep you busy for several hours. The main story is done quite well. The only thing is the philosphical musing fall sadly flat on their face. Which is mostly because of lack of consitency and also too many leaps in logic. I will not go into details as it would ruin the plot. But if you really want to know or maybe finished the game, you can always shoot me a message and I will explain it more in depth.  The music on the other hand is excelent, it fits the setting of an abadoned space station that needs exploring very well. And the graphics are indeed very much candy to eye.   So all in all its a nice package, with just one point that is off. So I suggest when its sale you should buy it.",
            "review_score": "1"
        },
        {
            "review_text": "really clever little game.",
            "review_score": "1"
        },
        {
            "review_text": "A great puzzle game with a really nice atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game. Some puzzles are pretty challenging (for me).",
            "review_score": "1"
        },
        {
            "review_text": "Great game, really fun whilst being really simple. The puzzles are challenging, but not frustratingly so, the asthetics are excellent and seemless and the concept is very interesting and fun. The story could be somewhat better, but it is thought provoking nontheless.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game!",
            "review_score": "1"
        },
        {
            "review_text": "this is the recommend.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is a puzzle game based in the future where a space mining operation has gone bad. The graphics are quite nice and the audio was done very well.",
            "review_score": "1"
        },
        {
            "review_text": "Soooo fun! I love this game so much, puzzles for days~",
            "review_score": "1"
        },
        {
            "review_text": "Very unique animation and a nice atmosphere. A good little puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "If you like the atmosphere of Alien, the mystery of The Sphere and the puzzles of Braid, get this game.",
            "review_score": "1"
        },
        {
            "review_text": "If you wanna be amazed, pls BUY IT. Never had so much fun in my life. 11/10 would re-buy",
            "review_score": "1"
        },
        {
            "review_text": "This was a very atmospheric puzzle game that kept me awake until 5am. I really enjoyed the concept and the philosophical story behind it. The graphic effects fit in perfectly and are not distracting as in many other games. The music (atmos) is top notch.  Some of the puzzles are *very* hard (three of them took me a long time)...",
            "review_score": "1"
        },
        {
            "review_text": "A fantastic game with superb puzzles. The best puzzle games have simple mechanics, but from them come deep complex puzzles which just require thought, and that's what this has. It's beautiful too, which helps.",
            "review_score": "1"
        },
        {
            "review_text": "Really nice puzzle game with a 'story' that makes you think.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, calming, excellent in so many ways",
            "review_score": "1"
        },
        {
            "review_text": "Excellent Puzzle game. Looks like a platformer but I wouldn't really consider it one as the jumping isn't difficult. It is a unique concept with some devious puzzles that is definitely worth playing.",
            "review_score": "1"
        },
        {
            "review_text": "The game has great puzzles, an interesting story, and a unique art style. It's pretty great.",
            "review_score": "1"
        },
        {
            "review_text": "The atmosphere is on par with the best games I've played and it has a surprisingly good story. The only downside is it only took about 5 hrs to beat. Still, for the price it was well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Totally awesome puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "I wish there was a 'Yes, Maybe... kinda?' button.  This game just didn't resonate with me. The puzzles were either crafty or headbanginly hard. The beginning made you feel smart as you progressed as it taught you different mechanics (Or how to think with 'Portals', i.e. clones). However the contrivence of the puzzles does not fit with the story in any fashion like a Portal or other 'puzzles 'n stories' titles.   I didn't care much for the story. I'm usually 'brain off, along for the ride,' but either due to writing, pacing, or presentation of the story, I had called 'it' within an hour and the ending wasn't deep or thought provoking. I was hoping for a lot with many folks hyping this title, but it falls way short of that notion for me.  The puzzling starts off strong and then lags hard in the center, the aesthetic is great, but the story doesn't really hit any real highs; I never had a full body feeling like Gone Home, Last of Us, or Bioshock Infinite. It never resonated on that level as other folks would say.   It's a solid buy for $5, but I wouldn't pay much more then that at a length of 5 hours.",
            "review_score": "1"
        },
        {
            "review_text": "This is a cool and atmosheric indie sci-fi puzzle game with an interesting storyline. One of those games which contain real substance to think about. I wish I could buy the spacey ambient soundtrack to this game. It's awesome.",
            "review_score": "1"
        },
        {
            "review_text": " Absolutely lovely. Manages a dark spacey atmosphere without resorting to horror. The puzzles are fun and make you feel clever. ",
            "review_score": "1"
        },
        {
            "review_text": "Excellent puzzle solver. Great atmosphere. Story was OK, but was delivered very well. Definetly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Great science fiction!",
            "review_score": "1"
        },
        {
            "review_text": "I cannot emphasize how much fun I am having with this game. I love the graphics and the haunting music that floats through the rooms in the game. The puzzles are very fun to figure out and while you may have to try them several times to figure them out or get the timing right, this game never becomes frustrating. I am not sure if its worth the sticker price since I don't know how long the game is, but if its on sale in the future you should definitely get this game. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "This game is sick as all hell! 11 bucks right now hell yes buy this game",
            "review_score": "1"
        },
        {
            "review_text": "I approve! Nice puzzle game, also makes you think a little (In what does it all mean kind of way)  Basically its a game where you use your clones to solve puzzles, the 'enemies' are switches, light where you can't clone, light where you can't swap, light where you can't wither, Boxes, and gravity.. I can't say anymore for not ruining it.  Downsize is that when you finish the game you cant go back you have to finish the al game all over (2 ending) I tried a third where SPOILER SPOILER SPOILER I tried to kill both didn't work SPOILER SPOILER",
            "review_score": "1"
        },
        {
            "review_text": "Outstanding wee game. Reminds me a lot of Vessel, in the sense that the game revolves around a really clever and novel set of mechanics that a bunch of interesting and challenging puzzles are then built on. Whereas Vessel was cartoonishly cute, this feels more like a non-violent Dead Space environment instead, and the graphics, audio, pacing etc do an outstanding job of setting the scene.",
            "review_score": "1"
        },
        {
            "review_text": "amazing, unique puzzle game. amazing graphics and awesome environments.",
            "review_score": "1"
        },
        {
            "review_text": "I think this game changed my life.",
            "review_score": "1"
        },
        {
            "review_text": "Greate games, fun puzzles, and not too long of a game. I beat it around 3 hours, and loved every minute of it.",
            "review_score": "1"
        },
        {
            "review_text": "Bought the game. Seems great. But i'm going to hold off on playing until controller support is released.",
            "review_score": "1"
        },
        {
            "review_text": "If you wanna be amazed, pls BUY IT. Never had so much fun in my life. 11/10 would re-buy",
            "review_score": "1"
        },
        {
            "review_text": "The game has great puzzles, an interesting story, and a unique art style. It's pretty great.",
            "review_score": "1"
        },
        {
            "review_text": "Best Game I have played in years, highly addictive and artwork, and story all amazing. 10/10  p.s use some good quality headphones and read the logs, brings the story together.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is a fantastic game with a good story. The story has a very deep meaning that can be read in multiple ways, more games should have stories like The Swapper. The puzlles are great and you feel awsome when you complete one of the harder ones.",
            "review_score": "1"
        },
        {
            "review_text": "Really cool atmosphere and pretty good puzzles",
            "review_score": "1"
        },
        {
            "review_text": "A challenging puzzle platformer with a great backstory. The visual style is awesome, and whether you're on the middle of the space station or on the outskirts, the picture is blurrier due to static. The mechanics for solving puzzles are intuitive and the controls are responsive. It's a good, solid 5-6 hours of gameplay and I really recommend it.  7/10 - the puzzle-elements are awesome, and the platform action too. The puzzles are sometimes too easy though, and some really cool gameplay mechanics are added too late in game.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is a fantastic puzzler with an eerie and thought provoking atmosphere. The art style uniquely resembles claymation which gives it a homemade yet alien appearance. The sounds and music are topnotch and compliment the atmosphere quite nicely. Aside from all the visual and audial queues that make up the chilling atmosphere, the difficult and brilliant puzzles define the gameplay. Overall, one of my alltime favourite purchases on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "This game's story will leave you stunned and the depth of its simple mechanics will harm the most important parts of your brain. There are few games of this calibur.",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is a magnificent game. It's like the originality of Portal mixed with the athmosphere of Dead Space and gameplay of Metroid. I would recommend this game for everyone, and it isn't even expensive!",
            "review_score": "1"
        },
        {
            "review_text": "Fun puzzle game with an interesting mechanic",
            "review_score": "1"
        },
        {
            "review_text": "The swapper is absolutely beautiful in every aspect. It works as a fun quirky puzzle game as well as a deeply philosophical story driven experience. The levels are atmospheric and creepy, but the art style is so beautiful it's just begging to be explored.",
            "review_score": "1"
        },
        {
            "review_text": "This game is beautiful, and you should buy it. I saw one review that compared this game to Braid by way of 2001, and I think that's spot-on. The puzzles are interesting but rarely aggravating, and the visuals, sound, and overall mood are really well-done.",
            "review_score": "1"
        },
        {
            "review_text": "A great indie title, where the puzzling elements don't interfere with the story. The visuals and atmosphere of the game are break-taking and the difficulty of the puzzles does increase. I personally found it replayable, since the game has 2 endings. After finishing the game it made me reflect on the themes and story, which I believe to be a good thing.",
            "review_score": "1"
        },
        {
            "review_text": "A Flawless Experience.  This game has a mesmerizing atmosphere and a unique gameplay hook. The visuals will draw you in to the mystery of this huge derelict ship, deep in space. And I have never seen such perfectly-executed puzzles: they draw you in and then gradually ramp up the difficulty so that every challenge feels like a new triumph. And the psychological tone of the story fits the gameplay gimmick to a tee. To top if off, it's worth playing on max settings even on a struggling ultrabook because the visuals are sublime and the gameplay is somehow completely tolerant of low frame rates.  I cannot recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "A highly atmospheric game, best served with dimmed lights, headphones and minimum distractions. A very positive surprise.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. The simplicity of it's nature, the story, the graphics, and the difficulty of the puzzles.  Typically, I am really great at puzzle games. I flew threw Portal 2, and just before it could actually get decently challenging it ended. Not with this game. The Swapper starts to get really hard before you're even half way through. Which is fantastic for a puzzle platformer. I've gotten to the point to where it's taking me 5-15~ minutes to finish a puzzle. Tons of trial and error, and I love it.  This game WILL rattle your brain around, making you think 'How am I supposed to solve this?!?,' 'Am I supposed to be here right now?!,' and even 'It's IMPOSSIBLE!!' only to find the solution from screwing around a few minutes later.  I highly recommend this game to anyone who likes puzzle games. It will actually give you a challenge.",
            "review_score": "1"
        },
        {
            "review_text": "An incredible, immersive and challenging puzzle game that makes you question just how far you'd go to save yourself over others.  The musical score is one of the best I've heard in a game, not too overpowering and timed to perfection, It enhances the entire experience.",
            "review_score": "1"
        },
        {
            "review_text": "Very cool platformer / puzzle game. Feels roughly like a mix of Braid, Portal, and Limbo, and unique beyond that even. A bit of 'Flatland' type of psychology keeps the story interesting.",
            "review_score": "1"
        },
        {
            "review_text": "Strike me to the ground.PA!!!!!!!!!!!!PA!!!!!!!!!PA!!!!!!!!!!!PA!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Exc game play! Nice graphics. It was so good, I started playing and did not put the game down until I finish it.",
            "review_score": "1"
        },
        {
            "review_text": "Good if you like ♥♥♥♥ing with your own brain 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Gorgeous visuals, a really impressive 2D platformer. Nothing groundbreaking in the way of puzzles (which make up the entirety of this game, as there is no combat) but an engaging story with simplistically elegant mechanics that make for a great gameplay experience.",
            "review_score": "1"
        },
        {
            "review_text": "At last! A 2013 game that really impresses. I don't doubt that this will end up being one of my favourite titles of the year.   The setting and primary gameplay mechanic work so amazingly well together. Love the story, but the puzzles are truly where it's at. Approachable puzzles, only once did I feel like I had no clue how to get through a section. I wish there were a few more brain benders throughout - or some ability to add user puzzles would be amazing.  Regardless of this, this game comes highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Sublime, puzzle platformer. Nice Sci-Fi story element, haunting soundtrack, lovely artwork and well designed puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "An incredibly interesting puzzle platformer. The story is vivid and deep, though maybe it tries too hard at times. I found the feel of the game reminded me Portal, however the gameplay itself was different in almost every way. Lots of fun, and at times rather challenging. Well worth the time and quite rewarding to complete.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS AMAZING!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "this is embarrassing. i'm super dumb... thanks to The Swapper...  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Atmospheric, thought-provoking puzzle game with some proper tricky puzzles  No cake, but you can't have everything.  ",
            "review_score": "1"
        },
        {
            "review_text": "I generally wait until I finish a game to write any kind of review or tell anybody about it. But it bares noting at this point that I'm completely mesmerized by the puzzles, the game mechanics, and the atmosphere...  Atmosphere  From the get go, the music that plays is light and dramatic. The lights are hazy, and feel just as dangerous as the darkness, revealing more questions than answers. What tidbits I've been fed of the story so far are intriguing and thought provoking. All of this is so rewarding at a time where so many games fail to grab my attention with their environment.  The only thing that really bothers me  is that movement is a binary function, and sometime I wish I could just walk slowly into a room, scan it with my headlamp, and cautiously step forward into the ruins.  Mechanics  The creative uses for the clone gun are posed upon you in such a way that, instead of telling you and holding you buy you hand, once you need them, you'll be forced to figure it out. It's a small task, but so much more rewarding than throwing a few garbage puzzles at you and blatantly telling you how to handle it. Progressing further requires you to finish so many puzzles, but it feels more like you're exploring and collecting necessary supplies to venture further into the unknown, to fufill a task you've no idea how to do, or even what it is. Your character feels blank, and becomes a mystery itself when it's tied to the way you navigate your environment with the clone gun. A moral implication pooling in the back of my mind.  Buy this thing...  This is a game that does a fantastic job of handling that sort of invisible hand of guidance that pulls you in to a story rich, puzzler. As of right now, I'm overwhelmed by that sensation of experiencing something that holds a mystery worth solving. It's a feeling I don't seem to get too much anymore in games that feel like a regurgitated mess of textures and lens flares and quadrillion dollar budgets. I feel like this could exist. It does exist. And I'm going back there now.  Edit: Finished this game. A handful of puzzles really got into my head, but none moreso than the ending. What a beautiful story.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have played in years. Couldn't turn it off until I finished it and still felt like repeating it. Haven't felt like that since I was a teenager.  Also, even though I like science fiction stories ('2001: A Space Odyssey' is one of my favorite movies of all time), I have felt very disapointed, for years now, regarding this genre. However, this game as very much surprised me. It stands as proof that a videogame can convey a meaningful and deep story, as any other medium (if not better).  Could not recommend this game any more. Congratulations to the developer!",
            "review_score": "1"
        },
        {
            "review_text": "This has been a really enjoyable puzzle game. The mechanics are great. The world that it builds is beautiful and errie. Not what i expected at all, very glad I gave it a chance!",
            "review_score": "1"
        },
        {
            "review_text": "An excellent sidescrolling indie puzzler, a must buy for fans of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Atmospheric, thought-provoking puzzle game with some proper tricky puzzles  No cake, but you can't have everything.  ",
            "review_score": "1"
        },
        {
            "review_text": "It's amazing. More than just a gimmicky puzzle platformer.",
            "review_score": "1"
        },
        {
            "review_text": "I wish i hadn't waited so long to play The Swapper. The core mechanics of cloning and platforming make you feel pretty clever as you progress, and the visual style is amazing in a funky claymation-ish kind of way. I really love atmosphere in my games, and this one has it in spades. Definitly worth at east a couple of hours exploring.",
            "review_score": "1"
        },
        {
            "review_text": "This game took me a little over 5 hours to beat. However there were many puzzles that had me stumped especially late game. The grapichs were amazing for a 2.5D platformer. I would highly recomend this game to anyone out there i've personaly purchased 4 copies of the game so i could share this experience with my friends.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome puzzle platformer.",
            "review_score": "1"
        },
        {
            "review_text": "I've played so many games that I'm starting to become jaded, thinking I've played it all. Dishonored is just another Deus Ex. Skyrim is just another Morrowind. GTA5 is just another GTA3. Rock band is Amplitude. But...The Swapper is The Swapper.  I finally installed it from my owned-for-months-but-never-played steam library shelf, and I'm glad I did. The mechanic the developer introduces is very unique, and they continually throw variations of the environment at you to bend your mind in different ways.  That said, your loadout is set from the get go. You don't earn to ability to make more clones or jump higher. Thankfully you don't need that, and knowing that you have everything you need to solve a puzzle makes you face it more confidently. Compare that with some MetroidVanias that have you second guessing if you're tooled enough to solve a problem, backtracking, and ultimately having several puzzles that feel like dead ends. There are no dead ends here, just your mental inflexibility. Keep stretching, and you'll get satisfaction from every puzzle.  On the downside, the achievements are pretty ridiculous. Spoiler, though I doubt anyone will achieve all of them through diligence alone:   They are all hidden consoles, very hidden, that give more storyline. None of the achievements are related to decisions you make or don't make throughout the game, or the number of puzzles you solve. Remember in Wolfenstein 3D when you had to 'open' every single wall texture to see if there are secret stashes behind them? You'd have to do that same approach here to have a chance at finding all the consoles. Back when I was nine years old I had the time or the patience for that crap. Now, I just youtubed them.    To end on a positive, the game is pretty philosophical. You can ignore it if that's not your thing, but if it is, get ready for some serious ethics, and to ponder: what is conciousness?",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is one of the best games i've ever played, it's gorgeous it's thrilling, it's not just a game is an immersion into this piece of art, everytime i played it was mesmerizing, and also so deep, the art, the concept, the history in the game, it's been a long time since a game gave me chils moments...and this game is one of those games,  it's incredible, keep supporting games like this that totally worth every penny keep the good work with these indie games",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is full of puzzles similar to those of the Portal series, with a similar feel to that of Portal 2, with a dying facility (in this case a space station) that you must complete puzzles to get through. It's also got a level of mystery, which reminds me of Lost, and The Stanley Parable. This is definitely a good game to play.",
            "review_score": "1"
        },
        {
            "review_text": "The criticle thinking required to solve some of these puzzles the first time is reminiscent of the first time I equipped the portal gun. The rules are simple, yet; I found myself face-palming a number of times. The atmosphere of Space Station Theseus, if not creepy enough, gives off this Ridley Scott Alien vibe as if you're a member of the fabled Nostromo answering a distress signal in deep space. The music adds to it - very futuristic, a little trippy and ambient. 5/5 Great Game.",
            "review_score": "1"
        },
        {
            "review_text": "Just brilliant",
            "review_score": "1"
        },
        {
            "review_text": "Interesting concept, good puzzles. Polished, good presentation. On the short side, but you can't win them all.",
            "review_score": "1"
        },
        {
            "review_text": "This game was amazing! It's filled with a good amount of puzzles that become decently difficult although never overbearing. It could stand to get more difficult and a bit longer but for following a good story it was a great experience still. I am not a large fan of the ending though.",
            "review_score": "1"
        },
        {
            "review_text": "a game of puzzle, very dark, a remarkable soundtrack. good gameplay.   no great expectations ...   um jogo de quebra cabeça, bem sombrio, uma trilha sonora marcante. boa jogabilidade.  sem grandes espectativas...",
            "review_score": "1"
        },
        {
            "review_text": "The Swapper is a new kind of puzzle / adventure game in a mysterious setting, on a derelict ship. The discovery of alien non-organic sentient stones lead to the creation of the Swapper. A device that can create clones of yourself and switch minds with others.  The game has a beautiful atmosphere and the graphics make it even more immersive. The puzzles become increasingly challenging and if you're into the plot, you will enjoy how the story discusses the concept of existance.  About 4-5 total game hours, absolutely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This is absdolutely the best game to come out since Portal / Portal 2. Taxing on the mind and beautiful atmospheric graphics. Simply awesome... ",
            "review_score": "1"
        },
        {
            "review_text": "It has a unique mechanic that is cleverly used through the game. It also has a very eerie feel to it. Like you're alone on this planet or space station or whatever. Overall a good atmospheric puzzle game.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing atmosphere.",
            "review_score": "1"
        },
        {
            "review_text": "Wait, how have I not reviewed this yet? I think someone jostled my being into forgetting.  This game is splendid. Artistically, musically, narratively, and in terms of design. It's clever and smart and will make you pick your brain to reach its conclusion, a conclusion which is very much worth seeing. However, this also makes it difficult to describe without spoiling the experience much, so I'll try to keep it to the basics.   The game begins with your standard amnesiac trope, but quickly unfurls from this seemingly uninteresting setup as you're ejected from a station to an alien world and make your way back to the station to simply figure out what's going on. As is standard with space stations in games, they're  never  working as intended, but instead of going with common horror fare, this game follows the path of mystery, uncovering what the station was researching, where it was in relation to the rest of civilization, and so on.   As it does so, the game introduces increasingly captivating concepts, both in the narrative and the gameplay, as you have to work out how to manipulate clones synced to your movement to solve a variety of puzzles. To a degree, both may also prove difficult to wrap your head around and work through, but that makes it all the more satisfying when you figure it out (or think you've figured it out) without resorting to a guide or someone else's interpretation.   Go in with ignorance, and devise your satisfaction. =D",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed it! The game took me a few hours to complete, which translates to a few days. Most of the puzzles look complex, but can be solved within a few seconds if you look at it correctly. If you are interested in this game, I highly recommend you try it out. It's a Metroid puzzler, so there are Youtube Speedruns if you'd like to see them",
            "review_score": "1"
        },
        {
            "review_text": "Thumbs up",
            "review_score": "1"
        },
        {
            "review_text": "One of the best indie games I got to play recently.. Awsome job guys :)",
            "review_score": "1"
        },
        {
            "review_text": "Great atmosphere and the puzzles are challenging.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty awesome atmospheric puzzler. This game won't take you long to complete, but the price point is perfect for how much you get out of it. I can definitely recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "This game....is strange, yet fascinating. Imagine being able to create clones of yourself, swapping conciousness with them, and using your former bodies as tools for slaughter? That's what this game is all about. However dark and brooding the game gets with the mysterious sentient rocks you come across and mass suicide puzzles, the game is really hard to put down. If anything, this is the new Braid of recent indie games.",
            "review_score": "1"
        },
        {
            "review_text": "Deep. Insightful. Philosophical debating at its best. This game left me needing more. So many questions left unanswered, but then again do they need answering for them to become something different, or only different in my mind.  Gameplay is unique as you create clones of yourself to move your conscience through the map and solve the puzzles in 2D. Add in lights that only allow certain movements and flipped gravity and it creates a real challenging experience. The steam achievements were a bit frustrating because they didn’t have a description of what was needed from them. Looked it up which I hate doing. Also, I ended up getting lost on the massive map.  All in all, a good game that’s fun to play with an intriguing storyline.  7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Undeniably creepy, beautiful, and well crafted.  The swapping mechanic is great and works really fluid for the early half of the game.  Later on, the puzzles get really fiddly to the point of no longer being enjoyable but just a grind to get pixel-perfect alignment.  Otherwise, a stellar puzzle game and well worth the play.",
            "review_score": "1"
        },
        {
            "review_text": "I always forget to make clones below when I make high jumps; thus, I died lots. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Amazingly clever game, highly recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Decent, but ultimately not particularly good or interesting. Worth buying on sale if you like puzzle platformers.",
            "review_score": "1"
        },
        {
            "review_text": " Short version:",
            "review_score": "1"
        },
        {
            "review_text": "Perfect production quality and atmospheric execution. Unique game mechanics. Worth non-humble sale price. Very happy with this game. Haven't found one thing to critique in it it yet. Still have a ways to go until I finish it though.",
            "review_score": "1"
        },
        {
            "review_text": "Very solid puzzle-adventure game with a good plot and a great mood.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very well done, I love the way the story sort of reveals itself naturally throughout the game, and the puzzles are challenging, and the atmosphere is immersive. I would say 9/10. ",
            "review_score": "1"
        },
        {
            "review_text": "A fun, if a little short, puzzle game with a good difficulty curve and well built sotry featuring an eerie ambiance.  Well worth picking up during a sale.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and mind bending. I spent a lot of time on this thing.",
            "review_score": "1"
        },
        {
            "review_text": "If like me you're getting a bit bored of FPS games and the same old...invest in this. It's fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, great puzzles, and appropriately bewildering story",
            "review_score": "1"
        },
        {
            "review_text": "Awesome, Fun, Epic, Best of The Best, A MUST HAVE!",
            "review_score": "1"
        },
        {
            "review_text": "A really nice-looking, nice-sounding puzzle platformer that touches upon the nature of soul and conciousness.  The Swapper features very difficult puzzles, interesting (albeit at times confusing) story with two different endings, and a beautiful unique art style. Perhaps my only gripe is how disconnected and contrived the puzzles feel in relation to the game's world and the story. This disconnection somewhat ruins the atmosphere, but not enough to stop me from recommending this title.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most interesting indy games I played. I will not spoil the story, but it will make you think about what makes human a human, what is mind. It takes very interesting, sci-fi look at this in a way I do not remember being done before. Obviously the writers were fans of original Solaris movie.  Now to the gameplay - there is enough puzzles, they are fun and fortunatelly not frustratingly hard for players such as me who dont play puzzle games often. Variety is the key here. Game is about 6 hours long and not once have I felt bored.  The art of the game is absolutely mesmerizing and amazing. Soundtrack too.  10/10 - buy it. If you are unsure if to pay full price, just wait for any Steam sale, its about to be there for 50-70 percent discount where its crime not to buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Polished puzzle game. Quite fun. Interesting story, not that I followed it too closely. Would definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Really beautiful aesthetic and fun puzzles, not too hard. Only 2 levels were pretty difficult in my opinion. Very thought provoking message and ending. Would totally recommend!",
            "review_score": "1"
        },
        {
            "review_text": "Dead Space meets Limbo. Beautiful creepy indie game right here.",
            "review_score": "1"
        },
        {
            "review_text": "Nice puzzles. With the Swapper device, you have to solve problems in a very different and unique way unlike in other games. I also loved the overal atmosphere of the game, had that 'isolated in a godforsaken place with not so many people around' feel like in Dead Space.",
            "review_score": "1"
        },
        {
            "review_text": "Very interesting.",
            "review_score": "1"
        },
        {
            "review_text": "That is a frigging amazing puzzle game that delivers the brain into new dimensions. I thank the developers for this challenge. Keep them coming.",
            "review_score": "1"
        },
        {
            "review_text": "The puzzles were fanatstic and the whole concept is really interesting. Ended up playing the whole thing in one sitting. No regrets.",
            "review_score": "1"
        },
        {
            "review_text": "*I would like to point out a really annoying thing, and that is that once you've completed the game, there's no way to go back and collect achievements without starting over from scratch. Particularly this is annoying because I didn't even know there were secret rooms until after I'd finished the game and noticed I hadn't gotten any of the steam achievements.  Good writing, good core gameplay, beautiful environments. However, don't be fooled, you're mostly paying for style not substance here. The game is rather short (5-6 hours) and the puzzles never really rise beyond a medium difficulty--this is no fish fillets 2 of toughness. There was really only a single room that even gave me pause, and that might not be the case for someone else because I felt stupid after I realized I simply had to begin the puzzle from a different location in the room.  Considering the short length, not hard puzzles and the problem I have with how the secret rooms are handled, I'm a bit on the fence, but maybe once in a while shiny packaging wins out for me and this game really is a joy to look at and think about.",
            "review_score": "1"
        },
        {
            "review_text": "Challenging, but not too challenging. Story unravels at a pace that keeps you interested, but still allows time for focusing on the puzzles without feeling the need to rush to find the next plot point. Recommended",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzles and atmosphere",
            "review_score": "1"
        },
        {
            "review_text": "finished the game, got 0/10 achievements  0/10 would not recomenmd",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely beautiful. It is a very short game, took me three hours to beat and I have to play it again. Lets call that a game with 5 hours of play time. But it leaves a memory of a unique, thoughtful and deep experiance. I got it for 5 bucks, was well worth that. BTW the song you hear in game and will want to know is called 'recreation'. It a wonderful song that adds to the experiance which was this game.",
            "review_score": "1"
        },
        {
            "review_text": "I don't remember when I bought this game but good going past me!   Anything I write will really not do the game justice. The mechanics are fun, the story is engaging, and the art and music is beautiful and atmospheric. If you like the trailer and the screenshots, it's worth a purchase.  I'm not sure how many hours I spent playing since my internet crapped up midway and didn't record it properly, but I would say I spent ~10 hours on it. Definitely worth it if on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Dunno if it was intentional but I managed to sequence-break to the end in 10mins. Gonna play it legit all the way through tomorrow tho, good puzzler.",
            "review_score": "1"
        },
        {
            "review_text": "Cool entertaining game. Very original idea. Really enjoyed it!",
            "review_score": "1"
        },
        {
            "review_text": "Before I even begin, I am one beloved fan of THE SWAPPER. I just came back to check to see if the Publisher has a SEQUEL yet? Please, give us a Sequel ... PRETTY PLEASE !!!  [Okay, ya'll can read my review now ...]  This is one of the first Indie games that I have played, because I am new to Steam. However, I was SO IMPRESSED. I didn't really understand the concepts of the duplication and replication when I first started playing the game. Because, I got a little flustered at first, because I had trouble learning to jump just right to get over things. However, after that slightly 'rough beginning', I got hooked and played the games in the evening to the bitter end. And, I was heart-broken when it ended. One of the better, if not best, small company games (i.e., Indie) that I have ever played. I usually play Triple-AAA Titles on the Xbox, but now, this Indie game has opened me to the genre and I will really give smaller publishers so much more of a chance after this game.   VERY GOOD GAME. Don't wait for a sale, just buy it and enjoy. You should really enjoy it!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazing. It's incredibly well made, the story is well told, and the puzzles are of high quality. Definitely worth buying, and worth paying full price for.",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR An enjoyable puzzle platformer that allows you to clone yourself and swap between these clones to complete the puzzle sectons. The story is a bit weak at first but gets better near the end.  Full Version: I really enjoyed the Swapper. Its a puzzle platform game with some interesting mechanics. Early in the game you get a device that allows you to make up to 4 copies of yourself. You do this by pressing a button,which slows down time, and using the cursor to place your clone. You control your character and the clones all at once, so for example moving yourself right also moves the all the clones right. Your other ability is that you can point at one of your clones and 'swap' to it, with you then controlling that clone. All the puzzles revolve around creating clones and swapping between them and it has some really great puzzles.  The story is a bit strange at first with your character arriving on a seemingly abandonded space station but it basically breaks down to a formula of entering rooms with an orbs you have to try and collect.Collect enough orbs and you can open up the next area and it goes like that to the end. This may sound a bit tedious but theres enogh variety in these puzzle rooms to stop it from getting boring.  Good points: -the cloning and swapping are good ideas and are utilized very well in the games various puzzles -the game is very atmospheric with the abandoned space station making for a creepy setting  Bad points: -the story is a bit weak though it does end on a stronger note",
            "review_score": "1"
        },
        {
            "review_text": "Good game. But not again...",
            "review_score": "1"
        },
        {
            "review_text": "I bought the game while it was on sale but it is definately worth the full price.  The Swapper is an example of very atmospheric exploration, tight puzzle design, and great pacing. I didn't really pay attention to the details in the story, though I was able to follow the plot. This isn't a primarily story driven game - it's mechanics take precedent and the puzzles work well on their own.",
            "review_score": "1"
        },
        {
            "review_text": "This game isnt extremely long but hot damn is it worth it. The narrative is interesting (albeit slightly confusing) and the ending left me in shock for a minute. The puzzles are challenging, and the swapper device itself is an interesting concept (you can create clones and swap between them and they follow your exact actions) which made the puzzles even more difficult. The narrative is intriguing and might make you think a little. I got it on sale and while i dont know if you want to sink a full $15 for the game, its definetely a great experience",
            "review_score": "1"
        },
        {
            "review_text": "This was a very good game, beautiful graphics, challenging puzzles. The voice acting are superb, and so is the story. The whole atmosphere of the game is unique. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful game, great puzzles, and appropriately bewildering story",
            "review_score": "1"
        },
        {
            "review_text": "Atmosphere on point.",
            "review_score": "1"
        },
        {
            "review_text": "Not only does it look and sound beautiful, but it has a meaningful story. Easily a new favorite of mine, I definitely recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "Not worth playing, buying, renting, lieing and saying you own it... or anythine else. Stay away.",
            "review_score": "1"
        },
        {
            "review_text": "One of my favorites ever! Challenging and very fun but simple mechanics. Reminds me of portal",
            "review_score": "1"
        },
        {
            "review_text": "First impressions are that it's a very well done puzzle platformer.  -It has lots of Sci-Fi and even Metroid like influences, but no enemies (so far at least). -Basic skills that are fairly easy to learn. -Interesting puzzles -Semi open world -Nice graphics  If you like puzzle games this is a definite, esp if on sale for only $3",
            "review_score": "1"
        },
        {
            "review_text": "First impressions are that it's a very well done puzzle platformer.  -It has lots of Sci-Fi and even Metroid like influences, but no enemies (so far at least). -Basic skills that are fairly easy to learn. -Interesting puzzles -Semi open world -Nice graphics  If you like puzzle games this is a definite, esp if on sale for only $3",
            "review_score": "1"
        },
        {
            "review_text": "Short, but awesome 2D-puzzle game.   The plot circles around the philosophical question of mind and body. This so-called dualism claims, that mind and body are two seperate entities. (This Position is exemplified by Rene Descartes.) To further strenghten the story, the gameplay mechanics allow you to create copies of your body to solve the puzzles.  At the first playthrough the story was good, but at the second one i recognized the crossovers throughout the whole game, leaving me with many dejá vus from the first try.   Overall a very good puzzle game with an extraordinary story, which leaves you in thoughts. To fully enjoy the story, I recommend to play this game at least twice.",
            "review_score": "1"
        },
        {
            "review_text": "Fun game. Had me hooked for a good 5 hours. Got it on special for 3 bucks. Great deal!",
            "review_score": "1"
        },
        {
            "review_text": "I awoke from my nightmare with sweat pouring out of my brow down the barrel of the shotgun crammed in my mouth. I wanted to pull the trigger, but the nightmare began again. Trapped, trapped in a furnace with nowhere to run. It was all I could do to not scream, because I COULD not scream. For Ice cream. I hunted. I looked. I sat down. I found it. There it was. No, it wasn't. I hunted again, there I found the deer... the deer that plagued my lucid life. It was infected with bunny worms and it was not going to take maybe for an answer. Fecal remnants of splatter lined his cornea, and it smelled of memories of my Grandfather. That Grandfather clock that I would use as a toilet when I was 24. Starring Keifer Sutherland.  SCORE: (√-1)/0",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and challenging puzzle game that focuses on a unique style of gameplay. If you have four hours to spend, this is an indie game for you!",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay of The Swapper surrounds a device that your unidentified astronaut carries after having located it at the beginning, roughly, of the game. With this device you can created four clones of yourselfthat mimic your movements. Move left and the clones moves left; jump and the clones jump. The trick, then, is generally one of placement of the clones to achieve your goals (generally accessing orbs to unlock new areas): place a clone too close to a ledge and it could plummet to its doom or become stuck, or end up completely useless as you move your astronaut and each clone mimics those movements. The player can also 'swap' with the clones (thus 'Swapper' device), thus changing which astronaut that you are directly controlling, into one of the other clones. Pressing buttons or moving boxes at the right moment to achieve the goal of each room is dependant upon careful positioning to allow each clone to peform the task that is required of it.  The joy of the puzzles is that all of the positioning and swapping pays off in such a way that there is an immediate satisfaction in having put all of the pieces into place. The moment of recognizing a solution, and make no mistake here that it is RECONIZING the solution as dumb luck will almost never occur, came very close to making me yell 'A-ha!' on at least a couple of occasions. The challenge of these rooms increases at a steady pace, with the initial sections being fairly simple affairs and the later rooms significantly more difficult. They are never impossible; but neither does there seem to have been the slightest thought put toward holding the player's hand. The developers seemed to work with the idea that once the basics were taught in the earlier, more simple rooms that the player should have all that he/she requires to play through the rest of the game. This was refreshing: here was a game that expected that players were, at some level, capable of learning the fundamentals and from their own mistakes.  What I rarely expect out of a puzzle game is a story. In those times where stories do exist in the puzzle genre they have a tendency to have the simplicity of Super Mario Bros. This is not a fault: it's just not common to the genre, so I do not go in with any expectations. The most that I expected here was 'Here's your astronaut. He has a cloning device. Now go.' It is the story of an unidentified astronaut (the player's character) who is unceremoniously ejected out of an airlock in the opening cinematic of the game. This character is progressing through the base that he/she eventually finds his/her way back to (I'm not spoiling anything here: 99% of the game takes place on this base. The planetary portion serves only as a tutorial) in an effort to find out what happened, and how to get off of the base given the apparent lack of usable ships (and the planet below is hardly habitable by all indications). This is very much an abbreviated version of the basics: there is more to the story, but it's best to experience that without it being entirely spelled out and spoiled. The Swapper's story has a heavy ethical bend; and while the main points of ethics and morality are not particularly subtle within the context of the experience, what I was surprised by was the specifics of the story were largely left up to the player to figure out. Writing in games (and other mediums, but we are discussing a computer game) tend to leave little room for interpretation or show much faith in the player to grasp what is going on without very specifically telling them what is happening from one moment to the next and why. Exceptions are rare, and I was pleasantly surprised to find that The Swapper was one of those exceptions. The developers showed a lot of faith in the players to be able to piece together what is happening and why, the specifics of who the astronaut is, the nature of the base, what the Head Watcher is and what it does, without ever DIRECTLY stating it. This leaves some room for interpretation, of course, and while that is always fun to some degree I was most pleased that I wasn't being treated like a fool who cannot even tie his own shoes without specific instruction. The only downside to the story, and this is somewhat subjective as it did not bother me at all, but I could see it bothering some, is that the player has to go looking for it to some degree. There are terminals as asteroids that provide the details, as well as some sequences that are played out with characters and communications. The terminals and asteroids have to be sought out, and new asteroids tend to crop up after certain points in the game forcing the player to look over the map screen at previously visited areas to see if something new has popped up. Again, this did not bother me; but seeking these points to provide the full story could be a bother to some.  On audio there is little to say. This is not a criticism; it is only fact. The game consists primarily of isolation in a seemingly deserted base in outer space. Little in the way of life, little in the way of functioning equipment. In that context there should not be a lot of obvious sound effects, and those that do exist are effective. The music is good in that it is well suited to background noise. What little voice acting exists is effective; and while ‘effective’ is often used as a synonym for ‘not great’ it is very fitting here given the environment that is presented.  The visuals have a refreshing look to them, in spite of the gloom and isolation. Most games' visuals are clearly identifiable as digital works: they look like they were developed inside of a computer. At their most realistic there are still obvious giveaways; and even when cel shading takes place to resemble hand-drawn animation it is still clear that this is simply a style that is being used by those who are sitting at their computers crafting the details. The Swapper's environments and characters were created by hand using various crafting materials, and what would seem to be primarily clay-based. I say 'seem to be' on account of my having done admittedly little research into the exact details of its craftsmanship; but what I did read mentioned clay specifically each time, and then glossed over any other materials which I could only imagine were used as little more than accents or as a means to hold things together. While hand crafting does not immediately translate into something that is somehow superior by its nature (saying so would be silly) it does give The Swapper a unique appearance when help up to other games. What was crafted was well made, with the environments being appropriately details for the most part. A few of the rooms looked somewhat barren; and while this may be realistic it was jarring when compared to so many of the other rooms and sets that were utilized. Much was dark of course given the semi-functional and abandoned nature of the station upon which the game takes place; but even those darker areas still had some details that emphasized a level of care. It looked mostly great, and served to convey the haunting mood and accentuate the story in a 'something has happened here' sort of way.  It isn't often that a game surprises me. I am not speaking here of twists in the narrative or scares, but rather the fundamental style and make up of the experience. This was The Swapper's greatest strength for me. I enjoy a good puzzler, and the atmosphere and music was seemingly strong. It all felt like a package that I was confident that I would enjoy. I'm extremely pleased that I took the chance: so much of the game simply clicked on multiple levels for me: in the satisfaction of the gameplay (which is crucial since this is a game, after all), and in the atmosphere and story. The game may not go down as the finest ever made, but it is one of the most satisfying experiences that I have encountered in years.",
            "review_score": "1"
        },
        {
            "review_text": "This is more of a puzzle game than a platformer and it's a surprisingly good one. Once you understand the mechanics you find yourself discovering some pretty satisfying solutions. It's challenging but rewarding. It's also not a very long game but sometimes, as in this case, that's a good thing. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing video games for 30 years, and rarely if ever has a game managed to make me think about its message through its mechanics alone. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "A fun puzzler with great atmosphere. You create clones and can switch between them using a 'swap' gun.",
            "review_score": "1"
        },
        {
            "review_text": "Great puzzle game, great game mechanics and controls.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, hard puzzles and good story.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting story, challenging puzzle",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great puzzle game! The core mechanic is that your character can create four other clones and swap conciousness between the clones. The game explores this mechanic through numerous puzzles and ties it into the story in a meaningful way. There are a bunch of good puzzles and some truly great ones when you figure out a new aspect of the swapping mechanic you hadn't thought about before. Good atmosphere and interesting plot as well. Highly reccomned!",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Fun and challenging gameplay. Interesting philosophical points are made.  Cons: Ignores a number of important issues brought up by the aforementioned philosophical points (and how they relate, or rather, are completely invalidated by, the gameplay). One of the choices thrown in at the end is poorly explained, resulting in quite a different outcome than expected, and there is no way to view the other ending without replaying the *entire game* all over again. Railroads the player in order for the writer(s) to display their 'deep' philosophy and ending choices, instead of allowing for sensible alternatives.  Conclusion: If you like challenging puzzle games, and don't care about the story, it's relatively good. Personally however, any game that puts this much emphasis on the story, and executes it so poorly, is a game I can't enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "I played for 90 minutes and got to a point where I could not physically move+click+right-click fast enough to do the challenge (Mac trackpad). I thought I was buying a puzzle game, not an arcade game. This is a show-stopper for me.",
            "review_score": "-1"
        },
        {
            "review_text": "realy bad",
            "review_score": "-1"
        },
        {
            "review_text": "The gimmick is great and very well-realized, but... creating clones to get the first few orbs is entertaining, getting another dozen is tolerable, and then it becomes such a damned drag as you solve variations of the same exact ♥♥♥♥♥♥♥ puzzle again, and again, and again, and again and AGAIN and again and agaaaaain ad nauseam.  Production-wise, it's uneven. Graphics are pretty, but sometimes bloom's so intense that it's hard to see what's happening. Music is generic melancholic piano tunes that take away from the atmosphere because of how terribly trite they are. Story is decent, but writing is questionable, often purple, with aliens speaking like tumblr webcomic characters, which conflicts with the extra-srs tone. Voice acting is nice.",
            "review_score": "-1"
        },
        {
            "review_text": "I really want to play this game, it looks really awesome. The only problem is that me and some other people are not able to get past the first minute of the game due to a glitch that no one has reported the fix to. We've tried deleting the appcache and restarting and all that, nothing works.  What happens is when you're first prompted to make a clone, there is no space on the screen that allows clone-spawning. If you click Start it spawns a clone after you resume the game, but you're stuck in slo-motion forever, and can't leave the room. I want to give this a good rating, but the fact that it's unplayable for me and several others makes it impossible to do so. Please fix this problem, powers that be. XD",
            "review_score": "-1"
        },
        {
            "review_text": "The design is very beautiful and I enjoyed looking at it quite a bit. The story asks some deep, challenging questions which it kinda fails to answer. The gameplay I didn't like. At first I was reminded of portal. But it got boring quite quickly. The challenges don't have this feeling of excitement to them. There is no reward. I ultimately don't feel, like I was getting anything out of the game.",
            "review_score": "-1"
        },
        {
            "review_text": "PROS:  + Nice visuals (Alien meets The Neverhood) + Interesting gameplay (Portal meets Braid)  CONS:   - Confusing, minimalistic story - Can be beaten in about five hours - Repetitive gameplay - Not much replayability",
            "review_score": "-1"
        },
        {
            "review_text": "An immediate perspective.  My response to the intro of this game: 'Oh god its going to be one of those artsy fartsy ♥♥♥♥ing video games isn't it?'  *Five minutes later*  'OH ♥♥♥♥ IT IS! ABORT!! ABORT!!'",
            "review_score": "-1"
        },
        {
            "review_text": "The same puzzle over and over again with the same lighting effects smeared all over every level. Sounded fun enough, oh well",
            "review_score": "-1"
        }
    ]
}