{
    "app_id": 231200,
    "name": "Kentucky Route Zero",
    "release_date": "2013-02-22",
    "developer": [
        "Cardboard Computer"
    ],
    "publisher": [
        "Cardboard Computer"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Full controller support"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Adventure",
        "Atmospheric",
        "Point & Click"
    ],
    "achievements": 0,
    "positive_ratings": 1506,
    "negative_ratings": 310,
    "price": 18.99,
    "description": "Kentucky Route Zero is a magical realist adventure game about a secret highway in the caves beneath Kentucky, and the mysterious folks who travel it.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/231200/header.jpg?t=1478023317",
    "minimum_requirements": "OS:Windows 7 Processor:1 GHz Memory:512 MB RAM Graphics:Directx 9.0c compatible video card DirectX®:9.0c Hard Drive:250 MB HD space Sound:Sound card",
    "recommended_requirements": "OS:Windows 7 Processor:1 GHz Memory:1 GB RAM Graphics:Directx 9.0c compatible video card DirectX®:9.0c Hard Drive:250 MB HD space Sound:Sound card",
    "reviews": [
        {
            "review_text": "I never played many point and click games so I wasn't sure what to expect going in, but I really enjoyed my time with Kentucky Route Zero. Its strange and puzzling story/atmosphere will certainly bring in fans of David Lynch and surreal story lovers.  Soak in the world, the characters and the music. Don't speed your way through.  And While all the acts aren't out yet, I only have positive feelings towards the devs. They are taking their time to make it the best they can!",
            "review_score": "1"
        },
        {
            "review_text": "I agree with what most people say: The game has a cool art style, interesting story, and music. I do like the game but I can't recommend it in its current state especially for a $25 price tag. I bought it half price but even at that you've got a game that is only 2 hours long and add the price to the fact that it has been out for nearly a year with only 2 hours released I would caution anyone interested to wishlist this game and wait for both a final product, all five episodes, and a good sale, something more enticing than half off. That being said, I'm looking at it from a 'bang for your buck' point of view and in my opinion, the game isn't good enough to outweigh how short it is right now.",
            "review_score": "-1"
        },
        {
            "review_text": "Kentucky Route Zero can be charming and relaxing on one part of the road, then creepy and surreal on the next. It's obviously influenced by Lynch, but it's a lighter version of his surrealism, never completely succumbing to darkness. Heck, you might even get some bluegrass songs to lighten the mood. The visuals are incredible, with some truly great panning shots and camera work. For this aspect alone I feel obliged to replay this someday.  This is a story-driven game that gives you choices in conversations, but luckily without a big 'this game adapts to the choices you make'-stamp. Choose, but don't worry about the consequences. Just react however you feel like, without the risk of unwanted results.  There are only two episodes available now (out of five), but these alone are more than worth your time. I urge you all to take a drive and look out for the Zero.",
            "review_score": "1"
        },
        {
            "review_text": "Deliciously strange and beautiful game. For those who likes to collect unusual sensations. This story has reached my heart.",
            "review_score": "1"
        },
        {
            "review_text": "This isn't a game its a work of art.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not completely sure that I have the vocabulary or facility of language required to adequately describe or recommend this game appropriately. On the one hand, it's an adventure game with no puzzles. On the other, it's a restrained, mature, strange, and utterly wonderful work of fiction that despite all appearances takes interactivity very seriously. It's as much a work of sculpture as it is game design, as much a night-time day-dream of appalachia as it is a ghost story. I've never played anything like it. What a phenomenal human creation.",
            "review_score": "1"
        },
        {
            "review_text": " Nominated for the 'Whoooaaaaaaa, dude!' award  for being one of the few games where words fail me to describe. KR0 is breathtaking, intrinsic, philosophical, meaningful, deep, disturbing, contemplative, artistic and a bunch of other majestic things.  Don't listen to the naysayers;  Kentucky is boring only to those who can perceive a single shade of entertainment, and unrecommended due to its spaced releases solely by those who insist that time = money .  Step away from being a synecdoche tapered into your pockets, and come enjoy a view that only KR0 has ever had words enough to brilliantly provide and creativity enough to so eloquently present.",
            "review_score": "1"
        },
        {
            "review_text": "*SPOILER-FREE*I can't recommend this game enough. I planned on sleeping last night, but I decided I would start up act 2 last night and play through until I finished 3. I ended up totally engrossed in the story of the Zero, on the edge of my seat, envoloped in mystery until the big hours of the morning. Needless to say, I liked it.  Basic info: No puzzles, mouse only interaction. That means you can play this on your laptop, in your bed, upside down.  Basic story: You're a delivery truck driver, Conway, and this is your last delivery. Ever. But you can't quite figure out the address...  Now for the gameplay: what's that like? First of all, there is only one kind of puzzle in the game, and that's at the very beginning. This game doesn't try to be a puzzle game, at least not in the traditional sense. You'll never have to go find that one stupid piece of whatever to fit into the ambiguos slot to progress. Most of your time will be spent reading the humanlike interactions you have with everything around you and the stories they tell you and the stories you tell them.   The dialogue and descriptions are all meaningful in the most insignificant way. Your choices don't matter, but at the same time, they are what make up the game. Your choices are what make Conway, his/your companions, and the world of Kentucky Route Zero something uniquely yours. There are no wrong paths in this game, and as soon as you realize that, you can invest into your conversation decisions that sculpt the worldviews of the cast of characters and their perception of Conway, as well as yourself.  By the end of this masterful ordeal, you're playing Conway as much as you're playing yourself. People will make comments about Conway that resonate within your psyche because you made Conway who he is, so they're really talking about you. Or maybe they're not.  The beautify of this game is left to your own interpretation of the events. So please, don't watch a let's play of this game. Play it for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Tried playing this game twice through. Both times hit a game breaking glitch where the storyline would not progress in Act 3. Once at the start of Act 3, and once in Act 3, Scene XII.  Besides the above, the story is free flow marginally directed story. But the story is SO convoluted that you're just spending your mental capacity trying to connect the dots. Which are so scantly connecting that it makes it almost not worth playing.   It has unique down-home comfy acoustics and visual presentation, which gave me a novel enjoyment, and why I even attempted a second playthrough... But the negatives, sadly, do not outweight the positives.   P.S.- Note this game is not even complete as released. They are still developing the farther acts that will complete the convoluted story.",
            "review_score": "-1"
        },
        {
            "review_text": "The best thing I have ever found on accident. Needs to be experienced since words will have a hard time doing it justice. Also bluegrass music.",
            "review_score": "1"
        },
        {
            "review_text": "I dont say this lightly, but Kentucky Route Zero is the best point and click adventure game of all time.  This is the kind of game that transcends everything that has come before it in its genre to create something truly special and poignant. And it does it with such confidence and creativity in itself, that it doesnt even require gameplay mechanics like puzzles, branching story paths or platforming and combat segments to somehow justify it being a videogame.  And make no mistake, this is a videogame, something that cant be achieved in any other medium, and dont let anyone try to tell you otherwise.  Boasting a gorgeous artstyle and aestethic, Kentucky is transformed into a feverish purgatory Lynchian dream dealing with themes of loss, grief, nostalgia, regret, memory and longing, creating one of the most mature and well written stories I have had the pleasure to experience.  I know im being very vague about this game, but thats because I want you to go into this game fully blind as I did, and be surprised by what you find. Take your time with it, explore every nook and cranny, and let yourself immerse in this beautiful tour de force.  And dont get dissuaded by the people angry that the episodes are taking more time to be released than what was promised initially. Once you play it, you will understand perfectly why these devs take their precious time with each episode.  I have no problem with waiting for another episode if it will be of the calibre of the 4 before it, and I now wait patiently for the final resolution of this amazing experience.",
            "review_score": "1"
        },
        {
            "review_text": "Hauntingly beautiful, intimate, and real, It's an experience unlike anything else I've ever seen. Best played on a cool summer night.",
            "review_score": "1"
        },
        {
            "review_text": "This game is mesmerising, medidative and &lt;grabs thesaurus&gt; elegiac. I am not sure I understand it, but I love it. Incredible art style and music too.",
            "review_score": "1"
        },
        {
            "review_text": "Above all, Kentucky Route Zero is driven by the atmosphere and tone. This has to hook you in order for you to find the game, especially the first two episodes, compelling. The overall experience is dreamlike. There's some obvious Twin Peaks influence. And it can be beautiful, in a lonely sort of way. I find it nice to play at night with the lights turned off.  The way the narrative unfolds is completely unique in my experience. It takes fascinating advantage of possibilities that are only available to an interactive, participatory mode. You seem to have more control over what happened in the past than what will happen in the future. 'Seem,' because nothing in this game should be taken at face value. Or maybe all of it should. Play the game and decide for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of talk about the 'Citizen Kane of videogames', but I'm pretty sure Kentucky Route Zero is the Waiting for Godot of videogames. You should probably play it.  I don't know how else to describe it in a way that makes sense short of writing an entire essay. Even then, I'm not sure it makes sense, except in a kind of dream-logic way. You should probably play it.  What is it about? Antiques, driving, a dog wearing a straw hat, old electronics, music, art, debt, regret, being specific, text adventures, and probably purgatory. (I told you it wouldn't make much sense if I explained it.) You should probably play it.",
            "review_score": "1"
        },
        {
            "review_text": "Great little experience. Interactive story. Review pending Act 3 which just came out. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Clear match of the story and the atmosphere. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "Act III is finally out, and definitively propels KR0 into my all-time favourite games list. There's just so many perfectly-executed moments that stick with you for days.",
            "review_score": "1"
        },
        {
            "review_text": "I'm sure this game will be worth it when they finish it in 2020....Actually, at this rate, who knows.",
            "review_score": "-1"
        },
        {
            "review_text": " I hate the term ‘video games’.    It conjures up images of pimple-faced nerds with bad haircuts sitting around an  Atari 2600  with a two button joystick hacking away at  Pong  on a precious Friday night. Yeah, sure, that can be fun – but the medium has evolved dramatically from its fairly simplistic roots to what I would consider one of the highest forms of art. ‘Video games’ is an overly simplistic and even fairly derogatory term for something so complex and creative and beautiful that they have literally captivated the entire world. Many of us don’t simply play to ‘beat’ the computer or chase a high score, but to admire and be enveloped in some beautiful experience that has been created and put forth for us. In its rarest and most coveted form, it is candy for my brain; something I crave and cannot get enough of.   Now back to the notion of art.   Art has layers of complexity, of course. For example a singer/songwriter wears two hats. They are both a poet and a singer. This is inherently more complex that just being a poet, with all else being equal. Creating a modern gaming experience that is exceptional really takes a delicate balance of it all – variables such as great music, artwork, technical and efficient programming skill, and of course a killer mechanic and conceptual design. You need the whole shebang in many cases. And perhaps the most important thing, in-fact the thing I value the most, is that there is little relationship between big budget titles and artistic success. I find most AAA titles to be quite sterile.  The notion that a dude can brew up some small-scale indie game in his basement that goes on to take the world by storm, is amazing, and truly is one of the most important aspects that makes ‘video games’ art.  I don’t think I even need to list examples to get agreement on that point. In fact, it is arguable that some of the most risky and artistic gaming experiences could only be birthed from a single person or small team who had nothing to lose and everything to gain from putting their wonky, albeit sometimes brilliant, visions out there.   Intoxicating With all those grimy pixels Keeps me coming back   At the end of the day, the gaming experience is built by simply arranging zeros and ones in specific orders. Of course it works quite differently in reality, but that’s essentially it when stripped to its core. I’m not sure at which point video games made the jump from simply technical possibility to pure entertainment to something verging on art, but it certainly did happen. Games that really make you feel something, instead of just throwing an obstacle in your way such as finding a key to open the door. All I know is that one things most successful indie games have in common that many AAA title do not is pure where-it-on-your-shoulder heart and soul. Yeah it’s  weird , but it’s got  character . And it sits you down and  makes you smile  and you are swept away and caught up.  You had no choice.    Well, here’s to the indie titles with rough edges bubbled up from nothing but pure brilliant ideas that sent us forever into that love affair with modern gaming, never to return. My hats off to all the weird abstract shoestring-budget titles that dared to challenge gaming paradigms. And sure, there are casualties. Some titles fall from misinterpretation or even being too abstract. Perhaps missing the mark. Others fall for lack of funding, and overall lack of support. But perhaps in a sense they pave the way. They may be delicately priming our minds for something better; for the future.  So, my hat’s off to the fallen, as well. ",
            "review_score": "1"
        },
        {
            "review_text": "A beautifully crafted point-and-click adventure game that blends the supernatural, classic journey, and thoughtful dialogue options that leave you wondering what could have been. It's so poetic and subtle that I couldn't help but feel that I was always missing something. Fortunately the acts are short, so replaying it for more information and a better understanding isn't difficult. Like a good film, you may have to go through it a few times to truly apreciate the nuances. The clean, vector style art that reminds me of Another World blends nicely with the narrative. The purposeful lack of detail allows you to think longer on the dialogue and read deeper into the symbols and messages rather than what is present in the graphics. There are a lot of great cinematic scenes and use of sound that liason from the point-and-click experience into experimental, somewhat meditative intermissions. Check out this game if you liked The Longest Journey, Gone Home, Dear Esther, or experimental games that push you to think and question what you are handed. I greatly look forward to the rest of the episodes.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not even going to begin guessing what the game is about with such a short episode, but the experience was definitely worthwhile. Have an extra hour on your hands, like reading, and don't mind immersing yourself in something that doesn't necessarily give you any answers? Try this.",
            "review_score": "1"
        },
        {
            "review_text": "The first two Acts are quite entrancing, and I am interested to see where this is going. I recommend this to anyone with a taste for the surreal.",
            "review_score": "1"
        },
        {
            "review_text": "Play it if you like pretty art, and atmosphere, and cool characters, and can follow an abstract story. Don't play it if you're looking for a simple, traditional game.   I like it.",
            "review_score": "1"
        },
        {
            "review_text": "This game is unique. It represents the noble part of indie game world, bringing content and depthe into where we are usually expecting only the shape, the form and shiny surface. Words fail me with respect. My heart bleeds, my sould weeps and my mind is still.",
            "review_score": "1"
        },
        {
            "review_text": "At this point only three of five parts have been released.  Not so much a 'game' as an interactive story. There aren't defined 'puzzles' and gameplay is limited to interacting with certain things in the environment, but it's still a fascinating experience.  In this game, you play Conway - an aging delivery driver for a failing antique store. When out making a delivery, you stop to ask for directions where an unusual man directs you to 'the zero'. The world is very well built, with the entire design being beautiful - soundtrack, visuals, writing... everything. Characters are compelling, well developed, and just as odd as their surroundings. Everything is pretty abstract but there are stunning moments of beauty. I've sat at a still screen for minutes at a time just soaking in the atmosphere. It helps that there's somewhat of a 'less is more' idea at work - the narrative isn't thrust upon you, but builds from your experiences.  But that works to its advantage. A lot of what you get from the game isn't a result of the choices you make, but the choices you make don't railroad you down a certain path. Different bits of story will open based on your choices, but they're more a reflection of how you intend to play the game than how the developer intended you to play the game.  Definitely pick it up. It's a storytelling experience I'm very happy with thus far.",
            "review_score": "1"
        },
        {
            "review_text": "This is like the video game version of a David Lynch film. The basic starting point is that you are trying to make a delivery for an antique store. Since this is episodic and only the first three acts are available I am going to assume that at some point you might actually get to make this delivery. Whether that is important or not is unknown. However, the journey is bizarre and filled with all kinds of oddball characters and settings, both above-ground and in the mysterious underground 'Route Zero'.   It is a point-and-click adventure (but with no inventory), with interspersed instances of old text adventures and RPG style dialogue options (though having only played through once, I don't know if the different choices have any significant impact on the story). The art style is fantastic and reminiscent of  Another World .  I had a lot of fun with the first three acts and can't wait for the remaining two.",
            "review_score": "1"
        },
        {
            "review_text": "Do you know that feeling? That special, rare feeling? It's a feeling that watching Breaking Bad gave me. That feeling that what you're watching (or in this case, playing) is something that you're not going to see anything like for a very long time once it's over. That it's cut from a very rare, valuable cloth and stitched together with the utmost care. Kentucky Route Zero gives me that feeling.  The more I see of Kentucky Route Zero the more in awe I am of the developers, Cardboard Computer. That this game was made by an impossibly small team of only 3 people blows my mind, but makes so much sense the more I think about it. The world of KR0 couldn't possibly be made by a large team, all throwing in more and more ideas, diluting the original vision. This game feels personal and intimate, but it's slow to reveal it's secrets.  Act 1 will see you through a mostly grounded-in-reality Kentucky backdrop, looking for an address to make one final delivery. Everything feels frozen in time, like it's caught both in the past and some weird version of the present at the same time. People you swear you just talked to will vanish out of sight when you look away for a second. Walls melt away as the lead character, Conway, lets his thoughts drift toward the Zero, a mythical road supposedly where your final delivery is to be made. Your sense of reality will all but fade by the time Act 2 closes, and seem like a distant memory once Act 3 is done with you.  Kentucky Route Zero is determined to drip with atmoshpere and mood each and every second you play it, and succeeds in spades. Music is very sparse and is usually a low humming ambiance. What little noise there is is generally droning static of caves, engines, and wind. Each act features a song by composer Ben Babbit, however, and all 3 are just beautiful. There's going to be a lot of talk of both the 'Long Journey Home' and 'Too Late To Love You' scenes.  The game is played entirely with the mouse, and is almost boringly simplistic in it's interactions. Pointing and clicking is literally all you will ever do, and I like it that way. There are no puzzles to impede progress, no quick time events. There aren't even any branching story choices, which again is something I like. You are given many many dialog choices, but they serve more as a way for you to choose which snapshots you want of each character and environment rather than a big story choice. Picking dialog in KR0 feels more like stitching together a screenplay or a poem.   Kentucky Route Zero is doing so much that I've never seen before in a video game, and it feels like the game is smarter than me. It's so dense and detailed, and 3 acts in it feels like we're just now getting a peek at the larger picture. Part of me hopes that once this sleepy, sad, hopeful journey is over that we won't have all the answers. That there will always be some mystery to the Zero. Considering what Cardboard Computer has delivered thus far, I think I an trust them to do just that.",
            "review_score": "1"
        },
        {
            "review_text": "This game is wild. It seems a little pricey for a game that the reviews don't really explain what it's about, but i took the plunge anyway, and now i sit, writing a recommendation for a game that i can't really explain what it's about. You walk around, you talk to people. You drive about aimlessly. Bizarre things happen. Beautiful things happen. It's a bit melancholic, it's a bit funny, you never quite figure out what is going on, but it doesn't matter. It's a perfect slice of Americana. I've never played anything like it, and it really is pretty amazing. If you dig dialog-driven adventures and are happy to wander, you're in for a real treat.",
            "review_score": "1"
        },
        {
            "review_text": "This game is simply amazing. The mood, the ambience, the dialogue and the characters. I can easily say this is my favorite indie game by far. This game is more of an experience, and it really draws you into its world. I wish I could write out more, but I'm not too good with my words. All I can say is this game has some fantastic writing, and its worth getting lost in (especially at night, with the lights closed).",
            "review_score": "1"
        },
        {
            "review_text": "Easily my favourite indie game of all time. Would recommend for anyone looking for an experience more than a game.",
            "review_score": "1"
        },
        {
            "review_text": "This recommendation comes with a lot of caveats. 1) If you don't care for the point-and-click adventure game genre, this is not a game for you. 2) If you are not a fan of surreal storytelling, this is not a game for you. If neither of those apply, Kentuck Route Zero is probably up your alley.  The sound design and graphics are spare but expertly used. The game leans heavily on swathes of color and ambient sound to pull you in, and I feel like that works really well (as a side note, the soundtrack is included with the game, so that's a plus). The whole thing has a very dreamy quality to it, though as a lifelong resident of the southeastern US, I can't say as it bears much resemblance to real life Kentucky. But that's okay. The Kentucky of Kentucky Route Zero is a strange almost-character that feels very much alive as you guide Conway through it.  I'm eagerly awaiting the next chapter.",
            "review_score": "1"
        },
        {
            "review_text": "I recommend it hesitantly; if you like surrealism, where a lot of weird stuff happens for the sake of weirdness (Twin Peaks), it's your game. If you like the weirdness to resolve itself into sense at a later point as you piece together the mystery (Myst), then maybe not. I enjoyed its off-kilter take on adventure games, really liked the first two acts, but the third act really started to grate on me -- the suspension of disbelief I gave the game at first started to dissolve, and a lot of the dialogue sounded less like glimpses of a mysterious world, and more like the script saying mystical things just to sound cool. It's worth getting on sale, a lot of fascinating little pieces, but I'm enjoying the whole thing less with each act.",
            "review_score": "1"
        },
        {
            "review_text": "I was quite hesistant to buy this game, as the limited previews the trailer offered didn't quite justify the hefty price tag. Eventually I caved (haha, because it's about caves...) and decided to see what this game, with vivid atmospheres and retro art style, was really all about.  I was absoutely right to buy it and should have bought it earlier. The game establishes a powerful and compelling storyline, with lots of mind-bending dreamesque sequences. You've got to really think about what's happening, track the characters, build what you think is going on and have it torn down. It's got great potential for literary analysis when it's finished.  Three of the five acts are currently out, each of them lasting about an hour each. Headphones are recommnded, particularly for act three when you meet some very cool travelling musicians (robots? i'm not sure).  A surreal and moving experience, a commentary on the corporate world, and a treat for the eyes. Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure what I just played, but it was pretty awesome.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, so after spending a long time putting this off, I finally dove into Kentucky Route Zero... And I couldn't be happier that I did. Ugh this game is just so good! I would even argue that it's perfect. It has everything I love, and if it's not my favorite game of all time it's pretty damn close.  So here's the thing: I absolutely love my pretentious/artsy games. Vanishing of Ethan Carter? Hell yeah. The Stanley Parable? Obviously. Limbo? Grow Home? Flower? Journey? Check, check, check, and check. I think you get the picture. I want games that give you this greater sense of depth, this feeling as if there is something big, something important behind what you're experiencing that you just can't quite grasp, and Kentucky Route Zero pulls that off perfectly. Does this game's story make sense? Not really, and yet in a way it still does. As you get further into the game and more deeply immersed into the world, it all starts to feel as if while you don't have all the pieces necessary to solve the puzzle you're still not too far behind, and if you pay close enough attention you'll start to make some really interesting connections and have some really awesome moments of clarity.  On top of that, Kentucky Route Zero has some of the best dialogue I've ever seen in a game. There's no voice acting so you'd better get your reading glasses but believe me, it's worth it. Not only is it insanely well written but what makes the dialogue in the game all the more incredible is how you can interact with it. For instance, you can have perspective changes where suddenly you're participating in a conversation as a different person than you were before. On top of this, you often get dialogue options that essentially give you multiple ways to respond that will actually shape the past. For instance, you have a decision right at the start where a guy asks what your dog's name is. The way you respond actually determines what the dog will be called for the rest of the game, and while that may not seem too significant, I still found it to be super cool. Later on, there are some moments where these decisions do seem to be slightly more significant as well, I'm definitely not gonna spoil those though. All of this excellent writing does wonders to build this incredibly beautiful, strange world of magical realism that I've quickly fallen in love with and found myself wanting more of.  Of course, that brings me to an unfortunate point: This game will be composed of 5 acts, of which only 3 are currently out. I've looked at the history of their releases and it took about a year for Act 3 to come out. It's been almost a year since then with no Act 4 in sight, but it seems very likely that it will come out soon based on that time frame. The amount of love and work that went into Act 3 was so evident that I have nothing but the highest hopes for Act 4, there's no doubt in my mind that it will be absolutely mind blowing. In the meantime, I'm probably gonna have to replay the first three acts once or twice because I just can't wait to dive back into this world and see what else I can find!  Happy trucking on the Zero.",
            "review_score": "1"
        },
        {
            "review_text": "If you're jaded of the same old killing and fetch questing of AAA games and looking for something different, then this game is for you. Great artistic direction and compelling story. Just sit in a dark room with headphones and let this game take you on one heck of a journey.",
            "review_score": "1"
        },
        {
            "review_text": "Best gig in a videogame, beautiful music. 10/A#",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant atmospheric storytelling. Love, love, love.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best visual styles I saw, along with Mirror's Edge and TF2.",
            "review_score": "1"
        },
        {
            "review_text": "Maybe it's too early to write a review after playing Act 1 of 3, and more so when I'm not really sure what it was that I just played. I could compare it too Monkey Island or some other classic point and click adventure, but that wouldn't be really fair, as Kentucky Route Zero, isn't as much adventure as it seems to be a story... a story that you as the player control by making dialogue choices. It could be the two glasses of wine, but the first act left me with a feeling of having started a game, equally fascinating and weird. Unless I make some kind of edit to this review, consider this my stamp of approval.",
            "review_score": "1"
        },
        {
            "review_text": "I'm only at Act I, Scene 3, but this game is astonishing. It's beautifully written and deeply clever (the choices you make in the dialogue trees are unconventional and interesting, although I have no idea how varied the game is depending on what you choose to say; I will simply say that it drastically changes the storytelling going on in your own head, at least). The game is gorgeous and elegant, the characters are endearing and unique, and the incidental moments of folk tunes that slowly build in your speakers at unexpected moments give the game a haunting beauty. The story is very mysterious and endlessly fascinating. I cannot wait to see where this goes.  Update: Having played all the episodes currently available (up to Episode Three), all I can add to what I said before is that the game continues to deepen into one of the most intriguing and original pieces of electronic art I've ever played. The wait for the final two chapters already feels interminable, but even if I played no more, my time was well spent and absolutely unforgettable. I think it's about time I relive the game...",
            "review_score": "1"
        },
        {
            "review_text": "Way too long for the game to be completed...  On the opposite end of the spectrum, I'm sincerely [cough] looking forward to HL:2, EP.3",
            "review_score": "-1"
        },
        {
            "review_text": "What there is of the game is good. However, the game was released a year ago and we were promised four more acts. As of yet, we've received one of them.",
            "review_score": "-1"
        },
        {
            "review_text": "What there is of the game is good. However, the game was released a year ago and we were promised four more acts. As of yet, we've received one of them.",
            "review_score": "-1"
        },
        {
            "review_text": "Tried to phone the company to get a refund but my antique phone only dials one number",
            "review_score": "1"
        },
        {
            "review_text": "Does more to push the medium of games by creatively leveraging the notion of interactivity and how it can be subverted than any number of walking simulators.",
            "review_score": "1"
        },
        {
            "review_text": "Buyer beware.  No matter how good reviews are for a 'point &amp; click adventure game', if that is NOT your thing...  Then you will not enjoy this game.  I really tried to like it, but you have to be in a very specific mood to be able to watch blocks move across your screen at the speed of snail. Sure, the designs are fantastic, but the dialogue is silly, and the characters are not very engaging, imo. ",
            "review_score": "-1"
        },
        {
            "review_text": "KRZ is more of a interactive experience than a game. Some incredibly gorgeous work, but the pacing is slow and plot is not engaging. After beating the first Act, I was left unenthralled.",
            "review_score": "-1"
        },
        {
            "review_text": "I come back to this game after playing 'Where The Water Tastes Like Wine' at Day Of The Devs 2016, a game I have been looking forward to since the first trailer. I talked to the developer demoing the game there, and he confirmed my suspicions that it was influenced by Kentucky Route Zero.   After a year, and having played it before, the game has lost none of its magic. This game still contains some of the most mesmerizing scenes I have ever played in a game. The amazing soundtrack, a mix of ambience and bluegrass, only adds to the already mysterious, dulcet atmosphere.   My only complaint would be the amount of reading that has to be done. I understand narration would not work well with the feeling of the game, but the substantial amounts of dialouge do grate on my patience a bit.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful looking game, some interesting moments....... but ultimately pretty dull. I really enjoy adventure games, but this seems to be a case of style over substance.",
            "review_score": "-1"
        },
        {
            "review_text": "Im 51 years old. I've been playing video games since PONG. This is the most boring game i have ever played.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a Click and Point Adventure where you also choose the entire adventure. You'll not only make choices for your character, but also everyone else and sometimes the things around you. You'll dictate how things are as much as you'll uncover through investigation.  It's beautiful, haunting, eerie, and melancholy. It's slow, obtuse, and impressionistic. You won't understand what's going on, and it won't try to change that.  No action and only a strange artistic kind of satisfaction will make this a pass for most. As others have stated - less of a game and more of a 'piece'.",
            "review_score": "-1"
        },
        {
            "review_text": "It delivers well on a spooky atmosphere, but not on much else.  I'm not strongly against the game, but it just didn't grip me enough to continue on and buy any of the episodes after the first.  If atmosphere is enough for you, maybe this would be a good title to pick up.",
            "review_score": "-1"
        },
        {
            "review_text": "I like adventure games and interactive movies, but this is neither. Think of a short interactive novel. After I while I just got bored, the game is slow, the story is weird and not connecting with me at all. I didn't see how my choices have affected anything at all. The beginning of the game was intriguing though, but went downhill from there for me.",
            "review_score": "-1"
        },
        {
            "review_text": "I went into this game not knowing anything about it and so not having any set expectations. I came out of this game after completing two acts realizing I did not care enough about the world, story, or characters to go through more of the tedious 'gameplay' to learn any more about them.  After the first couple minutes I was intrigued and curious as to where the game would go, it reminded me a little of a softer mix between Metro 2033 and maybe Silent Hill. After Act I's lackluster conclusion that left me wondering what had even happened I had my doubts as to the cohesiveness of the world or the existence of a plot. By the end of Act II I felt the game was constantly introducing new mysteries and oddities with no direction whatsoever and no plans to attempt to explain or justify them in any way. It reminded me only of the TV show Lost, but you realize it is going nowhere a whole lot quicker.  The game does something interesting with the dialog in that you establish your game world through it. You're given conflicting options to respond to someone's question and whatever you say is the truth of the world. It's a clever way to allow player's to piece together their character's backstory slowly over the course of play. I imagine this could be used to interesting effect within an RPG, but in this game all it means is that conversations later in the game just reference the things you said earlier as if to say 'Hey, remember when you made a choice in this linear game pretending it has depth? I do!'  It's a pretty game, I like the art style and the smooth camera/scene transitions (in most cases), but games like this stand or fall on their story, and after two hours I am not sure I could care any less about this game's story.",
            "review_score": "-1"
        },
        {
            "review_text": "Kentucky Route Zero has the most interesting dialogue system I have ever seen in a game. And not because it has particularly many choices or branching paths (though it certainly scratches the itch of dialogue tree decision-making), but because the dialogue system fluidly gives you information about the character you play as without a plot dump or exposition of their backstory. You don't learn anything about characters when you meet them, you learn it when you play as them. And when exactly you play as them is another interesting point, as what character you are controlling changes often once you meet the first other main character. And eventually you don't really control any one character, but rather you get to see what everyone in your party is thinking and choose one of their dialogue options. It's an interesting and effective way of learning about a main cast of characters that I've never really seen before. The visuals are absolutely gorgeous while running on a potato, because everything is solid colors and nothing in the environments needs to move much. Lots of pretty scenes and abstract imagery, in a nice rural setting. It's not usually something I bring up, but the audio design is such an important part of this game and done so well that it deserves praise too. I'm excited for acts IV and V, with act III being one of the most intriguing segments of a game I've ever played. If you're on the fence because all the acts aren't out yet, you should buy this. I don't want to spoil much more, but it's the best game I've played of it's genre, and this is probably my favorite genre of games. What's already here is great, and the developers are working hard to complete it.",
            "review_score": "1"
        },
        {
            "review_text": "Captivating, mysterious, and eerie. Wasn't really sure what to expect going into this game, but was really surprised with how intrigued it left me. Would definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "This is a great game. It is pushing the boundaries of game design. If you are simply looking for a game with amazing graphics and pure action, this is not for you. You need to have patience. I think what the industry needs is more games where the point of the game is not to get to the end. This is a game very much about exploration. Rather than having to perform puzzles to move ahead, you become genuinely interested in the mystery and want to explore for yourself.",
            "review_score": "1"
        },
        {
            "review_text": "Kentucky Route Zero is an odd game, to say the least. It is developed by Cardboard Computer, and there is a computer made of cardboard in it. Actually, the game may really be made of painted bits of cardboard cut into interesting shapes. I do not know, but what I do know is that this game is quite decent. You start off the story with an elderly fellow named Conway, who is delivering a package in his truck to someone located on Dogwood Drive. To get there, he is told, he must find a way to [wobbly, smoky lettering]The Zero[/wobbly, smoky lettering] in order to get there. What follows is what happens in his pursuit of this location.  I feel I ought to address the issue of the acts, as they stand currently this fine January afternoon in 2016. There are at this time three of five promised acts, and the development of the remaining two acts has been pushed back to an indefinite time. Act IV is purportedly imminent, but the exact timing is still undefined.  It is some folks' opinion that you should wait until the game is completely and totally finished before you bother with the first three acts, as the developers are totally attempting to scam us all by falsely advertising a five-act game while only delivering three.  It is my opinion that if those are your thoughts in this debate, you ought not be playing this game, as I am reasonably certain it simpy is not your sort of game. Having played through the first three acts, I do not feel particularly stiffed in not having the last two yet. I have backed projects on Kickstarter, for goodness sakes, and if that has taught me anything it is that a rushed project will yield nothing but misery. Certainly, this is a long night, out on the road, but isn't that kind of the point of the game?",
            "review_score": "1"
        },
        {
            "review_text": "cool. like half-life 2 episodes....no telling if the end will ever be released ",
            "review_score": "1"
        },
        {
            "review_text": "Whilst the game is admittedly unfinished, what you get for your money so far is incredible. It's got a lot more content than many finished games on Steam. The storyline is gripping, the characters are diverse, Ben Babbitt's soundtrack is incredible. Maybe wait for it to go on sale before you buy it if you're uncertain about paying £18.99 for an unfinished game...",
            "review_score": "1"
        },
        {
            "review_text": "I love this game and it's not for the same reason I love many other games (gameplay, graphics, difficulty). It´s because this game is so much more than all the other 'overwhelmingly positive' indie games I buy and finish in a few hours. KRZ has characters that you will not remember the names of, except Blue, and neither does it have engaging gameplay or even coherent writing. What it has is a story and experience that sticks with you, I don't know of any game I remember as vividly as KRZ and the fact that it's released across such a long timespan honestly doesn't face me since it either gives me a reson to A) anticipate it and prolong the pleasure or B) play through it again, ever time being as incoherent as the last.   So bottom line: it gets an OK from me, buy it.",
            "review_score": "1"
        },
        {
            "review_text": "A beautiful, atmospheric, unsettling, surreal dream.",
            "review_score": "1"
        },
        {
            "review_text": "The Good: This game is a delightfully weird experience. If you are a fan of David Lynch, you will probably like this game. The art and atmosphere are great and the music is downright hypnotic at times. It is very rare that I listen to the soundtrack of a game, but I find myself listening to songs from KR0 often.   The bad: Cardboard Computer is a small development company and they are notoriously slow at putting new episodes out. They tweeted last November that episode 4 is almost done and yet, it is still not here. I do believe the game is worth buying, but I would suggest picking it up during a sale since it is still incomplete.",
            "review_score": "1"
        },
        {
            "review_text": "Totally worth the wait! Been here and I'm not leaving now. Would buy again ",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful minimalistic adventure game. It can be a little obtuse from time to time, but the dreamlike story and setting are great if you're in to that sort of stuff. The music is also top notch.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful and magical. This art style pulls you in, the colours and lighting draw you closer into its smoky mystery. Where are you as protagonist going? Doing?",
            "review_score": "1"
        },
        {
            "review_text": "One playthrough of the first two acts will not be enough for those who want to have more than a peek at the title, and maybe discover all of its layers. There’s bleakness to Act II, but also charm. And most importantly it allows you to interpret it in the manner you see most fit. Right now, I can tell you that by the time all five acts are released, Kentucky Route Zero will have earned its place next to titles such as Limbo, Bastion or To the Moon in the hall of independent games that deserve a spot of their own.   Full Review  [www.noobfeed.com] .",
            "review_score": "1"
        },
        {
            "review_text": "Wow, better late than never. A truely epic game, and well worth the money and the wait. They can take as long as they like for the last act, providing I get to play it before I die. :)  ",
            "review_score": "1"
        },
        {
            "review_text": "This game has a dog. A DOG FOR ♥♥♥♥'S SAKE  8008135/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a game I went into with some skepticism as the indie trailer didn't impress me much beyond the ethereal background music, which is hauntingly entrancing. But as I started to play the game and mender through the lives of the characters who you come across (and occassionally play as), I started to get drawn into the claim that the journey is more than the final destination: that is Kentucky Route Zero. From the 80s/90s graphics that reminded me of Another World and Flashback, through to the sublime music that fit the scene every step of the way and the devilish surprises that you notice on repeated playthroughs of the game, so much is more than it seems.  This is not a fast paced game. This is not an action-adventure and barely has any puzzle elements at all. The closest games this reminded me of is Home and The Path, where psychology is the game and what choices you make say just as much about you as about the characters you lead on the way to Kentucky Route Zero.  It's about as indie as it gets. And just like Home and The Path, I recommend that you buy a season pass and play it; but I also caution you that with only two acts of five released right now it could turn into a game you're not liking at the end.  EDIT @ 2014-02-23:  With the game development having been stuck on only two acts released since my initial review from six months ago, I must add an additional caution that the game may have fallen into development hell. While I still recommend this game based on what I've played so far, if the game really is cancelled and left as incomplete I will be just as upset as everyone else.",
            "review_score": "1"
        },
        {
            "review_text": "As many others have stated, the time between acts is ridiculous. I would wait until all five acts are completed if they ever are.",
            "review_score": "-1"
        },
        {
            "review_text": "I've finished all the episodes that were released but at this point I can't remember when I purchased or played them (feels like it's 1 or 2 years). I can't even remember the story (vaguely recall the main character) and won't bother playing if remaining episodes come out (which probably won't).",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe after a while we get used to the dark.  10/10 would do more thinking than playing again.",
            "review_score": "1"
        },
        {
            "review_text": "dream is a destiny   so is krz.",
            "review_score": "1"
        },
        {
            "review_text": "Stunning graphics, slow paced storyline I'm more than happy to wait for, making me memories I don't mind keeping. Thanks guys, if only people like you had a little extra time on this rock to make ours that touch more worthwhile.",
            "review_score": "1"
        },
        {
            "review_text": "A strange point and click adventure. Magic realism atmosphere and intrincate story. Feels almost a literary work, very artistic.  However, there is little to do except for exploring, reading and watching. Some may be put off by this.",
            "review_score": "1"
        },
        {
            "review_text": "David Lynch meets Luis Bunel, then Luis cheats on David with Alejandro Jordokowsky and they have a baby together.   This game is the best. 2nd Favorite game ever made.",
            "review_score": "1"
        },
        {
            "review_text": "Strange, surreal, and sublime.",
            "review_score": "1"
        },
        {
            "review_text": "weird, haven't played in a while, but when I got it there was only 1 episode and took forever to release 2nd. Not sure where they're at now, but... if they're all done, it might be a fluid play-through.",
            "review_score": "1"
        },
        {
            "review_text": "WHERE IS EPISODE 3",
            "review_score": "1"
        },
        {
            "review_text": "┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼ ┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼████████┼┼┼ ┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼░███░░░░░██░┼ ┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼░██░░░░░░░░█░┼ ┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼░██░░░░░░░░░█░┼ ┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼██░░░░░░░░░██┼┼ ┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼░█░░░░░░░░░██┼┼┼ ┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼██░░░░░░░░██░┼┼┼ ┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼┼░█░░░░░░░░██░┼┼┼┼ ┼┼┼┼┼┼┼┼┼░█████░░░┼┼┼┼┼░█░░░░░░░░█░┼┼┼┼┼ ┼┼┼┼┼┼┼░█████████████░┼██░░░░░░░█░┼┼┼┼┼┼ ┼┼┼┼┼┼░██░░░░░░██░░█████░░░░░░░██┼┼┼┼┼┼┼ ┼┼┼┼┼┼██░░░░░░░░░█░░░░░██░░░░░░██┼┼┼┼┼┼┼ ┼┼┼┼░███░░░░░░░░░░█░░░░░░░░░░░░██┼┼┼┼┼┼┼ ┼┼┼░██░░█░░░░░░░░░░█░░░█░░░░░░░░█░┼┼┼┼┼┼ ┼┼░██░░░██░░░░░░░░░██░██░░░░░░░░░█░┼┼┼┼┼ ┼┼░██░░░███░░░░░░░░░█░░░██░░░░░░░██┼┼┼┼┼ ┼┼┼░█░░░░░░██░░░░░░░░░░░░█░░░░░░░░█┼┼┼┼┼ ┼┼░███░░░░░░██░░░░░░░░░░░██░░░░░░░██░┼┼┼ ┼░██░██░░░░░░███░██░░░░░██░░░░░░░░████░┼ ┼██░░░██░░░░░░░░█████████░░░░░░░░░█░░██┼ ┼██░░░░██░░░░░░░░░░░░░░██░░░░░░░░██░░░█┼ ┼┼█░░░░░███░░░░░░░░░░░░█░█░░░░░░██░░░░█┼ ┼░██░░░░░░███████░░░░███░░██░░░██░░░░██┼ ┼████░░░░░░░░█████████░░░░░░█░░░░░░░░█░┼ ┼██░██░░░░░░░░░░░░░░░█░░░░░░░░░░░░░░██┼┼ ┼┼██░░███░░░░█░░░░░░██░░░░░░░░░░░░░██░┼┼ ┼┼░██░░███████░█████░░░░░░██░░░░░░██░┼┼┼ ┼┼┼┼███░░░░█░░█░██░░░░░████░░░░░███░┼┼┼┼ ┼┼┼┼┼░███████████████████████████░┼┼┼┼┼┼",
            "review_score": "1"
        },
        {
            "review_text": "Surreal magical-realist adventure with fantastic atmosphere and writing. Note that it is currently missing two chapters and they are rather slow in coming out, but still worth experiencing. One of my favorite indie games.",
            "review_score": "1"
        },
        {
            "review_text": "Let's get this out of the way: Act IV &amp; V have been delayed for a long time, and it's been almost a year and a half since Act III came out. If Act IV &amp; V come out, it will probably be out in 2016 and maybe even 2017. The developers haven't gone dark - they're still communicative on twitter and their site. If you don't want to play that risk or wait, just avoid this game until all the acts are out.   But with that said, even with only 3 episodes out, Kentucky Route Zero is one of the best adventure games ever made. Even if episodes IV &amp; V never come out, I would still be satisfied paying $15(got it on sale) for the three episodes I've played so far.",
            "review_score": "1"
        },
        {
            "review_text": "development = stoped ; dont buy till someone pick it up again",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing Storytelling and Ambience. Truly an amazingly told story. I can't wait for Act IV and V.",
            "review_score": "1"
        },
        {
            "review_text": "Not my type of game. You just click and read and do nothing.",
            "review_score": "-1"
        },
        {
            "review_text": "I'll start by saying the visuals and music are good (mostly)  As for gameplay...well there's none. You click to move and choose sialogue choices. However these dialogue choices don't seem to matter at all. Rocks fell on you? Either say: I'm Okay or My leg is stuck. Either choice will have your leg stuck. There are no puzzles either and no exploration.  And then there's the story... what story? You are just told random things you need to do because X says to, with no real goal or sense in the matter. It's like someone got high on cocaine then decided to write a script after taking some acid as well.  Imagine a visual novel where all your dialogue choices are the same and the story makes no sense and you get this game.",
            "review_score": "-1"
        },
        {
            "review_text": "There is a plenty of positive reviews on this game, however I can't recommend it. Yes I know I only played like an hour of it, but man it was a struggle. I wanted to try it and it was just to dull for me, sorry, not my type of game. One Grumpy Russian score - 3/10 - you gotta be severely intoxicated to play this",
            "review_score": "-1"
        },
        {
            "review_text": "Unfortunately i will have to vote this one down. The locations are very interesting and in-game atmosphere is pretty good, but that's about it. Starts off very promising and could have been a REALLY good adventure game but: - The writing is not great. - There is no story to this game, just atmosphere. Few very generic side stories. - There is no progression, just random 'happenings'. - Nothing in this game makes any sense and nothing is explained.  - Dialogue lacks depth, just random and unrelated text most of the time.  I'm not sure what the aim of this game was from the point of the developers or writers. It could have been great if there was a story but there is none. You go to random unrelated locations with random unrelated stories within them that are just way too generic to be interesting. Definitely not worth the 10$ on sale, maybe for 2-3$ it would be worth checking the art.   To devs: add a story to the next series, something like True Detective, and you will have a winner here. Also, stop smoking so much weed.   *Game may be a lot of fun for people with high consumption of drugs.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like overpriced, unfinished games that get overrated by fanboys. Clicking similators that have little to no gameplay what so ever. Has an insanely pretenious 2deep10me story that doesn't make any sense and is needlessly vauge. And you also wear a fedora. Then this game is without a doubht for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Maybe it's just me, I just couldn't get into this game. It's content was just random nonsense strewn together to me.",
            "review_score": "-1"
        },
        {
            "review_text": "While I've only completed Act II so far, I can safely say that Kentucky Route Zero is one of the most ethereal, engaging experiences I've ever had with digital media. It's hard to call it a game, even in the more non-traditional indie sense. It really is an experiential piece of interactive art, with a delightfully rich, simple though avant-garde art style, an incredible sense of moody, mythical presence, and fantastically engaging dialogue. Play it if you want to experience a game unlike any other, and if you value story and character development over points and explosions.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliantly written and scripted absurdist magical realist adventure game. Not a lot of puzzles, but events spiral based on your responses and atmosphere drips from every line.",
            "review_score": "1"
        },
        {
            "review_text": "Unexplainable. Great.",
            "review_score": "1"
        },
        {
            "review_text": "I fullheartedly recommend this game to anyone who likes adventure or atmospheric games.  Beautiful game, immersive, enchanting, and a little strange. A lot of love was put into this game, and it shows. Runs extremely smoothly (even on my laptop's battery power). Could probably run just fine on a toaster. No bugs at all. Loved the art style.  Have you ever been driving on an empty road in the country, wondering what was just beyond that hill, just behind those trees? Perhaps something strange and wonderful just out of sight, waiting to be discovered.  I've heard a few people complain about lack of 'gameplay' in the traditional sense, and this IS partially true. This game is more about story, atmosphere, and who you are as a character than anything else. If you are looking for a point-and-click puzzle/ strategy/ whatever game, then this is probably not for you. This is an adventure game in its purest form. Whether that is positive or negative depends on your preference for games. IMO, I love atmospheric/story-driven/adventure games, so this was perfect for me.  A 5 star adventure game. Well worth the money.  (it also was voted as a top steam game by users during the 2014 holiday sale, which, incidentally, was how I discovered it.)  (I'd allocate a few hours (3-4?) for each act. You can stop and save at any time, but once you start playing an act, the hours are quickly wisked away.)  (also, it says I've only played 2 hrs, but I know that's not right. oh well.)",
            "review_score": "1"
        },
        {
            "review_text": "A really atmospheric point-and-click adventure. Captivating visuals, soundtrack, and storytelling. It's something you'd want to experience.",
            "review_score": "1"
        },
        {
            "review_text": "I usually hate on art games ... but this is smart and compelling ... cant wait for next installment!",
            "review_score": "1"
        },
        {
            "review_text": "A point-and-click adventure where you 'make your own story.' Beautiful vector visuals and a haunting soundtrack. Still a work in progress, but well worth your money if you want an engrossing journey into the strangereal world of KC0.",
            "review_score": "1"
        },
        {
            "review_text": "This game possess an ethereal, dreamlike quality which I can't entirely explain but absolutely love. It single handedly wins the 'games as art' arguement for me. I have no qualms about referring to this game as beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "Ammmmmmmmmmmmazing!!!  If you feel you fit into the following...  -Wanting something outside of the 'traditional' sort of gaming territory -Dig emphasis on atmospheric, mystery and all around oddness  -Are open minded about your gaming experiences -Enjoy a good narrative -Are not likely to be upset when a story or game element confuses you -Have a fondness for Twin Peak or most anything David Lynch-like -Like to read  This one is totally worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "Mysterious and packed with mystical-noir aesthetic, KRZ brings together all the right tools to give the player a mentally engaging, fun, and emotional gaming experience.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic fiction demonstrating true mastery of the technologies involved. I have never or read seen anything like it.",
            "review_score": "1"
        },
        {
            "review_text": "A really interesting game. Play if you're looking for something a bit 'different'",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty unique world. I have so many questions, so much curiosity",
            "review_score": "1"
        },
        {
            "review_text": "Magical realism in video game form. Never played a game that has affected me quite like this game does.",
            "review_score": "1"
        },
        {
            "review_text": "Because you simply can't find a game that tells such an immersive and interesting story of magical realism anywhere else on Steam",
            "review_score": "1"
        },
        {
            "review_text": "Theatrical storytelling in a creepy, interactive game. I'd recommend wearing headphones or surround sound for this one. You will feel immersed on a dark, lonely trip through the backwoods looking for a highway that supposedly doesn't exist. I can't wait for Acts 3, 4 and 5!",
            "review_score": "1"
        },
        {
            "review_text": "this is one of my personal favorite games of all time. it creates atomsphere amazingly and is beutiful in it's one right and you should buy it. granted it isn't a bf3 or a tf2 but it's so damn atmospheric",
            "review_score": "1"
        },
        {
            "review_text": "Really atmospheric and moving. Maybe a little artsy-fartsy for some, but for people into that I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "If you have ever had a vivid summer-sickness dream, then the febrile fog of Kentucky Route Zero will seem familiar, and the ambient sounds of a hot, humid summer night, downright comforting. There is nothing remotely creepy in the traditional 'scare me senseless' fashion in this game. But existentially and ontologically, the game is downright haunting. It is one of those games that follows you around for days,—not the pretzel-logic plot of the game, but the fabric and texture of it, and the deja vu the spare, yet lush, scenery evokes. Deja vu of what? I don't know ,(or more accurately, I don't remember) . . . .Kentucky Route Zero seems to inhabit the realim of parallel uniiverses and Zen koans. If you like Kairo, then it's highly likely that you will like KRO.",
            "review_score": "1"
        },
        {
            "review_text": "So erie and atmospheric. A great revival of text-based adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "This is a good game to play when it's 3am and you can't sleep.. mesmerizing, wonderful, kind of sad",
            "review_score": "1"
        },
        {
            "review_text": "2 edgey 4 me. No but really its hipster as hell and the storys pretty... edgey.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best-delivered stories I've seen in a long time, and easily the best atmosphere I have ever seen in a game. Probably one of my favorite games at the moment.  Buy this, but only if you don't mind more of an interactive novel than a game, and if you prefer to explore rather than being lead around.",
            "review_score": "1"
        },
        {
            "review_text": "This game takes you on a journey it's like your not even on earth",
            "review_score": "1"
        },
        {
            "review_text": "Super cool, choose your own adventure style game.",
            "review_score": "1"
        },
        {
            "review_text": "This is a point and click mystery adventure game with a really great and unique graphics style. The story line is interesting and drew me in immediately. It's kind of casual, but I don't mind.  If you're interested in a cool mystery story alongside some beautiful images, I would recommend this.",
            "review_score": "1"
        },
        {
            "review_text": "Mesmerizing, puzzling, and artsy. More like a dream than a story, in the best possible way; just a really unique experience. Only finished Act I and I already can't wait to see how the others end up.",
            "review_score": "1"
        },
        {
            "review_text": "Play this brilliant game. Now!",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful. Baffling. Disturbing. Unique. Enchanting. Frustrating. Linear without a clear path... I recommend this game while still not entirely knowing how I feel about it. How's that for a sell line?",
            "review_score": "1"
        },
        {
            "review_text": "This game (rather, the two chapters that are currently available) is incredibly linear. If that doesn't deter you, then you should definitely think about picking up one of the most fascinating point and click adventures i've ever played. The game is somewhere in between the Roadtrip/New Weird genres. Thats all i'm gonna say. If you want a game that'll keep you awake at night this is the one to play.",
            "review_score": "1"
        },
        {
            "review_text": "Kentucky Route Zero's mysterious storyline paired with it's whimsically unique art style and intriguing characters make this game a must buy for lovers of the classic genre of adventure games. The game is split into episodic stories (the first two already released) and I am eager for more.  The story itself reminds me of the podcast, 'Welcome to Nightvale' because of its quirky brush with the supernatural and the dark yet lighthearted characters.  I recommend this game wholeheartedly and wait with baited breath for the next few episodes.",
            "review_score": "1"
        },
        {
            "review_text": "Beautiful, but please be aware there is a lot of this which is text-based adventure. Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Great game. I never felt frustrated or lost, more like a choose your own story. Realaxing fun and funny.",
            "review_score": "1"
        },
        {
            "review_text": "Great atmosphere &amp; narrative techniques, lovely point and click title.",
            "review_score": "1"
        },
        {
            "review_text": "Weird, affecting, and beautiful. I played Acts 1 through 3 in one sitting, and can't wait to play the last two when they come out. This is one of those things that you'll think about for a long time -- not just because you want to play more, but because it captures you.",
            "review_score": "1"
        },
        {
            "review_text": "Surreal, amazing and downright fanstatic. What a player does is less important than who they are.",
            "review_score": "1"
        },
        {
            "review_text": "pelay a game what like sitting on the porch in your old kentucky home. well get ready to stop drop and roll cause IM ON FIRE. in this game you play as a fedex driver but riddle me this do oyu see the arrow? you can't unsee this classic experience give it a whirl and a twirl. some time. i don't even have any food inthe house and i just keep ordering 5 pizzas every dang day",
            "review_score": "1"
        },
        {
            "review_text": "This is a great little point and click exploration adventure. Well worth the time.",
            "review_score": "1"
        },
        {
            "review_text": "My favorite game of 2013. I wish they'd release another episode already, though.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game to try to get out of my comfort zone which lies in FPS games. It's very interesting and the gameplay and characters are good, but it feels very slow and gets pretty boring.",
            "review_score": "1"
        },
        {
            "review_text": "While the video game community is having heavy discussions about the rise of so called 'art games' KRZ will without a doubt add some more fuel to the fire. As an extremely atmospheric game that I can not describe any other way than 'point and click Dear Esther' I'm sure the camps on this one will be devided again. But I for one am amazed by how deep this game reaches and can strongly recommend it even though it's price may be a bit too steep for people to just try it out.",
            "review_score": "1"
        },
        {
            "review_text": "A delicious morsel of a game. brilliant atmosphere, slick interface, great story. I love it so far and I'm barely scratching the surface. If you like point and click adventures, spooky stories, or dogs in hats, get in here. Best played with the lights off and headphones on. And don't forget to open your eyes, especially in the dark.",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me feel this.. special tingle. I only get that feeling when I read a good book of short stories.  And the mood? Outstanding. It is so damn ODD. Makes me think of Neil Gaiman's American Gods. I know it's not a short story, but still. Wait, there's a short story with Shadow in Smoke and Mirrors, I think.. Or was it in some anthology? Anyway. Very nice. High five. Fistbump. Asspats and bear hugs. Third floor - Bears.   I'm halfway through the second chapter and it's not let me down so far. I will tell you how it was when I'm done.",
            "review_score": "1"
        },
        {
            "review_text": "To appreciate this game, you need to at least like the point and click adventure genre. Well, to be flatly honest, 'game' isn't quite right. I haven't encountered anything I'd consider a puzzle yet, or even a challenge really... but the experience and the art are more than enough to carry it.  It feels more like my imagination while reading a good book, but on the screen instead. I haven't experienced anything quite like it before, and with Act 2 just released, I have high expectations for the rest of the series. Here's hoping it can go the distance with later chapters.",
            "review_score": "1"
        },
        {
            "review_text": "An incredible, surreal experience with gorgeous visuals, solid writing and cold lonely highways.",
            "review_score": "1"
        },
        {
            "review_text": "The atmosphere, both visually and acoustically, is great. It's haunting and creepy, but not scary.",
            "review_score": "1"
        },
        {
            "review_text": "This strange little adventure game is hard to describe. Can you have art house games? If indeed you can, then this is certainly a candidate. The world needs more games like Kentucky Route Zero.",
            "review_score": "1"
        },
        {
            "review_text": "I really do not think the word 'game' applies to Kr0, it's something else entirely. A Fever dream you can walk around in, a campfire tale session between Proust and Lynch... anything but a game. Simply perfect, and it fills me with hope for what more might be possible to create on these boxes we spend so much time in front of.",
            "review_score": "1"
        },
        {
            "review_text": "KRZ is a huge ace in the hole for the whole 'games as art' argument and does a better job at blurring the lines between art, literature and interactive experience than anything I've played before. I have an interest in writing - I was ecstatic to find out that a major part of the game was almost 'writing' the characters as you went along through it's unique dialogue system. A phenomenal experience - though be warned, each episode seems to be taking an age to make, though the quality of what is provided (eventually) is never a question.",
            "review_score": "1"
        },
        {
            "review_text": "Can be a little tricky to figure out what to do next, but it's visually lovely and the music is pretty sweet.",
            "review_score": "1"
        },
        {
            "review_text": "please play this game then talk to me about it",
            "review_score": "1"
        },
        {
            "review_text": "After playing act 1: Visually very pleasing. A storyline equal parts wistfulness, whimsy and mystery. I recommend this to anyone looking for an interesting and thought-provoking diversion.",
            "review_score": "1"
        },
        {
            "review_text": "I hate point and clicks as a rule but KRZ is something special, not so much more a game than a story. A story that every time I read it, no matter how dog-eared the ages always makes me a little bit sad.",
            "review_score": "1"
        },
        {
            "review_text": "I am from Kentucky so I was pumped when I heard about this game as you could imagine. Even though point and click type of games aren't my cup of tea, I still had to buy it. I'm very glad I did because this game has had my attention since I started it. It has got a story like I have never seen before in a game and I love that about it! I'm excited to see what will go on next. I most certainly recommend this game!",
            "review_score": "1"
        },
        {
            "review_text": "Great game, although I use the term game loosely. Its more of an interactive novel and from what I can tell your decisions don't reflect any change in the game. However, the story is very intriguing and the entire game(well, the parts that have been released to this point) is just a masterpiece in its design and atmosphere. Being from Kentucky I had to have this game and it does not disappoint. Can't wait for the next chapter.",
            "review_score": "1"
        },
        {
            "review_text": "A new dimension of the adventure games. really like it!",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes when you're flying through space you end up meeting a robot. Sometimes that robot is wearing a dress and rides a motorcycle with another robot. Sometimes that robot plays the keytar and likes to sing in dive bars. Sometimes that robot knows the entire history and future of the world in which you live. Sometimes that robot is Lieutenant Commander Data. These scientificially observed facts are called Scalzi's laws of robotics. A robot can only be one of those four things. Kentucky Route Zero is a game that explores what it might mean for the laws of robotics to be slightly relaxed (not unlike how Star Trek slightly relaxes the intergalactic speed limit), allowing a robot to be multiple types of robot at the same time. That's right, in Kentucky Route Zero, Lieutenant Commander Data puts on a dress, picks up a keytar and plans your destiny from his dive bar. This is a wonderful game that really makes you think about the universe and doesn't contain any disturbing skeletons.",
            "review_score": "1"
        },
        {
            "review_text": "Picked this up largely on a whim, since its OST and visual design struck a chord with me, and everything about it has been above and beyond all expectations.  I went into it expecting a point-and-click with some nice art direction and relaxing ambient music. What I got was a enchanting piece of (semi-interactive) theatre filled with nuance and detail; a surreal world filled with intertwining stories and characters, each with something memorable to bring to the fore. Every time a new act has been released, it's been played at 2am with the lights off. I've just completely lost myself in it for a few hours at a time, and it's constantly been on my mind at some level since I first played it in 2013.  It's slow-paced and very much non-traditional - it doesn't feature much of the pixel-hunting and puzzle-solving you might expect from a typical adventure game - but the dialogue, worldbuilding, themes and atmosphere carry this game effortlessly. Even something as simple as the movement mechanics are constantly played with to make different sections of the story distinct. Exploration and uncovering the myriad secrets is heavily recommended.  Note that the final act has yet to be released, and if previous experience is any indication, it will be a long, long while before it is. However, said experience leaves me with no doubt that it will be worth the wait. If you do check it out, be sure to play the free 'Interval' content the developers have also produced. They add much to the mood and lore of the game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is surreal, innovative in terms of art and story, and very very different. There isn't a game I could possibly compare this to. You are actively developing your characters in the story, and what you choose to say ingame decides who your characters are and what you know about them. The art in this game is dark and creepy however it is not horror - its a perfect mix really. Music is used sparingly however when it is used, its used expertly. This game has a slow and paced feeling to it but it really doesn't take away from the game, it just adds a touch of reality as you explore the differently worlds in the game - reality, the characters, and otherwise.   This game is truly a gem in the gaming genre, its errie and player controlled sense of storytelling as well as its subtle hints of more gamplay make this game something special, I would reserve its gameplay for rainy days where you stay inside and feel kind of homely - thats the kind of feeling this game gives off and it does it excelletnly.  Update: It's been a very very long time since any content was added to the game, and for that reason I have to change my reccomendation to not reccomended. As of June 26th 2016, this game seems to be abandoned, which is really a shame since the story and gameplay in general were really amazing and original. I waited a very long time to be able to play the game all the way through in one go, but I honestly don't think this game will ever be finished. For now, save your money and spend it elsewhere.",
            "review_score": "-1"
        },
        {
            "review_text": "I don't know if Kentucky Route Zero will be entirely satisfactory. I think currently it gets lumped in with narrative focused games and while that's not entirely inaccurate it also reminds me of late night short foreign movies and performance art and those weird sometimes mesmerising, sometimes grating and repulsive works of art that tend to inspire some pretty strong but not very positive reactions.  I think this experience suited me, it wasn't what I expected but then it also wasn't like I had particular expectations beyond a certain kind of atmosphere and maybe some unique visual story telling tools.  There is a book called 'The Night Circus' by Erin Morgenstern and its greatest feature is the rich way it references all the senses in a room so often. The book took joy in evoking a moment and location and visual style, it adored whimsy and art and sumptuous beauty. It had an intriguing story and reasonably compelling characters but I believe it was the style of evoking scenes that made it either greatly loved or merely 'pretty good/okay' in people's eyes.  Something about that style of experience only appealing to certain people with the inclination for that kind of storytelling makes me think that KR0 is similar? Not in the style of storytelling but in its being not everyone's cup of tea. For some people it's going to make some dissapointing choices with plot and characters that are going to be difficult for them to feel satisfied by despite whatever tonal sense it makes.  I'm not saying 'people will cry if there's not happy ending' I guess I'm more saying I don't mind if there's no pay off for some things (good or bad) but other people will (not unreasonably) feel cheated or dissapointed if there is no pay off for what was their focus of the game.   The thing that brought me joy about this game may be different to what brings you joy.  Kentucky Route Zero is more of an open ended road trip. It reminds me of American Gods if they'd never made it to the climactic ending and had instead simply travelled onwards meeting the local deities. In Kentucky route zero you don't meet God's but everyday people kind of caught in 'moments', usually trapped by some kind of debt or poverty. Mostly you don't save people and you're pretty passive other then deciding when to stop and when to go. I'm ok with this though, something about the humid black atmostphere just kind of works for me.  You should check it out.",
            "review_score": "1"
        },
        {
            "review_text": "KRZ is a triumph of storytelling and aesthetics.   The game falls more on the “interactive fiction” side of the spectrum, as dialogue options serve more to set the tone than to affect outcomes. But this technique is where the game shines - you are allowed to sculpt the histories, intentions, and emotions of the characters. The prose is deft and economical, dancing between playful, philosophical, tender, and unsettling. The pacing is slow and methodical – think a Lynch film – which rewards patience with moments of serene beauty and oppressive sadness.  Aesthetically, the game is a slam dunk – gorgeous visuals, minimal design, creative camera work. The music is possibly my favorite part of the game, perfectly augmenting the scenes with a diverse sonic palette, ranging from ambient, musique concrete, bluegrass, and dream pop (whisperwave?).  Most impressively, KRZ is alludes to a wide variety of influences, yet somehow pieces them together into a cohesive world. The list is monstrous: southern-gothic fiction, theatrical set design, avant-garde visual art and film, field recordings, magical realism, early text-based adventure games, etc. Yet they are pieced together into a unique arrangement that is greater than the sum of its parts.  I think KRZ is a masterpiece.",
            "review_score": "1"
        },
        {
            "review_text": "beautiful graphics",
            "review_score": "1"
        }
    ]
}