{
    "app_id": 232090,
    "name": "Killing Floor 2",
    "release_date": "2016-11-18",
    "developer": [
        "Tripwire Interactive"
    ],
    "publisher": [
        "Tripwire Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 18,
    "categories": [
        "Single-player",
        "Multi-player",
        "Online Multi-Player",
        "Co-op",
        "Online Co-op",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Workshop",
        "In-App Purchases",
        "Valve Anti-Cheat enabled",
        "Includes level editor"
    ],
    "genres": [
        "Action"
    ],
    "tags": [
        "Zombies",
        "Co-op",
        "Gore"
    ],
    "achievements": 257,
    "positive_ratings": 60917,
    "negative_ratings": 8354,
    "price": 19.99,
    "description": "6-player co-op Zed-slaughtering mayhem. And now, 12-player Versus Survival mode, too - now you can BE the Zeds!",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/232090/header.jpg?t=1553570050",
    "minimum_requirements": "Requires a 64-bit processor and operating system OS: Win7 64-bit, Win8/8.1 64-bit Processor: Core 2 Duo E8200 2.66GHz or Phenom II X2 545 Memory: 3 GB RAM Graphics: GeForce GTS 250 or Radeon HD 4830 DirectX: Version 10 Network: Broadband Internet connection Storage: 60 GB available space Additional Notes: UNSUPPORTED HARDWARE: IntelHD Integrated Graphics Chips, 32-bit Operating Systems, NVIDIA ® FleX features require a GeForce ® GTX™ 770  or higher (GeForce ® GTX™ 980 recommended)",
    "recommended_requirements": "Requires a 64-bit processor and operating system OS: Windows 10 64-bit Processor: Core 2 Quad Q9550 2.83GHz or Phenom II X4 955 Memory: 4 GB RAM Graphics: GeForce GTX 560 or Radeon HD 6950 DirectX: Version 11 Network: Broadband Internet connection Storage: 100 GB available space Additional Notes: NVIDIA ® FleX features require a GeForce ® GTX™ 770  or higher (GeForce ® GTX™ 980 recommended)",
    "reviews": [
        {
            "review_text": "Killing Floor 1 was like a chocolate chip cookie.  Simple, enjoyable, and there was no end to how much you could enjoy it.  Killing Floor 2 is like 2 chocolate chip cookies.  There's more of it to enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "Now that Killing Floor 2 is FINALLY out, I can now finally say with absolute certainty, there are 5 things wrong with this game right off the bat.  1. Survivalist Class. What the hell is this? People could play how they wanted to before, are you shoehorning them into one class now? What can people do as their classes now? Are they not allowed to purchase any other weapon except their own class's designated weapon?  2. Another one of those games that is boring as hell to play alone and I can definitely say with all perks at 25, I hate this game solo.  3. The Versus mode is imbalanced and always will be. The ZEDs, no matter what you do to them, will always crush the other team because of the Bloats who can place mines everywhere, creating a camping problem and Gorefasts are force spawned on players way too frequently.   4. They replaced the datamined Martial Artist class for the Survivalist class. Why? The Berzerker could be based around attack speed and/or damage depending on your playstyle. Even using the parry ability to increase your attack speed or movement or what not. Don't make the Berzerker a tanky class like Martial Artist was meant to be. The Katana does not suit the Berzerker's style of play. It's very based on finesse and precision. Berzerker is not precise. End of.  5. Their communication with the fans/customers when they were doing this game was TERRIBLE. You expect them to actually fix stuff and/or listen to their customers to make the game better? No. What do they desire? Releasing the market on Early Access customers to see how much money they can milk on an idea that could have been stripped away in an instant, running away with the money. Do you desire to help a developer with risks like that? I wouldn't. I regret it too as I was thinking they were updating the gfx from KF1 and expanding on the idea, not... this...  4 things I like about the game.  1. It's fun being the Gunslinger, Berzerker, SWAT and Support classes. Dual wielding, meleeing up close, using the Kriss smg and shotgunning your way to victory is very satisfying.  2. Being a Scrake, Stalker, Husk and a Fleshpound is SO rewarding in versus. I would definitely recommend it.  3. Hate grinding? Want to experience the game at full potential? Go to perk training servers. You can soon see what the game is like without the long, strenuous grind on the same 3 maps that people play. It's like Counter Strike all over again with de_dust. It's not balanced or anything in terms of layout for versus, it's just because of people liking all the MLG garbage that comes from those maps. Why is this in the positive section? Well it's the positive. You can farm this annoying grind away, because let me tell you. The grind is irritable.  Do NOT get this game if you play a lot of games solo like me. They chose to release the market while it was still in early access. If you trust a shifty company like that that doesn't communicate with their customers properly, give this one a definite skip to tell them that you won't stand for shady practices.  DO NOT GET GAMES IN EARLY ACCESS! This is the first and last time I rely on a sequel of a good game to be just as good as the first. ALWAYS be paranoid everyone. Let them cater to YOU! You hold money. They don't, unless you give it to 'em. You have the power to make them better, you also have the power to make them worse.  Don't get this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Killing Floor 2 is a sequel to the popular and successful Killing Floor 1. Keep in mind that Killing Floor 2 is in early access and has yet to receive a full release. Many players from the previous title may know that some of the new features of Killing Floor 2 included sprinting and crosshair, which may come as a disappointment. While I personally do not believe this should be an issue at all for both veteran and new players, it does remove the aspect of having your knife out to run quicker.  About the  graphics  - there is no doubt that there is a big improvement. The game has updated graphics and textures which look significantly better than they did before.   There are 10  waves  and on the 11th wave you have to fight against a boss (either the Patriarch or Hans Volter for now). By the end of your tenth wave the map you’re surviving appears splattered in blood from each shot you make. It’s a good feature and definitely adds atmosphere to the chaos.   The first Killing Floor provided a selection of 7  perks . Killing Floor 2’s Early Access contains 9 perks for now - Berserker, Commando, Support, Field Medic, Demolitionist, Sharpshooter, Firebug, Gunslinger and the new perk Swat. Once the game reaches its full release it is rumoured that it will include 10 perks in total. Each perk has its own special skill which is unlocked at levels 5,10,15,20 and 25 and there are two options of which you can't choose your special skill.   The specimens  in Killing Floor 2 are a bit modified compared to Killing Floor 1. There are not many combos you can use for the insta - kill of the big zeds. I have seen one for the medic with his nades and I can't even call it a combo, more like a simple strategy and one for the firebug. So it is not very easy to kill Fleshpounds and Scrakes. The one thing I don't like is that if someone enrages the Scrake or the Fleshpound, they can attack anyone they want. So I find it really annoying to have them charging against me, without being prepared to kill them. Headshots here are essential, so try your best not to miss them.  I have a mixed feeling when it comes to  teamplay  . When the waves get harder in some of the cases everybody just runs around trying to save theirselves and it would be pure luck if you end the wave with your teammates being around you, because in some situations it is impossible to stay together. So it is best to count on yourself to finish the wave, alive.   There are not many  guns  added to this game, but hopefully new ones will be released soon.  More maps, weapons, game modes, removing classes imbalance, fixing teleporting zeds and concentrating on the game's development rather than adding cosmetics will definitely make more Killing Floor 2 players happy.   Overall I would not recommend this game to other people for now, because Tripwire have turned it into a casual game. You play 1-2 maps and everything is okay, but after that it gets deadly boring ... If I have to compare it with KF1 - a BIG lack of content. Sure it is an early access, but there aren't any signs of progress.  In the end after playing around 400 hours I came to the following conslusion: Killing Floor 2 - a game where disscussing other player's performance it is more important than the game itself. Enjoy.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed Killing Floor 1 quite a bit, and thus picked up KF2 fairly early in the Early Access process.  However, when a game studio clearly has a hard time creating and implementing new content, the decision to add PvP and microtransactions in lieu of improving the core gameplay loop is extremely dubious.",
            "review_score": "-1"
        },
        {
            "review_text": "I'll keep this as unbiased as possible.  Killing Floor 2 is the successful sequel to Killing Floor 1. The ZEDs are much scarier then their KF1 counter parts (and the Clot now has a sick as ♥♥♥♥ swag walk), the guns feel powerful and do some real damage thanks to the new M.E.A.T. system which allows you dig into the brains of a Fleshpounds with an AK12 and the characters all have unique voices now which, personally from my perspective, is a great thing because it opens up much wider varieties of humour then just 'WAAAANKARS!'.  However, development for the game is slow and while Tripwire are doing their best to make the perks feel strong and balanced while also preventing Fleshpounds from being nearly undestroyable there is one very obvious and glaring flaw for now.   Microtransactions in an unfinished game   Now I dunno why this even got past the suggestion phase, the game isn't complete, there are unfinished balancing issues to be addressed, gunslinger is still to be added to the game and work on Sharpshooter (which I'm interested in due to the fast paced nature of Killing Floor 2) is almost non-existant. Not only are we missing one of our core vanilla perks from Killing Floor 1 but the game is nowhere near finished in terms of balancing and perk weapons.  Now, this wouldn't be an issue if the game was finished and these items were offered in a DLC pack, these items are simply cosmetic and weapon skins that do not affect gameplay in any form but the reason this is such a bad thing is because it's preventing production and work  on things that need to be addressed in the game right now!   I listed this as negative purely because of how strong an impact microtransactions have on the gaming industry right now, microtransactions should  NOT  be a part of any game that you pay full price for, it's a gimmick for free-to-play games. Not paid products like Killing Floor 2 which is actually  far from finished.   I would love to make this a positive review and I had planned on writing a positive review for Killing Floor 2 but the fact they are also attempting to censor any form of backlash about their decision on the Tripwire Interactive forums has changed my mind. I will not say don't buy this game but I will say this with a heavy heart.   Buy with caution. ",
            "review_score": "-1"
        },
        {
            "review_text": "Game is now out and would be fun if it wasn't for the horrble lag I get all the time even with double digit ping.",
            "review_score": "-1"
        },
        {
            "review_text": "The reason why I started listen to metal music.",
            "review_score": "1"
        },
        {
            "review_text": "Very possibly the best feeling guns of 2016, which is something that needs its own award category.",
            "review_score": "1"
        },
        {
            "review_text": "Six bloody pikeys interfere with two scientists' work.  Love it so much, always having a good time playing it.",
            "review_score": "1"
        },
        {
            "review_text": "What the hell happened, Tripwire?  As a long time KF1 player, this game was so promising in the beginning, the gameplay was solid, the combat was hectic and satisfying, the guns were nothing short of amazing (Did they ever fix reloading both guns after firing a single shot with akimbo pistols? Literally the only complaint I can come up with). The graphics were equally impressive. And then it all fell apart.  Updates were slow. Fine, game development isn't an easy task, and is time-consuming to say the least, particularly when you're aiming to release a product at its best.  Then the microtransactions came. A system intended to maximize profit for literally zero effort beyond the initial implementation, and extremely minimal effort should they decide to actually add new 'content' to the system. For one thing, the timing couldn't have been worse with another well-known game screwing over their players by doing the exact same thing weeks prior. They still haven't fully recovered from that, and probably never will even with all of their damage control and making their crates free to open (though I'm fairly certain the trader crowd has happily moved in to replace the players they lost - ensuring the already terrible community will never recover).  I'll admit I was intrigued by the concept, but felt it would be out of place and would waste time and money to implement it... I am of course talking about the PvP mode. PvP was a mode that 'everybody' apparently wanted. I have no idea who 'everybody' is as I have not met or seen them yet. I suspect they're currently silver ranked in ('competitive' game here) and are playing that instead. I'm assuming it died about a month after release on account of being boring, repetitive and horribly unbalanced. I myself played it for about a day.  Oh and let's not forget the (Rushed? I don't know, but it literally brings nothing new to the game whatsoever) new perk. Because we weren't insulted enough with the delays, unwanted 'content' updates and questionable business practices already, right?  I want to like this game. At some point in time I did. Somewhere underneath it all there actually is a truly great game trying to break free of the things holding it down. Unfortunately it can't, and never will.",
            "review_score": "-1"
        },
        {
            "review_text": "More action, more perks, more gore, more dosh, better visuals, better animation, even better gunplay and no annoying hitboxes - a good example of the sequel that sticks to the old winning formula and adds some spice without trying to fix anything that was not broken",
            "review_score": "1"
        },
        {
            "review_text": "It's finally out, and surprisingly it didn't take the second Ice Age for that to happen. Good on you, Tripwire. So for this grand occasion I can finally update my review for what has changed and what hasn't. Is this fully released version now worth getting?  PROS: +Updated Graphics, and kudos on making the Skrake look more menacing +More Gore, makes it look like those over-the-top games people play inside games or TV shows. This is a good thing. +More Music, always a nice touch. +More perks (Though the Survivalist perk kinda makes all the others seem redundant, but that's just me)  NEGATIVES: -So you promised more zeds? I don't see any, unless you're talking about the two clot varients and Hans, which besides Hans is absolutly abyssmal. -You cannot host a server for friends in-game. Instead, you have to go OUTSIDE OF THE GAME and download+fiddle around with a program. How the hell do you mess up something that was in KF1? -Microtransactions, and on top of that CS:GO-style microtransactions. I don't need elaborate on why this is a bad thing. -New Fleshpound. Bigger isn't always better guys, now he just looks like a doofy weight-lifter with a blender on his hands. -Small, claustrophobic maps. Now, these are a good thing regularly, especially with a game like this. However, WHEN YOU HAVE _JUST_ SMALL MAPS IT'S A PROBLEM. -Design. Where did the grittiness from KF1 go? Ain't here, that's for sure. No-sir-ee-bob, just Future and metal. Weeeee. -New PvP gamemode. Why? Now you have to balance a game that is abotu PvE around it's PvP element. Where's the fun in that? (Although A for effort in trying to add a new game-mode) -Hey, remember how Bloats and Sirens were annoying but manageable in KF1? Those were the days, huh? Now Bloats are bullet-sponges and Sirens pack metal armor that just ping off your shots. So do Fleshpounds, but I'm giving them a pass for that making them more threatening than annoying like the other two. -KF2 has no charm. The only reason I remember KF2 is because it's the sequel to KF1 and that it's what taught me never to buy Early-Access games.  TL;DR: KF2 is inferior to KF1. Don't waste your money on this, buy KF1 instead.",
            "review_score": "-1"
        },
        {
            "review_text": "The hours of my gameplay says it all..  Just like killing floor 1 better weapons, better graphics, and MORE BLOOD!! Also dont get confused wiht the negative reviews on the game about it being microtransaction. ITS NOT. The money comes only for gun skins just like Counter strike global!  Pros lots of blood New monsters Offical servers play with 6.. Modded servers 100 players!! Better guns 2 bosses inlcuding hons and patriarch  Graphics amazing assets such as desk, tables, etc can get destroyed  Cons Most online ppl are dumb. Level 0-6s playing on the hardest mode. LIKE REALLY???",
            "review_score": "1"
        },
        {
            "review_text": "I'm having TONS of Fun in killing floor 2, The best part is there's still more updates coming by!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty looking game, has a few fun perks. Sadly fails to feel as exciting and fun as KF1 however.  Good if you like running around and killing things, with absurd looking cosmetics everwhere.",
            "review_score": "-1"
        },
        {
            "review_text": "Despite the meh survivalist update, it's hard to pretend that i don't enjoy the game. It's a proud successor of the first one and there's still a lot of potential and content coming up.",
            "review_score": "1"
        },
        {
            "review_text": "I don't buy early access games, but KF2 has been the exception.  Worth every single penny. Full review coming after release.  ===  Post release: Still worth every single penny, a must buy! Full review in the works",
            "review_score": "1"
        },
        {
            "review_text": "This game is so much fun to play with your mates. Something crazy happens every game and all the guns feel super cool. I would suggest this game to people who want a fast paced shooter to play with their friends.",
            "review_score": "1"
        },
        {
            "review_text": "I explored a Manor whilst my team died :)  M.E.A.T system looks great, fun gameplay, zeds are much more interesting, beautiful maps, tripwire did a good job at creating a 'new' kf, I do miss the zed specific achievements though.",
            "review_score": "1"
        },
        {
            "review_text": "Now having reached 400 hours in this game I would like to update my review.   Killing Floor 2 is a co-op shooter that requires communication and teamwork in order to get the job done. There are different wave systems, there is the short game which is only 4 waves, the medium which is 7 waves, and the long game which is 10 waves. There is also versus which allows you to play as the experiments rather than humans.  The Classes are as follows Berzerker(Melee) Commando(Assault Rifles) Support(Shotguns) Field Medic(Healing weapons) Demolitionist(Explosives) Firebug(Fire c:) Gunslinger(Dual Pistols) Sharpshooter(Rifles) Survivalist(Everything but not good at everything but not terrible at everything, but almost terrible cause they always die) Swat(Sub Machine Guns)   Overall since i've purched the game it has come very far. First starting it only had 4 perks and each of them were buggy and some of the things didn't even work. Now everything is fluid and well made. A lot of time has been invested in this game over its course from E.A. to full release a couple of months ago. Also I will dare to say that this is an improvement on the first Killing Floor. Sure it lacks the amount of maps and weapons but from what we've been told there is more to come from tripwire.   Now I am going to get into what I really like about this game.  -Classes: It's pretty useful because if you want to kill large zeds you are not just confined to a single class that can kill them, there are several different classes that can kill big zeds with ease, and several that can kill the small zeds also.  -Weapons: Now even though there may not be that many each weapon feels unique with its use, some are stronger than others while some shoot faster. Each one is used by a class (Unless you're playing surivalist) and while using them you can see how powerful the weapons can really be as you level up.  -Characters/Cosmetics: Now I know what you're saying 'MICROTRANSACTIONS??? COSMETICS??? NNNRRRAAAAAAHHHH' Calm down. These cosmetics in the game allows you to really show your personality with how many you can put on, whether you wanna look silly or completely serious they've got that handled for you, emotes will be added soon after the beta is over so we have to look forward to that too.   The characters are relatable to about any kind of person, whether you wanna be a french metal girl to a silly dutch dj that takes nothing seriously.   Now I said microtransations earlier, let me explain that. There are crate drops, drops happen about once every 24 hours, it can be a skin for your weapons, a cosmetic or even a crate. How you open these crates is the 'transaction' part. There are keys you can purchase for about $2.49 and they allow you to receive a random item that is listed in the crate. Personally I have found this to be quite lucrative as i've gotten plenty of rares and sold them for LOADSAMONEY.   -Maps: Theres only about 13 different maps to choose from, (12 if you don't include Zed landing because its in beta) Each map has a couple different areas where you can hold out for the entire game. Some spots are harder than others and some just make it too easy especially with a good team.  -Zed Variation: Whether you call them Zeds or Experiments, they've added a couple different Zeds to the mix. The standard lineup is from weakest to strongest, this is also taken from the current beta the game has, the enemies in brackets are enemies that are only in the beta, except for the Blue Alpha Clot, he is in both beta and base game but in the beta he is much stronger.   It goes: Cyst, Crawler, White Crawler, Alpha Clot, Slasher, Gorefast, Stalker, [Alpha Clot] Bloat, Siren, [GoreFiend] Husk, Scrake, Fleshpound, Dr. Hans Volter, and The Patriarch.  Not only do the enemies get progressively harder as you go up in difficulty ratings, but as more players join the match more spawn and they gain even more health and do more damage.  Now sadly I will have to tell you about the things I don't like about this game.  -Cop outs: What I really mean by this is my complete opinion and is not fact as of right now. There are two things that have been brought the the game, The survivalist perk which at its core is mediocre at everything instead of being an expect like the other classes, Instead of a new and different playstyle, T.W.I. has encouraged people to continue the trend of not using perk weapons with your perk and people getting upset as to why they aren't leveling up.   Another thing is the multi perk weapon system they've added in the beta. Allowing other classes to use more weapons is fun and all but its not fun when things become broken and exploits are easily accessable and to use. Such as the Commando's ability to use the Field Medic's Assault rifle. The rifle with the Commando has little to no recoil and the damage is off the charts. Able to decap a Scrake in half a magazine on Hell on Earth isn't what I consider fun, it somewhat ruins the difficulty of the game.  -Difficulty Jump: Understandably I love the current difficulties but for the masses the jump from hard to suicidal can be too much. Normal is really calm and if you're looking to just feel like an 80's action movie where you're practically godlike and you can rip your enemies heads off then thats your difficulty. If you wanna feel helpless then play Hell on Earth. Suicidal adds different animations then what you would see in Normal and Hard, not to mention there is much more health and damaged added.   I mean honestly there isn't that much I don't like about the game besides some of its players. But you get that with every game.  Overall if you like working in a team, like gore, oh man theres lots of gore. Having a unique playstyle and mastering a class then this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Good old fashioned zombie killing fun. Also met my best friend in this game lol",
            "review_score": "1"
        },
        {
            "review_text": "I bought a copy of Killing Floor 2 from Steam while it was still in Early Access. It was fun, at first. A garden variety bot safari with multiple playable classes and a decent few levels. But during what was supposed to have been a content update, Tripwire Interactive (the developers) decided they wanted everyone who played their game to host their microtransaction store. So they installed one on all of our computers without prior warning, without and opt-out, and after we'd paid full price. 1- Tripwire Interactive do not, have never, and will never have my permission to operate a branch of thier business on my private property. 2- My computer is my private property. Neither of these positions (labelled 1- and 2-) are in any way negotiable. I had been given plenty of reasons, from photographs to videos to firsthand experience, to believe that this game did not and would not involve microtransactions of any variety. **To this day (November 21st, 2016) we paying customers have had only two options - continue to play the game with the microtransaction store in place, or uninstall and remove a game we had already paid for. Many of us, myself included, have already spent far too many hours with the game to qualify for a refund under Valve's refund policy. This is absolutely not acceptable.** Under no circumstances would I advise anyone to buy a copy of Killing Floor 2, or any of the other games made by Tripwire Interactive.  **Edit: It is now (11/23/16) possible to get a refund if you've played Killing Floor 2 for very little or no time after its official release date. I've completed the refund process and confirm that, for at least the time being, a refund is available to those qualified. And so I withdraw my complaint about the lack of fair remedy.",
            "review_score": "-1"
        },
        {
            "review_text": "It gets repetetive really fast but it doesnt have the charm from the first one.  The trader/ character interactions are boring and they added microtransactions to add insult to injury.  Im happy I could refund it after they 'released' it.  Cant wait to do the same for DayZ or any other early access game I got",
            "review_score": "-1"
        },
        {
            "review_text": "So far its not bad. Currently needs more guns.  Also, still lacking the massacre of floors, something that was missing in Killing Floor 1...",
            "review_score": "1"
        },
        {
            "review_text": "Much better at it's final release. Guns have a real sense of power to them and the extra classes give's the game much more content than before. Excellently optimised for older/less powerful PC's.",
            "review_score": "1"
        },
        {
            "review_text": "Great sequel, the improvements in this game over the first Killing Floor are noticeable and all your favourite Zeds are back so you can blow their brains out all over again.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor 2 . Is probably one of the most Brutal,Gory and Fun games every in the Koop/Zombie Genre i really love to play it with my friends over hours and hours you cant just get enought killin them zed's. The Gore level is insane you can literally shoot their face apart one by one and i do really enjoy gore in GAMES. Its a bit harder then the First Killing floor and you have more to experience for example more Levels Guns,Ways to kill The Zed's look awesome and Creepy compared to Killing Floor '1' your bones will shake when you hear the damn  Fleshpound knockin on the door right beside you ....;( its just Awesome you should definitely check it out its TONS OF FUN!  --TL;DR-- .Its an Awesome Co-Op/Zombie Shooter .Lots of Gore and Ways to Kill .Lots of Guns which are fun to use and actually effective .Nice Graphics and Animations .Lots of Fun you should BUY IT :))",
            "review_score": "1"
        },
        {
            "review_text": "My favorite part of this game is the soundtrack. I am a huge metal guy and a big fan of Demon Hunter. The soundtrack is so perfect for shredding through zombies. The gameplay is so good! There are plenty of maps and zombies. The game is also updated a lot and new stuff is added all the time. The gore is fantastic. I highly recommend this game to anybody who loves metal and killin' zambies.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Would be viciously mauled by zeds again.",
            "review_score": "1"
        },
        {
            "review_text": "My very first review of a Steam game, so please forgive me if i forgot to mention something. Also this is a pretty long review so ignore it if you dont like reading too much. Here are my Pros and Cons:  Pros: -Insanely fun and addictive gameplay. -Zed Time (short slow motion period), makes the game so much better when you see all that gore in its splendour. -Different perks with different guns allowing you to have an overall team that can fill the weaknesses of each individual perk with the strengths of another. -Zeds getting gradually stronger every wave, allowing you to get powerful items to fight them, climaxing in a boss battle worth your time and money. -2 Bosses, each with individual strenghts and weaknesses that require a lot of teamplay and tactical preparation to defeat. -25 levels on each perk, with 2 options to improve your current perk being unlocked every 5 levels. -Being able to switch from one perk to another and configure your perks skills between waves, so that you dont start crying when someone from your team has to leave and ruins your team comp. -Good music that will put you in the mood for some brutal action. -Carefully designed official and community maps offering unique opportunities. -Different difficulties for new players to get the hang of the game and for hardcore veterans to satisfy their thirst for blood and dismemberment. -Different types of Zeds, each with different skills, strengths and weaknesses. -Many characters to choose from, each with his/her own jokes, remarks and battlecries. They can also be customised from top to bottom. -Active developer team and community, offering a variety of new content to keep you interested. -Fun boss and player character chatter, making this game less horror and more fun. -On higher difficulties some zeds have special attacks and powers, making the game much more challanging and volatile. -Great AI, very flexible, the zeds often try to outnumber you or sneak up behind and make your job harder, and they also try to find weaknesses in your position or comp and take advantage of them, sometimes succeeding and exterminating your team. -You can browse community servers or just let the game search for a server automatically based on your preferences. Also works while in a lobby.  Cons: -After a while it becomes repetitive. -Not as many guns in the game for now (i think 5-6 for each perk), adding to the repetitiveness until it becomes sort of a norm or monotony. -Leveling up your perks takes a while, and it may be rewarding at the end when you get to enjoy them but until then you're stuck killing on community made perk training maps or normal ones. -Some perks are unbalanced.  As you can see this game has a lot of good and a little bad, which can be improved and most likely will. Overall a great game. If you took the time reading this you should definitely buy it right now,",
            "review_score": "1"
        },
        {
            "review_text": "Shooting zombies is just so much fun! The waves never end its awesome!",
            "review_score": "1"
        },
        {
            "review_text": "Shooting zombies is just so much fun! The waves never end its awesome!",
            "review_score": "1"
        },
        {
            "review_text": "I give the award 'Best use of gore'. The shooty shooty is also great. =p",
            "review_score": "1"
        },
        {
            "review_text": "my medic sucks good game",
            "review_score": "1"
        },
        {
            "review_text": "Now that the game is finished, its worth a second look.",
            "review_score": "1"
        },
        {
            "review_text": "Best in the series",
            "review_score": "1"
        },
        {
            "review_text": "This franchiese has to be the most unique zombie game of all time. You can choose your own perk that fits your play style and you get different abilities as well when you level up. This game is fun when playing with others. Don't hesitate to buy it. Buy it. More content is coming.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor 2 feels really smooth and has very few bugs. It offers a wide variety of classes, guns and difficulties, coop or PVP. Very nicely animated gore, heads popping, slow motion and such. The only thing I don't really like is that it takes a long time to level up and will eventually get repetetive if you play it TOO MUCH.  Still, great game, easily worth 30 bucks.",
            "review_score": "1"
        },
        {
            "review_text": "Just Bought this. In my second game i've got kicked by a group of players for nothing. What a nice community.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually amazing and fun to play imo. What has killed my vibe on it lately though is I've lost all levels and XP of my perks and after doing some searching around, I see that the only solution is to ''resetstats'' of the perks in-game. What kind of ♥♥♥♥♥♥♥t is that? I now have to basically start all over with my Berserker? I now have to wait until I RE-LEVEL to be able to play Suicidal and HoE again? Like what a waste of previous time I spent level'ing it up the first time. Then who's to say the perks won't somehow lose all their levels again? Then what.. I reset perk stats once more? How many times must one level a perk to 25? Where is the compensation in all of this? Cbf re-grinding perks to 25 just for them to reset back to 0 AGAIN.. and have to repeat the process.",
            "review_score": "1"
        },
        {
            "review_text": "It would take far too long to explain how great this game is, but I will give a few examples. Example 1: Perks, perks, perks are new and improved with added perks from the last game and with specialized weapons for each Example 2: Graphics are honestly great, I put my graphics to medium and it still looked amazing. Example 3: Servers are constantly up. Just look at the previous game, killing floor and you'll see that the servers are still hosted by players themselves. Example 4: You'll never run out of things to do as you can always level up your perks and play on new maps and have new experiences. Final example: Everything is completely updated from killing floor 1! The only reason to buy killing floor over killing floor 2 would be to save a minute amount of money.",
            "review_score": "1"
        },
        {
            "review_text": "A great sequel to the award-winning floor painting simulator.",
            "review_score": "1"
        },
        {
            "review_text": "I have to stay they outdone themselves on this one, great gameplay, harder zombies, lots of blood. 5/5",
            "review_score": "1"
        },
        {
            "review_text": "Pretty Good sequel!!! ;D",
            "review_score": "1"
        },
        {
            "review_text": "Really good  If you loved the first one, you'll enjoy the 2nd one.  It's going to only get better with more content like the first one did when it launched.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor 2 is a great gore-fest action shooter that got me hooked for quite a few hours so far. What really shines is the amazing soundtrack that helps Zed-killing just that more badass than it already is. The classes each differ from the rest and really spawns the question, 'should i hack and disembowel my enemies with a Katana or should i just blow them to pieces with an AA12?'. The customisation is also a nice touch to the game which can really bring out how you'd like to differentiate your character from the rest. The only cons that are worth pointing out is the boss battle varieties (there's only 2) but they could be fixed with future updates. Overall, a really fun game that i would happily recommend to all the zombie slaying fanatics out there.  ",
            "review_score": "1"
        },
        {
            "review_text": "Frantic action, smooth gunplay, cineastic bullet time, a large arsenal of weapons ranging from pistols to RPG-7s and microwave guns as well as spot-on character/monster design make this 6 player coop game well worth its price!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would commit suicide again against the patriarch",
            "review_score": "1"
        },
        {
            "review_text": "I've been playing this game ever since it was first introduced to Early Acess on april last year, a lot has changed since then and so far I've been enjoying most of said changes. It's a ton of fun to play with friends and strangers alike even though it takes a lot of teamwork to beat the harder difficulties. You will die. A lot. It has tons of weapons (even more to come in future updates) and gore, and a reasonable variety of enemies to test them on. The only negative thing I must say is Tripwire sure takes their time releasing updates and I really hope that changes now that the game has been fully released on august 18th.",
            "review_score": "1"
        },
        {
            "review_text": "Too much blood and gore for fun",
            "review_score": "1"
        },
        {
            "review_text": "You take an awesome game, that is challenging and fun, polish it to the bones, make it really beautiful, listen to the community and shove much more features since the early access. There you have it! Killing Floor 2! An horror piece of art.",
            "review_score": "1"
        },
        {
            "review_text": "F2P tier skin practices. utterly ridiculous grind with laughably simplistic upgrade choices. completely pointless vs mode Nobody wanted. kiting is still king.  Twelve maps, and bloody four of them made by the community. Weapons are upgrades with about four exceptions being sidegrades. Irredeemable survivalist perk is an undisguised insult to player base.   on a more serious note - its a pity the decent gunplay, music and good animations / visuals dont make up for the flaws. i have been following kf since the mod beta release about a decade ago and seeing what became of it brings me no joy. oh well, another lesson learned about early acces and tripwire.",
            "review_score": "-1"
        },
        {
            "review_text": " Still no option to remove unnecessary camera animations/movements during reloads and others, still no option to turn off the pop up messages to heal myself when I'm fully aware the healkit exists , still no option to turn off the door closing messages etc, still no option to turn off all the visual and audio distortion nor the bloody screen effects, still uses the whitelist system which effectively prevents people from playing more than one server if they want to use mutators AND keep their levels (good job on keep the stupid level system that improves your stats AND linking it to your whitelist). Class balance is non-existent, half the classes are useless or only become worthwhile at higher perk levels. Zed movement is so fast and ridiculious it's very much impossible to get realiable headshots. Gunplay is still inferior to KF1 with less consistent recoil.  All in all inferior to KF1 in almost any aspect. Zeds having new attacks &amp; moves is an improvement. All of that  a year  18 months after the EA release. But hey they've got an intricate system of cosmetics to nickle and dime you! If that doesn't scream customer first I don't know what will.  Now nominated for the 'Biggest Early Access Trainwreck' award!",
            "review_score": "-1"
        },
        {
            "review_text": "Amazing game! Especially with friends",
            "review_score": "1"
        },
        {
            "review_text": "Absolute fun, a stunning and beautiful game with amazing physics detail. Also one of the most creative and realistic gore simulations I have ever seen in a game.",
            "review_score": "1"
        },
        {
            "review_text": "I've played Killing Floor in all its forms since it was just a mod for UT2004 and Killing Floor 2 with its updated graphics is addictive.  With the exception of the atrocius 'zedconomy'.",
            "review_score": "1"
        },
        {
            "review_text": "Fun and Gore. Definitely better with friends considering the overall difficulty of the game and the fact noobs still don't understand you can't just jump in an HoE match with no knowledge and lv. 0 perks.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor 2 is an excellent game for co-op survival.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a great casual romp of cooperative zombie slaying but has everything a more hardcore gamer would want if you are looking for an added challenge",
            "review_score": "1"
        },
        {
            "review_text": "It's probably the best gaming sequel I've ever played.  It's not Killing Floor 1 and it doesn't feel like it at all. It's like a completely different animal, but just as good. So much fun, so challenging and gives off a completely different thrill.   It looks amazing, it's fun and you can play it for ages. Great game  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Update: They've fixed a bit of the wave pacing so that only Hell on Earth and Suicidal have an excessive amount of Scrakes and Fleshpounds. Other than that shooting them in the face with a big enough gun still gets the job done.  5/7",
            "review_score": "1"
        },
        {
            "review_text": "Despite what a lot of the negative reviewers are saying, This game is still highly worth it for it's current pricetag, When it started in Early Access it was and will remain to be the most polished Early Access game I've ever played.   Literally all it was missing when it started was content, and they've added a good bit since then, It still needs more, but they're already planning on it, just like they did with KF1, That game got a ton of content updates over the years, so there's no real need worry that they won't do the same here aswell.   And I think a lot of the consumers here don't realize just how long a game takes to make, I ended up buying the game as soon as it came out in Early Access, and though it was very polished it was lacking content at the time, but I was completely willing to wait, And it's not like you wouldn't have other games to distract you and pass time while it gets worked on. Games take years to make, just because the Devs let us all enjoy a polished Early Access doesn't mean there wasn't problems we didn't see or gamebreaking bugs that could have been holding back development  The Devs spent thousands of hours of their lives to give us a sequel to a game we loved and it delivered in my opinion, It was a labor of love for them, so give them a break and enjoy the free content updates we're going to be getting who knows how many years into the future",
            "review_score": "1"
        },
        {
            "review_text": "Zombies , Gore, lots of weapons. really fun to play with friends . play it NOW !",
            "review_score": "1"
        },
        {
            "review_text": "Simply and by far the goriest and bloodiest game ive ever played. The gun handeling and feel is amazing, zed design is brilliant and intimidating. Easily my absolute favorite horde shooter.  BONUS: Enable full Nvidia flex, get a M79 and laugh as your GPU cries itself to sleep from the amount of blood &amp; bone fragments it has to render.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! VERY hard but rewarding! Perfect when your team is working together!!!   +Visuals +Challenging +GORE  -Being teamed up with trolls (Rare) -People running off lone wolf style",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing if you are borderline insane like i am and want to go on a mass killing spree :D",
            "review_score": "1"
        },
        {
            "review_text": "All around solid game. Tons of explosions and gore, what more do you need.",
            "review_score": "1"
        },
        {
            "review_text": "'giblets everywhere'-demo guy",
            "review_score": "1"
        },
        {
            "review_text": "If you played the first game, this is basically a graphical update with similar features. Nothing worng with that as they've aced it, The slow-mo never ceases to become a small relaxation period to rack up some headshots and kills.   9/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor 2 looks alot like Killing Floor 1. Brutal and action-packed co-op zombie shooter, but Killing Floor 2 has some good improvements. Every zed has got a special animation and special skills, the graphics are gorgeous, the sountrack really fits into the game, you got a few extra perks, every perk can specialise in different things and the game mechanics are nice. There's only one big difference in Killing Floor 2. The big difference is the style of killing the zeds, because Killing Floor 1 was alot more tactical. Killing Floor 2 is based on speed &amp; high damage.  If you want to buy a good game i would recommend Killing Floor 2. It's overal a 'improved' version of Killing Floor 1 and it's great for gaming with friends!",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor 2 is a game i really enjoy playing. I have played Killing Floor 1 to an certain extend, about 60 h, but i never got to the difficulties Suicidal and Hell on Earth. So i can not compare the 'late game' experience of these two games and i will not compare Killing Floor 2 with its predecessor. KF2 is an intriguing game, which can delivier an horrifying experience, atleast the first hours, where you are learing the game and emerging yourself in the apocalyptic France filled with    Terror and    ZEDs. Of course after 100h of play the horrific experience loses itself, which is normal and not the fault of the game, because you just know the game through and through. The games graphic is goregeous    pun intended   . The difficulty rise from Hard to Suicidal is pretty rough, which is a very good thing, so you still have a challange after hundreds of playtime. For Suicidal and Hell on Earth you either need very good individual players or a group of friends who also should bring a certain level of expertise. KF2 is a good balanced game, and they try to adjust every class and ZEDs after every update or the developing team sees that something is too strong or too weak. hint firebug hint  The only negative thing for me is the loading time on the first start. It takes for me about 3-4 minutes (KF2 is not installed on my SSD so it might be shorter if it would be).  KF2 is all in all a great game and I can only recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Killing floor 2, just absolutely a awesome coop game. I like it. played Kf1 for around 1000 hours. and this game not so much. but its good",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun game I recomend listening to the metal gear soundtrack, playing as beserker and going ham on anything that moves (or doesn't).",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS i havr ever played and best zombie game i ever played",
            "review_score": "1"
        },
        {
            "review_text": "It's absolutely Positilvely worth it!",
            "review_score": "1"
        },
        {
            "review_text": "  Plain and simple fun, great to play with friends and the pvp is pretty great too",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  Entertaining Gameplay is smooth plenty of perks/guns Multiple characters  Cons: Small community ",
            "review_score": "1"
        },
        {
            "review_text": "Gory and with epic music fitting the action, a bit like Doom then. ^^  This game looks good and makes you feel like a badass when you do something epic, like managing to decapitate a scrake (big guy with a chainsaw) in the middle of an attack with an rpg at almost point blank. A good choice if you like dismembering zeds.  Also, not sure about the killing part, but you can definitely shoot the floor.",
            "review_score": "1"
        },
        {
            "review_text": "This game helps me through psychotic outbreaks",
            "review_score": "1"
        },
        {
            "review_text": "I wanted a badge so I wrote this review",
            "review_score": "1"
        },
        {
            "review_text": "playing this game and the original is a pretty good way to get better at other games like csgo. you could consider it as a fps trainer.  but its also a great game on its own. well an awesome game.",
            "review_score": "1"
        },
        {
            "review_text": "The most non-toxic community I've ever played in. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. highly recommend for coop with friends.",
            "review_score": "1"
        },
        {
            "review_text": "KF2, a game which you can boot up every once a while and have a godamn good time with it. Especially with friends but even with complete strangers it is a lot of fun if your team works together.   If you like Zombie-Games, especially CoD Zombies or L4D2 this might be the ideal game for you. Some people like it for a enjoyable and satisfying game in between times but there is a dedicated community around which is addicted to it and invest more than 100 hours into this. And there is a reason for that. Especially on higher difficulties and a cup of motivation this can get very addicting.   Good job, Tripwire! I'm sure this game will blossom. Especially with all the free content that will come! A no-brainer!",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty awesome game. The only problem I have is that once I press play the little mini screen pops up saying Killer floor 2 obviously. But than after that it takes like a minute or 2 for it to finally get to the game. It is a bit annoying but it doesn't ruin it at all for me. That's my only problem. Everything else is completely awesome. I fully recommend you get this game. (9/10) I would give it a perfect 10 but like I said there is that problem and also I wish there was an option in the game where you could just set the waves to unlimited.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game for anyone who loves a fun and especially bloody game! Has plenty of weapons and perks to keep anyone interested for a long time for sure worth every penny!",
            "review_score": "1"
        },
        {
            "review_text": "If you have friends and want to shoot,blow up,slash, torch zombies then this game is for you",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Coop game, highly recommend. Great Fun.",
            "review_score": "1"
        },
        {
            "review_text": "Gore Galore! 10/10 would smash your head again.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game!  Lots of fun both in multi and solo modes. ",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun period",
            "review_score": "1"
        },
        {
            "review_text": "You looking for blood, craving some guts, with a side of slow mo brains..? Well, you were... until you found KILLING FLOOR 2, the ultimate mutant slaying, gut launching, limb decapitating game ever!!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun to play coop with 5 other players. Love to see more future updates with more perk weapons",
            "review_score": "1"
        },
        {
            "review_text": "best game ive played in a long time",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, played the hell out of KF1 and even with the crates 'Issue' that you can easily ignore, this game is better in every way.  Lots of classes, lots of gore, and challenging 6 man co-op.  Play this every friday with my friends. Must play in our rotation.  Well worth full price, better if on sale.    ",
            "review_score": "1"
        },
        {
            "review_text": "Ahhh i give it 10 out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Gore, Metal, and Zeds what do you want more.",
            "review_score": "1"
        },
        {
            "review_text": "Gore, Metal, and Zeds what do you want more.",
            "review_score": "1"
        },
        {
            "review_text": "Nominated for The “Villain Most In Need Of A Hug” Award.",
            "review_score": "1"
        },
        {
            "review_text": "Its like Black Ops zombies, l4d2 and borderlands had a baby. Satisfyingly pop zombies' heads together with your friends :D",
            "review_score": "1"
        },
        {
            "review_text": "vury fun indeed reccommend i will",
            "review_score": "1"
        },
        {
            "review_text": "Best zombie Survival game ever,challenging,Much gore,Such co-op :v",
            "review_score": "1"
        },
        {
            "review_text": "I loved killing floor. Then I got to have that feeling all over again with killing floor 2. I get to kill stuff, personalize my characters, and try different classes. Long story short this game makes this boy happy.",
            "review_score": "1"
        },
        {
            "review_text": "The R day was here, and it wasnt what i was expecting still lots of things you need to work on.",
            "review_score": "-1"
        },
        {
            "review_text": "Just like Killing Floor 1...... MOST SATISFYING GUN PLAY of any game I've ever played.   PROS: Weapons have a punch to them and the feedback from enemies is great.   New Unreal engine makes for some breathtaking levels and graphics.   New Perks and gear are fun and you always have something to level up and grind for.  CONS: My only con is there's only 2 bosses and wave based survival gets tiresome quickly for me.  OVERALL: This is one game that will have a permanent spot on my hardrive for a quick 'jump in for a map or two' for the next few years. As far as gunplay goes nothing in my library can compete.",
            "review_score": "1"
        },
        {
            "review_text": "So a few years ago, my friends told me to purchase a little game called Killing Floor. I had an absolute blast with it, from the characters cheesy dialouge, the variaty of zeds, and the huge arsenal and number of classes. The game was definelty work every penny. A few months of KF, I see in one of the in game adds that Tripwire was working on a Killing Floor 2. Needless to say I got really excited. A bit later the early access version came to Steam, and I instantly purchased it. Even with the little content that they had, which was to be expected since it just came out of alpha, I still had a blast with it. I saw this game grow with the constant updates that Tripwire released, Incenerate n' Detonate, Return of the Patriarch, Bulls-eye. and Tactical Response. And with the full release out, I can wholeheartedly say that if you ever had interest in buying this game, you should drop that money into this game and get it. TW still has pleanty of stuff to do with the game in terms of updates; more weapons, new zed, new boss, seasonal content (please bring back the hillbillies TW, that was great). 10 perks, each with 25 levels, 4 levels of difficulty, several official maps with many more community made maps, lots of fun guns to play with, you will be playing for a while. And if you're into costumizablity of characters, they've got that too with the Zed-conomy feature and daily game rewards, I just wish they would lower the price of keys to open chests and usbs, but oh well. Without a doubt, I can say this is probably my favorite game to play with my friends in my library atm, and I look forward for it to grow. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "it's ok",
            "review_score": "1"
        },
        {
            "review_text": "  Great game, Nice guns, alot of guns and heaps of zeds  all i have to say  10/10",
            "review_score": "1"
        },
        {
            "review_text": "the gore system is kawl",
            "review_score": "1"
        },
        {
            "review_text": "I CANT OPEN IT ON TODAY 24 MAY 2015(i have to change pc) IT CRASH LONG LOADING LAG AS HECK BUT STILL FUN TO PLAY NOT RECOMMED FOR POOP PC",
            "review_score": "-1"
        },
        {
            "review_text": "Naked men massacre simulator, with occasional guest apperances by naked women.",
            "review_score": "1"
        },
        {
            "review_text": "Do you want dosh? Do you wanna kill zeds? Do you like shennanigans? Then this is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "A great game, good shooting mechanics, fun slow motion mechanic. But needs more than 2 bosses. After playing a few matches the bosses seem a little... Not special (if that makes any sense). The magic when fighting the boss kinda fades when you fight the Patriarch 3 times in a row.",
            "review_score": "1"
        },
        {
            "review_text": "Naked men massacre simulator, with occasional guest apperances by naked women.",
            "review_score": "1"
        },
        {
            "review_text": "One of the most intense, tingle-inducing, exciting zombie killing games I've ever played.  I actually that back; it is most certainly the most intense and exciting zombie killing game I've ever played.",
            "review_score": "1"
        },
        {
            "review_text": "A lot of fun to blow off some Zed heads. I would give it 3 and a half stars outta 5 because there are only two bosses, both of which are challenging yes, but are more monatonous and irritating than anything. To rate it higher I think an option to turn off the boss wave would be splendid, because the two bosses get boring, but the maps do not. All maps are fun to play on and there are even community maps. Also, being a survival horde based shooter, why can't rounds be set to infinite???? This is a really fun game to play for an hour maybe two, but after those you find yourself bored from 10 boss fights with the same two bosses.",
            "review_score": "1"
        },
        {
            "review_text": "The game's really good, but I hope they add 'private' server system in the game. It's hard to open your own server.",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game for coop!",
            "review_score": "1"
        },
        {
            "review_text": "It was lacking in content at launch, but now that we have more perks, more maps, and more weapons, this is a worthy successor to the first Killing Floor. The guns feel top-notch. The graphics are amazing. The game is well optimized. On Suicidal and Hell on Earth difficulty the game provides a challenging and heart-pounding experience, in a way that few other games do. If you're looking for co-op horde survival action, look no further.",
            "review_score": "1"
        },
        {
            "review_text": "awesome game reminds me of left 4 dead",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing.  This was one of the first titles I purchased for my new PC and it is gorgeous. The characters are very broad ranged and the gore is GLORIOUS. Absolutely recommend if you love survival wave based games or just high quality games in general.",
            "review_score": "1"
        },
        {
            "review_text": "Killing floor 2 fail to launch anyone know how to fix this problem??? need help urgent",
            "review_score": "1"
        },
        {
            "review_text": "So i play as medic in games and this game. well lets just say its a junkies haven. you put heroin in your arm more then that bum under the highway. really makes u think about life    ♥♥♥♥ 8/10",
            "review_score": "1"
        },
        {
            "review_text": "So i play as medic in games and this game. well lets just say its a junkies haven. you put heroin in your arm more then that bum under the highway. really makes u think about life    ♥♥♥♥ 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Through the ♥♥♥♥ 17 FPS I get, this game is still addictive.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor 2 is a very fun game that just needs a little polishing. The guns feel satisfying, it's the perfect game to relax without having to think and is a ton of fun with friends. The community is generally very nice towards new players and often offer advice on how to play, and the game is only getting more popular since it's release. More weapons and maps will be added down the road and the devs are already working on new content. This game taught me how to be a jihadist.",
            "review_score": "1"
        },
        {
            "review_text": "An impressive sequel to the original, Killing Floor 2 retains the tight gameplay of the original while adding plenty more to play with. This game shows that art direction, attention to animation, and proper usage of colors are are much more appealing visually than running a game on the newest cutting edge engine. Runs great at 144 FPS and has enough graphical options to run smoothly for just about anyone. If it gets the long term support that the original game had, this will easily be one of the must have games for at least the next few years. Only real complaint is my own grievance with randomized/slot machine style cosmetics. While they do not affect the gameplay, I would much rather they just offer all of the skins and other cosmetic items as DLC instead of keeping some items locked behind roll of the dice loot boxes that require money to unlock. If these cosmetics ever start to influence the gameplay this review could easily change but at the moment the game is almost flawless in executing what it set out to do.",
            "review_score": "1"
        },
        {
            "review_text": "Just like Killing Floor 1, a game where you shoot zeds with guns that feel very satisfying to use.  Updated graphics and some changes in the gameplay, some good, some not so good.  At the end of the day, it is still a very fun and entertaining game to play.",
            "review_score": "1"
        },
        {
            "review_text": "Rewriting this review to fit more recent circumstances revolving the game, I still recommend it and will have to say it is a great game but there are many issues with the game especially knowing its full released. It has only 4 weapons for most of the classes which should've and still should be expanded onto. They have been slow with releasing updates since the beginning and now i think they will be even more slow paced with updates. Here is a list of some pros/cons.  Pros; -Great sequel from KF1 with better graphics and improved mechanics -Perks are fun to play (for the most part) -Each wave is action packed keeping you in exciting combat for the most of the time -Not many game breaking glitches (Only ones ive noticed recently have been easily worked around) -Enemies gain new abilities if in higher difficulty making it   Cons; -Weapon skin system identical to CSGO was introduced almost instantly in early access -Updates are uncommon and sometimes don't add much -Although the weapons we have are great we need more weapons to make variety -I believe we can expect most future things to be in a DLC after the Survivalist perk gets added",
            "review_score": "1"
        },
        {
            "review_text": "I was a bit skeptical about this game, and then I played it.... SO GOOD! I'm hooked.",
            "review_score": "1"
        },
        {
            "review_text": "Game with big Fun Factor. Very hard to beat on higher difficulties. You gotta work as a Team to get the Job done. Never getting boring every single Round you play is different according to all the rounds before. Maps are made with a lot of Detail and look very good.",
            "review_score": "1"
        },
        {
            "review_text": "Love this game",
            "review_score": "1"
        },
        {
            "review_text": "I played the game in EarlyAccess when things we re a bit meh ,but right now the game is just 'Waw/great/amazinG'. 'GreatJob' TripWire.The game is fully optimmised and the survivalist perk a total CracK",
            "review_score": "1"
        },
        {
            "review_text": "very good game im very impressed by it i bought it for myself and my buddy now im probly buying it for my other buddy im using a 10 year old computer running with the best graphics and its going fine freezing parts here and there but i honestly think its my computer having issues with the game but im just to into the graphics to turn them down and im talking old to the point im still using windows vista and my internet broszer dont work internet explor. google chrom . firefox. even ♥♥♥♥ing safari only thing that works in steam broszer so great game",
            "review_score": "1"
        },
        {
            "review_text": "A horde-style zombie survival game. I purchased this when it was in early access and was pretty dissapointed in the lack of conctent and slow development, but i think it was worth it in the end.   You have to survive a specific amount of waves depending on what game length you choose. You can do this solo with a reduced amount of zeds (zombies) or play co-op with up to 6 people online.  There are 10 perks to choose from, every one using different types of weapons and grenades. The most interesting ones are the firebug, who uses flamethrowers and incendiary weapons, the berserker, who uses sledgehammers and katanas, and the gunslinger, who dual wields pistols and revolvers. Apart from that there are many weapon types. Rifles, Smg's, rocket launchers, shotguns, sniper rifles, etc.  As you play with your chosen perk, you level up and gain bonuses. Bonuses include: increased perk weapon damage, health boosts, berserkers can gain back health with every kill, commandos can see enemies health bars, medics can increase their healing, and so on. Every perk is best at dealing with a specific type of zed, and you a balanced team if you want to win at the harder difficulties.   Killing Floor 2 feels very good to play, all the guns feel satisfying to use, the metal soundtrack is great with lots of licensed songs, and the visuals are impressive, and run without any hitches even on my older PC.   Killing Floor 2 also has visual customization in form of microtransactions. You have weapon skins, clothing and visual accessories for your character. These are completely cosmetic and dont affect your stats in any way, and you can get a free item every day, even rare ones that you can sell on the market.  Overall Killing Floor 2 is great, has lots of replay value, is very challenging and is a blast to play with good teammates.",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor 2 is a fun game to play if your bored or just looking for a fun time. Playing with friends is an amazing experiance and gameplay could be more complex, as if right now you could just sprint around the map and shoot and win which is a little reptitive but i still would recommend this game to any one who likes fps genres.",
            "review_score": "1"
        },
        {
            "review_text": "I like Killing Floor 2, this is amazing cooperative game. Its always cool to survive together with friends) +++",
            "review_score": "1"
        },
        {
            "review_text": "It is one of my favourite game franchise. Severed limbs, seas of blood, perks фтв brutal guns, ... Groovy!  P. S. And there is skins... as everywhere...  10 flashpounds of 10",
            "review_score": "1"
        },
        {
            "review_text": "When I would recruit friends to play the original Killing Floor with me, I would describe it as 'Left for Dead, but better.' It had the same engaging action, hilarious gore, and rewarding weapon mechanics, while adding a progression system and perks that allowed teammates to cater their play to their own style.  Killing Floor 2 ups the ante on all the features that made its predecessor great. There are more perks, a revamped XP system, and thanks to the new unlockable perk skills, there are more ways than ever to play KF. It's a beautiful experience all the way through, with visually stunning and meticulously detailed new maps, redesigned weapon animations, and a cutting-edge gibbing system. Each kill is more rewarding, but more difficult too: the zeds now have the ability to protect themselves and respond to your attacks.  By far the biggest con is that Killing Floor could run on a toaster plugged into a CRT television, but KF2 is much more demanding on your hardware, especially with all of Nvidia's built-in new high-end antialiasing and physics options turned on. Don't expect to be able to play this game on the computer your grandfather uses to look at pictures of warships.  Killing Floor 2 has become the new perfect game to play when you want to kill time with your friends, but don't have the energy to focus on a competitive shooter, like Counter Strike, and don't want to get bored to death playing Civ for seven straight hours. All you need is a system with some brawn and an insatiable desire to emancipate Zed organs from Zed bodies.",
            "review_score": "1"
        },
        {
            "review_text": "Very funny and bloody Co-op Survival Game against mutated Zeds. I recommend everyone to play this game if you like to get attacked by hot naked dudes without genitals which are throwing their intestines and bodyparts at you when you shoot them. This game is literally build on brutality and gore.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game, better playing with friends.",
            "review_score": "1"
        },
        {
            "review_text": "The patriach just need a hug. 1 like = 1 like #zedsoutforpatriarch",
            "review_score": "1"
        },
        {
            "review_text": "Ignore Haters. Gain Currency. Buy Guns with said Currency. Shoot Thing With said Guns. Rain Currency upon said things corpse.  What a wonderful world we live in.",
            "review_score": "1"
        },
        {
            "review_text": "This game contains enough blood to feed Dracula for a century",
            "review_score": "1"
        },
        {
            "review_text": "Killing floor 2 follows the same great tradition as the first game. Essentially, you play up to 10 rounds in an increasingly difficult wave-based arena over a series of maps ranging from simple to intermediate levels of complexity.   If you didn't hate that summary, read on.  What I love about this game is that there are very few griefers. In fact there are measures to allow a group of people to deal with that and bans get thrown around when people are being ♥♥♥♥♥.   In terms of game quality, it's first rate. The game looks great, it plays with a very solid frame rate, and it has very few bugs that I don't see people appreciate often enough. Play a game for long enough, you'll find bugs, trust me.  Balance. Can we talk Balance? Taking a lot of ideas from the first game, many of the same classes made their way back and the balance quality (I think) is very much still here. It's rare to find a game this well balanced. At the end of the day, whatever class you choose, you'll have to really bring it at the higher difficulties, and those high difficulties are required if you want to level your characters at a decent rate. (The higher difficulty levels give xp modifiers).  Enemies are designed with love and care and they crunch and explode satisfyingly.   What don't I like? After you level 2 or 3 characters, the game does begin to feel a bit repetitive. You'll need to take little breaks here and there to get it to feel fresh again. This isn't a knock on this particular game, all games feel repetitive after you grind for a while.  The potential here, of course, is to offer more game modes. At the moment there's just one: Survival. In the first killing floor they had mission based stuff, and I suspect those game modes are coming soon.  As a counter point to my negative critisism, you should know that TRIPWIRE have ALWAYs been very good at supporting their games and offering FREE updates twice or three times a year. If they continue in that vien, I know I'll be playing this for many years to come.",
            "review_score": "1"
        },
        {
            "review_text": "I gotta pee really bad so I need to cut this review short.",
            "review_score": "1"
        },
        {
            "review_text": "oh hells yes.  Tight combat, great team-based gameplay and tons of chaotic zombie murdering mayhem.  They animated this game in 240 fps just for the slow down zed-time effects... epic!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 would throw dosh again",
            "review_score": "1"
        },
        {
            "review_text": "  Tighter than a duck's a$$hole.",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE: As of official game launch and Survivalist release: New enemy tactics such as blocking and evading, some have new abilities, and changes to behavior as well as player icons so you can see where teammates are as well as the last ~3 zeds of the wave so you can find out if it's despawning constantly or a teammate is kiting it around to troll the team. Team trolling is still out of control for some with the vote kick being abused on public servers.   It's faster paced than the previous title with a few tweaks to how zeds attack you. Pros: -More head bob as well as full body movement on a few zeds -No more secondary perk locked exp requirements. Perks now only gain a small bonus exp for doing those things. -You don't have to fight over exp as much compared to KF1. You only need to tag a zed to get exp so even if they are decapitated by a teammate. But exp is tied to perk weapons just like KF1 except for Survivalist where they can use any weapon to gain exp. EG: Berserkers using a magnum or deagle for crawlers will only get exp for gunslinger perk for those kills unless you had melee'd them somewhere before they die, then the exp will be split among them. -On top of perk bonuses, you get to choose an ability every 5 levels from 5-20. On a few classes, they're kind of useless though. -All classes spawn with a base weapon for their perk so you don't have to run around with just a pistol and knife. -Combined chainsaw with buzzsaw crossbow for berserkers. -Two different bosses to fight. They also take different amounts of damage depending on where you hit them: body/core, head, arms, and legs and what type of damage -Zeds can still fight each other although it doesn't happen as much it did in KF. -Gun butting/stab/thrust depending on what weapon you're holding at the moment so you can escape a clot's grasp when your gun runs out of rounds between mags, bash the head, to stumble a zed and get 1-2 seconds of breathing room or to save a teammate. -Sprinting. -Parry and block, all classes can only do this with a melee weapon (Eviscerator will allow you to block too). -Different grenades for classes.  Cons -Long start up time and depending on your computer, load in time too. -The knock down and stumbling have a cooldown still but they need to be built up to trigger now. -FPs rage function changed, they will rage after a certain time has gone by even if you're out of vision. -Leveling up does not grant discounts of on-perk weapons. -Kiting around the map does not work anymore up to a point, mobs will 'teleport/respawn' behind the closest corner if they can not see you, the team, or the team does not have vision of them minus stalker and Patriarch cloak. -Firebug burn no longer applies a -movement% to crisped zeds -Invisible walls still exist; only certain cars, boxes, rocks, and rails can be jumped on/over. -Background noise/music that isn't part of the music you can shut off. Atleast two maps has zeds in the background that will make noise so it might make things a little difficult for people that like to depend on hearing to play if they choose to hold out in those areas. -You can no longer outrun the bosses forever, they will catch up eventually even on perks with increased movement speed.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ me in the ♥♥♥ ♥♥♥♥ this game xd lmao",
            "review_score": "-1"
        },
        {
            "review_text": "Absolute mess of a game.  Missing features, bugs out the ♥♥♥, micro-transactions before the game was even close to being finished, shoddy design, characters lost all charm and uniqueness, it's now more of a bland and boring 'zombie shooter' with no updates.  By all means, if you got friends to play this game with, go right ahead for £5 / $8, otherwise, steer clear for another few years because this game is NOT finished.",
            "review_score": "-1"
        },
        {
            "review_text": "Boobs. Can confirm. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Look at my hours   The game has came a long way since its original release back in april of 2015. Tripwire HAS done things that the community is not proud of and has done things that seem rediculous at times, but what people tend to forget is that Tripwire tries their best to test new ideas. That was the main reason why the game launched into early access, to test new ideas and recieve community feedback.  The actual game is amazing. New weapons and perks have been added over the year and a half and each brings something unique. The weapons are ultra realistic being animated in over 200 fps so that the zed killing is made to give the most realistic weapon system on the market. Weapons range from melee weapons like a shovel for Berzerker to a high military grade electromagnetic rail gun for Sharpshooter. The maps are both Tripwire official and community made. There are about 12 maps to play from as of Novermber 18 (release day) and each have their own unique enviorment to cover in blood. And, tripwire have already announced another content update in about a month with a new weapon, new zed, and a new map (that's what's been confirmed so far but there may be more).  You can play from solo by yourself or grab a few friend or even random players and slaughter your way to victory to kill the patriarch or Hans volter. There are 4 difficulties; normal, hard, suicidal, and hell on earth. when you increase the difficulty, your enemies will not only have more health, they come in larger groups, dodge your attacks, run faster, and you earn less dosh (money). This sytem of difficulties makes the game feel more tactical as a shooter, instead of the enemies being sponges. Each perk has a specific role in the game such as slowing down enemies, crowd control, or just plain out taking out large zeds. Each perk as well has a specific set of weapons to play with, berzerker=melee, commando=assault rifles, support=shotguns, firebug=fire, Medic=medic weapons, demolitionist=explosives, gunslinger=heavy pistols, sharpshooter=rifles, SWAT=smg's, Survivalist= everything.  Tripwire releases a new mechanic/gamemode/patch (etc) and waits for feedback. If the community likes the new update, tripwire will keep that system and add similar systems like it. And if the community gives negitive feedback on the new system, They either fix it or completely remove it. For example, Tripwire decided to import a new system called resistance. It was ♥♥♥♥ing terrible. So, after community feedback, tripwire removed the system except large zed weaknesses. What the weeknesses are is that a Fleshpound is weaker to explosives but resistant to bullets and a Scrake is resistant to explosives but weak to bulllets. The reason why they kept those in particular is becuase it's what the community wanted, and the part that the community didn't want is taken away.  Now there is a flow of old players coming back to Killing Floor 2 because of its release and rather than looking in the past and giving good feedback, they're bashing on the things that are not done yet or on the situations with microtransactions. The reason why tripire doesn't remove microtransctions is because IT PAYS FOR FUTURE UPDATES. Tripwire has stated that right now, they are able to fund the game until the end of 2017 and that was half a year ago. These microtransactions are necessary for continuing free content updates instead of DLC. Some are even being rediculous in the fact that they are saying that 'TW is going to sell DLC now that the game is out.' The only time when they sell DLC is, and stated by tripwire theirselfs, 'We're not going to sell DLC unless the microtransaction system fails.' And don't worry, this isn't the Payday 2 type microtransactions where stats vary from weapon to weapon, it's just pretty skins with no real power other than to pimp your weapon.   I love this game to the death of me and i highly recommend this game to you and your friends.  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Well, it's finally out of early access at least. It took a long time coming, and a few odd missteps with the microtransactions, but it's finally here.   The balance is right around where it should be, for hard and below. I can't comment on Suicidal or Hell On Earth as I don't play those. The weapons sound fantastic, and the gore system is a much-needed step up from the original. Performance isn't too shabby either. FXAA is still our only option for antialiasing, which is a problem. Still, it's an standalone update/new product for a game series that somewhat needed it.   All in all, it's not bad. Perhaps not the best due to a few minor kinks here and there, but a solid 8/10. After a few years of post-launch development, I fully expect this game to steal many, many more hours from me.",
            "review_score": "1"
        },
        {
            "review_text": "Great game that's a lot of fun to play with your friends. It has a lot of different playstyles. You can also adjust the difficulty to whatever level suits your skill.",
            "review_score": "1"
        },
        {
            "review_text": "Guns and Metal, gg",
            "review_score": "1"
        },
        {
            "review_text": "Great game to play with friends.",
            "review_score": "1"
        },
        {
            "review_text": "I have been on a Killing Floor 2 kick. I really enjoy the game, however, the game play can get repetitive. You can play harder difficulties but the game play is still pretty much the same. I think it is a good buy for the curren price (around $20) but like most games it is better when you play it with your friends.",
            "review_score": "1"
        },
        {
            "review_text": "Even though I have 2 hours into the game, that 2 is going to become 2,000. 10/10 would headshot zeds again.",
            "review_score": "1"
        },
        {
            "review_text": "It's great. Runs great and plays great.",
            "review_score": "1"
        },
        {
            "review_text": "This is the Killing Floor you know with updated graphics and more mechanics. Whats not to like?",
            "review_score": "1"
        },
        {
            "review_text": "This game...is...♥♥♥♥ING AWSOME !!!",
            "review_score": "1"
        },
        {
            "review_text": "Run devil, run devil Run devil, run  I got something make the devil gonna run He been dancing till the break of dawn Devil gon' try to take a shot at me He got none, but baby I got three  He tryna make a fool outta me Y'all taking out my sanity He ain't nothing but a silver tongue I got something make the devil gonna run  I got something make the devil gonna run I got something make the devil be gone Run devil, run devil, run devil run You bet your bottom dollar he's gonna be gone I got something make the devil gonna run  Run devil, run devil Run devil run Run devil, run devil Run devil run  I got something make the devil go away I've been dancing all night and day Holy Ghost, filled with fire Look out devil we got revival  Now people gonna move and say Holy Roman murder scene He ain't nothing but a silver tongue And I got something make the devil gonna run  I got something make the devil gonna run I got something make the devil be gone Run devil, run devil, run devil run You bet your bottom dollar he's gonna be gone I got something make the devil gonna run  I got the King of kings and the Lords of hosts I got angel armies and a Holy Ghost I got spirits here that are tied by fire I got a valley of bones that came alive I got a cross, a hill, and an empty grave I got a trumpet sound and one sweet name Shake the gate of hell, the sinners and dogs I got my Jesus and the devil gotta run  I got something make the devil gonna run I got something make the devil be gone Run devil, run devil, run devil, run You bet your bottom dollar he's gonna be gone I got something make the devil gonna run  Run devil, run devil Run devil run",
            "review_score": "1"
        },
        {
            "review_text": "Great game and only getting better with updates.",
            "review_score": "1"
        },
        {
            "review_text": "Best and most brutal Co-Op shooter on the market. Game is insanely fun. And the gore? oh the gore!! Heads poping off Zeds and limbs flying in every direction when a frag or HE gernade goes off makes this game satisfying to kill every Zed that pops up on the map.  Game already has a large amount of weapons, but they will still be coming in further updates. Same with perks and maps.  Don't like just PVE games? well they have a VS mode for that. For the first time in the game series minus the mod before it became a tripwire game.  I've logged in so many hours from the previous title and this game just wants me to play it even more. I've never had so much fun dismembering enemies in my life.  Game varies in diffuculty so everyone can play at their own pace. Enjoyable weapon animations and reload animations. customize your character, collect in game loot, select whatever perk you want and regardless of between rounds or whatever weapons you use will level up each perk for the game, and lots of lots of blood!!  Did I mention the blood and Gore? LOTS!!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best Zed wave shooter games with best shooting feeling.",
            "review_score": "1"
        },
        {
            "review_text": "Solid 9/10! Fleshpounds are still haunting me in my sleep!",
            "review_score": "1"
        },
        {
            "review_text": "The BEST game in the genre. 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I loved KF and KF2 is a great successor. I have been playing the EA Beta for a while now and I'm very proud of the team for releasing it on PS4 and on PC. Not many games make it out of Early Access, so this is something to be proud of!",
            "review_score": "1"
        },
        {
            "review_text": "While I've had some problems playing this game, and it hasn't delivered absolutely everything promised, it's still an absolutely amazing af game.  11/10 would play again",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful gander at the 'kill hordes of zombies with friends' genre, with enough different from others in its field to make it unique.",
            "review_score": "1"
        },
        {
            "review_text": "  I started playing KL since free weekend,I am already enjoying Original Killing floor. But when come to Killing Floor 2 happend I am amazed those work effect grahpic inprovment work and better yet in future we may see reskin emeny for event just like the original one 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Blood, Guts, and gore. Everything that defines Killing Floor is all here in this package. They took the game and beefed it up on steroids, gave it some metal music and now its a one-trip to hell and its up to you to eradicate the Zeds.",
            "review_score": "1"
        },
        {
            "review_text": "playing SWAT and dying for the team 10/10 would die for team again",
            "review_score": "1"
        },
        {
            "review_text": "Game is fun, but there is not enough bosses, its the one thing that holds it back the most, there needs to be at least 5 bosses before the game worth $30, without bosses its just a rinse wash and repeat game where you change your class and the difficulty as you level up, everytime fighting the same 2 bosses at the end. due to its lack of bosses its held back immensely, i really wished they would've made more bosses before releasing the 'final product'  HOWEVER, the game is worth $15 to $20 at its current state and is alot of fun, if you see it on sale grab it if you like wave based shooters, i hear get compared to CoD Zombies often, its way better than that, no doubt.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy horde mode in other games (COD Zombie mode etc.) then Killing Floor 2 is a great pickup. Not only does it provide a unique challenge when playing alone, it gets progressivly harder when playing in groups. So long as Tripwire let the game take the route of the first KF, I believe the game will be as successful. The modding community for the first game was extensive, from maps, game modes, you name it. If that can be allowed to happen with the second game here, then I think this game will thrive as long as the first one has and continues to.    Cosmetics in this game are great for personality etc, but having the 'CSGO' crate and looting system is just unimaginative, and a quick way for the devs to grab a quick buck. I do however like the idea of using the Community Marketplace to buy and sell the cosmetics you find, and value being based on the total number of such items on the marketplace. All in all I don't hate the system I just think it could have been designed much better than an existing system in a different game.    Overall the game is well worth the money and has so much potential. With continued development I think it could be a game that last for many years.",
            "review_score": "1"
        },
        {
            "review_text": "its too easy a lot and unbeatable at times due to not enough ammo. KF 1 was far better",
            "review_score": "1"
        },
        {
            "review_text": "EDIT: original review below, I have changed my rating to recomended now. Why you might be asking ? Because the drops for this game gave me my money back finally, which means I have broken even.  EDIT2: out of early review: GREAT GAME! Definitely recomended as a must buy !  The game introduced (as announced today) CS:GO similar microtransactions. That is after there were only 2 major content updates (from which one was rather small) and way before the game was finished in any state. Working on microtransactions while not even finishing the main game leaves a very bad taste in my mouth. Tripwire basically ruined an amazing game. One would think that they actually learned after the Payday 2 fiasco from a couples of weeks ago. I just don't get this logic.",
            "review_score": "1"
        },
        {
            "review_text": "Pure Joy",
            "review_score": "1"
        },
        {
            "review_text": "A typical awesome zombie coop game blast the heads of the zombies get slowmotion time and enjoy the game",
            "review_score": "1"
        },
        {
            "review_text": "If you like KF or shooting some endless wave of weird monster or whatever they are,then this one is a must get.",
            "review_score": "1"
        },
        {
            "review_text": "now that this game is out of EA I will write a review  its a great successor of the game killing floor and its for the most part the same game the zeds are still there most perks are still there it just looks alot better and it plays superb  well done tripwire you made another awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "Make sure you have friends when you play this game! If you have a hunger for killing every necrotic and shambling thing you see, this is a good place to start. The class system could use a bit of fixing (*cough* firebug *cough*), but other than that, it's pretty fun. I say pick it up if you're looking for a decent game to play with some friends.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! One of my FAV games!!",
            "review_score": "1"
        },
        {
            "review_text": "I remember buying this game as a replacement to Payday 2 which had microtransaction, and I didn't like the game at first but today I must say this game is amazing. Better then I expected.  KF2 is a wave zombie game. The object is to kill the zombies and after 4/7/10 - kill one of two bosses - Patriarch or Dr. Vans. The game is extremley brutal, gore, with metal music in the background which makes the game's climate better.  In KF2 you can choose one of many perks, each perk has it own weapons, and his own pros and cons.  The game contains several maps by Tripwire, but anyone can create a map by the SDK and post it.  Pros: Great graphics and sound. High replayability Extremley fun with freinds. Fun sunshooting Rip&amp;Tear style  Cons: None  You should buy ythis game now.",
            "review_score": "1"
        },
        {
            "review_text": "this game is sooo much fun",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor is back, and it's even better than the first one.",
            "review_score": "1"
        },
        {
            "review_text": "Not as much depth as KF1 but still pretty fun.",
            "review_score": "1"
        },
        {
            "review_text": "shooting zombies is pretty fun and it gets even funnier when the weapon is a revolver that fires grenades. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "So far happy with where the game is going. The game will always be going through changes updates, and class balancing but overall im happy with the results.  If anything I look forward to the seasonal events and costumes. ",
            "review_score": "1"
        },
        {
            "review_text": "FULL RELEASE REVIEW  This game has come a long way since early access. Lots of new weapons, characters, bug fixes, and changes have been added to the game since then. The game is basically finished in its current state. Some minor tweaks and new weapons and maps need to be added in my opinion but other than that it's loads of fun.",
            "review_score": "1"
        },
        {
            "review_text": "BLOOD, GUTS, METAL.. THAT'S WHAT I NEED!",
            "review_score": "1"
        },
        {
            "review_text": "Killing Floor 2 captures all of the frantic fun of the first game while adding fresh graphics, new weapons, and new classes. Anyone who is a fan of the original can't go wrong getting KF2. Tripwire's mastery of cooperative shooting is again on full display with enemies and maps that will leave you cursing both yourself and your teammates. As someone who gets quickly bored of competetive shooters where you spend most of your time spawning and dieing, Killing Floor 2 is a refreshing breathe of fresh air where you spend your time in frantic fire fights that you only just escape to turn around and be face to face with even bigger and badder enemies.",
            "review_score": "1"
        },
        {
            "review_text": "Gore, Explosion, Amazin, Co-op, FUN!",
            "review_score": "1"
        },
        {
            "review_text": "A must have sequel to an already perfect game.",
            "review_score": "1"
        },
        {
            "review_text": "A tip to the devs, put the price of it at 19,99$ because right now you put such a ♥♥♥♥ed up price on it where people need to pay 30$ to purchase it, besides it would probably even pull in more players. Charge 5$ more for the deluxe version all you want. Bought the game back in January ( When there were only 4 perks), it was fun to see it gettin developed as time passed.   Pros : -Guts, more guts and a ♥♥♥♥ tone more gore.  -Great graphics  -All perks are free and hopefully no DLCs if people keep buying skins -Very well suited for optional customization ( No bonuses :)  -Suprisingly nice community? Most of it with the exception of meta players. -Pretty well Optimized for weaker PCs. -A LOT of replayability -Long lifespam  -The guns are really well made with the recoil n' all -Really cool enemies  -Excelent map design  -AMAZING AI ( PVE Zeds don't fell buggy whatsoever )  Cons:  -Currently there is a glitch that will make your shoots dissapear after or during zedtime for no reason It's quite confusing and I can't find anything about it. Hopefully one of the devs will look into that if they see this review -Meta players (If you don't play by the meta they will try and kick you) -Bad kick vote system ( It's really scary if abused by meta players ) -REALLY bad PVP system (Everyone plays PVE anyway so no worries :) -As I mention a really dumb price point which makes most people who wanna buy this game go  'Ah' hell nah'. -Inflated marketplace ( It's getting more stable so no worries? Give it a month... or 2 )  ",
            "review_score": "1"
        },
        {
            "review_text": "So I saw Killing Floor 2 on Steam one day long ago, after long hours of Badwater and Upward in Tf2 (Pre matchmaking), and lucky me, It had a free weekend going for it. 'Cool,' my young brain thought,' a free trial!' After installing the game, I decided to adventure into a Solo suicidal, 7 wave game. My young brain thought myself a fairly decent fps gamer, and so I ventured in, unafraid...  And got my ♥♥♥ handed to me by a buffed up sawblades for arms fleshpound.  '♥♥♥♥ this unbalanced game' my brain said. Paired with the original lack of diversity in the classes, I didn't buy it immediatelya fter the free trial ran out.   And then a few weeks later, I saw the game again, with a bit more content. I told myself Id give it one more try. Normal, 4 waves, lets learn this game. And while Dr. Hans ended me with pathetic ease, I found I had enjoyed those 3 waves. So I tried multiplayer. Not only is the community a lot better than any other game Ive ever played, but the inherrent nature of the combining of perks showed what tf2 could have done with a better community. I kept the game, and continued to play. Although it had a few bumpy updates and glitches, (one of those glitches actually removed quite a bit of hours from the game for me, as I recieved all of my perks at level 25), the game continued to be interesting. Recently, each class and update theyve added has made the game better and better. I haven't even been to pvp yet, and this game has been one of my favs still. Ive never had a moment where Id ever want to return this game, or quit it, as the community, albethem competetive to a violent degree, the gore, the gameplay mechanics, and most suprisingly, the Zeds (this is one of few games with original ideas for their zombie like creatures, excluding the obvious uniformities in the genre such as bloats),are ever entertaining. With the recent beta showing a future shared weapons between perks, Reverend Alberts the Sharpshooter will win the west. If not the west, than hell itself.  So lets look at the actual game. When I bought the bundle, and because Id played KF2 before, thats the one I installed first. So In all truth, Im not a vet from KF1, and that does show a missing sight of information from my opinion of this game. But lets not look at it for the fact that its #2 in a series. Look at the game. Hop into a match on one of a growing variety of interesting maps (with the obligatory treasure hunt), and start World War Z(ed) with your chosen Character and Perk. Fun times. Honestly though, while I will admit the game does have room for improvement, the best I can do is basically spit ideas, as I have 0 clue on how to even come close to making a game. Concerning the ideas:  #1: more weapons and various buffs to random zed spawns based on difficulty/player count/current weapons of each player; Having 6 Beserkers will serve you fine for every zed that comes along....until an army and a fleshpound show up with melee resistance and attacks that slow/cant be parried. That being said, Some of the new weapons are more or less effected by these random effects, allowing for a different weapon choice in every game, out of a much longer list than what we have now.  #2: and they're doing this now, shared weapon perks. Gunslinger revolvers with the Sharpshooter perks, Sharpshooter rifles with the Gunslinger perks, spread the love of weapons.  #3: We don't need 6 Alberts, although he is the coolest character. Let the players build their own avatars, and while we're at it, within the basic constraints of the perks, give the player more than just 2 choices per level.  #4: Don't go the random gambler way. All thats useful for is ♥♥♥♥♥♥♥ off your community and earning gambling based microtransaction money. Add the skins to the shop, .50$ for battle scarred normal, up to a max of, idk, 5 maybe 10 for the factory new master crafted. Let the players choice determine their progression in game and what they really want to buy. #5: and again, they're doing this now, more and scarier zeds. Fleshpounds, Scrakes, and Mobs, aswell as the occasional Patriarch missle or Hans grenade spam, are the main things that kill people on the floor. More demi-bosses, like the new Gorefiend and similar ideas, if you please, tripwire #6: If we're adding new modes, for those people who really hate the community or want more in th franchise, a story/adventure mode for free unlockable crates (free drop, free to open) that may contain weapon skins sell-able back to the market or over the steam market, cosmetics, or various other oddities.  #7: The big one: More than 2 bosses. Hans is very innovative in his design. Patty is terrifying. Lets see more! Maybe, Idk, a 4 armed fleshpound? How about a bloat-and-husk fusion?   Anyone else, if you want to, put the ideas below, and (I hate to ask) rate this so that people who DON'T scroll through random comments see this, and eventually with any luck, someone from Tripwire will see this, pass it up the chain, and maybe just maybe we'll see some of the communities ideals behind the game.",
            "review_score": "1"
        },
        {
            "review_text": "Never really got into zombie games to be honest. This game reminds me in some ways of the intensity of Doom, I just love it! It can become repetative, but all in all it was a solid purchase and would recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Played KF1 , this is a improved version obviously and imo its quite fun. Would recommend anyone who likes to zombie type of game, to try out KF2.",
            "review_score": "1"
        },
        {
            "review_text": "You know a game is good when it's not even done-it only has 3 maps, a little over 20 weapons, 8 characters, and 1 gamemode and the user reviews generate 'Overwhelmingly Positive'. That's when you know it's worth the money..",
            "review_score": "1"
        },
        {
            "review_text": "This is absolutely disgusting way to sell your game. Roughly three updates per year, which brings in 1 map, 1 perk and some new weapons each.  Not f*cking impressed.  Tripwire is simply milking everything they can from this game. They know that they've messed up, and they have no intention of cleaning up after themselves.  Edit; This game has gotten even worse. What the f*ck is that Survivalist perk? It's so cheap, I won't even try to act like I'm surprised of TWI's laziness at this point...  Tl;Dr: Don't buy this game. It's broken and TWI is just ♥♥♥♥♥♥♥ at their customers at this point.",
            "review_score": "-1"
        },
        {
            "review_text": "Game was okay until it came out, now I can't update the game to the official version since it's out of alpha, because of the issue 'content file locked'",
            "review_score": "-1"
        },
        {
            "review_text": "Killing floor 2 is an amazing game. It has a unique style as well as balanced special zombies and bosses. Many complain saying 'the first one is better' or 'it wants you to give them money'.  but if you are not either stupid or unaware you dont actually have to pay money you will quickly find that this game is unique and was highly underrated and may be one of the best games out there.  killing floor is a must have for all fans of L4D or other similar games and therefore in my opinion its one of the best games ive ever played.  The level design and soundtrack are also amazing and I like the workshop support, so that just adds to the fun.   im not a P2P player but I still had fun becauce you can find hats and skins quite commonly when winning a game and you already have some as default so you don't have to look like that one level 0 berserker with the preist guy as a character with no customisation.  in conclusion. Killing floor is amazing and I would reccomend buying.  8/10 great fun that never gets old.",
            "review_score": "1"
        },
        {
            "review_text": "  +gore +blood +beautifall graphics 100/10",
            "review_score": "1"
        },
        {
            "review_text": "If I had to describe Killing Floor 2 in 3 words, I would go with 'Intense, Fun, Gore.'  There is no other game that delivers this type of satisfying gunplay,melee combat, or anything else you may use to kill the Zeds, and combines it with fun and also challenging gameplay. Every aspect of this game just adds to the atmosphere and intensity. The music, the environments, gun sounds and animations, character dialogues.  The satisfaction of taking a Gorefast's head clean off in slow motion as it charges towards you is something that can't be explained by words. You have to experience it. And you never will, unless you play Killing Floor.",
            "review_score": "1"
        },
        {
            "review_text": "Best co-op game i have played so far, many interesting weapons, challenging enemies-zeds, dark and scary maps, also there are even 64 player servers if you want even more madness! :)",
            "review_score": "1"
        },
        {
            "review_text": "Totally deserves a 'WHOOOAAAAAAA, DUDE'-Reward.",
            "review_score": "1"
        },
        {
            "review_text": "At least the Floor can kill you again",
            "review_score": "1"
        },
        {
            "review_text": "pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "This game has its own charm just like the first installment in the series. A worth while play with many hours to invest with friends. A must play.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun the gore graphics is spot on",
            "review_score": "1"
        },
        {
            "review_text": "if you liked killing floor 1 your gonna love this game trust me.",
            "review_score": "1"
        },
        {
            "review_text": "Developers may have made some questionable decisions, and it may not be as good as KF1 was in some ways, but its better in other ways, and overall its still a great game. It does feel a bit more spammy and less dependant on precise control and combos/mechanic understanding than 1 was. This makes it easier to pick up, though potentially diminishes the long term appeall. The meta can always change with new weapon and zed releases but its not good to judge a game on what it could become and so ill just say the games solid as is, but not as good as it could have been.",
            "review_score": "1"
        },
        {
            "review_text": "Still By Far The Best Zombie Game Framchise. Period.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best horror survival arena. Save money, save bullets and make them count. Good graphics and an outstanding soundtrack. Thumbs up for tripwire guys.",
            "review_score": "1"
        },
        {
            "review_text": "It really does feel like a modernized KF1, but more hectic. Runs great and good soundtrack. If it's on sale you should definitely buy it.",
            "review_score": "1"
        },
        {
            "review_text": "11/10",
            "review_score": "1"
        },
        {
            "review_text": "Great class based shooter, kill all the floors",
            "review_score": "1"
        },
        {
            "review_text": "Still not enough blood and gore.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked Killing Floor 1, you will love Killing Floor 2! And if you never heard of this game before and want to fight waves among waves of Zed with your friends and have a 'bloody' good time, this is the game for you!",
            "review_score": "1"
        },
        {
            "review_text": "The concept is simple:  1. Call your friends 2. Kill zeds 3. Buy guns 4. Kill bigger zeds 5. Repeat 2~4  But steps 2 and 4 are just too much fun. It's fast-paced with lots of different weapons and perks and you can try many different setups and strategies. Really, don't go with 'this is the 'right way'' - after you learn the basics, do whatever you want!",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly kind and fun community from what i've experience which is a big plus for me, and the game itself is great and can hold hours of playtime in itfor just mindlessly killing zeds or hunting for achievments. Though the downside is it can seem a bit monotonous for some of doing the same thing over, but that's never been a problem for me since my attention span is that of a lizard.  Overall great game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "You blow the heads off things. Sometimes with guns. Sometimes with a sledgehammer. Sometimes with a rocket launcher. Sometimes you get butt♥♥♥♥ed by monsters made of chainsaws. 10/10 my ♥♥♥ is sore",
            "review_score": "1"
        },
        {
            "review_text": "Game that I've been consistently coming back to. Easy and fast to jump into a quick session of zed slaying goodness",
            "review_score": "1"
        },
        {
            "review_text": "Its so addicting to just go on a rampage with some friends for a few hours",
            "review_score": "1"
        },
        {
            "review_text": "Well............I really hope they can add machine guns into the guame, alongside with a new perk perhaps, which can only carry 1 machine gun but with something like 200 rounds per drum, and carry up to 2 or 3 drums each round, because the ammo capacity for the guns currently in the game is too low.....",
            "review_score": "1"
        },
        {
            "review_text": "Amazing Game, Of course I didnt own the first kf and only played a few times, but alot of the people who negatively review this game are like the morrowind fans. They prefer the older version well let them play it. The gore is great the guns are cool and just like KF1 they added guns and characters over time and maps and new enemy skins, this will for sure happen with KF2 dont fret...just wait until new things come out if you're bored of it.",
            "review_score": "1"
        },
        {
            "review_text": "Fan of the first kf liking what is done so far for kf2 more interting with all the new zed mechanics",
            "review_score": "1"
        },
        {
            "review_text": "There's a lot of blood in this game. Very good",
            "review_score": "1"
        },
        {
            "review_text": "Love it. Must Buy.",
            "review_score": "1"
        },
        {
            "review_text": "10/10 MOSTET FUN OUT OF A ZOMBIE SURVIVEL GAME YOULL EVER HAVE",
            "review_score": "1"
        },
        {
            "review_text": "I'm doing this for the badge, but honestly... just buy the game and play it. It's great.",
            "review_score": "1"
        },
        {
            "review_text": "It's tight son, me likey that.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty solid. The gun animation feel a little bit less hefty and weighty than the first game, but I like the increased pacing and the hectic gunplay.",
            "review_score": "1"
        },
        {
            "review_text": "If killing floor 1 was worth your time this definitely worth is as well.",
            "review_score": "1"
        },
        {
            "review_text": "If you liked the orginal this is a must play.",
            "review_score": "1"
        },
        {
            "review_text": "Game was okay until it came out, now I can't update the game to the official version since it's out of alpha, because of the issue 'content file locked'",
            "review_score": "-1"
        },
        {
            "review_text": "So ive wanted this game for the longest time since i was in AIT and before for 10 weeks was in boot camp, but ♥♥♥♥ i get back and this game looked even better then i tought i was gonna get when i got to a non tradoc setting (real army not training) they really have put on effort with every thing and ♥♥♥♥ theres even an L shape reload that alone gives this game 10/10 GG",
            "review_score": "1"
        },
        {
            "review_text": "the best survival game so far",
            "review_score": "1"
        },
        {
            "review_text": "it's killing time with style and manner. Super fun zombie co-op shooting. Get deluxe edition for extra char, artwork and soundtrack. Good job Tripwire",
            "review_score": "1"
        },
        {
            "review_text": "Very polished and smooth. The animations were motion captured at 240 fps, so slow motion is smooth. I've only played it for free weekend, and it was fun. There isn't much depth to the game. It's basically like COD zombies, if the zombies got smarter as the rounds progress. The Zed's Heath remains the same, they just attack differently throughout the game. 7/10 it's fun, not essential. Get it on a sale if you really like COD zombies. EDIT: This game is actually nothing like cod. I sat and looked real close to the screen. I saw little squares, so this game therefore plays and looks just like Minecraft.",
            "review_score": "1"
        },
        {
            "review_text": "Very polished and smooth. The animations were motion captured at 240 fps, so slow motion is smooth. I've only played it for free weekend, and it was fun. There isn't much depth to the game. It's basically like COD zombies, if the zombies got smarter as the rounds progress. The Zed's Heath remains the same, they just attack differently throughout the game. 7/10 it's fun, not essential. Get it on a sale if you really like COD zombies. EDIT: This game is actually nothing like cod. I sat and looked real close to the screen. I saw little squares, so this game therefore plays and looks just like Minecraft.",
            "review_score": "1"
        },
        {
            "review_text": "It is really interesting that alot of negative reviews here are negative not because the game is BAD, but rather because it's not what they expected and/or it was managed poorly. Reminds me of Battleborn, Watch Dogs and Shadow Warrior.   I certainly got my money's worth out of this game already (mostly playing it in soloQ), however I usually play 2 - 3 games at a time and then do something else. When played in short sessions, the game is fantastic and tons of fun. Random spawning (and greater variety) of big zeds would help make each game different, but isn't crucial. I genuinely enjoyed it.  On the other hand, it appears that if you play it in longer sessions and frequently, the game becomes monotonous and boring (not for me, i'm judging by other's reviews) so keep that in mind.  TL;DR It's great to rest and have some fun regularly, but can become monotonous during longer sessions (never happened to me personally, but that's what people say).",
            "review_score": "1"
        },
        {
            "review_text": "is not minecraft, gay.",
            "review_score": "1"
        },
        {
            "review_text": "  POSTED: 19 NOVEMBER +Great dynamic ragdolls! +Weapons do feel real +Testosterone !  - Free lootbox, buy the key",
            "review_score": "1"
        },
        {
            "review_text": "I didn't choose the Medic life, the medic life chooses me",
            "review_score": "1"
        },
        {
            "review_text": "I may have only played the game for a short period of time, however it's enough time for me to recommend the title!   It's been a lot of fun so far, there's an interesting perk, leveling and weapons system and the other players are actually really helpful. There's no competition between players either.   The only downfall with this game is a personal one, some maps aren't to my taste and can be repetitive in some places - The game can also be fairly difficult and frustrating playing solo.   Having never played the first killing floor, I'm so far thoroughly enjoying this game! I can definitely see me putting many more hours into this :)",
            "review_score": "1"
        },
        {
            "review_text": "If you love Kf1, you gonna love this too. This game have what you love in KF1 and make it better ! If you never played kf1 and you're gore with perk lover, I sure you gonna luv this !",
            "review_score": "1"
        },
        {
            "review_text": "In KIlling Floor 2, you got 8+2 upcoming perks, specializing in different weaponry and playstyle, to overcome the increasingly bigger waves of zeds. Scrakes and FPs are the main threats, as they hit hard, and have HP. Boss wave is ' run around the map looking for ammo, and pew-pew'  We got a sprint button, no longer run faster with the knife out.2 new zeds, cyst: low-clot, slasher:aggro clot. New boss, hans, armed with machineguns, gas,and a third boss is coming up, the matriarch (right?) we also got a lot of customization options, crates, the trading floor, no stat boosts, just skins.  Clot &amp; clot variants, easy targets, just watch out for their grab, as it forces you to aim at them and you get stuck until the zed is bashed or killed. Gorefasts, them jawless brothaflippas, usually run to slice you with their long thingie, avoid that, maybe? Crawlers die from a prod, but they look nasty, and... crawl?Mr. Holmes, you are wonderful! Aim lower! they come in groups, from vents and other narrow places. Stalkers, kinda invisible, female, clothes = no, but she's not in the mood... but no worries, she gunna roundhouse kick your face off. Bloats are fat, shoot their heads, body has hp for days.They look after you, barf on you to keep ya warm. Sirens scream, RIP headphone users. Husks usually fireball you, or suicide, or BBQ the whole squad with a flamethrower, coz why not. Scrake carries a chainsaw as he is a lumberjack, rages when he is below 50% hp, which means he runs and attacks you like a big angry guy with a chainsaw. Fleshpounds used to be kindergarten tutors, until some construction workers thought it would be fun to replace their arms with drills, and add a rage-o-meter to their chest, along with other neat KKona changes. Now, everyone looks like a construction worker to them, and they want to take revenge. No hard feelings, rite?Shhhh, hug it out...  Question: how to win as humans in Versus? getting to the bossfight is no problem, but winning... my first 2 vs matches, patty killed us, we killed them before bosswave. now, 3rd game, i got patty role for the first time, was playing ranged mode, then a teammate said melee is 2hit, but one of them survived, and kited me till I died. Now I know what the the other guy wanted from me in my second vs as human, when he said, 'kite in the farmhouse'.I was like, OK, gotta fire tons of bullets, find lot of ammo boxes,and run. Nope, just run 24/7 and close the doors you pass,no need to damage the patty yourself, because if you dont deal damage as the patty, control of the patty is not given to a teammate (like tank l4d style), you take damage over time.Thought I could catch up.Rekt in pasta.#themoreyouknow.  So, in the next VS match, we tried holding the prison courtyard vs boss, it failed, but, armed with the kiting 'knowledge', I did it! It felt pretty bad though, lvl25 medic running, using corners to avoid pat line of sight, healing every time I got hit, (I didnt look behind me, at all). So yeah, cheesy tactic. Problem is, I dont know how to beat boss with actually the squad dealing all damage , not this kiting stuff, coz boss just gotta rush in melee into the squad, killing all high-damage dealers, whose movement speed is not buffed, and its over.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a repetitive, boring as hell low level entertainment for &lt;16 years old kids.  Total time waste. I hope I get my refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Now released i don't even know what to say... First of all those who have played it trough the EA phase this release equals 0. I'm one such guy too. However there's no hate in this review mostly because the game is well designed, optimised, addictive. There is no such other game where pumping a huge ♥♥♥♥ mutant with a chansaw in its hand's place, in the head, would be more satisfying. The game had a really long EA run but with most other games content here was always fully tested and combat ready. Unlike other EA games where optimization is ♥♥♥♥ + content comes as fast as it's mesh is ready, with a ton of bugs ofc. No, this EA was much different. And i Liked it different. Sadly the dev team was cut in half with the announcement of RO2, so there is content that never meant to happen and came in place of a much larger idea. (talking about survivalist perk instead of Martial Artist) Sad but the gameplay still rocks, so i'll get over it at some point Pros: -Awesome graphics -Very good, fitting music -Top of class wave defense -Very good optmization -TON OF GORE! -Reasonable price -No game Breaking bugs, also Very small amount of bugs Cons: -slow content growth -Too Addictive (seriously watch out) (that can also be a Pro if you like)  So overall I can only recommend you this if you like strong Horde wave defence with a ton of gore, industrial music, good graphics.",
            "review_score": "1"
        },
        {
            "review_text": "Be carefull the crates don't get their teeth into you and you might enjoy it for a while.",
            "review_score": "1"
        },
        {
            "review_text": "Being a fan of the orginal Killing Floor, I can safetly say that KF2 Fills the bargin of sating my craving of fun co-op survial slaughter of Zeds. My first reaction to this game being a extremely fun game, and thus knowing it will be a grand time is when I join a server that had community maps on it, The Comunnity map was Helms Deep, from the LotR which I found to be a interesting twist to be fighting of hordes of Zeds in one of my favorite fantasy settings, I Found out quick what the difficulty setting 'Hell on Earth' ment quick at lvl 1 as a support class. As I was a full lobby of lvl 25s which is the current max level for classes, I thought I was going to get called a noob and most likely kicked , Instead however these 5 gents, Started quoting the LotR and calling me Frodo, and Just fighting off Waves and waves of zeds, and them screaming 'Protect Frodo!' Or one of them just playing quotes from the movie, I finally ended with winning the Game, at Helms Heep, with myself 'throwing the ring' into the Helms Deeps own personal Mt. Doom.   10/10 would hold the line against hordes of Zeds with Gandalf and Gimili Again",
            "review_score": "1"
        },
        {
            "review_text": "This game is getting a lot of hate and im noticing its from early access buyers who feel neglected by the devs. As someone who played the first killing floor extensively, and someone who wasn't a part of early access, I feel my opinion is relatively unbias. Im going to start off by saying this: in NO way is this game a downgrade of the original. Almost all gameplay mechanics have been improved or refined, and more content was added to the game. The bottom line is that this game is very fun and I would recommend trying this game out yourself before being swayed by negative reviews. After all if you don't like it there is always the refund option.",
            "review_score": "1"
        },
        {
            "review_text": "Trying to get this game to work is like playing the worlds most frustrating game of Russian Roulette.",
            "review_score": "-1"
        },
        {
            "review_text": "I kind of feel like recommending, because good soundtrack, gameplay, and stuff  But still this game has failed to deliver for quite a long time..  I mean i got it 50% of and have had fair share of fun with it, but:  -2 bosses -half of the number of maps compared to kf1 -was promised to release until this year -has kind of went silent now (updates have gotten more scarse)  EDIT: Okay, the game just launched, like 6 months afhter this initial review and all i have to say is it's great..  Worth the asking price.  100% recomended",
            "review_score": "1"
        },
        {
            "review_text": "you get to kill naked bald guys that try to eat you and get paid for it aswell",
            "review_score": "1"
        },
        {
            "review_text": "Even though i got like 7 hours on this game I still love it. I bought this game when it first hit the market which was on my birthday. Looking for a game where you shoot things in the face :D This is it Looking for a game that boss will rekt you This is it  Looking for a game where you can buy a sledge hammer that can shoot shotgun bullets when you attack This is it Good game indeeeeeeed",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have played this year. If you like GUNS and stuff to kill with said guns and have fun while doing so then look no further.   PS: Need some Dosh.",
            "review_score": "1"
        },
        {
            "review_text": "at first i didnt like this game cuz u can sprint backwards but its ok",
            "review_score": "1"
        },
        {
            "review_text": "This game is definition of brutality",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, best played with 4+ friends",
            "review_score": "1"
        },
        {
            "review_text": "Seeing how Tripwire interactive have been dishing out free weekends like there's no tomorrow so you've probably experienced this game a little.  If not (or you couldn't be bothered) then this is your lucky day for me to personally indulge you in the features of this game.   First off I wanna say that this game has been getting a bad rap for micro transactions that are NON - COMPULSORY so it is not a pay to win game. Any new weapons that have been bought by one person can be shared via the trader and KF2's drop system allows you to recieve crates and cosmetics (yay c:) by ending a match either by dying or winning. ( No weapon skins so far though :c) Most of the skins and cosmetics are created by the COMMUNITY so people dissing this game for microtransactions are huge hypocrites. The people that complain about the core elements of the gameplay (you know the actual stuff) are Killing Floor veterans that aren't satisfied it isn't exactly like the original game. Custom servers are available for KF veterans which offer the old maps and level system but still keep the update characters and mobs.  Now for the nitty gritty. If you didn't already know, the killing floor franchise started out as an unreal tournament mod (allegedly) and was developed into a british zombie killing wave survival style game in which the aim was to defeat the Patriarch at the end of any chosen map. Bad news for you the Patriarch survived and his hordes of 'Zeds' have marched across Europe, ransacking and ravaging the landscape with the remains of their victims.  The new game features an updated version of the Patriarch aka 'Patty' (which looks a lot more boss like than the original in my opinion) and a 100 year old German man named Hans Volter who keeps himself functioning with Horzine biomass (Nicknamed 'The Nazi'). Currently there are 7 classes(3 more to come!) to play from along with a number of different characters which include some of the original killing floor characters such as Briar and Foster. Each 'Perk' has 4 weapons and from what I have deduced, each weapon is part of a tier from 1-4 so one weapon for each tier, including special grenades, perk bonuses and knives!  The game so far is pretty balanced with the odd buff required here and there (Demolitions seriously needs more perk bonuses, seriously 3 compared to 4, 5 and 6?!) as well as the odd nerf (Hans' melee and hp, it's more than the the patriarch...).  The maps are virtual eye candy and each one is pretty large except for Biotics Lab and Farm House but have been balanced with large amounts of flat ground for you to easily rack up headshots with.  Do note that there are some exploits that come with this game that TWI have not fixed yet such as the farmhouse bush (Not the first one, the other one) which people are quite divided by at the moment.  Gameplay wise, a vast improvement from the original killing floor with the addition of the sprint and bash button as opposed to moving faster with your knife (which made no sense when carry a heavy weapon such as the M99 AMR or the LAW in the original game). I also like the M.E.A.T. system which gives you the ability to blast bits off of the chosen body part of a zed which was in the first game but only featured 5 places whereas KF2 features 5 for the head alone and reports from the developers say there are as many as 26 different fragments of a zed you can separate from them along with the fluids and guts option which makes for extreme zombie killing (zombie blood fountains galore).   Speaking of extreme Zombie killing (They're not actually zombies, they're failed experiments to create super soldiers) they added a badass soundtrack of heavy metal songs from artists such as Demon Hunter and Rocky Gray to make you feel like you're the bees knees when destroying the face of someone that used to be normal before they signed their life away to be experimented upon.  The difficulty ramp up system is a work of genius and not only does it take into account the setting you've chosen but it also multiplies key values such as zed numbers and health by the number of players on the team (up to 6 on standard servers.)  The first game featured an objective mode which saw you carrying out instructions set by a certain character. This was really enjoyable and broke away from the tedium of the killing floor mode in order to appeal to players who got bored of the game quite quickly. I would like to see this in the new game as well as a few other ideas ( I thoroughly enjoyed playing a custom gamemode which was similar to a game I think was called 'Dread' in which you had to find keys to escape with teammates while avoiding a reskinned invulnerable fleshpound who had very poor vision in the dark.)  This game already feels finished even though it been early access for quite a few month now (like 8 or something). They really should think about streching out the updates instead of packaging a big batch of content into one update then leaving it for inumerable months for people to get bored of within a few weeks. By adding small amount of new features every 2 or 3 months they can ensure people remain interested (*Cough* Q!) which is similar to what Valve do with Team Fortress 2.  A gripe I do have with this game is that my frames do drop suddenly for no reason. It's not anything to do with my computer because sometimes it runs perfectly fine and I'm able to play full matches with out any hiccups. I run every setting on max and most of the time it's as smooth as silk. Times where it drops are usually when I open the steam overlay to reply to any banter that has been thrown downwind of me and usually it's when I just start up the game. I suspect it's something to do with texturing failures and poor optimization to steam but eh.  Zed time is a feature which has crossed over from the original game but has been beefed up tremendously. At level 25 with any perk, you unlock powerful skills which can only be activated during zed time but can be extremely useful even during these random events.  Apparently there are problems with matchmaking but I don't use that mode, I just play on any HoE match as long as it has 'playas' if you know what I mean. The game's difficulties are as follows; Normal, Hard, Suicidal, Hell on Earth. Normal increases the amount of time you have at the trader and halves the damage and health of each zed whereas in hard onwards the recieve damage ramp ups of up to 1.75 and a static value of x1.0 health at hard onwards (excluding large zeds/bosses) as well as a larger number of zeds.   I would like to see a boss for each map which allows you to strategize more than the random system it has more and if some people don't like that idea, a 'Randomizer' mode could be implemented to mix things up a little. I would also like to see zeds which have been affected by the environment such as zeds with frozen/frost bitten arms in outpost and protruding twigs and scars in black forest to add realism.(Larger variety of zeds)  The voice acting is pretty bad for the most part, the only believeable characters are Ana, Foster, Hayato, and Briar so I would like some improvements to be done there as well as a wider variety of characters later on (a lot of people are asking for more female characters - the randy buggers - but I would like to see cyborgs and robots most of all.)  Most people who play the game have a great idea of teamwork and stick together but don't bother to read about resistances and weaknesses of the zeds so you'll find people trying to blow up a scrake with a 50% explosive resistance sometimes. Strategies to complete harder difficulties usually involve a medic, a beserker and a place to camp but I have found that zooming across the map in a tightly knit group actually works better and gives you a chance to enjoy the scenery.  As it stands I would give this game an 8/10  TL;DR : Kill urself",
            "review_score": "1"
        },
        {
            "review_text": "Most fun I've had doing the same thing over and over again.  Pros:    Etremely smooth gunplay    Satisfying cinematic gameplay    Somewhat enjoyable progression    Cheesy lines    Interesting adversarys    Fluid melee system    teamwork required   Cons:    Tiny animation bugs    Netcode has some extreme issues when dealing with higher ping teammates    Difficulty has a spike between hard and suicidal that new players aren't understanding  ",
            "review_score": "1"
        },
        {
            "review_text": "There are a lot of people complaining this game isn't worth it. It's early-access and they update the game with major updates like every 2 months and with minor updates more often. That's better than most EA games in the store. Like DayZ.  Tripwire won't give up on this. I can put money on that.  Update, the game is released and Tripwire didn't leave like so many said.  The original Killing Floor is amazing, but Killing Floor 2 is much better. If you liked the original KF, you can't be disappointed in this game. It's very similar and fun. Things stayed the same and some changed, but it feels great, looks great and overall will stand like the original.  It really does deserve the Test of Time award for coming so far so quickly.",
            "review_score": "1"
        },
        {
            "review_text": "Great Co-op game, lots of fun.  Disappointed in the price for opening crates. Too costly that I'll probably never bother.  ",
            "review_score": "1"
        },
        {
            "review_text": "I love the graphics in this game the only  thing I miss is the realistc voice acting because its recorded from youtube poop video or somee kinde but yea anyway I love the animations and the guns its just awesome ",
            "review_score": "1"
        },
        {
            "review_text": "I enjoy this game. Sure there may be microtransation bits to it, but have no need to partake in those. The game is still fun. You blow up monsters with bullets, explosives, and fire. If you can't enjoy that just because there are microtransactions then I guess avoid it. If you just want a party game for you and your friends to shoot monsters then buy it and party up!",
            "review_score": "1"
        },
        {
            "review_text": "Great, fast paced, Intense, lots of gore, can be very scary too at times and Im not so easy to get scared in games :D ",
            "review_score": "1"
        },
        {
            "review_text": "My father left me because I stole his cig money to buy this game",
            "review_score": "1"
        },
        {
            "review_text": "Great game, when I first jumped into the game I did have a little difficulties but then I learn the ins and outs of this game. And the gore in this game is nice and if you are a person who hates gore you can turn down the 'gore level' down in settings. I had lots of fun playing this and I had played the original first. Very easy to learn and easy to get cornered by 'Flesh Pounds' and 'Scrakes'(strong tier 'Zeds' in the game) XD.",
            "review_score": "1"
        },
        {
            "review_text": "Ok so first off this game is amazing, lots of action happening once. Good graphics, lots of weapons and a time waster. This game has alot of element to it. The only issue that I disklike is the need to buy a key to open a crate, it should be possible to earn keys as well to have the chance to open the crates that have been sitting in your inventory. Apart from that this game is enjoyable and would recommend it to a mature audience.",
            "review_score": "1"
        },
        {
            "review_text": "'Bloody' awesome game  Featuring  Emo kid - Cyst JESUS WHAT IS THAT - Crawler  Triggered Man - Clot Naked invisible Lady - Stalker  Creepy Clown Man - Slasher Whats skin? - Gorefast  Fatty - Bloat Pew pew pew - Husk  SHUT UP - Siren Pudge - Scrake  Meat Beter - Fleshpound  10/10   ",
            "review_score": "1"
        },
        {
            "review_text": "Compared to other games that were in early access, this clearly shines above the rest. It is clearly poslished and is extremely fun to play multiplayer with friends.",
            "review_score": "1"
        },
        {
            "review_text": "So the game is out of EA and I'm still playing. Yes I hate the microtransactions, yes Survivalist is a cop out class and I'm unhappy that we didn't get new weapons for it. The game still runs well, the other 9 classes are fun to play and the community is decent. Worth a buy.  Edit: The recent content added is pretty awesome. Firebug is my new favorite class, and the two maps are nice to look at and brutal to play. Catacombs gets dark after a few round with Sirens nades and stray bullets taking out the few light sources. Evacuation is interesting with all the elevation changes, it's a large map and offers lots of places to hold out. Game plays great as always, the changes to the Zerk make it the perfect tank and the Zwei is simply fun to swing around. I complained a bit in my last update and I should have had more faith. Buy this game.  Tripwire has renewed my faith in Early Access. The game is not nearly complete at this point and yet it still plays smooth and fast. Graphics look damn good, no fps drops on my end with a R9 270 card and 8 core processor. The guns feel great, they hit hard and feel great. Zeds look great, blow apart in interesting ways, the crawler even crunches when you shoot/smash/cut it like it should. Voice acting is solid, i like how my character responds to what's going on. Cuts down on typing SC and FP and gun here all the time. Only 4 perks and three maps as of yet but it plays great and you get a good mix of skins and customization to start, this is a good buy.",
            "review_score": "1"
        },
        {
            "review_text": "  I don't often do reviews, but for killingfloor I'll make an exception.   If you love F'in zombies in the A with some mad weaponery this game is for you.  If you love a challenge and don't mind getting F'd In the A because your surrounding team are a bunch of fanny bums, then this game is for you.  Ever since KF1 I have suckled on it's D and stuck with it until KF2 come out.   Now this game is a holy ♥♥♥♥ balls of a game.   I love it. I love you.   Thanks and goodnight.",
            "review_score": "1"
        },
        {
            "review_text": "After playing this game for a reasonable amount of time, I've got to say that this game is even better than Killing Floor 1.  First of, you get a new start-weapon for each perk and new perk abilities which you can choose from once you reach perk lv 5 (lv 25 is max perk lv), the sirens crawlers and stalkers are still annoying af, the Fleshpound looks even more frightening with its size and attacks same as for the Scrake. Zed time or slowmotion time is still awesome, the gore is perfect and brutal and when you add in some friends which got skins looking like Mr Foster or Dj Scully you just know that you're going to have a good old KF time. and the small details added by the developers make this game so unique, such as when you play as a Berserker and you got a bloody Katana from slayign too many Zeds, when you press R, your character swings the Katana a little bit to the ground so that the blood from the Katana falls of, leaving a small puddle of blood on the ground. Btw there are collectable skins for perk weapons, which you can find almost on each map once you shot all 15 hidden collectables.  I would reconmend this game to all my friends, the graphics are good, the zed killing is fun and overall KF2 is one of my favourite games till this day.  Last but not least, a Killing Floor pun:   What do you call a Fleshpound from the hood?  A freshpound.  I am so sorry, I'll let myself out.  Peace.",
            "review_score": "1"
        },
        {
            "review_text": "have owned it since it was in early release, keeps getting better and better with each new update. highly recommended. they take their time and make substantial upgrades just like the first killing floor",
            "review_score": "1"
        },
        {
            "review_text": "It's all fun and games until you get trapped in a corner and punched to death.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "The Best game I Play in a long time",
            "review_score": "1"
        },
        {
            "review_text": "I Highly recommend this game to everyone who loved Killing Floor 1. In my opinion they made the frist one in almost everything better., like more different small Zeds, which is more diversified and thou more morivateing for Horde Perks, better Graphics of course and the shooting makes more fun than before.",
            "review_score": "1"
        },
        {
            "review_text": "I really wish the scoring system on Steam would be a bit more complex than yay or nay. On one hand, I like KF2, on the other, I don't see it in enough regard to recommend it to everybody.  It's the same KF you know and loved, if you knew and loved KF, and of course that's great. The original was already a fun-fest of intense corridor shooting and boss battles you could grind your teeth through. In many aspects, it has kept that appeal. But it's also the same KF. Monsters are almost all the same as in previous games (they said they'd add more), weapons the same (likewise), but at this moment in time it feels more like a HD remastering than an actual new game.  But the maps are new. Sure, some of them are heavily inspired from classics, but even so they feel fresh and large and interesting to explore (they even added secrets on each map that you can find (you get an achievement. yaaaay). Also new to the map design is the large areas and rooms, adding something new, but also substracting some of the use of barricades. The claustrophobic maps are fewer and even those are usually half-n-half. On higher difficulty levels it might be worth it, but on Normal it's almost pointless and it will only slow your insaciable hunger for splattering zombie brains.  There are two things, however, that really stick out of the pudding pie like the toe of a dirty hobo who tripped and went smack-right in it.  First of, the game is head-to-butt filled with achievements, the lazy kind too. Beat this map on normal, beat it on hard, beat it on suicidal, beating on omg srsly u guys. Beat the other 10-15 maps 4 times. Kill 50 x enemies with y class, kill 100. You get the idea. If anything, they feel like a grind from an MMO but without the reward it, to me, more like a way to torment completionists than make your game special.  And then there's the microtransactions for the esthetic items. Which are BORDERLINE decent, since the game only costs 20 quid. Even so, 2.49 for a key to unlock a chest that has a chance of dropping one in 11 types of items? At the other pole, you do ocassionally get drops from ending levels, but they feel rare and random and not very special. So far I got 3 drops in 7 hours, 2 of which are common and one is a box.  I can't hold too much of a grudge, since Tripwire seem like decent fellas, adding new stup and supporting their games years ahead of other mainstream publishers, and the microtransactions only seem to be a way to keep the studio afloat, and I'm positive that in time they will add new and interesting features. For now it's more of the same. Thake that as you will.",
            "review_score": "1"
        },
        {
            "review_text": "Guaranteed Tripwire quality. Also different enough from the first game to be worth buying, especially with the new versus mode.",
            "review_score": "1"
        },
        {
            "review_text": "Solid gunplay, challenging AI and bosses... a great sequel to an already great game. Sadly still lacks in performance with the Nvifia Flex implementation, but otherwise its a beautiful game. Shooting guns hasn't been more fun. Hope that we'll see new updates add more guns and classes in the future.",
            "review_score": "1"
        },
        {
            "review_text": "Intense team based monster shooter. Awesome game",
            "review_score": "1"
        },
        {
            "review_text": "From survival horror to heavy metal power fantasy in mere seconds.",
            "review_score": "1"
        },
        {
            "review_text": "  GORE, SO MUCH GORE, LOVE IT, I CAN SPENT HOURS KILLING STUFF",
            "review_score": "1"
        },
        {
            "review_text": "Kevin really need's a hug at the end of the day. Poor one :c",
            "review_score": "1"
        },
        {
            "review_text": "Finally out of early access. This game is still good. The added classes are really good (except for the newest one). The leveling system works really well and it is friendly to new users as well as the verterans. Good skills and fun to learn and play as a team. One of the best games this year.",
            "review_score": "1"
        },
        {
            "review_text": "could have been called Killinger Floor  0/10",
            "review_score": "1"
        },
        {
            "review_text": "  Highly would recomend, i played when it was free for the weekend awhile back and never got to writing a review, still i highly recomend the game.",
            "review_score": "1"
        },
        {
            "review_text": "so picture Killing Floor 1, graphics bumped up to eleven. Now downgrade some of the gameplay. That's Killing Floor 2.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a Public Service Announcement:  Now that Killing Floor 2 is officially out of Early Access you may refund the game no matter how many hours you have in the game prior to official release, as long as your post-release play time does not exceed 2 hours.   Join the 20,000 smart people that have already got their money back, and refund this trashfire of a game now. End the cancer that is Early Access.",
            "review_score": "-1"
        },
        {
            "review_text": "The game felt more like a grind than the first one imo. I love the animation work and gore system work put into the game but that doesnt really fix the gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Inaccurate depiction of LSD, still fun doe.",
            "review_score": "1"
        },
        {
            "review_text": "fun   only recommend it if u are willing to play very few hours every week . otherwise don't buy this   Cons :   - Horrible graphics   - Repetitive   - Player base is Low  ",
            "review_score": "1"
        },
        {
            "review_text": "Killing room is a cool game i personally like its zombies and its premise i recommend it",
            "review_score": "1"
        },
        {
            "review_text": "Not as good as the original but still a pretty decent game. Only dissapointment is the newest class ( Survivalist or w/e it's called ) where even the community said it was dumb and we wanted a real class yet Tripwire went ahead with it anyways. So yeah apart from that its s'rite.",
            "review_score": "1"
        },
        {
            "review_text": "Game is now out of EA and it rocks, hopefully lots of post launch support just like the first game!",
            "review_score": "1"
        },
        {
            "review_text": "a complete upgrade of the original killing floor.  everything I loved about KF1 but better  my only two complaints are: somehow I get better conection to random servers in europe then the ones in my own town. and: you cant delete the crates and skins you get that you dont want",
            "review_score": "1"
        },
        {
            "review_text": "its pretty good",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful game. Does everything KF1 did, but gets rid of most of the jank that kept new players from playing. New leveling system, more different perks (that are balanced), and the soundtrack is wonderful. Only problems I have with it are the voice acting (a little too serious and tame) the quick chat menu is far worse than before (instead of numbers its more like Rockstar games weapon wheels).  Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome! Im so glad they made a new KF, but I miss the nostalgia feeling from KF1.",
            "review_score": "1"
        },
        {
            "review_text": "When does KF 3 come out?",
            "review_score": "1"
        },
        {
            "review_text": "well all i can say is not as good as the orignall but still worth a buy.Good point good graphics,for me missing new westlondon map offical.and why cant i preload my weapon like on the first game meaning you use to beable to scroll mouse and highlight your weapon across top of screen and it wasnt until you presssed your left mouse button you could use like on the fly.no such thing in killling floor 2 once you scroll your mouse you automaticly can use weapon.if you have played the first killing floor you no what i mean by the above comment it things like that little things that just polish game off.Iam trying to like it but for me there only be one killing floor the first one ,but still worth aplay.",
            "review_score": "1"
        },
        {
            "review_text": "☺",
            "review_score": "1"
        },
        {
            "review_text": "  Honestly if they did a bit more with this I feel like it would have been much better. But as it was i still really really enjoyed this short film.",
            "review_score": "1"
        },
        {
            "review_text": "this game is fun but so much bugs idk why but wehn i try to join people i cant like online matching its keep bug splat please fix it",
            "review_score": "1"
        },
        {
            "review_text": "You looking for DOOM but with zombies ? Get one. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "All the negative reviews are from idiots ♥♥♥♥♥♥ off about the cosmetic microtransactions that don't know how money works, apparently. Tripwire only asks for you to pay for the game once, and then you can play it forever as long as you like without paying a single extra penny. However, they upkeep and maintain servers and pump out updates to the game constantly, which costs them additional money. They can not fund these updates or maintenance costs purely on the initial purchase of the game alone. Queue cosmetics. And these items are literally just cosmetic. You don't need them at all, they provide no advantage whatsoever, quite unlike the microtransactions in payday 2, which were pretty much mandatory. Nope, all these items do is make you look pretty, thats it. No one complains that OVERWATCH HAS EXACTLY THE SAME SYSTEM IN PLACE FOR COSMETIC MICROTRANSACTIONS LIKEWISE TEAM FORTRESS.",
            "review_score": "1"
        },
        {
            "review_text": "Best game to play with friends ♥",
            "review_score": "1"
        },
        {
            "review_text": "deceptive developement and marketing practices, the game.",
            "review_score": "-1"
        },
        {
            "review_text": "the game is good but the conection always lost even with a high speed internet conection , i really disapointed with the conection on the game",
            "review_score": "-1"
        },
        {
            "review_text": "hey, that's pretty gooood",
            "review_score": "1"
        },
        {
            "review_text": "Great fun, a major improvement on the original in graphics and in gameplay. The new guns, classes, zeds and maps are a real step up over the original game. It's still clearly a work in progress but a fantastic game all the same.  Highly recommend.",
            "review_score": "1"
        },
        {
            "review_text": "very fun and educational",
            "review_score": "1"
        },
        {
            "review_text": "It's the same thing over and over again.  And it's glorious.   (Except survivalist.)",
            "review_score": "1"
        },
        {
            "review_text": "I'll just tell you straight up. This game is really REALLY fun. Make sure you bring some friends though. Otherwise, its kind of quiet and depressing. Lol.",
            "review_score": "1"
        },
        {
            "review_text": "This game made my transgender genitalia tingle with anticipation. 5/7 Masterpiece",
            "review_score": "1"
        },
        {
            "review_text": "The title is misleading. The Floor is not Killing you",
            "review_score": "-1"
        },
        {
            "review_text": "Ah, good old Killing Floor with new textures, new sounds, new maps ! I can feel myself alive again when i get home after work. Life is beautiful...again.  POSITIVES: +It's back! It's with us! It kicks asses! We were waiting for it, and here it is!  +IT HAS GRAPHICS! Yup! It's gorgeous now! You can bash someone's head with a hammer and observe the beauty: all the ketchup, arms, legs, teeth and whatnot ! No ears though! Monsters dont have any... Need ears!  +IT... already had sounds, BUT! Now they're more... juicy? Yes, i guess so. You can add some bass to it and listen to that music! Oh, that music! Music makes things more... thrilling? Yes, i guess so. Yeeeees those screams and blood, and... but i digress. Music, sounds, yes, good !  +IT HAS MORE PERKS ! Yes, yes, It has! We always want more of... something... whatever - then why not perks? More freedom of choice is always a good thing, donchathink? More freedom of choice to decide if you wanna be a berserker or... a black guy (Mafia3)  NEGATIVES? Let me think...  -Monsters! Monsters, yes. Almost every evil creature there (including me) is from the first Killing Floor. Sure they look fresh... and smell, but nothing really new about them... aside from look and smell.  -Maps! You see: when you kill something, you need to feel that new setting around you. Something romantic maybe? Well, maybe not... After you make a few rounds in that map, this map WILL be like a breath of fresh air, but when some... f... sonof... (though im pretty sure his name was Roger) vote for that previous map you've played, and every other... ROGER vote for that map with him (because there is not much to choose really), you will quit and go to another server.  -Field of view! I CANT SEE MAH LEEEGS !...Ahem... what i meant was: you cant set your fov to 90 or less. Only through console. It will always feel like you're using a scope or something. Everything is zoomed. Blood everywhere... those screams...errr where was i? Ah, yes!  -Game modes! Yes, ofcourse, you can shoot and crush things here (ooh i love crushing), but eventually you will feel that need, that urge to do something else! Along with shooting and crushing. Like making pancakes with raspberry jam, YUM! (only for yourself ofcourse. Sure you can add some teamplay to it and make YOUR MINIONS to make pancakes with raspberry jam for you, YUM!)  And that's it, see? Everything is still there, it just has some new features, new additions. A good sequel of that game we always remembered and loved. I Recommend  Almost forgot! Main feature of this game: You can retex and redesign everything ingame! Right in the middle of a fight! Dont like the looks of that item? No problem! Just let some clot to follow you to that item you dont like and 'retex' it with a single strike to the clot. We all know that song: 'If you dont like it then you shoulda PUT SOME BLOOD ON IT! Wuh uh oh uh uh...'",
            "review_score": "1"
        },
        {
            "review_text": "My updated review since it has just been released and I have to say its still up there with one of my favorite games at the moment. Yeah it got a lot of hate because of in game cosmetic things to buy but c'mon who gives a ♥♥♥♥ if somebody wants to change the way they look, does not give them any advantage at all so I'm not really fussed about it. My favorite things about the game include the awesome music, gun animations and sounds are really well done, graphics are superb and really well optimized so the game itself runs a treat. Plenty of maps that are very detailed with plenty of different environments. Good friendly community which is needed in a team based game. Steam workshop with loads of stuff in it making some cool modded servers. Vs mode where you can play as the zeds is also very cool. 4 difficulty levels making sure your always challenged. Now things I do not like about the game so much. Low level players going into high difficulty servers and instantly dying as a result wasting the space of someone decent that can help the team better although the team can kick them if they wish. Leveling up perks can take ages, I reckon just over 300 hours needed to level up all 10 perks playing it normally and new content updates are quite slow coming but when we do get them they are usually quite good and you can tell from the quality they take there time with things and are not rushing. All in all I'm happy with how the whole early access went so gg tripwire for that and I cannot wait for more content in the future :-)",
            "review_score": "1"
        },
        {
            "review_text": "i wish i owned this game and i didn't refund it",
            "review_score": "1"
        },
        {
            "review_text": "Edit: Got kicked for telling my team to play as a team.",
            "review_score": "1"
        },
        {
            "review_text": "goofed up",
            "review_score": "-1"
        },
        {
            "review_text": "All out Zed destruction. What's not to like?",
            "review_score": "1"
        },
        {
            "review_text": "It's so so  ",
            "review_score": "1"
        },
        {
            "review_text": "  Run devil, run devil Run devil, run I got somethin' make the devil gonna run",
            "review_score": "1"
        },
        {
            "review_text": "Bought on Steam sale, but I wish I hadnt. The game is ridiculously difficult, to the point I'm no longer interested in playing it. Two nights played and zero matches won. Can't win with a group or solo and that is on normal difficulty. Maybe I just suck that bad or maybe the difficulty is supposed to be part of the appeal, but this isn't Dark Souls and it doesn't work for me. Perk progression is stupid slow, largerly because winning is apparently impossible. You made it to a boss? Thats great, he's gonna cheese you real hard and heal most of his health often. Inviting friends and finding matches only works sometimes. Playerbase seems low and toxic. Just another steam game that I bought on imulse and I'm gonna never play.  Edit: I don't give a ♥♥♥♥ if you don't like the review. It's my opinion. Sending me friend requests so you can try and ♥♥♥♥ talk me aint gonna work. Proof of the wonderful community.",
            "review_score": "-1"
        },
        {
            "review_text": "Like the first Killing Floor but with some major improvments. I could go into dtail like most people do, but I can say hands down this will hold your intersest for hours. I didn't realize I was playing for 4 hours lastnight. Good jobs guys! Cheers!!",
            "review_score": "1"
        },
        {
            "review_text": "I feel liI feel like combine this game with some aspect of Day Z and you have he perfect zombie survival.  11/10  you can customize your fedora  ----------------------------------------------------------------------------------------------------------------------------------  Srsly tho it needs longer trader time no pub ever kills the last zed at the trader, I'd say about half my games turn into a loss because of that.   Lock out ppl from spawning in when trader time is low.  Don't lock out ppl from changing perks after changing 1 to another, like I'll go wave 1-10 as sharp then swap to gunslinger and not be able to change my gunslinger perks to 'Knock em Down' spec for boss. I know you can BEFORE you lock in gunslinger but if not possible I'd at least like a Y/N saying Are you sure you wanna lock your perks? Because I always forget it locks it since it isn't like that usually.  Being able to name your perk set ups and pick them out from a list like Stagger Spec, Big Zed Spec.  Give you a Y/N when you use autofill.  Louder Scrake and FP sfx to always know they are there.  Loud door noise when it breaks so people know, makes welding more useful.  List could go on forever but these are the easiest to fix.",
            "review_score": "-1"
        },
        {
            "review_text": "Trash.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is dead. can I refund this?",
            "review_score": "-1"
        },
        {
            "review_text": "lol crap game dont be fooled by a OK intro vid.",
            "review_score": "-1"
        },
        {
            "review_text": "First off, I want to say I also don't NOT recommend this game. I actually think it would be really fun if not for one REALLY mindblowingly annoying feature. The 'monsters behind your back' feature. This game, without exception, will make monsters be behind you when you turn around. It doesn't matter if you have your back to a wall, monsters will manage to spawn between you and the wall. Or if you clear a section of hallway then turn to deal with the monsters attacking you from behind for even a second, new monsters will be RIGHT THERE atacking you.   It makes it very hard to learn the game and very hard to play solo; which is how you get good enough to really enjoy playing the game. I've had luck on only one map the 'farmhouse' map, at keeping things from being suddenly behind me, and that's only because of all the open space. At any other time, the game will trap you against a wall, surround you with monsters and kill you.  This is absolutely an angry rant, as I like everything else about this game, and if I could actually maneuver some, it'd be even more enjoyable. The absence of the ability to run or to jump very high also kinda limits this. I mean, if it were you in tese situations, don't you think running would be one of your first priorities? How high could *you* jump if some ravening mutant was trying to eat your legs? Even if it had some kind of stamina bar, being able to run would make more sense. Add to that the fact that none of the monsters have any problem running...  Overall, I think this is a fun game. I like testing myself against it. ...but I also keep wanting to throw my laptop across the room when I try to escape a zombie, only to be unable to move even the same speed it does, or to watch as my 'professional' struggles to reload, or to fire my gun for what feels like a second then have to watch as I try to reload again, or to be backing slowly from a mob of zombies I have completely under control, only to take 5 steps and run into an entire horde of them that wasn't there two seconds ago.  For those of you thinking 'well, you're supposed to play this in a team', I never feel right trying to join a team as a painfully unskilled noob and bringing everyone I'm playing with down... and yet trying to learn this game is making it seem like all I can do is die a million times over before I'm 'good' enough to play with other people. After playing a game a million times only to lose just about the same number of times, how much do *you* want to play it more?  Lastly, I want to say this review might change. I'll get better (hopefully). Right now, I'm getting gang ♥♥♥♥♥ against the wall over and over by magic zombies who can appear out of thin air. Contrary to what the developers think, this is NOT FUN.",
            "review_score": "-1"
        },
        {
            "review_text": "Issac this game is trash lol",
            "review_score": "-1"
        },
        {
            "review_text": "It takes 2-3 minutes to get off the Splash Screen. The only servers it finds automatically I have 200-300 ping so i have to search for one myself.  Played 3 hours and I got bored, like DOOM bored, like, 'I am suppose to do this each single time I play? Kill small zombies buy guns kill big zombies, buy rocket laucher and kill the boss?' It became verry boring.",
            "review_score": "-1"
        },
        {
            "review_text": "A faithful sequel to the original game, improves in almost every way possible. There are micro-transactions but they are only for cosmetic stuff so it doesnt matter. Tripwire has a very good history of supporting their games for years with plenty of free DLC. Definitely worth a buy if you are/were a fan of COD zombies, L4D, or just love shooting zombies.",
            "review_score": "1"
        },
        {
            "review_text": "I cant even start the game up i have even set my computer to factory settigns redownloaded it a nd it still wont work i really want to play it but it just isn't working sort it out!",
            "review_score": "-1"
        },
        {
            "review_text": "  this game suxx.okay i admit i didnt have the best computer BUT i could at LEAST run it at a 30 fps 500x400 res relitivly and no i dont have money for a new computer this is why when you are developing a game GO THE ♥♥♥♥ EASY ON THE MOTHER♥♥♥♥ING GRAPHICS!!!!!!!!!!!!!!!!!!!!!!!! ",
            "review_score": "-1"
        },
        {
            "review_text": "Too much racism and corruption by some Steam Moderators against me has forced me to give this a Thumbs Down. I have been targetted by a steam moderator for some time now who is abusing his basement dwelling powers",
            "review_score": "-1"
        },
        {
            "review_text": "Still a lack of new weapons but its fun",
            "review_score": "1"
        },
        {
            "review_text": "new resistance mechanic is poop, see other reviews. typing is effort and just like tripwire I have spend none. For now, stay away until they get this in order (and maybe VS and the csgo microtransactions but we can't get greedy)  UPDATE: They kinda fixed the resistances so theres that. But they went for a copout class just to be able to release earlier and say they have 10 classes. And the crates and VS are still as useless as ever. However the resistances were what made it entirely unfun.  Cautious recommendation",
            "review_score": "1"
        },
        {
            "review_text": "Compared to the first game, I don't like it as much. The maps seem more cluttered, the guns take up too much of the screen when aiming down the sights, and the hit boxes are wonkier.   Now, other than comparing it to the 1st one, it's amazing.",
            "review_score": "1"
        },
        {
            "review_text": "I got to say it's a great game Graphics are nice new characters was good addition as well as guns look relistic and go with the flow. Except BIG thing when I play and MANY other players experience this a new clot grab mechanic.   For realism but it makes the camera glitch out for some players including me, and it makes your camera glitch to the floor/ceiling when your struggling to get away and you immdeiately die from being able to do nothing and being mobbed.  Tripwire Interactive PLEASE FIX THIS Or get rid of the mechanic completely the new mechanic is causing more bad than good. Until this is fixed thumbs down for this game because until that is fixed it's impossible for me to play at the moment I had really high hopes for this game but this is what doesn't allow me to play and it's very irritating Fix this.... Please.....",
            "review_score": "1"
        },
        {
            "review_text": "Cant Talk..Trying to pew pew",
            "review_score": "1"
        },
        {
            "review_text": "look KF i know you have been a jerk recently with your GREEEEEEEEEEEEAT updates but you know i kinda like you, you gave me love of my life *cough no joke* you gave me, ma friends, you gave me great times ty about all those oh and ♥♥♥♥ YOU for your great updates you making more playes crash with your so called STABLE game *keeps crashing my game more and more each time* and wow you really like messing up all of our old perks, so we can use these NOT fun op perks like this survivalist thing, and where is my ENDLESS and OBJECTIVE mode, dear TRAPwire i hope one day, you will forgive us for giving you 30$ and gave us those promises. and why did someone bother reading this ? eh ok good job reader. ill see you again in my steam travels, good bye  p.s: this msg was made with tears",
            "review_score": "1"
        },
        {
            "review_text": "Great game! I've played Killing Floor 1 a lot on LANs and with friends and was always a huge fun. Killing Floor 2 gives me just the same feels and is great fun with a few friends",
            "review_score": "1"
        },
        {
            "review_text": "  I kinda miss the gritty atmosfere and humor from 1st game, but KF2 is hella fun experience and looks bloody(literaly) fantastic. [edit] Why I'm taged as 'received for free' ? - I've spend 19.99 euro on this !",
            "review_score": "1"
        },
        {
            "review_text": "Got any dosh?",
            "review_score": "1"
        },
        {
            "review_text": "Finally launced and its glorious! If you love FPS online this is something you can't miss. The graphics will strain your system, be forewarned, but its does scale fairly well. All i can say after playing it for hundreds of hours since launch,is I want more! More maps, more enemies, more modes (one can hope). Very solid game experience. Scroll down for earlier thoughts...      Pretty good balance in games. Still takes FOREVER to launch on my hardware. No idea why, all other 2016 games launch in a pinch, so I'm guessing it IS KF2's fault. Hopefully, they will issue new launch code when it finally releases. stil, i don't know how many long term players will keep sticking with it. I have noticed a definately drop off in experienced players. Seems not quite dead in between new perk launches, but definately taking a snooze.  EDIT: KF2 may (read will) add microtransactions. For those of you that consider this an issue, please be aware.  This is a review of the pre-launch version sold on April 21, 2015. Will update if anything major changes.  8.5/10 Buy recommendation as of this writing.   The game is fun and well worth the low price. It currently has only 3 maps, but it is probably safe to assume more will be added in the future. Plays very similar to KF1, but with up dates, graphical mainly. So, this review is primarily intended for people who did not play the first. Odds are if you played the first one, you were itching to buy the sequel. If you never tried it before, do yourself a favor and try the first one to see if you like it. Basically co-op zombie killing waves with minimal story.  Some people have been reporting problems running the game in the forums. I did not encounter any problems whatsoever, so I can't speak to that. The game ran a little slow on launch day, not sure why, but the day after and subsequent it ran fine on my 3 year old hardware (i7 and sli 680s). i do have to say it ran my systems a little hot, with my water-cooled loop being noticeably warm to the touch.  The game itself it an update all around, with the maps being absolutely stunning, multi-level affairs. Fun in the long term, may be a little confusing to noobs. They looked great even on non-top level settings. Lots of nifty clutter make the maps seem more realistic, monster animations are great as are textures all around. Lively EDM music and good use of dimensional surround.  The game could perhaps use a little tweaking here and there in terms of balancing, but overall I would say its completely release ready at this point. I did not run into anything that stopped me from enjoying the product.  Killing Floor definately picked up L4D's crown.   Update 24 Sept/15: okie, so demo (my fav class from KF1) and pyro released, along with a bunch of new maps and some major balancing. Love the new classes, new maps are good as well. Catacombs is VERY dark. Balancing has somewhat broken the game. The end boss (and some FPs) are now virtually impossible to kill on higher difficulty levels, unless THE WHOLE TEAM WORKS TOGETHER AND KNOW WHAT THEY ARE DOING!!! But it runs buttery smooth on max settings with my Titan X!   Update: glitched on Biolab, floated above the floor for a few minutes until it fixed itself Update: have trouble connecting to some servers..the animation just keeps playing endlessly Update: definately hiting a content-wall, what I mean, running out of fun factor. Mind you, the game is still worth the price of admission, but I hope they add more 'stuff' at release. the maps are getting boring and the player pool is shrinking, with only a few noobs and the grinders remaining.",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: Killing zeds in itself is incredibly fun, and the game has the potential to become great as both a sequel and a standalone title. However, it is in the hands of a dev team that has made it obvious to their community that they care more about financial gain than the wellbeing of the game and its players. And let's be real here, 'Early Access Done Right' is a statement that contradicts itself.  Pros:  -Nice UI -Lots of graphics options -Lots of audio options, including the ability to minimize banter of player characters and enable vocals on the soundtrack -Separate adjustments for mouse sensitivity while in and out of ADS, as well as full-on keybinding -Many gameplay adjustment options including adjustable gore intensity, adjustable FOV, adjustable friendly HUD size, and the ability to enable/disable crosshairs, weapon quick select, zed kill ticker, boss health bar, welder visibility in inventory, alt pistol aim, auto-turn on clot grab, high pitch noise, and anti motion sickness -Each character has their own voice, unlike in KF1 where there was an absurdly huge selection of characters and only a handful of voice actors across all of them -Character customization -Better perk selection and customization than KF1, and leveling is actually fun rather than tedious -Optional tutorial for beginners -Suprisingly fun solo mode (which is probably where I've clocked the bulk of my hours in this game) -Hectic and fun online co-op play -Good visuals -Weapons feel heavy and powerful -Addition of a bash feature that makes it easier to keep zeds off you and break glass without having to needlessly waste ammo or take time to switch to a melee weapon -Zed types are easy to distinguish from each other -Exceptional dynamic gore system that includes permenant blood spillage as well as optional implementation of Physx Flex, which adds dynamic soft-body organs and actual 3D blood and bile to the gore -Interesting new take on welding, wherein the doors have health bars in addition to weld integrity. Thus, fully welded doors can be easily broken down if the door itself is damaged enough. Instead of respawning on their own after each wave, players using the Support perk have to manually rebuild doors that have been broken down if players want to use them again -Multiple bosses, including the Patriarch from the first game (who has gotten a pretty heavy design overhaul. I much prefer the new Patriarch design, but there are plenty of people who disagree with me) -High replay value regardless of its inherently repetitive gameplay -Mod workshop implementation -Good and sometimes exceptional user-made content -Addition of a live update system that allows the devs to make gameplay tweaks without having to constantly ship hefty updates for the game -Delivers better on the sheer joy of killing zombies than any other zombie game I've ever played  Cons:  -While the dynamic gore system in the game is great, the Physx Flex feature is exclusive to computers with Nvidia chipsets and comes across as a trial by fire for PC hardware at best, and a tacked-on (albiet mildly amusing) gimmick at worst -Tacked-on gamepad support -Implementation of a crate and key economy and Steam Marketplace integration that is controversial on its own, but was also added not long after the gaming community blew up at Overkill for doing the exact same thing with PayDay 2. Oh, and I should also mention that the game wasn't even finished when they implemented it -Only two female characters -Martial Artist perk not included in full release -Survivalist perk was obviously thrown together to meet Tripwire's ten-perk promise by the time the game left early access, and said perk is still only available in the preview build -The leap in difficulty between difficulty settings is jarring to say the least -Melee is not nearly as satisfying as it should be -Watered-down quick chat system -Implementation of a half-baked VS mode that damages Killing Floor's reputaion as one of the most prominent and well-recieved co-op titles in the PC gaming community -Other technical problems as a result of being an unfinished game, regardless of the fact that it is now out of early access -Censoring and banning of people on forums simply because Tripwire didn't like what people had to say  I will add and remove items on these lists if things get changed, or if I simply remember something I forgot to address.",
            "review_score": "-1"
        },
        {
            "review_text": "I've been playing this since early release and i must say that it's a huge improvement from the first game. Zeds are actually scary as fkkkkk",
            "review_score": "1"
        },
        {
            "review_text": "Endless bloody fun",
            "review_score": "1"
        },
        {
            "review_text": "UPDATE: Using CS:GO model now. The PAYDAY 2 community hated when the same thing happened, WHY THE HELL ARE THEY USING IT? THIS ISN'T CS:GO!  --------------------------------------------------------------------------------------------------  ♥♥♥♥♥♥♥, it's every ♥♥♥♥ing thing that a sequel should be. Looks better. Guns feel better. Zombies explode into blood and guts better. XP/perks system is better. Graphics are better. More Zeds are on the way! And... The new boss is a Nazi!  With every patch, this game is just getting better and better!  hans&amp;patri bffs 5eva &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Having never played the first game I was unsure whether to buy this, but I'm glad I did.   Pros: Slick graphics and lighting Silky smooth performance on my mid-range rig even with some of the Nvidia gore effects enabled Weapon handling feels really good and the sound design is excellent So far the community seems friendly and helpful towards noobs like me So much offal!   Cons:  Some bugs Needs more maps Needs more weapons  Pretty much everything that's wrong with it can be attributed to its early access status. This game is already very polished and a blast to play, so all they need to do is iron out some bugs and add new content.",
            "review_score": "1"
        },
        {
            "review_text": "  Tripwire is starting to try.",
            "review_score": "1"
        },
        {
            "review_text": "It's like painting, but with blood and viscera.",
            "review_score": "1"
        },
        {
            "review_text": "Instead of working on updates, they worked on microtransactions.  Edit:  They followed through with their end and more some, time frame was very off though.",
            "review_score": "1"
        },
        {
            "review_text": "Have been a KF fan for a good while now, starting off in killing floor 1. But what the dev team has been doing and what havent been doing is becoming a serious issue and plagues the potential this game has. With the Devs: lying about new to come features coming out in sertain updates, slowly updated, relatively small updates and especially for the wait time, lack of content to price ratio, not taking advantage of their talented, loyal, and patient community very little to not at all. With the way this game is turning out with the better devs leaving or losing creative control it saddens me, it feels like this game will turn out like how Payday 2 was, no love for the game, But I believe if they get on the right track and do what NEEDS to be done for the future of this game to exist they need to start it soon or people will lose interest and just stop playing and left to be forgotten as wasted potential.  As of this current date, I reccomend buying this on sale for 20$ if you get the chance but other than that i can't entirely suggest it in it's current state.",
            "review_score": "-1"
        },
        {
            "review_text": "  Sucks I suck at this game  ",
            "review_score": "1"
        },
        {
            "review_text": "I called Jason with a chainsaw a 'Wanka' and got cut in half.              Can't Complain.",
            "review_score": "1"
        },
        {
            "review_text": "Want to be a wallet? Now you can be one in the next phase of PC gaming. BE-A-WALKING-WALLET Simulator 2015. THX TW! :D  Edit: Back in the day people were rioting because of a DLC called horse armor. Now consumers starting to defend ♥♥♥♥ like microtransactions. Is this what PC gaming has become? Have your f-ing standards people!  While I gave this game a negative review at first, I would say I am just enjoying this game too much to say that it's bad. My joke still stands. :P",
            "review_score": "1"
        },
        {
            "review_text": "Uninstalled",
            "review_score": "-1"
        },
        {
            "review_text": "its all better now",
            "review_score": "1"
        },
        {
            "review_text": "this is more of a brief overview than anything else.  Killing Floor 2 is a CO-OP survival horror game where you fight off waves of zeds, (basically an army of clones) to earn DO$H from killing zeds,healing, etc.. , between each wave you are given the opportunity to upgrade your gear for better equipment and better weapons with improved firepower, rinse and repeat until the end of the final wave where you then fight a boss a to beat the round, currently there are multiple bosses with 1 randomly chosen for the boss fight,atleast 4 weapons per class (hopefully more down the road).   Aside from the lack of content in in early access, its probably the best early access purchase i've made considering the mess of certain other games, which in my opinion have been in early access for far too long and have seen too little content promised VS actually implemented. Now on release, the game finally has the amount of content i'd expect from a game fresh out of early access , and is slowly and surely becoming superior to KF1, its as if KF1 had a graphical overhaul to bring it in line with today's standards with some tweaks and updates such as the addition of sprinting and weapon bashing.  I have had no problems with stability or optimisation and overall runs solidly without any graphical glitches. (however FLEX does cause some frame drops occasionally during heavy combat)  given the way TW distributed content in KF1 with the majority of dlc being as character packs (purely cosmetic) and weapon skins(again mostly cosmetic) with free content updates (maps,weapons,some free chracters,etc..) Additionally the SDK being available practically from release in early access means there are many mods/maps already out there on the steam workshop for you to download if you get bored with just the stock maps or create your own if you feel up to the task.  combat: combat is brutal and gory with explosions fragmenting the zeds into chunks of flesh,organs and blood (depends on much you want) that redecorate the interior of the maps as you progress through wave after wave of zeds. Also,you can tweak how much blood and gore you actually want in the options and config files.  the weapons sounds are pretty good and sound quite weighty and are satisfying to use, mostly the classes are reasonably balanced (some areas do need a bit of attention but overall the main classes seem to be ok)  The attention to detail is also really well thought out especially in the weapon animation (eg. you can see the bits wobble in slow mo while firing due to the frame rate at which the animation has been designed around(the frame rate for the weapons is something like 220 fps so they can fit in more detail into the animation))  For example you can press reload with a full magazine for some nicely animated bits of gun checking/fiddling, given these dont actually affect anything within the game its a nice touch of polish to the game.  melee is also very satisfying, especially with the zerker weapons for slicing through zeds like butter.  microtransactions: you can take them or leave them, the microtrasactions are purely cosmetic, so far, at least anyway. this means you dont actually have to spend any money on them if you dont want to, however this does seem to be the replacment for skins/characters as dlc, which generally help fund more FREE content updates for the community.  overall summary: the trailers for KF2 basically sum up the gameplay in a nutshell, so if you really cant decide whether its your type of gameplay, watch them,if you dont like the look of the game froom the trailers, its probably not a game you want. (best to do some looking around at gameplay really)  hopefully they continue the crazy events like the summer sideshow etc.. from KF1  If TW keep going in the direction they are heading in it will hopefully turn out as a solid game all the way down the road. would solidly reccomend as a wave based shooter even when not on sale  Pros: +TW normally deliver nearly all major content for FREE(maps,new zeds,most new weapons,etc...) +good amount of content +satisfying gunplay +gore is well done +actually requires teamplay on the higher difficulties to succeed +new soundtrack +now has sprinting +bash feature +random bosses  Cons -probably want some friends to play this with on higher difficulties, as while solo is fun, multiplayer really is the proper experience and team coordination is a MUST on higher difficulty levels. -physx can be very intensive so you'd better have a good gpu to handle it on higher settings, worth it though.   Currently in it's current state available for purchase i would rate:   8/10 - Not for The Squeamish.     Will upate this review if anything changes",
            "review_score": "1"
        },
        {
            "review_text": "If unlike me, you have friends then it's a pretty fun game :^)",
            "review_score": "1"
        },
        {
            "review_text": "TL;DR: A much better game now that it got released.  When I was playing Killing Floor 2, I thought there was a disaster on Tripwire's hands. Balancing issues plagued the game severely in Early Access and I noticed it was way to different from the original game. But is that necesacarily a bad thing now that I think about it?  No. It's not.  This game is good for what's it's for. Now that it has been released, the balancing issues are gone and I felt the gameplay was much better now that I have gotten my chance to play this again.  Don't listen to people ♥♥♥♥♥ about microtransactions. Don't want to spend a lot of money on skins? DON'T F-ING DO IT THEN. Or spend as much as you please! I don't care! Microtransactions are not necesscarily bad if they are used good. Team Fortress 2 has a bunch of microtransactions and you can use them if you want. Alhtough buying keys in TF2 is much more like gambling. I use microtransactions sometimes and I don't think it's bad all the time!  Anyways. Short and sweet, the game works now that it's released. I am impressed that Tripwire listened to the fans and did everything right. I still like Killing Floor 1 better, but this is a good entry.",
            "review_score": "1"
        },
        {
            "review_text": "meh  EDIT: Over a year and a half of my original review of 'meh' I got the game again and now I love it. I now love it not because of updates, but because I evolved as a gamer, It's really fun just take the minute to learn the game.",
            "review_score": "1"
        },
        {
            "review_text": "Circular saw flying too slow, and there are also grenades and rpg，and the map is too small, much smaller than a generation, hoping to improve!!!",
            "review_score": "1"
        },
        {
            "review_text": "I've played a little bit. It is fun.  I've been playing since early access launch and it seems to just get better and better (Although there were some questionable balancing Tripwire has made) but overall it is getting better. I'd recommend this game if you wanna kill floors with friends",
            "review_score": "1"
        },
        {
            "review_text": "A game full of fun and gore. Graphic is good. BGM is hot. Zombies are cool. I like this game, but the sad thing is I play solo most of the time. This game should be more exciting if you have friends by your side.",
            "review_score": "1"
        },
        {
            "review_text": "If you always wanted to be ♥♥♥♥♥ by a screaming ♥♥♥♥♥ that can turn invisible then this is your game!!! :D",
            "review_score": "1"
        },
        {
            "review_text": "Almost as much fun as the original, only with nicer graphics. Especially with the  mister Torgue trader mod .",
            "review_score": "1"
        },
        {
            "review_text": "Very nice game! The devs are working very hard to give us the best of the best! Beautiful maps and powerful weapons promise perfect gameplay :)! +rep",
            "review_score": "1"
        }
    ]
}