{
    "app_id": 232750,
    "name": "Mars: War Logs",
    "release_date": "2013-04-26",
    "developer": [
        "Spiders"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "RPG"
    ],
    "tags": [
        "RPG",
        "Action",
        "Sci-fi"
    ],
    "achievements": 14,
    "positive_ratings": 1403,
    "negative_ratings": 525,
    "price": 11.99,
    "description": "An Intense Cyberpunk Rpg On the Red Planet! Mars War Logs takes you to Mars, nearly a century after the cataclysm that threw the planet and its colonists into chaos. Water has become the most precious resource on the arid red planet, with a few companies fighting a perpetual war for its control.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/232750/header.jpg?t=1505207928",
    "minimum_requirements": "OS:WINDOWS XP SP3/WINDOWS VISTA SP2/WINDOWS 7/WINDOWS 8 Processor:AMD/INTEL DUAL-CORE 2.2 GHZ Memory:2048 MB RAM Graphics:512 MB 100% DIRECTX 9 AND SHADERS 4.0 COMPATIBLE DirectX®:9.0 Hard Drive:3 GB HD space Sound:DIRECTX 9 COMPATIBLE Additional:INTERNET CONNECTION REQUIRED FOR THE GAME ACTIVATION",
    "recommended_requirements": "Additional:INTERNET CONNECTION REQUIRED FOR THE GAME ACTIVATION",
    "reviews": [
        {
            "review_text": " Promising &amp; enjoyable // Recommended on sale",
            "review_score": "1"
        },
        {
            "review_text": "I have been pleasantly surprised so far. It has a skill tree similar to Witcher 2 with the same evasion and block system (which is a plus to me as I loved Witcher), decent voice acting and good action. The exploration is pretty good and combat is fluid and easy to kick ♥♥♥ after a while.  My two biggest complaints:   1) You'll take out a bunch of bad guys whose bodies will be laying there, shown holding a weapon, but you can't take it. I really don't care, but to some this is a deal breaker.  2) The tutorials and in game tips are entirley for controller, and you have no active keyboard help (also liveable).  Otherwise the storyline has been engaging, keeping me wanting to play more and I've found myself enjoying the game throughly. Get it on sale and you should be happy, I paid $4.99 for it, definitley worth it. Regulalry $19.99, unless you're a huge fan of a this type of game I would wait for a sale again.   4/5",
            "review_score": "1"
        },
        {
            "review_text": "Single-player action RPG with 3rd person view, in the sci-fi setting. Very story-driven, that means NO for open world experience. But there are none good tale as well. Just a decent action part in narrow tunnel of somewhat 'noir' agenda.  In truth, game isn't all bad, it's just mediocre. But I'm freaked out by how it is presenting itself there on Steam: 'An Intense Cyberpunk Rpg On the Red Planet!' While it is really telling about humans on the fourth planet, it is as far from cyberpunk, as me from being a wealthy man. And 'Intense' means it is very short and linear. Not a good point to present for decent 'story rich' RPG, you agree?  I'm going to tell you about my experience with the Mars: War Logs, so there will be some minor spoilers. Sorry for that, if you don't want any spoilers - don't read any reviews on that game before playing! But I suggest you to look the other way, there are plenty of games of much greater value.  There are many comparisons for this game to others. Somehow, Mars: War Logs are truly looks sometimes like Mass Effect or Star Wars KOTOR 2... But these moments are rare and second-handed at best. In other words, all what is that game going to show you - already been somewhere.  Take a first act, for example: you are in the prison, and you're going to make escape from there. By stealing a train, for that you need some guy at generator, and some guy from the guard. And weapons. Funny, but ALL of these were in russian game Planet Alcatraz (2009), where you also starting at the prison, and gotta run out on the train. Only difference is what in Planet Alcatraz you can trust only in yourself in that prison, so you need to choose: either make yourself an electrician, or try to evolve in a guard - to get your hands on weapons and make ways to the train...  Okay, I'm feeling I'm skidded away. Let's forget for a moment all other games, movies or books, in some way similar to our Mars: War Logs. Let's just look at it. For what gaming experience should we pay our money?  Story? Well, it's sketchy. Bleak. At the end of the 2nd act you need to decide whoever party you'll side with. But truly, none of those parties are good choice for you. And, which is more - even that most affecting choice doesn't really changing anything for the player. Maybe except for the game achievement. But we know what genuine achievement hunter want all achievements, so he's gonna play for both parties. I suggest start with the Rebellion, and then for the General, it seems scheduled in that order by the game plot.  World? Well, we don't really see Mars. Or participating in war, like it shows in the title. There are decent background, but it is absolutely static. In the worst way. Side-quests are about running from A to B, beating some guys, returning back. After that in point C appears some other quest person, and it's going further, to running to the D point - to beat or scare another bunch of losers. And the most annoying part is what sometimes some scripts aren't working properly, and you unwillingly skipping from A to D point, without even knowing what it was. Example? There are many, but side quests with romance line(s) are coming in mind first.  As for visual part of showing the life on Mars... well, it's nothing pretty. No John Carter stuff there. Dirty suburbs where we hanging back and forth, that's all you'll gonna see in the whole game. Sounds are nothing spectacular too. Music is boring and forgettable. And voice acting... it's not That Bad, as some other reviews are pointing, but since all characters in the game are pretty obscure, their voices aren't really helping to bring them some personality. Pity on that.  Finally, action part! Can you fight in this game? Yeah, there are decent battle system. You mashing people with your mace in the right hand and shooting with some nail gun from the left hand. Also you can cast some spells, like electric bolt, or stunning wave. Or you can throw grenades and mines. It helps in the fight, but, since the resources are scarce, you're still need to bash people with the stick. No power-chokes there.  But then, combat part is decent, but not really good. It is imperceptible at normal fights, but bosses are turning everything down. They are too easy to beat. And even easier to be shot. There are only one out of the line boss fight in the 3rd sequence, where you meet some challenge for the boss. But alas! It's only because of it's health bar, other than that - same boring stuff.  Synopsis:  1) game is not original. Not in the scenario, neither in the action part. And over the most of all, it is treating you not as an associate, a hero of adventure, but strictly as a player clicking the buttons behind the screen. There are no place to dive, it's knee-deep at best.  2) I can suggest you many games of much higher value. Even for the action part, which is the most satysfying in the Mars: War Logs. And I'm not talking about AAA titles, like Mass Effect or Deus Ex. If you are looking for well-written story where your actions are really changing something, try Alpha Protocol. And if you are up to the good trip, try Risen 2&amp;3. And if you are really want a sci-fi story, there are a fine gem of forgotten games, Septerra Core.  As for marks for Mars: War Logs, it would be 6.5/10, for the effort, and almost working scripts. It is almost a good game. Not worth buying though.",
            "review_score": "-1"
        },
        {
            "review_text": "Mars: War Logs is a very average game in many regards, it is clunky, not polished, subpar voice acting, a mildly dogdy story with sudden weird turns and not exactly good writing. Yet at the same time, Mars: War Logs has something most games today miss: Soul.  For an Indie RPG, it's pretty good, but it is far away from any AAA titles. Still, I do think it was worth every penny.",
            "review_score": "1"
        },
        {
            "review_text": "★★★☆☆ This was a really cool game, the fighting style takes a bit getting use to, the voice acting isn't THE best and also the drive to complete the game is quite minimal, but if you look past those faults this is a really nice game , and I would recommend it :P , so go get this game and force yourself through some of the boring parts and have a nice fulfilling experience 3/5!",
            "review_score": "1"
        },
        {
            "review_text": "I was looking for a cyberpunk game to play and this rolled across my lap. There is a karma system but I didn’t see it come into play too much. The crafting system was a bit strange, useful but not exactly a game changer. The only real annoying part I can say was that combat took a while to get used to and the camera, even when locked on to an enemy, didn’t cooperate in a useful way. The world building was done well though and I finished the game twice wanting even more plot.",
            "review_score": "1"
        },
        {
            "review_text": "  I recommend this game if it's on sale only.  This is a short story of a game with an interesting world that the game itself doesn't do much justice. Uniteresting set pieces and a general everything is rust or mud color scheme take away from it, the morality system is broken but at least adds something to it to desperately try to make work. The combat is fun when it works but as soon as their are more than 3 enemies or it's a large horde of those damned mole rats it tends to just go to ♥♥♥♥ until you throw a grenade. The voice acting is tolerable but has it's atrocious moments and they don't have much in terms of awesome cosmetics. You also get stuck with basically 1 crappy ranged weapon and pipes of sorts as the end game goal weapon to upgrade. The side quests are easily missable in a few cases and don't clearly lay out when you can totally miss one, despite all this however I didn't completely hate my time in this game, it had a lot of potential and I enjoy the core concepts(more or less)   If you don't mind looking up quest info from time to time and the tedious loot and craft system that is manditory for success the game does satisfy for some reason and is worth picking this title up on sale.  My friend owns this and Library shared it with me, I wasn't given a free copy by the developer or anything like that.",
            "review_score": "1"
        },
        {
            "review_text": "3rd person, action, RPG with melee combat.  You play as a Technomancer, a gifted individuals who are forced to go through hard training to master their force talents. Story takes place on planet called Mars, in time of war and poverty that followed soon after the colonization. Story is about different groups of people fighting for control over the land and resources.  RPG element includes three character skill trees, perk system, weapon and armor modification and crafting of support, utility items (like medkits, explosives, etc.). You have a variety of abilities available, some allow you to enchant weapons, others protect you from damage like electric shield, some do damage or stun enemies like arc lightning shock, etc.  You mainly use melee weapons, like metal pipes modified with different attachments you make with metal scraps and hardware found throughout the game. Ranged combat is really limited to one shot nail guns, grenades or Technomancer electric abilities. You can craft and place traps, that are useful if you're surrounded by enemies.  There's decent amount of missions and side missions available, some have choice and effect element, so pick your answers wisely. Good amount of voiced dialogues. Reputation system in game was a bit weird, I didn't change from Neutral all game, though I didn't do anything bad, nor did I juice the downed enemies. Main currency in the game is pretty much human blood, as far as I understand, and was kind of weird.  You can have followers in game, five in total, two of those can be chosen by joining one or other group of people, one is partially available and two are available pretty much throughout the whole game. Two males and three females as far as I could tell. You can romance females, if someone wondering, though there's nothing special, just hugging and groping.   Visually game looks poorly, a lot of low resolution textures for 2013 game, model quality is bad, animations are poor, voice over quality is decent. Game has a lot of glitches, texture clipping, hovering objects, bad lighting and other sort of things that could be fixed in post-production.  Overall game was fun experience, but lacked serious polish. Some missions were hilarious, I also liked typos in text that made no sense, and weird naming for drugs and nurses advice for cutting someone's jewels off. Don't know if it was intended, but apparently you can bed both female followers and then chose which one you like more.",
            "review_score": "1"
        },
        {
            "review_text": "It's good. Read the other positive reviews.   It is worth £12. It is a reasonable length without being mindnumbingly long (i.e. skyrim). Completed in 27hrs which is slower than most, but I like to take my time and explore.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly, this game is really good. I almost feel bad paying like $5 for this game.",
            "review_score": "1"
        },
        {
            "review_text": "Fairly entertaining game. Being older and indie it won't wow you with the graphic fidelity, but it does have a decent story and interesting skill progression. I really liked that they didn't go with 'Good' vs 'Evil' but two differing but equally questionable shades of gray. Gear customization was pretty good, but the overall variety of gear was a bit lacking. The fight system isn't too bad, it's nice that its more involved than 'hold block and click attack occasionally' but at the same time it's not animation interrupt level fighter complex either. Overall I'd easily give it 3.75 stars out of 5 with the camera INI tweaks from the forums. Without the camera tweaks it's damn near unplayable.",
            "review_score": "1"
        },
        {
            "review_text": "This is more of a 'thumbs in the middle review' since I can't pick it that option.  The thumbs down is based on the full price of the product (14.99), I got this game on sale for $5 durning the summer sale.  Pros:  A good Mass Effect/Dragon's Age knock off type of game with a Sci Fi Mars theme. I don't think I see many games based around Mars, with that, they did a decent job. Fast Pace Combat Good menu system overall for doing quests and such. Limited resources which makes the game feel challenging.  Cons: The story was okay, but felt very rushed while a lot is explained it's own version (War Logs) of it's Codex; I feel the game should have explained this in a bit more detail. Roy the main character of the story is still a mystery to me and a lot details wasn't revealed about him. Wheather or not this was intentionally, he just felt empty of a character.  As for other characters, except for the first character/party member Innocence everyone's story felt rushed. Mary the other character is the only othjer one that didn't feel too rushed as her storyline was cut and dry.  For other aspects of the story, it really felt rushed and while I could tell I was near the end, the final moments felt really anticlimatic. Romance options are in this game but they too, are very rushed and other than a few dialog options, They're easily romance and don't build up to the point of snoo very well. Wanna go out? Sure? Ok that's that.  Short game under 20 hours and VERY linear aside from a few side quests. Combat and such is cut and dry while there's a few tactical things you can do it's more near a button masher for most of the fights. Sometimes hit detection wouldn't hit on enemies.  Overall not a bad knock off of Mass Effect but there's a LOT of room for improvement. If it's on sale it's an overall decent expereince.",
            "review_score": "-1"
        },
        {
            "review_text": "While not a spectacular RPG, Mars: War Logs is still able to introduce to us a different/interesting setting: How many Rpg's nowadays are set in Mars?  The story is great and the lore as well and it's not forced upon you. You know what you want to know, that's something that i enjoy in these type of games. The combat it's a little bit wonky but it works, the customization and leveling system are done in a interesting way, i enjoy the fact that when you change something in your armor/weapon it shows a different plate or handle because of the changes you made to that object. I think the major issues of this game come from the low production costs that it had, you will see a lot of repeated NPC's with nothing to say, the voice acting sometimes is great sometimes not (for ♥♥♥♥ sake Mary...), the story ends in a abrupt way. But it has strong points as well for example the decisions you make will have a strong impact in the outcome of your playthrough and graphically i found the game for the most part well modelled with good lighting effects. Pick it up on a sale, but don't expect a massive world like Skyrim, or Mass Effect or even Dragon Age.  It's a solid game.",
            "review_score": "1"
        },
        {
            "review_text": "Best Bad @$$ Hard Sci-Fi RPG I've played since finishing The Mass Effect Trilogy. It takes a little getting use to the controls but once you do it's all sterling silver!",
            "review_score": "1"
        },
        {
            "review_text": "I liked the game A LOT. Personal preference though, as It is visibly cheap. And in places it really, really shows. But it feels nice, is unique, reminds me of Chronicles Of Riddick. It is not polished too much, but it is an awesome game at it's core. If you are not easily distracted, I recommend this title.",
            "review_score": "1"
        },
        {
            "review_text": "The story and atmosphere are really good, and the combact system interesting with its mix of timing and skills choice to win fights.  The only problem is that it results a bit gimmicky in the end, and at higher levels you are going to use always the same moves to survive (i.e. roll away like there is no tomorrow). Anyway an interesting game to buy when on sale. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "story and art design aside...this game is a clunky mess...from the hit detection, to just basic movment it feels like it was never fully flushed out.",
            "review_score": "-1"
        },
        {
            "review_text": "I really wanted to like this game. The moebius-esque images of the 'technomancers' with the total recall setting of mars really caught my attention.  The truth is this game is the proof that small studios should not do 'open-world/areas' RPG games.  CONS:  * NPCs: The game presents you with small areas, supposedly cities full of NPCs, but reallity is they dont feel like cities at all. NPCs are no better than crate boxes just standing there, they stay in the same position 24/7, they don't even react when you are fighting enemies 1m away from them. The only NPCs you can talk to, are marked in the minimap so that you can rush directly to them, they are normaly vendors or quest involved characters, 3 or 4 per big area, and are very shallow and uninteresting characters. You'll forget them immediately.  * Quests: Quests normally are take this item to the other end of the city, or kill this guy and come back, which you get really bored of at the third time, even if they try to call the objective something else.  * Maps: The minimap is horribly implemented, to the point I try not to use it, even though it is essential for not hitting dead-ends while you run around the city, dead-ends are extremely common and add to the destroying of the city feeling, there's normally just 1 or 2 paths from point A to point B.  Normally, when you start a new area, you can open your minimap and guess which of the areas will have enemies (it's always the ones which look like big rooms for you to roll around to avoid enemy attacks, opposing to the rest of the city, which are just corridors). For some reason I really don't understand, each city, or area, is divided by some shut-doors, or barricades, which you have to interact with in order to advance. They introduce no apparent loading-time, so they just break even more the feeling of being in a real city.  * Enemies: Enemies for some reason know you are a threat, even though they have no way of knowing it, at least in the early stages of the game. They just attack you on sight. There's some enemy respawn too, I'm not sure how does it work, but it is very annoying when you have cleaned a now full of enemies area less than 10 minutes ago.  PROS:  * Fights/Crafting/Skill Tree: The fighting is melee based, where shooting is just a special ability. This, along with the crafting abilities and the skill tree, are very decent. They all remind me of The Witcher 2, they are very similar. The fights, even in normal difficulty are tough, you die a lot, which require you to do somekind of planning or preparation before confronting enemies.  * Plot: If you can ignore all this gameplay wrecks the game presents, the story is somewhat interesting.      I feel like this game could have been incredible if more depth had been added to it, but I have to say I do not recommend it. I got it for 2.65€ in Steam sales and I still payed more than what it's worth.",
            "review_score": "-1"
        },
        {
            "review_text": "This game starts great, but as it progresses its quality diminshes substantially. At the end, you are running down tunnel after tunnel only hoping that the god-awful plot will improve, because it was kind of fun at the end. Oh, and the best weapon you get in a futuristic RPG is a steel bar. In fact, the only weapon is the bar. Really, guys??",
            "review_score": "-1"
        },
        {
            "review_text": "As a curiousity purchase for some really low price, this might be an interesting game to check out. Especially if you like studying games from a design standpoint. As a full (even if low) price story driven action RPG, Mars: War Logs isn't very good. Story never picks up, partially because of a rather bad translation, partially because everything in the game is fit into very claustrophobic locations and it's hard to take anything seriously. Characters go from 'we just met' to 'like family to me' in 15 minutes, with no indication if in-game time flies differently from player real-time or not. A lot of plot threads get hinted at as being important and grand, but then just kinda resolve in the most disappointingly boring way possible. Gameplay-wise, it's also pretty badly put together. Combat has some nice ideas, but they never work properly. You constantly find a lot of crafting stuff and money, but there's almost never a need to buy anything and best weapons and armor for the chapter (of which there are 3) are available from the start, so when you can just wait to find or buy best possible stuff you need, upgrade it in the best way you need and play out the rest of the chapter without ever caring about it again. So, by the end of the game you have tons of money and stuff you don't need at all. Skill system is also rather weridly done, as the most useful skills are in the combat tree and by the end of the game you'll have enough points to max out it and about a quarter of another skill tree, so focusing on anything else feels like a waste. And one of the trees is not even available until the second chapter. And companions are useful only for diverting attention from you, but useless otherwise. Also, there is a morality system, which simply doesn't work. Or, more specifically, it seems that I did finish the game as a best guy ever, since merchants talked about giving me a discount (which is a feat for being 'good'), but in-game menu always showed me as 'neutral' and 'good' feats were showing as locked. It is a shame, though, really, since there are some nice ideas here and there and the game world seemed to have been put some thought into. Game also looks quite good, with its own distinct colorful style. But the game is so underwhelming and frustrating and most of the time simply boring, that it's hard for me to recommend it. Unless there's a big story RPG itch you have, and you can't scratch it with countless better games. Like Rise of the Argonauts, for example, which is actually a better game.",
            "review_score": "-1"
        },
        {
            "review_text": "Mars: war logs. This isnt a bad game but it isnt particularly good either. It shines in the first half introducing a Sci-fi prison break sequence which is of great enjoyment but a tad long. During the first chapter you are introduced to a limited skill tree with either Brute or rogue as your choices becuase mage is left till you exit part 1. Story wise I actually really liked this game but the story left a longing for the epic backdrop painted in so many conversations. the war logs sounds like it should have an epic lore, but your left with a very mysterious character who never really gains a solid back story, in an environment that never seems to be more than a few blocks in the back of a big city. This man is trying to find freedom as a nomad rather than a techromancer, relying on his skills in combat to keep him out of trouble. The combat in the game was rather basic, assassins creed-esc parry, attack system, with crafting on the side. Overall this game is a nice pickup at a low price if your looking for a sci-fi rpg that is out of the ordinary. 5/10 Exceige",
            "review_score": "-1"
        },
        {
            "review_text": "Had no idea what to expect... was very pleasantly surprised. Excellent RPG similar to games like Star Wars: Knights of the Old Republic.",
            "review_score": "1"
        },
        {
            "review_text": "Many people write this game off due to the fact that it's a bit... off... not refined or polished but it is not a AAA title so if you manage to overlook its looks, which is tad bit ugly, and somewhat clunky controls it is quite fun, the story is interesting, not to mention there are some twists here and there, there is rudimentry crafting and skill system, interesting... ish... dialogs and characters, so if you manage to get it for a discount price do so, I doubt that you'd regret it...",
            "review_score": "1"
        },
        {
            "review_text": "This game is well worth the $15 they are asking for it. If you are patient you can get it on a steam sale for much less. The game has a good story and to my surprise great voice acting. The combat system and leveling system was very thought out. If you don’t rush through the content and complete most of the side quests you can get 20 hours of play time in to complete the game. Over all I would give it a 7.5 out of 10. Don’t overlook this hidden gem.",
            "review_score": "1"
        },
        {
            "review_text": "Great Game, Fun to play with an interesting story, not the greatest of combat systems but not much of a detractor ... I would buy the sequel if one was ever released.",
            "review_score": "1"
        },
        {
            "review_text": "I'll give the short version first. :)  The best way to describe this game is:  Imagine the spawn of a brief torrid threesome affair between The Witcher (the gameplay/combat), Fallout 3 (the atmosphere) and Mass Effect (the story setting). Take out a bit of awesomeness from it. Add the russian guy from GTA IV (on acid) as the protagonist aaaaaand... Congratulations!... It's a 'Mars: War Logs'! :D  So, this is a 'safe' game... It picks up on stuff used succesfully countless times on other games of the same genre and repeats them competently. It doesnt have any 'great new features', the maps or the history arent huge master pieces. Actually the questline that goes along with the story is pretty straightforward and the maps are short and simple. But the graphics are pretty great, the game is well built all arround and it's fun!  I mean.. Werent you furstrated when you ended The Witcher, or Fallout 3, or Mass Effect? I admit i got lost and purposeless! I was loving the games and they ended... So, i know it's not the same, but with this game you can pick up from that 'orphan' feeling those great games left you with and keep the fun going a little while.  And for the money it costs... It's worth it!  7/10   Now, the boring and long version.  So, this is the tipical 3rd person action RPG that takes role in an improbable future where mars was colonized and, naturally, there's conflict because every 'major power' wants a piece of it. You start as a POW, inprisoned far behind enemy lines. As you work your way out of the prison, and after, running from your former cagers, you start unfolding a deeper plot concerning older inhabitants and their powerfull knowledge... Bla bla... Cliche... De ja vu... And 'play it yourself to find out'. ;)  You'd expect that a game happening in a future far planet has all sort of advanced weapons, rayguns, guided missiles and stuff but.... no... Its more like 'Post apocaliptic future in mars', so you'll use mostly pipes, hachets, bones and such as weapons. Combat is mainly melee, ranged weapons are used more like a complement in combat and later in game you'll develop some 'technomancer' powers. These are basicaly 'Sorcerer's magic' but based on technology.  I think the rate this game got with the critics is unfair. The game is not 'epic' (as the graphics might suggest) but is very decent entertainment. The story is engaging. The character leveling up keeps gameplay fresh and interesting. New skill and abilities are meaningfull and will keep you focused. As gameplay is concerned, you'll find it very familiar overall and will constantly relate to similar features in other games. The characters are built well enough, although i confess i hasnt able to create any 'deep emotional connection' to them. It was hard to feel empathy and maybe because of that i never really connected to the game atmosphere.  Concluding, the game has all elements to keep you interested for a while (if you are into this kind of game). But you must be carefull and dont fall to the tempation of comparing this games to the 'giants' of the genre or you might end up feeling and thinking the same as the critics that rated this game with a 5/10.  As mentioned earlier: a solid 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is a weird mixture of engaging, interesting, and silly. The combat's is really cool, sort of reminds me of the witcher 2 with a teensy bit of Arkham Asylum. The story is overall pretty good, with a lot of lore to pick at. The voice acting and writing however is just awful. It makes the game really funny for me, but I imagine some people might get ♥♥♥♥♥♥ at the ear-gratery of the voices. Give it a shot though. Sci-fi RPG's are few and far between...",
            "review_score": "1"
        },
        {
            "review_text": "Well done RPG intrestinmg wolrd an story and a well worth 20€",
            "review_score": "1"
        },
        {
            "review_text": "its a good game. should have a higher score than its got. i look forward to a seqel.",
            "review_score": "1"
        },
        {
            "review_text": "If you love RPGs youll get along well with this game.",
            "review_score": "1"
        },
        {
            "review_text": "THE GOOD: A strong story, choices that drastically alter how things end (But not in terms of playable content, just storyline)  THE BAD: Uneven voice acting, somewhat repetitive combat, no AI gear management.  THE BOTTOM LINE: This game is strictly for RPG lovers. If you enjoy the genre, this is definitely one to play. The game is a lot like a low-budget Mass Effect. Give it a try with realistic expectations and you'll likely be pleasantly surprised.",
            "review_score": "1"
        },
        {
            "review_text": "Well, finished my first playthrough and even if the game's not perfect it's much better than I've awaited after I've read all those bashing reviews. While I don't get where the hell the game is supposed to be 'Cyberpunk' I must admit I really enjoyed the fresh and unused SciFi-Mars-Setting. It's true, the plot starts unbelievable great but is not able to hold this level through the rest of the game, but there are still moments (No Spoilers here!) when the story bashes your stomache like a good book. Since there are some desicions to take, I'm going to do (at least) another playthrough... I just wish there was an 'New Game+'.",
            "review_score": "1"
        },
        {
            "review_text": "So far this game is surprisingly good. Its like a Martian Prison-Break RPG. Made by a french company i guess? Really cool so far. Some weird graphical glitches, but nothing game breaking.",
            "review_score": "1"
        },
        {
            "review_text": " Mars: Wars Logs    Description:   An indie/rpg style game. Set on a post-apocalyptic Mars, your character is thrown into a power struggle between factions. The atmosphere sort of reminds me of a steampunky dune, complete with electric magic, sneaky face-whacking, political backstabbing, a bit of romance, and even a   sandworm  !   Pros:    The atmosphere is interesting. Drab, desert-ish industrial themes, with little splashes of color or variation.    The commerce system is simple, but effective. You can buy ingredients to construct upgrades to weapons and armor, or scavenge them from the environment.   The combat system is different from anything else I've used, but easy to get the hang of. The first chapter is a bit slow, and gives you plenty of time to get your bearings before throwing you into the thick of it.   The general plot and main characters are interesting enough, but some of the voice acting (especially for minor characters) is less than stellar, and in a few cases, downright bad.   The perk trees are nicely done. Basic, but they allow you to tailor your approach to combat to suit your style of play. The perks come in three trees, Stealth, Ranged Attacks and Healing, Manual Combat, or Technomancy (magic). Each tree has a few tiers of perks that unlock as you purchase items in that string, and each perk has three upgradeable layers of effectiveness.    Cons:    The visuals are drab, and this can make it a bit hard to navigate, simply because you're visually bored.    The side quests can be too vague. I had to resort to a walk-through for one in particular...turned out I had already missed my opportunity to complete the task.    It's a damn short game. I took my time, and it only took me 10 hours to complete.   The alignment system is janky. It makes some actions (ex. harvesting serum from downed enemies) obviously 'bad', but it doesn't give you any direction or input as to how to navigate these choices or check your progress. I made 'good' choices all the way through, and still finished the game with a 'neutral' alignment, preventing me from taking advantage of the various perks attached to either of the divergent character paths.     Overall, a good diversion RPG game, to play in between titles like Skyrim and Mass Effect. Maybe not worth $15, but I'd recommend buying it when it's on sale. ",
            "review_score": "1"
        },
        {
            "review_text": "Easy 8/10 Pretty solid story line. No real Plot Holes. Boss fights weren't exactly easy, nor were some regular encounters. Overall it was exactly what I was looking for. It wasn't terribly long, but I could've made it longer had I done all the side quests. I imagine I missed quite a few because I suspect you could level your character up all the way and my guess was missing more than a handful of skills, let alone maxed out skills. Like I said, the devs did a great job.",
            "review_score": "1"
        },
        {
            "review_text": "7 out of 10 Mars War Logs is an okay RPG not super but okay there is a good story in the game but the game is too short about 13 hours gameplay",
            "review_score": "1"
        },
        {
            "review_text": "An ambitious game from a small team with big ideas. It's clear the game takes inspiration from BioWare-style RPGs, though it seems to suffer from a lack of budget and manpower. It's a flawed game with a lot of potential, with an interesting crafting sytem and a fairly unique, immersive setting. Definitely worth picking up in the sale, and even full price if you're into RPGS.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome Game. Awesome story. I only wish there was more! so ..... hey guys how about some DLC???",
            "review_score": "1"
        },
        {
            "review_text": "Not bad overall, the story was a bit lacking but sort of the same feel as the Mass Effect series.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it on discount for $5 - so far I am enjoying it.  Voice acting is mediocre at best, but the story &amp; setting combined with the combat mechanics makes it enjoyable.  A good distraction and entertainment value if you find it on special.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it for 2.99 and thought it was really short and clunky in places but, can really explain why, fell in love with it. It is one of those good 'bad' games. The combat was fun, even if enemy variety is scarce, and the skill tree is meaningful. I liked the branching story paths and the dialog choices even if every voice actor employed sounds like a drunk that just came out of a bar and all the villians sound like cut out comic villains. But, after all this and being the budget kind of game that it is, It is really fun and, in the end, fun is all that matters.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 - A gem in the rough.  If you love the Witcher 2, you'll enjoy this one. This game seems to have closely watched and learned from that game. Although somewhat short (about 12 hours while also doing side quests), this game has the making of something great. The world and characters are intriguing, although the game is a tad too short to really flesh it out. The combat could use some tweaks here and there, as there are big difficulty spikes: once you're comfortable with one class of enemy, a significantly tougher one is introduced. This is fine, except for the fact that these tougher enemies come in packs of at least 4, which can be overwhelming until you upgrade your gear.  Would love to see more from this IP in the future, preferably a tad longer and with some more polishing.",
            "review_score": "1"
        },
        {
            "review_text": "This game was a very nice surprise. It is not very polished in some aspects, but overall the fights are always challenging (you never become too powerful, if you make mistakes you can die very quickly), the story is interesting with the second half of the game changing based on your faction choice (although other choices you make don't seem to impact the game on such a wide scale), the dialogs are good (although the voice acting quality is not always as good), the pace is consistent throughout the game. The game is not too short, either.  So, all in all, I would define it genuinely good and very enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Ide Say its a decent RPG. its somewhat fun. acting is kinda bad. not very many decisions you make. the good/evil system sucks. looting/stealing life serum/hiding bodies can be a long boring grind....the item system would be much better if you wernt limited to like 5 dif suits and 5 diff 1 handed weapons... thats all you get besides a nail gun that you dont upgrade... but for the price tag its a bitt entertaining the skill build is not real bad fighting mechanisms arnt to bad so would i but again? if on sale yeah",
            "review_score": "1"
        },
        {
            "review_text": "Really good game considering its low budget but they set a fair price and its worth paying the admission",
            "review_score": "1"
        },
        {
            "review_text": "Somewhat clunky but fun and imaginative game/setting. Not a AAA game but a solid buy on a deal/ discount.  A decrepit mars colonial feel is a nice mix of settings and the lore is quite nice. Technomancy is a nice take on cyberpunk magic. Combat is not like most games and requires you to set up with grenades, mines, and nail shots.  Story is quite strait forward but above average. Voice acting sounds like non English people speaking English but plays well with the setting.  Gear can be customized and adds a nice bet of looks/use/variety. ",
            "review_score": "1"
        },
        {
            "review_text": "Loved it a bit more than I originally thought.",
            "review_score": "1"
        },
        {
            "review_text": "Released in 2013? Man, it doesn't feel like it has been that long. I loved my first playthrough of this game. Open world? No. Great story? For sure. I think I'm about to start a second playthrough, it has been a while...",
            "review_score": "1"
        },
        {
            "review_text": "The game is a little short, but solid. I had fun.",
            "review_score": "1"
        },
        {
            "review_text": "Rough around the edges, but it's a pretty good game once you rough through the first chapter.",
            "review_score": "1"
        },
        {
            "review_text": "World building and backstory is superb. It's about as 'open world' as Dragon Age - technically lot, but quite big nonetheless. A solid action/rpg with a lot of polish. If I'd paid £30 for this game I would not be disappointed, but I would grumble about the smoothness of the gameplay (short delays for animation and so on). But I didn't, I paid the full price of £12 and for that I'm very happy.",
            "review_score": "1"
        },
        {
            "review_text": "its a good game but it sucks at the same time, the game dose not have radar so find things and people can be hard,and the fighting can be kind buggy buy story line is good and if it got a few patchs like radar but i still do think you should try thr game aside from a bug or two its really a great game",
            "review_score": "1"
        },
        {
            "review_text": "Basic hack n slash rpg with a c rate story line",
            "review_score": "-1"
        },
        {
            "review_text": "i dont know why the Focus company keep releasing games with the same awful combat system",
            "review_score": "-1"
        },
        {
            "review_text": "This game is extremely clunky. I normally really enjoy games like this, but the controls/action were a real downer. I might give it another go someday, but it really put me off on the first play.  Cannot recommend, 3.4/10",
            "review_score": "-1"
        },
        {
            "review_text": "FIRST CONTACT - NOT BAD. If you ever played The Chronicles of Riddik, you will find more or less same basis argument. You need to escape from a prison (what original!). Main plot history is still to early to determine how good is it. As in any RPG, side quests around. What I am not so happy is with the game interface and controls. 3rd person game, with unnatural movements, difficult to control fight movements and so on... you know what I mean. If the plot history worths it, then the game will be good. If the plot history is just annoying, the game will not worth your time and / or money",
            "review_score": "1"
        },
        {
            "review_text": "I think it's a good game. I really like the graphics and the gameplay and the story is decent, too",
            "review_score": "1"
        },
        {
            "review_text": "7 hours of gameplay! Woth it!",
            "review_score": "1"
        },
        {
            "review_text": "You beat people to death with pipes on Mars, not bad.  11/10  p.s Just like Games of Thrones they did, the longer you play the better the combat gets, it really does have a lot of depth. Also you get more companions halfway through the game. Really finishes strong.",
            "review_score": "1"
        },
        {
            "review_text": "Meh. If you have two hours to spend but otherwise overall score is 'meh'.",
            "review_score": "-1"
        },
        {
            "review_text": "good game , good story, to bad is to short",
            "review_score": "1"
        },
        {
            "review_text": "Feels a bit old, but still ok to play if your expectations are not too high. Not really that open and quite linear. Sometimes the order of side quests matter (e.g. in the first map). I have encountered no crashes and it worked flawlessly under win 7.",
            "review_score": "1"
        },
        {
            "review_text": "Simply looking at Mars: War Logs for what it is, I found a very enjoyable, fun and slightly different RPG that has a really interesting world and some promising game concepts. I really enjoyed my time with the game and played it twice to try different builds, difficulties and to see all of the story.   I do recognise that there are limitations in things like the size and variety of the game world, limited weapon and armor choices, some voice acting etc but this is also a title by an indie developer so you expect some compromises compared to big devs. As a first effort in a new game universe I think it has potential for a sequel where the good parts of the game like the combat, character development, quest choices, crafting and the world itself could be fleshed out some more to make a top notch title.",
            "review_score": "1"
        },
        {
            "review_text": "The gameplay in this game basically consists of wading through a leper colony whacking people with a lead pipe. There are guns, bombs and mines in the game, but they are inferior to THE PIPE. There is electric magic, but the pipe still wins.  The typical gameplay: you go through a corridor, ugly crippled people sit by the wall and look at you, a enemy soldier appears at the other end, you rush to him and beat him down with your trusty pipe. Then go to the next corridor and repeat.  There is a crafting system too, you can add a leather grip to your pipe, and tape a tooth of giant lizard to the other end to increase its DPS.  The graphics is ugly, but this meshes well with the general atmosphere of lost war, ecologic disaster and general desperation, and almost seems intentional.  The game works, there are no bugs, you can complete the quests and advance along the plot line, but ... you know... this endless pipe fencing is just not fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Really wanted to like this game. The post-war style I liked, but the whole game feels really clunky. Controls are not very clean, it feels like my character is running through molasses half the time.",
            "review_score": "-1"
        },
        {
            "review_text": "Very Nice Game the Graphics Are pretty good around dragon age origin Graphics maybe abit better. the Story is quite good if abit short but given that this is more of an indie title, well a small developer title very good, the combat system is again very nice it also reminds me abit of dragon age origin but foucus more on the single character than a party of characters.  the Skill tree system is about what you'd expect not the extentsive but it still quite nicely done, overall Mars: War Logs is a very nice if small Game you can expect around about 10 - 15 hours of Gameplay out of it on a single playthrough but there are different endings so there is some replay value if you are that way incliend.  i'd give it a 7/10 or 8/10 leaning more to the 8/10 give that i pretty much played through it quite religously",
            "review_score": "1"
        },
        {
            "review_text": "probably one of the best games i've played that wasnt some big company like microsoft or bungie or what have you. learning the controls took me a little bit but that might just me.",
            "review_score": "1"
        },
        {
            "review_text": "this gamehas combat setting so can tuned to your style of play you can do side mission to level up alot which helps alot your speech affects the game so much that there muti ending",
            "review_score": "1"
        },
        {
            "review_text": "Recomended.",
            "review_score": "1"
        },
        {
            "review_text": "ARPG with a heavy RPG element, it's too bad the game kinda short. This could be better if polished.",
            "review_score": "1"
        },
        {
            "review_text": "Good plot and nice control, but too short. Probably for one full play",
            "review_score": "1"
        },
        {
            "review_text": "I'm not recommending this game solely based on the combat system. And it's quite possibly the worst combat I've seen in any game. It's extremely simplistic with very basic attacks, blocks and dodging. However, none if these work very well. Your primary weapon is a ♥♥♥♥♥♥ pipe, and sometimes you have a nail gun or grenades. You can't even use power attacks with melee weapon, and you barely do damage to even the weakest enemy. In a lot of places, you are facing up to 8-10 enemies. Your companion Innocence is just trash, who can barely deal damage. That means that you'll be fighting all of these enemies alone, in addition to doing close to zero damage. In other words, fighting these crowds is extremely difficult unless you have grenades or mines, but these are rare to find.   The blocking is pretty ♥♥♥♥, because a lot of the time, you can't tell whether the enemy is attacking you, or breaking your block (which deals damage). This means that blocking is useless in many fights. If you wanna avoid blocking you can always dodge. Then again dodging is also useless, because you'll either crash into your enemy, or the enemy's range will surpass your dodging ability, thus hitting you.  Killing even one enemy takes forever, and imagine what killing a bunch of them is like, when you don't have any attacks that can deal damage to many enemies around you (except for grenades that will hurt you if close). The stealth system doesn't really work that well either, because you move very slowly, and when you approach and hit from behind, you don't do a lot more damage than you normally do. Combat is basically ♥♥♥♥♥♥♥♥.  If we look away from the terrible combat, there's not a whole lot positive about the game. The graphics are very sub-par, especially when considering that the game was released in 2013, because it actually looks and feels like it's from 2006/07 (except close up faces). The dialogue along with voice acting is also pretty lame. A plus in my book is that the setting is pretty unique.   If the studio have had more money on their hands, this could've turned out a lot better, because quite frankly, the graphics are outrageously bad for its time. And obviously the dev team must've been on heroin when they designed the combat system.   ",
            "review_score": "-1"
        },
        {
            "review_text": "Mars: War Logs is a game I really wanted to like. But it just fails to come together as a cohesive whole.  And that's the tragic part, this game has so many parts that should be amazing but every step of the way there are little hiccups that bring it down. The game, for me, felt drawn out by bad loading screens as I climbed up or down from items, cringed at horrible dialog, wondered as recruitable NPCs went from bloody vengance to being my friend after a single line of dialog, was gobsmacked as the game forgot to tell me crucial plot important details, and the combat never gained the depth one would have liked.  I wanted to like this game, I wanted it to succeed, but it didn't. I hold the greatest hope that these people will try again and their next product will be a polished RPG worthy of great praise from all the lessons learned from this one. But I'm afraid I can't recommend it to anybody.",
            "review_score": "-1"
        },
        {
            "review_text": "Totally worth it for 5€! O'kay, it's a shorty, a bit clumsy time to time, but hey... it's a debut built up from a scratch! It tells a unique story without all lazor swords and thermal blasters and such. If there's going to be sequel to this I'm so looking up to it! 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great game! With some rough edges but very atmospheric. Has really hard combat on extreme but it was awesome :D And choices really matter.",
            "review_score": "1"
        },
        {
            "review_text": "Fun Game. Any RPG lover should play this.",
            "review_score": "1"
        },
        {
            "review_text": "Bought it for about 4$, and i like it. Pros: +The combat system +The skill system +The crafting system (More like upgrade system, but whatever..) Cons: -Some bad voice actings -The story feels stressed sometimes  ",
            "review_score": "1"
        },
        {
            "review_text": "Rather short story, relatively dated graphics (nowadays it isn't surprising, bt even for the time the game came out it was already outdated)...not rly an exciting game. Was kinda fun playing it though, but then agian, i got it in a pack with 22 other games for only 22 euro's...would've never bought this game for normal price!",
            "review_score": "-1"
        },
        {
            "review_text": "Great storyline, really a must-see. A little crappy combat system though, that's too bad :(",
            "review_score": "1"
        },
        {
            "review_text": "Roy is a qt. He was such a dork sometimes.   BUT the game overall is bland. Kool-aid without the sweetness. Specifically red Kool-Aid.   This game is the very definition of average. Like, EXTREMELY average. Everytime you think it's gonna do something beyond that...It drops the ball in one way or another. From the concept, to combat, to level design, to storytelling (from the GET-GO, it already makes me scratch my head).  If you're not patient and unwilling to give games a chance if you aren't at once taken by it...You might not like this game.   If you're willing to give these sorts of games a chance despite the rough start, by all means. I recommend you pick it up, but only on sale. See for yourself the sheer amount of potential this game has, but why it falls just short in every single one of its aspects. I'll provide brief examples below.  Combat is a bit rough going in the beginning as blocking system and melee system are confusing and difficult to understand. I still don't know if I've got blocking down. However, you get super electric powers later on via a skill tree system, and this helps ease out the frustration of combat IMMENSELY. Makes it entertaining rather than laborous actually.   Another example of how it falls short is choices in the game. Yes, they do exist. But they are not spectacular. Not amateur either. Just really damn rough, like the writer sent in just their first draft after the rough and the others said 'Okay, this'll work'. Sometimes the text doesn't even align with what Roy's saying and totally differs from what you thought it was about. Other times they're kind of stupid and makes you laugh out loud. (The romances especially...Lord I had to laugh so many times from how weird it was, and how much the devs must have realized it too.) Sometmes options are there just for the sake of being there.  One of the things I found surprisingly interesting was the customization of Roy's armor. You gather scraps and other few materials for various types of armor, but the loot system in this world is very limited. You have fixed locations where you can find specific material (maybe they also sell the materials in the stores) but that's it...So much for scavanging for armor :P  There aren't many saving graces in this game, but for some reason it was oddly...how should I say? Endearing. I didn't love it, didn't hate it. Just...this game has none of the energy to snatch its own A-game! It delved into too many different territories it didn't even need to, so much so that its own potential was stretched awfully thin. I found myself screaming, YOU COULD HAVE DONE MORE HERE!  Overall, 5/10...And that's optimistic.",
            "review_score": "1"
        },
        {
            "review_text": "Great game albeit a little short but it has very interesting story, setting and decent combat worthy of a look if your into rpgs... Short nd sweet",
            "review_score": "1"
        },
        {
            "review_text": "While the groundwork for an interesting game with an interesting story is present, the game falls short in almost every aspect. The combat is all over the place, the story is missing important parts and important information, and the environments are all pretty samey. Easily the most promising feature is the crafting system that enables you so mix and match your equipment to fit your play-style. All in all I can't really recommend this game. Also I found it very interesting to pretend that this game takes place in the distant past of Warhammer 40.000 before the Adeptus Mechanicus was established.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is terrible in every measurable way.",
            "review_score": "-1"
        },
        {
            "review_text": "Horrible. Don't waste a penny on this.",
            "review_score": "-1"
        },
        {
            "review_text": "3/10 - This game is absolute not to buy! This game is never get finished. the whole time you stupidly run again and again in nice designed but boring maps. you dont have alternativ ways to solve quest. its nearly always Kill-them-all or run trough and get some timewasting other stuff. The combat engine maybe would be nice, if the skills are where more balanced and the the fights where more interessting. If you played the first 3-5 fights you nearly see them all. very very boring! Stealth-kills are a nice idea but nearly never rougelike skills can be used to solve or evade fights. The complete camera is absolut crap and very anyoing. One of the realy good parts are the characters, the are very nice designed and emotional. The story is OK, not more not less. One of the most frustrating things in my opion is the loot system. you can loot enemys after you won the fight, but for what? The crafting of items are very very depressiv und quit useless. You nearly always get the same things - leather, scraps, ammo,... and than after you loot it, you can loot it again to gain some money/potions for trading. should be a good-bad thing with impression of the people, i dont see any of them any time. very very sad.",
            "review_score": "-1"
        },
        {
            "review_text": "An interesting, atmospheric setting completely ruined by near useless AI allies and what has got be the most insipid combat mechanics I've ever seen.",
            "review_score": "-1"
        },
        {
            "review_text": "Mars: War Logs is video games' answer to a crappy B-movie. It's entertaining for the way it tries to be serious, but it utterly fails on so many levels. There are hints of something decent there and the game isn't actively bad, even if there are moments where you'd think that was what they were going for, but I can't recommend it. It's worthwhile B-game material for those who like that sort, and Aurora the Technomancer is like Russ Meyer's version of a Bene Gesserit.",
            "review_score": "-1"
        },
        {
            "review_text": "I was mostly interested in this because it was a prequel to The Technomancer.  This game is pretty bad, so don't buy it.   Combat is slow and repetitive. The game starts out a bit rough for combat but gets much easier as you go. It's just a clunky janky mess.  The writing is pretty terrible and the characters are just laughably bad. They try to make it seem like you have a choice in how things go, but you really don't. Basically everything you say or do is inconsequential with the exception of the fates of two or three npcs.  I really can't think of any positives that make the game worth the purchase. It's not even the fun kind of bad. If there's music I don even remember it.  Just...don't bother with this.",
            "review_score": "-1"
        },
        {
            "review_text": "Idiots made this game! All was good until combat started. I am not going to waste time attacking something, when I do not fracking damage to it!",
            "review_score": "-1"
        },
        {
            "review_text": "This is an average game, it borrows the core mechanics from games like 'Witcher 2' and 'Mass Effect', it runs short on graphics and has some of the worst voice acting in a game i have ever heard! EVER. The fighting is good and feels smooth but lacking challenge and depth. I would give this 6/10!",
            "review_score": "-1"
        },
        {
            "review_text": "I you like playing games with a controller, welcome to hell.  War logs sat in my backlog folder for ages. I should have left it there safely gathering dust. I don't like giving bad reviews because some people probably worked really hard on this game (in some far off land where they dont sell controllers). Sadly I'm filing this one under: 'Even-if-the-controller-worked-properly-it-would-still-be-boring'.  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "Very Bad Disliked it I will Give it About a 3/10",
            "review_score": "-1"
        },
        {
            "review_text": "While it has a few glitches here and there and could use a little extra polish - this was by far one of the most compelling story-driven games I've played in a while. The characters were memorable, and the story was unique. I couldn't put the game down and passed it entirely in a weekend. Has elements of Mass Effect's decision-tree that effect gameplay, and some choices were really difficult to make, causing me to want to replay and make different choices to see how it effects the ending.",
            "review_score": "1"
        },
        {
            "review_text": "A sudden game to show up on Steam, and their trailer really sold me into buying the game.  Overall the game can be completed over 2 days, but less if you decide to skip side mission.  The odd story is actually that another person is telling the beginning, but this will ultimately change depending on what side you chose later in the game.  There is a good difficulty in the game, and you need to be choseful into combat depending on what 'spec' you go with. Renegade being the rogue is very useful compared to many other games. Later on you unlock the Technomancer ability, which is sort of a caster style with lightning. It's pretty steam punk'ish.  In term of quality, then I'd compare this game with Of Orcs and Men. The graphics, sound etc. are fluid and run extremely well. When starting Mars: War Logs you more or less instantly pop into the menu. The only difference is that this game is somewhat more short, yet quite entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Surprisingly Pretty Cool. very addictive gameplay, simple yet complex and not over complicated. Thought i would get bored of it fast but in fact i can't wait to get back into it, sadly real life calls me away so i must wait to play another day! :)",
            "review_score": "1"
        },
        {
            "review_text": "I found this game to be quite enjoyable with a fun and interesting storyline. My only problem with the game is the speed at which it ends. The first few areas take a little while to play through and you get a good feel for it, but on the flip side the last few stages have only one way to go and its over all to quick.   besides this, i recommend this game for anyone who wants a bit of fun for a weekend of roleplaying games.",
            "review_score": "1"
        },
        {
            "review_text": "All in all a good Budget Game.  Medicore Voice acting. Good Setting. Repetive walks. It was short but also fun and interesting. I recommend it (for a low price). ",
            "review_score": "1"
        },
        {
            "review_text": "What do you get when you take KOTOR, Fallout and Dune, mash them together, add a great combat system and put it all on the red planet? Thats the question I didn't know I needed answered, but Spiders decided to answer it anyway. Mars: War Logs is the best game I have stumbled upon in quite some time, and I highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Mars: War Logs is a decent game and well worth the buy.",
            "review_score": "1"
        },
        {
            "review_text": "I really don't know why this game has such a low Metascore, but hey, MW3 gets 89% at Metacritic so their opinion is nothing. This game is really ♥♥♥♥ing good. It is not Mass Effect, nor is it Skyrim - However, it is a solid, nice looking and innovative, partly difficult RPG for 10 bucks (talking about the sales). If you like RPGs, you should definitely give this a try. It's great and worth the money you pay for it.",
            "review_score": "1"
        },
        {
            "review_text": "Plenty of fun and personalisation to be had here, for a budget game from a small studio this is a good job. Home Interactive freqiently create original and creative stories, and this is no different.",
            "review_score": "1"
        },
        {
            "review_text": "It might be good for a cheap distraction if its on sale... but the combat is so bad, it makes its brother Bound in Flames look good. IN other words its horrible, just bad.",
            "review_score": "-1"
        },
        {
            "review_text": "This game looks very average and linear, with poor voice acting and character actions, but it is made with care and love. That's what makes it playable and enjoyable.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. If you love RPGs and making choices, this is for you.  Pros:  -Space setting -Good Story -Choices actually impact ending (Unlike similar games cough*Mass effect 3*cough) -Fully voiced (Not great but decent voice acting)  Cons:  -Combat is a bit boring -Game is kind of short for a RPG ",
            "review_score": "1"
        },
        {
            "review_text": "Wow! What a hidden gem. I picked this up in a sale knowing nothing at all about it, but somewhat drawn to the aesthetic. I had no idea what to exprect, but what I found was a wonderful game with a deep engaging storyline, a superbly realised world and a truly bittersweet ending. Combat takes a little while to master, but it's rewarding once you do. There's a few rough edges, such as the voice acting and some of the dialogue, but on the whole I highly recommend picking this game up. The campaign took me about 14 hours to play through.",
            "review_score": "1"
        },
        {
            "review_text": "Very cheap, but quite good production of almost unkonwn studio. Innovative skill tree, good script, very unreal-martian climate. From otherway - poor music, not so good grafic/animations.  In summary - It's worth to play it if you want good oldfashion game.",
            "review_score": "1"
        },
        {
            "review_text": "I was somewhat surprised at this little gem. It came in under the radar.",
            "review_score": "1"
        },
        {
            "review_text": "It's ok.",
            "review_score": "1"
        }
    ]
}