{
    "app_id": 232970,
    "name": "Thunder Wolves",
    "release_date": "2013-05-15",
    "developer": [
        "Most Wanted Entertainment"
    ],
    "publisher": [
        "HandyGames"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Casual",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Casual"
    ],
    "achievements": 20,
    "positive_ratings": 377,
    "negative_ratings": 61,
    "price": 7.99,
    "description": "When this “wolf pack” strikes, you hear the thunder roll. The Thunder Wolves attack from the air. They are mercenaries, and the best helicopter pilots in the world. Every one of them is ready for action at all times—and ready to fight evil, wherever it lurks. The Thunder Wolves have already made it through countless battles.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/232970/header.jpg?t=1534432772",
    "minimum_requirements": "OS:Windows® XP/Vista/7™ Processor:2 GHz single-core Memory:2 GB RAM Graphics:256MB DirectX9 compatible video card DirectX®:9.0c Hard Drive:2 GB HD space Sound:DirectX 9.0c compatible Other Requirements:Broadband Internet connection Additional:Mouse. Local co-op multiplayer requires one game controller.",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Sometimes games don't need to challenge ideals, sometimes games don't need to be cerebral and introspective. Sometimes, you want to blow ♥♥♥♥ up, you want music that lets you know you're blowing ♥♥♥♥ up, you want battle chatter that celebrates blowing ♥♥♥♥ up, and you want to feel like you're blowing ♥♥♥♥ up.  With a well executed PC port and slick keyboard/mouse support Thunder Wolves is exactly that. Feeling like an entry in SEGA's series of arcade shooters, Thunder Wolves is dedicated to doing one thing well: offering you missions in which your goal is to blow ♥♥♥♥ up.  ♥♥♥♥ing glorious.",
            "review_score": "1"
        },
        {
            "review_text": "I will recommend this game but with MUCH CAUTION. If you're looking for a helicopter combat simulator this isn't it. If you're looking for an action packed, things exploding and cowboy dialogue this is it. The extreme plus side to this is the game is relatively cheap on sale. Still though, I know a few people that would rather keep two bucks than spend it.   Thunder Wolves caught my eye as I used to play Urban Strike relentlessly on Sega Genesis. I came in hoping for a reboot and got something a little different. Is this difference bad or good? Depending on what you like will guide your decision. Thunder Wolves is a game in which you are given control of a helicopter and usually have to blow a lot of things up. There are extraction missions and escort missions but all involve over the top violence. There are cameo's in a sense where you get to control a sniper, a guided missile and even a tank. I should add here that the game is indeed LOCAL CO-OP! If you do end up playing two players, one player will be the gunner where another player. You each  DO NOT  get your own respective helicopter. This would have been awesome if it was the case.   Having the campaign add these little tweaks in where you have a different sense of control adds a bit of variables to the game regarding it's enjoyment. There is a point where even the devs realized that simply blowing everything up may get boring. The explosions themselves aren't bad. I wish there was a little bit more boom especially when unleashing loads of missile. There is enough destruction though to keep you hyper stimulated. At first, the player is given a single helicopter with not too many options to choose from. As you progress throughout the game, different skins and different helicopters will be available later on. You cannot customize exactly what weapons the helicopter will use. Instead, each helicopter will have a different set of skill. Some helicopters will have guided missiles and be able to launch about 10 missiles at one time whereas another helicopter may have rapid fire missiles and can call in an air strike. The controls themselves are probably the best feature of the game. Whether it's how the helicopter moves, how it reacts to inertia when it begins/stops movement or whether it's fairly easy to control makes it absolutely enjoyable.You definitely don't have to be a professional helicopter pilot to play this game. They've also added a boost feature which is extremely useful in tight situations or in traveling to another location on the map. Careful though, not all helicopters have the same boost ability. A counter ability feature on all helicopters (by pressing 'X') will release flares to misguide homing missiles.   All helicopters have the basic ability of machine gun ('RT') while 'RB' will handle most of the missile weapons. You can move your helicopter along the Z axis (meaning up and down) but you cannot control a hoist upon your discretion. It would have been cool to have complete control over this and maybe even pick up a few enemies to take them for a ride.  The visuals themselves can be boosted to max performance and do look like xbox 360 graphics. This is okay but the next gen feel is definitely not here (which is ok). To make up for this, there are a lot of explosive animations. The animation concerning the demolition of buildings is decent. I wish you could level them to the ground but you can't. At least you can do some damage! Which is also a little weird is that in one level where you drive a tank, the tank treads don't move. Weird eh? The sounds overall are okay and they tried varying the gun sounds as well as the explosions. They seem like they took their dialogue seriously as you'll have some good old 'Murican F-bombs dropping regularly. So if you don't like swearing, beware!  Overall, this is AT BEST a decent game. For the price it's worth, I think it's a fair asking price (especially on sale)!   RATING : 7.0/10       Gameplay   B-     Story / Campaign   B-     Visuals / User Interface   B-     Sounds / Music   C+     Replay-ability   C+     Overall    C+        ScreenShots :",
            "review_score": "1"
        },
        {
            "review_text": "Pleasantly surprised with this game. You get unlimited ammo and rockets, you can blow pretty much anything up in the world. Graphics are OK for the price you are paying, some tedious voice acting makes you wince and cringe at times but nothing which can't be ignored.   Controls are a little difficult to grasp to start, certainly not one to be played with a controller, stick to your mouse and keyboards for this one. The added local co-op is a nice feature which more games should include wherever possible in my opinion.   The length is just about right for the story mode, however the plot is somewhat unbelievable. I'd say its worth your time but its not the best game out there, but there is certainly a lot worse.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! What a Awesome game. It is like a modern version of choplifter. If you have a Controller the game is a little better but with a mouse you are more accurate. The music for this game is rock metal. It has a funny humor to the game similar to Far Cry Blood Dragon. The helicopter has some really cool missions. some are outside some go inside caves and bases. This is a really good game. I am so glad I bought it. I would have paid up to $20 for this game so far and it keeps getting better!. If you are seeing it on the steam summer sale, PICK IT UP. you will be glad you did. It is shch a chill and relaxing game. yet it is action packed. the game is very high wuality and is not buggy or glitchy at all. AAA game. Old school game with a updated look and soundtrack. All of the game play footage in the video trailer for this game is accurate.",
            "review_score": "1"
        },
        {
            "review_text": "The developers of this game obviously don't care that there are people having issues with starting this game. Do I recommend this game? No Do I recommend the developers? Hell, no... Arrogant ♥♥♥♥♥♥!! I WANT MY MONEY BACK!!!",
            "review_score": "-1"
        },
        {
            "review_text": "Thunder Wolves in an amazing arcade shoot-em-up! Over-the-top style takes the front seat and you'll find yourself mashing the trigger while flying in crazy circles and getting shot from every direction.  It's not a simulation game by any stretch of the imagination. You can get hit by dozens of tracking AA missiles and stay in the air. Each mission includes pumping rock and roll and dialogue consists mostly of the pilots exchanging witty quips. Each helicopter comes with three rocket varieties and different handling characteristics. Sometimes you'll also find yourself gunning from things besides helicopters for small sections in the story missions too.  At 13 levels, it's not a long game, but if you're in the mood for a fast-flying, rocket-thumping, rock-blaring, lighthearted slugfest, it really shines.  ",
            "review_score": "1"
        },
        {
            "review_text": "Simple and surprisingly fun. Graphics with plenty of little details.",
            "review_score": "1"
        },
        {
            "review_text": "Old school helicopter action arcade game. What's not to love. The story is so stupid it's funny. Think 80's!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, only complaints are its a bit short but its a fun arcade game with good replayability. Plot seems to be going somewhere only for the plot twist ending to come from nowhere and not be explained.  Still it works just fine as an arcade shoot em up.",
            "review_score": "1"
        },
        {
            "review_text": "It's fun, it's retro, it's straight out of your favorite 80's Swartzenegger action movies, it's tons of mindless explodey goodness, and it's only 9,99€.  The campain is a bit short, and if you need 'ermagerd 1080p 120fps gwafixxx' then look elsewhere. However if you just like to kick back, and let lose a hailstorm of 30mm shells and antitank missiles then no game does it better than Thunder Wolves.",
            "review_score": "1"
        },
        {
            "review_text": "All my favorite NES war games rolled into one in a shiny new wrapper. Awesome.",
            "review_score": "1"
        },
        {
            "review_text": "I would dislike this game because it is not possible to play. Also i get no support for it. My Hardware seem to match to the system requirements. I always get the message box 'failed to initiate the engine' 'pure virtual fuunction call bla bla bla'. Thats all not very helpfull to find out what probelm i have",
            "review_score": "-1"
        },
        {
            "review_text": "bad controls  bad game  CANCEL ORDER!",
            "review_score": "-1"
        },
        {
            "review_text": "One of the worst game of my life",
            "review_score": "-1"
        },
        {
            "review_text": "After hours of playing through the campaign three times (once in co-op) and getting all the achievements, I can easily tell you how much fun I had and how much fun the developers had while making this game.  Everything is over-the-top including the action, explosions, the story and the game does not lose from its hectic pace till the end. The rock music fits perfectly and throughout the 4-5 hour campaign, you feel like a badass from an 80s or 90s action movie. Damn, even the in-game pop-ups say 'It's all you, bro!' and 'Hell Yeah!' to you!  Absolutely recommended for the fans of the arcade action genre. I didn't have this much fun with an arcade action game since Renegade Ops, and that game set the bar very high!",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun time waster. Controls are a little tough to get used to though. Better bump down your sensitivity to play this one.",
            "review_score": "1"
        },
        {
            "review_text": "Good Game, Blowing up stuff and flying around kicking ♥♥♥ loads of fun recommended",
            "review_score": "1"
        },
        {
            "review_text": "For the $2 I spent on it, I got a few hours of real good fun.",
            "review_score": "1"
        },
        {
            "review_text": "I had so much fun playing this game. I love arcady shooty stuff and I'm a sucker for the rock 'n roll soundtrack. The game let's you play how you want and then just throws loads and loads of enemy units at you.   It even manages to be diversive. I've battled HUGE tanks, oiltankers and other helicopters. It's a bit short, though.  Would definitely recommend.",
            "review_score": "1"
        },
        {
            "review_text": "Plays very much like an 80's B-movie, with huge explosions, over-the-top dialogue and a thin plot. I LOVED every minute of it!!!",
            "review_score": "1"
        },
        {
            "review_text": "The story is terrible, but terrible in a good way. This is a good game when you don't feel like thinking all that much and blowing some bad guys up.",
            "review_score": "1"
        },
        {
            "review_text": "takes a minute to get used to the controls.  switch to the third style controls (i used xbox controller) decent enough game. also makes you appreciate how much gta5 has dedicated to perfection. its really a shame gta just doesnt care about content. they could make the game to end all games.",
            "review_score": "1"
        }
    ]
}