{
    "app_id": 23300,
    "name": "Yosumin!™",
    "release_date": "2009-05-26",
    "developer": [
        "Square Enix"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player"
    ],
    "genres": [
        "Casual"
    ],
    "tags": [
        "Casual",
        "Puzzle"
    ],
    "achievements": 0,
    "positive_ratings": 102,
    "negative_ratings": 64,
    "price": 3.99,
    "description": "Make rectangles of the same type of yosumin to make them disappear in this mind-bending puzzle game. The more you get, the better you'll feel! Yosumin!, Square Enix's puzzle masterpiece, is here! Simply select rectangles of the same type of yosumin to make them disappear in this simple yet challenging puzzle game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/23300/header.jpg?t=1512023264",
    "minimum_requirements": "Operating System: Microsoft® Windows® XP/Vista                     Processor: 800 Mhz                     Memory: 512 MB RAM                     Hard Disk Space: 65 MB                     Video Card: On Board Video Card                     Sound Card: DirectX 9.0 Compatible                     DirectX® Version: DirectX® 9.0c（2007 Nov or later）",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": " Summary:",
            "review_score": "-1"
        },
        {
            "review_text": "Like to puzzle a bit in between things? This is a fun little game to fill spaces of boredom when waiting for a dungeongroup in WoW or mining in EVE :)",
            "review_score": "1"
        },
        {
            "review_text": "Great game with nice music, cute graphics, and fun puzzles. Nice game to play when just relaxing. The only issue that I have with this game is that it has a wierd resolution and if you hit escape then it exits the game.",
            "review_score": "1"
        },
        {
            "review_text": "hard for no reason",
            "review_score": "-1"
        },
        {
            "review_text": "Cute little matching game.",
            "review_score": "1"
        },
        {
            "review_text": "An adorable time waster/puzzle pick-me-up if I'm in a bad mood... I always try to get 'yosumin!' so I can hear the in-game cheer, it's so happy!! challenging enough that you have to plan out your moves but not terribly difficult. I definitely recommend for the casual gamer. I previously owned this on the 360 as well, so I've dumped many hours in prior to purchasing on Steam.",
            "review_score": "1"
        },
        {
            "review_text": "Nope.   Cons:",
            "review_score": "-1"
        },
        {
            "review_text": "A cute puzzle game, yet it lacks the addicting nature that most matching games tend to. There's barely a semblance of story [though not most puzzle games have such], and it only progresses after you've played about... oh, 40 matches for each stage. Each stage has about 8 levels or so, and each level has 5 rounds to it. Because of this lack of progress being felt, it gets more tedious than other matching puzzle games do. It does have a bit of uniqueness to it, in that the matching gimmick is based off square or rectangular shapes; rather than moving pieces around to make a match nearby, you have to search for four corners in order to make a match. The music, while adding to the cute theme of the game, doesn't really have any memorable traits to it, and the music for when time is running out is kind of annoying more than adding to the rush factor. Transition between rounds is slow, for a matching game that includes a time limit. This adds to the feeling of slow progress, as well as the 40 rounds one must go through in order to see the next piece of the 'story' that is meant to tie the game together. Since it's a puzzle game, I won't go on about the little bit of story that I've played through, other than that it's just there for show and doesn't add to the game experience. There's just something missing from this game that makes it as addicting as other matching games. Perhaps the lack of a falling chain/combo, like other matching games have. Where more traditional matching puzzle games have new pieces fall in from above, this one just has them reappear. And since you have to click on the corners in order to make a match, there's some fun missing in having matches just suddenly cascade into a nice combo that completes the level.   Overall, if you don't care much about puzzle games and you find it on sale or in a Humble Bundle, I'd say go for it. But if you like the addicting nature of matching puzzle games, then I would pass on buying it unless you absolutely run out of other games to play or try.",
            "review_score": "-1"
        },
        {
            "review_text": "A very simple little puzzle game that is very adorable. Unfortunately the difficutly imposed by the timer, the randomness, and the simpel gameplay makes this game short lived, and a little too frustrating",
            "review_score": "1"
        }
    ]
}