{
    "app_id": 233150,
    "name": "LUFTRAUSERS",
    "release_date": "2014-03-18",
    "developer": [
        "Vlambeer"
    ],
    "publisher": [
        "Devolver Digital"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie",
        "Simulation"
    ],
    "tags": [
        "Indie",
        "Arcade",
        "Action"
    ],
    "achievements": 12,
    "positive_ratings": 3180,
    "negative_ratings": 302,
    "price": 6.99,
    "description": "The skies will be set aflame and the seas will overflow with wreckage in Vlambeer’s stylish arcade shooter LUFTRAUSERS! Select from over 125 combinations of weapons, bodies, and propulsion systems and take to the skies to battle enemy fighter planes, battleships, submarines, and rival aces for glory, honor, and high scores.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/233150/header.jpg?t=1498680334",
    "minimum_requirements": "İşletim Sistemi: Windows XP İşlemci: 1.2Ghz+ Bellek: 1024 MB RAM Ekran Kartı: OpenGL 2.1 compatibale + 256MB Video Depolama: 200 MB kullanılabilir alan",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fast Paced Modded Out Plane Airborne Warfare  REASONS TO OWN:  1. Morphing Soundtrack That Changes Depending On How You Pimp Your Plane  2. Delicious Unlockable Plane Modifications  3. Best End Game Mode  4. Easy To Pick Up  5. Hard To Put Down  Overall Rating 10/10",
            "review_score": "1"
        },
        {
            "review_text": "the kind of game that you play for five minutes and oh god its been an hour",
            "review_score": "1"
        },
        {
            "review_text": "I let a girl play this game on my laptop and she liked it  10/10",
            "review_score": "1"
        },
        {
            "review_text": "  LUTFRAUSERS   is an 'War Thunder' Shooter released in 2014 by Vlambeer studio.  Pros + Nice and orginal concept + Game looks cool + Nice soundtrack + Lots of upgrades for your ship + Lots of enemies/bosses + Achievements  Cons - Is boring after 5 hours - Very Hard - Price should be lower     Buy or don't?   I think yes! but only on sale!",
            "review_score": "1"
        },
        {
            "review_text": "This is a review for the Linux version, running Ubuntu 14.10. Runs perfectly on linux, only minor issue is lack of an exit button.   I was hesitant to pick this game up, due to the artstyle that seemed lazy in the screenshots and the general simplicity of bullet hell games. I was expecting this to be a cheap 'So retro' game. However, when it went on sale and I noticed it was published by Devolver Digital (who have yet to back a stray horse) I decided to give it a go. I'm glad I did and I would recommend this game at full price.  This game reminds me of old arcade classic Aerial Dogfight, except with everything turned to the max. You begin with only the most basic machine gun and engine, then when you die you've discovered that you have a new engine that lets you move twice as fast at the cost of turning speed, a few more deaths later you're erupting out of the ocean and obliterating everything with a laser strapped to a chassis which is a nuclear bomb.  The game offers a lot of upgrade potential, it's surprisingly balanced. There's no combination which felt leagues better than the rest, Although your basic machinegun, chassis and engine feel outdated by the end, nothing you have earned will feel pointless.  The constant flow of gameplay challenges associated with each weapon encourages you to diversify your tactics. This prevents the fact that the game only offers one level and one mode from becoming tedious. One downside of these challenges is that the curve on them is a little bit off. The final challenges are magnitudes more difficuklt than the ones that came before it, and something such as defeating a submarine at MAX combo feels far more luck based than it does skill based.  The only real downside I could say against this game is that once you've completed all the challenges, there's not much to do but try for the high-score. That's not even a problem either with a relatively short round time and tight polished gameplay. I can see myself coming back to this many times in the future.",
            "review_score": "1"
        },
        {
            "review_text": "While it seems like a pretty simple 2D shooter, just flying around trying to stay alive and get a top score, it has some nice features that add to its replayability.  GREAT Music. I'm not sure why they haven't made the soundtrack available on Steam, but I have seen one available in music bundles.  As you try to stay alive, you can also attempt to complete missions to unlock upgrades. These range from easy (kill X enemies) to challenging (kill the feared Blimp!).  There are different upgrades for Gun, Hull, and Engine, as well as a randomizer option.  If you like shooters, you will probably like this!",
            "review_score": "1"
        },
        {
            "review_text": "  Luftrausers is a game where you fly around in a plane that can do crazy maneuvers and shoot enemies until you die. Pretty simple, pretty hectic gameplay, pretty insane, and on that note, insanely fun to play.  The gameplay is controled with 4 buttons; left, right, boost and fire. These buttons can be configured to your liking in the options menu, and you can even play with a gamepad. The goal of the game is to eliminate as many enemies as you can before you get shot down. Fortunately, you don't die in one hit; instead, the game makes a shaded circle around your plane indicating your health. The closer said circle is to your plane, the lower your health. You can recover health by simply not firing, but this means you'd potentially lose any scoring combos you had going, encouraging high-risk, high-reward gameplay while not penalizing you for playing it safe.   The missions (i.e. subquests that unlock parts for your Luftrauser) start out simple, but quickly get tedious, annoying and often luck-based; as such, I would not recommend this game for hardcore completionists. However, it's fairly easy to unlock all ship parts relatively quickly (except for the final ultimate Luftrauser obtained from 100% mission completion), allowing for flexible gameplay that can suit your playing style.   In conclusion, Luftrausers is a fast-paced aerial shootout that only loses its fun value if you focus more on completing the missions for achievements rather than obliterating every enemy you see.",
            "review_score": "1"
        },
        {
            "review_text": "This game is probably too good, don't buy it. Unless you like having fun, being challenged, good music and experiencing truly refined game design in its most pure and simple form.   Literally the first game I've liked enough to 100% in years.  11/10 would luft again.",
            "review_score": "1"
        },
        {
            "review_text": "LUFTRAUSERS contains some of the most clever mechanics design and balancing you're likely to have seen for a while. Though there are only really three mechanics (Rotate, thrust, shoot), the way they fit together is stunning; releasing thrust is crucial for avoiding enemy fire, and you can only repair damage when you aren't firing yourself. The end result is both chaotic and balletic. Add to this a superb metagame, where you unlock new parts by completing micro-challenges, and it's hard to recommend this game enough.",
            "review_score": "1"
        },
        {
            "review_text": "EGHEGHEGHEGH, TAKE THAT MOM! EGHEGHEGHEGH, TAKE THAT DAD! SEND ME TO A PSYCHIATRIST WILL YOU!? EGHEGHEGHEGH, TAKE THAT DR. SALLY WAXLER!",
            "review_score": "1"
        },
        {
            "review_text": "Everytime I play I get to hear a little bit more of the music, which is pretty damn good and drives me to git gud  Solid game with good replayability, would recommend at full price. On sale is a steal.",
            "review_score": "1"
        },
        {
            "review_text": "this game rauseled my jimmies to the point where I can no longer walk 11/10 would luft again",
            "review_score": "1"
        },
        {
            "review_text": "I still don't know what SFMT stands for.",
            "review_score": "1"
        },
        {
            "review_text": "Tight controls, good hitboxes, awesome visual style &amp; audio.  Decent amount of customization to the plane possible through combination of weapon / hull / engine. Good variety of enemies.  Minor technical issues like locking it to 30 fps don't take away from the experience, but why do this? While it feels smooth even on 30fps, it could be silky smooth running at 60. Anyway... it does have everything one can ask of a shmup really. It's addicting and I'll play more of it asap.  Also, Rausers is not a word.",
            "review_score": "1"
        },
        {
            "review_text": "Guys. Seriously guys. If you like score driven games where you're pitted against the world in a 2D arcade type game, you will genuinely love, adore and play this for hours! I was a little sceptical about it when installing it to see it was only 93 mb, but it's like a badass flash game that really deserves the $$$$ spent. The content within overweighs the stigma of price easily as you find yourself piecing your fighter plane with a NUKE FOR A BODY as well as a SUPER FAST ENGINE to give you SPEEDY ANGLING so you can shoot your enemies with LASER BEAMS.  11/10. Buy this game for many hours of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Reasons to get this game. #1. It's a classic, arcade like game. #2. Very simple controls, easy to play, and very fun. #3. HOLY ♥♥♥♥ THIS GAME IS INTENSE. #4. It has the best ♥♥♥♥ing soundtrack ever. #5. Your Rauser (Your Plane), is fully customisible. #6. You get to play as the Luftwaffe. ( I don't know if that matters but I think it's cool. :3 ) #7. There's action everywhere you look on the screen. This includes planes crashing, missles flying everywhere, battleships exploding, submarines submurging, blimps decending, bullets flying, and much more. #8. Theres are so many good things about this game I can't even fit them on the list.",
            "review_score": "1"
        },
        {
            "review_text": "Tough as nails, customizable planes with dynamic music and an absolutely nuts control system. If you're even slightly into bullet hell games then leap on this like a horny tramp.",
            "review_score": "1"
        },
        {
            "review_text": "they see me rausing, they hatin",
            "review_score": "1"
        },
        {
            "review_text": "It's like the flash game, with more content. The music changes as you 'level up' (achievements that you have to reach to unlock new parts for your ship), on the next round, and it generates hype. You could easily waste hours with this game just trying to get good. 10/10 as fug.",
            "review_score": "1"
        },
        {
            "review_text": "LUFTRAUSERS brings all the glorious fun and fast paced action to the sky with bullet hell elements and retro graphics.  You can customize your aircraft that better suits your goal before every launch. In each launch you need to fullfill certain requirements depending what part you equipped to gain access to new parts and new goals. After completing some challenges you unlock the SFMT mode, which is way harder and challenge the player to it's edge.  An overall great game that looks simple and short but in the end offers fun and good challenges.",
            "review_score": "1"
        },
        {
            "review_text": "Probably one of the most intense shooters I've ever played in terms of pacing and skillcap. I'm usually hard to get worked up but for real I'll wake my family up at 3AM like 'PULL UP YOU ♥♥♥♥♥ WERE NOT DYING HERE' while playing Luftrausers. Beads of sweat on my forehead and everything.",
            "review_score": "1"
        },
        {
            "review_text": "It's not about whether you win or lose, but how you Raus.",
            "review_score": "1"
        },
        {
            "review_text": "I earned 50% achievements during first 8 games (10mins max). Which is awesome. Same like this game. Fast paced shooter in the sky and at sea level. With upgrades and some secrets, great thing for just 'relaxing shooting'.   It reminds me Hotline Miami, less challenging cousin",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, super fun and fast-paced! Simple concept, but phenominal execution! Time flies when you're rausing!",
            "review_score": "1"
        },
        {
            "review_text": "Vlambeer is at it again. Better than Super Crate Box. Do you need more?",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to be an 8-bit fighter pilot? Well, LUFTRAUSERS is the game for you! Set to a brilliant soundtrack, the gameplay of LUFTRAUSERS is brilliant and highly satisfying. Short games that you want to keep coming back to is what you'll get with this game, with different unlockable customizations to make you the ultimate dogfighter. This game is all about those exciting moments where, with barely any health left, you manage to get the edge on your enemy and triumph after all. Whether you are a fan of Vlambeer's previous, Ridiculous Fishing; an arcade-style junkie; or just looking to have a fun-filled evening, you can't go wrong with LUFTRAUSERS.",
            "review_score": "1"
        },
        {
            "review_text": "BEST CONTROLS EVER    This is a fun game that feels great, you can pull of insane moves and dodges, all with a very simple control system that feels just right and you just feel like a badass when you triple flip to kill an ace, shoot down a jet and pull up in time to see your thrusters reflect in the water. And pulling this off is quite easy but still feels satisfying every time, adding to this is the customization of the planes which all offer their unique playstyles and cool soundtracks. For fans of bullet hell cahos and tryhards there is the insane SFMT mode which starts everything at the highest difficulty, it even has an achievment to survive for the first 15 seconds or so and it is brutal. If you are just looking for a little fun or want to play a challenging bullet hell game then this is for you.",
            "review_score": "1"
        },
        {
            "review_text": "The only bullethell game you'll ever need. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "The really special thing about this game is the fluid, exciting feeling of movement. The various other elements are well-designed to support that, but that's what the game is really all about. Not sure I'd call this a $10 game, but if you can get it at a discount, it's a real pleasure to play.",
            "review_score": "1"
        },
        {
            "review_text": "With only two achievements left to get and about 3 hours in... I'm conflicted. The game is fun, handles great, and the hard mode is exactly that. The missions range from simple to 'You expect me to do what?!', but I have a hard time recommending a game that has taken me nearly 3 hours to complete (It'll probably take 5 to finish all the missions). I was hoping for more after the airship. More ridiculous crafts to shoot out of the sky, a wider variety ships to kersplunk, and prehaps something other than the sky and the water. I had hopes that weren't realized, which happens in a lot of games I play, but this one hurt. Everything about this game makes me want more, but there isn't any more. I've gone and experienced the whole thing in one sitting.  So with all that personal hope aside, I do recommend this game if:  You're fine with the understanding that there isn't a whole new world out there after you beat the first real challenging thing in the game. You want a game you can pick up for a little at a time and chip away at increasingly harder challenges (missions). You want a solid shooty experience that's refreshing, fast paced, and hilarious. You love flying tiny aircraft with huge guns!",
            "review_score": "1"
        },
        {
            "review_text": "This game certainely luftraised my spirits!",
            "review_score": "1"
        },
        {
            "review_text": "Fast, instant fun. Short burst of gameplay - approx. 1 minute per play, depending on your skill.   Unlockable upgrades allow multiple strategies. Specific challenges for each combination test your skills.  Fantastic pixel visuals and great stomping soundtrack make this perfect.",
            "review_score": "1"
        },
        {
            "review_text": "very fast, very rewarding and very fun - i highly reccomend this fast paced, action intense shooting game. it's also insanely hard at points.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very good.It is in a very nice retro style and doesnt lag at all.some very cool enemys 10/10",
            "review_score": "1"
        },
        {
            "review_text": "that moment when everything is a bullet and you dodge it all  that moment when you land that final blow on a battleship amidst a hail of fire  this game is beautiful",
            "review_score": "1"
        },
        {
            "review_text": "A really cool little arcade style side-on aerial shooter. Bit like the original Geometry Wars in that the game rarely lasts more than a minute or two. This game though has the addition of little goals to work on and they get progressively harder. Definately good for short bursts of blasting action.",
            "review_score": "1"
        },
        {
            "review_text": "Luftrausers is a perfect example of a 'just one more turn!' game. I recommend this game for anyone who enjoys retro shooters or bullet hell games like Raiden and Einheinder. ",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game !  Pure arcade game. The controls are simple, and you should feel immediately taken by the frantic gameplay. Each play will last between 10s and a few minutes, depending on how good you are at dodging the endless streams of enemies bullets. But of course, you will want more, and in a few seconds you will be up in the air again trying to beat your previous score.  You might think that this wouldn't be fun for hours if you're not into 'getting the highscore' mentality. But Vlambeer (the studio who developped LUFTRAUSERS), manage to take that simple idea of an arcade dogfighting game, and add something more.   Your plane has 3 parts (Gun, Body, Engine) which you will soon be able to modify. There are 5 different parts of each type, which allow for lots of variation. More importantly, most parts are 'side-grades', which mean unlocked parts are not better, but different than the original parts. Each part requires you to adapt your gameplay, and will offer different strengths and weaknesses.  To encourage you to try all the parts, each part is linked to several 'missions', which are challenges you can accomplish with that part. For example 'Killing 5 different enemies types in a single game', 'Getting 5000 points in a single game', 'Kill 150 enemies accross all playthrough', etc... Theses are not mandatory, but will allow you to unlock other parts and a few other hidden stuff.   While trying to perform theses challenges, you will get to understand the different parts better, and find that some suits you better than others. I've often dismissed a specific part as weak, until i tried to complete its missions and figured out how to best use it (which part should go with which, and how to adapt my gameplay to the new plane). My 3 best scores have been with 3 different planes.   Also it's very telling that in forum threads asking 'what's the best plane for doing X ?' all theses answers will vary wildly. There is no 'best' plane. It's all about personal tastes and how you use each plane. So congratulations to Vlambeer for managing to balance all theses parts together.  All of that means that, over the simple arcade gameplay, there is that metagame to try to finish all missions. It may or may not please everybody, but i know it keeps me playing way more than a basic 'aim for the highscore' game would.  It's quite easy to unlock all parts, so no player should frustrated that they lack part, but for hardcore players, unlocking everything is gonna be a true challenge. Achievements stats show that less than 1% of players have managed to finish all missions.",
            "review_score": "1"
        },
        {
            "review_text": "If you get that 40% off coupon, definitely put it to use. Simple controls, advanced customization, small price tag, gargantuan replayability. To some it will seem like a rip off but I can assure you this one is worth the wallet funds. This ♥♥♥♥ even has rankings so you can be that braggin' stooge you've always dreamed of!",
            "review_score": "1"
        },
        {
            "review_text": "decent game that will give a couple hours of fun. pretty adicting. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Featured in Bullet Heaven HD, Episode 94!  ***You know Ser has been longing for this day. Several articles on PPR, constant training in the original Flash game online, tearful nights wondering when it was finally going to happen... Well, Luftrausers is finally coming home, but was it worth the wait? Watch to find out***          YouTube™ Video:  Bullet Heaven HD #094 - Luftrausers [PS3/Vita]&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Very simple and yet so much fun. In it's madness, there's no doubt that it is easy to get frustrated, but it's surprising how good you can get. I'd still call myself mediocre at best, but it was great.",
            "review_score": "1"
        },
        {
            "review_text": "Velcome to the Luftrausers, fellow future luftrauser.  It's you against the British armada, zey are many.  You unzer oth(z)er hand are ZE BADASS PILOT with a single schtick.  Are you MANN enough to crash into ze boat(s)?  [Bullet hell/fire Curtain/Touhou-like gameplay]",
            "review_score": "1"
        },
        {
            "review_text": "Bomber crahsed into me, steam crashed. gg",
            "review_score": "1"
        },
        {
            "review_text": "Buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like going to the store to buy milk but when you get home you realise you forgot to get bread and have to go back to the store because you need bread.",
            "review_score": "1"
        },
        {
            "review_text": "Most realistic flight sim in the world",
            "review_score": "1"
        },
        {
            "review_text": "I UNLOCKED THE BULLET-PROPELLED ENGINE  JESUS CHRIST",
            "review_score": "1"
        },
        {
            "review_text": "This is a brilliant little game that you can sink hours into!",
            "review_score": "1"
        },
        {
            "review_text": "Addictive gameplay. The enemy ace fighters are ♥♥♥♥ing ♥♥♥♥♥♥♥t, though.",
            "review_score": "1"
        },
        {
            "review_text": "My last words where ''Good thing I'm well armoured or i would have died from that last sho...*crashes into battleship*''",
            "review_score": "1"
        },
        {
            "review_text": "Okay... this game... is awesome! it's amazingly (addictively) fun to pilot a plane like this. the mechanic of your plane being repaired whenever you don't shoot is ingenious, adding a bit of risk vs. reward to every second of play. each new part adds to the experience, and whenever I got frustrated, I found myself switching out a part or two to create a completely different play style, and the pallette swaps are a nice touch.   However, there are a few gripes I have with the game. Several enemies can take you out in a snap, sometimes when they're not even on screen. I've had several occasions where I've gotten out of an intense dogfight with only a scrap of health left (with little else on the screen) only for a jet to zoom in and smack into me. Battleships either need less health or shoot less bullets, and an ace can often times take you out before you have any time to react. For several hours, most of my objectives consisted of 'take out a blimp to continue', but I can't for the life of me tell you the spawn conditions for one (sometimes they appeared 30 seconds in, sometimes three minutes of intense fighting will pass with niether hide nor hair). Blimps don't spawn nearly often enough to develop a strategy, and when I finally did beat one it was by dying with the kamikaze bomb part.  Despite it's shortcomings, however, LUFTRAUSERS' ten dollar asking price seems about right as an asking price, and I'd definitely buy it again. I can see myself sinking plenty more hours into this game.  ",
            "review_score": "1"
        },
        {
            "review_text": "After about an hour of playtime, you will have seen enough to know what to expect from this game. That is not a bad thing in this instance because Luftrausers is a great arcade experience that relies heavily on gameplay and control. Not much of a campaign or story to speak of, but the dogfighting feels sublime. Turning your customizeable aircraft in mid air after cutting the thrusters gives you a cool sense of gravity that reminds me of an old school game but with modern tight control. The devs haven't crammed a jillion gameplay elements into this hoping to add 'variety' either. The core gameplay stands on it's own and let's you get right into the fray without a lot of BS. And when you die, and you will, you'll be right back out there fighting it out within seconds if you wish. This is what I want from indie games. A game that doesn't try to pad out the experience to feel like a big title, instead Luftrausers does one thing uniquely and extremely well and with a lot of style.",
            "review_score": "1"
        },
        {
            "review_text": "This is a brilliant little game that you can sink hours into!",
            "review_score": "1"
        },
        {
            "review_text": "LUFTRAUSERS (roughly translates to 'air-routers'?!?!) is extremely personable and conservatively enjoyable. The soundtrack is award worthy and the game is presented really well visually. I can't say comfortably that the simplistic left-right-stop-go flight play is as sensational as the feeling provided by flying a little too close to sea level, but the controls are responsive and the physics just berserk enough to provide fast game play that doesn't feel as acid-trippy as something like Geometry Wars. This is quite bullet hellish, but difficulty comes from maneuvering an airplane with two speeds (on and off) rather than raw, unfair amounts of projectiles.   All in all it is a very charismatic arcade game with a scare amount of content but a **** ton of flavor. A good ten dollar game, a great five dollar game, and an even better summer sale clearance type of game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for a great price!",
            "review_score": "1"
        },
        {
            "review_text": " What I liked:      Simple nice upgrades that change planes style of fighting     Plane movement is fluid and feels great     The style and fast paced dogfighting, love dive bombing ships   What You Need to Know:      Has some a good ending if you can make it there     You unlock your parts by missions, some harder than others     Each weapon has 5 missions to unlock the next one, each getting harder as you do more     You unlock your parts by missions, some harder than others     Can unlock everything within an hour     Has missions after you unlock everything, so you can go for gold    My Score:",
            "review_score": "1"
        },
        {
            "review_text": "Even dying is cool! GET IT",
            "review_score": "1"
        },
        {
            "review_text": "Definitely pick this game up on a discount! Its a great filler game and if you like bullet hell games this will definitly tickle your nipples my friend.",
            "review_score": "1"
        },
        {
            "review_text": "Someone once said this game has 'styyyyyyyle'. Well, I'm happy to report It has it in spades my friends.   Luftrausers is basically Asteroids with gravity and World War I planes instead of spaceships. And it really goes for the aesthetic, presenting the whole game in a red, white and yellow sepia filter to match the WWI look of the menus and the various aircraft and boats.    You have goals that will unlock new parts for your plane that not only change the look and capabilities of your own craft, but also give the music a specific spin depending on the part you attach. This actually adds a lot to the game's minimal but stellar sound track.   There is no better feeling than when you become the plane! What I mean by that, is the moment when you wrap you mind around the controls. Then, before you know it, you're weaving in and out of a few battleship's bullet spray, while pulling a 180 to boost THROUGH your pursuers. Okay, so maybe its more than Asteroids with gravity and WWI planes, and thats why I love it.  Recommend it to a friend, Tino",
            "review_score": "1"
        },
        {
            "review_text": "This game is a must have if you want very good controls, the living hell out of bullets in the sky and the Feeling like a boss if you beat an damn airship out of the sky. The game is very hard and you need to find your personal mix out of weapon and Rauser. You can play as a super weak shotgun rauser which cant get hit by planes flying through him. Or you can play as a slow, heavy Rauser with very much health. The weapons are all well done. The Soundtrack of the game is epic, dont need to say any more words. If you like the style of the game, buy it. if not, buy it. I would recommend this game for EVERYONE who wants even just a little challenge in games.  Some gameplay (my own video):         YouTube™ Video:  &nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "So much consistent WIN",
            "review_score": "1"
        },
        {
            "review_text": "This game is sweg, low price, very fun, in the first day I already have 2 hours on it",
            "review_score": "1"
        },
        {
            "review_text": "It's pretty good. The music will make you jive until whiplash, the number of combinations to make your plane are probably higher than you can think, and the buttery smooth controls with make you slip off your keyboard.   LUFT/RAUSER",
            "review_score": "1"
        },
        {
            "review_text": "Sometimes when I play this game, I imagine the enemy saying this.  'Sir, we are pretty powerful, right?'  'What kind of question is that, Vladmir? Of course. We are unstoppable'  'Good to... Sir!  'What, Vladmir!?'  'Look at this'  'What is it?'  'There is an enemy plane'  'It will be blown up soon. Wait for a minute'  'Sir, this plane has an underwater propeller and is firing missles. It also has a nuke for a body.'  'What? That is completely-' *explodes*  In an industry full of games attempting to be stupidly serious, this is anything but. Where other games have cover, this has explosions. Where other games have story, this has customisable freakin planes.  You can equip a body that fires missles out of it as you fire, giving the ability to recreate a one-man blitzkrieg where every enemy you see is basically screwed. Buy this game. Now.    But in reality, I have really enjoyed this game. Like, I love it. It has it's downs, sure, but that's besides the point. It is fantasic to fly around in a full 360 degree angle and shoot anything that lives. I love it's customisation, it's charm, it's enemies, it's everything. I want you to buy it and see for yourself. Good luck out there, you ♥♥♥♥♥♥♥ pilot, you  10/*explodes*",
            "review_score": "1"
        },
        {
            "review_text": "This is a frenetic, side-scrolling dog fighting game and it's a lot of fun! The fact that it's a side-scroller means that simply allowing your plane to fall is a valid movement strategy. You have unlimited ammo and your health will regenerate but you can only use one at a time. Your health doesn't regenerate while you're shooting so you really need to balance your approach to attack and defense.",
            "review_score": "1"
        },
        {
            "review_text": "THIS GAME IS HELLA GOOD BUY IT OR DIE!!!!!!!!!!!!!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is totally worth the price of admission. The beauty is in it's simplicity. It sort of reminds me of Super Meat Boy, or One Finger Death Punch... It's immensely satisfying to play; it has some really neat customizations for your plane -- and the soundtrack is excellent!",
            "review_score": "1"
        },
        {
            "review_text": "Very fun authentic german war plane simulator. Quick, buy it when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "!",
            "review_score": "1"
        },
        {
            "review_text": "I absolutely recommend this game! The flying feels fantastic, the customization is done very well, and the game is all around very intense and satisfying. Worth the money for sure.",
            "review_score": "1"
        },
        {
            "review_text": "You get to attach a nuke to a plane and crash it into a blimp. Badass simulator 2016",
            "review_score": "1"
        },
        {
            "review_text": "I have no freaking idea why I'm enjoying this but it's cool.",
            "review_score": "1"
        },
        {
            "review_text": "So, I'm just a few parts combinations away from full completion of this game, and wow. Just... wow.  You start off in a pretty simple manner; you have a standard machine gun, normal armour, and an engine. Letting go of up stalls the engine, allowing you to begin drifting back to the water. Entering the clouds or the water causes you damage, to start with anyway. Stop firing, and any damage you took begins to regenerate. And that's the nice, simple start.  By the end... Well, you'll be flying around furiously, firing giant fireballs that explode on impact with an enemy, equipped with a submarine propeller so water no longer hurts you, with the fuselage of a nuke that explodes on your death. Oh, and there'll be a siren going off, and not long after it's likely you'll be dead.  And eventually, after some seriously difficult challenges... you'll unlock the U-Rauser, and boy, you probably didn't see that coming. But you'll have enjoyed every second.",
            "review_score": "1"
        },
        {
            "review_text": "pro tip: you can play it online as a flash game  it's still honestly worth buying, considering its fun as hell and the profile backgrounds are pretty damn sweet.",
            "review_score": "1"
        },
        {
            "review_text": "This game is another shining diamond from Devolver Digital, makers of one of my all-time game series Hotline Miami. (It even features some recycled Hotline Miami musik, so you know that part is wonderful.)  A triumph for pixel art in games.  Works off the principle that what goes up must come down (YES!--gravity), using this physic to create a whole new twist to twin-stick shooter arcade play. Also, playing like a suicide-bomber can be to your advantage as you can use your plane to melee enemies as well as to fire missles. Very challenging gameplay (the achievements will most likely not be hard to cook through, but the game itself provides a beautiful challenge and you can compete for high scores).  The art is simplistic, but subdued, easy on the eyes, and beautiful. The art style is unique and fun, the kind of art you would expect from Devolver. Beige color-scheme is interesting. Play-style is customizable (you can alter weapons/parts of the ship).  The gravity mechanic doesn't make sense in light of the German war Aero-plane theme, but oh well. It's a video game and absurdity is welcome. The sky and water serve as a function of the game, not just backdrop, so I guess it all works.  I came to love this game in a very short time and this is definitely doing to be one of my top picks for a long while.",
            "review_score": "1"
        },
        {
            "review_text": "Very simple game with addictive gameplay and rewarding upgrades.",
            "review_score": "1"
        },
        {
            "review_text": "10/10... My eyes hurt.",
            "review_score": "1"
        },
        {
            "review_text": "LUFTRAUSERS is pretty much what it looks like: an arcade dogfighter. I was expecting a story mode or something similar, but all I got was a straightforward 2D shoot-em-up. That having been said, I am not in the least disappointed by what I received; this game knows what it does and does it well. It provides the classic arcade experience of scoring as much as possible without dying, throwing in for bonus the rush of excitement when you stall in midair, watching hordes of enemies and waves of bullets streak past you in a whirlwind of death. The stalling mechanic is really what makes this game so good; you can stop accelerating and simply let gravity do the work of dodging hazards for you, then after changing direction speed up at the last second and escape the jaws of death. Obviously it's not a lot of content, despite the number of ship parts allowing for a commendable combination of ships and thus playstyles. For what I paid, however, I'd say I easily got my money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "'LUFTRAUSERS' is kind of an interesting indie game; it takes place in an alternate history setting, where in World War II, Adolf Hitler never came into power. So, in this universe, the Germans were allies, and the Nazi party never existed.  The enemies in the game are the Japanese, the Russians, and the Italians. It's an interesting game where the main protagonist is a fictional World War II pilot.  Anyways, the gameplay is quite interesting; with interestingly made 2-D graphics with a distinct 'retro-like' feel to them, a high quality soundtrack, and interesting yet simple gameplay, this sure beats having to play the video game, 'Gods &amp; Generals'. I highly reccomend this game, for anyone who likes alternate history-themed games. It's quite challenging, but it's supposed to be. I give it 4/5, saying that it's a simple, yet quite fun game, though $9.99 seems kinda pricy for this game, (I would reccommend getting this whenever it goes on sale) but if you're a die-hard fan of alternate history games or simply excellent indie games, GO FOR IT, because for a simple arcade-based space shooter, it's AWESOME!",
            "review_score": "1"
        },
        {
            "review_text": "It's all fun and games until a ♥♥♥♥ing blimp with guns on it pops out of nowhere.  ",
            "review_score": "1"
        },
        {
            "review_text": " This review goes through 3 big pros and 2 less-big cons of Vlambeer's arcade-style bullet-hell dogfighting-simulator game  LUFTRAUSERS .",
            "review_score": "1"
        },
        {
            "review_text": "Thouroghly enjoyed this game 11/11 gassed too many. Can't find ancestors in ashtray... ^^^",
            "review_score": "1"
        },
        {
            "review_text": "Dis is pefrect geme if u liek luft and rausers 10/10 wuold raus again.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly addictive",
            "review_score": "1"
        },
        {
            "review_text": "I'm in love, I'm so in love, Luftrausers has been out for awhile and I was always wondering if I should get it, I always thought 'I will enjoy it but I won't get much playtime out of it', well I bought the Indie Humble Bundle 12 for Prison Architect and was pleased that this game was part of it, I came home from school the next day and launched it. I played for 6 hours straight. This game is insanely addictive, it is the very definition of Bullet Hell, and there's a way to play for everyone! Like tons of health and massive guns? There's a combo for that! Like speed and lazers? There's a combo for that! do you wanna Kamikaze boats without taking any damage and have guns for backup? THERE'S A COMBO FOOR THAT ♥♥♥♥!!!!!!!!! This game is crazy addictive and I regret putting off buying it for so long, it's easily worth the measly $10 and I would say that price is too low cause it's so worth it. If you're debating getting this or not just buy it you will love it.",
            "review_score": "1"
        },
        {
            "review_text": "No exite butten, no option whatsoever, no tutorial... you dont need any of those. Just launch the game and have fun, the compat is very intensive and the soundrackt is just amazing.  Actual review :  You make your plane out of 3 components - weapon, body and engine. Every part has it own set of challenges assuring a nice longevity of the title. Every plane has it own theme playing and tbh the music is what's makes me going, the theme evolves during the gameplay and motivates me to do my best to hear the most i can. Flying/shooting is easy to pick up but has enough dept, so you shouldnt be bored. Meh writing this is a waste of time just buy the damn game and experience it by yourself.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a riot. You'll have fun trying out all the      different combinations of plane parts in the adventure of finding the ultimate fighter plane (for you). With an hour under your belt, you'll have unlocked all the parts, so that's not really satifying. I would have liked to see more parts added. I did get my money's worth and will still try to complete the harder achievements",
            "review_score": "1"
        },
        {
            "review_text": "good for killing time. The achievements at the beginning of each level threw me, but then i turned my brain on and had fun rausing.",
            "review_score": "1"
        },
        {
            "review_text": "This is a really great game for someone who wants an arcade game fix. This game really is a master piece when it comes to the arcade format of easy to learn but hard to master. The plane parts are all equally useful to the player and just depends on style with a few execptions we will get to latter. The overall experience is highly enjoyable with some complaints that are really annoying but do not take too much from the experience, first of all the menu is horribly designed, some parts are useless like the rockets which are no doubt the single weakest weapon in the history of virtual warfare and geting a good score is dependent on the enemies appearing in the right amounts leaving you wondering sometimes if they got the right post code. Like I said at the beginning this is no doubt a good arcade game, just be willing to endure a few annoyences.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game, it's small and simple, but highly addictive. Ideal for a lunch break or a competition amongst friend.",
            "review_score": "1"
        },
        {
            "review_text": "like Geometry Wars for hipsters.   -not the extreme-type of bullet hell shooter which makes it slightly more accessible  -delightfully retro graphics and music (unlock and enable VIDEODREAMING mode and you'll really be tripping) -customizable loadouts where each part is technique waiting to be mastered. The soundtrack changes depending on what parts you pick is also a nice subtle touch -the challenges (reminiscent of Jetpack Joyride challenges) are also pretty accessible where you feel like you accomplished something instead of just grinding forever -nothing really more satisfying than having an epic run and it ending by yelling ♥♥♥♥ YOU and crashing into a blimp/battleship with the Nuke body -that feel when you launch the [CLASSIFIED]   maybe not worth the full $10 for the amount of content but still a pretty good time",
            "review_score": "1"
        },
        {
            "review_text": "This game is really solid. I like how it breaks up the fact you're always playing the same level by spicing up you plane with really varied parts.  I don't think there's enough content here for what you pay for but I love the time I spend here.",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to fly a plane? Have you ever wanted to make a hybridized montrosity? Have you ever wanted to rage after getting killed by a battleship?  Then get this game. If you answered no to any of those, get this game. No matter what you say, want, or do, get this game.",
            "review_score": "1"
        },
        {
            "review_text": "LUFTRAUSERS is easy to pick up and play but it takes a fair bit of time get good at.  the three part customization is great, lots of items to unlock.  Well worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "This game strikes a balance between a 10/10 mobile game and pc gaming. It's very simple and easy to understand - however the challenges get harder as you become better at it. This game is easy to sink a few hours into without noticing. Personally don't feel it's worth $10 but pick it up during a sale or a 'humble bundle' and you won't be disappointed.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually realy good, I like bouncing around in the sky like that and it has pretty epic battles for a retro type game",
            "review_score": "1"
        },
        {
            "review_text": "My children raised themselves to adulthood while I played this game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Nazi Funtimes Dancing Party. Yay.",
            "review_score": "1"
        },
        {
            "review_text": "When I first saw this game, about 2 months ago, it didnt look fun. I thought it looked like a game made in a week, with little to do, and looked rather boring. Recently the game went on Humble Bundle, and I thought, why not. I got and it, BOY WAS I WRONG. IF THERE WAS EVER A GAME THAT MADE YOU FEEL LIKE A BADASS, THIS IS IT. Cop it at  humblebundle.com , or just steam it. SO WORTH THE FULL PRICE. So much action, customization, ect. So fun.",
            "review_score": "1"
        },
        {
            "review_text": "Very fun - This game is easy to grasp, but difficult to master. It's a good choice if you're short on time and feel like blowing stuff up, but also rewarding in longer play sessions. The pixel art graphics are really nice and fluid (my favorite animation is the nuke!), and the music is a great touch.   If you're on the fence about this game, I recommend getting it!",
            "review_score": "1"
        },
        {
            "review_text": "Arcade style shooter with a sense of very tongue in cheek fascist style.  Pros: Awesome style, solid upgrades, unique style of play. Cons: Very limited depth.  Perhaps not a $10 title except for the most dedicated arcade shooter fans. Not a bad pickup on a sale though.",
            "review_score": "1"
        },
        {
            "review_text": "Old-fashioned dogfighting mechanics, but not like you know it. Addicting, enthralling and simple learning cruve. Just pick and up play!",
            "review_score": "1"
        },
        {
            "review_text": "Picked it up in the sale, and i can definitely see this game becoming my go to pick up and play for a few minutes game until i find another game like that. Its fun to just go in and play a few rounds. Sometimes the round you just had felt really good so you'll play another and that happens. The music is good i hope they release the soundtrack soon. This game has a really good feeling slingshot flying mechanic. There is delay with your control in flight so you have to take that into account when dealing with enemies. Your ship can also take a decent amount of shots before dying and all you need to do to heal up is fly around without shooting. Definitely recommend, I bought it for $5 but if i'd known how much I'd have enjoyed the game I'd have probably bought it at full price.  Also you have to alt+tab out to leave the game and then right click and exit. So thats like a built in minigame puzzle that they put in for free",
            "review_score": "1"
        },
        {
            "review_text": "Best game to jump in and out of. Matches tend to last only about 2-3 min, unless you are on the hard difficulty (cant remember what it is called), in which there is an achivement for lasting for over one minute :P",
            "review_score": "1"
        },
        {
            "review_text": "Raus-ing is incredible - will definitely pick this up on multiple platforms to enjoy the chaos that is RAUS.",
            "review_score": "1"
        },
        {
            "review_text": "Easy to pick up, hard to put down.",
            "review_score": "1"
        },
        {
            "review_text": "Fun to play and a nice leveling system but i beat it in about 3 hours. I'm not sure why they didn't add more content when they had such a good system to work with.",
            "review_score": "1"
        },
        {
            "review_text": "Shoot ♥♥♥♥ the game X German propaganda 11/10",
            "review_score": "1"
        },
        {
            "review_text": " Pick-up-and-play, small in file size, and difficult bullethell dogfighter with quite a bit of customization.  Replay value relies heavily on the missions you are assigned to. Missions vary on the builds you choose before you go out and shoot things.",
            "review_score": "1"
        },
        {
            "review_text": "Epic game! The controls are like nothing else! The way the aircraft can handle, fall out the sky and boost back up-to speed to dodge incoming fire is amazing! Must Buy!",
            "review_score": "1"
        },
        {
            "review_text": "yes, get this bloody game. Very simple-to-understand controls and mechanics, very well executed. Hours of fun on its own or in between doing actual work. Also good music",
            "review_score": "1"
        },
        {
            "review_text": "No where else can you have so much fun freefalling from clouds in a plane.",
            "review_score": "1"
        },
        {
            "review_text": "I have fond memories of playing 'Time Pilot' and 'Two Tigers' in the arcade when I was a kid. This game is a stylish mash-up of the two -- with cool unlockable upgrades. Recommended! ",
            "review_score": "1"
        },
        {
            "review_text": "A really addicting game, with lots of different gameplay elements that can keep you playing for hours.",
            "review_score": "1"
        },
        {
            "review_text": "Tough, fast-paced arcade shooter that thrives on good momentum. Think Asteroids with a downwards gravitational pull, and a few points taken from bullet hell shooters.",
            "review_score": "1"
        },
        {
            "review_text": "It's a lot of fun when you need to kill a few minuets.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game highly recomend if you like fast paced games or bullet hell games some strategy is involved and brains are required otherwise very explosive and quick game not that difficult early on but gets much harder progressively.    Es muchos explosions!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to play a World War 2 dogfighting game.. AS A NAZI PILOT? Well then this game is for you an amazing 2d dogfight game awaits you. For a measly $9.99 you can chew through allied forces like a boss in a variety of fighter types.",
            "review_score": "1"
        },
        {
            "review_text": "Only got this because of someone on tumblr. 10/10 would plane again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is awesome. Fun gameplay, easy controls, and fair of amout of customization. Menu took some getting use to though,",
            "review_score": "1"
        },
        {
            "review_text": "Amazing little game",
            "review_score": "1"
        },
        {
            "review_text": "I'm glad that 70 years after the fact we can make video games with superficial faux national socialist themes without the Politically Correct Coalition blowing a gasket.  As for the game itself, it's a 2D multi-direction shooter with hectic, reflex based gameplay in a very old-school vein: fly, shoot, die and retry. The inertia and limited turning speed system let's you pull of cool maneuvers and makes it a bit more skilled than the average shooter. There are a lot of ship parts and combinations that allow you to experiment and find different styles of combat, and the adaptive soundtrack is pumping, but ultimately the game's format is limited and you'll burn out quickly.  And we still can't make games from the perspective of actual historical national socialists. No, that'll take another half a century.",
            "review_score": "1"
        },
        {
            "review_text": "LUFTRAUSERS is definitely one of the best indie games I've played. Cool music that changes depending on parts you use, good controls, great gameplay and a neat line of customization options, each with their own pros and cons to prevent you from cheating. Only real thing that's missing is the multiplayer.  Dead honest here, I have nothing bad to say.  If you happen to have a spare nine euros, spend them on this gem. Trust me, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. The soundtrack (which is great, I might add) changing depending on what parts you pick, the epic dogfights,.. Not to mention the overly awesome 'stall mechanic'. I definitely recommend this game. Good job, Vlambeer!",
            "review_score": "1"
        },
        {
            "review_text": "Y is dis so rausing!!!!!! Gawd daym it.",
            "review_score": "1"
        },
        {
            "review_text": "...Nice Style ... certainly yours ...",
            "review_score": "1"
        },
        {
            "review_text": "This is fun to waste a few minutes at a time on, like when your lectures get boring then you realize you should still pay attention because you gotta pass",
            "review_score": "1"
        },
        {
            "review_text": "A fairly solid game that gets the idea of short retry times being key to these arcadey stuffs.",
            "review_score": "1"
        },
        {
            "review_text": "Great fast-paced action/bullet-hell arcade game with a lot of options for different ships. VERY challenging",
            "review_score": "1"
        },
        {
            "review_text": "This game is pure, unyielding Chaos in an aerial dogfight. And it's amazing. Fighters, jets, boats, flying aces, battleships, submarines and even a Blimp to keep you busy, and all out to kill you (Usually at the same time) Enough weapons, engines and plane bodies to keep anyone happy and appeals to almost all playstyles.  Ok, I admit that the graphics style do take some getting used to, and for those looking for a good story or multiple levels will find the game lacking. But if honest that doesn't really matter. The gameplay is just insane, and for £7 you could get a LOT worse. But dive-bombing a battleship while dodging a hail of cannon-fire is just addictive :P",
            "review_score": "1"
        },
        {
            "review_text": "This is great, insane airplane bullet hell, quite literally for SXFT(?) - the later super-hard mode. Overall, it's neat how the different unlockables can tweak your playstyle, and it's cool to find your favorite combination of engine, body, and weapon. Overall, a great, awesome game.  IMPORATANT NOTE TO ALL: I RECENTLY, AT THE TIME OF THIS WRITING, GOT A BLIMP TO SPAWN AGAIN IN SEEMINGLY FOREVER. FIRST, I DESTROYED LOTS OF FIGHTERS, THEN KILLED SOME ACES THAT ARRIVED, THEN SOME DESTROYERS( whatever, the biggest ships) THEN A SUBMARINE. I HOPE THIS HELPS SOMEHOW.",
            "review_score": "1"
        },
        {
            "review_text": "Honestly, I'm getting ♥♥♥♥ing motion sick from playing this game. Its brutally difficult and the controls are really hard to adjust to. That being said, when you start to get good at it, its an amazing feeling.",
            "review_score": "1"
        },
        {
            "review_text": "Its like bullethell with guns. And planes. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "BOOM THERE GOES MOM",
            "review_score": "1"
        },
        {
            "review_text": "good game. nice soundtrack",
            "review_score": "1"
        },
        {
            "review_text": "Pros: cool graphics  cool flying  cool music  Cons: really hard for noobs like me  music stops when you die makes you feel bad (especially when it gets to good parts)  sometimes you have to play with crappy plane combinations to complete all challenges   If you are good at games I recommend if you suck don't buy it but since it's a good game i recommend ",
            "review_score": "1"
        },
        {
            "review_text": "This game is like visiting a classic arcade game, WITHOUT, having to pay over and over again after you die. In fact, in order to end the game, you have to die. Or at least that is what I understand from how much I played. Each body needs a strategy, each body needs a paired weapon, and every pair needs a bonus. Plus, what's even better is that the game itself is capable of being modded much easier than anticipated as it allows you to configure all of its resources to your own desire. Time to blow up some more battle ships.",
            "review_score": "1"
        },
        {
            "review_text": "Damn you, Rebornica, I picked up LUFTRAUSERS during the winter sale, a couple of days later, I'm hooked on flying up high in the air, stalling the plane and making it rain /Lasers/Missiles/Bullets/ETC upon everyone and watching the screen go nuts. Thinking of getting Luftrausers? GET IT. IT'S SUPER HYPE AND YOU WON'T REGRET IT.",
            "review_score": "1"
        },
        {
            "review_text": "This is seriously the most fun I've had in a long time.   It'll keep you entertained for hours, trust me. :)",
            "review_score": "1"
        },
        {
            "review_text": "No mouse control, therfore, controller is almost necissary to play this game. Despite that gripe however, Great Game overall.",
            "review_score": "1"
        },
        {
            "review_text": "This is way too addicting.   It also runs on my toaster of a laptop, which means I'll probably end up failing my classes. Thanks Vlambeer!",
            "review_score": "1"
        },
        {
            "review_text": "Wow. Addicting.  Edit: Very addicting",
            "review_score": "1"
        },
        {
            "review_text": "If you never played Vlambeer's original flash game LUFTRAUSER... well, you really missed out. If you have, LUFTRAUSERS is THE SAME BUT MORE! With customization, achievements, fancier graphics, and new enemies, LUFTRAUSERS is a must-have bullet-hell arcade action extravagansa.",
            "review_score": "1"
        },
        {
            "review_text": "A simple two-dimensional dogfighting game. That is not at all what Luftrausers is. In essence, it is a bullet heaven game. Your goal is to live as long as possible while everythiong else that moves does not. With the seamless and incredibly responsive controls, getting into a groove is easy as pie. Speaking of grooves, the seemingly infinite combinations of soundfiles lead to the game never seeming bland, soundwise.  In reality, Luftrausers is a bullet-hell/Rhythm/Shootere/Dogfight/Arcade/Shooter game.  Bringing together the classic genres, it does justice to them all.  10/10 would bang",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, I got it for 2.49 on sale, and its honestly just down to roots a lot more fun than most of the triple A titles I have played recently. It has good gameplay, amazing music, and a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "Yup. Yup. YupYupYupYup. You Buy. Yup. The Now. Aye. Yup. Now. Buy. Yup.",
            "review_score": "1"
        },
        {
            "review_text": "If this game ran on a quarter each life i would be broke on the street but happy nonetheless.",
            "review_score": "1"
        },
        {
            "review_text": "Luftrausers is a bullet hell game where you can customize your ship to survive as long as possible with missions to do to unlock parts. It also has a hard mode to an already hard game have a small problem with the health being the screen things are hard to see in the dulled out area can be annoying.",
            "review_score": "1"
        },
        {
            "review_text": "Luftrausers is an incredibly addictive 2D Arcade Dogfighter with a beautiful stalling mechanic that makes you feel like one of the best fighter pilots there ever was. A perfect combination of simplicity and endless frustration ensures this will stay in my 'Recently Played' for a long time to come.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoy this game. It is a unique take on the bullet hell style arcade shooters.  Pros: - Good, fluid mechanics. - Customisation breaks up the monotony. - Excellent pixel graphics.  Cons: - Quite short, within about 3 hours you will be done. - No multiplayer. I think this would really add longevity to the game, and it's unfortunate they didn't spend the extra time developing it.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, this game is tight! I mean, the controls are tight and the action is fast-paced and delicious. Zoom around downing inferior pilots in your self-healing killing machine. Try out all the weapons, engines and body types. Each part summons various challenges such as kill a battleship in max combo. You don't need fancy graphics when the gameplay is so well-polished. Good example of proper game design that a lot of dev teams should take notes from. This game really shines in its simplicity and what little it does, it does very well. Fully entertaining, absorbing my attention for several worthwhile hours and it is definitely worth the asking price.",
            "review_score": "1"
        },
        {
            "review_text": "LUFTRAUSERS is a fun little game if you want a game that you can pick up and put down easily. The soundtrack is great and very appropriate for the game, the art style is simple but beautiful, and the gameplay is fun but still challenging.  Check it out, it's a fun little gem.",
            "review_score": "1"
        },
        {
            "review_text": "From the guys who made Ridiculous Fishing comes a pretty interesting bullet hell. The main fun of this game is trying out the many combinations of planes available. Perhaps you'd like a laser-shooting hover plane? Maybe then you could sink the battleships which are the bane of your existence.  The gameplay of this game is just fantastic, so even if this isn't normally your thing, it's a pretty fun time waster.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very fun and addicting, the combat makes you feel like a total Bad@$$ because of the ability to stall and take out dozens of planes and ships, the game is slightely repetative and requires certain task to be done to unlock more plane parts, but this game is worth it's price, even if it isn't on sale.If you would like a demo the have a alpha version of the game on the Luftrausers website. Luftrausers isnt Luf Trausers, it is Luf=open and Rausers=air.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. one can spend hours on it! 4.5/5",
            "review_score": "1"
        },
        {
            "review_text": "An absolute blast, Vlambeer as always have delivered a truly fun experience that keeps you coming back for more.",
            "review_score": "1"
        },
        {
            "review_text": "You can shoot down planes... 420/10",
            "review_score": "1"
        },
        {
            "review_text": "If you like bullet hell games you will love this. Adrenaline filled action and intense awesomeness.",
            "review_score": "1"
        },
        {
            "review_text": "This game is amazingly addictive, if you like fast paced bullet-hells with unlockable plane parts and tight controlls, then I recomend this game.",
            "review_score": "1"
        },
        {
            "review_text": "Just wow. This game is amazing. Tons of customization, endless gameplay, nearly always trying to unlock something (unless you've unlocked it all), the physics are really well done. It is just...omg. My favourite thing about this game is that it shows that graphics isn't really needed to make a good game, the cartoon/8-bit layout just fits with the game perfectly. Also, this game is different from endless games like Jetpack Joyride because not always the same things happen. You could fight in the skies or fight near the sea. This game is just much amaze, very wow.",
            "review_score": "1"
        },
        {
            "review_text": "Lovetrousers is a fantastic game. It's fast, you fly, you kill, you die and you start again. Different builds of planes for different play styles. The kind of games where you say 'Just 5 more minutes' and end up stopping a few hours later.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun, but is more of an arcade/minigame if anything. It is extremely satifying to blow stuff up, and the controls are super simple and intuitive. Definitely worth getting, but not at its $10 price tag. Wait for it to go on sale.",
            "review_score": "1"
        },
        {
            "review_text": "LUFTRAUSERS is kinda perfect. Such a minimal concept but polished to perfection. The music is so awesome...",
            "review_score": "1"
        },
        {
            "review_text": "simplistic and great",
            "review_score": "1"
        },
        {
            "review_text": "Such a fantastic airplane shoot em' up! So lots of customization, great music, controls are fantastic and just an all around fun game! Pick this game up and play it immediately!",
            "review_score": "1"
        },
        {
            "review_text": "I customised a plane to shoot out of its ♥♥♥♥! 20/10",
            "review_score": "1"
        },
        {
            "review_text": "Great fast-paced action/bullet-hell arcade game with a lot of options for different ships. VERY challenging",
            "review_score": "1"
        },
        {
            "review_text": "Fun times for a little shooter game... reminds me of a simple version of Time Pilot but without the time... I am hoping for a sequel and it be much more in depth ... like a Moon Patrol like addition but with tanks and vehicles :D",
            "review_score": "1"
        },
        {
            "review_text": "First of all, I use a Xbox 360 Wireless controller w/ Wireless Reciever while playing this. This fast paced, smooth thumb stick controlled game is the sort of game I would've loved to have spent quarters on as a kid at the arcade. Changing your planes loadout affects the look, steering, acceleration, and weapon capability. This is a game I can revisit time and time again.",
            "review_score": "1"
        },
        {
            "review_text": "Probably my favorite bullet-hell shooter besides ikaruga.",
            "review_score": "1"
        },
        {
            "review_text": "Fun, Addictive, Great Art, Fantastic Music, HARD AS FUG, Loads of neat combos.  'Could be better' 11/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Great addicting arcade game",
            "review_score": "1"
        },
        {
            "review_text": "When LUFTRAUSERS goes, it really GOES.   Your fighter aircraft launches into the air. Give it a second or two, and a horde of smaller planes start chasing it. Battleships fire at you from below. And then larger planes start bringing down the pressure before a blimp threatens to obliterate you (that is, if you haven’t been obliterated already).  Your challenge is to survive the frenetic action and take down these vessels as you weave through the enemy fire. The balancing act of returning fire and then letting off to allow your fighter reprieve to heal up is core to your gameplay.  Experimenting with the different combinations of craft parts, completing missions and racking up higher and higher scores is all part of the fun here. LUFTRAUSERS is THE modern bullet hell-esque / arcade shooter game.",
            "review_score": "1"
        },
        {
            "review_text": "This is hype. There's no feeling quite like boosting through a swarm of enemy fighters, stalling out while simultaneously turning back towards them, and then blasting them all out of the sky.",
            "review_score": "1"
        },
        {
            "review_text": "Fast, hectic, punshing and rewarding.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, until you go into the menu, gets buggy and makes the game unplayable. Enjoyed it for a while but right now entering the menu for settings ruins the whole experience. Hope they patch the bug.   Overally everything is pretty neat. That saying gameplay, unlock, and mostly the style.",
            "review_score": "1"
        },
        {
            "review_text": "Overall - 9/10  Simple shootem up game that rewards players with new plane parts (Weapon/Hull/Engine) once objectives are met. Controlls are tight but very difficult to master. The more you kill the harder it gets.  Great music in this game that changes as you switch out plane parts. ",
            "review_score": "1"
        },
        {
            "review_text": "Got this in a humble bundle, I highly recommend it! Great soundtrack and unique gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "LUFTRAUSERS is easy to pick up and play but it takes a fair bit of time get good at.  the three part customization is great, lots of items to unlock.  Well worth picking up.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game, it's really chaotic and fun. the entire experience can be summed up with the frase: I don't know whats going on but I'm enjoying it!. I would reccommend this to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "I was originally put off by this game because it looks like another 'retro' indie game. After getting it as part of a humble bundle, I played a couple minutes and it confused the bejesus out of me. After about twenty minutes it started making sense and it is the craziest, retro-est, indiest game I've ever played, but not in a bad way.",
            "review_score": "1"
        },
        {
            "review_text": "I've been a big fan of Vlambeer's work for a long time, and this is more good stuff by that small team. A simple concept, Time pilot with gravity but with more weapons, armor and engines. The more you play, the more stuff you unlock. The gameplay goes by really fast but press up and your going again. This game screams 'I'll do just one more run'.",
            "review_score": "1"
        },
        {
            "review_text": "A game that you can play for hours without tiring, the gameplay is very intuitive, the ability to change the aircraft combination is great, and the music that accompanies you while playing is superb. there's also the possibility to unlock and use different filters to change the colors on the screen.  highly recommended! 9/10",
            "review_score": "1"
        },
        {
            "review_text": "One of the funnest games i've played in a while. Highly Recommend you try it out",
            "review_score": "1"
        },
        {
            "review_text": "Addictive Sepia Toned Shooting!",
            "review_score": "1"
        },
        {
            "review_text": "Shoot EVERYTHING, no matter how, just do it.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty gud",
            "review_score": "1"
        },
        {
            "review_text": "Fun arcade shooter. Really tough.",
            "review_score": "1"
        },
        {
            "review_text": "This game is brilliant. Don't let my short playtime deter you - I played it for hours on the train and in the airport.   Everything comes together - the music, the explosions, the feeling, the sirens.   If you haven't played Luftrausers, you haven't truly lived, my friend.",
            "review_score": "1"
        },
        {
            "review_text": "Wow! Vlambeer has done it again! This game is tremendously fun, and replayable!  Do you like the crazy nazies from the end of WWII? Do you like awesome controls? How about a completly awesome 'ChipTune' soundtrack? Then let me tell you Comerade, this game is for you!",
            "review_score": "1"
        },
        {
            "review_text": "Although LUFTRAUSERS is not a SHMUP  in the traditional sense , I'm still gonna call it  'SHMUP ON DRUG'  due to it's bullet hell and thre adrenaline rush.  The gameplay is simple yet clever and addictive. You try to stay alive using customizable parts to suit your own play style. The 'stop-shooting-to-regenerate-health' mechanic keeps you focus on the most important part, KILL and STAY ALIVE, rather than putting you in difficult situations where you died just because you need to grab 'that healing item'  The control is very responsive, although a bit confusing at first (if you're used to the six/eight axis free movement implemented in modern games), in LUFTRUASERS, you use LEFT/RIGHT to pivot/rotate your plane and UP to use the throttle/forward, but once you get used to it (and learned to master the control for the part combination you of your choice), you'll be going for the kill!  AWESOME MUSICS",
            "review_score": "1"
        },
        {
            "review_text": "it's worth for 10 bucks even just listen the bgm for this game XD",
            "review_score": "1"
        },
        {
            "review_text": "Raus-ing is incredible - will definitely pick this up on multiple platforms to enjoy the chaos that is RAUS.",
            "review_score": "1"
        },
        {
            "review_text": "LUFTRAUSERS is somewhat like Contra but with planes.",
            "review_score": "1"
        },
        {
            "review_text": "Holy ♥♥♥♥. RAUS RAUS!",
            "review_score": "1"
        },
        {
            "review_text": "A very fun game that gives you missions to do with different type parts that have different attubutes. A sure get ",
            "review_score": "1"
        },
        {
            "review_text": "There's nothing like the rush of energy you get after the bass drop in the soundtrack hits The excitement of perfectly weaving through hundreds of battleship lasers The serenity of flying up to the clouds with a colossal mob of aircraft on your tail- and then falling to the water, unleashing your metallic wrath on the unlucky opponents The deep, low battle sirens strike fear into your heart as guess what- a laser ace and five blimps aim their crosshares at you This game is so good I got almost fifteen hours out of it, and am still not done Vlambeer is amazing Buy the game And also play radical fishing",
            "review_score": "1"
        },
        {
            "review_text": "new twist on bullet hell. i love the simple design",
            "review_score": "1"
        },
        {
            "review_text": "Great fun arcade style game, games typically take minutes with a decent array of unlockables to earn as you level up by destroying everything using guns, tactics and the occasional ram  definitely worth picking up",
            "review_score": "1"
        },
        {
            "review_text": "MAKES YOU FEEL LIKE A BOSS, verry satisfying and adrenaline inducing. 10 outta 10",
            "review_score": "1"
        },
        {
            "review_text": "Great skill based shooter with an amazing soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "11/10 best time killer ever.  gameplay is a solid 10/10  but don't buy this if you're not a fan of MIDI music and pixelated graphic.",
            "review_score": "1"
        },
        {
            "review_text": "Wonderful challenging arcade plane shooter. Great art style and animation, brilliant music too. Slightly lacking in the amount of unlocks available and some balance issues.",
            "review_score": "1"
        },
        {
            "review_text": "really fun but I did something with the controles and now it just automaticaly shuts down",
            "review_score": "1"
        },
        {
            "review_text": "Had way too much fun rausin' around!",
            "review_score": "1"
        },
        {
            "review_text": "Extremely addictive, great music, fantastic gameplay. The first 8 hours passed by in a minute, too bad the later missions become a grind and the final missions are impossible. 25000 points in SFMT mode???? Right. I confess, in the final three missions in the end I... I... I cheated... &gt;sob&lt;  Otherwise incredible game. BUY IT!  One does not simply... Play 5 minutes of Luftrausers",
            "review_score": "1"
        },
        {
            "review_text": "Kickass soundtrack combined with hectic gameplay Masterpiece. I wish it had some kind of story though like every game should in this day and age.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun, except gets kind of boring after a couple of hours, and some of the missions to unlock new parts to the aircraft is really hard, and takes a while to get.",
            "review_score": "1"
        },
        {
            "review_text": "Started this with no flight expirence.... Ended it with insomnia.....  10/10 would fall asleep in class again.",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious and challenging, Luftrausers keeps a gamer occupied. Very fun and interesting to see how your precious little Luftrauser handles your choice of customization options.",
            "review_score": "1"
        },
        {
            "review_text": "Planes, Plane combat where wings haven't been invented, laser beams and guns for engines. Pretty good.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very aRAUSing",
            "review_score": "1"
        },
        {
            "review_text": "Great bullet hell game of absolute madness and i love it! Got 2 stories playing it.  1) Begin playing LUFTRAUSERS. Dies a couple times and gets used to controls Eventually begin to think i'm pro Yeah dodging bullets like a badass SFMT UNLOCKED 'bring it' Gets ♥♥♥ handed to me realise this was just the beginning and i was a newbie pilot.  2) Playing LUFTRAUSERS think of way to get achievements a lot easier change it so all enemies have 1hp Laser activated decimating hundreds of enemies screen shaking like some sort of earthquake numbers flying all over the place from where I'm getting kills Die a badass.",
            "review_score": "1"
        },
        {
            "review_text": "A great game for when you just want to play something mindless for half an Hour or so. Doesn't require much thought but can still provide a challenge for those who want to set High scores. Along with great music this game is a must have.",
            "review_score": "1"
        },
        {
            "review_text": "Whooo boy. Luftrausers.   Made by the same guys that did rediculous fishing, super crate shooter (or whatever it was called) and that weird atomic shooter game, Luftrausers is a bloody amazing, sepia washed side-scrolling aircraft shooter. Zoom through the air, shoot down enemy fightercraft with a bloody laser cannon, pull off a cool loop-de-loop to blast someone behind you, then die and customise your craft.  It's so simple that it could be an iPhone game, yet incredible addictive, intuitive, and just downright fun! The only reason I don't have more hours is because of CS:GO and basically no free time.  And oh yes, very old-school arcade game style feel. Pure brilliance. Iove you luftrausers, you crazy, stupid amazing 2d dogfighter.",
            "review_score": "1"
        },
        {
            "review_text": "This Game...             Is actually pretty good! 9/10 the bullets are circles",
            "review_score": "1"
        },
        {
            "review_text": "Simple controls, but tons of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great. The music is great. You will have fun I promise.",
            "review_score": "1"
        },
        {
            "review_text": "If you like challenging arcade games where you get to blow ♥♥♥♥ up 'till the sun comes down, You are absolutely going to love LUFTRAUSERS.   Get it. Get it NOW.",
            "review_score": "1"
        },
        {
            "review_text": "So yea. This is a game. You shoot planes. You die. You do it again. 10/10 Plane",
            "review_score": "1"
        },
        {
            "review_text": "Controls are intuitive and the gameplay is addictive. What's more to like?",
            "review_score": "1"
        },
        {
            "review_text": "This game is fun the father you get, but the only problem I have is when you change the key binding of 'shoot' is still tells you to press 'X' and not your button. I know it would take a while to make an image of each key but at least have it say 'Shoot Button' or something like that. The menu is also kind of confuising but other than that it is fun!",
            "review_score": "1"
        },
        {
            "review_text": "Great game :D",
            "review_score": "1"
        },
        {
            "review_text": "It's like pure awesomeness, but put up on my moniter.",
            "review_score": "1"
        },
        {
            "review_text": "This game is the best arcade game of the year. Why. Because of the guns the controls and the crazyness. LUFTRAUSERS is awsome",
            "review_score": "1"
        },
        {
            "review_text": "round and round, makes you spin all day   9/11 can do 360s",
            "review_score": "1"
        },
        {
            "review_text": "&gt;completed all missions and achievements &gt;dies from little boat in 10 seconds after game starts 100/10 would die again",
            "review_score": "1"
        },
        {
            "review_text": "Do not be fooled by the seemingly simple aesthetics. This game has a beautiful style in motion, perfectly used music, gameplay that makes you feel like a fighter ace. The Devs knew what they were doing.  The challenges can get insanely hard, though.  Gets a recommendation from me.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game, pure gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "This is basically a spectacle fighter game with planes.  ",
            "review_score": "1"
        },
        {
            "review_text": "Really fun to play, just make sure you don't change the control settings, really messes up your gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic little game. Fire it up and put on a podcast in the background once you tire of the sound effects - good unwinding recipe",
            "review_score": "1"
        },
        {
            "review_text": "Let me tell you. This is a damn good game. I love it and you will too!",
            "review_score": "1"
        },
        {
            "review_text": "I tthought it would be a very simple game, I got it on a sale.  Never would I imagine the details the devs have added, from the story, to the music, every detail is thought out. It's a really good game!",
            "review_score": "1"
        },
        {
            "review_text": "This is a pretty dang fun game to screw around in when you've got nothing else going on. It controls well and is extremely fast-paced and engaging. I love the little flavorful elements they injected into the game, like the music changing depending on which parts you're using. The selection of said parts is cool, and they each change the feel of the game drastically. I really dislike the homing missiles because even with the bomb or melee body it's just too hard to kill anything large, and their accuracy is surprisingly finicky given that their weak damage and low rate of fire suggests that their one trade-off should be an inability to miss. I still have two challenges to complete (not counting SFMT challenges), so I don't know what the [CLASSIFIED] is like, but my favorite Rausers are 'Holy Diver' and 'Staff Pick.'  However, I feel fairly emasculated by the number of digits in the score display. Do people actually score hundreds of thousands of points at this? My high score is like 30,000, and that's because most games I play spawn three battleships in on me at the same time and I honestly don't understand how you're supposed to deal with three battleships given their range and rate of fire. I mean, seriously, even though I'm pretty good at killing battleships now, how the hell am I supposed to kill three of them when a new one willl just spawn in its place? In other words, I think this game would be better if it chilled out a bit when it comes to what it spawns in and how quickly it spawns it. To be fair, each game certainly gets interesting quickly.  That aside, highly recommend it. It's stylish, extremely well produced and just plane fun. PLANE FUN GET IT",
            "review_score": "1"
        },
        {
            "review_text": "best soundtrack  gud gameplai  gud art  love the soundtrack tho fav so far &lt;3      srsly tho buy this, good time waster and fun game if u are downloading larger games such as GTA V or Tamriel Online  ",
            "review_score": "1"
        },
        {
            "review_text": "Veyr fun game that you can play if you only have 5 minutes to play. Get it on sale though because it's not worth $10.",
            "review_score": "1"
        },
        {
            "review_text": "Is 9 euro ok for 2h of fun? Probably. It depends. Is 2 euro ok for 2h of fun good? Hell yes! If there is a sale it's must buy. If not, well, I would still buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Being a nazi was never so much fun",
            "review_score": "1"
        },
        {
            "review_text": "What can I say, this game reflects an ancient genre and playstyle common decades ago but with a minour inovation to bring it to life along with great soundtracks and customisation. I can't say anything bad about this game honestly and I would suggest to give this a try if you are ever curious.",
            "review_score": "1"
        },
        {
            "review_text": "Trying to get this game to work on a controller is a nightmare. It's such a pain to get it to work how you want to and even if you can get it to somewhat work, navigating the menu gets pretty frustrating. Tells you to press 'O' to get to menu or whatever, you have to reach out to your keyboard to press it, cannot assign it to one of your controller buttons.",
            "review_score": "-1"
        },
        {
            "review_text": "I just found the gameplay too chaotic to get into. It just wasn't for me. There seemed to be no goals, nothing that would ease a player in. It just throws you in at the deep end and - as far as this game was concerned - I had no idea how to swim.",
            "review_score": "-1"
        },
        {
            "review_text": "Should have made an option to play as a boat because at least half of the time you only end up fighting boats. The rate at which enemies appear is wildly inconsistent. Sometimes the screen is filled with enemy planes and you can get wicked high combos easily, sometimes you just fly around the boats and it takes much longer and is much less thrilling. I liked it a lot at first, but it stopped being fun after a few hours.",
            "review_score": "-1"
        },
        {
            "review_text": "Very fun. Just not 10 euros of fun.",
            "review_score": "-1"
        },
        {
            "review_text": "Peel back the art style and what you have is a fairly average shooter. Enjoyable for about 5 minutes before the enemies shooting at you off screen and the almost invincivle blimps start to grind on you a little. 10 more minutes and you will be moving onto another game.",
            "review_score": "-1"
        },
        {
            "review_text": "controls suck, gameplay is too basic even for an 8 bit game, color scheme is never ending and irritating, don't do this to yoruself.  would be a great game to give to someone you do not like. I think I ended up with this garbage thanks to a humble bundle...",
            "review_score": "-1"
        },
        {
            "review_text": "make sure you pay attention to the tutorial, because you wont find the controls in the options menu.",
            "review_score": "-1"
        },
        {
            "review_text": "While it has its moments, it doesn't have enough to provide me entertainment beyond just a few minutes. Its biggest issue is the pure lack of content, or rather the rate at which you unlock new airplane parts. Maybe 20-40 minutes into the game I unlocked every single plane part (except for the top secret last ones), and thus I really had nothing else to play for. While there is that final unlock, it just becomes a technical challenge and a grind due to the lack of unlockables, which makes for painfully unfulfilling gameplay. Overall I would give this game a 4.5 out of 10, because it gets very old very quickly.",
            "review_score": "-1"
        },
        {
            "review_text": "horrible controls don't get. Not enough content to justify 10$",
            "review_score": "-1"
        },
        {
            "review_text": "Deliberate lagspike when you get hit by anything. INTENTIONAL. Dont buy this, dont get this for free.   I want my time [s]spent[/s] wasted back.",
            "review_score": "-1"
        },
        {
            "review_text": "No widescreen support in this day and age. Ridiculous, unacceptable! Also, no v-sync option.",
            "review_score": "-1"
        },
        {
            "review_text": "LUFTRAUSERS (the title is, apparently, all caps) is a very simple 2D arcade-style game. You control a plane which flies around and shoots enemy planes. Unlike a schmup, where you proceed left-to-right or top-to-bottom, this is a side view, looking at a plane flying over an ocean, dogfighting vertically and firing on boats below.  The game has a highly non-standard control scheme – you can fire, you can boost, and you can pitch your plane up and down, in a full 360 degree circle. The controls are very simple and kind of unusual, but you get the hang of them after a while.  The game has 8 different enemy types – basic planes, a nastier kind of plane, giant blimps, basic boats, submarines, battleships, and two rare enemy types which almost never spawn. You will encounter them all in fairly short order, and at that point, you’ve seen all that the game really has to offer – there is an alternate mode which is basically a bullet hell mode, but even the regular mode can start bordering on that at times.  You can customize your plane with five different weapons, five different bodies, and five different engines, each of which alter the gameplay of the game in reasonably significant ways, but ultimately the variety granted by these unlockable parts wears off after a short while. There are in-game missions which allow you to unlock parts and color schemes, each of which is attached to one of the parts, with each part having six such missions attached to it. If you beat all the missions, you unlock a final, alternate plane.  Really, this game is decent enough gameplay wise, but it just doesn’t have much depth to it. It is really simple and there just isn’t much variety to it in the end, so you’re likely to get bored with it after a short time.  If you got it as part of a bundle or something, it might be worth looking at, but it just isn’t worth buying – it just feels too simple to feel like an adequate stand-alone game. ",
            "review_score": "-1"
        },
        {
            "review_text": "So repetative in every aspect (music, gameplay, graphics, unlock system) and overall not very fun unless you love games that are biult for endless grinds and never being able to win",
            "review_score": "-1"
        },
        {
            "review_text": "Pretty fun for killing time, but intentionally-crappy controls make it hard to stay interested in. Most of the time I feel like I'm fighting to control my plane rather than fighting to destroy the enemies.",
            "review_score": "-1"
        },
        {
            "review_text": "Gets boring too fast.",
            "review_score": "-1"
        },
        {
            "review_text": "good fun play game rate 8 outta 8, but it is too edgy like ♥♥♥♥♥♥♥♥♥ (dot) gov so i rate 1 outta mate on this one",
            "review_score": "-1"
        },
        {
            "review_text": "Was a fun and exciting game untill the only control that worked was the up button. Thats the only one now. I've tried everything. Even uninstalling the game and steam and reinstalling them both in hopes that the update would undo the glitch. Ultrafun but a waste of money now.",
            "review_score": "-1"
        },
        {
            "review_text": "An awful trip to a level of graphics that really should be left in an era, circa 1988. I understand the 'retro' need for nostalgia - with the 16 (and sometimes) 8-bit looking games being popular these last couple of years. But this really does dip to a whole new level.  Essentially, you've got a weird hybrid game of Altitude meeting a set piece from Access's classic Beach-Head from 1984. Except both of these games are more fun. Anyone old enough to remember another classic - Domark's 'Wings of Fury' will also find this familiar - but again, the shooting planes and attacking ships was much better done in that game too.  I really am puzzled as to what they were trying to achieve with this game. It feels clumsy, truly horrific to look at in 2014 and just ultimately a very boring, bland game to play. I really wish I'd bothered with a demo before forking out even my measely £6.99 for it. It's not even worth that.  1/10",
            "review_score": "-1"
        },
        {
            "review_text": "it take so long to load you ♥♥♥♥♥♥♥♥♥♥♥♥ give my money back ♥♥♥♥♥♥♥",
            "review_score": "-1"
        },
        {
            "review_text": "Wish I could reccomend this game, because it COULD have been great. The controls are responsive and the graphics is nice. The sound and music however is just annoying, which sadly matches gameplay well. Enemy airplanes and boats have a godly aim, that every thing off screen always know your exact position and the bulletspam is awful. The controls are not accurate enough to make it a fun 'bullet-dodge' game, instead the controls make you feel engaged in duels - but it's not much about that, game is mostly about finding a cheese-tactic in order to scratch another mission off your list.  Every combination of gun/ship/boost make you feel crippled with drawbacks - you never feel like you are particularly strong or efficient, you just feel like a slug trying to all-in for a mission clear; die, repeat.  Drawbacks on all gear should be adjusted - it makes no sense that EVERYTHING has so strong drawbacks that you ALWAYS feel like a ♥♥♥♥♥♥♥ ♥♥♥♥♥♥. Want spread-fire? Ok cool, but you can barely shoot upward now because the kickback is so strong that you lose all elevation. Want laser? Sure, but now your aim sucks so you can barely make turns. Want to be able to handle collision? Sure, but now you die from 3 bullets instead.   Makes the game feel like a frustrating chose unfortunately.",
            "review_score": "-1"
        },
        {
            "review_text": "Overpriced flash game. Pixel art is nice tough.",
            "review_score": "-1"
        },
        {
            "review_text": "While the core gameplay is good, the game lacks severly in content, expect to see everything in an hour or 2. This is not uncommon in other arcade games, but in those games you would get your replay value from trying to get a high score and compete on the leaderboards. Not so much in this game because the leaderboards is filled with cheaters that has billions of points.  Point is that this game has no lasting appeal.  Take Race the Sun for example. While it also takes a few hours to unlock everything you still have random levels and a daily leaderboard after you've unlocked everything. In addition to that RtS also has different modes and player-created levels.  If you have to buy this game I strongly suggest you wait for a 75% discount and even then I'm not sure I would recommend it.",
            "review_score": "-1"
        }
    ]
}