{
    "app_id": 233190,
    "name": "Final Exam",
    "release_date": "2013-11-05",
    "developer": [
        "Mighty Rocket Studio"
    ],
    "publisher": [
        "Focus Home Interactive"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Co-op",
        "Shared/Split Screen",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards",
        "Steam Cloud",
        "Steam Leaderboards"
    ],
    "genres": [
        "Action",
        "Indie"
    ],
    "tags": [
        "Action",
        "Indie",
        "Co-op"
    ],
    "achievements": 32,
    "positive_ratings": 761,
    "negative_ratings": 143,
    "price": 6.99,
    "description": "Jump into the frenzied action and the whacky humor of a pure 2.5D side-scroller! While they were going to their old high school for what was supposed to be the party of their life, four long-time friends end up in a ghost town full of monstrous creatures.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/233190/header.jpg?t=1447357500",
    "minimum_requirements": "OS: WINDOWS XP SP3/WINDOWS VISTA SP2/WINDOWS 7/WINDOWS 8 Processor: AMD/INTEL DUAL-CORE 2.3 GHZ COMPATIBLE SSE2 Memory: 2048 MB RAM Graphics: 256 MB 100% DIRECTX 9 AND SHADERS 3.0 COMPATIBLE ATI RADEON 2600XT/NVIDIA GEFORCE 8600 GT/INTEL HD 3000 OR HIGHER DirectX: Version 9.0c Network: Broadband Internet connection Storage: 2 GB available space Sound Card: DIRECTX 9 COMPATIBLE",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Fun game. Designed for up to 4 players. Solo play is possible, but slower paced I felt, as I went through the game solo. Game was a bit short, and you end up revisiting some levels. Character animations are good, and the level system is okay. Leaderboards might have its fair share of cheaters, but maybe a purge of sorts could be implemented.  exploration thoughout the game is okay. i have yet to find all of the collectables to get the best weapons, and was able to join 2 games that were in progress online. Not for players expecting a wide range of enemies or deep story - it's all about collecting and killing for leaderboard supremacy.   a very cool pick up game that supports the XBOX controller that shouldn't be missed.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Final Exam video review - repetitive but fun mutant killing&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "I'm not sure why people are giving this a negative review. This game is an awesome coop game but I wouldn't recommend it for single player. Honestly, the story line is a little odd and not very interesting, but this is one of the few local coop games that actually have some pretty fun gameplay with a controller. Totally recommend this if you're a couch PC gamer that likes to have a few friends over for fun lol.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, much fun!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best mutiplayer platforms games i've ever played. Really enjoy playing it and setting my friends on fire with the flame thrower. Cant beat pure carnage and explosions.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is Awesome!!!You Need To Check it out!",
            "review_score": "1"
        },
        {
            "review_text": "This Game is epic i like it i cant stop playing it",
            "review_score": "1"
        },
        {
            "review_text": "Great coop game, tricky to master the combo... and to get the high combo achivements, but really fun to have  Coop is definetly the way to go, local or online.",
            "review_score": "1"
        },
        {
            "review_text": "If you ever play Obscure. You will know the girl in mission 5. this game is so fun. I like it!",
            "review_score": "1"
        },
        {
            "review_text": "Sat down with two friends to play a couple levels. Beat it in one sitting. Still have no idea wtf was going on. 10/10 Would football player again.",
            "review_score": "1"
        },
        {
            "review_text": "This game is AWESOME for co-op and I demand all of you ♥♥♥♥ers on my friends list buy this immediately!  Easily worth the regular $10 asking price, with enough replay value to be worth double that.  I'd have actually preferred the missions to be shorter, with maybe twice as many missions, but still totally fun.  Buy it now fruitcake!",
            "review_score": "1"
        },
        {
            "review_text": "This game is AWESOME for co-op and I demand all of you ♥♥♥♥ers on my friends list buy this immediately!  Easily worth the regular $10 asking price, with enough replay value to be worth double that.  I'd have actually preferred the missions to be shorter, with maybe twice as many missions, but still totally fun.  Buy it now fruitcake!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 Better than actual exams.",
            "review_score": "1"
        },
        {
            "review_text": "Woohoo.. Bashing enemies and throw the tovs all the time.. This one is another amusement time ever.. 5 out of 5!",
            "review_score": "1"
        },
        {
            "review_text": "While the game is very fun as far as beat 'em ups go, I bought it mainly for the couch co-op.  Couch co-op is the main issue with me: you can play couch local co-op with ONLY ONE person more.  Local co-op: 2 people, Online co-op: 4 people.  While this is mainly because of the missions and screen-space, I believe this should have been stressed more. I personally wouldn't have bought it if I knew only two people could play it on one screen.  If you play single/2 player co-op or online and like beat 'em ups - this game is for you and I'd recommend it - it has some sick combos. But if you were looking, like me, for 3-4 player co-op games on the same screen - keep looking, mates.",
            "review_score": "1"
        },
        {
            "review_text": "Holy crap! This game is fun!",
            "review_score": "1"
        },
        {
            "review_text": "Sheer fun. ",
            "review_score": "1"
        },
        {
            "review_text": "This game was a fun little romp. The art style is nice, and the controls are tight. However, the skill trees could use a bit more diversity and the enemies can be a bit spongy.",
            "review_score": "1"
        },
        {
            "review_text": "This game is quite literally co-op heaven. A fun 2D game with substance. If you've ever played the Dishwasher series, this is sort of similar in actions/combos. This game is a total blast, but I do find myself wishing there were different skills/ moves for different characters, they are mostly the same. On top of that, additional characters.",
            "review_score": "1"
        },
        {
            "review_text": "Definately worth it on this sick sale! I found it very entertaining - Feels very responsive - Doing long combos and mixing attacks never gets old. (at least for me) - Steriotypical yet fun characters",
            "review_score": "1"
        },
        {
            "review_text": "Woohoo.. Bashing enemies and throw the tovs all the time.. This one is another amusement time ever.. 5 out of 5!",
            "review_score": "1"
        },
        {
            "review_text": "its good beat n up coop game but the only con i think is repetive scenarios stages...and short campain mode.play with 2 or more friends to full experience",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Really good fighting system, good responsive movement and combos and many ways to kill your enemies. Skills, weapons and hidden items along the levels. Nice graphics and sound. It get's a bit difficult by moments, as there's a high rate of respawn, even in easy, but not to get frustrating. Lots of fun, and you can play it co-op in a single PC Definitely recommend it!",
            "review_score": "1"
        },
        {
            "review_text": "A side scrolling brawler. Looks interesting, but no story, boring level design, simple mechanics and simply no reason to give this even a second look, let alone playing or recommending it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game got me so hot and bothered with rage.",
            "review_score": "-1"
        },
        {
            "review_text": "I did not enjoy this game at all.",
            "review_score": "-1"
        },
        {
            "review_text": "i do NOT recommend this game as you cant even unlock the game because the tutorial is bugged. The alien you hit to complete the task is bugged and wont fall down when you do an upper hit. so the game is unplayable",
            "review_score": "-1"
        },
        {
            "review_text": "Well, I got this game in the humblebundle for a buck to have an evening of coop with my buddy and it was servicable for that, but little more. The game consists of basically 3 maps, on which you play the 8 missions. It has 4 types of enemies and one bosstype. Balancing is inexistent. Highly repedetive, but short. Netcode is solid though. We searched for every item and extra, which takes some time, if you don't you can breeze through the game in under two hours.",
            "review_score": "-1"
        }
    ]
}