{
    "app_id": 233210,
    "name": "Air Conflicts: Vietnam",
    "release_date": "2013-10-02",
    "developer": [
        "Games Farm"
    ],
    "publisher": [
        "Games Farm"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Multi-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Cloud"
    ],
    "genres": [
        "Action",
        "Simulation"
    ],
    "tags": [
        "Simulation",
        "Action",
        "Flight"
    ],
    "achievements": 16,
    "positive_ratings": 63,
    "negative_ratings": 169,
    "price": 11.39,
    "description": "The Vietnam War, one of the most explosive and violent wars of all time. You are Joe Thompson, an intrepid and patriotic pilot fighting to uphold the values of his country. This war will be the ultimate test for Joe and will irrevocably change his relationship with his family.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/233210/header.jpg?t=1447357501",
    "minimum_requirements": "OS: Windows XP/7/8/Vista Processor: Intel Duo 2.0GHz or compatible Memory: 1 GB RAM Graphics: DirectX 9.0 compatible graphics card (Nvidia GeForce 8800GTX+ or compatible with Shader Model 3.0) Network: Broadband Internet connection Storage: 5 GB available space Sound Card: DirectX compatible soundcard",
    "recommended_requirements": "OS: Windows XP/7/8/Vista Processor: Intel i5 2.5GHz or compatible Memory: 2 GB RAM Graphics: DirectX 9.0 compatible graphics card (Nvidia GeForce GTX 260+ or compatible with Shader Model 3.0) DirectX: Version 9.0c Network: Broadband Internet connection Storage: 5 GB available space Sound Card: DirectX compatible soundcard",
    "reviews": [
        {
            "review_text": "This is an incredibly awful, horrible, terrible, no good, very bad game. I am mad as hell that I spent thirty bucks on this grognard of a game and can't get a refund. Don't be like me -- I hope you read the reviews first before buying.",
            "review_score": "-1"
        },
        {
            "review_text": "Terrible game. its not even worth Air Conflicts name.",
            "review_score": "-1"
        },
        {
            "review_text": "I really like the game, but the helicopter on my joystick doesn't work so its better to you mouse and key board. you should try a joyskick to control the planes its easier and better.",
            "review_score": "1"
        },
        {
            "review_text": "Terrible graphics, poor voice acting, uncontrollable aircraft, tiny maps, and you can't set your own control scheme. If you're looking for a flying game then go elsewhere, because there is nothing good here",
            "review_score": "-1"
        },
        {
            "review_text": "i use to love this game but now , just hate it  who was setting up physics and steering omfg 5 years old kid will do it better dont buy it u will just loose your nerves on steering  b4 update was bad but playable but now is just total sht and im extremely disappointed",
            "review_score": "-1"
        },
        {
            "review_text": "Worse game imaginable! Please I mean please do not buy this.Even Hawx seems to be better then this game, it has nothing going for it other then maybe some good visuals here and there, sound is horrible, Soundtrack is the WORSE ive heard in any game ive played! .....At least super mario bros had a catchy theme you can whistle in your head while playing,with this game you just wish you were deaf instead!......Controls,what can I say if planes used xbox 360 controllers iam pretty sure they would have more then up and down! Everything about this game is just pure bad iam sorry to say.Nz",
            "review_score": "-1"
        },
        {
            "review_text": "Probably one of the worse games I ever experienced.  There's no way you can change graphics. The fukc?  Overall graphics is really weak. Controls suck as well. Dont waste your money and time on this piece of ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "Graphics are awful, even maxed out. Controls are awful, it's like flying a brick. Music is annoying and not very Nam-ish. Glad I didn't pay full price for it. :(",
            "review_score": "-1"
        },
        {
            "review_text": "this game is TERRIBLE! it looked good , cool planes from vietnam war era...but u cant fly them due HORRIBLE controls! u spend more time !@^%@^&amp; spinning around upside-down and all over the place and by the time u straiten out u have flown out of the 50 square meter map! terrible game even for a quik arcade shooter.",
            "review_score": "-1"
        },
        {
            "review_text": "Insanely difficult",
            "review_score": "-1"
        },
        {
            "review_text": "I could list every single problem of this game here,but the review would be huge, so I will point out the 'highlights'.First off, BUGS, loads of them, some missions are impossible to complete because of these bugs.Second, this game gets repetitive and tiresome, i spent 71 minutes on this game praying to all gods that it would end after the next mission, sadly it didn't...But the multiplayer is really cool to play, but then again ALL servers are empty so good luck trying to find a match.Overall if you have a lot of friends to play multiplayer with you, MAYBE this game is worth buying, but i would not recommend it.",
            "review_score": "-1"
        },
        {
            "review_text": "Great idea, nice to see nam era aircraft modeled so nicely. The main issue is lack of room on the maps when flying jets. You spend more time staying within boundries than actually doing anything. Bombing runs are an exercise in frustration.",
            "review_score": "-1"
        },
        {
            "review_text": "can't start",
            "review_score": "-1"
        }
    ]
}