{
    "app_id": 233270,
    "name": "Far Cry 3 - Blood Dragon",
    "release_date": "2013-05-01",
    "developer": [
        "Ubisoft Montreal"
    ],
    "publisher": [
        "Ubisoft"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Trading Cards",
        "Partial Controller Support"
    ],
    "genres": [
        "Action",
        "Adventure"
    ],
    "tags": [
        "FPS",
        "1980s",
        "Comedy"
    ],
    "achievements": 0,
    "positive_ratings": 9282,
    "negative_ratings": 1257,
    "price": 12.49,
    "description": "Far Cry® 3: Blood Dragon is THE Kick-Ass Cyber Shooter.Welcome to an 80’s vision of the future. The year is 2007 and you are Sargent Rex Colt, a Mark IV Cyber Commando. Your mission: get the girl, kill the baddies, and save the world.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/233270/header.jpg?t=1551434115",
    "minimum_requirements": "OS: Windows® XP (SP3) / Windows Vista® (SP2) / Windows® 7 (SP1) / Windows® 8 Processor: 2.66 GHz Intel® Core™2 Duo E6700 or 3.00 GHz AMD Athlon™ 64 X2 6000+ Memory: 2 GB Graphics: 512 MB DirectX® 9.0c–compliant DirectX®: DirectX® 9.0c Hard Drive: 3 GB HD space Sound: DirectX 9.0c–compliant         Perpherals Support: Windows-compatible keyboard, mouse, optional controllerRequires a UPlay account.",
    "recommended_requirements": "OS: Windows® XP (SP3) / Windows Vista® (SP2) / Windows® 7 (SP1) / Windows® 8 Processor: 2.93 GHz Intel® Core™ i3-530 or 3.10 GHz AMD Phenom™ II X2 550 or better Memory: 4 GB Graphics: 1024 MB DirectX 11–complaint or higher DirectX®: DirectX® 11 Hard Drive: 3 GB HD space Sound: 5.1 surround sound         Perpherals Support: Windows-compatible keyboard, mouse, Xbox 360 Controller for WindowsRequires a UPlay account.",
    "reviews": [
        {
            "review_text": "Holy ♥♥♥♥ this game is ♥♥♥♥ing awesome. Here's a list of things you'll do in this game: Stab cyborgs Use a throwing star to stab cyborgs from a distance Stab more cyborgs Sneak into a base and silently shoot cyborgs with arrows, when their friends walk over to the body to see what's up, sneak up behind them to stab them Disable a base's mega shields so that a gigantic damn dragon will charge in and stab cyborgs with its teeth Shoot an exploding barrel to distract cyborgs from the fact you're stabbing them Swim through waters that are filled with CYBER sharks and CYBER gators and enter a QTE that lets you stab them  Your squad even has a stereotypical black computer hacker who speaks with a wacky urban dialect. But he dies soon into the game because of racism. And racism towards blacks is wrong.  10/10, would stab cyborgs again",
            "review_score": "1"
        },
        {
            "review_text": "COD: AW  press f to pay respects FC3: Blood Dragon press f to show middle finger 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Blood Dragon is a great experiment by Ubisoft, a nostalgia trip back to the 80's as a total conversion of Far Cry 3. It feels like a blend of Tron, Terminator, and a typical 80's action movie wrapped into the Far Cry island. At the same time, the game parodies modern games with simple repetitive missions and a long, mandatory tutorial that your character complains about while you do it.  The game is a lot of fun, though I'm glad it's a small title. The nostalgia trip only gets you so far and certain things like looting corpses gets tiring by repeating the same long animation every time. The bad 80's action hero one-liners get quite tiring after a while too.  It took me about 8 hours to complete everything available in the game, which I think is pretty reasonable for the price and a good length for this sort of game. Any longer and I don't think I'd want to finish it, though at this length it is quite enjoyable. If you think you'd enjoy the nostalgia trip or just want some more open world fps action, this is definitely a good title to pick up.",
            "review_score": "1"
        },
        {
            "review_text": "Thanks, Ubisoft Montreal, for getting this right on the first try, because this is undoubtedly the only time it will be fresh and exciting. Still, the degree of creativity and the load of ideas on display really demonstrates which ways you can treat your source material inventively via spin-offs or DLCs. I really could get used to that.Fans of Far Cry 3 should not miss this fantastic experience, and anyone who grew up watching films like Terminator, Aliens and Commando owe it to themselves to play this, as it was certainly crafted by people who understand the culture.This game is pure irony: story, dialogue, music, graphics... everything recalls the craziest clichés of the 80s.Blood Dragon is a reminder that a story about one man killing thousands is just silly. That’s fine though, because games don’t always need to be serious. Games should just be fun, and that’s exactly what Blood Dragon is.Far Cry 3: Blood Dragon is a true manifesto of vintage culture, of 16-bit gaming and trash cinema: a gem of rare beauty!",
            "review_score": "1"
        },
        {
            "review_text": "Cheesy lines, power ballads, montages, neon purple, DINOSAURS- the 80s were good to us, and now they live again in the form of Farcry 3: Blood Dragon. Cannot recommend this game more highly, especially for the price that it’s typically sold at (generally about $5 on sale). It’s only short, but has all of the finely tuned mechanics of the excellent Farcry 3, laced with all the brilliance of the best parts of Predator, Rocky, Rambo and Top Gun. It’s just an extremely solid game that happens to be extremely funny- you’ll want to play it as much for the gun play, stealth mechanics, visuals and level design as you will for the HANDGLIDING (insert guitar wail here), neon bow-and-arrow, Ninja Turtles references and…HANDGLIDING!  Solid 9/10. Doesn’t bring anything particularly new to the table, but delivers a quality experience without ever taking itself too seriously. Expect about 10 hours of gameplay if you really take your time and enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "It's Far Cry 3. But funny, and with dragons that shoot lasers. Enough said.",
            "review_score": "1"
        },
        {
            "review_text": "Best Far Cry in the series.",
            "review_score": "1"
        },
        {
            "review_text": "'So I collect ♥♥♥♥, to unlock ♥♥♥♥, and then I get ♥♥♥♥. Got it!'  -Rex Colt   if you like cheesy '80 action movies then this game is for you. if you like music of '80 then this game is for you too. if you like cheesy humour and parody this game has it, a lot. if you like dragons look at a title of game  sadly game is very short but fun is guaranteed",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game but uplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome soundtrack, cool one liners, '80s background feel, nuclear future, cyborgs, Blood Dragons, f***ing neon world and Far Cry. &gt; &gt; &gt; Do you seriously need anymore reasons to play this game? Buy it in Mark IV style!",
            "review_score": "1"
        },
        {
            "review_text": "Well the game was great until a major update to Uplay jacked it all up and now the game just randomly crashes for no reason than to crash. I have this version I bought that is unplayable and a torrented version, Now take a wild guess which one works perfectly without crashes. I would have recommended this game in the past but as it is it randomly crashes during the worst of times and it destroys progress.   Fairwell my old time friend - your entertainment value was great while it lasted.    Maybe Ubisoft needs to Iconisize their ability to ruin good games and not understand what gamers want. I still don't dare buy primal for the pc as that has many problems much like this. The fact that two asset heavy overlayed framworks are running at the same time and one is superior to the other has to be blamed for the crashes as Uplay still has major memory leaks. If you want to bog people down with Uplay Ubisoft - Take your ♥♥♥♥ off steam and sale it only On Uplay. You dumbarses.",
            "review_score": "-1"
        },
        {
            "review_text": " If all DLC could be like this, everyone would love DLC.",
            "review_score": "1"
        },
        {
            "review_text": "I have completed 100% of the achievements and did everything in the game that there was to do (including collecting all items ever). I did enjoy 90% of the game although some parts left a more sour taste. The beginning is a long super-linear tutorial (1 hours+ in length) where you can not save your progress and the ending includes some really badly made arena fights, which are absolutely horribly designed and don't fit in at all (ending itself is also 1 hour+ long without a saving option). However, all other things were great! Very funny 90s B-movie-esque humor, great setting, funny retro-cutscenes, overall very solid gunplay (except arena), very good music, cheesy and funny voice-acting, enough stuff to do and things to explore. Although the game is quite short it is still a great value for the price!",
            "review_score": "1"
        },
        {
            "review_text": "Game forces you to Mess with Uplay adding another service on top of steam you have to mess with. Even when you do sign in and get Uplay to play nice the game doesnt launch and crashes to desktop. The word is that their DirectX11 version of the game has a bug. As far as I can tell you cant launch the other version of the game even when you go to the .exe cause Uplay gets in your way. This game has been out for ages and a bug like this is still around? Unforgiveable. Another example of Ubisoft shoddy work. I am starting to get to where I dread seeing their name on a product.",
            "review_score": "-1"
        },
        {
            "review_text": "Play with all the best Far Cry 3 perks without having to level up to use them. Blood Dragon is a bottled up version of Far Cry 3's great gameplay culminated in a cheesy 1980s style bad boy storyline. Sneaking around is so 21st century--run and gun your way to badass stardom!",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ this game ♥♥♥♥ ubisoft and goodnight. why the ♥♥♥♥ do i need uplay and steam. rot in hell ubisoft you and ea can eat the bigest herpy aid infested ♥♥♥♥ and die together.  Why is it easyer to pirate a game then pay for it and have to deal with your DRM overlay. as if steam isn't good enough now im being punished for paying a game.  And lastly shame on steam for selling games that require a whole nother game drm platform overlay.",
            "review_score": "-1"
        },
        {
            "review_text": " Ever wanted to be the ultimate 1980's action hero??",
            "review_score": "1"
        },
        {
            "review_text": "This game brought back many fun memories of my childhood. It's a little light on content, but if you grew up listening to casette tapes and using floppy discs you'll have a blast playing this. If people told you you're way too old to be playing video games, this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "Hey, ever wanted to shoot neon-styled weapons at large glowing dragons and rip the blue dripping hearts from robotic enemies' chests? Ladies and gentlecarrots:  Far Cry 3: Blood Dragon .  The Pros: · Kewl looking weapons that'll allow you to make heads go splat and limbs go splooch! · The amount of one-liners is so high it's only legal in Amsterdam.  · A big open map with quite a lot of content for only 15 boring real-life dollars. · If you melee thin air you'll actually flip the bird. You won't flip an actual bird over on its back but you'll raise your middle finger in a manner that says 'F**k you too'! · Very pretty-lookin' neon-rich visuals. I felt like I had entered an old 80s diner and just stared at the jukebox while being high on acid. (Jukebox or acid not required to play, but it might increase the experience. Seriously, what was the last time that a jukebox and/or acid didn't make something better? Except for rehab.)  The Cons: · Despite its gameplay mechanics (that actually work this time around, not like the original Far Cry 3) it has nothing in common with Far Cry what so ever. Apart from the devs, of course. Otherwise it'd be sued for copyright about now, and the only way to get it was either pirating the game or starting to dig holes in the Mexican desert. (Again, no eyepatch or shovel required.) · I need more of this. A full Blood Dragon game, with a bigger world and longer story and larger dragons and more guns and maybe even a bit more neon. Maybe. WHO AM I KIDDING OF COURSE WE NEED MORE NEON.  The Visuals: · I like neon. I like sci-fi. I like pretty things. Do you like neon, sci-fi and/or pretty things? But of course you do. Oh yes you do.   Final Verdict: · Things go pew pew pew and then you're like 'Oh noes I gots to heal!' and then you jam a cyberfluid-filled needle in your arm and you're all better and you're like 'Hell yes!' and things keep going pew pew pew until they stop and you're like 'Yeah time to go to the next thing and do more pew pew pew' and unkindly raise your middle finger at everything you may or may not encounter on your path to pew pew pew goodness.   11/10 because of reasons and neon.",
            "review_score": "1"
        },
        {
            "review_text": "Masterpiece, masterpiece, MASTERPIECE. It's a FarCry with the demential quoting attitude of Borderlands. Also reminded me of another great and funny FPS, Bulletstorm. I want another 42 of this.",
            "review_score": "1"
        },
        {
            "review_text": "One word for this game 'badass', this game is full of action, you can choose if you wanna be sneaky or loud but still the both ways are 'badass' and it has hilarious moments all the time. It worth every penny but beware it's too short, you should get this game on a good sale.",
            "review_score": "1"
        },
        {
            "review_text": "I am so happy I finally got around to playing this game, I've never played a Farcry game, but after this, I might pick up another.  Driving around, shooting commies, saying one liners, and hunting and killing beasts! If any of that sounds cool to you, pick this game up, give it a play through, and have an amazing experience!  This is 1 part though, it felt a little short, and it made me want more, so much more!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best uses of $15 that I ever made. Great graphics and full of funny, fast-paced action. Tons of over-the-top humor. It's an awesome break from playing most modern shooters, which seem to be grounded mostly in reality.",
            "review_score": "1"
        },
        {
            "review_text": "A fun little love letter to cheesy 80's and 90's Action movies. If you like you like cheesy action, one liners, and running around killing bad-guys as a cyborg Kyle Reese, you might like this game.   Gameplay's essentially just Far Cry 3 in a neon future with cyborg terrorists with laser eyed dragons that eat cyber-hearts for breakfast. Also did I mention Dragon creatures that shot lasers out their eyeballs and feast on cyborg hearts, yeah that's in this game. And instead of Jason Brody, You're Seargent Rex Power Colt (I'm Serious). A cyber-commando out to deal with cyber-terrorists threatening Lady Liberty and the USA. And he's armed with an Auto-9 Pistol from Robocop, a Cobra Assault Cannon also from Robocop, A Winchester Model 1887 shotgun much like what the T-100 wielded in Terminator 2, and a Fazertron sub-machine based off fictional plasma rifles used in the the Terminator franchise, And not to mention a laser knife and laser shurikens. The Story is pretty much your standard 80's action hero plot where the hero is out to kill an army of bad guys. Was it worth the money? In my opinion yes it was an I will happily pay for a sequel.  I'll admit the side-quests can get pretty repetitive and the neon is can hurt the eyes a bit. But if you like Power fantasy of being an 80's cyber-commando who takes no fall damage and runs around shooting people with laser rifles and dealingout cheesy one liners, This game is for you. Also it's a standalone DLC game, so you don't need Far Cry 3 to run and play it.  Edit: Seargent Rex Power Colt not Captain, My mistake",
            "review_score": "1"
        },
        {
            "review_text": "Genuinly fun modern fps which doesn't take itself seriously at all and is packed with hilarious cheesy stuff, like have a 80's action movie style hero who throws funny oneliners and flips the finger at enemies if you so desire :D  Blood Dragon is standalone DLC for the maingame Far Cry 3, so you do not need Far Cry 3 to play this but this isn't full length standalone game. Though the game is definitely worth the 14,99€ since it's very unique game and is filled with jokes even in the collectibles in the game and has references to all kinds of 80's and early 90's stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Blood Dragon is a more modern take on the games and movies of the 80's (and early 90's I guess). It's got lots of neon, dragons, a cheesy story, old school music and a lot, A LOT, of explosions. All combined into a neat little Far Cry package. Meaning it's an open world environment, and it has sidemissions and upgrades, too.  If you're from the 80's theres's a high probability you'll instantly fall in love with this game. I did. It looks great in motion, the voice acting is great (although the story is purposely ridiculous) and it has tons of action in it, thanks to some awesome weapons in it. The world feels a bit empty, however. Where Far Cry 3 was filled with wildlife, I rarely saw wild animals in Blood Dragon. But it's possible that was because of the lighing and the fact that I didn't really explore like I normally do. Nothing big, it just caught my attention.  Blood Dragon is, unfortunately, also a bit on the short side. Completing the game, doing only the main missions, took me about 3,5-4 hours to do. Enough for a downloadable game and more importantly, to keep things interesting. If you add the hunting missions and other sidemissions you can probably double that number. Upgrading your character also happens automatically (there are no skill trees) so replaying the game isn't all that interesting because you'll gain the same skills and perks every time, no matter what.   Not that it mattered, because I had a blast playing Blood Dragon, and that's all that counts. Recommended !  [Rating: 77/100]",
            "review_score": "1"
        },
        {
            "review_text": "Regardless of how good the game is, I didn't get to play due to Uplay forgetting my account altogether and ofcourse there was no help from Uplay. Dont support Uplay like I did or you will regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "can't reconomend, uplay",
            "review_score": "-1"
        },
        {
            "review_text": "Far Cry 3 was one of the most enjoyable games I have ever played. Now when I saw Far Cry 3 Blood Dragon up in the store, I knew it was something. At first, I thought it was a DLC or an expansion of the Far Cry 3. Turns out it was a spinoff. The idea of using the depiction of the future by the people in the 80's is the part I like the most in the game. Bright lights, cybernetic dudes, 80's sci fi naming sense (ex: Rex Power Colt), funky background music, obviously obvious screen hints, huge amount of puns, receive a ton of damage from lasers and fire and heal yourself by just exercising your right hand, gattling gun, dinosaurs, dinosaurs that shoots fire from their eyes, dinosaurs that has a gattling gun on its back and shoots fire from their eyes, a scientist chic, a villain, a comrade. Far Cry 3 Blood Dragon almost has everything you need in an 80's sci-fi themed game. Gameplay itself is basically the same with the Far Cry 3. Get weapons, earn money, equip weapons, spend money, capture bases, blow up innocent people, kill mutated and genetically engineered animals, burn a bunch of stuff, buy attachments, equip attachments, realize this attachment is better than this attachment so you equip the better one. Basically same. The bow didn't have a single attachment though but I'm good with it since you get to have a sniper rifle that makes a freaking loud and huge explosion at long range. Graphics were still the same. The map is smaller compared to the Far Cry 3 but with the frequency of cyber-nerds and omega force dudes clashing, you get to have fun when you decide to walk around. Completing the game 100% is also easy since the VHS tapes, the TV sets and the Carlyle's Notes were all displayed in the map. All you have to do is pick them up. The side-missions are still enjoyable as ever. Whether it's to hunt or to save a hostage, I am satisfied each time. I recommend this game so much. I know it doesn't have a lot of content and you can practically finish this game in 7 hours, but in those hours, you will enjoy every moment of it.",
            "review_score": "1"
        },
        {
            "review_text": "9/10  I loved how this game played. The 80's vision of the future is totally cool. The atmosphere is engrossing and immersive. You could exploit Death from above takedowns when you're at a high enough level for ♥♥♥♥♥ and giggles. The takedown system is great and it really helps with being a Mark IV Cyber Commando.  The gameplay is great, well optimized on my end, thanks to graphical settings. The story is full of laughs and i felt for Rex at times. It felt awesome to play as a Mark IV Cyber Commando. The game just does what it does so well. If you don't wanna get it at full price, wait for a nice juicy sale. But it is well worth it at full price. If you don't mind using a third party DRM (UPLAY) that is. (I'm clearly okay with it on SOME games.)  (I hate that some of the UPLAY actions did not credit on my account.)  Rex 'Power' Colt. Man, even the name is badass. I wish there had been an 80's cartoon series of this.  Would have watched the ♥♥♥♥ out of this. Great solid game. Would play again just to feel like a badass. -1 cause Uplay but it is still a solid 9/10 game. Go get it and kick some ♥♥♥!",
            "review_score": "1"
        },
        {
            "review_text": "The dragons shoot laser beams out of their mouths. Need I say more?... 10/10",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought ah right another bog standard fps but a few levels in it totally won me over with a nice variety of weapons including what appears to be Robocop's pistol. Buy it while it's cheap, excellent game with plenty of nods to all our fav movies as well as an excellent music score to suit the theme of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Has the feel of the original Far Cry Instincts Predator, combined with the Far Cry 3 system. Great game, though the constant red glare becomes a tad repetitive at times. Very smooth storyline with a soundtrack right out of every 80's movie you might thihk of all rolled into 1. Not a vast amount of weaponary available, but what you do have initially, when upgraded become largely overpowered. The sniper rifle in particular was my favourite. Think rocket launcher meets high speed and precision 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3: Blood Dragon is the standalone expanion for Far Cry 3, which was originally about survival and a bunch of pirates that have been ordered to hunt you down and kill you. Blood Dragon is completely different in the sense that the survival element has been completely removed from this standalone expansion.  Far Cry 3: Blood Dragon is basically a gigantic spoof of 80's movies and filled with 80's references in a comedic sense and cyber-punk manner. I didn't grow up in the 80's so I don't really get the jokes, but to anyone who has. This is the game for you! Far Cry 3: Blood Dragon is in my top 3 best games list of 2013, it's cool, it's funny and down-right stupid. Unlike Far Cry 3, which was based on the harshness of the jungle, the enviroment and the enemies, this game is NOT a frightful survival game, which I meantioned at the start.   THE STORY: You play as Rex 'Power' Colt, a cyborg military man who is rebuilt to be better, stronger and faster. You start out in a machine gun turret inside a helicopter (Yeah, best beginning ever) and descend to take a tutorial (which shows a comedic part of the game) When Rex Colt takes the tutorial, he is frustrated and angry and wants to shoot things, while the tutorial lady is speaking. (Quite a funny scene) It is chock-full of bright lights, with a cyberpunk feel to it making it graphically impressive.  THE PORT: Excellent port, has and FOV slider, full world detail changes and nice options to do with textures. Why did I list the FOV slider as a key feature? Becuase this one can go anywhere from 55-110, varies quite well when you really have a look at it.  RELEVANCE: This standalone expansion is quite similar to the base game, only cybered-up and takes off more 80's movies.  PROS  +Nice options menu and graphics customisation +Funny plot and comedic 'hints' +Isn't another ♥♥♥♥ing MMS (Modern Military Shooter) +Nice change from a jungle-theme to a cyber-punk theme +You run faster than you drive  CONS  -Short story -Low replayability -Everything is red -Smaller map -Useless side quests -Small amount of weapons (Some credit to the creators anyway, most of the weapons are spoofed) -Requires a Uplay account.  9/10, would definitely recommend picking it up on a sale.",
            "review_score": "1"
        },
        {
            "review_text": "This game is like playing through an 80's action film. Everyone needs this game. Seriously. I was literally laughing so hard because I was having so much fun blowing crap up. Also, it only takes about 5 hours to play through the main story. Bang it out in a day!",
            "review_score": "1"
        },
        {
            "review_text": "If you were born in the 80s or before and like the sci fi/action flicks of that era, this game is for you:   Over the top action, classic one-liners, tons of movie and game references throughout the game spiced with a fitting synthie soundtrack - Blood Dragon has it all, including great gameplay on one of the best game engine around.  Some things might become a little repetetive after a while, but still you'll have a f*cking blast with this game! Buy or die!",
            "review_score": "1"
        },
        {
            "review_text": "Now if you can remember the 80s youl find this game to be full of puns jokes and even makes fubn of its self in the begining.  if you dont have it already get it, it will run on most computers!",
            "review_score": "1"
        },
        {
            "review_text": "Best part is the robotic middle finger",
            "review_score": "1"
        },
        {
            "review_text": "Took me half an hour just to lauch the damn thing, thank to uplay. I installed it in the wrong language, and now, I cannot have it in French. The game is good, but the so called copy protection alone makes it unworthy of your money. It is so much easier to just pirate it. Ubisoft, damn you, my last purchase to your evil company.",
            "review_score": "-1"
        },
        {
            "review_text": "Overblown pseudoarcade sci fi 80s FPS with overglorified lazer displays and a tendency to make fun of itself. 9/10 would play again.",
            "review_score": "1"
        },
        {
            "review_text": "I remember the '80s. I remember the weird, disjointed remains of the CCCP as a collapsing threat, and the last vestiges of the terror of nuclear war. I remember thinking that corporations were going to soon be able to own people, and I remember those last, fleeting touches of a dead future.  Far Cry 3: Blood Dragon is more than just a parody. More than simply a mockery of an age, a tribute to ten mad years when we were trying to leave the past behind with lasers and robots. It is possibly the most cathartic experience I have ever had playing a video game. It's simple, yes. It's linear, yes. It has all the flaws and laudable elements of the initial release of Far Cry 3.  When most games want to build up to a climactic fight, they present you with a challenge. I see now that this is the wrong attitude. There should be no challenge. No huge game-topping boss battle where you struggle hard to apply everything you've learned and done throughout the game.  You should be an invincible sociopath with unlimited ammo. You should mow down waves of those who stand before you, cackling madly at their ineffectuality. You should play the end of most games like you play all of this one.  I was at the right age in the '80s to imagine myself as someone not unlike Sergeant Rex Power Colt. I found that the experience did not disappoint.",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy over the top cheesy one-liners and 80s aesthetics then this game is for you.  +great soundtrack +Michael ♥♥♥♥ing Biehn  +satisfying gunplay   -Uplay DRM  -short -No replay value  I would recommend buying this game when it's on sale, the game is great but I don't think it's worth full-price considering how short it is.",
            "review_score": "1"
        },
        {
            "review_text": "This short but fun expansion combines comedy with every cliche imaginable. Great game.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best Far Cry game.  This is the only Far Cry game you need.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I've ever bought. Blood Dragon does what not too many game have the courage to do. That's breaking away from the serious storytelling and just says '♥♥♥♥ yea! Lets mess ♥♥♥♥ up'. It places you in a neon 80's version of the future as slightly over powered cyborg. It's story line and charachter personility is the video game emodiment of 'America, ♥♥♥♥ Yea'.  The game keeps it fun, short and to the point. I 100% it in about 9 hours and had a blast doing it.  If you want something where you are garanteed to have fun, this is it.",
            "review_score": "1"
        },
        {
            "review_text": "Just....Yes....  If you don't have it get it now.  10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "This is to CoD what Duke Nukem 3D would've been to Wolfenstein 3D, if Wolfenstein didn't have Mecha-Hitler or a gatling gun. The weapons are fun as hell, the situations are fun as hell, and your character tosses out a gloriously awful one-liner after about every third mook he kills. There's even a feature to flip your enemies off. The non-one-liner dialogue is also quite funny, and mocks the 80's, gaming, and itself in equal measure.  Like in FC3, the nonstandard-in-a-good-way stealth system allows for ultra-stealthy infiltrations, semi-stealthy Arkham Asylum-style mook-terrorizing campaigns, tactical assaults with a stealthy start to shut down alarms / plant explosives / dispose of priority targets followed by a noisy finish, or just waltzing in with an unnecessarily large gun and murdering everyone and their reinforcements; all are viable, all are effective, and all are extremely entertaining, with many ways to carry them out, and many opportunities to do so in elaborate enemy complexes, filled with hiding spots and sniping perches. FC3:BD also adds the option of luring a big angry monster into the base after deactivating a shield, which, while hilarious to watch, does feel a little overpowered.  If the (very plausible) gameplay scenario of 'blast away an approaching cyber-panther with a quadruple-barreled incendiary shotgun, switch to a laser-bow-and-arrow, flip off a nearby cyborg, put an arrow in his knee, then quip that you 'gave him the SHAFT' as you approach to rip out his cyber-heart' doesn't appeal to you, I don't know what to tell you.",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3 Blood Dragon is a hilarious parody of 80s action films and pop culture complete with obligatory cheesy one-liners and montages with motivating 80s rock music blaring in the background. If you grew up gaming in the 80s and 90s, this game is a must buy. The only criticisms I have are that the main storyline is too short and the side quests aren't enticing enough. The cheesy one-liners also get a bit old after hearing the same ones over 100 times too!",
            "review_score": "1"
        },
        {
            "review_text": "Although a relatively short game, Far Cry 3: Blood Dragon provides a couple hours of extreme fun, 80's nostalgia, memes, and a vaporwave-esc aesthetic that is hard to turn down. Easily Ubisoft's best game, and one of my favorite shooters, ever.",
            "review_score": "1"
        },
        {
            "review_text": "A standalone Far Cry DLC that isn't 60€ like Primal.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A hilarious spin-off game based on everything 80's. With all the same style of gameplay and UI of Far Cry 3 reskinned into a neon wireframe enviroment filled with explosions, 80's sci-fi, and dragons, because you know why not. The game itself has a very comical playthough and will definetly fill up a decent ammount of time for your money. 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "You know a game is good when the neon lights are burning holes into your retina.",
            "review_score": "1"
        },
        {
            "review_text": "The perfect homage to many action and sci-fi films that were made in the '80s and '90s. Ever wanted to hold Alex Murphy's pistol in your hands? Or the shotgun the Terminator used in the plaza at the beginning of Terminator 2? If yes, Blood Dragon is for you.  Practically, you are given an island where you can go wherever you want. There are side missions to complete along with tons of collectibles to find if you do not wish to immediately make progress to the main story. Oh, and as an added bonus: the protagonist is voiced by Michael Biehn.",
            "review_score": "1"
        },
        {
            "review_text": "There should be a warning in the description that this game requires Uplay. If you are on the line about whether to buy this or not, know you will have to deal with some consequences.  I don't think the game understands how to correctly minimize. Pressing the Windows key doesn't work. Pressing Win + D doesn't take you to the desktop. Pressing Shift+Ctrl+Esc doesn't bring up the task manager. When you press Ctrl+Alt+Del, the game will automatically run in windowed mode with no option to minimize. If you want to make the game fullscreen again, you will have to go to menu -&gt; options -&gt; video -&gt; fullscreen and change it.  The game tries really hard to play satire on the genre its depicting, but it kind of comes off as an excuse for lazy game design decisions.  I have also found the first game that can't get to 30 fps on my computer using minimum settings. I know I don't have a workhorse laptop, but a one-year-old laptop with an 8870M should be able to play this game at some sort of level.",
            "review_score": "-1"
        },
        {
            "review_text": "was excited to play this until ubisoft's shitpile uplay put an end to that.",
            "review_score": "-1"
        },
        {
            "review_text": "Can't even play the game because uplay won't let me create an account.",
            "review_score": "-1"
        },
        {
            "review_text": "Far Cry 3 - Blood Dragon is a standalone from the FPS Far Cry 3. The game is set in a retro-futuristic world from the eighties, playing as cyborg Rex ''Power'' Colt.  PROS: + Unique style and dialogues  + A good dose of well-timed humor + Elimination of annoying physical aspects + Upgradable weaponry + Enormous amounts of amazing, satisfying action + Far Cry 3 is not required to run Blood Dragon + Trading cards  CONS: - The gameplay is a little on the short side - The story is shallow  If you love action, destruction and mindless carnation, Blood Dragon is for you.  My rating: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "I recommend this to you all.  -Great music -Funny jokes -Gives the feel of 80's action movie -Awesome gameplay  It's just a really good game.  11/10 Would ride a dragon again.",
            "review_score": "1"
        },
        {
            "review_text": "'I am your father! ' Version mecha, neon, plasma, and dragon ! Very furious to play! 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": " Neon Dragons shooting lasers from their eyes and attracted by cyber hearths of dead soldiers!? [KAMGUSTA's REVIEW]   Do I really need to add anything? What about great jokes ('Taking too much damage? Stop getting shot, okay? I swear, it’s like talking to a monkey')? 80's american film action references ('I must break you!')? Awesome weapons (full auto sniper rifle with explosive shells?!). The only con, it's more of a Far Cry 3 DLC than a game of its own... but who cares? Go buy and play.   Best played with Keyboard &amp; Mouse Recommended Buy Price &lt; 20$ Score 9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "★★★☆☆ - 'Worth a try, but only on a discount'   PROS: - Genuinely funny, from the comic style animations between levels to the constant gags during gameplay. - Blood dragons, they are cool not to mention at one point you ride one. - Its different, the game makes great use of Far Cry 3 but it a completely different experience. - The end mission is just brilliant. The one before it isnt bad either, missions have variety. Onslaught ones are best.  CONS: - Uplay, I personally have nothing but issues using Uplays DRM. With blood dragon it failed to save my progress within missions on a couple of occasions. - Fire, most enemeies use fire and god its annoying. - The game got a little tedious once the novelty wore off but ends really strong so stick with it.  VERDICT?  A unique experience and is definately worth a bash for its gung ho gameplay and genuine humour.",
            "review_score": "1"
        },
        {
            "review_text": "FRIENDS THROUGH ETERNITY, LOYALTY, HONESTY. WE'LL STAY TOGETHER, THROUGH THICK OR THIN. FRIENDS FOREVER, WE'LL BE TOGETHER. WE'RE ON TOP 'CAUSE WE PLAY TO WIN.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to the 90s! Age of awesome!  ",
            "review_score": "1"
        },
        {
            "review_text": "If you like B-Movies, 80's Action flicks, over the top action and funny lines this game is a must buy. You can complete 100% of the game (all secrets, attachments etc) in about 6-7 hours but its great fun, especially for the cost.  The song that plays when the credits roll is hillarious.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to the future (2007)",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3 Blood Dragon is one of those rare cases were the spin-off game is actually better than the main game in my opinion. It takes much of what Far Cry 3 does, condenses it into a smaller environment, makes everything much faster and easier to get to, makes you crazy powerful from the start, injects a crapload of style and 80's/90's referential humour into it, and offers a shorter and much easier to get into experience while giving you just enough stuff to do outside of the main story to easily justify the standalone price. Everything from the visual style to the cheesy neon environment and cyber-esque enemy designs just makes the short time spent in this game a joy. Throw in an amazing 80's style new wave/techno soundtrack from the guys at 'Powerglove' and you have one of the more unique looking and sounding games of the last few years.  An easy recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "such a good game. first time play far cry and i am so into it ",
            "review_score": "1"
        },
        {
            "review_text": "So much neon it crashed my computer.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a lot of fun and absolutely worth its money. Of course, the characters are stereotypes, but this is what it is about, right?",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3: Blood Dragon is a standalone companion piece of sorts to Far Cry 3, it reminds me of old DOOM Total Conversion mods, taking the existing engine and creating something new with it, the result is an eighties vision of the far flung future of 2007, where you take control of Sergeant Rex Power Colt, a one-liner spewing Cyber-Commando voiced by Michael Biehn, sent to a remote island in order to investigate the disappearance of Colonel Sloan, and obviously things do not go well as you uncover how far off Sloan has gone, drinking the blood of creatures known as Blood Dragons to supercharge his cybernetics with a plot of throwing the world into chaos  Overall the story invokes the feeling of many eighties films such as Commando, Cobra, RoboCop, and more, and they use this to write self aware jokes and dialogue which can be hit or miss, at times it feels like they are too self aware, but most of the time it does what it sets out to do very well.  As for gameplay, if you have played Far Cry 3 before you know what to expect, its a free-roaming open world set on an island with outpost you can liberate, collectibles to find, and cyber-sharks to blow up with explosives, which leads me to the missions and weapons, there is significantly less things to do in Blood Dragon then there was to do in the base game, you have two mission types for side missions, hunting and rescue, and very few actual story missions, to top that off you only gain about eight weapons throughout the game that is relatively short.  However do keep in mind that this is not a full retail product with a large price attached to it, for the price that it does go for you get quite a lot, and while it is true you can beat the game in a day or a few hours even if you rushed the main story, there are enough side missions and collectibles to keep you entertained.  In the end I believe that if you enjoyed the core concepts of Far Cry 3's gameplay and want a bite-sized version that is an homage to the fabulous eighties, you will enjoy this game despite the lacking replay value.",
            "review_score": "1"
        },
        {
            "review_text": "Why haven't you bought this game yet?",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 4 - Blood Dragon is a short and sweet game with all the excitement of a regular Far Cry game however it is quite a lot shorter than regular Far Cry games It took me 8 hours to fully complete it(and I was NOT speedrunning it). Also this game is more laid back and free-willing than regular games in this series and has much more freedom than usually in this series. Either way this game is a great one-day game and it is worth money.",
            "review_score": "1"
        },
        {
            "review_text": "this game is pretty cool, maybe knock it off w the tutorial bull ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "A shining example of human achievement and the power of narrative in video games.",
            "review_score": "1"
        },
        {
            "review_text": "An artistic masterpiece unlike nothing before. This game will make you constantly grin, with simultaneous lasers shooting from your eyes. A true definition of proper in-game-music, special effects, scriptwriting, casting, voice acting, cutscene art and overall epic badassitude.  Contains epic amounts of influence from the glorious 1980's era scifi and action movies, as well as music. Need to say more? No. You will love this game.  1986/10",
            "review_score": "1"
        },
        {
            "review_text": "Because it's ♥♥♥♥ing awesome and Neo Kitch",
            "review_score": "1"
        },
        {
            "review_text": "Looks like I just... BLEW MY LOAD  -Cyborg badass dude after blowing up a car.",
            "review_score": "1"
        },
        {
            "review_text": "★★★☆☆  Dragons are cool !",
            "review_score": "1"
        },
        {
            "review_text": "Money well spent!",
            "review_score": "1"
        },
        {
            "review_text": "Set in a 1980's sci-fi movie and with giant glowing dinosaurs, whats there not to like.",
            "review_score": "1"
        },
        {
            "review_text": "An authentic 80's experience that you with never forget... MOTHER♥♥♥♥A!",
            "review_score": "1"
        },
        {
            "review_text": "FC3- Blood Dragon is a brillant game whose unique style and countless references claimed my interest from begining to end.",
            "review_score": "1"
        },
        {
            "review_text": "A very good game at which you can rest since it is really easy but very fun to complete. It's not very long (around 2 hours of gameplay) but surely worth the money and the best thing is that it's a game itself, no DLC, no FC3 required to play this. Funny wirtten tips, good atmosphere and great voice acting. The only drawback I see is that you have to hold the interaction button to interact with things, not just pressing it once. After some time it's frustrating. But other than that, I surely recommend this gem.",
            "review_score": "1"
        },
        {
            "review_text": "That was cool. Blood Dragon is one hell of a addon of 2013.   So many references to my favorite movies like The Predator, The Terminator, Aliens, visual style, geek humor and stupid one-liners... loved it. And those sound and music brings back the childhood when every action film were like Christmas.   Blood Dragon looks and fills exactlly like in those days. Rex Power Colt is a hero from my 90s, cool and badass cybersoldier mark IV.   This was short but felt great -  9/10  ------------------------------------------------------------- Лучший аддон года, без обсуждений. Blood Dragon играет на ностальгии и делает это прекрасно: тонна отсылок к старым боевикам, музыка - каверы на саундтрек Терминатора, Чужих, Нечто и Хищника. Все в Blood Dragon выглядит и звучит как надо.   Продолжительность коротковата, но есть все предпосылки к сиквелу.   Отличное настроение после прохождения обеспечено.  9/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Not too unlike Farcry 3, except for the futuristic 80's mayhem!",
            "review_score": "1"
        },
        {
            "review_text": "This game is so good on so many levels. It is basically my reason for living now. I thought about just giving it all up now, but then I realized that thanks to heros like Seargent Rex Power Colt that give their lives, and take the lives of those evil cyborg robot soldier ♥♥♥♥♥♥♥s to let me have my freedoms. If you don't play this game, you hate everything our ancestors have fought for!",
            "review_score": "1"
        },
        {
            "review_text": "Do you remember when I said Id write a review for this game last? I lied",
            "review_score": "1"
        },
        {
            "review_text": "So much win!",
            "review_score": "1"
        },
        {
            "review_text": "Its awsome",
            "review_score": "1"
        },
        {
            "review_text": "love it but havent played it much ",
            "review_score": "1"
        },
        {
            "review_text": "HAve you played far cry 3? Well this ♥♥♥♥ is as awesome, only you have most of the abilities from the start, the game is hillarious, and overall there is less brain but more action. The only bad thing is that the game is a little to dark, and enemies have blue blood...everyboy wants real looking blood lets get real! Oh, btw, if you haven't played far cry 3, than you probably should grab ur armpit hair, cut it off, light it up on fire, and then after you that hair cant burn...drawn yourself in the toilet.  I give this game 93 out of 100",
            "review_score": "1"
        },
        {
            "review_text": "Gave me a seizure and I died.",
            "review_score": "1"
        },
        {
            "review_text": "Ok lets start off with this gem. You are Sergeant Rex Power Colt and basically you dont give any f***s. Rex Colt is on a mission to stop a mad man from arming nuclear warheads and blowing up the already destoryed world! This game is similar in fasion to Far Cry 3, but it fully embraces its silly 80's Sci-fi action. This is what makes the game fully enjoyable as an expansion. The main story line is tons of cheesy one liners and typical 80's plot twists, but still tells a convincing of enough story for you to want to play. If you were to pick up this game for the story alone, you are looking at the wrong game.   The character cast is limited to about 3-4 main characters and numerous minor characters. I will not spoil each group of MC's, but each feels completely at home in this sci-fi world Ubisoft has created. Some of the characters are your typical one dimensional 80's cheese, but that's what you WANT to expect. This game is all the cliches of the past made just for today.The characters flow into the story quiet well and it makes the game into an amazingly stupid action title. Cutscences in the game are presentated as 'arcade style 32 Bit' interactions and add to the atmosphere of the working sci-fi title.  The levels that you interact with are great. It terms of size relative to Far Cry 3, it is just alittle smaller than the first island you start one. There are not alot pacing breaks.Entering buildings and having a pause to say go into a dungeon are a thing of the past. Most of the world is on the map and never take away from the game itselves. It's completely open world and thats great and bad. It's great to because you are a cyborg bad ♥♥♥ and can do whatever you want. The downside is that it lacks the depth of exploring and uncovering mysterys. They still have hidden files and items, but that alone has something lacking that Far Cry 3 had going for it. The hidden items reveal backstory on characters and thoghts. What it has that Far Cry 3 does not have are tons and tons of hidden easter eggs. I won't ruin them but when you find them you will chuckle at each and every one of them. This expansion is a single player expericence only, unlike Far Cry 3 which has some multiplayer elements.  Gameplay wise it is identical to Far Cry 3 minus a few things. Since you are a bad ♥♥♥ mofo cyborg you can run infinitly and you no longer take any fall damage. This is because you are a cyborg....do i really need to explain the science behind it? Moving on you get about one of each item and upgrade it with the 'money' you get in the game. These futuristic guns are not only badass but become better with upgrades. Just like Far Cry 3, you will find that one or so gun that will be your bread and butter (for me it was the pistol and machine gun). The hunting is not as in depth as it was in Far Cry 3. It exists but usually as a means to upgrade your weapons or complete achievements.  In terms of replayability it is moderate to high depending on what you want to get out of it. Since this goes through UPLAY and not steam the achievements are fun to get but dont count outside of UPLAY. This count be a damper to some people, me on the other hand did not mind and still 100 percent this game. After trying to get all the achievements it is great to just run around and kill stuff or explore the island and find all the items and easter eggs. You could restart the campaign, but most people will not and be satisified with the game.  The achievements are fun and enjoyable for anyone who is a completionist. As i stated before, they count towards UPLAY achievements and not STEAM. Some could be time consuming to level up or upgrade weapons, but if you are an expericenced gamer you can get 95 percent on the first playthrough. My ranking on difficulty for getting all the achievements ranges from easy to average.  The video, audio and control layout is basically all the same as Far Cry 3. The graphics are great just like Far Cry 3, but it is a darker game with lazers and light beams lighting up the screen. This is the majority of the 'light' in the game. It is suppose to be a destroyed wasteland from a nuclear war so dont expect lush bright sun effects. the audio is superb with the soundtrack taking the cake. It is one of the most memoriable soundtracks of any video game in recent history. With typical 80's sci fi movie sound and power anthems it will make your experience in this world that much more enjoyable. The layout for controls is the same but the tutorials are fun and make it easy to get back into a FPS if you have forgotten (i know you havent).  My final thoughts on Far Cry 3 Blood Dragon. This game brings back fun into a game without sacrificing too much core gameplay. it is a fun game from beginning to end without too big of hiccups of run here and do that. It is just long enough and just short enough to never feel like it stays too long in one place. The sad part is when you finally complete the game it will leave you wanting more. Many gamers will find it hard to find fault in this game and enjoy this expansion.  My overall rating for this review will be 4.5 out of 5.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic standalone DLC, one of the best I've ever played. Really funny, especially if you were born or lived in the 80's. So many references akin to Retro City Rampage. Ironically has one of the best love stories I've ever seen in a game. Seriously.  Also lasers. Lots of lasers.",
            "review_score": "1"
        },
        {
            "review_text": "Incredibly short storyline but has massive replayability. An absolute joy to play",
            "review_score": "1"
        },
        {
            "review_text": "Freakin Hilarious. 10/10.",
            "review_score": "1"
        },
        {
            "review_text": "best game ever created",
            "review_score": "1"
        },
        {
            "review_text": "This game took me completely by surprise. I fell in love immediately and could not put it down until I finished. The music, setting, voice acting, everything is just awesome.  I didn't know what to expect, just a techno farcry, but this was way above my expectations. Probably one of my all time favourites now.  If you were a kid in the 80s this is built for you.",
            "review_score": "1"
        },
        {
            "review_text": "*Shoot guy in face*  'This little piggy went to the morgue'  10/10",
            "review_score": "1"
        },
        {
            "review_text": "Favorite Quotes from  Ubisoft Montreal 's  Far Cry 3 - Blood Dragon :   1) Dr.: 'This is going to get bloody and messy fast.'   Rex: 'Those happen to be my two most favorite things.'  2) Hint: 'Taking too much damage? Stop getting shot, okay? I swear, it's like talking to a monkey.'   In terms of content, much of what makes the '80s great and plenty of what makes that time cringeworthy, too. The devs really had fun with this one. It's literally packed with humor and references, everything from the story, characters and dialogue to the one-liners, hints, animations, extras, even the (not really a) tutorial. Not a game that wants to be taken seriously!   From a gameplay perspective, Blood Dragon is fairly straightforward Far Cry material. The weapons are all fun to use and offer options for sneaky combat or total chaos. Area design is pretty recycled and AI is nothing to write home about but the combat is fun regardless. Bases can be captured from the enemy and claimed for friendly factions, creating new fast travel points and opening up missions to rescue scientists, hunt wildlife, and more. Certain achievements will unlock new mods for your weapons in the stores. A few collectibles in case you're really into hunting around for hidden goodies. There's really not much to be said in light of the fact that FPS players, especially fans of the Far Cry series will feel right at home with the controls and mechanics. The art style and graphic effects are pleasing. The visuals and audio suit each other perfectly. I didn't mess around too much with the fancy takedowns or other moves but they are cool to see. Finished the game on hard difficulty without doing much exploring of the place, instead moving quickly through the campaign.   Perfect recommendation for an infusion of '80s goodness and a brief bit of mindless first-person shooter action.",
            "review_score": "1"
        },
        {
            "review_text": "Great game! Basically every good late 80s early 90s action movie, cartoon and action game rolled into one satire. Rex Colt is the man....cyber man",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME GAME EVER!!!!!!!! LOVE THiS GAME!!!!!!!!!!!!!!!! Thank for this game !!!!!!!!!!!! Love Ubisoft !!!!!! More this game's pls !!!!!!!!!!!!!!!!!!!! I Like 80-s and 90-s P.s Very very BiG Thanks guy's",
            "review_score": "1"
        },
        {
            "review_text": "Awesomesauce!  Set in 2007 but with an 80s look and feel, you are Rex Power Colt, a Mark IV Cyber Commando (best guy in the universe), whose mission is to stop his mentor gone rogue, Sloan. The story is silly and fun, full of jokes and references to 80s movies and modern video games such as Alien and Assassin's Creed. The humor in the game is so cheesy it actually is pretty funny.  The game's mechanics are built upon the already great Far Cry 3 mechanics with a few twists of Cyber Powers and Sci-Fi stuff which is pretty cool. To run faster than a car and jump from the top of a mountain only to hear your Cyber legs laughing at the laws of physics :) The game has a huge map (roughly 40% of Far Cry 3's map) filled with outposts to overtake, many collectibles, and Dino Dragons to fight (Dragon + Lizard beasts that shoot lasers) The soundtrack is easily a 10/10.    8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Pew pew pew lasers pew pew!!",
            "review_score": "1"
        },
        {
            "review_text": "Overall, 9/10 game. When you capture all the enemy bases, there's not much to kill except for Blood Dragons.",
            "review_score": "1"
        },
        {
            "review_text": "Pure silliness, every action movie trope jammed into a weird scifi shell using the fun Far Cry 3 engine. Highly recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, I really enjoyed BD, more so than any other far cry game I have played. Naturally, since it is just a standalone DLC, it is fairly short, and only took me 8 hours to beat. My biggest complaint is the difficulty of this game, it's even easier than FC3. I didn't die a single time on the hardest difficulty, and the enemies really didn't pose a threat, at all.",
            "review_score": "1"
        },
        {
            "review_text": "Never before have I been so entertained in so many ways in a game. I would gladly have paid 30$ for this game now that I've finished it and know how much value it has. It's only downfall is that it's short on story missions. I was laughing hysterically and scared ****less all within a matter of minutes in this game. Far Cry 3 was good. Blood Dragon was amazing. If anything, Far Cry 4 should be a continuation of Blood Dragon.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Short, but cheap. You'll only get about 3 hours out of this game (more if you do collectibles) but it's a great 3 hours with an amazing ending.  As far as gameplay, imagine that Far Cry 3 got a lot less buggy, a lot less tedious, the combat got a lot more stable, and was injected with a heaping, healthy dose of FUN. Fall damage was removed, as was the need to breathe while underwater, and you can sprint at about 30 MPH. Everything has been given a neon tint (to emulate an old 1980s sci-fi movie) but it's never really distracting. Overall, the dialogue and combat feel very Duke Nukem-ey.  On the negatives, the game is VERY short (3 hours on my playthrough), but it's an extremely enjoyable experience for those 3 hours. By the end of it, you'll be feeling like a super-powered monster, able to kill almost anything in one or two hits. I found this to be pretty boring, because then the combat just got tedious instead of challenging. Still, I loved this game, and I can't wait for the sequel.",
            "review_score": "1"
        },
        {
            "review_text": "Shut up and take my money!",
            "review_score": "1"
        },
        {
            "review_text": "This is literally the best DLC ever made. It is both parody and homage without being too peurile and one-note, as one might have feared. If you give half a crap about late-80s science fiction, from terminator total recall (ok techically 1990) , then you have to buy this immediately.",
            "review_score": "1"
        },
        {
            "review_text": "It's not long, but I had more fun playing this than the original Far Cry 3, the sound track is pretty hardcore too. Deffinately worth the money.",
            "review_score": "1"
        },
        {
            "review_text": "If you get the 80's movies references (Terminator etc.) you would probably enjoy this game and It's completely over the top and satirical story.",
            "review_score": "1"
        },
        {
            "review_text": "Ridiculous over the top stupidity set through a 1980's film filter. Fun, hilarious, and interesting while maintaining that 1980's action movie camp. I can't really say too much about the game because it kind of speaks for itself.",
            "review_score": "1"
        },
        {
            "review_text": "its a fun game made by ubisoft. Good spinoff.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing DLC for Far Cry 3, THIS IS WHAT OTHER DEVELOPERS NEED TO DO FOR DLC's !!!",
            "review_score": "1"
        },
        {
            "review_text": "Eaten by a Robo-Lazer-Techno-Dragon. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Rated R for ridiculously hilarious and stupid.",
            "review_score": "1"
        },
        {
            "review_text": "Games like this one are DIAMONDS these days.  5/5",
            "review_score": "1"
        },
        {
            "review_text": "Press YES to demonstrate your ability to read.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty short campaign, but the 80's Sci-fi theme is spot on. 7/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game of all time. No question",
            "review_score": "1"
        },
        {
            "review_text": "an amazing game that, while it has problems, makes up for them with it's sense of humor what problems, you ask? -uplay -not enough guns -repetitive sidequests -3 hour capmaign -everything is red. I know that they're trying to evoke 80's sci-fi feelings, but it ends up hurting youe eyes after a while -uplay -UPLAY -MOTHER ♥♥♥♥ING UPLAY   'those are some pretty huge downsides,' you say, 'what are the redeeming factors?' -$15 -guns are entertaining -humor -actually decent story -boobis -fun gameplay -the killstar -your HUD talks to you -set in the futuristic world of 2007 -good weapon progression -$15 -fifteen USD -FIVE-TO-THE-MOTHER♥♥♥♥ING-TEEN SMACKAROOS",
            "review_score": "1"
        },
        {
            "review_text": "This game....THIS GAME.....I can't....I JUST F*CKING CAN'T!........IT'S JUST THEY SHOOT LAZERS OUT OF THERE EYES!......THERE F*CKING EYES!!..........JUST PLAY THE F*CKING GAME DAMMIT!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is the raddest. Jam packed with hilarity, full of ripping action, amazingly conceived and animated; really there are no shortfalls with this game. Every joke hits dead-on, the combat is on-par with the main Far Cry games, and I think it may outdo them in design, character and style. I think it is about as well-conceived as a campaign-based FPS can be. I do not mind that it is shorter, or that it lacks the open-world elements of the parent franchise; for this game it works well. My only complaint is that I generally prefer to play these types of games (i.e. Ubisoft / EA) on a console where the DRM or whatever is not an issue. This game definitely ran smoother on the Xbox 360, for whatever reason. Still, I love it, and am glad it is on Steam (errrr Steam / UPlay...)  ",
            "review_score": "1"
        },
        {
            "review_text": "Very hard to say something about this game, it´s just awesome. Far Cry 3 in retro style. If you like Far Cry 3 buy this.  You are Sergeant Rex Power Colt a Mark IV Cyber Commando, who tries to save the world in his own way. +Nice Story. +Retro style. +Good humor(I had to laugh so many times xD) +Open world. +You will just love it. -There is a time, the story is over and you finished the game :( Rating 12/10",
            "review_score": "1"
        },
        {
            "review_text": "Not a fan of Far Cry series, but wow did they do something very memorable, special, and rare here: Made an entirely new game out of the framework of the old.   The 80's aesthetic/style is completely nailed right down to the neon lights and cineimatic themes of 80's movies. I don't care for the over the top use of language much, but they went all out for the rest of the game so it's hard to get too hung up on any of this titles faults (and there are some such as UPlay's saving system can glitch sometimes, don't close Uplay in game.)   The graphics are fantastic and you have to love all the 80's neon, lasers, digital/analogue noise, and over the top explosions everywhere. 9/10 This game was a blast, please try it if you love media that nails retro themes.",
            "review_score": "1"
        },
        {
            "review_text": " There's almost too many awesome, great lines for one game to have!",
            "review_score": "1"
        },
        {
            "review_text": "Buy this. Please. Nothing besides sex is better",
            "review_score": "1"
        },
        {
            "review_text": "WOW MUCH LAG LOTS STUPID PORCESS MUCH STUPID GAME. Don't buy this game",
            "review_score": "-1"
        },
        {
            "review_text": "I want to like this game. I really honestly do. It looks amazing, the controls are decent, the plot is hillarious.  This being said, the following are points that are too painful to attempt trying to play the game further:  1) ATI Video Cards not supported!!!!!! DON'T BELIEVE THE HYPE!!!!!  Seriously though, at least tell us that you will spend 30 freaking hours researching, modifying, and testing settings to just get past the initial pre-game chopper sequence BEFORE WE BUY THE GAME! This is not a problem for NVidia cards. To all of you about to say 'Well, just buy a cheapo NVidia card...'  NO! NONONONONONONONONO! I have a very good ATI Radeon R7 260X that steamrolls through almost all modern games using the highest settings possible without batting an eyelash. This kind of thing is only seen on games that rely exclusively on PhysX engine or (apparently) a very select few games like Far Cry seriies.  To try to fix this I have been through 5 driver sets, 20 forums (not posts, entire forums!), and have re3started the game more times than I care to remember... I have started Civilization 5 fewer times and I have racked up over 300 hours of playing that game.  What did I get out of all of this? To what end did my endeavors reach?  Nothing. Nada. Zip. Zilch. Bust. Jack Flipping Pancakes. Bupkiss. Shineola.  I will not get my money back, nor all the time I wasted on this game.  For those of you who may still read this and troll in your minds: Windows 7 SP1 Intel i7 860 2.8GHz (quad-core) ATI Radeon R7 260x Gigabyte OCA 12 GB RAM  I'm not running a crap system, this is just a crap programmed game.  2) Ubisoft requires login via U-Play.  Annoying as hell, and by itself not a deal breaker.",
            "review_score": "-1"
        },
        {
            "review_text": "First things first: uPlay is awful, but there are plenty of mods that disable it. I strongly advise using one.   A desperate old-school aesthetic without actual old-school substance. The profuse stupidity and half-considered sci-fi tropes are there, the challenge and deliberate balance are not. The noisy, interlaced, 'shades-of-pink,' VHS aesthetic is simply a distraction from how little is actually going on. The gunfights are all immensely easy, made worse by the fact that the enemies simply throw themselves at the player without ever posing any actual threat or attempting any defensive tactics. The level-up system is completely unnecessary due to the game's abject linearity and lack of variation and simply serves to slowly buff the player out of control. Aside from the upgrade system and the visuals, the game's mechanics are mostly identical to Far Cry 3's, except that Far Cry 3's enemy layouts actually created situations which required some consideration, especially when going for a stealthy approach. Here, the best strategy is almost always to stand is a narrow corridor -- and there are plenty -- and wait for all of a level's enemies to come rushing to their deaths. For a game that prides itself so much on 'old school action,' Blood Dragon is surprisingly braindead, even by modern standards. This is an old-school game for people who have neither experience with old-school games nor the skills necessary for them. I'd like to see one of the people who praised this game -- just one! -- one-credit-clear Metal Slug.",
            "review_score": "-1"
        },
        {
            "review_text": "it wont work the game wont start",
            "review_score": "-1"
        },
        {
            "review_text": "It reduces the aspect ratio during loading scenes etc to make it look like a video, except they just made it a square not proper four-three.",
            "review_score": "-1"
        },
        {
            "review_text": "THIS IS TRUE FARCRYSIS 3.  R E A L   N I N J A  R A M P A G E   A C T I O N",
            "review_score": "1"
        },
        {
            "review_text": "You have a button specifically assigned to flip people off.That's all I need to say.",
            "review_score": "1"
        },
        {
            "review_text": "Blood Dragon is a breath of fresh air when you feel like you've been seeing far too many 'serious' stories. With it's aged cheese and good delivery, the game tends to be an absolute joy to run through (if a bit short.)  The aesthetic is quite different from that of Far Cry 3, and it does better as a result. A pretty significant contrast for neon and video filters for distance which gives a distnictive TRON-like appeal.  The story itself is just hammed up which is perfectly fine with the exception of some significant plot holes that may or may not have been introduced on purpose. With that said, references to old experiences that anyone old enough to have played in (good) arcades back in the 90's would remember.  At $15 for the game, it's a bit of a fence to consider. While I did have a blast, I find myself having done almost everything I'm interested in under five hours on 'hard' difficulty. The five hours I had spent on the game were fun from begining to end, leaving me with a desire to see the next step in the rediculously (in a good way) cliche plot that leaves a wonderful satiracle comment on my memories as a kid watching morning cartoons and playing on arcade cabinets.",
            "review_score": "1"
        },
        {
            "review_text": "Has one-liners 11/10",
            "review_score": "1"
        },
        {
            "review_text": "I just went into a sewer and killed four mutant turtles.",
            "review_score": "1"
        },
        {
            "review_text": "In this game you take control of a Snake Pliskin-type Action Hero settled in a post-apocalyptic Sci-Fi vision from the 1980's. The whole setting feels like an amalgam of Terminator and Robocop and is highly overloaded with colorful lAz0rs and cybernetic mutants. Probably the best game Ubisoft produced in over 10 years.  Great game with nice self-ironic humor, okay graphics, satisfying gunplay and a great soundtrack that sends you on a time travel. Sadly, the game lacks a multiplayer mode and interesting boss battles.  The only thing that sucks mayor dong about Blood Dragon is the fact that this game must be run on the U-play platform. Why? Why even bother selling it on steam when you force me to play on yet another ♥♥♥♥♥♥ gaming distribution platform. I don't need this. I don't need no 5 diffrent services to play my ♥♥♥♥ing games on. Not to speak off that all records and achievements hit the ♥♥♥♥♥♥♥ here. Stop it. Leave it to Gay Ben.  Cheap in price and runs as a standalone without the far cry 3 main game. If you like to pick up a short, fast paced experience packed with fun and action, this is something you can fetch for your cart without a second thought.  Pump 'em full of lad with an incinerated quad barrel shottie in the face.",
            "review_score": "1"
        },
        {
            "review_text": "It's a great game, I love it, truly.  BUT ♥♥♥♥ING UPLAY HAS TO RUIN GOD DAMN EVERYTHING. GFWL IS BETTER THAN UPLAY. ♥♥♥♥ING ORIGIN IS BETTER THAN UPLAY. ♥♥♥♥ YOU UBISOFT. BOYCOTT TIME.",
            "review_score": "1"
        },
        {
            "review_text": "Funny game, terrible puns, wonderful visuals, if you liked far cry 3, you might like this even more.",
            "review_score": "1"
        },
        {
            "review_text": "this is the shortist game i have ever played dont buy it",
            "review_score": "-1"
        },
        {
            "review_text": "Enjoyed the 34 minutes of this game i played before i upgraded my PC, however i was moderately confused as to why the CD key that is linked to my Uplay account no longer works, and why this game is on steam at all when it is a uplay game.",
            "review_score": "-1"
        },
        {
            "review_text": "I was supposed to overtake a dam full of enemies. So I ran through all of them, found a blood dragon, shot it to ♥♥♥♥ it off, and ran back through the dam.  EVERYTHING. ♥♥♥♥ING. DIED.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "No joke, this game will melt your face.",
            "review_score": "1"
        },
        {
            "review_text": "...the game that finally pushed me to make a Uplay account.  sweet looking game with sweet themes, sweet gameplay, super sweet soundtrack, not-so-sweet characters and such a cheeky story your character would blush, except no one would notice because of all the neon. and he's a cyborg.  i really cannot bash on any aspect of this game except for the length, which is between 6-7 hours to 100% the game on Medium difficulty, including story, hunting and 3 types of collectibles.  let's try rating the game: • graphics - SWEET. - themes - SWEET. - gameplay - SWEET. - sountrack - SUPER SWEET. - story - SWEET, also over-the-top. - length - eh, not that SWEET.  all in all, it is definitely worth your attention. i give it 9 thumbs up.",
            "review_score": "1"
        },
        {
            "review_text": "Sorry, but whatever value there is to this game is lost in dealing with 'Uplay'.  Never another Ubisoft game.",
            "review_score": "-1"
        },
        {
            "review_text": "Does not work. I can't get this to work due to Uplay and Steam not getting along. Applied three different fixes found online, and an hour after installing, I still can't play this game I paid for. I shouldn't be expected to jump through hoops just to play a game. This is ridiculous.",
            "review_score": "-1"
        },
        {
            "review_text": "Proberly one of the best DLC's that a company has ever made, and somehow its made by Ubisoft.",
            "review_score": "1"
        },
        {
            "review_text": "Unlike the Stanley Parable, I'd actually buy this for $15. Furthermore, I do not use the following phrase often in my reviews: I love this game.   It has: + an awesome as hell 80's movie atmosphere + a very nice soundtrack that reminds me of the original Terminator + probably a lot of subtle references, some that I didn't catch + over the top action elements and self-parodying humor + cool as ♥♥♥♥ shooty and stealthy gameplay  +/- cheesy as hell story, quotes, and cutscenes (which I loved)  - the longest ♥♥♥♥ing credits ever, ♥♥♥♥ ubisoft - uplay (I don't think it's that bad though)  If you liked a few things from the 80's you should get this.",
            "review_score": "1"
        },
        {
            "review_text": "It's like Skyrim but with neon guns.",
            "review_score": "1"
        },
        {
            "review_text": "Pure awesome! Improvement over Far Cry 3 in every way.",
            "review_score": "1"
        },
        {
            "review_text": "Great mod. Has real character, spunk and a retro 1980s action GI Joe soul. If you're looking for a game to blow away cybernetic legions while flipping them the middle finger with one hand and tearing out their cyber hearts with the other. This is the C4000 dynamite you want to play!",
            "review_score": "1"
        },
        {
            "review_text": "Michael Biehn as the protagonist's voice, one of the best soundtracks ever made and that perfect 80's vibe.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: It's Fun References about every 5 minutes Shiny lights everywhere Testosterone filled protagonist Animals carry money on them?  Cons: Uplay",
            "review_score": "1"
        },
        {
            "review_text": "Blood Dragon is an excellent game full of fun gameplay, hilarous writing, amazing visuals, and perfect music. The game only has one real down side and that is that the ending sequence ends on a low note. The rest of the sequence is spot on however and is the first game to make me feel like I was Rambo in an action movie.",
            "review_score": "1"
        },
        {
            "review_text": "I like it more than Far Cry 3, perhaps it's because of the 80's.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Nice vibe with references to the popular action films of the 80's. Funny as well as fun. My only complaint is that I wanted more once I had it beat. Game took me about 9 hours and I spent a lot of time messing around. A Multiplayer/CoOp would of been awesome...maybe next time.",
            "review_score": "1"
        },
        {
            "review_text": "Best 80's movie I have ever played.",
            "review_score": "1"
        },
        {
            "review_text": "fun but uplay ",
            "review_score": "1"
        },
        {
            "review_text": "This is a real short experience. Open World (not as big as FC3) with 2 hours of story elements. But every second is an enjoyment. This game made me buy Far Cry 3.   It has the length of an 80s movie. And in fact it is an 80s/90s movie. (Open World Content will be like 5-20+ hours of collectibles, secrets and free roaming, while you can reset Enemy Garrisons now to have a neverending FPS Experience.)  This game feels like 'Escape from New York' (Escape from LA).   This game is for people, who love Kung Fury, Terminator, Robocop, Ninja Turtles, Escape from New York, the Metal Gear Solid-Games, every Trash-Cyborg-Movie and Synthesizer-Pop-Music.  The Engine is smooth and optimized. (The Far Cry 3 Franchise uses a strong amount of 'Head-bobbing'. This leads to some People who cannot play and enjoy these games.)  Gameplay and Story are fantastic. Though the only stealthy Weapons here are the Neon-Bow and the Pink Tanto combined with the Laser-Shuriken. Besides that Stealth is fantastic in this game.   Rating: 12/10 minus Uplay and the usual Far Cry 3 Headbobbing = 09/10  A solid Shooter with outstanding Atmosphere and an interesting visual Style - if you get all the 80s/90s references.",
            "review_score": "1"
        },
        {
            "review_text": "If you like FPSs, 80s Action movies, Tron, awesome one-liners, and/or Michael Biehn.  'Send for a medic ... so I can kill him too.'",
            "review_score": "1"
        },
        {
            "review_text": "Threw somebody's heart at another guy so that a dragon would zap him with lazer eyes. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game you can see in your life!   Be a blood dragon hunter     LIFE WELL",
            "review_score": "1"
        },
        {
            "review_text": "Did you like Farcry 3? Did you like Terminator? Do you have around five dollars? Stop ♥♥♥♥ing around and buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Im only not reccomending this because there is a bug where after you are in the helicopter at the start the cut scence after that it will crash and freeze as soon as it ends",
            "review_score": "-1"
        },
        {
            "review_text": "An over the top adventure that gets crazier and crazier. It's short. It's inexpensive. It's ridiculous amounts of fun. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to the 80's. Here's a load of badass guns. Go kill stuff.",
            "review_score": "1"
        },
        {
            "review_text": "Basicly Farcry but wait... is that a DRAGON?!",
            "review_score": "1"
        },
        {
            "review_text": "As much as I hate Uplay, this game is great. The graphics, the music, the funny dialog, the 80's future! If you can get past the Uplay part of the game then you should really give this a chance.",
            "review_score": "1"
        },
        {
            "review_text": "Don't.",
            "review_score": "-1"
        },
        {
            "review_text": "Funny. Worth a play, but nothing to write home about. Just the DEVS kicking back and having a laugh. No real content worth mentioning - definitely hits a low bar in comparison to FarCry3 itself.",
            "review_score": "-1"
        },
        {
            "review_text": "The thing about this game is the sense of humour – retro parody - it’s something you going to love or, like me, find really irritating right from the word go. I was bored to death and hitting the esc key during the intro and ten minutes in to the game I was looking for the uninstall button. Youtube has some videos that detail the first fifteen minutes of play. I would check those out first to make sure that this is the game for you. I am afraid I can’t recommend it at all, but it may be your type of humour. God help you if it is!! Check it out on Youtube and decide for yourself.",
            "review_score": "-1"
        },
        {
            "review_text": "vhs dragon trex's with lasers and ♥♥♥♥ 6/9",
            "review_score": "1"
        },
        {
            "review_text": "Now that the problem with Farcry 3 blood dragon has been fixed I still dont recommened if. For me he ammount of time needed to fix it; compared to the ammount of time it took to finish was just stupid. amount 2-3 months of forum searching for a 3 hour campaign.  Old review WARNING UPLAY DOES NOT WORK. So I have been unable to play this game at all, regardless of what Steam is saying. The splash screen crash has existed since May 2013 (today's date is 18th January 2014). The splash screen crash has effected other titles on the UPLAY 'service' (Assasins Creed III + IV, along with normal Far Cry 3).  The forums do have some solutions to the problems; however these do not work for me. The people who managed to get through to Ubi support are saying that Ubi was unable to help them solve the problem; most people aren't even getting a response from Ubi (myself included).  The guaranted solution amongst the forums is to; buy the game, then torrent the DRM free version of the game, followed by enjoyment. THIS IS NOT HOW IT SHOULD WORK. Torrented versions should not be SUPPERIOR to the retail copy that we PAID for with MONEY.",
            "review_score": "-1"
        },
        {
            "review_text": "getting borring really quick...",
            "review_score": "-1"
        },
        {
            "review_text": "worth it for the soundtrack alone....♥♥♥♥♥in game too",
            "review_score": "1"
        },
        {
            "review_text": "Blood Dragon removed everything that sucks from FarCry 3 and replaced it with AWESOME.",
            "review_score": "1"
        },
        {
            "review_text": "This game was so overhyped and it came bundled with real Far Cry 3 (which is awesome btw) that after several 'You have to play this!' from my friends I decided to give it a shot.   TL;DR - The game isn't really good, but it has nothing to do with Uplay.  Tell ya what, if you don't think you are going to love it after seeing the trailer - you won't. If that trailer was the thing for you - weeeeell, maybe you will kinda like the game. But still it is a watered-down, less-serious, brainless and rushed in version of FC3. It screames 'I want to be awesome!!!' out of everywhere but the gameplay is basically your FC3 wrapped in some old time references. It looks like you should be running and gunning around Serious Sam-style but nope. Find some cover, spot your enemies, still the same. But level design does not really help with that. And the atmosphere. And the music. Everything wants the game to be tougher and cooler than it can actually be.  After 30 minutes I wasn't really feeling like playing it anymore constantly thinking 'give me back my Far Cry'. Today I have tried it once again. And guess what - I've had to start it all over again. Why bother with all those 'checkpoint, game saved'? It worked fine in FC3 last time I checked. And I'm not going through half an hour of that 'tutorial' again. I'm noping out of it. Once again, everything is not that bad, even fine. Except for the gameplay. It doesn't fit at all.  Mind that I don't really write revirews but this game made me do it. I just hope I can help some fellow gamer to save a few bucks. If you are not really sure then don't buy it. Forget it.  P.S. To all those negative pseudo-reviews based solely on the presence of Uplay - stop being such crybabies and learn to PC or buy youself a console, just stop bothering people. Never had any troubles with it, always launches without asking any questions and works silently until you exit the game. Then it takes you just one click to close it.",
            "review_score": "-1"
        },
        {
            "review_text": "BEWARE UPlay DRM. The Uplay DRM has prevented me from even playing the game. I've contacted Ubisoft and tried every solution I could find on Google and nothing has worked. I would stay far away from this game on Steam. If you're really just dying to play, get it on PS3 or 360 instead because from what I've played on consoles the game itself isn't bad.",
            "review_score": "-1"
        },
        {
            "review_text": "NEVER BUY THIS ♥♥♥♥ING GAME ♥♥♥♥ UPLAY AND THEIR ♥♥♥♥♥♥♥T SOFTWARE ♥♥♥♥ EVERYTHING ABOUT THEM AND UBISOFTS ♥♥♥♥♥♥RY",
            "review_score": "-1"
        },
        {
            "review_text": "I would probably like this games expect for ubisoft ♥♥♥♥ing it up as usual and emailing me a supposed 'code' which i never got btw, so thanks ubisoft and uplay for ♥♥♥♥ing up this and many other games that I bought with my money. I hope uplay servers turn into literal ♥♥♥♥ so that i coulld finally just play the ♥♥♥♥ing game for once.",
            "review_score": "-1"
        },
        {
            "review_text": "What a joke I paid money for this crap OMG do I feel robed and worse god damn my ♥♥♥ is hurting on this one.  save ya self some pain torrent it 1st and try b4 you buy, It realy is hard to belive that some one thought this was cool and would make a good game.   I would ask Valve to remove it for me but I feel I may aswell do something good with this purchase and help to warn others about the FAIL that is Blood Dragon.",
            "review_score": "-1"
        },
        {
            "review_text": "Bad port. Controls are off (strange mouse lag), poor optimization. Gameplay is stiff and clunky. The game chokes on its own compulsion to make a joke at every turn. Jokes which, unfortunately, aren't all that fun. I recommend Far Cry 3. Stay away from this one though.",
            "review_score": "-1"
        },
        {
            "review_text": "It simply doesn't work on my Windows 8 64bit machine. Support took 2 weeks and a complete system log of my complete setup and installed software to come up with a huge wall of text with fixes, which didn't work.  All this, after having been forced to register with UPlay feels like a complete rip-off.  The only other game in my 180+ library to not work was Carrier Command, which was by a (I believe) small developer. I think Ubisoft, as one of the biggest publishers should be able to create a game that works.  It may be a great game, but I'll never find out. Can I have my 10€ back now?",
            "review_score": "-1"
        },
        {
            "review_text": "This game is exactly the catharsis I needed after being jaded to the ♥♥♥♥ slog of AAA's. Even going back now at the end of 2014 I laughed and had more fun going through this than even the still fantastic base game. Controls like FarCry 3, plays like the hottest vector-based, neon clad, floppy disc'd magic this quadrant of the galaxy. At least I think so. Only one qualm:   ＲＥＱＵＩＲＥ ＪＡＺＺ ＳＯＬＯ | ミームが好きですか",
            "review_score": "1"
        },
        {
            "review_text": "A great aesthetic and fun writing draped over boring gameplay.",
            "review_score": "-1"
        },
        {
            "review_text": "SCAM! TOTAL SCAM PLEASE DONT BUY THIS IT WILL WAST YOUR MONEY",
            "review_score": "-1"
        },
        {
            "review_text": "0/5",
            "review_score": "-1"
        },
        {
            "review_text": "This game crashes on startup, and nothing I have found online can help me with this. If you do purchase, be prepared to possibly refun it, like I did after spending hours looking for a soluton that does not exist.",
            "review_score": "-1"
        },
        {
            "review_text": "GREAT GAME!!! kills are satisfying, especially with bow, dont take this game to seriously, crazy game, i enjoyed this much more than the whole far cry 3 game!!! do your self a favour and get this game WORTH EVERY PENNY!!!",
            "review_score": "1"
        },
        {
            "review_text": "The game is very good if Uplay doesn't butt♥♥♥♥ you with a cacti. ",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game. Too bad it uses UPlay.",
            "review_score": "-1"
        },
        {
            "review_text": "Fun game, uPlay is a deal-breaker.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥ing too easy. waste of time. fun but not worth the money",
            "review_score": "-1"
        },
        {
            "review_text": "Tries too hard to be funny and falls flat. I grew up watching all the media that Blood Dragon tries to invoke, but it fails.",
            "review_score": "-1"
        },
        {
            "review_text": "The action in this game is amusing, but nothing spectacular. Not bad for a fairly cheap game. However, the game does not actually save your progress when you reach a check point, and you cannot save manually. This is poor game design. Combine that with the obnoxious, useless Uplay application, and this is just another potentially good game ruined by Ubisoft. I will be avoiding their products until they get rid of Uplay.",
            "review_score": "-1"
        },
        {
            "review_text": "If you like far cry 3 you will like this",
            "review_score": "1"
        },
        {
            "review_text": "Great game, even if you're not a fan of the Far-Cry series. It emphasizes fun all the way through, and the one-liners never get old.",
            "review_score": "1"
        },
        {
            "review_text": "Seriously, ♥♥♥♥ YOU UPLAY. i used to have a nice game which i played once because my old computer was very 'average',i got a new computer, uplay consider that a trheat and now thanks to uplay i can´t play it because it blocked my account and deleted the game key. and the best part is that when i try to put the ♥♥♥♥♥♥♥ key, it says is being used by me, so according to them i cant play now because the me on the past played and activated the game, ergo the me of the present needs to buy it again because the me of the past played o.4 hours. seriously, screw you guys.",
            "review_score": "-1"
        },
        {
            "review_text": "Just silly fun. The jokes are hit and miss but the gameplay is what makes it great. You don't need to have played Far Cry 3 for this at all, it's completely standalone.",
            "review_score": "1"
        },
        {
            "review_text": "Could be a fun game, but it requires Ubisofts intrusive launcher to play so I will never know. :(",
            "review_score": "-1"
        },
        {
            "review_text": "it's got dragons, shooting, dragons, 80's pop culture, dragons, and more importantly, it's got dragons. I love it!",
            "review_score": "1"
        },
        {
            "review_text": "Short but worth it. Just like my nevermind.",
            "review_score": "1"
        },
        {
            "review_text": "Dinosaurs that shoot lasers from thier eyes. LASERS. EYES.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "The Terror 4000.  AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!  Excellent.",
            "review_score": "1"
        },
        {
            "review_text": "I dont have a code so i cant play so i find this very annoying and i hope people take my advice or i get a code ",
            "review_score": "-1"
        },
        {
            "review_text": "Best Game Better than Regular Far Cry 3  Cuz of The Middle FInger! :DDDDDDDD",
            "review_score": "1"
        },
        {
            "review_text": "Short, easy, and damn funny.",
            "review_score": "1"
        },
        {
            "review_text": "it has mouse acceleration.  disapointing :(",
            "review_score": "-1"
        },
        {
            "review_text": "Best descriptive sales pitch that tells you everything you need to know about this game in one sentence: 'Why? Because it's cool.'",
            "review_score": "1"
        },
        {
            "review_text": "enjoyed this game more than expected! classic 80's theme with lots of attitude! oh..,. and Trex that shoot laser beams! ♥♥♥♥♥ pure AWESOME! LoL",
            "review_score": "1"
        },
        {
            "review_text": "A fun spin-off with throwbacks to 80s sci-fi, too bad Uplay had to ruin it.",
            "review_score": "-1"
        },
        {
            "review_text": "Hackerman. He's the most powerful hacker of all time.",
            "review_score": "1"
        },
        {
            "review_text": "The enemy is too hard to kill tho... but dat's fun at all ! :D",
            "review_score": "1"
        },
        {
            "review_text": "very dissapointing and boring",
            "review_score": "-1"
        },
        {
            "review_text": "Corny one-liners? Check. Terminator-sountrack-esqe (1982..) soundtrack? Check. Bro-feelings? Check! it's time to @^&amp;# @^&amp;# UP?!? CHECK MOTH*&amp; *(@*&amp;ER!  Funny, fun, good gameplay (think Far Cry 3 with a new theme), great theme. This is a no-brainer for late 30's early 40's gamers. :)",
            "review_score": "1"
        },
        {
            "review_text": "Love love love this game. I love the 80's reference, the mood and action. All the guns are over powered (in a good way) and the one liners are great.   + 80's aesthetics one liners Explosions Solid gameplay - The stealth didn't get the same shot in the arm that the guns did Sometimes the neon makes it hard to see  Be aware you will need Uplay, so you'll have to log in and start it each time. For many this is a deal breaker, for me, I don't really care. It has an offline mode, so you don't need to worry about being online. Also, if you don't have Far Cry 3, the game will still work.",
            "review_score": "1"
        },
        {
            "review_text": "It's like skyrim, with cyber guns.",
            "review_score": "1"
        },
        {
            "review_text": "This game is essentially Far Cry 3 with a lot more humor, much less content and an 80s action movie theme. If you can't afford Far Cry 3 I would highly recommend this, if you already own Far Cry 3 and have done pretty much everything in it this is a must-buy.  There is still the issue of Uplay though and if you refuse to get the game on that premise alone I can't blame you",
            "review_score": "1"
        },
        {
            "review_text": "As far as I have played the game it rocks. However, I am one of the unlucky ones who can't get the save system to work. And as good as the game is, it's useless if you have to start all over again every time you start it.",
            "review_score": "-1"
        },
        {
            "review_text": "Just plain hilarious. The game is unique, but more to be enjoyed in its humor and environment. I loved Far Cry 3, and this was a no brainer to check out. I bought it on sale, I'd recommend this as well, in case you don't end up getting a lot of hours of gameplay out of it.",
            "review_score": "1"
        },
        {
            "review_text": "It has dragons that shoot lasers. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "It has dragons that shoot lasers. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Today I Killed a rare tiger with a bow,I then proceeded to Run over his siblings with a car. After which I saw two Cyborgs, which I sniped and then stole a car from. I then rammed that same car into the car of another group of cyborgs which I had a mini gun duel with. After defeating them I ripped out their hearts and used them as bait to get a dragon into their base. Overall I rate this 10/10, Fallout's got nothing on this.",
            "review_score": "1"
        },
        {
            "review_text": "Lots of fun :-D",
            "review_score": "1"
        },
        {
            "review_text": "Very nice and crazy game",
            "review_score": "1"
        },
        {
            "review_text": "It was fun while it lasted, but the game was WAAAY too short for my taste. Because of that I definitely reccomend waiting to get this on sale. I would've justifiably been PO'ed if I bought this even near full price.   Beat it in 8 hours on normal with all 3 collectables. An thats with sitting at the main menu during dinner and other RL interjections like bathroom breaks, people, texts, etc.",
            "review_score": "1"
        },
        {
            "review_text": "Blood Dragon came like a lighning bolt from a clear sky. Unexpected and definitely surprising in every way. This game caters to those who grew up in 80's, which is my case, it features not only this extremely lovable and annoyed main protagonist, but also a set of quite charming characters, including the evil guy. The gameplay is smooth as butter, the story can be finished in under a couple of hours but I consider myself a completionist and I just had to complete every side quest too. It took me around 7 hours and I had a blast playing through this great game. I dare to say this game is even better than it's tripple A cousin Far Cry 3. Oh and the soundtrack, did I mention this game has a kickass soundtrack. You should check it out. 10/10 for me :)",
            "review_score": "1"
        },
        {
            "review_text": "After downloading the game, I went through two UPLAY loading/downloading screens, and was asked to create an account (which is the 5 min. that Steam considers playing the game). I really had lost the urge to play the game after that. Thank god I only paid $3 for the game at sale. It's like walking into an arcade (or store) and being bothered right at the door by 3 people, the third one asking you to fill out a form. I JUST WANNA PLAY THE ♥♥♥♥♥♥♥ GAME!  I'm sure its a fun game though...  Moving on...",
            "review_score": "-1"
        },
        {
            "review_text": "Michael Biehn!!!  ..rest my case..",
            "review_score": "1"
        },
        {
            "review_text": "Do not buy this product! I've had such a bad experience with this product and Ubisoft, I am personally boycotting them and will never give them another dime of my money. I bought this game once off of Amazon, and it worked fine for a few days, then suddenly it started crashing. A year or so later, I bought it again off Steam, thinking it would work off of Steam, like my other games. But no, I got the same message that Blood Dragon caused an unrecoverable crash. My computer is a mean-machine, and it can run games far superior to Blood Dragon, so it's not my computer. Keep in mind, this is a third party game, so if you download this off Steam, you must then sign-up for Uplay with Ubisoft. Here's a tip...take it or leave it: Uplay does not work. Read the forums and check around if you want, but tons of people are having the same issue with Uplay not working. And, for those who have gotten some Ubisoft games to work, many complain that they have to go through tons of steps to get the game to work, and even then there are reports of frequent crashes. Ubisoft tech support contacted me and gave two suggestions to fix the problem. When neither of these options worked, they became mysteriously silent, simply ignoring me because they could not fix their terrible product. Way to go, Ubisoft...you got $30 of my hard earned money and did not provide a quality product in return. Where I come from, that's called 'theft.' To other players...do what you want and take your own risk, but this gamer will never buy another Ubisoft product again, and if anyone ever asks me, I'll tell them to do the same. Maybe if Ubisoft starts to feel the loss of money from people deciding to not buy sub-standard products, they'll take note, and instead of taking advantage of gamers, they'll think about providing a quality product, and about supporting their Uplay site (that is just as much junk as their games).",
            "review_score": "-1"
        },
        {
            "review_text": "Why do I need to install Uplay to play this game?  I mean, sure, they tell us we need a 'Uplay ACCOUNT'. Not that we would need another software to RUN the game. Not to mention, it is wrriten at the 'system requirements' so YES, they should tell us that it requires Ubisoft's software and MORE CLEARLY. Some people already know the requirements and don't need to read that crap.  We PAID for the GAME ON STEAM, not ON SOME UBISOFT SITE OR SOFTWARE.  This is outrageous and people should REALLY pay morre attention to any crap software other companies want to install on your computer WITHOUT your full consentment.  I wish my ♥♥♥♥♥♥♥ money back and ♥♥♥♥ Ubisoft. Bet I'm not even gonna get a reply for this, and you are all idiots who blindly agree with anything the companies tell you to do. You are not in control of your actions. I mean, who bought the game looking forward to installing ♥♥♥♥ing Uplay?  ♥♥♥♥ you ubisoft. Yet another money-stealing publisher.",
            "review_score": "-1"
        },
        {
            "review_text": "This game SEEMS like it would be a lot of fun...IF it worked properly. Unfortunately, it doesn't. I don't know if it's a problem with the game, or a problem with the lame U-Play account the game forces you to create in order to play it. But, in either case, the game DOESN'T SAVE!!! It's supposed to save at the checkpoints. However, I've started the game several times, played about an hour (or more) into it each time, passing several checkpoints. Yet ever time I start up the game and hit 'continue' to keep playing, the game instead starts me back at the VERY beginning, tutorials and all! Nice. Because of this, the game is utterly worthless! Seriously...just a worthless, steaming pile of dog $hit.",
            "review_score": "-1"
        },
        {
            "review_text": "This is why I pirate games, ♥♥♥♥ Uplay and its DRM ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "You have to install uPlay to play the game. For heaven's sake, why? Nobody needs this -.- I didn't like the game the first time I tried, and because of uPlay I did not feel like trying a second time.",
            "review_score": "-1"
        },
        {
            "review_text": "A pretty cool game. Great 80's-colored graphics and old school style cutscenes. It is also way more challenging than Far Cray 3 was. Everything feels solid so it is a lot of fun for one playthrough on a lower priced game. Pick it up and also pick up a box of rubbers and get your vaccinations before you get anywhere near Josh Holmes' mother's mummified deathsnatch.",
            "review_score": "1"
        },
        {
            "review_text": "This game is full of puns and 80s synth 10/10 would command a dragon again",
            "review_score": "1"
        },
        {
            "review_text": "This is a crazy ♥♥♥♥ing good game!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game suffers from some technical issues which were never fixed. Combined with unskipable cutscenes and checkpoint saves, it can cause you to sit through the smae 10 minute cutscene more than once. I would say it is almost unplayable.",
            "review_score": "-1"
        },
        {
            "review_text": "if you read the last one you know whats up farcry3 gg farcry blooddragon gg dawg its like the old one you on an island and ♥♥♥♥ fightin pirates but this time you a robot homie straight android ♥♥♥♥ man little ♥♥♥♥♥ dont even need to flex homie like bruh even the name coo like blood dragon i ♥♥♥♥ with that realtalk ",
            "review_score": "1"
        },
        {
            "review_text": "this game made me feel again i am in a failing marriage and this is what me and my wife needed to get it back on track 10/10 great work ubisoft",
            "review_score": "1"
        },
        {
            "review_text": "Would play it but it runs worse than far cry 4",
            "review_score": "-1"
        },
        {
            "review_text": "PROS: - All of it!  CONS: _ Uplay!  '♥♥♥♥ Uplay'",
            "review_score": "1"
        },
        {
            "review_text": "Too many cut scenes, I can't stand cut scenes and found no way to skip them. If you fail or die your forced to watch the same cut scene over again after repeating cut scene 5 times i quit.  Oh Yea Uplay is horrible and a Pain to remove from the System, get rid of Uplay.   Had issues with my 360 controller at times don't know why, graphics were ok, and 80's spoof was comical.   Edited   All these positive reviews and a majority of the players spent less then 20 hours in the past year in the game.   If the game is so great why are you all not playing it?  Civ 5 - my hours 900 in 3 years X-com 300 hours in 6 months  See thats the Sign of a good game when players are actually playing the game.",
            "review_score": "-1"
        },
        {
            "review_text": "The Adventures of Jimmy Neutron: Boy Genius is an American computer animated television series created by John A. Davis. It is the first spin-off to the 2001 film Jimmy Neutron: Boy Genius. It originally aired on Nickelodeon for three seasons beginning July 20, 2002, and the final episode aired on November 25, 2006. A second spin-off to the film, Planet Sheen, debuted eight years later.  The pilot, named 'Runaway Rocketboy,' involves Jimmy testing a rocket ship that he has invented, and later uses it when he inadvertently stumbles upon a Yolkian plot to conquer Earth. The pilot was aired in short mini episodes on Nickelodeon before the film's release, and its plot was used for the film Jimmy Neutron: Boy Genius. The pilot was later included as an extra on the 'Confusion Fusion' DVD. It was originally supposed to air as a short on KaBlam!, but the show got cancelled before the episode aired.  The pilot had a few differences from the main series. In it, the clothes were different, Judy's hair was darker, the theme song was longer with a few lines that were cut later, Goddard was voiced by Kim Saxon, in lieu of Frank Welker, Carl Wheezer resembled his father, Sheen Estevez was absent and the title card had a picture in the scene, like all the other Nicktoons at the time. Also, the DNA Productions logo with their original mascot, Helix the purple cat-like creature wearing a lab coat and a bow tie, was shown.  John A. Davis created Jimmy (then named Johnny Quasar) sometime during the 1980s and wrote a script titled Runaway Rocketboy (later the name of the second pilot) which was later abandoned. He later stumbled upon the idea while moving into a new house in the early 1990s. He re-worked it as a short film titled Johnny Quasar and presented it at SIGGRAPH where he met Steve Oedekerk and worked on a television series of the short as well as the movie. Jimmy was still called Johnny Quasar before it was decided to name him Jimmy Neutron.",
            "review_score": "1"
        },
        {
            "review_text": "Ubisofts best game without doubt - or atleast, best fps  oh wait it turns out i like this game because I made it",
            "review_score": "1"
        },
        {
            "review_text": "Duke Nukem Forever, what's that?",
            "review_score": "1"
        },
        {
            "review_text": "I had to let it sink for a week before I sat down to write this review, because I was hoping my recollection of the experience of playing Blood Dragon would change. It did not. I went into Black Dragon with the presumption that it was actually a fairly different experience from the mainline Far Cry games. What sold me was the 80s silliness, but what I expected was a more streamlined, linear, campaign focused traditional shooter that had a 90s feel the way the whole game was made to look. Whether this expectation was a fault on my part or not, I do not know - I suppose I am in some capacity to blame for not bothering to read its reviews, but the game's promo material and trailers sure did support that sentiment. Instead, Blood Dragon is Far Cry 3 reskinned into an 80s action movie parody. What works of it, mainly the humour and campaign 'story', is fairly entertaining. What sucks about it is what sucks about Far Cry in general: A mediocre shooter with a boring open world full of checkpoints to clear, stupid side quests, weapon upgrades, enemy patrols, wildlife to kill and collectables scattered around (that make the protagonist break the fourth wall in style with 'I hope I don't have to collect any ♥♥♥♥ing flags..'). Ultimately, as much as I enjoyed the setting, and even though the game did deliver on many of its promises, it wasn't what I wanted. Basically, stay away if you dislike the Ubisoft open world experience (a-la Far Cry). And in case you want a Far Cry experience, just buy Far Cry 3 - it's overall the better game.",
            "review_score": "-1"
        },
        {
            "review_text": "Saving progress is such a problem that playing the game becomes a chore instead of a pleasure. I don't use multiplayer mode.",
            "review_score": "-1"
        },
        {
            "review_text": "cool as ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "After you get over the idea that it's a joke it's kinda lame. You should play far cry 3 instead and if you have then you've already done everything in this game. The gameplay is basically the same and the dragons act very simular to the dangerous animals in far cry 3.  If you really liked far cry 3 then go for it, otherwise I wouldn't recommend.",
            "review_score": "-1"
        },
        {
            "review_text": " Besides the first FarCry, this is one of the best newer generation FarCry games I've ever played. This is a game that took less thought, less time to make, and still turned out better than Far Cry 3, or 2! The characters are hilarious and you connect with them way more then the previous s****y games. The soundtrack is another great attribute as well as a fantastic story with new gameplay and visuals. I really enjoyed it and would strongly recommend!  9/10",
            "review_score": "1"
        },
        {
            "review_text": "LOL I can tell your a good ol' boy lolol!! *laughs and hi-fives you* edit: wth??????? *stares in disbelief at comment score* Seriously over a hundred people don't like someone bein nice so they go all the way as far as to downvote them... I need to go back to imgur, this site just sucks. Misoginistic neckbearded gameing nerds. edit2: fml why is this happening I'm being genuine an nice! edit3: I HOPE A BIRD ♥♥♥♥♥ ON ALL YOU ♥♥♥♥IN 300 PPLS HEADS!!!!!!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Game rocks 80s violence and then some. Prepare to be blown away",
            "review_score": "1"
        },
        {
            "review_text": "At first I thought it was a joke, but okay.  GOOD: Open world Humors Graphics Soundtracks  BAD: Uplay  Crashes Bad UI - Theme is dark green like a DOS commands but it sucks ♥♥♥ for me. I hate it. Completely unrelated to Farcry series. Far Cry tries futuristic 90s neon ♥♥♥♥ but failed No achievements Hovering the mouse to accept tutorial messages. Bad AI No option to disable post FX effects/ambient lighting. 13 weapons... Not enough. ONE common enemy model. ONE.  3/10",
            "review_score": "-1"
        },
        {
            "review_text": "This game was amazing. It was pure 80s nostalgia (even though i didn't live in the 80s), and all the lasers and neon lights were truly beautifull. The music was also nice. I recommend this game to people who like Far Cry 3, but also people who, like me, hadn't played Far Cry before but want to try out a unique and interesting game with a 80s vision of the future touch.",
            "review_score": "1"
        },
        {
            "review_text": "Whoever came up with the idea for this game is my hero. This is hands down the funniest game I've ever played, and one the of most enjoyable. This game is near perfection. The only bad thing about it is how short it is. Buy this game, you won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "'Like skyrim with lasers.' Machinima",
            "review_score": "1"
        },
        {
            "review_text": "'What was the hardest part about making a game as bomb ♥♥♥ as Blood Dragon? Also you ♥♥♥♥ing rock.'  'I think the hardest part was my ♥♥♥♥♥.'  -Reddit AMA with the creative director of FC3: Blood Dragon, Dean Evans  I built a gaming computer primarily to buy this game, and have bought multiple copies.   10/10 if you're a fan of FPS and the 80s.",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game I have played since childhood! 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Has the same feel to it as its predecessor. Takedowns are still as satisfying as ever. Basically, if you loved Far Cry 3 you'll love this. If you haven't played neither, you need too! Uplay is obviously the annoying part, but once you past that this game produces a great FPS for any player. Voice acting is near perfect and sticks to the 'Badass' feel of the 80s. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "A nice derivation of FarCry3. Story and graphics are so poor in compare to FarCry3 and also game is very short (i finished in 3 days).   If you already played FC3 then this version will be nice to play, especially the dragon hunts. I would suggest you to play FC3 if you havent yet. ",
            "review_score": "1"
        },
        {
            "review_text": "Become a Cyber-commando and shoot bad guys with laser LASER-LASERs. HOLLA IF YOU REMEMBER THE 80S!!!!",
            "review_score": "1"
        },
        {
            "review_text": "So '80s! I enjoyed Far Cry 3, but this was too fun. It mashed together all the bad (good) '80s action cliches rolled into one over-the-top video game. Forget the plot. Just kill stuff for justice!",
            "review_score": "1"
        },
        {
            "review_text": "When you can flick people off, you know it's a good game. Reminds me of far cry 3. Game is supreme. Pretty short, but I did get it for sale, so I'm not complaining. Love the color scheme that it has going on, pretty different from most games I've played. Not a lot of weapons. Missions similar to far cry, with the hunting of animals, killing people with specific weapons, and liberating garrisons/camps. There is a mission where you gotta burn stuff, but unfortunately, no rasta music playing in the background xD buy it  Edit:Beat the game in 10 hours, did not collect everything though. Last mission is great, especially the very end.",
            "review_score": "1"
        },
        {
            "review_text": "if you like 80's disco music, then you'll love the game.",
            "review_score": "1"
        },
        {
            "review_text": "This Game is awesome. If you don't believe me, buy it and play it.",
            "review_score": "1"
        },
        {
            "review_text": "You want over the top 80s? You got over the top 80s with this game. The amount of times this game made me crack up is insane. This game is open world and features a variety of new animations over Far Cry 3. There are also tons of references to Sci-fi movies in this game and crazy overpowered weapons such as the Quad-Barrel Explosive shotgun. You can tell this game is hilarious when one of the loading screen tips says 'C400 is like C4, but with two zeros.' This game is a standalone and does not require Far Cry 3.  Pros: -Does not require Far Cry 3 -Over the top -Funny -Open World -Lots to do in the world -Crazy weapons -Hilariously Cliche but fun storyline -Fun Gameplay -Funny Missions -Side missions are Fun -Over the top weapons Cons: -Uplay -Less side missions -Smaller Open world -No Radio Towers (Only Garrisons) -Not much weapons ",
            "review_score": "1"
        },
        {
            "review_text": "Am I really allowed to have this much fun? It feels criminal.",
            "review_score": "1"
        },
        {
            "review_text": "Not recommending this game would be a crime. Its Far Cry 3 in the 'Future', neon everywhere you look, and even more explosions than the neon. Great humor, graphics, awesome gameplay, and absolutely one of the most over-the-top experiences. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "awesome game totally rad dude",
            "review_score": "1"
        },
        {
            "review_text": "'Blood Dragon' is the kind of game that I call 'hilarious, stupid fun.' Where 'Far Cry 2' seemed to parody itself by accident, 'Blood Dragon' parodies itself and everything else around it to fantastic effect. If you're a fan of everything that made 80's action movies what they were, this game is definitely for you. The crazy lighting, the over-the-top dialogue (heck, the over-the-top EVERYTHING), the enemies that look like they were outfitted by a costume department with no budget, the music cues...it's all brilliant.",
            "review_score": "1"
        },
        {
            "review_text": "'Knife to meet you' - The biggest badass on earth AKA Rex Colt from far Cry 3 Blood Dragon.",
            "review_score": "1"
        },
        {
            "review_text": "Is a game to not take a serious, just laugh with jokes and kill a lot. In the beginning was a little difficult to familiarize with the scenery, but after an one hour was just enjoy the comedy. ;D The only Bad is an UPlay account , but because I had others games (Some I regret having bought) was not a problem to me.",
            "review_score": "1"
        },
        {
            "review_text": "This Game will bring the lol's",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games I have played in a while. And to think this is DLC. To make things better you dont even need a copy f far cry 3 to play it. I recomend anyone into 70's/80's action films or people looking for some serious guns blazing fun to get this gamr.",
            "review_score": "1"
        },
        {
            "review_text": "An absolute blast! This is videogames at their finest. Brilliantly fun gameplay, fast action, excellent humor, and a silly cheeseball story that is ridiculous in the best way possible.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game, interesting graphic, retro story...",
            "review_score": "1"
        },
        {
            "review_text": "This game is both hilarious and fun especially if you love action movies from the late 80's and early 90's. I got more enjoyment out of playing this game than I did out of Far Cry 3 (which I also love) simply because of the humor and the ridiculously over the top characters and action. This game delivers more than enough content and quality to warrant a $15 price tag.",
            "review_score": "1"
        },
        {
            "review_text": "you just have to own this for the lolz",
            "review_score": "1"
        },
        {
            "review_text": "Drenched in 80's satire and refrences, Blood Dragon is short, sweet, and funny as hell. It's Far Cry 3 mixed with Tron, and is well worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of the most amazing games I've ever played, it is the most 80's thing ever created, and there is no such thing as game balance, I have 100% completed the game, and all the achievements, and I still go back just to mess around. Plus you can rip out peoples' blue, glowing hearts and throw them, so that's always good.",
            "review_score": "1"
        },
        {
            "review_text": "You're a cyber commando that makes sex puns while reloading a shotgun by tossing shells straight into the air and perfectly landing them into the chamber  If any part of that sentance displeases you, you have a sad life",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3: Blood Dragon is a kick-♥♥♥ 80's Sci-Fi style shooter set in a post-apocalyptic vision of the year 2007, VHS style. It has a ton of references to Sci-Fi cinema and popculture from the 80's including: Predator, Terminator, TMNT, Robo-Cop and much, much more. But just like the title says; it's still Far Cry 3, you don't have amy new moves or skills to unlock, unfortunately. Though there is some new weaponry including a lever-action shotgun called the 'Galleria 1991'(in reference to the shotgun used by Arnold Schwarzenegger in Terminator 2), the 'A.J.M 9'(which is the iconic pistol Robo-Cop used), a sniper rifle called the 'Kobracon' and an assault rifle called the 'Fazertron'. All of them have unique attatchments including explosive rounds, lazer rounds, fire rounds and several others.  Blood Dragon has clever and very enjoyable humor if your a fan of the 80's Sci-Fi genre, if not you might wanna give this one a pass since its strongest point, the over the top and corny humer, might not be your cup of tea. Otherwise, give it a go! Trust me when I say you get bang for the buck(quite literally) with collectibles, fun Far Cry 3 gameplay and a kick ♥♥♥ ending. Far Cry 3: Blood Dragon recives an 8/10",
            "review_score": "1"
        },
        {
            "review_text": "'He's no longer head of the class.' 'He was open-minded.' 'He's heading to his grave.'  These and dozens of other cheesy action movie one-liners await you in this delightful game. I picked this up during a sale, had never really heard of it and wasn't expecting much, but it was awesome. This is a modern game but made like it was designed in the 80s. It's a great idea and a boatload of fun. Casting Michael Biehn as the lead character Rex Power Colt was a stroke of genius. The soundtrack is epic; a synth mix of the Terminator with a dash of Lethal Weapon that keeps you in the 80s groove.  Some things I didn't like: I had about a half-dozen lock-ups. Having to hold down--rather than just tap--the action key to do things was annoying. You have to use the action key on bodies to pilfer money from them and that heart-ripping animation gets old fast. Being forced to unlock all the weapons seems counter-intuitive for a game of this type...by the time you do so the game's pretty much over. Liberating bases can be a bit repetitive. Combat, for the most part, only comes in bursts and tends to be too short.  Still, if you're a child of the 80s, or just curious about the vibe of that time and want some laughs, this game provides that in neon spades. Radical, dude.",
            "review_score": "1"
        },
        {
            "review_text": "This game taught me that winners don't use drugs.",
            "review_score": "1"
        },
        {
            "review_text": "This Game Is Very Fun And Interesting, I Recommend This Game To All Gamers Who Love To Feel Like A God.",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3 - Blood Dragon   This game was great not to challenging with a lot of good jokes and references. The Game centers around 'Sgt Rex 'Power' Colt' a 'cyber' commando sent on a mission with 'Spider' to stop 'Sloan' a former cyber commando who went rouge. Their are a lot less weapons in Blood Dragon compared to it's predicessor Far Cry 3 with only 8 guns availible with 5 to start. Most of them require unlocking them through the story. You will also have to unlock the attachments for the weapons like extended mags and explosive rounds. The games story I enjoyed thuroughly with a lot of hularious moments such as the cutsceens. The most well known part of the story happends right in the first part of the game and I suggest you search it up, it was one of the best parts of the game. The game is pretty easy for the most part with me only dieing twice throught the entire game, in order to fix this I suggest playing on the second or the hardest difficulty.   Overall this game was great, it had a few glitches in it but they were easy to look past and a lot of times added to the game,    Far Cry 3 - Blood Dragon as Sgt Rex 'Power' Colt said himself, is a '9.5' out of 10",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious and fun.",
            "review_score": "1"
        },
        {
            "review_text": "Little Silly but fun to play.",
            "review_score": "1"
        },
        {
            "review_text": "Rex Power Colt is better than Jesus.",
            "review_score": "1"
        },
        {
            "review_text": "I knew I would enjoy this game after the first 10 minutes when there was a Die Hard, Terminator, and Commando reference.    Do yourself a favor and download this game and just enjoy the hell out of it. I would also recommend downloading the soundtrack to this game because there are so many subtle hints to other action movies from the 80's and 90's.",
            "review_score": "1"
        },
        {
            "review_text": "Love how the soundtrack and gameplay are retro to 80s and 90s Swartzenager movies",
            "review_score": "1"
        },
        {
            "review_text": "Cool game. Short but sweet.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games i have ever played. The 80's refrences are so fapping good",
            "review_score": "1"
        },
        {
            "review_text": "This is such a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "You like Far Cry? You like 80s to early 90s Cartoons? You like cheesey onliners? Its all in this game.",
            "review_score": "1"
        },
        {
            "review_text": "Modeled off of the wonderful cliches of the 80s, this game was fun from begining to end (and onward)! It's jammed full of an endless supply of terrible action-hero oneliners and puns, and general ridiculous dialogue and plot development. This game is just a wonderul look back at the silliness and nostalgia of the overthetopness of the 80s, and it's actually the first game I've felt the commitment enough to actually 100% complete",
            "review_score": "1"
        },
        {
            "review_text": "tottaly kicking ♥♥♥, fun gameplay, fun way to lose your time",
            "review_score": "1"
        },
        {
            "review_text": "OH MY GOD THE NEON! This game is a great first person shooter with tons of 80s and 90s references, and it is great.",
            "review_score": "1"
        },
        {
            "review_text": "Old school! Hell Yeah!",
            "review_score": "1"
        },
        {
            "review_text": "Such a funny, wonderful, fun, and cheesy 80's-movie styled game. The game mechanics are the same as the original Far Cry 3, so previous Far Cry 3 players will have an easy time playing this game. Rex Power Colt is an amazing character that will not be forgotten!",
            "review_score": "1"
        },
        {
            "review_text": "Basically, if you enjoyed Far Cry 3, then you should like this game. If you like the Terminator, Aliens, Robocop... or anything else '80s', then you will love this game. Oh, and by the way, Sergeant Rex Power Colt is pretty much the coolest video game protagonist of all time, so there's that as well.",
            "review_score": "1"
        },
        {
            "review_text": "Fun,challenging in some ways and best of all: kick-♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "Funny twist on Far Cry",
            "review_score": "1"
        },
        {
            "review_text": "Yes, it needs that stupid UPlay ♥♥♥♥♥♥♥t... but the game is straight awesome. The soul of the 80's action movies beats strongly and is complimented by the snazzy electric beats. Also, Michael Biehn.",
            "review_score": "1"
        },
        {
            "review_text": "This game is so ♥♥♥♥ing badass. If you want to feel like a badass, you need to play this game.   I am a better, more awesome person for having played this game. I can't remember what my life was like before I was a neon cyborg murder-man/machine hybrid who shot radioactive dragons in the face with a laser gatling cannon.",
            "review_score": "1"
        },
        {
            "review_text": "I can't remember the last time I sat down an truly enjoyed every minute of a game. The jokes, one liners, over the top vulgar language and the 80's references abound make this game truly great. When all is said and done, and there is PLENTY in both catagories, you get to ride a mother f***ing Battle Dragon and as you walk upon this majestic cyber punked out monster, you walk up a rainbow stair case. That scene and the following gameplay was the greatest thing I have experienced in a very long time. Remember kids, 'Genocide is fun!'  Far Cry 3: Blood Dragon 10/10 + the billion it took to create Rex 'Power' Colt.",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry Dev's were high with this idea!",
            "review_score": "1"
        },
        {
            "review_text": "THE ultimate parody of the 80's uncluding some well-known motion pictures like Terminator, Rambo and perhaps even the B movies from Steven Seagul. It makes a lot of fun and I really appreciated a company who can parody their own products. Cheers to Ubisoft. Nowadays we have too less parody games and Blood Dragon is like a shining diamant in the pool we have. If you liked Far Cry 3 and want to try something a litte bit different, get this 'trash' masterpiece. Just awesome.",
            "review_score": "1"
        },
        {
            "review_text": "this is a pretty gud game and its funny",
            "review_score": "1"
        },
        {
            "review_text": "Blood Dragon is a great bite-sized version of the Far Cry 3 gameplay. If anything, pick this one up when it is cheap for the awesome 80s action hero power fantasy it provides.  Also, Dinosaurs.",
            "review_score": "1"
        },
        {
            "review_text": "I found this game to have great pacing, a very explorable open world; much like the original Far Cry 3, with a good, if somewhat limited range of guns however...NONE OF THAT MATTERS! THIS GAME HAS CYBERSHARKS. C-Y-B-E-R-S-H-A-R-K-S. The only way to sum up this game is to say 'You can mow down CYBERSHARKS with a LASER MINIGUN as a CYBER-COMMANDO.' It's like Doctor Evil dreamed of a perfect game and ubisoft made it. Shame it uses P.O.S UPlay though. More like U-don't-Play. CYBER 10/10 (now with 100 cyber % more cyber), (apart from UPlay; still better than Origin though).",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant shooter. Hilarious sound bites. At the very least, 20 hours of porn-quality entertainment. I'd buy especially if the price is under 5 bucks. I bought all FarCry (except for 4th) for 10 bucks. Beat that black friday!",
            "review_score": "1"
        },
        {
            "review_text": "The definitive game for all those who love Retro Sci-fi and action movies with humour on the side.Enjoyable gameplay, badass visuals and a lot of 'fun' stuff to deal with, from cyber-troopers to robotic fauna and Eye-beam laser shooting dinosaurs.All at the cost of having to deal with Uplay - still worth your time and funds though.",
            "review_score": "1"
        },
        {
            "review_text": "This was a pretty good game. 100% cheese. If you like 80's action movies/tropes this may be the perfect game for you.  5 hours for me to complete and one super awkward sex scene.",
            "review_score": "1"
        },
        {
            "review_text": "The shooting holds over well from Far Cry 3, with ridiculous effects on top such as explosive sniper rounds and shotgun shells that light things on fire. Enemies are always ♥♥♥♥-easy, with the exception of the Blood Dragons, who are only ♥♥♥♥-easy when you're shotgunning their chests. Some out-of-place sarcastic humour at times, but the writing is otherwise pretty funny. Ridiculous story missions that are the high points of the game (an inversion of the ♥♥♥♥ missions of FC3). Absolutely ♥♥♥♥ing amazing soundtrack.  Would recommend picking up if it ever goes for half-price. It's a 5-6 hour-long game that doesn't ask much, except for that you have fun doing your own thing. Give the OST a listen even if you aren't interested in this sort of game, because damn.",
            "review_score": "1"
        },
        {
            "review_text": "Laugh out loud funny an excellent genre, Maybe the main campaign is to short but after all it's an add on really. Could do with a cyborg laser hand to burn the warts off my bellend really",
            "review_score": "1"
        },
        {
            "review_text": "A fun stand alone game made with the Far Cry 3 engine. With it's tongue firmly in its cheek and Michael Biehn (Corporal Hicks of Aliens fame) doing the voice acting for Cyborg Commando Rex Power Colt, experience witty one liners and blow stuff up. Garish neon lighting and a rock tribute accompany this tribute to the 1980's action films, The only downside is Uplay client is a bit naff to say the least. The game is short but long enough to be fun and not outstay its welcome.",
            "review_score": "1"
        },
        {
            "review_text": "possibly the coolest dlc ever. 8bit music style sex   ah the old days  9/10",
            "review_score": "1"
        },
        {
            "review_text": "Verification code does not get accepted. on Uplay.",
            "review_score": "1"
        },
        {
            "review_text": "If you like Far Cry, then Blood Dragon promises you more of the same- only with a slightly more ridiculous premise and a neon super laser 80's motif; the mileage of which will vary depending on how nostalgic you are about that period.  I find the Far Cry handling slighly clunkier than COD or Bioshock but it's all very immersive and there are certain mechanical elements of your character that stand out- literally.  See, as a cyborg, you can do neat stuff like fall a mile onto rocks or stay underwater for hours without suffering harm and instead of a regenerating health bar or breaking open bins to find convenient roast chickens to heal you, mechanical repairs on your own body can be self-applied in the field.   Far Cry Blood Dragon all gets a bit samey after a while, which is kind of mandated by the art design that I loved but you may hate. It's open world, and it's just as well as there aren't very many storyline missions to occupy you and I'd done all the roaming side stuff before I completed the final mission so the game had nothing to offer me afterwards.  On a side note, a lot of the negative reviews here for Blood Dragon seemed to revolve around Uplay. I don't remember signing up for Uplay but then I played this for a bit, and then abandoned it for a year while I played other stuff before coming back and finishing it so I guess I must have sold my balls to Ubisoft in exchange for some meaningless gaming stat management at some point.  That said, Uplay never bothered me at all so either I'm missing something that's enraged so many gamers or they're all just whining like sweaty rubbery weiner dogs rubbing up against each other...",
            "review_score": "1"
        },
        {
            "review_text": "A lot more fun than the original, IMO",
            "review_score": "1"
        },
        {
            "review_text": "Just play it",
            "review_score": "1"
        },
        {
            "review_text": "Dragons that shoots lasers and neon on everything, what's not to love?",
            "review_score": "1"
        },
        {
            "review_text": "holy ♥♥♥♥ this is good  BUT  ♥♥♥♥ YOU UPLAY UBISOFT PIECE OF ♥♥♥♥ MALWARE WHY ARE YOU PUTTING MORE BARRIERS INBETWEEN THE CONSUMER AND THE PRODUCT WHY ARE YOU DOING THAT DO YOU WANT TO MAKE LESS SALES YOU ♥♥♥♥ING ♥♥♥♥♥♥♥ WHY AM I BUYING IT ON STEAM AND LAUNCHING IT FROM UPLAY AND ENTERING 2 PRODUCT KEYS WTF IS THIS ♥♥♥♥ JUST GIVE ME THE ♥♥♥♥♥♥♥ GAME BEFORE I PIRATE IT FROM YOU ♥♥♥♥S OUR OF SPITE  UPLAY ORIGIN  BATTLE.NET  GOG STEAM AND A MILLION OTHER LAUNCHERS ARE ♥♥♥♥ING RESOURCE HOGS  LET ME JUST PLAY YOUR ♥♥♥♥♥♥♥ GAME YOU GREEDY ♥♥♥♥S. JUST LET STEAM DISTRIBUTE YOUR ♥♥♥♥ EA AND UBISOFT. LET THEM. MAKE. MONEY. FOR. YOU.   this game shouldn't exist in current markey conditions and yet it slipped under the radar becomming one the best games I've played in 5-8 years.   $15 is worth it and id pay that easily, i got it for $3.74 which was a ♥♥♥♥ning steal.  EA ♥♥♥♥ you and French EA (Ubisoft) you two are ♥♥♥♥ing tossers",
            "review_score": "1"
        },
        {
            "review_text": "So much camp and cheese you might think you're at a French boy-scout convention. And neon. lots of neon.",
            "review_score": "1"
        },
        {
            "review_text": "This is an alternate version of Far Cry 3 which has quotes like this 'I am no hero, I am just your ordinary Mark 4 Cyber Warrior' and - an actual upgrade system (compared to FC3 where you will upgrade the one weapon you play with for like 1000 bucks and then don't know what to spend money on) - completely ridiculous dialogs (on purpose) - some mindless shooting - it's pretty easy (also on hard) - lazerz and quad barrell shotgun",
            "review_score": "1"
        },
        {
            "review_text": "It's absurd and it's awesome. Totally worth it.",
            "review_score": "1"
        },
        {
            "review_text": "A wonderful parody of video games with suprisingly fun open-worldness.",
            "review_score": "1"
        },
        {
            "review_text": "Neon, lazers, KILLER sound track, cheesey one liners and awesome 80's ridiculousness in general! Good for anyone who is a fan of the 80's culture and those who don't take their shooter games too seriously. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "I would of liked this more If I were 35",
            "review_score": "1"
        },
        {
            "review_text": "If you grew up watching 80's action films then you should at least give this game a try, this game actually made me laugh with it's 80's references and gruff sounding good guy with dumb catchphrases.   Pros: - Great looking scenery, not super polished but still immersive. - 80's film references.  - Stealthing around an enemy camp and taking them out one by one. - Quite a rangey selection of weapons, bow and arrow being my favourite.  Cons: - Very short game, I consider myself a kinda slow player and I completed the main story in 5 hours.   All in all I'm very glad I bought it, though I did get it on a steam sale for a couple of pounds. I would say if you can get it for £5 or under, then go for it.",
            "review_score": "1"
        },
        {
            "review_text": "Uplay, the tutorial and console gameplaying crap (the ♥♥♥♥ing quick time events and and the checkpoint system) really sux!  F.U. UBI !",
            "review_score": "-1"
        },
        {
            "review_text": "retro! If you like gun games, humor, and cyber killing, then this is for you! But you want to google pc mouse fix and the cutscenes are messed up. Luckily they are rare anyways. Probably better on the 360 overall.",
            "review_score": "1"
        },
        {
            "review_text": "Yeah, so I'm recommending this.",
            "review_score": "1"
        },
        {
            "review_text": "Probably Ubisoft's best game. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3 with all the bugs removed and corny humour added.  Neon everything, cybersharks, metal manta rays, dinosaurs that shoot lazers from their mouth/eyes and you can still explore the island on foot, in vehicles or take to the sky in the paraglider. Lots of enemy cyber soldiers to shoot with your ridiculous supply of neon/laser weaponry (including the bow) and a generally ridiculous set of missions.  This game is a spoof of itself and yet manages to be better than the original.",
            "review_score": "1"
        },
        {
            "review_text": "So FC3:BD is basically FC3 in every aspect, but with so much porno, neon lights, oneliners and 80s in it it's gonna melt your eyes and ears from cheeseness. Which is good, of course.  The game itself may be great, but since its basically a FC3, it's no-recommendation. I already wrote a full-length review on FC3 itself (feel free to visit my profile to read it), but here I will keep it short. To cut directly to the chase: The combat is boring as hell and you constantly have the feeling you're absolutely not able to use your character's powers to the fullest potential. Even the weakest enemies can knock you down, but you can't knock them down. Like in FC3 you're not even able to get across little barriers like when walking over a wooden plate. What the hell?  This and many, many other small things sum up to a big pile of ♥♥♥♥ that drives my nuts.  This is sad, because the FC franchise has great potential. But it's all completely wasted because one just can't have fun in this game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "This game is so awesome! this should of been the main game!",
            "review_score": "1"
        },
        {
            "review_text": "I CANT ♥♥♥♥ING PLAY IT BECAUSE UPLAY WILL NOT LOG ME IN...♥♥♥♥ YOU UBI",
            "review_score": "-1"
        },
        {
            "review_text": "Let's get something out of the way first: I have heard this is a GREAT game, but Ubisoft is ♥♥♥♥ing ♥♥♥♥♥♥♥tting the entire thing with their DRM for Uplay.  I bought this game earlier today and I have experience NOTHING but ♥♥♥♥♥♥♥t since I installed it for the first time. At FIRST, I installed it and tried running it, it failed to install Uplay which is stupidly REQUIRED to play the damn game. I go to validate the files just to check and make sure that nothing stupid happened during the download. What did it tell me? 50 FAILED FILES. It then proceeded to re-download the WHOLE ♥♥♥♥ING GAME. I thought my internet just bummed out and I thought 'Oh well, I can wait. It only takes about 10 minutes to re-download.' Once the download had finished, I attempted to run it again. It managed to install Uplay this time, but it failed to run. again. I validated again and it told me it failed 50 files YET AGAIN.  I repeated the download/verify/download process about 15 times and as of YET (3 hours after initial installation) I have not been able to play the game.  About half an hour later of screwing around with Uplay after writing the first half of my review, I found that changing Uplay's settings to run in offline mode upon startup allowed the game to actually LAUNCH. This was a HUGE waste of my time and the ONLY benefit I got from this game before actually playing it was that I managed to get it on sale for $3.74 CAD.   However, I HAVE played this game previously on one of my friend's accounts who luckily DIDN'T have to go through this ♥♥♥♥♥♥♥t and the game is pretty damn decent.  My Final review for this game: 4.5/10 With a 4.5/5 for the actual GAME and 0/5 for the absolute ♥♥♥♥♥♥♥t DRM you have to go through.  Ubisoft, stop with the ♥♥♥♥ing Uplay and let us play through STEAM. WHY ELSE WOULD WE BUY IT ON STEAM?  If you do not agree with my review of this game, that's cool. Remember that I gave the GAME 4.5/5, but I DO NOT recommend buying this. Play it on a friend's computer so you don't have to go through this ♥♥♥♥.",
            "review_score": "-1"
        },
        {
            "review_text": "This game had me laughing from the very beginning to the end. I enjoyed trying to figure out what movies it was referring to. My second play through I realized C.H.U.D was one of them. Also any game that says 'Just the tip' has to be funny. Bow is overpowered but my choice and yes..just the tip!   Pilfering is clucnky and I hated how it moved your character too much. There needs to be auto loot which there is for sneak attacks so one more reason to sneak.  8 out of 10 overall...too short.  10 out of 10 for the price $3.75 on sale!",
            "review_score": "1"
        },
        {
            "review_text": "Explosions and neon and dragons, oh my.   This is one of the best games I have played so far. Though the story is a bit short (about 8 hours on easy), the gameplay is fun and engaging. You may not have a large variety of weapons, but there are lots of attachments for them that you get by completing side missions (explosive bullets for a sniper rifle, for example). All the attachments give you a good reason to play on after completing the story. The game gives you a choice of playing it stealthy or going in guns blazing for many of the missions. My only real pet peeve is the brightness. Because the island is always dark, the neon lights don't quite light up the levels enough, and when they do, they are so bright it is hard to see anything  Overall, 8/10 would strongly recommend, especially on sale",
            "review_score": "1"
        },
        {
            "review_text": "5/5 - Most fun I've had playing a game in a long time.",
            "review_score": "1"
        },
        {
            "review_text": "I Can't Stop pukeing Neon Colors and overused refrences PLEASE CALL A MEDIC    Game is Gud BTW 19/80  ",
            "review_score": "1"
        },
        {
            "review_text": "This game sure came out of nowhere and what a game it is! Great humor, references, gameplay and soundtrack. The story just feels like you're playing through an 80's action movie and I've caught myself humming (loudly) along to the theme during gameplay and just 'feeling it'. I can't believe this game came from Ubisoft. They're still ♥♥♥♥♥♥♥♥♥s though.  In ten years time, it would not surprise me to see this game named as a classic.  Beware of uplay, brothers",
            "review_score": "1"
        },
        {
            "review_text": "yeah o everyone is saying uplay dosent work but in april 2015 for me at least its fine   7/10 worth 3 bucks",
            "review_score": "1"
        },
        {
            "review_text": ". . .",
            "review_score": "1"
        },
        {
            "review_text": "unplayable, the neon like colors gave me headaches.",
            "review_score": "-1"
        },
        {
            "review_text": "Fans of tongue-in-cheek retro-80s-anything will love this send off of the decade's action heroes and films. FarCry 3's excellent gameplay with none of its pretentiousness.",
            "review_score": "1"
        },
        {
            "review_text": "This is some really dank weed.  60 69s out of 69 69s.",
            "review_score": "1"
        },
        {
            "review_text": "Just plain awesome fun, explosions, humor and laser spitting dragons. 10\\10",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3 is a must have and this Standalone is also a must have!!!! It's Far Cry 3 with a bad ♥♥♥ terminator-esk feel to it!",
            "review_score": "1"
        },
        {
            "review_text": "Don't buy this unless you want or already have uplays client. that 1.3 hours on my record? yeah. that was just me trying to get uplay to launch the game. Which i have not been able to do. No more uplay games for me if this is the future of uplay games.   It finally started working the fifth time i launched their client, but wasted all my time just trying to get it to play.",
            "review_score": "-1"
        },
        {
            "review_text": "its ok i didnt finish it though",
            "review_score": "1"
        },
        {
            "review_text": "SO. MUCH. 80S.  Neon lights, lazers, and bad one-liners. Get it done.",
            "review_score": "1"
        },
        {
            "review_text": "IT'S FREAKING 80's!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Having to open steam to play Blood Dragon which then opens Uplay which then opens Blood Dragon is the most pain in the ♥♥♥♥ way to play a game. Why am I going through another launcher just to launch from the original one?  Haven't played it since I first got it working like a year ago, now that I upgraded my comp I wanted to see how it looks when its running at ultra. Guess that's not happening.  Uplay/10",
            "review_score": "-1"
        },
        {
            "review_text": "Uplay wont launch the damn game.v After launching it, it doesn't appear in my processes, or show any signs of it trying to launch. I just really want to play this game.",
            "review_score": "-1"
        },
        {
            "review_text": "Do you like cheesy 80s sci-fi movies?  This game is histerical and over the top, but ultimately ground in some really great FPS mechanics.  Having played Blood Dragon and not Far Cry 3, I feel like this stand-alone expansion was the perfect size.",
            "review_score": "1"
        },
        {
            "review_text": "This one of the best games ever made. Makes lots of fun 10/10",
            "review_score": "1"
        },
        {
            "review_text": "uplay is the only bad thing imo.",
            "review_score": "1"
        },
        {
            "review_text": "It's like someone took every 80's cliche and shoved them into one game. While the game tasked me with being stealthy, I found myself asking 'What Would Arnold Do?' and blasting everyone in the face. The game made sure to grant my wish to it's fullest.",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3 on drugs , a must play game",
            "review_score": "1"
        },
        {
            "review_text": "The best Far Cry in my own opinion at least, Look mate it's robots the 80's and dinousors you can't go wrong 10/10 :)",
            "review_score": "1"
        },
        {
            "review_text": "have you ever had one of those days where you find yourself waking up in the toxic acids of Vietnam 2 in the far future of the year 2007 where the apocalypse just had an apocalypse? where a rogue cyborg army is reshaping the world into cyber hell? and where a epic battle between good VS evil is fought as it has never been fought before? and only you, a part man, part machine, all cyber commando is the last hope to save the world?   if so, first please let me buy some weed off you cuz you're smoking some really good ♥♥♥ shit xD secondly go out and buy this game, you won't regret it ;)   Overall Score: (7/10) Good :)",
            "review_score": "1"
        },
        {
            "review_text": "This game made sure that I enjoyed playing the whole 9 hours gameplay. The story in Blood Dragon was pretty short but you can it's long if you compare it to COD singleplayers and to other story driven singleplayer games and dlc's of those games.  Pros: Epic jokes and references, MUSIC (download OST), graphics were great for a low price DLC/'stand alone-game' (no need to own Far Cry 3) and the diversity in enemies, guns and even in wildlife. Plus the the tutorial was educating... And do I have to say it...BLOOD F*CKING DRAGONS!!  Cons: Lack of story or side missions. It literally took me NINE hours to complete this game 99,9% with every single achievement. Even before completing the game I felt like I had faced every single type of enemy and it started to feel repeative.   I'm not going to say anything that might spoil your gameplay experience and my final word is that you go and buy this mind-blowing game, because I bet you'll come to love this game for those nine awesome mind-bending hours.",
            "review_score": "1"
        },
        {
            "review_text": "Game Had Many crashes at the wrong times. and toward the end of the game they just keep happening. We need to make laws to protect bad games from getting released when they know its faulty.",
            "review_score": "-1"
        },
        {
            "review_text": "Get ready to take on a massive amount of Terminator references as you jump into the action as Rex Colt.  This is a 80's style, sci-fi, action, adventure, in the Far Cry series, so if you have played either FC3 or 4, you will feel comfortable with this game right away. If you like cheesy humor and 80's action flicks, this is definitely a game for you!  One thing that I realized right away, this game is definitely more fast-paced compared to the other installments in the series. You run faster, you jump higher, and you can also fall without taking any damage. It's really nice to not have to worry about jumping from high places so go crazy. Speaking of fast-paced, there is a skill tree in the game, which differs from part 3 and 4. The skill tree upgrades with every level you reach, so there is no need to stop the game to try to figure out where to spend your skill points, you just continue on being cool and taking on the mayhem. To me this convenience makes the game flow a bit better and I personally enjoy this aspect of the game.  Some words of wisdom: Buy it, play it, and enjoy it.",
            "review_score": "1"
        },
        {
            "review_text": "Requires you to use uplay. Saves don't work.",
            "review_score": "-1"
        },
        {
            "review_text": "Better then all of the Far Cry's, why? Innovative, fun, 80's action, sound and music, kickass weapons and giant mutated komodo dragons that shoot LAZOOOORS from they're eyes.",
            "review_score": "1"
        },
        {
            "review_text": "Would be 10/10 if not for Uplay.",
            "review_score": "1"
        },
        {
            "review_text": "Yup it's good.",
            "review_score": "1"
        },
        {
            "review_text": "Guys it has dragons ",
            "review_score": "1"
        },
        {
            "review_text": "who turned off the sun?",
            "review_score": "1"
        },
        {
            "review_text": "9.5/10 - Most of my issues with vanilla Far Cry 3 are absent or fixed in Blood Dragon. One of the most unique and fun gaming experiences I've had in a long while. Every gamer should play this.  +Around 5 hours to complete (All main missions, all outposts, and probably half of the weapon upgrade side missions.) Which is a decent length for a standalone dlc at this pricepoint.  +Music is awesome +The game is hilarious.  +Neon soaked 80s future is amazing and I need more of it. +No tower climbing to reveal the map.  -Mandatory side missions. -Uplay  Note: The FOV zooming issues I had with the original FC3 are absent in this game since the player character does no first person interactions and there are no first person cutscenes in the game.",
            "review_score": "1"
        },
        {
            "review_text": "Cool expandalone with great humor, just watchout color scheme of the world needs some time to get usedto",
            "review_score": "1"
        },
        {
            "review_text": "A standalone game that keeps all the mechanics of Far Cry 3 but puts it into an 80's throwback-style theme. I like it. Alot.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and original game ruined by the game crashing every ten minutes.",
            "review_score": "-1"
        },
        {
            "review_text": "Utter mince. Well, actually, that might be being a bit unfair - it *might* be the greatest game ever. But as IT WON'T PHUQING LOAD, I guess I'll never know.  I've tried all the solutions - renaming files, editing .CFG files by hand - phuq that noise. Why should I have to do work because the devs are a bunch of lazy qunts?  Buy some chocolate instead. Or a nice book. But don't reward this lazy p15h.",
            "review_score": "-1"
        },
        {
            "review_text": "OMG!!!!!!!  INTENSSE!!!  FIREPOWER!!!  AND THE HUMOR!!!!  WE WANT MORE!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Pop this sucker in, put on Lazerhawk's 'Redline' and you have yourself a great night.  Finish it off with Kung Fury, while you're at it.",
            "review_score": "1"
        },
        {
            "review_text": "If you want cheesey 80's action with plenty of equally cheesey one-liners, then you're in luck.",
            "review_score": "1"
        },
        {
            "review_text": "Rex:What`s the needle  for,Doc?  Dr. Darling:To make you as powerful as Sloan,without the side effects. Rex:Sorry,but I promised a very special lady. Dr. Darling:Your wife? Rex:No,Lady Liberty.She taught me...Winners don`t do drugs.",
            "review_score": "1"
        },
        {
            "review_text": "Comic, lots of action and the best pop culture references of the 80s made into a game.",
            "review_score": "1"
        },
        {
            "review_text": "This game brought out strange feelings of nostalgia I didn't even know I had, whilst delivering a stream of non-stop lulz. Best game ever, even if it requires uplay.",
            "review_score": "1"
        },
        {
            "review_text": "An awesome neon cyber game set in 2008. Buy instantly!",
            "review_score": "1"
        },
        {
            "review_text": "Love that retro theme!",
            "review_score": "1"
        },
        {
            "review_text": "you'll buy it on sale you'll play it a few times it'll be fun you will forget about it then you'll write a review like me  worth",
            "review_score": "1"
        },
        {
            "review_text": "Great game, still doesen´t work on windows 10",
            "review_score": "-1"
        },
        {
            "review_text": "my game is all sorts of messed up. it makes it impossible to play. It wont load after i die and the game wont save even if im not in a mission.",
            "review_score": "-1"
        },
        {
            "review_text": "Type in new retro wave on YouTube Run in an enemies base and only use a shotgun Probably die  Really fun and unique game 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Had me laughing the entire 4 hrs it took me to beat the main storyline. Picked this one up during the Summer Sale 2013. Worth every penny of the $5 i paid for it. If your looking for a quick distraction from your other games, this is your game.  ",
            "review_score": "1"
        },
        {
            "review_text": "A shorter, but more focused Far Cry experience. 80's theme with more references tha you can handle. Intentionally overpowered weapons and skills, and the most cheesy story, dialogue and one-liners you'll ever find! Propably one of the best FPS's of all time.  An allround masterpiece!  Friends through eternity,  Loyalty, honesty,  We'll stay together,  Through thick or thin.  Friends forever,  We'll be together,  We're on top,  Cause we play to win.    ",
            "review_score": "1"
        },
        {
            "review_text": "Just for the end-segment, it is totally worth it on a sale!",
            "review_score": "1"
        },
        {
            "review_text": "10/10 100/100 BEST GAME BEST GAME      just short:/ , but cool",
            "review_score": "1"
        },
        {
            "review_text": "ANY MAN THAT DOES NOT LIKE THIS GAME IS NO MAN.........NO MAN AT ALL",
            "review_score": "1"
        },
        {
            "review_text": "The game T-800's play while traveling back in time in to kill/find/protect Sawrah Connuhr.",
            "review_score": "1"
        },
        {
            "review_text": "Say no to realism and say yes to over the top ridiculousness. 10/10 would inject myself with dragon blood again.",
            "review_score": "1"
        },
        {
            "review_text": "Best 3 hour Viagra add I've ever played",
            "review_score": "1"
        },
        {
            "review_text": "A tech-noir fps action game based upon the Far Cry 3 engine. Multiple 80's themes including references from the movies, The Terminator, Lethal Weapon, Aliens, Predator, Blade Runner, Robo Cop and a little bit of Rambo for good measure. The music is very dark and reminiscent of that era's action movies. If you we're a child of the 80's and early 90's you'll find this game brings back a lot of good memories. Although if you weren't you'll be unlikely to pick up on some of the in-game references and jokes. An Awesome game with good action, decent story but little in the way of actual character development. In conclusion this is a highly creative, neon soaked, action packed adrenaline pumping game with tons of laughs and firefights. Your character is voiced by Michael Biehn, enough said.",
            "review_score": "1"
        },
        {
            "review_text": "the game is Great once you get past the uPlay set-up and signing in, they really need to do away with it, and it would help alot! great game though!",
            "review_score": "1"
        },
        {
            "review_text": "Lasers, Blood dragons, Epic 80's synth pop. One of the best games in Steam store. Grab it NOW!    Highly recommended for all FPS players  Gameplay 9/10  Music 10/10  Price 8/10  Originality 9/10  Total score: 9/10",
            "review_score": "1"
        },
        {
            "review_text": "Pros: The game has a radical setting and perfectly fitting visuals and music to summon the spirits of lovable 80s sci-fi schlock. Cons: The publisher has no idea when it has a glorious IP and lets it die out, instead of taking a small risk.  10/rad, would become mark IV in the distant future again.   ps: note to Ubisoft: shame on you for Uplay. Shame on you for not making Blood Dragon 2.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever, the only negative thing i can think off are the side missions, they could be more interesting.  I wish Ubisoft would make a sequel to it like a proper standalone game.",
            "review_score": "1"
        },
        {
            "review_text": "Like Far Cry 3 but think it was too serious? Need your fix of Ａｅｓｔｈｅｔｉｃ? Want to be an ordinary American hero? This is the game for you.",
            "review_score": "1"
        },
        {
            "review_text": "Ultimate silliness. Buy it.",
            "review_score": "1"
        },
        {
            "review_text": "Nice and is still nice today!",
            "review_score": "1"
        },
        {
            "review_text": "This game is bloody fun. It is a spin off of farcry 3, but you do not have to know anything about farcry 3 to play this. The graphics are stunning, the gameplay stressful at times but amazingly bloody awesome times at others. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely brilliant. Best thing I've played since Human Revolution. Hilarious and endlessly fun. Unfortunate lack of customisation, but that would be my only critisicm. It would be a shame if Blood Dragon didn't begin it's own franchise. I for one would buy anything, so long as Rex was in it again.",
            "review_score": "1"
        },
        {
            "review_text": "Actually better than regular Far Cry 3. Doesn't take itself too seriously, and awesome 80's styled sci-fi goodness,.",
            "review_score": "1"
        },
        {
            "review_text": "Robocop and Terminator Combined = Far Cry Blood Dragon",
            "review_score": "1"
        },
        {
            "review_text": " Don't pay more than 10€ for this.   If I could put a horizonal thumb rather than up or down, I would.   The game is somewhat middling. The intentionally awful comedy starts off well, but goes from good-bad to just lazy-bad extremely quickly. Massively dumbed down mechanics and combat from Farcry3 encourage run-and-gun gameplay. I actually used the minigun a fair bit which I would not even consider for anything other than boss fights in any other game, prefering stealth, or precision kills. In a way this was good as it gave a beyond-norm experience but the whole thing just didn't  catch.   There's really no point in freeing the citadels or updrading weapons. Each weapon can have all the unlocks stacked into it, but they're mediocre. The minor bonuses only really serve to make the second last mission easier. Even un-modified they serve their purpose.  That said, the second last mission is irritating and you may want to upgrade before proceeding when you're told you are locked in.   Unlike farcry3 where silencer unlocks were godly, here; the only silencer unlock is pointless. It does next to nothing, and is far from silent. Silent kills are knife and bow only.      TLDR [/b][/i]  If you haven't much time, I  don't  recommend this. The entertainment is fleeting, and gameplay 'meh' and the length short.  ",
            "review_score": "1"
        },
        {
            "review_text": "Great 80's Cheese Tastic FPS!",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to the 80's. In 2007. With tech from 2040... Ubisoft I love your logic. But seriously though, this game is full of funny references, all well designed in a way that anyone can pick up and play without a hassle. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "This is the best DLC I have ever played! I loved Far Cry 3, and to have the same engine running a 1980's theme sci-fi movie was bad-♥♥♥. The ending is the best. You are riding a blood dragon with cannons mounted on them blowing up everything in site while the music from Rocky plays. Just freaking amazing!",
            "review_score": "1"
        },
        {
            "review_text": "THE FUTURE IS NOW AND ITS MOTHER ♥♥♥♥ING KICK ♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "holy mother of god this game craps diamonds and bleeds awesome sauce",
            "review_score": "1"
        },
        {
            "review_text": "Best DLC of 2013 for me, hands down. Nothing can compare to a game like this for someone like me. Growing up I saw a lot of movies from the '80's, especially actions movies. Robocop, Terminator 2, Aliens, Judge Dredd, they all make some level of a cameo in this game. Whether it is a weapon name, a line from a random scientist or even an achievement title. In fact, the way readies the next shell in his shotgun is the same way Arnie did it in Terminator 2. The crazy world design- especially the colour palette, make this world fun to explore. Hunting is still prevalent with all of the animals being cyber versions of themselves, but they aren't much different. The weapons are over the top and ridiculous. The voice acting is covered in cheese and the dialogue is what you'd expect from those kinds of movies. It's a grand ol' time.   In this neon cyber world you play as Rex Power Colt, a Mark IV robot with a bad-♥♥♥ Terminator 2 style eye and more lame puns and jokes than you can have teeth in your mouth. After Vietnam 2 Rex Power Colt saw the end of his life but was then reincarnated in mechanical form- as a cyborg designed to be cool and do awesome stuff. He is your stereotypical '80's action movie hero right down to his looks and the way he speaks.   The gameplay is pretty much the same as Far Cry 3, but you're not as weak as Jason Brody. You don't lose half of your health when you fall from 3 feet, in fact, I never found a height in that game that caused me harm. The weapons can start off as your standard-fair variants but soon evolve into weapons of pure joy. Why have an old shotgun when you can give the thing four barrels and make it fire incendiary rounds that explode and burn everything? The leveling system has been overhauled as well. Instead of acquiring EXP like you would in Far Cry 3 you instead get a total amount of EXP that you need to just get to level 30, which is the max. Stealth plays the same so much can't be said about that. The blood dragons offer a nice twist on the game as they are nearly blind and use their hearing to locate prey. They can be distracted with cyber hearts torn from the chests of murdered enemies which you throw like a ball for a dog. Instead of bringing it back, they eat it offering you some time to leave or hit them with a cheap shot. They are large and fire lasers out of their mouths. The only weak point they have is on their chest; however, they are quadruped creatures so you have to make them stand on their hind legs to hit the scar on their chest. They can be either a pain in the ♥♥♥ or a massive help if you need it. Depends on how you want to play.  The story isn't really much. Take every old '80's movie stereotype you've ever seen and mash them together. You now have t he story for Far Cry 3 Blood Dragon. It's good to get you from one place to another so you can shoot more stuff but don't take it as anything more than a tongue-in-cheek play on itself.   The world is a bright and vibrant sensory overload of colours that will make you want to vomit rainbows. A neon blue bow, glowing red eyes on cyber sharks, big blue beating hearts you tear out of enemies... to put simply: lots of colours everywhere. Everything just looks cyber and futuristic. It really does fit its own design very well. Rex looks and plays like a cyborg that was once a man who saw combat. It's a great change of pace to see a world flourished like this instead of the standard brown and grey dirt filled areas filled with generic Chinese or Russians soldiers that you find in far too many games.   Too keep this review from running on like my one for Far Cry 3 I will end it shortly.   The game is great and worth playing. Steam occasionally puts it in a bundle sale with Call of Juarez Gunslinger, another fantastic game that is worthy of playing, or will go on large sales alone so there is little excuse to not have this. Do yourself a favour and play it. It's over-the-top and ridiculous in the ways it counts.",
            "review_score": "1"
        },
        {
            "review_text": "Remember when you watched Commando for the first time? John Matrix had just gotten to the enemy outpost and was right about to raise hell and rescue his daughter. He suits up, prepares a small arsenal, then goes out to wage war. You remember quite vividly the bits where he shoots the knife at that guy's throat, where he blows up half the island with a single claymore mine, where he kills a squad of baddies with a pitchfork and a rotary saw blade, where he mows down a small army with a machinegun that seems like it never runs out of ammo. Soon it all comes down to the final confrontation between Matrix and that ♥♥♥♥♥♥♥ with the stupid moustache and the chainmail vest. One knife fight and witty quip later, and the bad guy is dead, his daughter is saved, and order and freedom are restored to the world while Power Station blares in the background. All the while, you're thinking 'What if I could be John Matrix? What if I could save the world, kill the bad guy, get the girl, and look like a badass while doing it? Wouldn't that be awesome?'  If this is you, then Far Cry 3: Blood Dragon was made for you.  For everyone else? Eh, it's still pretty good. Even if Blood Dragon's 80's Action Movie VHS feel doesn't resonate with you, the game is still plenty enjoyable. In a single sentence, it can best be described as Far Cry 3 with superpowers. Your guns are ludicrously powerful, you can jump a full twenty feet into the air without so much as breaking stride, you can sprint faster than most cars, and you have enough health to keep standing after a robot throws a dragon into your chest at mach 6. The basics of the gameplay are still the same. You clear out outposts, hunt animals, do side missions, and complete story missions. If you've played Far Cry 3, then you've played Blood Dragon, but you haven't really experienced it, and that's the real difference here.  The retro-vibe is captured damn near perfectly. Blood Dragon is essentially Action Movie: The Video Game. Michael Biehn of Aliens and Terminator fame nails down Rex Power Colt brilliantly, and the soundtrack by Powerglove is one of the best I've heard in a videogame since Hotline: Miami. At its low price, it's certainly a title worth picking up. If you liked Far Cry 3, you will either like or love this game.",
            "review_score": "1"
        },
        {
            "review_text": "if you were born in the 80's or the 90's then THIS.IS.THE.BEST.♥♥♥♥ING.GAME.OF.♥♥♥♥ING.2013.",
            "review_score": "1"
        },
        {
            "review_text": "Good and bad, fun 80's concept. I got tired of it after a few hours, but that's just me. It's still a good game.",
            "review_score": "1"
        },
        {
            "review_text": "Adrenaline, nonsense, retro-gaming on steroids. If you haven't played it yet, you're a bad person.",
            "review_score": "1"
        },
        {
            "review_text": "I haven't really gotten that far into the story. But this game is based on a man, whos half a robot (Terminator rip off). He has alot of weapons (sniper, shotgun, bow and arrows etc). We have 3 types of gamers in this world. We have the gamer that wants everything in the game perfect. Graphics, story, multiplayers and that kind of stuff. The people that calls a game lame, just because it is blocky or pixelated. And we have the annoying gamers. The people that suck at every videogame aka noob. The people that complain about them getting killed all the time, the people that report you for hacking, even tho you haven't even come close to hacking. And then we have the best types of gamers. The gamers that enjoys a game, even tho it has bad graphics and stuff like that. The people that makes a game fun, by exploring the games limit. Thats the people this game is aimed for. People who play for fun. And if you feel like you are one of those people, buy this game : )",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing AWESOME game!!! I have to so it is probably GOTY for me, personally as I am a huge fan of everything 80's and this nailed it. MUST PLAY!!!",
            "review_score": "1"
        },
        {
            "review_text": "Very funny, but very short storyline.",
            "review_score": "1"
        },
        {
            "review_text": "One does not just so simply describe this game",
            "review_score": "1"
        },
        {
            "review_text": "This game is great! Just look at how many hours I've put into it..",
            "review_score": "1"
        },
        {
            "review_text": "2007 was never as good as it is in this game. worth ever moment of my life.",
            "review_score": "1"
        },
        {
            "review_text": "This short game is amazing, buy now with no regrets.",
            "review_score": "1"
        },
        {
            "review_text": "This was a fun game. A heck of alot shorter than FC3. Considerably easier. Gettting all the packages. Missions. Liberations. Etc. Even on Hard. But in FC3 I spent alot more time in stealth stalking people. This was a blood bath/brawl. The whole time the game was not taking itself seriously at all. It was fantastic. The dialogue made me laugh out loud a times. Playing it made me want to go throw in some 80's cult films. Good game.",
            "review_score": "1"
        },
        {
            "review_text": "if you hate the 80's ♥♥♥♥ you i was born in the 80's, if you love the 80's play this game.",
            "review_score": "1"
        },
        {
            "review_text": "Imagine a glorious neon world where the films The Running Man, Terminator, Commando and Tron were mangled together and you're pretty close to how 'Far Cry 3 - Blood Dragon' feels. It's relatively short, but certainly a laugh. You could probably power through the main story in around 6 hours, but with completion of the majority of the side missions (which are useful for upping your firepower), it took me around 10 hours. So about right for the asking price.   Pros: Lasers, Explosions, Cyborgs, 80's Action Cliché Nostalgia Humour. Dragony-dinosaur lizard monsters of death.   Cons: In addition to steam requires UPLay (although UPlay isn't actually that bad, it IS irriating to have to login to more than one account).  Looting corpses and side missions can feel a little repetitive.",
            "review_score": "1"
        },
        {
            "review_text": "It's kind of like Far Cry 3, except shorter, and you're a cyber-commander-♥♥♥♥-you-up robot-man that can run insanely fast, fall from any height, and generally whoop insane amounts of ♥♥♥. The humor was a bit of a miss for me, but it had it's moments. Definitely worth a playthrough, especially if you enjoyed Far Cry 3.",
            "review_score": "1"
        },
        {
            "review_text": "80s Rock! Took me 3 hours to plough trough the campaign without doing any side-missions. Wish it lasted longer :D",
            "review_score": "1"
        },
        {
            "review_text": "10/10 solely for the ability to give your enemies the finger. Bonus points for all the cheesy 80's references. :)",
            "review_score": "1"
        },
        {
            "review_text": "I was born in 1978 and I approve of this game. The 8-bit theatre with Michael Biehn by itself makes it worth the purchase.",
            "review_score": "1"
        },
        {
            "review_text": "It's like going back to the 80's, lots of clichés, bad puns, GI-Joe esque adventures. If you're ready to put in a 15 hours of non-serious fun this game s a treat.",
            "review_score": "1"
        },
        {
            "review_text": "Love the tutorial!",
            "review_score": "1"
        },
        {
            "review_text": "Overflowing with 80's awesome.",
            "review_score": "1"
        },
        {
            "review_text": "If you like 80's action sci-fi flicks and fps-games. You'll love this. Amazing soundtrack, simple gameplay, bad oneliners and the 'cutscenes' are presented in a retro way. If you don't like this, you're soulless.",
            "review_score": "1"
        },
        {
            "review_text": "If you grew up watching 80's and/or 90's actions movies this is your 'childhood' in a video game. Michael mother ♥♥♥♥ing Biehn is Rex Power Colt beatin ♥♥♥ and taking names. On top of a kick ♥♥♥ game the soundtrack is amazing, great original scores and some classic that will bring a wave of nostalgia over any fan. So if you like being a badass and dragons with lasers pick this up.",
            "review_score": "1"
        },
        {
            "review_text": "Did you think the island of FarCry 3 was too main stream and boring? Do you long for a special vacation where you can do something different than others? Well then you've come to the right place. Welcome to the year 2007; a year when everything is f****d up and all hell breaks lose.  This game is just not weird. Infact, it isn't even stupid. It is MAD! Thus: AWESOME! I've played just a few hours and already I'm falling in love with this universe. You've got over the top macho characters, just like the 80's should be, you've got badass weapons, and you simply cannot die;... well you can, but then you have to do something really stupid like run into a squad of armed men or standing infront of a dinosaur while dropping a pipe bomb into your own pants and let the ♥♥♥♥♥♥♥♥ 5 year old child of your neighbour play with the detonator.  Oh, did I mention the dinosaurs? I freaking hate and love these things. These 'Blood Dragons' are the kings and queens in this universe with little to nothing being able to kill them. And they shoot lasers from their eyes. Holy, mother of God! This game actually have, according to the data-references in-game, naturally evolved T-rex-like dinosaurs that shoot lasers from their eyes!!!!! How awesome isn't that?! One starts wondering how mother nature figured out to create lasers biologically... (I wonder if she got a steam-achievment for that...). Anyhow: AWESOME!  The guy you are playing as, Rex Power Colt (awesome name!!!!), is a real cyber-commando of generation Mark IV and he kicks asssssssss (figurally aswell as literally)! He's like to love child of Master Chief and Conan the Barbarian and having only 80's action movies as his language teacher. Oh yeah!  Oh, by the way: This game is awesome, and definetly worth your 15 bucks! Don't hesitate! Go out and buy it. If not, only for the reasons so you can annoy your neighbours with 80's-style game-music and very, very bad one-liners! And if I didn't already say it: AWESOME!",
            "review_score": "1"
        },
        {
            "review_text": "I have never had a more amazing time in a game before. Every single moment was completely hilarious, from the cheesy patriotic jokes to the over the top explosions this game is everything that was my 90's childhood",
            "review_score": "1"
        },
        {
            "review_text": "Simply the BEST DLC of all time! ",
            "review_score": "1"
        },
        {
            "review_text": "Fun gameplay, cool graphics. Some of the side missions and fights seem like they can be a little repetative. The save function could be better (I hate you Auto-save). Also, this game forces you to use Ubisoft's 'Uplay' which really sucks.",
            "review_score": "1"
        },
        {
            "review_text": "I hate Uplay as much as anyone else, but this game is every bit as good as the trailer makes it out to be, the soundtrack is perfect, and the writing and voice acting are spot on.  This is THE retrofuturistic shooter all others want to be.  but damn was I upset when I saw the Uplay DRM",
            "review_score": "1"
        },
        {
            "review_text": "this game is amazing its hilarious, action packed and so b grade it may as well be a triple a title. one liners and dinosaurs with lasers. swag ",
            "review_score": "1"
        },
        {
            "review_text": "I rarely write reviews about games, but FC3: Blood Dragon has got to be in my top 5 for life. THis game is hilarious it may be a bit short, put there is plenty of side content to keep you busy for hours. If you are some one that is leaning on the edge of buying this game or not buying this game. You should definetly get it, it is worth every penny. I am not saying it is perfect, but you will more than get your moneys worth. Pros: Soundtrack is Amazing. Neon Theme is done well and not overwhelming. Story is Great. Script is Great. Weapons are good. Wide array of enemies. Quests Galore.  Cons:-Aiming may be a bit hard at some times. -A Major problem for me at some points during the game was getting through doorways and walking up stairs, I know this may seem weird but at some times I just couldnt get through as if there was an invisible wall blocking me-(If you encounter this problem either jump up the stairs. For doorways-crouch down and look down at the floor while walking(W key) forward.) THis may just be something wrong with my copy or a bug when I was downloading it, but when I did encounter it it really killed the mood and pace I was moving at.   ",
            "review_score": "1"
        },
        {
            "review_text": "The game itself is very fun, but ubisoft went cheap on the saving system , there's a useless save button in the menu that explains that the games saves at checkpoints ( alright then , I'll play up to the next checkpoint , finishing an objective) alas the game starts from beginning everytime . wtf .",
            "review_score": "1"
        },
        {
            "review_text": "You have to wonder why a game, that was made tongue-in-cheek and in a very short time, is more fun to play than 90 % of shooters in the market. But that is the case with FC3: Blood Dragon. Not only is Blood Dragon giving laughs here and there, but it's so smooth to play that it puts Call Of Modern Battleshit X corridor shooters to shame. This game is extra effective for those familiar with 80s pop culture.  The downsides: Well, there is that annoying Uplay, that really shouldn't coexist with steam games. Plus this game is a bit short, but that is to be expected.  This game is a must-buy for everyone enjoying FPS games even a little.",
            "review_score": "1"
        },
        {
            "review_text": "run of the mill FPS this is not! hilarious voice acting and a wacky 80s style plotline make this a winning combination.seriously get!",
            "review_score": "1"
        },
        {
            "review_text": "I am shocked that a game that came out in the '80s looked so good. 15/17 hats.",
            "review_score": "1"
        },
        {
            "review_text": "This game has dragons that shoot lasers out of their eyes!! Do I need to say anything else?",
            "review_score": "1"
        },
        {
            "review_text": "Reminds of those awesome 80s movies! THE NOSTALGIA IS REAL!",
            "review_score": "1"
        },
        {
            "review_text": "This game is homage to all the '80s action movies with lots of profanity! Please buy this if you can, I love this! This will make you laugh out loud literally. Same great Far Cry 3 engine, so if you have Far Cry 3 and played it, you will feel right at home with the controls, environments, weapons, enemies and wildlife except the blood dragon. The bright colors do take awhile to get used to.",
            "review_score": "1"
        },
        {
            "review_text": "If you dont get this game, i hope someone robs you and uses that money to buy this game.",
            "review_score": "1"
        },
        {
            "review_text": "Yes, just get it......like saints row IV, it is just a mock to most games. Brilliant!",
            "review_score": "1"
        },
        {
            "review_text": "One of the best games ever made. Perfect except for there being no rpg and having to constantly pull out enemies hearts :P",
            "review_score": "1"
        },
        {
            "review_text": "Rex Power Colt and I have a staying alive pact.",
            "review_score": "1"
        },
        {
            "review_text": "Short but sweet.",
            "review_score": "1"
        },
        {
            "review_text": "ONce a month the blood dragon visits and its asum fun :)",
            "review_score": "1"
        },
        {
            "review_text": "DUUUUUUUDE! if your an 80s kid like me, seriously.. what are you waiting to game this badass ♥♥♥♥♥♥♥♥♥♥♥♥?? If you're into Sci Fi, Robocop, Commando, Terminator, Predator, Dragons, Lasers, TMNT, one liners, freaking Michael Biehn, hot scientist chick who wants to be blind with cyberlove, and all that crazy over the top action? You got them all with this game!  Its a shame tho that this rad adventure isn't multiplayer, they should have bring Bill Paxton along with Biehn, can you imagine that ♥♥♥♥ing crazy badassery? Maybe on Blood Dragon 2 who knows!",
            "review_score": "1"
        },
        {
            "review_text": "When i first heard about fac cry 3 blood dragon, i thought it would be another generic duke nukem style parody game with better graphics and outdated style of humour. After finishing the game i can honestly say i love the fact i was proven dead wrong in all accounts. Far Cry 3 Blood is one hell of a game and damn it i enjoyed the crap out of it. Not many games can achieve that lvl of retro game nostalgia and blood dragon did great on that part.   From the moment u start this game if u lived and played in the 80s/90s u feel the magic all around u. Awesome dialogues/gruesome scenes/manliness/great firepower/evil military dictators/hot scientists/dinosaurs/undead everything u ever loved and played when u were little are there. The guys in ubisoft using the source code of farcry 3 managed to recreate a world and an enviroment where u can be the ultimate badass and not for a moment feel bad about it. Add the voice of Michael Connell Biehn (u know the guy who played aliens/terminator/the abyss) and u know u are the ultimate weapon ready to take on anyone u see!  There are tons of stuff u can do in this game like in every facr cry franchise. Hunt/explore/kill everything u see, but the best part by far is to grab your bow and start playing like rambo! Honestly i never had such a great time using only one weapon in any fps game. Whether its stealth or charging manslaughter that freaking awesome bow did work wonders for me. I even managed to kill a blood dragon with it, so thats gotta stand for something. Main story mission is nice and feels like a retro movie but its really really short. I did everything this game has to offer in 7 hours so u can see that is timewise its not that big. Other than that this is a great game to enjoy especially if u are a lover of good ol fashion fps styles!  Far cry 3 Blood Dragon is an excellent game to have for all those who love great action. I recommend it to u all. Even if u dont like Far cry 3 this is one game u should not miss playing.",
            "review_score": "1"
        },
        {
            "review_text": "This game is all an 80's kid wants! Epic Explosions, cool guns, even Little Richard! Rating: 8/10 GO GET IT NOW!",
            "review_score": "1"
        },
        {
            "review_text": "Dragons with godamn lasers. Why the hell would you not buy it?  The same basic mechanics of FarCry 3, which was a great game. With the cheesy 80s twist and the awesome scifi theme, it makes for a great time.",
            "review_score": "1"
        },
        {
            "review_text": "Extremely fun! Hilarious and sweet visuals! $14.99 is a steal for this title!",
            "review_score": "1"
        },
        {
            "review_text": "Hilarious and Fun game!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "Its Far Cry 3, with less Blood and more Dragons, and the dragons create %300 blood. I played Far Cry 3 (on the PS3) and I absolutely loved it and its vast amount of (un)official dlc's. During my conquest of data I encountered this 15 dollar game that seemed absolutely magnificent. It feels like  Ubi  took Tron, Galaga, and The Elder Scrolls: Arena and Daggerfall and mashed those up, then added Far Cry 3 to the chaos, then gave their main character the ego of Tony Stark on Steroids with surgically implanted robot limbs instead of an aluminum suit. It took me a while to get used to this game because I had to switch from PS3 to PC for the same game mechs, but it was so worth it. From the way you build, Blood dragon is %70 shorter as a story than Far Cry 3, you learn a lot of the skills at the start of the game, and any other skills are obtained by leveling up. If you've never played Far Cry 3, start with Blood Dragon. It teaches you how to play (quickly), it gives you things to look forward to as you build in the main title, and did I mention the uses of blood dragons? Outposts in this game can be %1168 easier to conquer if you stab some robots and press a green button, because the dragons'll kill everything else. Then you beat this game and go to the main title, there are no dragons, and its purely based on your ability to be stealthy.  I may have strayed from the point a bit, but seriously,    buy this game   .",
            "review_score": "1"
        },
        {
            "review_text": "this game is awesome well worth every penny, reminds me of most of the games i played on my old amstrad 464. ",
            "review_score": "1"
        },
        {
            "review_text": "It's cyb♥♥♥♥♥♥ic!",
            "review_score": "1"
        },
        {
            "review_text": "This is the best game that was ever made, or ever will be made.",
            "review_score": "1"
        },
        {
            "review_text": "Welcome to one liners: the game, wait no, eighties: the game, wait no, EXPLOSIONS: the game. Yeah, that last one is about right. Blood Dragon is not Far Cry 3, it takes place on an island has guns and even features Far Cry 3 in the title, but this is a lie. Blood Dragon is an amazing, weird little thing that just happened to happen, and thank goddness it did. The gameplay is great, running around as a cyber comander (or whatever the right phrase was) and blowing up everyone and everything with ease was great fun. Now Far Cry 3 had a stealth and fear element, a small group of pirates could kill you pretty easy early on. In Blood Dragon this is not the case: nothing can kill you unless you let it. And this isnt a difficulty problem (though the game is a tad bit on the easy side) this is the Rambo factor, you can run and gun through the entire game because you are a cyber god. The music and sounds in the game are so eighties it actually started to hurt at one point, but in a good way, like pulling off a hangnail, it just felt right. The story of the game was stupid, it was so astoundingly stupid (but not as stupid as Far Cry 3's story, just sayin'). BUT I LOVED IT. The game was made to be dumb and it hits this mark on every level. The npc dialouge, the cheesy one liners and the premise of the game itself were so awful that I couldnt help but be charmed. Also, I think my favorite feature may have been the ability to flip people the bird: pressing f while not close enough to anything to knife causes the character to stick up his middle finger, mashing f makes him fire them off from both hands.   All in all 7/10. The game was charming and funny but to easy and much much to short. If you love cheesy eighties sci-fi or just running around with robocops pistol and capping everything in the head then you'll love this game. If you want a serious, story driven game with some real challenge you probably won't enjoy this (as much as the rest of us).  Also, get Far Cry 3, it's bloody fantastic",
            "review_score": "1"
        },
        {
            "review_text": "This game is short but hilarious. If you are unsure about whether or not to get Far Cry 3, get this to see if you like it because the game mechanics are pretty much the same",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3 - Blood Dragon has the amazing mechanics from Far Cry 3 and a lot more humor added in. Buy this game for the comedy alone!",
            "review_score": "1"
        },
        {
            "review_text": "I don't like original Far Cry 3, but Blood Dragon is PURE WIN. Lots of jokes and references, lasers and one-liners.",
            "review_score": "1"
        },
        {
            "review_text": "If you don't understand why you should be playing this game... it's not for you   REX POWER ♥♥♥♥ING COLT",
            "review_score": "1"
        },
        {
            "review_text": "I enjoyed this more than Far Cry 3",
            "review_score": "1"
        },
        {
            "review_text": "Great piece of Standalone Content, brings the excellent gameplay of Farcry 3 into a totally tongue-in-cheek and badass 80's vision of the future, just with more neon.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty swank, i love the look of this.",
            "review_score": "1"
        },
        {
            "review_text": "5 / 5  If you enjoyed Farcry 3, 80s styled action movies, and 8-bit cutscenes you'll enjoy this game. One liners and satires litter the game and when I finished the game I only wanted there to be more content.",
            "review_score": "1"
        },
        {
            "review_text": "Laced with a wicked sense of self-aware humour, this game is ace!",
            "review_score": "1"
        },
        {
            "review_text": "I actually have alot to say about this game, but I won't. I will say that it kicks major ♥♥♥ and you should play it.",
            "review_score": "1"
        },
        {
            "review_text": "Genre: FPS, Action, Adventure, Parody My Opinion: A+ Length: ~6hrs Replay: low  Its very short, but given that its a stand-alone expansion that has nothing to do with the original FC3, its completely understandable. The game is full to the brim with terrible puns and epic cheesyness. Its a hell of a blast to play, and I would heartily recommend it if you want to feel like a badass cyber-commando from the crazy minds of the 80s.",
            "review_score": "1"
        },
        {
            "review_text": "A little gem. One of most original game i have seen. If you love the 80's sci-fi movies buy it now!  Pros: - Soundtrack - Graphics - Story - Blood Dragon's  Cons: - Too short",
            "review_score": "1"
        },
        {
            "review_text": "Do you love cheesy 1980s action movies? Do you like bad one-liners. Did you like the original Duke Nukem 3D or Shadow Warrior? If the answer to any of these is 'no' then get out.  If it's yes, then buy this game immediately. This is what Duke Nukem Forever should have been. Heck, it's the perfect execution of an excellent concept.",
            "review_score": "1"
        },
        {
            "review_text": "Probably the best ending to any game, ever, in the history of man.",
            "review_score": "1"
        },
        {
            "review_text": "Silly, insane, explosive action, as only Far Cry can deliver. Great Laugh, just too short. Fun while it lasts though!",
            "review_score": "1"
        },
        {
            "review_text": "This game takes well-constructed, enjoyable game mechanics and covers it in a thick, juicy layer of 80's nostalgia done better than I ever imagined it could be done. From the VSH-quality graphics to the atmosphere lifted right out of a direct-to-video rated-R action flick, it's like mainlining a drug made from my fondest childhood memories.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great, I love the ending. And the whole concept about the 2007 supposed to be the future, Really cool. I think you should get it, 10 out of 10 :D",
            "review_score": "1"
        },
        {
            "review_text": "It's like being a terminator. 9/10 short story is the only downside",
            "review_score": "1"
        },
        {
            "review_text": " Far Cry 3: Blood Dragon  knows its target audience: they were the ones who woke up early on Saturday mornings to get their dose of cartoons and messed with the tracking on their VCRs to play back taped TV shows. They’re the ones who grew up with low-budget action flicks set to campy power rock. They wouldn’t think twice about an action hero using shurikens against badly dressed foot soldiers while fending off cyber-dinosaurs (because why the ♥♥♥♥ not).  Blood Dragon  is an unabashed homage to the action films of our childhood, and even though it’s a short-lived experience, Ubisoft gets it right.   Far Cry 3 Review @ pseudomacro  [pseudomacro.wordpress.com] ",
            "review_score": "1"
        },
        {
            "review_text": "This is a wildly entertaining twist off of the original Far Cry 3. And what a great twist it was! Playing as Rex Power Colt, this gives you an idea of how the kids of the 70s and 80s envisioned the future, and man it was fun to be a part of that! The game was setup very similarly to the original, of course the island was completely remade, and the guns and weaponry were all futuristic. This games missions as well as side missions were all extremely fun to complete, and I would replay this game again and again. The game was a bit short, maybe only 20 hours of gameplay if you wanted to complete the whole game top to bottom, but for a 15 dollar game, you can't go wrong. What an excellent game this was. 96/100",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely beautiful.",
            "review_score": "1"
        },
        {
            "review_text": "This ♥♥♥♥ is f ing crazy awesome!",
            "review_score": "1"
        },
        {
            "review_text": "This is so cool!!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is a Joke. Yep, a really, really good joke. The Ubisoft folk sure know when to take a joke's seriously, and they have the evidence to back it up. Far Cry 3 - Blood Dragon is an epitome of the parodic genre. A parody indeed. Set with the unforgetable post appocalyptic 80's version of the future, the game slaps movie refferences on the face. Far Cry 3 - Blood Dragon takes the player in for one hell of a ride, putting you inside the boots of an ♥♥♥-kicking, cyborg-killing and ruthless war machine; Sergeant Rex Powercolt. Although part of the experience may feel like an overused capture-the-fort mechanic on a massive reskin of the original Far Cry 3, the idea of being an invincible Cyber-commando is more than good. Who cares about repetition and lack of variety when there is plenty to be had with the Blood Dragon enemies and the amazing armory upgrades that make up for the previous. Sure to be said that the overpowered neonlights theme and the sounds of Powerglove's score/soundtrack provide a superb setting for this explosive, radioactively unstable, laser-shot-filled adventure.",
            "review_score": "1"
        },
        {
            "review_text": "A game that will make you laugh and allow you to mindlessly kill everything (isn't that videogames were originally supposed to be like?) More than worth it if you get it on sale.  Take 1 part Duke Nukem, 1 part Robo Cop, 1 part Terminator, a dash of 80's synth and you have this game.",
            "review_score": "1"
        },
        {
            "review_text": "a great game. I would recommend it to anyone. There are references to the 80s very nice. diyalog beautiful and fun. carefully selected music. Although DLC, with side missions, has sufficient play time. Add to your library while it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "If you love the 80's, you'll love this game. Hits on every 80's stereotype imaginable. Absolutely hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "♥♥♥♥ing brilliant!  If i were to choose two words to describe Far Cry 3 Blood Dragon those would be it. If you have seen a lot of cheesy 80-90s movies this is the game for you.  Gameplay wise it plays exactly like Far Cry 3 except for the fact you are a cyborg commando named Rex Power Colt meaning you got some insane boost such as running speed and laser weapens. Now i know this sounds too silly but it's freaking awesome. The weapon variety isn't the biggest but the guns you have can be upgraded into some serious stuff, like a LMG shooting laser rounds or a sniper rifle shooting what i can only assume is small grenades. (yes i'm serious)  Now story wise the game is absolutely hilarious, your mission as a cyborg commando is to destroy missiles destined to turn the world into mindless savages and destroy all kind of civilization, and the evil character behind this is no other than Colonel Sloan one of your older Cyborg friends. But will you be able to stop Sloan and his army of cyborgs and blood dragons?  (I don't want to give anymore away since it is a awesome story.)      Presentation: 11.0 (it was the best intro to a game ever) Graphics: 9.5 Sound: 8.5 Game-play: 10.0 Lasting Appeal: 9.5 Overall Rating: 9.6  Far Cry 3 Blood Dragon is a well crafted FPS experience created for maybe a tad older players since it makes fun of the cheesy action movies. Though if you are a fan of those kind of movies you will love this.",
            "review_score": "1"
        },
        {
            "review_text": "Blood Dragon is one of two games where I've bothered to earn 100% completion.  I think less of you as a person if you don't like this game.",
            "review_score": "1"
        },
        {
            "review_text": "A compressed dose of the 80-90s Americana is becoming a popular theme of 21st century escapism, but Far Cry 3 - Blood Dragon has the advantage of, usually, knowing when to take a bow. The ride will not last long, but it will be enjoyable, to say the least.",
            "review_score": "1"
        },
        {
            "review_text": "I don't know who thought this up, but I love that man. 80's references are abundant in this spin-off of far cry 3, and the craziness doesn't stop there. I'd say it's worth your time.",
            "review_score": "1"
        },
        {
            "review_text": "I'm no reviewer... Film critics, Ign, Metascores... Those are reviewers... This is just a job. And a fun one.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty f*cking awesome. 80s cheese to the max. Michael Biehn voices the main actor. One liners, laser dragons, neon bows, cyber soldiers, 8-bit cutscenes, 80s action techno. Get this ♥♥♥♥.",
            "review_score": "1"
        },
        {
            "review_text": "If you have any interest in the 80s, video games, you owe it to yourself to buy this game.  It's unironically better than Far Cry 3.",
            "review_score": "1"
        },
        {
            "review_text": "An absolutely AMAZING experience. The writing, soundtrack, atmosphere, one liners, characters, cutscenes, design, everything is quite honestly completely perfect.   A somewhat short game (7-10 hours to complete everything, with the main story being maybe 4 hours) but an absolute blast the entire time, unlike many other shooters that run the same length (and at 4x the price).   The guns (and multiple stackable upgrades) are fun and varied, the commentary during the sidemissions ('at least I'm not collecting ♥♥♥♥ing flags')--and the upgradse you unlock for doing them--make them all worth doing and enjoyable.  You'll laugh, you'll cry, you'll kill....with Power, baby.",
            "review_score": "1"
        },
        {
            "review_text": "Best FPS i've played in years.",
            "review_score": "1"
        },
        {
            "review_text": "'I'm no hero. I'm just your everyday U.S. Military Mk. IV Cyber Commando.'  This game is stupid. Stupid fun.",
            "review_score": "1"
        },
        {
            "review_text": "One of 2013's best. Aside from some Uplay issues, this game both rocks and rolls. Neo-eighties action at its best!",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game with silly and old-school feel.  Not recommended for people wanting a 'serious' shooter",
            "review_score": "1"
        },
        {
            "review_text": "This game is probably the biggest and most complicated ♥♥♥♥-take on action games and movies. A lot of fun, but there are certain areas that seem unpolished, such as the UI detail and the lack of support for changing weapons by scrolling.  If you need a silly game you can play in short bursts, this could suit you.",
            "review_score": "1"
        },
        {
            "review_text": "Farcry 3 Blood Dragon is a fun and wacky ride. Jump into the shoes of Rex Colt and prepare for a fun and action packed story that plays out like an old 80's movie..  If you enjoyed Farcry 3, you'll love Blood Dragon. The game plays the same as Farcry 3 but with a crazy sci-fi retro look and feel. I recommend this game even though it is a bit short.   Final verdict (4.7 out of 5)",
            "review_score": "1"
        },
        {
            "review_text": "More kickass fun and humor than this, I don't think you can get. If you do not have it. BUY IT!",
            "review_score": "1"
        },
        {
            "review_text": "A Fantastic slice of over-the-top 80s-style mayhem. It doesn't get much better than this.",
            "review_score": "1"
        },
        {
            "review_text": "Not the best game in the world but its definetly a very fun game 9/10",
            "review_score": "1"
        },
        {
            "review_text": "This game made fun of tutorials. Great game, one of a kind.",
            "review_score": "1"
        },
        {
            "review_text": "A great homage to 80's action flicks. Quick and humorous, a great palate cleanser if you're a fan of the genre",
            "review_score": "1"
        },
        {
            "review_text": "Funny, short, standalone, worth!  If you can beat it in under 47 minutes let me know.",
            "review_score": "1"
        },
        {
            "review_text": "Sick of stupid modern shooter with their 'ultra hyper realism' and boring color palletes?  Sick of formula shooters with no sense of humor?  Don't waste your time with Farcry 3 when Blood Dragon delivers a better experience with NEON DRAGONS.",
            "review_score": "1"
        },
        {
            "review_text": "'Loading screen hints will give you hints' 10/10",
            "review_score": "1"
        },
        {
            "review_text": "When you thought Far Cry 3 was awesome enough, and you want elements of 80's retro nostalgia and trolling. Well, this one is it! Gosh I want a sequel for this DLC spinoff already!!! All the easter eggsssssssssssss!",
            "review_score": "1"
        },
        {
            "review_text": "School's out, for summer.",
            "review_score": "1"
        },
        {
            "review_text": "MARK 4 STYLE MOTHERF*CKER!  awesomest thing to come out this year~ short but awesome! 15$ well spent!",
            "review_score": "1"
        },
        {
            "review_text": "Very 80's and Badass!",
            "review_score": "1"
        },
        {
            "review_text": "the perfect game !!! get it  if you liked Far Cry 3 and want more of the fun and less of the limitations, you need this now !  if you don't care for big budget shooters. well this is the perfect small experience for you !  and for some goofy over the top action, go ahead grab it !",
            "review_score": "1"
        },
        {
            "review_text": "If I could I would buy it again. Better than any other Far Cry game. It's so good that it shouldn't be called Far Cry and a franchise should be created around it.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome 80's parody game. Recommended if you're a fan of the Far Cry 3 mechanics/graphics and enjoy 80's themed cheesyness!",
            "review_score": "1"
        },
        {
            "review_text": "This is the greatest game in existence",
            "review_score": "1"
        },
        {
            "review_text": "That may have been the best game I've ever played. It ranks in my top 5 at LEAST! They made a game, removed all the bull crap, and added one-liners. Look, here's how it goes, if a game makes you feel obligated to dance throughout the whole outro song, it was a great game. And also at the very end, I see what you did there. I think it is a crime punishable by DEATH to not make a full game or sequal out of this. Which ever one is correct. That's all. I gotta go to the bathroom. The fact that this game is over caused me to B.M.  9.8/10",
            "review_score": "1"
        },
        {
            "review_text": "The last hour of this game contains so much awesome that words will not do it justice. This is a neon bathed romp worth every penny. *****/*****",
            "review_score": "1"
        },
        {
            "review_text": "If you have any love for 80's action movies...BUY IT. Its freakin awesome!",
            "review_score": "1"
        },
        {
            "review_text": "It has cyborg sex in it.",
            "review_score": "1"
        },
        {
            "review_text": "Sweet game * First-person shooter with intriguing graphics of a futuristic jurrasic-like world. But let's not forget the indefeasible Cyber that you play as with an intricately designed body who's there to do nothing but wipe-out every trace of injustice ... ' Rex Colt Raptor ! '",
            "review_score": "1"
        },
        {
            "review_text": "TLDR - Solid but short FPS, effectively a reskin/mod of FC3. Cheesy 80's theme.  Right, this is one of the most laugh out loud games I've played in ages. It's a sort of homage to dodgy 80's action flicks, with various nods to other cheesy stuff. The game itself is sound FC3 stuff - do some plot, kill stuff, capture bases and light RPG elements. What makes it is the daftness. It's like Van Damme, Schwazenegger and Lundgren got together with Michael Bay and tried to relive their best years. Neon EVERYWHERE, even on the dragons that shoot lasers from their eyes. There is no explanation for where they came from btw. There are tons of bad lines lifted straight from the pen of 80's action scriptwriters. It's overflowing with homoeroticism and innuendo. Oh and spend some time to read the info entries for everything, guns etc. Enormous fun for about 5 hours if you don't bother hunting all the collectibles. Buy on sale for a fiver.",
            "review_score": "1"
        },
        {
            "review_text": "Original Terminator meets pro America '♥♥♥ YEAH.' So cheesy it'll make your lunch jealous but so damn hard to put down.",
            "review_score": "1"
        },
        {
            "review_text": "It's hilarious, you should play it.",
            "review_score": "1"
        },
        {
            "review_text": "A fun and worthwhile game, it has an old school feel about it. Especially with the cut scenes. It's visually decent, nothing compared to the farcry 3 graphics, but overall nice looking. Its's worth a $20-30 purchase, great if you get it for less. Even though its set in space, the story is unique and its still gory in it's own way. I recommend you give it a shot. ",
            "review_score": "1"
        },
        {
            "review_text": "For the price I paid, this game is fantastic. Short, a little buggy but not unnoticable, and it has a great sense of humor.",
            "review_score": "1"
        },
        {
            "review_text": "If you're an hardcore fan of the FarCry series... This game is not for you. It has nothing related to the series, beside some hilarious puns. This game is presented to you as a joke, and a bloody good one at it. If you like to have a good laugh while kicking ♥♥♥ this game is for you. If you like shinny lights, cyborgs, and dinossaurs, this game is for you. If you liked FarCry 3's gameplay and engine, but you're also open to sci-fi, again this game is for you.  I'd give it a 8/10, worth the price any day.",
            "review_score": "1"
        },
        {
            "review_text": "throw dice at people, shoot lazers",
            "review_score": "1"
        },
        {
            "review_text": "flipped a guy off and shot him with a shotgun 10/10",
            "review_score": "1"
        },
        {
            "review_text": "this is like eight hours of excellence, and made me want to replay far cry 3.  everything is neon and everything is awesome",
            "review_score": "1"
        },
        {
            "review_text": "I would reccoment it, its pretty fun and it gives that 80s 'cheesy' kind of feel. Nothing in it is really serious and the music is great. If you like far cry 3, look into getting this. Youtube it first though.",
            "review_score": "1"
        },
        {
            "review_text": "This game is actually hilarious. It's a good length too at like maybe 5 or 6 hours. Writing is great, it's fun to play and has a unique look. Seriously that last mission is super awesome. Would reccommend.",
            "review_score": "1"
        },
        {
            "review_text": "This game has about as much 80s action-camp as can possibly be stuffed into one game. Predator references? Check. Robocop references? Check. Excessive violence and scanlines? Double check.",
            "review_score": "1"
        },
        {
            "review_text": "Get it, its basically just far cry 3....in the 80's...with dragons.....that shoot lazors from their eyes.....that you can ride....for 15$",
            "review_score": "1"
        },
        {
            "review_text": "Really fun and a great standalone DLC and expansion of Far Cry 3.",
            "review_score": "1"
        },
        {
            "review_text": "It's got the guy who got shot in the face in Pulp Fiction! That reason alone is not why you should buy the game.",
            "review_score": "1"
        },
        {
            "review_text": "Just buy it, It's rad.",
            "review_score": "1"
        },
        {
            "review_text": "If you love 80's action flicks, blowing stuff up, cheesy but AWSOME one liners, neon dragons that shoots lasers, 80's references, and AMAZING cheesy funny story line with AMAZING retro cinemetaics animation. It's AMAZING fun game from start to finish.   PS: they added neon sharks with mounted lazers stuck on their back, how awsome is that :)",
            "review_score": "1"
        },
        {
            "review_text": "'80s. Neon. Lasers. Dragons. Snipers that Blow S*** Up. Lazer. Neon. Dragons. All in a Far-Cry game. It's the worlds best bad '80s Action-Movie of all time, with cyborgs. Why are you still reading this, have you bought the game yet? ",
            "review_score": "1"
        },
        {
            "review_text": "Did you ever want to be an action hero like Stalonne, Shwartzeneger and all the others... well there you go, just buy this s²²t already...you cyber NERD. (this is an amazing nostalgic punch to the stomach so if you're too young for this you might not like this.)",
            "review_score": "1"
        },
        {
            "review_text": "This game....this game is so funny and anazing and refrence to 80's movies filled that I love it more than Far Cry 3 and any other game!! get it NOW!!! :D 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Decoded the CPU sockets and recompiled the motherboard. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I had a blast playing this. I wish it would have lasted longer, but I am happy I bought it.",
            "review_score": "1"
        },
        {
            "review_text": "Just a heads up, this game requires you install Ubisofts 'uplay' client in order to run the game. In order to play the game you are required to set up an account through them. I had to wait a while to do this due to their servers not being available.  Otherwise a great game, with so many references to 80's movies, and a great soundtrack.",
            "review_score": "1"
        },
        {
            "review_text": "i don't think the 80s were this 80s",
            "review_score": "1"
        },
        {
            "review_text": "Use quad barreled fire shotguns to shoot cyber dragons in the ♥♥♥♥. Neon Lights!",
            "review_score": "1"
        },
        {
            "review_text": "It takes a lot for me to spend the time to review a game. This game has a lot. A lot of action, a lot of eighties movie cliches, and a LOT of balls. This was a formula that could have gone horribly, horribly wrong, and miraculously didn't. I have never played a Far Cry game before this one, but if this is what the studio can do when it's just messing around, I feel like I really should look into the other games in this series.  Graphics - While not perfect, the particle and lighting effects are suitably impressive. 8.5/10 Controls - Tight aiming, intuitive movement. Vehicles control relatively well, but field of view in them could be better. 8/10 Sound - Amazing. Perfect. From the effects to the soundtrack, everything is spot-on 80's. 10/10 Humor - Tongue in cheek the entire way, any flaws this game may have in the graphics or controls can easily be overlooked thanks to the humor of this game. 10/10  Buy it. You'll like it.",
            "review_score": "1"
        },
        {
            "review_text": "Fun just like Farcry 3 but in an old 8o's game lol but it is an awesome game!",
            "review_score": "1"
        },
        {
            "review_text": "Starring Michael Biehn as Michael Biehn with Michael Biehn playing Sgt Rex Colt as Michael Biehn.  Not enough Michael Biehn.  9/10 Michael Biehns.",
            "review_score": "1"
        },
        {
            "review_text": "You play an OP as **** cyborg and kill dragons with lazer guns. A surprisingly amusing game, too.  Fast gameplay matched with really, really smooth controls makes killing 10+ enemies fast and fun. My only complaint on controls is the poor healing system. It seems to take ages to register your keypress so I have to spam Q to heal. This was a problem in FC3 too for me.  It's pretty short at ~3/4 hours unless you get all the collectables, so buy it on sale and it's definitely worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Absolutely amazing. Runs extremely smooth, better than Far Cry 3. The game is very fun, very funny and more importantly it's memorable. It's one of those games that you play and you just wish was longer. It has so many references to many movies and games of the late 70s, 80s and early 90s. The wildlife is awesome (but small) and the missions are fantastic and over-the-top. The Blood Dragons themselves are amazing, a lot of time was put into these. There are enough one-liners in this game that you yourself will want to become an 80s Sci-Fi action hero. If you don't buy this game, you are truly missing out. It's the perfect game for someone who really wants to sit back, and have fun.",
            "review_score": "1"
        },
        {
            "review_text": "Oh well, an old school gameplay full of explosions and psychedelic colours. I've finished this stand-alone small mod of Far Cry3 and these are my impressions.  All the bad of Far Cry3 are still there, but in this case the game is to be taken as a destroy everything moves and gain satisfaction about huge destruction. Enemy are stupid as before and the ambient is always nightly dark. No water or panorama big slide but instead a quick and mindless sequence of destruction.   It took about a week for me to be finished, so do not expect HIGH longevity. The game by the way runs funny and fast, and the animated cartoon in '80 old style with music and colour create a very nice package. It's a happy game, full of jokes and cliches likes Terminator series, Karate Kid, o things like that... Approach can still be stealth or 'loud' but they always ends in loud total destruction. Ambient do no explode too much unfotunately, and a part of cars, barrels and enemies heads you are not playing Red Faction... :(  In my opinion buy it only if you like shooters and are you searching for a fire and forget experience. that's all.  Lord Hol Napult's opinion: 6+/10",
            "review_score": "1"
        },
        {
            "review_text": "There are no words for how amazing this game is. The humor is so over the top you wont see the ground. Dragons with laser eyes... you had me at hello.  The montage pushed me over the edge. I was literally busting out laughing.",
            "review_score": "1"
        },
        {
            "review_text": "As somebody born in the 1990's I'm pretty sure this is an accurate portrayal of what life was like in the 1980's.     ..... God damn, did I miss out.",
            "review_score": "1"
        },
        {
            "review_text": "Good DLC add on for a good price, decent length and love the blood dragons.",
            "review_score": "1"
        },
        {
            "review_text": "YOU LIKE RETROWAVE? GET THIS GAME.  DON'T KNOW WHAT RETROWAVE IS? GOOGLE IT.  1980/10",
            "review_score": "1"
        },
        {
            "review_text": "DO NOT buy  Not only did uPlay have trouble registering this game, it would keep my steam status locked 'in game' and forced me to go to task manager to quit steam so I could delete the local content.   The first rule of making a PC game or port should be 'do not format your game to behave like malware'  ",
            "review_score": "-1"
        },
        {
            "review_text": "A tsunami of references, but no actual comedic parody.  Haha, i get it. In the 80's people were into cyberpunk!  Haha, i get it. Lots of fancy computer scifi words strung together that make no sense!  Haha, i get it. Cliché action movie plots, lines and generic names!  Haha, i get it. Poor quirky voice acting, just like in the 80's action movies!  Haha, i get it. Laser weapons that look cool, but actually don't have any aesthetically pleasing kick to them and aren't at all fun to use!  Haha, i get it. Low resolution interfaces and cutscenes in some bizarro 3:1 aspect ratio, just like the NES! In the 80's! Are you laughing yet!?  Haha, i get it. An incredibly cringy tutorial in the beginning of the game that parodies video game tutorials with tubular ♥♥♥♥♥in 4th wall breaking electric boogaloo up your badoozaah all day long!  This game is just dumb. Making references to popular culture isn't going to get anyone with some basic knowledge about humor to laugh, a parody has to be able to stand on its own not necessarily requiring the viewer to know what it's a parody of. Some say that this game is better than Far Cry 3 itself. Some are terribly mistaken.",
            "review_score": "-1"
        },
        {
            "review_text": "If the '80s sci fi aesthetic appeals to you, get it. Though the ending is extremely anti-climactic, but I guess that adds to the 'cheesy '80s action movie' thing. I just kinda wish it were a little longer, and took itself just a tad bit more seriously, because that last part was just super dumb and a blight on the game, though not detrimental to it overall. Not to mention the soundtrack is nearly ♥♥♥♥♥♥ic, as it blasts synthesizers, some electric guitar, and reverby percussion when the situation calls for it, and is calm and atmospheric when needed.  So in short, if you think you'll like it, you probably will.",
            "review_score": "1"
        },
        {
            "review_text": "Great program and so fun to play. It's not the typical Far Cry with the super high resolution realistic graphics, but very visually pleasing. I paid only a few bucks for it, more than well worth it! I highly recommend this game to everyone!",
            "review_score": "1"
        },
        {
            "review_text": "One liners. One liners everywhere. And so much color...",
            "review_score": "1"
        },
        {
            "review_text": "If you are around 30 and love shooters you will really enjoy this game, and still get all of the joke refernces and the 1980s nolstagia.",
            "review_score": "1"
        },
        {
            "review_text": "Short, cheap, good.",
            "review_score": "1"
        },
        {
            "review_text": "'Blah blah blah kill blah blah....'  Stalking an enemy base from the distance, pull out the Kobracon sniper rifle and take aim on an unsuspecting enemies head...Sgt. Rex Powercolt fires the round and then in the scope you see an explosion of neon blue 'lubricant' right where his head used to be followed up by Rex with a simple, '♥♥♥♥♥♥♥.'......priceless",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3 - Blood Dragon is pretty much an '80's game made with recent technology and a whole load of great, great satirical humour.",
            "review_score": "1"
        },
        {
            "review_text": "I love the nostalga with this game but it doesnt save any progress you make and the uplay system in inept, why use uplay when you bought the game on steam? trust me for the hassel dont buy the game watch the walkthrough on youtube instead. on another note what has happened to ubisoft they havent made any good games in ages. I have seriously went right off ubisoft.",
            "review_score": "-1"
        },
        {
            "review_text": "Game is fun at times but has a serious lack of content. You're forced to install ubisoft bloatware called uplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: Fits in a ton of badass, cheese and extreme from 80's/90's Arnie and Sly action flicks. Consistent tone. Michael Biehn, the developers and you are having the time of your lives with this. Opening and ending are amazing. Good amount of content for price. Explosive sniper, RoboCop's movie gun, laser scoped SMG, and 4-barrel, incendiary ammo Winchester. Minigun. Hunt mutated animals including Cybersharks. Blood Dragons shoot laser out of their eyes, eat people and can help you take over enemy bases.  Cons: Little content and variation. Some have had big problems, including with saving(see the Discussion Board for solutions to a lot of them). Murky color scheme, at times it's hard to make out what you're looking at. Too easy.  My recommendation: Watch the trailer, and note the tone. Look at the price. Note that it's essentially a stand-alone DLC, not a full game. Do each of these steps make you happy, and eager to play? Buy it, play it, love it.",
            "review_score": "1"
        },
        {
            "review_text": "Best game in the series, If you liked Far Cry 1, 2 or 3 then you'll love this game. I'm at a loss for words why it launches threw steam.....and THEN threw UPlay.....?",
            "review_score": "1"
        },
        {
            "review_text": "If you're a fan pf FPS's, you will like this game. If you like a your shooters to have RPG elements, you will also like this game. If you love the 80's, you'll love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Best (far cry)game ever!",
            "review_score": "1"
        },
        {
            "review_text": "This game is insanely epic! It has an old 80's-themed style to it and dragons that shoot lasers out of their mouths! What more could you ask for?",
            "review_score": "1"
        },
        {
            "review_text": "If you're fan of the 1980s, you won't be disappointed in this Farcry 3 spinoff. In this game, you'll experience chessy, but great one-liner dialogue that are actually movie refencres of the 1980s, explosive action-packed storyline, dinosaurs that shoot lasers from their eyes, and play as an badass cyborg that is the best of the best... Sergeant Rex Power Colt!",
            "review_score": "1"
        },
        {
            "review_text": "Hilariously fun to play! My kind of FPS game, full of action, story and 80's 90's movie referances and nostalgia. LOVE IT! :P",
            "review_score": "1"
        },
        {
            "review_text": "Very fun, very funny. A lot of dialogue and slow cut scenes which seem to drag on, and play the joke out a bit too far, otherwise the story is pretty entertaining.",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game. It's much more enjoyable if your in on the 80''s/90's movie action movie references. The controls are great and i had no problem using my wired 360 controller. The color pallate is something that you need to get used to. At times its VERY harsh neon. Very garish, but that was intentional. Goes with the over the top humor. I dont like how you need to DL a Ubisoft program to play it.",
            "review_score": "1"
        },
        {
            "review_text": "buy this instead of SJWCry 4 and put some hair on your chest. FUN/10",
            "review_score": "1"
        },
        {
            "review_text": "100% concentrated joy.",
            "review_score": "1"
        },
        {
            "review_text": "tis good",
            "review_score": "1"
        },
        {
            "review_text": "Great riff on the 80s stuffed into an engaging game engine.",
            "review_score": "1"
        },
        {
            "review_text": "A nice 80s sci-fi parody with lots of adolescent humour and old-school gunplay, a bit like duke nukem or serious sam. One of the main problems I had with Far Cry 3 was that it took itself seriously, while being arcade and unrealistic. Blood Dragon is better, because the same arcade mechanics fit much better with the sci-fi setting that deliberatly does not take itself seriously. In Far Cry 3, some things like sidequests were simply bad, but here they are deliberately so bad, they're good. This does feel like a far cry 3 mod though, with a lot of recycled content, and the story is very short, but if you felt mixed about Far Cry 3, you will probably enjoy this more, as long as you don't take it seriously.",
            "review_score": "1"
        },
        {
            "review_text": "FC3- Blood Dragon  If you like those old 80's classic movies, this title should bring a smile to your face.  I got some good laughs. I got it at a sale so for me I must say worth every penny!!  It's got music heavily inspired by terminator movies (and I think I hear some predator) and some of it is straight out of rocky 4. Also saw references to jaws, rambo, duke nukem, and the pistol? definitly robocop!  One-liners a plenty! ('I think he got the point', after bow kill for example) The final missions were the best, those alone makes it worth playing.  Pros: Nice music, fun missions, humor, far cry 3 gameplay with a few twists.  Cons: Stale dark world (no day/night, or change of weather) gets a little tiresome. Pretty short. Uplay required.  These cons are not very considerable if you just take it for what it is, a short and fun blast to the past. All in all, I recommend. Especially if you have a soft spot for the 80's action movies, or if you liked the old Duke Nukem.  Stay away if you have problematic Uplay issues. It was required to play. ",
            "review_score": "1"
        },
        {
            "review_text": "I am so done, i finished the game with most of the side quests done,except one or two and yeah it took me about 6 hours  BUT OH JESUS YOU GET SOMETHING IN THIS GAME  It's like Yeah Pew Pew Pew BAAAM DRAGONS LAZAAAAAAAAAAAR  No more seriously it is really genius,your charackter upgrades and unlocks more and more abilities (that you can't choose but don't worry they are all interesting),shooting is really enjoyable and you get some real cool easter eggs and funny jokes in it.  Why is there far cry in the title? Just because it is based on the Main game gameplay Animals animation and so on and so on. But don't worry that's a good thing you won't be bored even after playing 1000 hours on the original Far Cry 3 it is not Copy past.  It isn't a 60 Dollar (euros) game but oh god it is better than some 60 Dollar (euros) Triple A Titles.",
            "review_score": "1"
        },
        {
            "review_text": "Although it can get a bit repetitive by the end, they did a great job with the 80s characterization. Combat mechanics are pretty fun and jokes are spot on. Also I personally think that the Farcry 3 style of game works better in a smaller chunk like this, because it permits the removal of the irritating padding surrounding a 'bigger' game and I felt compelled to finish instead of just getting bored and giving up mid-game.",
            "review_score": "1"
        },
        {
            "review_text": "One of the best if not the best Singleplayer-Shooter I have played. The Graphics are gorgeus the ArtStyle is beautifull and the Story is awesome .... atleast if you like old Action movies. If you want to have a Rambo game that is good. Then this is the one for you. You will have 4 amesome hours. I mean it´s Rambo....in the future....with Dinosaurs.  8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "One of my all time favorite games of all time. PowerGlove make the soundtrack What more do you need? Go by this now.",
            "review_score": "1"
        },
        {
            "review_text": "The references are strong with this one! A strong DLC for an already amazing game with lots of fun, old movie references and a strangely interesting world. I mean if you close your eyes and just listen to the music its like playing a Terminator game and we all know we really need a good Terminator game. The soundtrack is awesome and the enviroment is even cooler. The only downside is that the game is really short as it took only 3 hours for total completion. That aside the game is totally recommended to liberty lovers.",
            "review_score": "1"
        },
        {
            "review_text": "And ign's game of the year goes to... Far Cry 3: Blood Dragon! Need I say more.",
            "review_score": "1"
        },
        {
            "review_text": "This game is hilarious.",
            "review_score": "1"
        },
        {
            "review_text": "IT WOULD BE GOOD IF UPLAY DID NOT EXIST!",
            "review_score": "-1"
        },
        {
            "review_text": "Game is so good, better than farcry 3. Shame its so short, got to play it again sometime.",
            "review_score": "1"
        },
        {
            "review_text": "  Pro's and Con's",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game. I love the retro 80's feel to it too. Can't go wrong buying this one.",
            "review_score": "1"
        },
        {
            "review_text": "Amazing DLC content. I have never played such an amazing and hilarious DLC in my entire life such as this. from start to finish i could not stop grinning like an idiot throughout my playtrhough!  From the sublte references to the amazing 80's soundstrack vibe, this is just an amazing DLC for a 90's kid such as myself.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "It only took me 7 hours to get my fill of this guy, which is dissapointing, but if you want hours of gameplay just play the regular Far Cry 3, that game is great, 8/8 m8.  If you don't have a whole lot of time and want something that holds your attention and RUNS WELL, this game is for you.  It's pretty great",
            "review_score": "1"
        },
        {
            "review_text": "Imagine the 80s. Imagine the movies, the games and all that other weird stuff. And now imagine combining all of this into an incredibly weird and funny game. That's Far Cry 3: Blood Dragon.",
            "review_score": "1"
        },
        {
            "review_text": "wow, this is something.   retro gaming + far cry fusion  although i didn't like the athmosphere (give me headache), overall the gameplay is good the retro part is good  7.3/10",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game, full of charm and ridiculously awesome weapons. One thing that bothered me though was the ending, or the main villain's end dialogue - just before the final fight. Sloan lists off various types of people he wants to rid the world of, and right after mentioning politicians he mentions Democrats. Slone never mentions Republicans, or (if I remember correctly) any other political groups. The problem I have with this single line is that while Sloan's political ideals, or affiliatian is never revealed, he is identified as someone who dislikes Democrats - enough to actually desire the death, or destruction. For some, this could automatically identify Sloan as a Republican; although never specifically stated, it does not state anything to the contrary - besides his actions. I feel like this was intended, but it's just a small mar on this game - really quite tiny. The rest of the game is really fun, almost never bored - beyond the fatigue one should expect from an open world game. The guns can be customized - excluding a few weapons - in ridiculous and awesome ways. The shotgun, for instance, can be upgraded to equip four barrels - despite being a lever action shotgun, which is incapable of loading all four barrels in reality. The gameplay itself is what one would expect of Far Cry 3, but set in an 80's movie/cartoon inspired world.",
            "review_score": "1"
        },
        {
            "review_text": "blood dragon is effectively a reskin/cut down version of the far cry 3 but with a quirky new cheesy action heroes feel to it which kept me invested in the game and gave a true retro feel to the game although the systems were basically the same as far cry 3's but thats perfectly fine. slightly annoyed about the amount of content actually in the game because i came away from the game wanting more but is still a fun game none the less.",
            "review_score": "1"
        },
        {
            "review_text": "This game doesn't deserve the words 'Far' and 'Cry' on it, as Blood Dragon is way too good to be lumped in with such a mediocre title.",
            "review_score": "1"
        },
        {
            "review_text": "Jacked up on America and obese with glory this game was an epic play totally worth it great graphics/storyline and the dialouge is the best.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent stand alone expansion to Far Cry 3. Full of highly self aware jokes about the follies of open world games, and references to famous 80s movies. Add to that the fact that the gameplay itself is great, and this is a very high quality game. Not nearly as lengthy as Far Cry 3, but it works in Blood Dragon's favor.",
            "review_score": "1"
        },
        {
            "review_text": "Guns? check, explosions? check, totally 'helpful' hints? nope.",
            "review_score": "1"
        },
        {
            "review_text": "This is how my brain remembers the 80's",
            "review_score": "1"
        },
        {
            "review_text": "Game is good. uplay is a piece fo mother♥♥♥♥ing cockgobbling ♥♥♥♥♥ucking cunttainting ♥♥♥♥♥♥♥ed piece of vile ♥♥♥♥♥♥♥♥♥.  7/10, would torrent it next time.",
            "review_score": "1"
        },
        {
            "review_text": "Super cool 1980's themed f*** yeah story with the same mechanics and vehicles as FC3. Always red tinted, lazers and future tech, overall fun (short) spin off.",
            "review_score": "1"
        },
        {
            "review_text": "This is just awesome, why havn't you bought this yet?",
            "review_score": "1"
        },
        {
            "review_text": "There is one word to review this game: awesome. It has this 80s saturday morning cartoon feeling that makes the game incredible and fun. If you like puns and far cry 3 gameplay, you will love this game.",
            "review_score": "1"
        },
        {
            "review_text": "Revvin' up your engine Listen to her howlin' roar Metal under tension Beggin' you to touch and go  Highway to the Danger Zone Ride into the Danger Zone  Headin' into twilight Spreadin' out her wings tonight She got you jumpin' off the deck And shovin' into overdrive  Highway to the Danger Zone I'll take you Right into the Danger Zone  They never say hello to you Until you get it on the red line overload You'll never know what you can do Until you get it up as high as you can go  Out along the edge Is always where I burn to be The further on the edge The hotter the intensity  Highway to the Danger Zone I'm gonna take you Right into the Danger Zone Highway to the Danger Zone Right into the Danger Zone",
            "review_score": "1"
        },
        {
            "review_text": "It's a good game but it desperatly needs a way to tone down the retro screen effects, makes my eyes hurt after 30 min of playing. Uplay is also a negative. Overall it's the same mechanics as farcry 3 but has a new story that seems fun, unfortunatelly I couldn't force myself to keep going.",
            "review_score": "-1"
        },
        {
            "review_text": "Awesome! Just finished it, Rex's sense of humor is really fun and the whole game ambient is amazingly ironic and fun). Buy it when on sales though :D",
            "review_score": "1"
        },
        {
            "review_text": "Amazing game, worth 15 dollars to get the full American Badass robat expirence while keeping roots into the other Farcry games. I loved this game, played every mission. Very ♥♥♥♥ing good for a dlc!",
            "review_score": "1"
        },
        {
            "review_text": "R.I.P Spider... You were a damn good Mark 4!!   Wait.. I was supposed to tell his wife and kids something... Damn I forgot! Oh well, time to do what I do best! Kick some ♥♥♥!!!  ",
            "review_score": "1"
        },
        {
            "review_text": "it's definitely worth your time. great soundtrack and focused more on shooting and killing instead of leveling up the character like in farcry 3.",
            "review_score": "1"
        },
        {
            "review_text": "Ufail warning, otherwise a nice game",
            "review_score": "1"
        },
        {
            "review_text": "Uplay. That word is the reason we can't have nice things. I played the demo on the PS3, and of cource PC is better for first person shooters no matter what, so I bought it on PC. I thought to myself 'People sure complain about Uplay a lot. But this game was so fun, I can tolerate owning ONE Ubisoft game on PC.' I think you can see the mistake. Not only is the game unplayable because of Uplay trying to save things on a backup that never actually accepts the save, it also can't load from the noexistant save. Ergo, you can't play the game.  -Update: I have FINALLY found a way to fix the 'Constant autosaving' glitch. It was maticulous and took me well over 4 hours to figure out. If anyone needs help, ask me and I'll see what I can do. For now all I can say is try forcing administrator mode. ♥♥♥♥ UPLAY!",
            "review_score": "-1"
        },
        {
            "review_text": "What I liked: its funny and has a cool retro neon action movie feel to it What I Disliked: Its basically unplayable for me. The ''SAVING'' icon is constantly flickering on the screen the whole time, and you know what? It DOESNT EVEN SAVE. So everytime I died, I have to go through the tutorial bit AGAIN and AGAIN, because the autosave doesnt work, despite the icon being there the whole game, flickering, like its taunting me...wanna play? huh? you better not die! hehehehe... Thanks Ubisoft, thats $9 wasted.",
            "review_score": "-1"
        },
        {
            "review_text": "Excellent game. If you want to play a Farcry game or try out the controls with spending too much money, this game is for you. All I can say is that its kinda short the map is small, but keep in mind its a smaller version of Farcry. Really great game. The cheap price makes it even better.",
            "review_score": "1"
        },
        {
            "review_text": "Freaking F***ing Awsome Best game played",
            "review_score": "1"
        },
        {
            "review_text": "Where to start with Far Cry 3 - Blood Dragon...  To start off I would say it was short and sweet, fun and entertaining, yet left me wanting more. The gunplay felt really great, and I particularly loved the bow. (Would have loved upgrades for it though!) Exploring the area was fun and didn't feel quite like a chore in most games. A simple, yet rewarding upgrade system made leveling worthwhile. The same goes for the collectables. Story was goofy and over-the-top but jokes weren't terrible. Knowing it was making fun of itself and other games from the start helped.  Overall I would say it was a great game, and worth checking out if you like the Far Cry series or free-roaming games.",
            "review_score": "1"
        },
        {
            "review_text": "This'll be a classic in years and decades to come, just like the awesome 80's sci fi and action films that inspired it, and the soundtrack is mesmerizing, wicked stuff, I couldn't recommend it enough.",
            "review_score": "1"
        },
        {
            "review_text": "If you love the 80s, you'll love this game. Although I recommend it for the sheer blast of nostalgia and not-give-a-flip sense of humor, it won't feel like a full feature game. Then again, filling an entire release from the ground up with tons of tongue in cheek content to the same degree would be heinously difficult. What IS in the game, though, is golden. I prefer it this way than risk watering it down.",
            "review_score": "1"
        },
        {
            "review_text": "2/10 Not fun after finishing it. Short Story :|",
            "review_score": "-1"
        },
        {
            "review_text": "Great 4-hour adventure. Don't buy it for the free roam like normal Far Cry though - you won't get that for the $15. Story and gameplay are fun but short so buy it on sale",
            "review_score": "1"
        },
        {
            "review_text": "In Far Cry Blood Dragon, you are a cybernetic enhanced soilder fighting an army of 'Cyber Soilders'. Your mission is to kill you mentor who has gone rouge. The game gives you the freedom to do what you want in the reletivly small world. Pros -The gameplay is really fun -Driving is decent -The 80s theme is cool -Decent graphics -Really funny -Gunplay is nice -soundtrack is really cool. gives the game a Sci fi theme  Cons -Lack of checkpoints on missions. I was doing a mission where I had to blow up a dam but I died and was sent back almost 15 minutes. All of that time was doging cyborg bullets and trying not to die a thousand times.  -Not that good of a story. Even though the goal of the game is not for story but for fun the story is not that good -Voice acting is not that good. The voice acting, mostly for the main character, can feel very robotic and not natural in general. The character is half robot but half the time he sounds robotic and the other half he does not -map can be bland for the first few hours(I am not that far in the game so I am not sure if it gets better) and can be a little small compared to games like GTA 5.  My rating is 8/10 Far Cry Blood Dragon is a great game but with a few drawbacks. I highly reccomend it for all players if you can deal with the checkpoint issues.",
            "review_score": "1"
        },
        {
            "review_text": "Typically sh|tty ubisoft game with just differetn skins and little good humour",
            "review_score": "-1"
        },
        {
            "review_text": "It was a lot a fun, the game is short though.",
            "review_score": "1"
        },
        {
            "review_text": "This was one of the best singleplayer games I played in a while. 10/10!",
            "review_score": "1"
        },
        {
            "review_text": "Short but ♥♥♥♥ing awesome!",
            "review_score": "1"
        },
        {
            "review_text": "80's-90's Saturday Morning Cartoon The Game. If you're an action film buff there's a lot of jokes and references for you inside, come on in. It has laser sharks.",
            "review_score": "1"
        },
        {
            "review_text": "cheesy lines,too much easter eggs,too cliche,and too god damn awsome of what it is its basicly all 80s,90s video games you have dreamed of but in 3D",
            "review_score": "1"
        },
        {
            "review_text": "This isn't just DLC, but a whole complete game. But considering it is technically DLC, I must say it is the best standalone DLC I've ever played and probably ever will play. In fact I'm gonna say this, TIS GAME/DLC NEEDS A SEQUAL!!!! And I thought Halo had a good soundtrack, now i'm obsessed with the theme for this game, that SI-FI/Futuristic feel and sound to it, gets you all pumped for killin some baddies. Infact this is my favourite Far Cry...and yes I have played all of them, but this one just stood out for me and thats why I love it so much.   All in all this fantasic game deserves a 11/10 its just so fantastic to go out as a terminator and just blow sh*t up....AMAZING!!!!!!",
            "review_score": "1"
        },
        {
            "review_text": "There is too much 80's in this game for it not to be good. I would have prefered to see this as a full game rather than FC3. It's all the gun's, lasers, dragons and ridiculous theam music you ever wanted as a kid in one place! Its silly and fun.",
            "review_score": "1"
        },
        {
            "review_text": "ＡＥＳＴＨＥＴＩＣ",
            "review_score": "1"
        },
        {
            "review_text": "Good ♥♥♥♥! Michael Bien up in here.",
            "review_score": "1"
        },
        {
            "review_text": "This is my favorite game in the Far Cry franchise. That's saying a lot because my favorite game used to be Far Cry 3. Only reason I don't give it a 10 out of 10 is because it's so short. If you don't do side missions you can beat it in about 5 hours. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "If you miss the 80s you can do 3 things to get back to it:  - Watch a compilation of intros of 80s cartoons on YouTube. - Watch Commando starring Arnold or Rocky IV. - Tuning to your local radio station that plays 80s top 40.  Or you can just play this game which combines everything above.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Looks amazing Very stylish in more ways than one Laser shooting dinosaurs  Cons: Short length Mediocre gunplay No jetpack  Overall: Good",
            "review_score": "1"
        },
        {
            "review_text": "Well, apart from 80's references and humour - which everyone else is writing about - FarCry 3 Blood Dragon is a pretty damn good FPS with slick mechanics derived from FarCry 3.  As a half-priced spinoff, gameplay is quite short and maybe a little too bit repetitive, but I surely recommend getting this game, especially on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Looks like it was made by Michael Bay Cons: Looks like it was made by Michael Bay  Essential game",
            "review_score": "1"
        },
        {
            "review_text": "This short game is really quite enjoyable. It takes the 80's action theme to the future and just rolls with it. The plot is hilariously outrageous, which is partly what makes this game so great. The character you play can't even handle how hilarious the plot is at times.   Do yourself a favor and pick it up and enjoy the action!",
            "review_score": "1"
        },
        {
            "review_text": "A game that started out strong yet quickly devolved into playing Far Cry 3 again, mechanics-wise. You don't pick up a title like this to play it 'properly,' though. It's obviously all tongue in cheek. Obliterating everything that moves is the point, kind of like with Serious Sam, and you do it with a stupid grin on your face.  The cutscenes were also fantastic. Well worth the $3 paid during a Steam sale.",
            "review_score": "1"
        },
        {
            "review_text": "Just make a Blood Dragon 2 but with the Far Cry 4 map, I mean, you already did that with Primal :^)",
            "review_score": "1"
        },
        {
            "review_text": "This is such a refreshing way to play Far Cry 3. Extremely silly 80's vibe and action within a satisfiing map to be as wild as you can go. SPOILER ALERT, you end up riding a ♥♥♥♥ing dinosaur with laser eyes, how can it be wrong?  BUY when it's 5 USD or less, you wont regret",
            "review_score": "1"
        },
        {
            "review_text": "Awesome gameplay and humour.",
            "review_score": "1"
        },
        {
            "review_text": "This is a cute little follow up to Farcry 3. It makes fun of old 80's SciFis and combines it with the fun of FC3 although short it was a joyride all the way to the end. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Funny and fun to play",
            "review_score": "1"
        },
        {
            "review_text": "Far Cry 3 is the best Part of the Far Cry Series, but Blood Dragon is even better and a lot of fun. 90's Kids will love it. One of the best 'mods' and DLCs I bought. I can highly recommend it.",
            "review_score": "1"
        },
        {
            "review_text": "Best and most original Far Cry GAME by far as of 2016.",
            "review_score": "1"
        },
        {
            "review_text": "I love this game, its awesome, hilarious and fun. If you like over the top action and humor or you watched kung fury you definitly need to buy this game. however i can only reccomend it on a steam sale as it is very short as i beat it on hardest in 5 hours. (keep in mind im a player who gets straigt to the point) However there is replay value as in trying out all of the awesome weapon upgrades by completing side objectives and capturing bases. 8/10  P.S if you have any steam trading cards for this game please DM me and we will work something out XD",
            "review_score": "1"
        },
        {
            "review_text": "Review of Far Cry 3 - Blood Dragon:  Blood Dragon was a fine game. It was eh for half a day. It has the same controls as Far Cry 3 did which was nice. The graphics were decent and I liked the playstyle of the game. It is estentially Far Cry 3 just in the future. You aren't trapped on an island but you have the same mentality of go kill these dudes and sneak everywhere. I bought Blood Dragon in a bundle with Far Cry 1, 2, and 3. I think that Blood Dragon was worthwhile for the bundle deal, but I would not buy it on its own. Save the money and get a better game. However, if you can get a sale or the game in a bundle, I would check it out. It is 10-15 dollars and gets you a good 6 hours of playtime. I just beat the game. I loved the last mission, but the other missions felt all the same, just kill this guys guards only to find he wasn't there. Then go on the same mission again. Only buy on sale or in a bundle.",
            "review_score": "1"
        },
        {
            "review_text": "Well worth the €15! If you take your time and get most of the collectables and get all the outposts you can get around 9-12 hours out of this game (thats more then a lot of FPS story modes for full games!) if you just force through it only like 3-6 hours. So remember its not a race, take it in. The visuals are amazing, with all the illuminious colours. Story is Hilarious! Quote: 'IMA FIRING MAI LAZER!'. The fact that this game is a standalone DLC seals the whole neat package because like many people I'm moving over from console to PC and I had Far Cry 3 on Xbox 360, so it doesn't limit people like me. Full graphics on a nVidia 670 runs great. This is my wholehearted recomendation. BUY THIS GAME RIGHT NOW!!!!",
            "review_score": "1"
        },
        {
            "review_text": "If you have to actually consider whether or not you should play this, then you probably shouldn't get it.",
            "review_score": "1"
        },
        {
            "review_text": "Just finished the game and even though is short it still a awesome game. I really like the 80's theme of the game and its simple story telling design. Also having the same awesome gameplay of the original game makes it even more fun. I totally recommend this and its a standalone DLC so you don't need the full game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is good for the price but if it was a full 60 dollars it wouldnt be worth it the campaign is really short but good and it was fun liberating bases",
            "review_score": "1"
        },
        {
            "review_text": "👌",
            "review_score": "1"
        },
        {
            "review_text": "At first I though that this game was going to be a ♥♥♥♥ing joke, untill I played it. The artstyle is ♥♥♥♥ing amazing, I love the ♥♥♥♥ out of this retrofuturistic version of 2007. I have never actually laughed at in game hints or general information found in game until I played this game. The soundtrack got me hooked on synthwave music, I can't stop listening to that ♥♥♥♥. There's only 2 things I don't like about this game: Short story and small map (understandable because it's a standalone DLC) Ubishit.  I'd give this game a solid 9/10  'That's my kind of ♥♥♥♥♥♥♥.' - Rex Colt.",
            "review_score": "1"
        },
        {
            "review_text": "fun game but kinda short   4/5   would buy on sale for sure",
            "review_score": "1"
        },
        {
            "review_text": "This game is everything that you'd want in a parody action game. From 80's one-liners, to badass fight sequences. This game has got it all.",
            "review_score": "1"
        },
        {
            "review_text": "This is what happens when you turn a cannon films scifi movie into a video game It's awesome Play it",
            "review_score": "1"
        },
        {
            "review_text": "Have you ever wanted to play an 80s action movie? If so this game is for you.",
            "review_score": "1"
        },
        {
            "review_text": "I need a sequel, Ubisoft. I don't care about Assassin's Creed (insert number excluding Black Flag here).",
            "review_score": "1"
        },
        {
            "review_text": "The best 80's action movie i have ever seen.",
            "review_score": "1"
        },
        {
            "review_text": "This is amazingly 80's based little gem. Well worth time spent playing, as it is constant fun-ride.",
            "review_score": "1"
        },
        {
            "review_text": "It's got Michael Biehn, laser dragons, and a kickass soundtrack. What more could you want?",
            "review_score": "1"
        },
        {
            "review_text": "its like an 80s action movie in neon and to the power of awesomeness! 11/10 would make cliche 80's jokes again!",
            "review_score": "1"
        },
        {
            "review_text": "This Slim Jim of a expansion is everything to you need to go back to the future. Full of 80s amazingness.",
            "review_score": "1"
        },
        {
            "review_text": "'I ♥♥♥♥ing hate tutorials...and this one is terrible!' — Rex 'Power' Colt  11/10",
            "review_score": "1"
        },
        {
            "review_text": "Over the top neon goodness. Quite short, not really innovative gameplay-wise but has one of the best climax I've seen in a game lately. Really worth it.",
            "review_score": "1"
        },
        {
            "review_text": "Too colourful",
            "review_score": "-1"
        },
        {
            "review_text": "Better than the original Farcry3(imo). If you like the 80's era style and music you will like this 'mod'. Visuals are excellent and for a couple of bucks(which is what i bought it for, all hail steam sales) this is a must buy!",
            "review_score": "1"
        }
    ]
}