{
    "app_id": 233230,
    "name": "Kairo",
    "release_date": "2013-04-24",
    "developer": [
        "Locked Door Puzzle"
    ],
    "publisher": [
        "Lupus Studios Limited"
    ],
    "platforms": [
        "windows",
        "mac",
        "linux"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Steam Trading Cards",
        "Partial Controller Support",
        "Steam Cloud"
    ],
    "genres": [
        "Adventure",
        "Indie"
    ],
    "tags": [
        "Puzzle",
        "Exploration",
        "Indie"
    ],
    "achievements": 11,
    "positive_ratings": 1131,
    "negative_ratings": 392,
    "price": 3.99,
    "description": "Enter the lost world of Kairo. Explore vast abandoned monuments. Bring strange and ancient machinery back to life. Slowly uncover the true purpose of Kairo and fulfil a great destiny.Kairo is an atmospheric 3D exploration and puzzle solving game.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/233230/header.jpg?t=1447357504",
    "minimum_requirements": "OS:Windows XP Processor:2GHz Dual Core Memory:2 GB RAM Graphics:Shader Model 3.0 Hard Drive:1 GB HD space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Kairo is a game of exploration in a strange and unsettling world, one built of geometric structures in a stark monochromatic setting. Alien-looking monoliths loom out of the colour haze, blocks shift as you move, it's unnerving and there's an overwhelming feeling of being watched and isolated at the same time. The soundscape is dominated by an unearthly ambient score, with various musical notes and effects cues when appropriate; it generates a lonely atmosphere, and Kairo never forgets that you're there to experience its world. There are three main hub areas, each containing a handful of modest puzzles, and there are several secrets and hidden glyphs to find. It shouldn't take you longer than 5 hours to finish the three main hubs, but it's worth every minute that you spend in its unique world.",
            "review_score": "1"
        },
        {
            "review_text": "'See, the object of the game is to get this machine somehow to spit out tickets. Now, I really haven’t figured out how that works yet, and I don’t know what these wooden balls are for. I mean, I’ve been eating them.'  - Johannes Scotus Eriugena",
            "review_score": "1"
        },
        {
            "review_text": "Exploration based chillout game. if you want an experiance.. buy this game. relax enjoy. excellent music. atmosphere is in every corner. and peace. discover the mystery of an ancient alien ruin.. and in doing so find a lost piece of yourself. Inde AA. Dava",
            "review_score": "1"
        },
        {
            "review_text": "This game made my brain make the noise a deflating tire makes.",
            "review_score": "1"
        },
        {
            "review_text": "I played lots of puzzles and walking simulators, and this one differs from the others for having a good variety of simple challenges in an atmospheric desert world mostly made of stone with some hidden and strange stuff along the way.the idea is good and the visual is pretty well done. The only flaw of Kairo's devs is the lack meaning in the game progress. There's no concrete story (at least untill the part of the game i'm in), only randon pictures in some places and visions that only appear if you solve optional puzzles that won't explain much. But I recommend this game if you like the genre and if it's on sale, of course.  PS: This game is definitely an Illuminati admission test, I can feel it!",
            "review_score": "1"
        },
        {
            "review_text": "This game felt like things I've seen in dreams. Loved it for the ambience/aesthetic alone, the puzzles made it all the more interesting.",
            "review_score": "1"
        },
        {
            "review_text": "I'm nothing if not a fan of ambiguity to such an extreme that I can interpret something as a commentary on whatever I dern well please, and Kairo is an experience that excels in creating a blank slate open to any and pretty much all interpretations. This game is simplicity in action, and as I delved deeply into the carved blocks of granite/obsidian/stone/randomness to discern some hidden meaning behind it all, I found myself continually following my own line of thought, like a dog trailing after the scent of a long lost bone he buried somewhere deep in the earth.  I honestly attempted to like this game, but sometimes a little concrete meaning is required after a jumble of meaningless gravel. What I mean is that Kairo is far too ambiguous; I can wander aimlessly through this game and decide what it means for myself until, quite literally, the very end, at which point Kairo finally decides to give me something solid - not okay, guys, not okay.  Kairo is a game that lets you wander through a child's block fort, occasionally posing *cough cough* 'puzzles' that briefly halt your progress through the maze of nothingness. I felt as though the developers had a clear idea as to what they wanted to say, sat down in a conference room and said 'Hey guys, woudn't it be really cool if we...' and then glued together a jumbled mess of a game.... Sorry, 'experience'. I received conflicting feelings of paranoia and comfort throughout the game, feeling at one time as though I were being watched and at another time as though I were revolting against an omnitient, though not omnipotent, regime, slowly tearing it down brick by ambiguous brick. I think each *cough cough* 'puzzle' in this 'experience' was arbitrarily assigned some deeper 'meaning' after the story-board team smoked an acre of some illegal substance. That doesn't fly with me. I am certainly not saying I don't LOVE pushing my smug nose up and saying 'Oh yesh, I am a very smart man and love interpreting games and books and movies because I am so deep and insightful' because I do love to say that. I am a smarmy head-up-my-ahem turd; Kairo is a jumbled mess of obfuscated meaning with an alternate ending (oh joy) to encourage further 'experiencing'. That's cheap, guys.  IN BRIEF (he said ironically): Kairo is a block fort, glued together by a toddler hyped up on three gallons of coffee. Then a guy walked by and glued a tagline onto it that belongs at the bottom of an inspirational cat poster. If you have something to say, then say it. If you believe in what you're saying, then you want people to agree with you: make sure they know what you believe.  10/10",
            "review_score": "-1"
        },
        {
            "review_text": "Playing this game feels like a walk through a museum of modern art. Interactive museum of experimental art. Full of puzzles and mysteries.   Captivating atmosphere. Great soundtrack.  If you want to see how games can work like an art be sure to check this one!",
            "review_score": "1"
        },
        {
            "review_text": "A real brain teaser this one. Does not tell you anything - you are not even sure who you are and if it's all just some weird dream. No dialogue anywhere in the game and the first character you encounter is not in the shape to tell much stories.   'Minimalistic explorer' is what i have heard this being called and it's pretty accurate. Games like this dont really exist and nobody makes them yet i think this one was fun right of the bat and it was able to steer clear of the X-files/lost type of cliffhanger and then nothing -type of clichees that i was expecting to pop-up at some point. so i'll give this one 9/10 - As a minimalistic explorer w/puzzles to solve.",
            "review_score": "1"
        },
        {
            "review_text": "I think developers were on drugs when they actually did this game . 10/10 I'm too stupid to solve this.",
            "review_score": "1"
        },
        {
            "review_text": "Kairo isn't a game for everybody. In fact, I wouldn't even say it was a game for most people. It's the type of game that takes a lot of patience to enjoy. You've got to really put yourself into the game, imagine that you're really in this place, seeing these things. The atmosphere and mystery are everything, and if that isn't your bag then you won't find enough to enjoy here when it comes to pure gameplay.  There are indeed puzzles to be solved, but most of them are quite simple. There are no controls beyond moving around and jumping, and there's no text or story to speak of beyond what you're observing of your environment. As is to be expected with these types of games, a lot of it is open for interpretation, including the ending. The graphics are solid, but quite simple and low-budget; most of the architecture is made up of blocks and flat planes.  If any of those things are deal-breakers, then don't even bother. But if you're into the pure sense of discovery that games can offer then I can't possibly recommend it enough. The term gets tossed around a lot, but it truly is more of an experience than a game. You've got to like abstraction, simplicity, and rich atmosphere (thanks in large part to the excellent sound design). You've got to be the type of person who gets a thrill from the simple act of booting up a game and not knowing exactly what to expect--of heading through a door and not having the foggiest idea of what you'll see.  There isn't much more to say about the game. If it's not your cup of tea, nothing else here will be relevant to you. If it is, then there's no need for me to explain what was great about it with more detail, because it's already obvious that you should play it. I mean hey, it's five bucks, and as I type this it's on sale for one whole dollar. Even if the story only lasts a few hours, that's a stupidly good deal for such an experience.",
            "review_score": "1"
        },
        {
            "review_text": "This game is enjoyable. It also fells unfinished.  When you fall out of the world, it spawns you where you where last touching the ground. That means ramps that push you right back to falling. Also, when I was exploring I noticed some untouched places. Like being able to see behind the   teleporter pad or what ever it is that gets you place to place,   and easely getting places you where never attended to go.  Conclusion: Fun, but needs improvments.",
            "review_score": "1"
        },
        {
            "review_text": "I very much enjoyed this game. I haven't played it for long but I feel the need to let others know to not be discouraged. It's like a dream.",
            "review_score": "1"
        },
        {
            "review_text": "Interesting little game. It walks a bit of a line between games like Antichamber, Myst and Fez, where the environment is all you have to direct you through the puzzles and the world. While the visuals and puzzles are interesting, I don't think they match up to the standard of those three titles. There are a few great ones scattered and some secret content hidden throughout, bringing a game that is overall pretty fulfilling for a puzzle gamer. The later optional puzzles in particular are really quite difficult and I was unable to complete most of them without external help, speaking as somebody who completed Antichamber and all but two puzzles in Fez without needing to do so.  The sound and visuals work well together to build a nice atmosphere; the screenshots on the steam store speak for themselves. The mystery in the game starts to build up quite nicely as the game goes on, although I felt left wanting more of a final payoff.   A decent title for 4 hours or so, but only worth getting if you have already played and enjoyed both Antichamber and Fez, as I would say they are better games with similar audiences. It is not easy to find competent examples of freeform world puzzlers like this.",
            "review_score": "1"
        },
        {
            "review_text": " NOTE: Somehow, the most recent updates to the game have made it incredibly buggy. In the stable release the main menu stays onscreen the entire time and I can't look left or right. In the DK2 Beta things are much more polished, but there are some sequencing glitches where I can reach the Garden without having completed a single puzzle. It's still worth a try if you can get it to work.   Kairo is not exactly the most complex game, but it gives you enough mental stimulation. Since it's only $6 right now, either go ahead and get it or wait for a sale. If you're on the fence about this one, I encourage you to read on fully.   FIRST OFF",
            "review_score": "1"
        },
        {
            "review_text": "This game makes me feel like I was inside the dreams of a weird engineer/architect. It is great how it can give you so much with so bare materials. You walk around huge constructions, trying to make sense of it. And then you realize you are the life inside these dead empty endless halls.  Kairo begins with a throne in the middle of nowhere. You're alone, there's nothing. But 'nothing' becomes something tangible, you begin to think about nothingness. You enter this nothingness, this void, and find many things there. Things buried, forgotten. Other thrones, kings, or perhaps other times of the same reign. But you are the king of a dead and empty realm. Are you alone. There is a world out there and you do not have access to it. There is life, and all you see are images, codes, machines, mementos.  Could the machines drive you back to life? Where does this light leads? Where does this flow leads? Where will you go? Who built it? For what purpose? Where are you really? Maybe in a hospital bed, waiting to wake up. I enjoyed every minute of this trip. I did not understand almost anything, but what I did was enough to make the trip worthwhile.  This game is about second chances. You move from a lifeless place to a garden with flowing life. It is really about coming back to life, so it is another game that helped me recover. It is amazing how this message is there without the need of any word. It is a memorable experience.  Positive points * A very trippy and weird experience. * Logical puzzles that you solve without any instruction.  Negative points * Very easy to get lost. * Looks empty and random. * The above are all part of the experience...",
            "review_score": "1"
        },
        {
            "review_text": "MYSTical journey through simple but wierd, strange and awesome locations. 'Must have' for all 'Myst like' adventure games.",
            "review_score": "1"
        },
        {
            "review_text": "Typically I don't mind the so-called 'Walking Simulators'. In fact I enjoy the genre quite a great bit. Unfortunately, Kairo is too cryptic for its own sake. There is no clue of any potential mystery to unravel, no bread-crumbs. I guess one may argue that a simple 'WTF?' can be considered a call to explore, but with barren art direction, simplistic level design, boring textures and lighting, an hour was about as much as I had patience for before uninstalling.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a good game for those who like peaceful puzzle games and actually doing it yourself not some facebook puzzle game. It's often cheap so enjoy.",
            "review_score": "1"
        },
        {
            "review_text": "This will be my first game review ever. And I think this is the first game I aver played that is worth writhing a review about.  Long story short; dham this game is awsome.  I never played a game that is so simple and has so much impact on everything. It is the first game that realy make you feal lost, alone and tiny. No game has ever done that for me. The graphics are not realy advanced but the atmosphere makes up for that. The 'music', but maybe you should call it back ground noises, give you the impression that you are on an alian planet.  If you ever have seen the movie 'cube' and liked it, then you also should like this game (minus the horror part). You are just left alone in an environment that you can not understand. By solving puzels je make your progress trough the levels, but you just don't know where you are going or why you are here.  My verdict 10 out of 10 and realy worth the money",
            "review_score": "1"
        },
        {
            "review_text": "Playing the game actually reminds me of 'Excerpts from Expert Judgement on Markers to Deter Inadvertent Human Intrusion into the Waste Isolation Pilot Plant', which you can google and peruse at your leisure. What they talk about on the site is: after we dump a bunch of nuclear waste somewhere and seal it off, how do we signal to future generations that they should stay away? Given that the half-life of the waste in question is 10,000 years, about as long as recorded history, this poses a significant problem: how do we communicate with people who will likely be nothing like us, and have a very limited understanding of our language, society and history; how do we tell them that they should not hang out in or excavate this nuclear waste dump? The expert judgers come up with a series of sculptural and architectural edifices, things that imply danger and will last millennia, and each one is more bizarre, desolate and brutal than the last.   A lot of what I see and do in Kairo feels like I'm interacting with someone's answer to that kind of question (although not about nuclear waste, specifically), which is extremely cool.   It doesn't hurt that the puzzles are very good. Gameplay is mostly about observation, testing interactions and figuring out how things work. It's kind of like Riven in that regard, and so far I haven't run up against any versions of classically lazy puzzles. Which is to say: no sliding tile puzzles, no finding the bauble and sticking it into the mcdooly, no one-on/one-off puzzles where you try to get everything to sync up as on or off. The first step of every puzzle is figuring out its rules and its pieces, and then trying to understand what the end goal is. It's all very seamless, very understated, and very rewarding.  Highest recommendation.",
            "review_score": "1"
        },
        {
            "review_text": "A nice first person puzzler. Simple graphics and challanging puzzles. Grab a copy when on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Possibly the weirdest thing I've come across. That's no bad thing. The level design is stunning and often makes you feel insignificant, the puzzles are challenging and require a decent amount of thought, but also aren't impossibly hard. But above all, the mystery in this game is it's strong point. It leaves you to think about what it could possibly be trying to show you, and never explains anything. That's why it's so interesting. For the price, this game is definitely worth your attention.",
            "review_score": "1"
        },
        {
            "review_text": "Great music, somewhat abstract puzzles (I definitely overthought some things towards the end), cool world, extremely cheap. definitely worth buying and playing through if you're a fan of stuff like antichamber for instance...but don't expect too much",
            "review_score": "1"
        },
        {
            "review_text": "The approach to wether to buy this game is fairly simple: Look at the screenshots. State how they breathe with atmosphere and probably form something like a desolate first person puzzle exploration game filled with mysteries. Play the video and confirm that assumption.  Well, I was sold and Kairo didn't disappoint at all. It's not a long game but then again it's not an expensive game either. If you enjoy the kind of mystical immersement games like Myst or Antichamber convey you will enjoy Kairo as much as I do. You get dropped in the game world with not a single clue whatsoever on where you are, why you're there or what you should do. It's up to your creativity and will to explore to find every secret this place has got to offer. Great music, great graphics and logical puzzlesolving. A mild spoiler but also a fair warning:   There's just that one puzzle that's really annoying and obtuse compared to the rest of the game (almost at Fez-proportions) and you'll probably just have to google that one or try to solve it at random. So if you stumble upon a yellow chamber with clocks, don't despair. Things will become better afterwards.  ",
            "review_score": "1"
        },
        {
            "review_text": "A wonderfully cryptic game. Kairo's world is a foreboding, mysterious and somewhat creepy place, yet one that will reside in your memory for a long time. The gameplay is largely based on exploration and relatively straightforward puzzle-solving, and the game does not take a whole lot of time to finish. Despite the apparently 'cold' exterior, Kairo actually builds to a poignant ending - if you have the time to explore all of the secrets and secret rooms, and can put the pieces together, you will be rewarded with an interesting implied narrative. Note that the game has no exposition at all, so it's all very subtle. The answer does not lie within the secret ending - it lies in all of the game.   Kairo is worth the time and the little money it asks, especially if you're into adventure and first-person puzzlers.",
            "review_score": "1"
        },
        {
            "review_text": "I wish there were more surreal/artsy games out there like this.",
            "review_score": "1"
        },
        {
            "review_text": "Explore a beautifully austere world and solve puzzles. A great study in how to build atmosphere using very few elements.  Fun Fact: the very first area is inspired by the architecture of the early 20th century 'Suprematist' artist Kazimir Malevich.",
            "review_score": "1"
        },
        {
            "review_text": "Well, that was probably the most engrossed I've been in a game for a while. It takes me right back to 'Driller' or its sequel 'Far Side' which, used 'Freescape', an early 3D, to evoke alien and unusual environments. Unlike those two early games, Kairo gives no backstory, and lets you attempt to figure it out for yourself. I love it...  The whole game is extremely minimalist in its level design, but extremely evocative of space and alienness. The aesthetics are a mix of old and new: blocky, simplistic but with texture mapping, reflections, fog, flames and more. The overly simplistic design may deter some who would dismiss the game as dated, but anything more complex would start to get in the way of the narrative.  It may not have been the designer's 'point', but the simplicity of the environment allows you to completely ignore it, and focus more on playing the game. And playing may not be the best definition either: experience, discover, enjoy are also great definitions for this.  The beginning makes it look like you'll be exploring ancient egyptian ruins (albeit in a dreamy world of whiteness), before abruptly turning grey and industrial-feeling. The game continues to take turns and each area feels and plays a lot different.  The only time that the simplicity works against the game is when an area is more complex than it looks. After traversing a dozen empty corridors, and passing stray cubes, you may not realise that another grey unmarked stray cube is, in fact, a trigger for some action, and be left puzzling for a while. Such 'difficulty through obscurity' is a hard one to balance right, to be honest, so I'll let it off, mostly.  I think the thing I enjoy most about Kairo is that it really plays with our preconceptions of what a 3d puzzle game is. They jokingly call one of their achievements 'Locked Door Puzzle' as a nod to other more mainstream games.  I really enjoyed playing Kairo, and then with the help of a cheat to find all the secrets.. A great minimal game. If you do decide to play it, don't try and speed-run it. although it looks shallow and simplistic, there are a lot of hidden (or just obscure) tidbits for the explorer. ",
            "review_score": "1"
        },
        {
            "review_text": "Great break from all the regular commercial gameplay! Chill, explore, discover new areas and puzzles while flowing in the realm of Kairo. I randomly stumbled upon this game and I loved every minute playing it and greatly recommend it if you're looking to try a different kind of puzzle game!   +  Amazing puzzles  +  Relaxing environment  +  Mystic vibe  +  Great minimalistic storyline (or lack!)  +  Easy Achievements  +  Trading Cards (Emotes/Backgrounds)  -  Short  -  Label the MAP button     Personal Ranking:   7/10 ",
            "review_score": "1"
        },
        {
            "review_text": "Let me first say that if you are expecting Kairo to be something along the lines of Myst, Riven or, for that matter, any challenging puzzler, do not buy. The puzzles lack depth, complexity, and do not require deep thinking in order to discover the solution. They feel like an afterthought and I think the developer intentionally designed them so to make the experience in Kairo more fluid.   As you may have read, Kairo is a minimalist exploration game (though it's more of an abstract art gallery simulator). Meaning you can only walk, run, and jump. Your interaction with machines is restricted thus partially explaining the lack of depth in some of the puzzles. No in game button prompts. Nothing out of the Kairo's context distracts you, save the notification that informs you've solved a puzzle. It's all for the purpose of pulling you deep into Kairo's world full of abstract architecture and objects with strange behavior that apparently defies physics. The fine grain filter and errie soundtrack assist in attempting to build an absorbing atmosphere.  Except I felt a disconnect for some reason. None of the abstract architectures (nor the atmosphere) evoked any feelings. No texts located anywhere to provide some backstory. Perhaps (and I'm not sure) some story could be deciphered (or interpreted) but the game gave me no reason or motivation to invest the effort into it. Even during the conclusion when Kairo's purpose was hinted at, no tingle of emotion.   In my opinion, you can approach this game like you approach a strange dream right after waking up, either invest the energy to interpret it and derive personal meaning or instantly forget about all the vague disjointed images. If you're the former or if the idea of an abstract art gallery simulator sounds appealing, then maybe Kairo might be for you.   However, if you are looking for something with cohesion and a game that gradually unfolds a story with clarity (or a challenging puzzler as talked about in first paragraph) then I would defintely pass this one up.",
            "review_score": "-1"
        },
        {
            "review_text": "A very dry game.   The puzzles aren't very rewarding, they leave you with a feeling 'of oh thank god thats over' when you complete them which only leads you into a new 'oh ♥♥♥♥ this thing' situation.  The atmosphere is . . . geometrical. I think they were trying for a mysterious egypt alien feel or something with the constant boxes etherial sounds though it overstays it's welcome very quickly and you are then left with a textureless environment with backround noise switching from ambient to blairing speaker feedback depending on where you are.   There is no story and I couldn't force myself to finish the game after the first hour and a half so I will never know if there is a reason I was even doing these almost mindless tasks. But as far as I played there wasn't a single semblence of dialouge or story.  Overall, for a game produced by one man it isn't the worst thing to ever come out, but the fact that it WAS entirely coded by one person should key you in on the quality of the product. Compare it to any other game and it is terrible.  You will not be happy if you spend money on this game, don't buy . . . seriously, just don't.",
            "review_score": "-1"
        },
        {
            "review_text": "I am a big fan of this games atmosphere but close to 1h in to the game I find no dirrection of what to do, where to go, in what order to try and solve the puzzles. Why am I in this world, is it a dream? What is the end goal? Could use more dirrection, somewhat interesting puzzles but the overall aspect of the game can get frustrating.",
            "review_score": "-1"
        },
        {
            "review_text": "Complex, Surreal, and Haunting atmospheric puzzle game which takes player to explore and engage player to fix the broken world. Not just the impressive world design, but room puzzles are pretty challenged and make you think in logic... And beautiful musics.  I highly recommend for people who interest in abstract game and fun puzzle to deal.",
            "review_score": "1"
        },
        {
            "review_text": "Wow, coooooollll... far out man!  Yeah, I bought this game, played around with it, and enjoyed exploring the spaces within. I didn't get very far, I just wanted to look at it. I'm satisfied with it. You can actually try to complete the game if you want, but... it's all good, man.",
            "review_score": "1"
        },
        {
            "review_text": "What the hell did I just play? Equal parts weirdness, exploration and creepy atmosphere. My first attempt at playing this was about 10 minutes of wandering around aimlessly thinking, 'Huh?' Then I realized there was some structure to the game and I attempted to figure it all out.  I failed.  So I played again, with a guide. Even though I didn't necessarily play it entirely by myself I still appreciated the ambiance of the finished product.   If you bought it for the Cards, you might as well play for the achievements too. They're pretty easy and the game is worth the run through.",
            "review_score": "1"
        },
        {
            "review_text": "Super simple, not-impossible puzzles, secret added bonus puzzles and secret endings. Recommended! Hours in game depends on how completist you are, I suppose. I liked this one :)",
            "review_score": "1"
        },
        {
            "review_text": "-Don't do drugs  -3 doritos out of 5   -would be a high egyptian man again",
            "review_score": "1"
        },
        {
            "review_text": "Great game!",
            "review_score": "1"
        },
        {
            "review_text": "Quite ok, but not recommending this one though. When proceeding throught the game most of the time I felt like playing a demo or sth. Few of the levels gave some nice impression, music also seems to be ok - but besides those it's still not worth much of attention. Better luck next time.",
            "review_score": "-1"
        },
        {
            "review_text": "It didn't hold my attention. The puzzles for me were too simplistic and tedious to get through. The graphics were as I expected them.",
            "review_score": "-1"
        },
        {
            "review_text": "I tried to like this game. I really did. Time is too precious to spend any more here.",
            "review_score": "-1"
        },
        {
            "review_text": "I spent like less than a dollar on this, and I still regret it.",
            "review_score": "-1"
        },
        {
            "review_text": "Cool puzzles, but you may get lost easily because the game lacks information and directions sometimes",
            "review_score": "1"
        },
        {
            "review_text": "Neat little puzzly exploratory type game. I rather enjoyed the atmosphere that the game presented, and while it's not a particularly long experience it's certainly one I enjoyed. I don't really know what much there is to say about this one. It does what it wants to do well and doesn't overstay its welcome. Some people may be bored by it, I suppose, but. Oh well.",
            "review_score": "1"
        },
        {
            "review_text": "I ran around aimlessly, solved some easy puzzles by jumping into walls, got totally confused what I am doing and why I am doing it, read hints, jumped into more walls, and finally completely lost interest.",
            "review_score": "-1"
        },
        {
            "review_text": "A thoroughly challenging and complex puzzle game. Kairo's great sound design and exploration based gameplay makes for a very relaxing abstract experience. This isn't for the average walking simulator fan though, the puzzles are often quite complex and sometimes cryptic. If you're into hard puzzle games give this one a go!",
            "review_score": "1"
        },
        {
            "review_text": "I can't bring myself to finish it. After playing Naissance, it feels like a version of that game with a less interesting aesthetic and less interesting puzzles. Additionally, Antichamber would be a better puzzle-focused alternative. Heck even Portal 2. That genre of game isn't really quite for me, but I can enjoy the really good ones like Antichamber and Portal. This one, just not enough for me.  On the plus side you can / will probably find this game for cheap. I think I paid a dollar for it.",
            "review_score": "-1"
        },
        {
            "review_text": "This game seems to be a series of poorly constructed mono-color 'vignettes' with no level of story or coherence.",
            "review_score": "-1"
        },
        {
            "review_text": "It tries to be Myst but is utterly disappointing.",
            "review_score": "-1"
        },
        {
            "review_text": "It's a trip, for sure.",
            "review_score": "1"
        },
        {
            "review_text": "in this puzzle game you have to find out what you are supposed to do which might be a good thing for some people but I dont like games like that",
            "review_score": "-1"
        },
        {
            "review_text": "Good:  * Sounds and music make a good atmosphere  * Only costs 0,70€  Bad:  * Very boring and bland puzzles  * Most of the gameplay is just walking around in huge rooms  * Not visually appealing",
            "review_score": "-1"
        },
        {
            "review_text": "save yourself the 10 cents and memory space. Just go play Yume nikki instead",
            "review_score": "-1"
        },
        {
            "review_text": "Please make this more comaptible with 3D Vision! Anyways, I have enjoyed what I have played.",
            "review_score": "-1"
        },
        {
            "review_text": "Walking Simulator, Exploration and Puzzles.  I can't actually recommend it or not, there nothing like this game, some are comparing it to Antichamber, but they are totally different. See some videos about it, will help you decide to get it or not. it has its unique art style and atmosphere, but not everyone will like it. I think The Talos Principle will combine elements from both games in addition to its own story and art.  I just tried Mind: Path to Thalamus, get it instead of this, it offers more.",
            "review_score": "-1"
        },
        {
            "review_text": "Didn't like her lads, she's just not the lady for me. She's too, bare, if ye know what I mean.",
            "review_score": "-1"
        },
        {
            "review_text": "This is a terrible game. The graphics could cause seizures, there is no objective markers or anything to see where you have been, the puzzles are too easy... not worth your money.",
            "review_score": "-1"
        },
        {
            "review_text": "I bought this on sale for less than 1€, but I'd happily have paid the full price for it. it's an extremely minimalistic game, don't buy it if you absolutely need captivating plots, high-end graphics and complex gameplay or you'd be disappointed. the game is a fascinating journey through a beautifully designed surrealistic world. a really fitting ambient soundtrack adds a lot to the experience. if you've ever played Hiversaires and enjoyed it you'll really like this game as well (if you haven't go and play it). despite the 90s-like 3d graphics I was more than once amazed by the haunting and eerie scenarios and architecture of the game. along the journey you have to solve puzzles to proceed, which are decent, full of satisfying eureka-moments and quite never frustrating. it's a pretty short game tho, it took me less than 3 hours to get to the final credits, but still there were a couple of optional puzzles I didn't solve and some secrets I discovered that suggest there is something more if you find them all, so I might get back to it one day. one last note: most of the negative reviews complain about the lack of a plot and clear instructions. well I liked that instead, it's a plot device itself that adds to the unsettling feel of the game. you're thrown in without any explanation and are left with more questions than answers. picture it as a dream, no one is there to tell you where you are, what is happening and what you have to do, you just accept it and go on, and it's beautiful that way.  overall solid 7.5/10, would play again.",
            "review_score": "1"
        },
        {
            "review_text": "Quite possibly one of the more abstract puzzle games I've played. No direction given, and some very strange puzzles to solve just by observing the environment. Luckily there are a few puzzles you don't have to solve to complete the storyline (whatever that was exactly). But I did rather enjoy the atmosphere, and found it rather relaxing.",
            "review_score": "1"
        },
        {
            "review_text": "Lovely, quiet, abandoned, Myst like game! Definately recommend",
            "review_score": "1"
        },
        {
            "review_text": "It seemed really boring at first, it's not boring (trust me).It's really good, it has it own ways, kida creepy. Like a puzzle game it's quite hard, even though there are hints! If you played 'Antichamber', you have to play this!!!",
            "review_score": "1"
        },
        {
            "review_text": "Graphically Facinating",
            "review_score": "1"
        },
        {
            "review_text": "What has happened and why is the world so empty..? That is the main question that you have to ask yourself as disturbing images and realizations are made clear the deeper to delve into this world. If you love puzzle games that make you think and give you a good challenge, then you're going to love Kairo~!   The game is hauntingly beautiful, in a simplistic way and I love all the different types of puzzles they incorporated into the game. And I’ll give you a hint… don’t miss a step in looking around, you could miss something very important~!  I bought on sale for 1.49$ and I don’t regret it. Actually, I feel like I got a great deal for such an interesting game~! I’d pick it up if this type of game is your cup of tea. ",
            "review_score": "1"
        },
        {
            "review_text": "A really chill atmospheric puzzler. Paid another 5 bucks to have it on my phone because why not? It was a good choice, this really is a fun game! :D",
            "review_score": "1"
        },
        {
            "review_text": "An interesting game - I actually like games where the controls are limited as it doesn't leave me thinking, 'Was I supposed to pick up Item A to combine with Item B and use it on Location C?' The only question I kept asking myself was 'Who poured all this concrete?'",
            "review_score": "1"
        },
        {
            "review_text": "This first-person puzzle game relies on a minimalist, surreal environment to pull you in...but boy does it deliver. I think if you liked Myst, you'll like this game...wandering around a vast, abandoned landscape fiddling with technology you don't understand. But the game's not about the fiddling...it's about the wandering and the discovery (you'll know what to fiddle when the time comes). If you like exploring and the visual style appeals to you (watch the video) then definitely pick this up.  I'm going to come back and flesh out this review more, but for now, I want to make a note of the fact that the coolest thing about Kairo, for me, was the ambience of the environments. It was quite Myst-like in that it created this constant sense of wonder at the surreal landscapes.",
            "review_score": "1"
        },
        {
            "review_text": "Kairo is a beautiful and enigmatic game when your purpose is never explained, and the only thin that push you forward is the vague notion of progression.",
            "review_score": "1"
        },
        {
            "review_text": "Okay, let's get one thing out of the way first: this game does not look good. The trailer above kinda oversells the graphics — they're not  minimalistic , they're  cheap . That being said, everything else about Kairo is great.  Distant cousin of Myst, this game is comprised mostly of puzzles. And there is a compelling diversity in these: some are very easy, some are very difficult; some totally straightforward, some mind-bendingly abstract; and of course everything in between. This makes the progression always enticing and never boring.  The level design is very cool despite the poor graphics and each level has its own unique feel, the whole game being very 'atmospheric'. This is brilliantly reinforced by the marvelous sound design, with a really, really awesome music that transported me from puzzle to puzzle in a dream-like state.  Thanks to all these strenghts, Kairo manages to be at the same time fun and relaxing. It is a journey, really, in a land full of mysteries and secrets, where lots of questions are raised and no explanations given — you make your own conclusions from the scarce clues given along the path.  I have no idea how to grade it out of ten, but I am positive that I'd recommend it in a heartbeat to pretty much anyone. The only major flaw that I would point out is the absence of V-Sync which allows some MASSIVE tearing to occur. And the Field of View is rendered in layers, which looks kinda awful. But other than that, well... What's not to like?   You like puzzles? Get it. Like 'moody' games? It's a good one. Like quality OSTs? This one's perfect. You like Myst? Don't hesitate!  There even is a skeleton hidden somewhere. Spooky!",
            "review_score": "1"
        },
        {
            "review_text": "If you enjoy like wandering around in cool environments and solving challenging yet simple puzzles this game is for you. It is exactly what it says in the description, and doesn't try to be anything else. It can take awhile to 100% it though, since one of the extras is bugged (hence, why I spent so long on it trying to figure out how to get the last achievements). Other than that though it was an enjoyable experience if you like atmosphere, puzzles, and a vague, interpertive story.",
            "review_score": "1"
        },
        {
            "review_text": "Explore, understand and find it yourself, this is what game is all about. Idea behind the game is great; although graphic is not so great but it's enough and along a nice and well-designed soundtrack it let you to think as you like in any environment.  I suggest it for who like mysteries, not good for action players that only like CoD. I say 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "takes a little while to get really involved, but it is really immersive and fun",
            "review_score": "1"
        },
        {
            "review_text": "This game is the sound itself.",
            "review_score": "1"
        },
        {
            "review_text": "I would describe this game as 'uninentionally scary'. I began playing the 'main story', so to speak, in the afternoon and finished it later at night. And by the end of it I was genuienly spooked at each new level. The landscapes are big and epic, disturbingly lonely and slighly degraded. You feel as if you're walking inside someone else's dream, and at times, their nightmare. Not a scary, jump-scare nightmare. But one of those dreams that, when you wake up you tell yourself: 'Phew! I'm glad I'm back home at last'. In short. This was a very... interesting experience. I would mostly recommend it to those who want to play a small game that makes you feel very different emotions than our regular puzzle games.",
            "review_score": "1"
        },
        {
            "review_text": "Good puzzles. Some was easy, some requied time to think, some (really hard) I left unsolved (yeah, I gave up easilly) To proseed the main game scenario, you have solve middle complexity puzzles, you don't have to solve them all (that's a plus for the game). Good soundtrack. Well, sometimes I felt a lack of it. In such cases, I usually turn on something on my own (ambient would be appropriate here), but not this time. The Silence. Silence of dead world. Only ruins of forgotten ancient civilization. Only you and your thoughts. Sometimes you can here someone voice. Man repeating 'zero' or counting in russian 'five, six, seven'. But these voices also dead. Just echo of this long dead world. Good atmosphere. All that place remind me of piramids. Acient civilization, secret knowledges way beyond ours. But devistated world. Looks like one of scenario of human race. If my memmory correct, kairo translates from Japanese as 'going back home' or smth like that. But you here all alone. In world, that was prosperous, rich, just like ours, but then... wars... doesn't seems like that... they learn lesson of war, I think... devastation... may be it happend with human race.   Summary   Puzzles + atmosphere + depression + creepy. Not masterpice, but totaly worth one long night on your own. And tottaly worth it's money.    P.S. Sorry, I know my review a bit... a lot fragmented. Just sometimes hard to put words logically, esspecially on alien to you language ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good puzzle game, considering also its price tag. If a fan you can give this a try",
            "review_score": "1"
        },
        {
            "review_text": "A great game. It feels like it is a spiritual successor to the original Myst in the way it make you feel isolated and small in a mysterious world. The puzzles are sufficiently difficult as to be rewarding to solve, but they are not as frustratingly vague as they can initially appear. All in all, it is a short but enjoyable game to play.",
            "review_score": "1"
        },
        {
            "review_text": "what a trip",
            "review_score": "1"
        },
        {
            "review_text": "Kairo is a game that holds a very special place in my heart. It's an almost meditative experience. It has this Myst esc quality of loneliness that adds an faint errie feel as you explore this giant place alone. It's really not a puzzle game in my book but just an interactive experience. There diffenetly is gameplay though. Some of the puzzles are frustrating and running between map to map is sometimes tedius, but I would not hesitate to reccomend this.",
            "review_score": "1"
        },
        {
            "review_text": "This game made me feel like I was in an Arthur C. Clarke novel, exploring weird, alien archetecture. The atmosphere is fantastic and the design is excellent. Everything (including the interface) is elegant and stripped-down. I was surprised at how many distinct, memorable places could be made from such simple building blocks. The puzzles are engaging, but not very difficult; for me, the game was paced exactly right, with no area wearing out its welcome before I was able to move on and see something new.",
            "review_score": "1"
        },
        {
            "review_text": "Quite cool in its own minimalistic way",
            "review_score": "1"
        },
        {
            "review_text": "Monoliths, glyphs, runes, buttons to step on... Kairo.  For every step you take in this lonely world, you find yourself seemingly stuck and lost within yourself as well. Film grain covers your field of vision as you navigate the towers, solving a wide plethora of puzzles, from simple navigation of a simple maze to interpreting a star map just to open a door to running on treadmills, Kairo does the puzzle genre justice by infusing complex and mind-boggling puzzles towards a simplistic, minimalist world. The colours are beautiful, the gameplay is relatively solid (although I personally find the movement a little too sensitive) and this is really immersive by itself (if you play in a dark room with headphones).  A drawback for me personally was that I found myself getting lost most of the time, that I was unable to have a good view of the puzzle I'm trying to solve. Like a rat in a maze, I could not see the big picture of the puzzle and I had to keep walking in circles trying to figure out what I've done, even resorting to sketching out some rooms on a piece of paper and drawing the various interactive elements on the paper so I can figure out what in the world is going on. It does interrupt the flow of the game for me sometimes and it was a little distracting to the overall feel of the game.  In short, despite the few rough edges of this work of art, Kairo is really a beautiful gameset (with its fair share of really, really creepy elements and depictions here and there), really meant for the casual player to play and enjoy this surreal world, while unraveling a terrible tale that led to this place. If you're a puzzle nut and you enjoy creepy, lonely worlds, Kairo really is the place for you to be.  Eurogamer has succiently highlighted the deep spine of Kairo. 'Kairo is mysterious and elegant and powerfully distinct. Like Fez and Minecraft, it will work your way into your dreams if you're not careful.'  Play at your own risk, because Kairo does leave impressions in your mind as you play it, with the wide rooms and chilling images (when you stumble upon some seemingly 'dead ends') and huge, huge glyphs.  To this casual gamer's opinion: Kairo: 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Oh Kairo, you're such a strange little piece of minimalistic nothingness. I payed $1.49 for the game on sale and thats exactly how much i feel like its worth. I enjoyed playing the game but at the same time when I was playing I just wanted to get all the achievements and be done with it. The puzzles were fun, the art was beautiful but the game lacked reasoning &amp; excitement. Don't buy for full price.",
            "review_score": "1"
        },
        {
            "review_text": "An incredible puzzle game. The ending makes the entire ambient, vaguely unsettling experience of a trek worthwhile. An absolute steal for $5.",
            "review_score": "1"
        },
        {
            "review_text": "This game feels like a dream, with a haunting soundtrack and an atmosphere of mystery that makes the hairs on your back rise even on the warmest summer day. Puzzles are easy enough, so you can just sit back and enjoy the journey that it takes you on. Shame it isn't a longer experience, but in line with its minimalistic graphics it has all the core gameplay and none of the bulk.",
            "review_score": "1"
        },
        {
            "review_text": "This a decent puzzle/thoughtful game that's good to wait for a steam sale. It's not difficult (and in fact has a hint system) and probably a few hours long.",
            "review_score": "1"
        },
        {
            "review_text": "A quietly unnerving game filled with interesting and rewarding puzzles. I very much enjoyed exploring the environment and the hint system gently nudges you in the right direction to keep the puzzles from getting frustrating. It hints at a story but the ending is definitely open to interpretation. Secrets are scattered throughout the game, but the secret ending is a joke that's not really worth the work unless you love 100% completing games.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game with decent puzzles. Environmental story telling is a new thing for me and it was great. The subtlety of this game is fantastic.",
            "review_score": "1"
        },
        {
            "review_text": "This is the most interesting time I've had playing a game that I totally didn't understand once it was finished. Granted, the theme is subtle and I *think* I get what the story was saying but there's not a lot there for clarity.  Fortunately, the game is highly engaging and very entertaining. The puzzles were unique and at times exasperating but well worth it. I probably logged 6-8 hours into the game and it was a lot of fun. If you like puzzles, this is the game for you. Just don't expect your hand to be held anywhere!",
            "review_score": "1"
        },
        {
            "review_text": "“It seems to me there is so much more to the world than the average eye is allowed to see. I believe if you look hard, there are more wonders in this universe than you could ever have dreamed of. It's colour! Colour that holds the key! I can hear the colours, listen to them. Every time I step outside, I feel nature is shouting at me. Come on! Come and get me! Come on! Capture my mystery!”  – Vincent van Gogh to the Eleventh Doctor",
            "review_score": "1"
        },
        {
            "review_text": "Decent puzzler. Simple design that probably benefits VR users the most. Some of the levels, sounds, and atmosphere build tension as you explore. If you like puzzle/exploration games this is worth a look for the price.",
            "review_score": "1"
        },
        {
            "review_text": "IMPORTANT: When you hit the normal ending, wait for the credits to play out. They're not long.  Pros: - Puzzles become interesting when you have no 'hand' or 'activate' controls. By limiting the player to mere movement controls, old puzzles feel fresh, and there's an extra sense of accomplishment with even fairly simple puzzles. - The environment's minimalist polygon theme manages, surprisingly, to stay varied, interesting, and even evokative throughout the game, contributing to the theme of 'strange and yet familiar' that pervades. - Difficulty to normal end is low, difficulty to secret end is high. - No penalty for exploration, experimentation, or taking your time. - Overall, definitely enjoyable.  Cons: - The 'story' aspect is a little too vague. You paid $5, folks, this ain't Myst or Portal. While there are enough 'clues' that a player can vaguely put together a plot (and considerably more blatant clues as rewards for solving secret puzzles), there's plenty that's just left to imagination. - The mechanic that resets you to a safe ledge can glitch considerably, leaving you in a fall-to-your-death loop, though this can be solved by exiting the game and reloading. - One of the final secret puzzles is actually impossible to solve on your own. Your game will have 1/5 of the solution, and which fifth is chosen at random. So you're either going to need lots of friends, or cheat and look at a walkthrough.  Final Note: Don't take my playtime as a good guide to the runthrough time of this game. I got irritated and consulted a walkthrough for two of the secret puzzles and half the rune locations.",
            "review_score": "1"
        },
        {
            "review_text": "Kairo is... Interesting. The puzzles were pretty mild and hunting for the runes were an added incentive to explore the bizarre world. The ambient sounds/music added plenty of atmosphere (headphones a must!). Was there some deep meaning behind this game and the imagery/sounds in it? The game's description said there is, but it was beyond me. Though after completing, I don't feel very compelled to research the meaning either.  My two complaints was that I was holding sprint for pretty much the entire game, and I didn't have a Rift to get the full experience, haha!  For sub $5, I think this is worth checking out if you're in the mood for something different.",
            "review_score": "1"
        },
        {
            "review_text": "This game is great combination of storytelling, music and level design. Gameplay is very easy, but some of puzzles not easy at all.  I like it!",
            "review_score": "1"
        },
        {
            "review_text": "Oculus dk2 support please!",
            "review_score": "1"
        },
        {
            "review_text": "Lifechanging. I don't know how, but this changed my life; I am really surprised about how great this was for the money. I was baffled and amazed at the same time. I recommend this for anybody looking for a deep experience that involves thinking and intelligence. All in all a great endeavour of colour and wonder.",
            "review_score": "1"
        },
        {
            "review_text": "Nice indie game.A surreal andventure with easy riddles.The raphics are poor but its a fun 2 hour adventure",
            "review_score": "1"
        },
        {
            "review_text": "It makes you feel alone, as if in a part of space where only you and the world exist... well untill you find a skeleton, then you know you're probably gonna die.",
            "review_score": "1"
        },
        {
            "review_text": "ive played 25 mins so far. It's relaxing, simplistic and a puzzle game. i already love it! will play it again when im not so damn tired :p",
            "review_score": "1"
        },
        {
            "review_text": "Lovely game with some incredibly cryptic visuals and music.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a giant mystery. I had no idea what was going on half of the time, or why they made certain areas the way they did. I think it's a good game, with a nice soundtrack and smooth controls, and it's definitely something to check out.",
            "review_score": "1"
        },
        {
            "review_text": "Though lack of story on whats going on, which it never did explain anything and just get you right in the gameplay without any reasons or such. But, the puzzles are entertaining and theres a secret ending if you happen to complete every puzzles in the game. It has some strange feeling when playing this, its actually worth playing.  Keep noted there is not really much of action, just puzzles.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: - static - number stations - Einstein's portrait - gongs - Plinko - the space shuttle - camping - amino acids  Cons: - monophobia",
            "review_score": "1"
        }
    ]
}