{
    "app_id": 233290,
    "name": "Murdered: Soul Suspect",
    "release_date": "2014-06-05",
    "developer": [
        "Airtight Games"
    ],
    "publisher": [
        "Square Enix"
    ],
    "platforms": [
        "windows"
    ],
    "required_age": 16,
    "categories": [
        "Single-player",
        "Steam Achievements",
        "Full controller support",
        "Steam Trading Cards"
    ],
    "genres": [
        "Action",
        "Adventure",
        "RPG"
    ],
    "tags": [
        "Detective",
        "Adventure",
        "Horror"
    ],
    "achievements": 48,
    "positive_ratings": 8658,
    "negative_ratings": 1647,
    "price": 19.99,
    "description": "MURDERED: SOUL SUSPECT™ takes players into a whole new realm of mystery where the case is personal and the clues just out of reach, challenging gamers to solve the hardest case of all… their own murder.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/233290/header.jpg?t=1503075903",
    "minimum_requirements": "OS: Windows Vista 64bit with Platform Update for Windows Vista Processor: High-Performance Dual Core CPU or Quad Core CPU Memory: 2 GB RAM Graphics: AMD Radeon™ HD 3870 512MB RAM / Nvidia GeForce 8800GT DirectX: Version 10 Storage: 12 GB available space",
    "recommended_requirements": "OS: Windows 7 64bit / Windows 8 64bit Processor: AMD FX-8000 series or better / Intel Quad i7 Core CPU Memory: 4 GB RAM Graphics: AMD Radeon™ TM R9 270 or better / Nvidia GTX 660 series or better DirectX: Version 11 Storage: 12 GB available space",
    "reviews": [
        {
            "review_text": " Murdered: Soul Suspect",
            "review_score": "1"
        },
        {
            "review_text": "I am here against all odds to recommend this game to everyone. You will like this game if you are like me and loved reading those detective novels.    The Good",
            "review_score": "1"
        },
        {
            "review_text": " Murdered: Soul Suspect",
            "review_score": "1"
        },
        {
            "review_text": "So you investigate your own murder, your investigation skills are enhanced since you're a ghost ( in a very nicely done way)    This game has amazing story worth making it a movie    The investigation scenes are brilliantly done makes you think, connect things, follow leads and  reveal the story in an interesting way, and they're not that hard     Graphics are good     Sounds are not bad   This whole ghost thing mechanism is done in a very appealing way, I like to see more games like that.  My problem was with the 100% ashievements, codex are a ♥♥♥♥♥ for instance, and if you finish the game without getting all the ashievements you need to start all over again, and it would be nice if they told you how many collectibles left in a certain area so you know when It's done and move to another.  Such a great game.",
            "review_score": "1"
        },
        {
            "review_text": "        YouTube™ Video:  Murdered: Soul Suspect Review&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "You can play as a cat and meow at things.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "There are many flaws with this game, still I quite enjoyed it (at a discount purchase). - There are way too many collectibles (nearing 200). You need to collect a random number of things to unlock a story (e.g. 14 chainsaws). That's way too many and after collecting the necessary collectibles in the first section of the game I never did it again. - Sometimes you need to collect clues and the prompt for them are very precise. You need to angle the camera in just the right way which is very annoying for a game that's focused on that. - You need to battle demons in this game. It's by far the worst part which consists of teleporting between safe spots and trying to sneak up behind them. When I had the opportunity, I just ran by them to enter the next section. - It can be hard to find your way. This is partially because you can just walk through walls which is disorientating. At a later point in the game you learn to teleport which makes it even worse. - There are stealth section in this way where you need to guide your human partner while distracting guards by ringing the phone and other poltergeisty stuff. I didn't mind this is as much since it's easy and you don't seem to be able to fail (which I consider a good thing). - You sometimes posses a cat and run through vents because... you're in Salem? - There are (near) instant death traps and you die so incredibly fast, it's kindof funny? They just consist of black spots on the ground and are easily avoidable.  I enjoyed this game the best when I ignored the side stuff and just focused on the main case where you're trying to solve your own murder. I bypassed the demon battle sections as best I could. The cat scenes were ok but unnecessary. The stealth sections where you guide your partner was kindof fun. The main meat was the investigation stuff where you collect clues and try to figure out what precisely happened at the crime scene. I completed this game in 5 hours which is probably not worth it at full price but it was for me and I found that the story didn't drag.  Go buy it in a sale!",
            "review_score": "1"
        },
        {
            "review_text": "A very interesting and captivating game. At first i didin't like the fact you play as a ghost but after a while was fun and i really enjoy it.  What i like: Solving your own death? hell yes! The voice acting is just great i love it. Killing demons is fun. I like killing demons :) Overall good graphics and sound effects. The story was cool.  What i hated: Repetitive dialogue. Most npc's are just copies.",
            "review_score": "1"
        },
        {
            "review_text": "Ronan is a criminal-turned-cop who is killed by the mysterious Bell Killer. Playing as Ronan's ghost, investigate a series of crime scenes (sometimes with the help of teenage medium Joy), searching for identity of the killer. Many supernatural elements come into play – ghosts, witches, demons – and some flashbacks of the witch trials are pretty gruesome (drowning, burning, hanging).   As the investigation progresses, you'll explore a graveyard, an apartment house, an old mansion, a police station and of course the obligatory asylum level. While the game world is small, it is open, with the ability to just wander around the town of Salem. It's a gloomy place – the game occurs entirely at night – but is well-dotted with NPCs and collectibles. Obtaining collectibles can unlock other stories (usually brief, narrated cut-scenes), and some NPCs will provide side-missions. There's a decent amount of stuff to do, but most collectibles were easily found as I explored the town or a level.   Investigations require exploring a a crime scene, finding evidence (“Press E to analyze”) and sorting through the collected evidence (“Press Q to conclude the investigation”). Walking (or later, teleporting) around as a ghost feels fun; Ronan can walk through walls, possess people (mind-reading), and turn on random stuff to mess with the townsfolk (poltergeisting). Especially cool were the impenetrable “ghost walls” from past times that can block Ronan from exploring – or even provide new hazards (watch out for the ghost train!). Oh, and you can possess cats, too. This is actually crucial to progress through several stages of the game.  The demon sections, though, dragged the experience down a bit. Demons will sometimes spawn after completing an investigation. Their existence does have a crucial part to play, and they're easy enough to defeat with a little patience. Given that this is a supernatural tale, it would be rather weird if demons of some kind weren't in the game, and having some stealth sections added some variety to the gameplay. But after a while the demons became annoying distractions from the story.  And the narrative is where Murdered: Soul Suspect stands strongest. There is a lot of backstory to be found about Ronan and his wife (via collectibles). Sometimes collectibles are merely annoying, but they are worth pursuing here. Jason Brooks (as Ronan) and Cassidy Lehrman (as the medium, Joy) provide stand-out vocal performances. The graphics (Unreal 3) are great – murky and dark. Jason Graves' score provides a classic horror-story undertone. Murdered: Soul Suspect is a well-crafted detective game with a few quirks that holds its story aloft as its best attribute. If that sounds good to you, then go ahead and get this one.",
            "review_score": "1"
        },
        {
            "review_text": "Despite having its flaws,  Murdered: Soul Suspect  is quite possibly one of the most enjoyable single-player games I've played this year.  The Pros: · A unique story that feels like a combination of Silent Hill and L.A. Noire, and the beginning does a great job of introducing you to its atmosphere.  · You start at the point where Ronan O'Connor (the game's protagonist, of course) starts the hunt on his murderer, the Bell Killer. This makes you feel like you know as much about the afterlife as Ronan himself does and creates a sort of connection, right from the get-go. · The town of Salem is pretty small, but its yours to explore... and it's worth exploring. Tons of side missions and collectibles can be found in Salem, and the eerie mood that constantly lingers around really immerses you into Ronan's role. · The atmosphere is incredibly unique and satisfying. The ghostly white glow around certain object make the bridge-world connect with the world of the living. Seeing the flickering souls of dead children sitting next to a swing or a dead corpse dangling from a tree by its neck is oddly disturbing and makes you feel uncomfortable, which a bridge-world should. · Pretty cool characters. Ronan is your typical rebel-turned-cop tough guy, but his tattoo's reflect his life and the sins in it, and the detail to him is quite impressive. Even though he's partially see-through (because you know, he's a ghost and stuff), the orange bullet holes give Ronan a distinctive look from the other ghosts in Salem.  The Cons: · The mechanics feel a bit underused at times. As a ghost you could be able to do so much more, like possessing and controlling others for example. Sure, you can influence people and read their minds and control a cat (10/10), but it limits the player. · For a detective game, it doesn't really require too much thinking. You have to find clues and connect the dots (sometimes those dots connect in an unlogical way), and that's basically it. · The NPCs are mostly the same. Salem doesn't have many people walking its streets, but two of the same people might be sitting a few feet from each other. Plus, they have the same thoughts, which is weird. Like freaky weird. · The combat is there, but its simplistic and repetetive. You hide in lost souls, sneak up to a demon and quickly rip him apart. It's satisfying and it even feels as if you're helping those tormented souls, but it's just too much of the same.  The Visuals: · Most of its atmosphere comes from the visuals. Ghostly white silhouettes and detailed environments may not look next-gen, but they're stunning none the less.  Final Verdict: ·  Murdered: Soul Suspect  sure has its flaws, but it's a unique and highly enjoyable experience and easily one of my favorites of the year. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Great games but should do more scary Demon not screaming Demon Kappa",
            "review_score": "1"
        },
        {
            "review_text": "Murdered is a detective game with unique gameplay ideas such as the ability to walk through most objects. It's set in Salem, which is the American city known for its brutal witch trials, and this historical aspect is fully incorporated into the game.  The script writer clearly has done a great job because the game has you hooked until the very end, making you want to figure out what's to happen. The main characters are explored in depth throughout the game, with their stories and relationships being interesting and relatable, which can easily allow you to establish an emotional connection to them and even make you tear up. The good voice acting definitely contributes to that as well.  There are some genuine horror elements to this game, although it's mostly about exploration in the dark, noir, relatively small but detailed world with a lot of paranormal elements.",
            "review_score": "1"
        },
        {
            "review_text": "Pros: Good story. Interesting side-missions/collectibles that tell side-stories. Mostly likeable characters. Looks pretty good. Fun.  Cons: Awful short ... I didn't quite 100% it yet, but I am close at under 10 hours. Too many repeating character models and thoughts (from when you mind-read) No pre-loading - every time you go into a new area, it judders.  All in all, worth playing; probably not worth paying full price for.",
            "review_score": "1"
        },
        {
            "review_text": "This is a game that needs to be approached with the right mindset in order to be fully and properly understood. Murdered is an interactive movie with a story straight out of the best 90's b-reel supernatural horror flicks that dominated the video store of an era long bygone. The challenge level is extremely low but the mood and nighttime atmosphere the game evokes are hard to deny. Destined for Steam Sale must-buy status, Murdered is a game that will engage you and take you back to a simpler time, even as it celebrates its b-movie heritage and paper-thin actual gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "A really fun adventure game where you chase a notorious killer through Salem, but have many side-missions where you help ghosts move on by revealing what happened to them and why they were dead. Ontop of that, the collectables you find reveal horror stories based around Salem and they are VERY creepy and sound like real horror stories with the first one with the water boilers sounds similar to a real creepy story I heard about recently.  The detective parts are somewhat irritating with what peice of evidence contributes to being 'Most Relevent' and some it feels like 'Duh' much like the main story where half-way through I already realised what the Killer's target was before the character did, but the twist at the end I never saw coming, but should've.  Highly recommended for any fan of the paranormal and detective TV series too.",
            "review_score": "1"
        },
        {
            "review_text": "Fantastic game! The story was so engaging that I could barely stop playing. It was a bit short, as it only took me about 10 hours and I managed to do all of the achievements (this included some backtracking and collectible huntings), but I'd say the lenght was satisfying and there was really no need for it to keep on going. I highly recommended this title, it's a truly one of a kind game!",
            "review_score": "1"
        },
        {
            "review_text": "Spoopy ghosts.",
            "review_score": "1"
        },
        {
            "review_text": "great game, great story. Played it in one sitting type of game you don't want to put down till it is done.",
            "review_score": "1"
        },
        {
            "review_text": "Great game. Its much more than just a point and click mystery. There is some skill involved fighitng demons and the world is very interactive. You can posses people and read their minds and make them do things. The game is very innovative and different. The story is excellent and so is the voice acting. If you like a great interactive story then this is for you. I got just about 16 hours of game play out of this and I collected many of the collectables. There are cool ghost stories you can collect and I made sure I did all of those. Graphics and sound on this are superb. The most original part of the game IMO is how you can posses people and influence the story that way. You can also teleport short distances. Parts of the game require you to posses a cat! The cat is a lot of fun.",
            "review_score": "1"
        },
        {
            "review_text": "This game has really good story but unfortunately developers screwed up. Gameplay is weak and so they tried to add some stealth scenes when the Demons show up but these parts are the worst part of the game. You just do the same thing and kill em all. Plus game only lasts 6 hours which is really short for its price. But , You must at least give a chance to this game for the story.",
            "review_score": "1"
        },
        {
            "review_text": "It is not a long game, but the storyline is enjoyable. Collecting things to unlock some fully voiced ghost stories is also cool. I can't recomend it at full price, but if you pick it up while on sale, it won't disapoint.",
            "review_score": "1"
        },
        {
            "review_text": "Overall, the game is solid. The investigative parts are interesting, the story is decent, and the mechanics were fun. I kept moving right along. The characters aren't amazing, but they manage to keep the story engrossing long enough to keep you hooked.  This game isn't perfect though. For one, it's short. I mean real short. I spent my time looking around for clues and the like and it still only took me about 7 hours to finish the main story.   I would recommend this game, but I should point out that I only spent $5 on it. If you spend more than that, you might not feel like you got your money's worth.",
            "review_score": "1"
        },
        {
            "review_text": "The only adventure game to feature realistically modeled cat platforming.  Press Y to meow.",
            "review_score": "1"
        },
        {
            "review_text": "I had not played this game because of bad press it got at release. But I did buy it during one of Steams sales. I am very glad that I did end up playing this game as I had a fun time. The story has holes in it, but overall it was a very nice game to play.",
            "review_score": "1"
        },
        {
            "review_text": "tHIS GAME IS AMAZINING AND BEUATIFUL. Depending on your system, there will be framerate drops, that is what system requirment is for. This game doesn't focus on the gameplay or fighting, it focus on the story. So I don't want to hear any more complaints on that you are limited being a ghost. Its a video game and you have to draw a line somewhere. The plot was amazing and shocked me. There is a few twists that made me go,'no way.' It has great plot, and smooth gameplay. It is defintly wort the money. You are missing out if you don't get this.",
            "review_score": "1"
        },
        {
            "review_text": "An excellent game! It's short like people have said, but it was satisfying nonetheless! The game is priced correctly for such a short game (~8 hours), at 10 dollars off a normal priced one. It's not something you'll be playing for weeks and I am actually refreshed by that. It's totally story driven and doesn't pretend to be something it's not. The creepy atmosphere always had me wondering what was around the corner (or what was through the next wall!). I tried my best to guess who the killer was and by all accounts I failed at that. If you want to take a break from that FPS and sit down with a good story-driven game, pick this one up! Totally happy with every aspect!",
            "review_score": "1"
        },
        {
            "review_text": "A truly great game. An engaging story told through a unique play style. The only negative thing I'd have to say was that, for me, trading cards didn't work. Other than that I couldn't put the controller down and finished the game in one sitting.",
            "review_score": "1"
        },
        {
            "review_text": "A 3rd person hidden objects game. That's basically what it is. 5/10",
            "review_score": "1"
        },
        {
            "review_text": "Really good game, 100% recommend. It took me 11 hours without completing all the side quests, so you certainly get what you pay for (especially if you get it on sale for $1 haha)  Only downside is the glitched GUIs. Don't get fooled by swapped mouse icons and other oddities in the GUI screens, also try to ignore the weird flickering and pixelation in the main menu.  The main part of the game had no glitches, and only one bug I noticed: the entering cut-scene playing again after leaving the cemetery. You can skip it though, so no problems.",
            "review_score": "1"
        },
        {
            "review_text": "Buy this!  - This game has really cool unique storyline with amazing twists! - Cool gameplay as a ghost! - Its a cool game! - Fancy well optimized graphics! (played with ultra setup with my gt220 lol) - Cool side stories and collectables! - Really cool open world aspects! - You have to find clues from crime scenes as a ghost! bestgameever2069! i beated the game in 7 hours but those hours was worth it!",
            "review_score": "1"
        },
        {
            "review_text": "For those, like me, who enjoy problem solving games, this was great. It wasn't an intense action game, but simple observation which I enjoyed. Over the course of the game, you can uncover ghost stories as well that aren't even critical to the gameplay, just bonuses. That little mechanic made it feel more immersive considering the story wasn't riding on backtracking or extra digging. Something that stood out for me in the way of dialoge was that everyone who speaks doesn't necessarily talk one at a time. Characters will get cut off and complete their thoughts later in a way that doesn't sound like a script nor rehearsed, with exception to the protagonist's classic-detective style inner monolouges. However, the quick-time controls felt awkward, the game was too short (beat it within twelve hours with a majority of the achievements done), and many 'clues' didn't seem to make sense when trying to piece crimescenes together.  The promise of unique abilities ('personal strengths becoming abilities) was limited to maybe one or two involving revealing information (which felt closer to the protagonist's job rather than his actual strengths). Even only one other ghost displayed only one unique ability that didn't seem to connect to their character. All of the other abilities you gain belong to the other ghosts you find as well, making the protagonist (and the other ghost with a unique ability) possess very cookie-cutter characteristics. Very little direction is taken towards obstacles you run into like the demons, spiteful cops, or paranoia plaguing the area, thus leaving much more to be desired in character development. 'Extra' characters aren't even kept within the game for very long, making it feel as though there are only four real characters, and many filler characters. I 'did' enjoy the game and do recommend it for those who enjoy dark, investigative, or easy-paced games. Sadly this has little to no replayability and would wait for it to go on sale for $15 or under given it's short story and neglect to several details I mentioned earlier.",
            "review_score": "1"
        },
        {
            "review_text": "Let's get one thing out of the way: 'Murdered: Soul Suspect' is not your normal action game. Actually, it is actually not an action game at all; it is more a story-driven adventure focused on exploration and (very logic) puzzle-solving that centers around clue finding and logic implications among them; the plot is thick, with lots of twists and turns all along the way which will nail you to your chair until you're done. There's only one caveat: it's rather short -- I managed to complete it in under 10 hours. There are also 'combat' sequences against demons (ghosts that turned evil after forsaking what they were meant to 'fix' in the living world before leaving it) that are more annoying than anything else as they involve hide-and-seek mechanics; I think that there is a lot of room for improvement in that area but I am not complaining too much. There is one more thing that I dislike though: the whole collectable item craze that the game is so soaked with. Some are in obvious places, others in less-obvious ones, while others are really unfindable unless you comb the town of Salem systematically -- and it's rather hard to do it without a map of the place. Through the collection of clues and items, you either go forward with the main story or unlock sidequests or insights about the protagonists and the town itself.  When it comes to presentation, graphics are really good (locked at 30 FPS but there's no sensation of lag at all), the audio acting is well done and the music hits the spot without being particularly memorable.  I recommend this game if you're into ghost stories (or well-written stories in general) and like to enjoy a slower-paced game that requires a minimum of thinking.  My vote for the game: 7/10 (with a gameplay vote of 5.5/10 and one for the story of 8.5/10)",
            "review_score": "1"
        },
        {
            "review_text": "Perfect Game (y)",
            "review_score": "1"
        },
        {
            "review_text": "This game is an excellent concept, as you are a detective who is killed at the very start of the game and in the remainder of the game you play as his ghost, and you must solve your own murder to get out of this limbo-esque state and into a place where your already dead wife is which seems to be kinda like heaven. The story is really good. I really enjoyed the gameplay however there is very little combat so if you don't like games without combat you're probably not going to enjoy this. So if you're not interested in the story then I'm almost certain you wont enjoy the game. The only bit of combat in the game is very boring and frustrating, as you will be investigating when suddenly a demon will appear and chase you and you will have to keep hiding in these little spectral gas bubbles. This is very tedious and in my opinion something that the game would be better without. The ending of the game is one of the best endings I've played in a while, it is a bit annoying that you are not able to return to the town of Salem after completion of the game but this is not disastrous as this will only bother serious completionists who want every collectible. The game took me about 12 hours with exploring pretty much everything I saw so I guess it would take 8 hours or so without that. I wouldn't say its worth £25 considering how short it is so wait for a sale. I really enjoyed the game though, certainly worth playing if it goes on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Murdered: Soul Suspect is engaging and enjoyable. The atmosphere and graphics are great. You explore Salem and 'ghost Salem' as a ghost and as a detective, solving your case and many side cases along the way. Ghost Salem physically exists for ghosts, as a barrier which prevents you from accessing areas of Salem too easily and as a mode of access to collectables in areas you wouldn't have access to in normal Salem e.g. ghost stairs. There is a lot to engage with: collectables (too many, in my opinion), stories to unlock, ghosts hanging around (they say the best things in the graveyard). It does get repetative and there isn't a challange. The game is easy to beat but there's still a small amount of action such as dealing with demons. I find the game satisfactory for entertaining, easy gameplay but I wouldn't pay $30 for it. Maybe if it was more challanging, everything down to the puzzles are simple.",
            "review_score": "1"
        },
        {
            "review_text": "PROS: +keeps you on the edge of your seat every minute +nice plot +lengthy gameplay if side cases are completed and all ghost stories are found +an infinite cigarette +graphics are awesome   CONS: -cut scenes are not well laid out -killing of the demons is limited only to assassinations from behind",
            "review_score": "1"
        },
        {
            "review_text": "After just 4 hours of playing this game I am totally sunk into it.  Graphics are really great and smooth. Story line is great. Character voices are great. Cutscenes are well done. Gameplay is great. Collectibles? HECK YEAH AWESOMESAUCE  My only issue is the lack of variety with the NPC's, there are many duplicates standing very very close to one another.  Otherwise 9/10 And I highly recommend buying this.",
            "review_score": "1"
        },
        {
            "review_text": "pretty good apart from the completely unnecessary demon segments",
            "review_score": "1"
        },
        {
            "review_text": "In the middle of a plot twist, there's a plot twist inside the actual plot twist",
            "review_score": "1"
        },
        {
            "review_text": "Highly Recommend.  Think it as a Walking Dead type of story driven game, less of an Action/Advanture driven game then it might be your cup of tea. For me, I even like it better than Walking Dead",
            "review_score": "1"
        },
        {
            "review_text": "When i played Murdered it was a game that left me wanting to know more and more until i finished the game and solved the case. Even though the game itself did not take long to beat i enjoyed my time playing, the story isnt bad and it left you attached to wanting to know what happened to you.",
            "review_score": "1"
        },
        {
            "review_text": "-Uniquely great 10 Hours of pure Joy, no repetition, well-written scenario, good constructed story. Pretty good optimization (Even my poor 8 year old pc handled the game pretty well) Replayability, depends on your detective instinct.   9.9/10 I would highly suggest you to play",
            "review_score": "1"
        },
        {
            "review_text": "During my time with Murdered: Soul Suspect, it felt like a spark of unique features in the sea of games that feel like we are recycling the same ideas and concepts over and over. It was definitely an interesting title combining LA Noire's use of interacting with objects and no hand holding while you piece the scene together and choose the correct action from a list that is revealed once you reveal parts of what happened. However I would have liked to see more of a choice in how you progress making some choices lead you down the wrong path and some that if you dig deep enough into the scene it could progress you closer to the killer. To a trained eye a lot of the story becomes easy to pick up but still has some twists like any good murder mystery would. In all I enjoyed my time with the story and ghost/investigation mechanics even if it felt a little short (I think an extra 1-2 hours would have been about perfect for time spent in the game).",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game! Interesting creepy story, nice visuals.",
            "review_score": "1"
        },
        {
            "review_text": "A good investigation game. Not that many of those to be picky either even if you're not into ghosts.",
            "review_score": "1"
        },
        {
            "review_text": "just finished the game and got to admit, it got me addicted to the story like a drug. Couldn't think of anything but wonder what the next clues will add to the story. To sum it up: Story: 9/10 Although it's a typical murder investigation, playing as a ghost trying to uncover clues makes the mystery more interesting. The side stories obtained by finding all the hidden objects on each map are very spooky and a good bed time story to wet the bed.  Gameplay: 6/10 Although it's nice to find clues and unfold the mystery, it's veeery repetitive and lacks diversity. Not much you can do but run through walls, teleport short distances and kill a few demons. other than that, you get bored fast from gameplay and you just want to finish the story faster.  Graphics: 8/10 I can't say it's bad, i can't say it's good. For a 2014 game, objects are edgy, characters lack emotions, but still, it looks ok. It's the bad textures from clues that ♥♥♥♥♥♥ me off.  Overall, i enjoyed the game very much, considering i got it on sale. I recommend it just to unwind from stressful multiplayer games and submerge in a story filled with mysteries.   PS: could play a cat.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. I actually completed it in one sitting! I got most of the achievements done too. Looking forward to playing again and complete all the side tasks.",
            "review_score": "1"
        },
        {
            "review_text": "Its sort of like the tellatale games , only you interact more. There are some things that you can collect around the map that tell you some stories from salem and some such , it was a chore for me , but maybe youd like that(its not like you need 2 do it). The combat is kinda lacking , the story is very very interesting tho. i REALLY liked it. All in all 7.5/10 , the games averages a 5/10 on everything exept graphics/astetic and story , but man do they carry it bythemselves.",
            "review_score": "1"
        },
        {
            "review_text": "I have very mixed feelings about this game. Over all I'd recommend it. Here are my thoughts:  Positives:  The story was absolutely awesome. The whole concept of solving your own death on its own was great, but then the actual mystery behind your murder is rather compelling. I played this with my girlfriend watching and she was never ready for me to stop for the night. So I'd recommend the game just for the story alone!  Throughout the game, there are collectable items that give some insight into the history of Salem and the Witch Trials as well as random little stories about certain events relevant to the area being explored. These add a cool dimension to the game taking away from the story and adding some cool information.  Playing as a ghost and getting to use ghost abilities was pretty sweet.  Negatives:  The BIGGEST flaw in my opinion is the use of demons in this game. I think the game is good enough on its own to just be a mystery without the demons in there to give a 'horror' feel. Truthfully, the demons didn't seem to serve a real purpose to the game and were only in a few spots to take up your time and add just a bit of difficulty to the game. In such a story-driven game, I think leaving this out would have made the game even better because you wouldn't have to go through buildings wondering if a demon is going to pop out or not; you could have just gone on wondering about the story and exploring every facet of the city.  Another big flaw, as I've read in several other reviews and agree with, is that you get really awesome ghost abilities, position, for example. When possessing a person, you can do several things. However, you can really only do something cool or useful with possession on major characters; on background characters, you can only mindread and for a vast majority of these characters, their thoughts are recycled (so you get the same thought from several characters throughout the city).  Overall, I'd absolutely recommend this game. While there were a couple things that bothered me, the story really was enjoyable. Honestly, this could even make a movie. Definitely worth a play-through.",
            "review_score": "1"
        },
        {
            "review_text": "If you like detective games like Sherlock Holms, you'll like this one. Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Having only played it a couple hour, I don't feel that I can give the game a fair shake. I can say, however, that the premise is very interesting. The system that is used to play the game does leave something to be desired, as you are mainly just running around looking for objects in the enviroment to push the story forward. One of the mechanics in the game revolves around avoiding demons while moving between the various investigations. As early in the game as I am, I have quickly found this mechanic tedious as all you are doing is running from them if they see you. Overall, with my limited time playing the game, I am enjoying the story, which appears to be the main driving factor to this game.",
            "review_score": "1"
        },
        {
            "review_text": "Really great game ! If your looking for game which gonna make you interested, thats your game !",
            "review_score": "1"
        },
        {
            "review_text": "I have to give credits to this game because, it tried something diffrent and new experience to me and it was quite entertaining to play it +Setting that is not overused +Story +graphics +Great storys, when you hit all collectibles +Did not expect the outcome +pacing +Envoirment filicking ghosts and so on. +Sound effects /for semi open world game it is quite linear /Why objects get into ghost world -One type of enemy -This game could use some scares As you can see i enjoyed this game quite much, and i would like to see AAA developers to make games that aint your typical year after year releases.",
            "review_score": "1"
        },
        {
            "review_text": "First thing first. Is it worth buying this game full price? Well, story is quite nice. The ending even surprised me, which is good, but in the game there is nothing challenging. Ok, there are few demons, who try to collect your soul, but meeh. Those things are easy to kill.  If you like detectives you, then you should buy this game.  Im one of those guys who run around the map to collect all thing you can collect. Well, this time I didn't collect everything, so mostly main story + fast roaming around to search other stuff is about 7h of gameplay. So think if you want to pay full price for 7h of gameplay.  This game is not perferct, bet there' s something to think about. 7/10 Take it on sale. :)",
            "review_score": "1"
        },
        {
            "review_text": "its good game but not worth the current price wait untill -75% or more cause main story takes about 4-5h without even rushing but there are tons of collectables but still",
            "review_score": "1"
        },
        {
            "review_text": "The game isn't very long, maybe about 6-8 hours, but it has an amazing story. 100% worth it for $15. If you like good stories and mysteries you'll love this game. Being a ghost is cool too.",
            "review_score": "1"
        },
        {
            "review_text": "call of duty: you die and respwan Gta: you die and respawn This mf game: you die.  10/10 would bust ghost asses again",
            "review_score": "1"
        },
        {
            "review_text": "call of duty: you die and respwan Gta: you die and respawn This mf game: you die.  10/10 would bust ghost asses again",
            "review_score": "1"
        },
        {
            "review_text": "At the beginning I was a little bit disappointed by the game, I was expecting more but then as I continued playing I really started to like it. The idea of playing with a ghost as the main character is very interesting and also the story of the game. Till the end you won´t know who killed you (or at least I did not know that and it was quite surprising when I found out). The only thing I didn´t like about the game were fights with demons but fortunately they were not so many. I recommend to try it if you like this kind of games :)",
            "review_score": "1"
        },
        {
            "review_text": "Murdered: Soul Suspect is one hell of a game and is a must play! Besides its short 6 hours story (with exploring, probably shorter if you just do only the linear story), it is a captivating, emotional, and immersive game that truly develops both Ronan and Joy very well (just like any other Square Enix game :P )  The gameplay is unique, the combat is simple, the sound and music is outstandingly well done and the story, is very well written! I’m not going to say much as I don’t want to spoil the game except, I’m not satisfied with the ending. There should have been ‘more’, story wise.   I recommend this game in an instant!",
            "review_score": "1"
        },
        {
            "review_text": "A ghost of dead detective who want to find out a well-known serial killer who also killed him. Play this one if you're looking for story-telling games like telltale games with crime-solving style like La Noire but this game got no 'real' combat (Just some QTE). Good story, plot twist but poor and monotone combat.  7/10",
            "review_score": "1"
        },
        {
            "review_text": "I rather enjoyed this game. I enjoyed the story, and the level of player engagement seemed spot-on for this quick, story-driven game.  On the other hand; I did encounter some repetitiveness in the dialog after a bit. The puzzle solving felt a little forced, and didn't have alternative scenarios if you chased down the wrong lead.   Gameplay:  I usually don't like the over-the-shoulder gameplay style. I found it gave me some issue when trying to interact with some objects, but it wasn't  too  obtrusive.    Combat:  The enemies were laughable, all you had to do was sneak up behind them and perform an action - a random button/mouseclick which is a direct port over to the button/paddle on the console. I found these enemies to be more of an obsticle than an actual challenge. But I belive this is intended, as to keep the game story focused and not combat driven. I actually salute the developers for remaining story focused and not bogging down the player with ubsurd mechanics or prolonged battles... or health bars for that matter (You're already dead! No health for you!)   Collectables &amp; Achievements:  Many players have complained that they were unable to go back and complete the collectable achievements, as this has a very linear progression in the story. This will often require a second playthrough, stopping at each location, and clearing the zone to ensure you have collected everything. I kept catching myself thinking in normal gameplay rules, where I would walk around walls and objects. Just remember, you can walk through that. There are still barriers - ghostly walls and santified buildings - that prevent you from passing through everything.  Due to a bug in the final fight, I didn't finish the game. After many many attempts, I kept starting the scene in a void zone, where I couldn't escape, or didn't have enough time to complete my objective after I escaped. I have not read of this bug happening to other players. YMMV. I did see alot of weird, creepy stuff in this game, but this is the only only thing I would call buggy.",
            "review_score": "1"
        },
        {
            "review_text": "I like investigating game but this one is so wonderful. You have to play it that's all I can say, some part are so scary but it's all about ghosts isn't it. Have fun.",
            "review_score": "1"
        },
        {
            "review_text": "An interactive mystery novel gets a tentative thumbs up. 9-hour game could be a little shorter. It's interesting for up to about 5 hours.  +graphics, voiceovers, high quality. +Neat ideas: walk through walls, mindread bystanders. +Interactivity: Search crime scenes, select correct clues to progress story.  -Very little 'game' or puzzle involved. -Some elements waste time: slow to listen to bystander thoughts, no option to skip to next dialog without skipping entire scene.",
            "review_score": "1"
        },
        {
            "review_text": "'Like L. A. Noire with Ghosts' -IGN",
            "review_score": "1"
        },
        {
            "review_text": "Do you like L.A. Noire? Well, you should try this game! Ignore the low scores, It's a well done game!",
            "review_score": "1"
        },
        {
            "review_text": "This game is absolutely fantastic! I've been playing it throughout the weekend and i've just finished it. I thought it was great. I found the story to be very interesting and everytime I was left with a cliffhanger I wanted to know what happened next. The fact you play as a ghost makes the game all the more interesting to play. You cannot pick up objects and normal people cannot see or hear you. It's a very interesting way to play a game but I really like it and I think it adds a hint of uniqueness to the game. If you've ever played L.A noire you'll probably be fairly familiar with the concept of this game (finding clues and solving cases) but gameplay wise they are completely differnet, you cannot pick up and examine clues you find for example.  Don't let the negative reviews for this game turn you off from buying it. It's a fantastic game with a great story and for £24.99 (even lower on other sites) it's a bargain! I highly recommend this game to any fans of the genre.",
            "review_score": "1"
        },
        {
            "review_text": "Completely in love with Murdered: Soul Suspect. The game mechanics of walking through objects, collecting evidence, possessing people (and cats) make this game a lovely treat. Walking into this game expecting it to win game of the year awards will only lead to disappointment. Better to embrace the uniqueness of the game for what it is and experience the game for yourself. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "It took me 8 Hours to Complete the Main Story. Playing through the game felt satisfying as you learn more about the Killer. It was a very good game for those who are interested into Detective and Mystery. The game has a little bit of Pointless running through the city at the start, but then I realised it was nice to have a bit of an explore and not completely confined to a small area. It's a shame there is no form of replayability unless you are looking for the 100% collect everything. Although good Story and as I said before, I enjoyed it regardless of what the more professional reviewers are saying. 8 out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "'Like L. A. Noire with Ghosts' -IGN",
            "review_score": "1"
        },
        {
            "review_text": "best ♥♥♥♥ing game wtf its insane :X the graphics.. the scenes,the storymode.. its amazing After finishing it: Eh im kinda upset that th story was so short,but It gave me Joy ;) to play it, haven't even felt the hours passing,lol .. Although the game felt soo freakin long, it only took 7 hours for me to complete it,( NO YT etc) The Demons are annoying sometime,but still it would be too easy if u should had have to only investigate. The ending story was such a plot i didn't even though of it even for a moment.. Well except when i saw (not gonna spoil the sex of the person) it from behind but before that.. NOPE such a plot well done guys waiting for continueing Kappa :D",
            "review_score": "1"
        },
        {
            "review_text": "9/10",
            "review_score": "1"
        },
        {
            "review_text": "Murdered: Soul Suspect developers have implemented completely new type of investigation games. 'What is it about?', you may ask, so the answer is below:  You are local of Salem, Massachusetts, the place which is mostly associated with XVII-century's history about witches, that people were hunting at and then, after catching them, they were burned at the stake. In game, there is mystical climat exposing supernatural skills of Ronan O'Connor, the main character, who had been killed at the beginning of the game and then he transformed to a ghost, who had to face demons, solve a mystery of his death and find out, who had killed him. Ronan, while getting the 'new himself', gets new skills, which allow him to move through the walls, be invisible to people, read in people's minds and even control them! During investigation he meets some demons hunting for souls, so he needs to eliminate them, or move around the place to get safer way.   The game reminds me of L.A. Noire, because you need to solve problems by getting some details and then connecting them into one, making sense trace. If you complete it successfully, you'll see what happened before.  Graphic effects are nice, the gameplay is happening during the twilight, so colours are darky, but they keep you even closer, because of usage them in thrilling details around. The Unreal Engine 3 is helping the game to get high details of buildings, models and characters, as well as good animations. The last thing I want to mention about is sound - thrilling music showing overwhelming atmosphere of Salem and live comments of O'Connor's adventures, which lead us to equating with Ronan even more.  Murdered: Soul Suspect and its story completely touched my heartstrings and that's one of the reasons, why my note is very high! Great compilation of story, graphics and sound is forcing me to put 10/10.   Hope you enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "As many of you know this game has issues, issues square enix aren't in a hurry to fix.. mainly related to the game not launching on many PC's. Luckily there are people out there who have fixed this.. and the link at the bottom is a youtube video that also links in its description to the files needed to sort it all out. :)  Onto the review...   This game was very enjoyable from start to finish. The story is great and the whole idea of playing a dead character solving his own murder is one I haven't seen done before and it was excuted perfectly in this game so welldone to the developers for that as in the wrong hands an idea like this just wouldn't have worked as well I feel.  The games graphics and look were great. I ran it maxed out at 1080p on my Radeon 6870 with a quad core Athlon II cpu and 8gb of memory. I didn't experience any framerate issues that others have mentioned in the forums.. tho there was one part of the story that seemed to repeat itself at one point and I'm pretty sure that wasn't meant to happen as it made no sense, but the story continued fine after that little hiccup, not a major issue.  Controls on the 360 controller were great, very easy to get into and layed out well. I never tried the keyboard/mouse for this game as I felt no need to, so can't comment on some comments form others about it not suiting keyboard/mouse.. considering the price of even a 3rd party wired 360 controller these days its not a problem worth moaning about and as i said, the 360 controller is fully supported and ideal for this game.  The game is quite short compared to most large companies titles these days and can be completed in between probably 7 and 10 hours depending on whether to stick to the main story or want to collect everything and complete the side stories. I clocked a bit more than that as I was playing the game on a day I was ill to pass the time lol, so game was paused for periods of time while i was .. well... attending to being ill lol.  I'd definitely recommend this game to anyone who likes games with a good story to unfold.. also its a bit different to the norm thats released these days. I hope Square-Enix and Airtight Games work together again on a similar title as I'd definitely buy it.. and hopefully they will learn from their game launching mistakes with this one.  As stated the game launch problems are easily fixed using the files the guy links to on youtube for anyone that needs them.. (link below, view on youtube to see description and files link)  I'll give the game 8/10 despite the shorter than usual gameplay and the fact I had to fix its launching problem. The score reflects the game itself and it was great.          YouTube™ Video:  como resolver o erro (0xc000007b) no Murdered Soul Suspect&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "So no idea why it's online reviews were so bad. I've been looking forward to this game for a long time and I wasn't disappointed at all. Think of it as LA Noireish with ghosts. It's got the whole detective thing going for it which I like a lot and wish was found more often.   Pros:  -Compelling story, made me sit down and play though it in one sitting, amazing. -Gameplay, if you like to walk around and discover everything then this is the game for you. It never gets dull, slow or too fast. Demons are there to change up gameplay and overall I enjoyed being a exorcist. -Graphics, beautiful game, love the art, everything looks great. -I found a few Just Cause 2 posters in the game. -Even though it's supernatural it doesn't feel fake/childish. -Writing, for the most part, was done very well. -Made me want to help the lost souls and feel rewarded for doing so. -Examples about people who throw their life away. -Good ending.  Cons: -Short, only about 5 hours if you stick to the story and probably close to 6-7 if you want to 100% the game. -Character development, sometimes it felt like characters weren't developed enough for me but I like to know full blown backgrounds, I wouldn't say it was bad though. -Occasional frame drops.   Overall: Solid game, would definitely recommend. Good luck in the afterlife!!   Morals: Don't do drugs. Don't kill yourself. Don't hold grudges. Do something with your life.",
            "review_score": "1"
        },
        {
            "review_text": "Seems like the 'critics' didnt get their moneys, the only logical reason that could explain all the bad reviews. Check discrepency between user- an criticreview scores.",
            "review_score": "1"
        },
        {
            "review_text": "Recent work is passing mark.  Bad: short story. Usability. Frivolity of the Detective part. Good: created - (barely). Sound. Story line. Hidden story.  As a OVERALL, It will not reach the level of honorable mention. However, I was able to feel that it is to have hidden potential. It is possible as a ghost and haunt human, read the thinking. It is not only used freebie degree in this work, but reading ideas, If I were to dictated the actions of the following would it be?　Awesome!! Monotonic, it would solved in the round-robin, the challenge, Detective part of the 'for children'.  If there is a next project, no, I expect a lot of the next. If you are able to exert the potential, it will attract attention from Sherlockian!  It's a must-see 'hidden story' as revealed by collecting a troublesome collectable items.",
            "review_score": "1"
        },
        {
            "review_text": "Great GREAT ! Game ! Just a but too short! :)))  Ending just blow my mind !!! :DDD  9.5 !",
            "review_score": "1"
        },
        {
            "review_text": "this is a great game really good story line u get hooked",
            "review_score": "1"
        },
        {
            "review_text": "This game has the Graphics ,story and Intreguing gameplay that a Horror thriller needs. The only downside tho this amazing game is that it is very very short. That being said ,it is a Sale purchase for sure ,get it while it's hot people!",
            "review_score": "1"
        },
        {
            "review_text": "I picked up Murdered: Soul Suspect because a good friend kept stressing how good it is (in spite of all the negative reviews), and I wasn't at all disappointed with the game. In fact, I enjoyed it a lot more than I ever thought I would! The game relies largely on its characters and the murder mystery that's central to said characters' lives. If you're looking for a fast-paced, highly action-driven game, it doesn't deliver on that front - but that's what made it such a great ride for me as a player.  I wasn't sure what to expect of the game from the premise alone, but it does atmospheric horror really well, along with the splashes of detective fiction and noir, too. Investigating, gathering clues, questioning witnesses, and making deducions are all important to the game. It even has an historical angle that I first thought would be somewhat canned, but actually surprised me a bit by the end.  Collecting is an important part of the game and, although it's 'optional,' a lot of the story content depends on how well you can scour a map for all of the items - some hidden and some not. Even with ~10 hours play time into my first 'completed' game, I still didn't track everything down! So if you're a completionist who enjoys searching and interacting with maps, M:SS definitely appeals on that front.  The other main challenge of the game is demon encounters, and they can be tricky to master at first, since some of the combinations are a little awkward. Still, by the last few maps it seems easier (as the difficulty doesn't really go up much during the course of the game) ... but it's definitely anxiety-inducing sometimes! All in all, the demon encounters kept the game from feeling extremely linear (i.e., like a visual novel).  So if you're into mysteries and crime fiction, love spooky stuff, and enjoy a game that burns a little slowly, definitely give it a try.",
            "review_score": "1"
        },
        {
            "review_text": "The history is great, but maybe I was missing a map... 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Really fun quick game I got all the achievements in one go too ^-^ 7/10 could have been longer but its still alright.",
            "review_score": "1"
        },
        {
            "review_text": "Needs more collectables.",
            "review_score": "1"
        },
        {
            "review_text": "I am a casual female gamer, not great with button mashing. I really love rich story lines, rpg styled play, and puzzles! This game included all of that. If you're casual like me, it's a great point and click that isn't boring. Too often I find the point and clicks are slow paced, but this isn't.   Most of the game is really innate. You know what your goals are and what you have to do. I rarely needed to look something up, so that's a plus for the casual gamer.   The storyline is reallllly cool, the characters, the voice acting, all of it.   My only negative is I didn't clue in to just how open the world was. You can explore a lot and do side quests and I missed a lot of them because I was only following the storyline. Newb mistake for sure, so be sure you do all the fun stuff on the side to get all the achievements.   Graphics and controls were great.",
            "review_score": "1"
        },
        {
            "review_text": "Murdered: Soul Suspect - Spoiler Free Review  First off, I'd like to point out that I like both pulp noir and ghost stories both of which are heavy influences on the general feel of this game. If you do not like either the cinematography stylings of pulp noir (in which case, you won't like the cut-scenes and may dislike the characters on occassion) or think ghost stories are dull, then this is not the game for you.   For those of you still with me and looking at potentially buying this game a bit of background is in order. The studio that released M:SS closed down despite really ploughing everything into this game. Part of it is odd in places, which I'll get to, but mostly they'd been struggling for a while due to releasing a couple of games which were bombs a while back. Any future updates to the game will have to be community driven but that at least is one piece of good news - after multiple playthroughs I only came across one minor glitch, once, and it was a graphical one that I couldn't replicate. The game runs really well so future patching should not be necessary.  So, where to start? How about the story. It's pretty standard fair, almost straight out of a 'Randall &amp; Hopkirk: Deceased' episode. You're a detective in Salem when a call is put in about a strange hooded man breaking into an apartment building. As you are an emotional loose cannon after your wifes' death (it's actually nice to play a character who's irrational behaviour gets some explanation for once) you chase after him alone only to find that he's too strong for you, the eventual fight resulting in your death. Your purpose is to stop the killer from beyond the grave so that your spirit can move on and be reunited with your wife.   This opening is actually really impressive as it's almost entirely done using the in-game engine and graphically looks superb, the sweeping camera shots and the slow-motion work really well giving a strong movie quality feel but rather than just have you as a passenger watching the opening the developer makes you take part in it, trying to first catch the killer and even trying to survive the attack. The sound is excellent too and is nicely understated, something that carries throughout the whole game.  After this you're left, dead, in Salem trying to figure out how you can stop this killer. There's a tutorial which covers the controls and then you're given objectives to complete but you are left to wander through reasonably large parts of Salem without being stopped. As you're dead you come across other spirits and left over memories of Salem in it's past, which just helps to make the world more interesting and full and the contrast in design is really well realised, especially when it ties in with the sidequests and main stories. The more you progress the more of Salem opens up to you, allowing you to find out more about Salems past and revisit areas you have already explored. The team have been as historically accurate as possible, considering that the game is a work of fiction, and you'll get to pick up on a real flavour of Salems darker past as you wander town.  Character design suits the mood of the town too and there are characters in period dress in certain areas, although they are very few and far between, I'd have liked to have seen more of them. They are reasonably realistic to look at - not ultra-real - which would feel out of place in a ghost story, but real anyway with very good motion capture and facial expressions especially on the main ones. One that stood out to me is a point where a character manages to pretty much lie with just their face for a split second near the end, you'll know it when you see it, but the technology is well utilised without being overdone, it does not take you out of the story or gameplay very much if ever.  As a ghost you get to travel through walls but presumably due to hardware limitations this pretty much is only really used within enclosed spaces, though this is explained within the game-worlds mythos itself well enough and it can be quite good fun. These sections really can make you feel like a running, screaming spirit. I felt less like a spirit and more like I was going to have a seizure due to swoosh noise everytime you select a conversation topic. It's fine in short conversations but they can be long and a little grating if you want to find out everything.  There's some disturbing bits in this game too. Some pretty nasty deaths of young women, some ghosts have some surprisingly harrowing and well-acted lines, almost mini-stories, of their own if you come across them and there are collectables that unlock urban legends, a couple of which are genuinely quite creepy. There are places with a lot of extra details added in which build up a wonderful sense of dread and oppression too, a lot of which can easily be missed and overlooked as it is just there for scene-setting.   Controls are pretty tight, the camera is good but can be a bit awkward when you are possessing something or trying to get through a wall slowly. But there are two elephants in the room and these are what most reviewers scored the game so harshly on.  1) Pointless Sort-of Forced Combat/Stealth Sections.  You do combat, you either have to go for it whole-heartedly or just don't do it. In for a penny, in for a pound! M:SS feels like it's dipping it's fingers into the collection bowl and wondering if it can get away with giving a two Christmas old chocolate coin. You get an enforced stealth section, taking you out of the more interesting portion of the game which feels jarring, so you can try to sneak past these demon-monsters which look like the Nozghul if they'd been drinking sheep-dip. It hardly ever works so you have to try to stealth kill them, which is only a temporary fix.   2) Escort Mission  The escort is at least useful but these are really badly designed - it barely matters if you get spotted because the spotter sub-routine is so badly programmed.  Both of these things feel tacked on and out of place. I have a sneaking suspicion that they received orders from their publisher that if they wanted a Triple A advertising budget then it had to have those things in it because they feel completely at odds with the rest of the game. And yes, I will be doing a video rant I am that annoyed about it.  Mercifully, there's only a handful of those sections and apart from that and one point with a truly stupid portrayal of mental illness (completely different to an earlier scene with a ghost in a bath), the rest of the game is pretty much excellent. If you can stick out those few parts you will find a good to look at, engaging murder mystery, with an excellent twist and interesting backdrop and characters.  I recommend it, but have to dock it marks for 1) &amp; 2)   Total Score: 7.5/10   Well above average and definitely worth a play if you want a murder mystery that's a little different or a slowly paced adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "This game is very similar to LA Noire but instead you are a ghost detective in the present day instead of an LAPD detective in the 40s. The gameplay mainly consists of walking around and examining objects in the environment to help solve cases. If that bores you, don't get this game because there is not even much of a combat system aside from sneak attacking demons once in a while. It is kind of open world in the sense that you are free to walk around town and collect objects to solve side cases, but the lack of any sort of map or minimap makes exploration a hassle. With all that being said, I enjoyed the story and atmosphere of the game, which is surprisingly a bit lighthearted for a game about ghosts. It took me about 7 hours to complete the game and I also took my time to grab most of the collectibles as well.  Verdict: Definitely get this on a sale, it is short but sweet. 6/10",
            "review_score": "1"
        },
        {
            "review_text": "this game is for those who are looking for a muder mystery game. Do not expect anything else. This game is very very good for its genre.",
            "review_score": "1"
        },
        {
            "review_text": "Soul suspect is a beautiful game, I love the style of it, with a good storyline and a nice twist at the end. It manages to be both slightly dark and gruesome without being grim, and if you have the patience to hunt down all the collectibles, you'll get a couple of small ghost stories thrown in for free.  My only issue is that is is a bit short, you can play through it on a weekend if you try. I would have loved for it to be a bit longer with some more side quests.  But all in all, give it a go and you'll love it.",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. Great story, lots of collectibles and interesting environments. The story was really good and kept me wanting to find out what happens next. If you see this game on sale and don't own it already then you need to pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "After a while I thought it's another lazy port with low quality cut-scenes capped at 30 fps... Then I possessed a cat.  Best possessed cat from Salem simulator. Definitely will meow again. :-)  Anyway - I'm glad I got it from Humble Bundle with some other great titles in bundle.",
            "review_score": "1"
        },
        {
            "review_text": "Takes about 10 hours ro complete, a few more depending on if you try and 100%.  First off... $47NZD is an utter rip off for the length of the game. I got for next to nothing in a bundle so that effects my view somewhat.  The gameplay is somewhat unique and fun to play and the story is strong with great ending.   It is really a point and click adventure done in 3D.  Bottom line... If really cheap grab it no question, at full price ignore :)",
            "review_score": "1"
        },
        {
            "review_text": "Great story, great graphic, and original too. Mouse mechanic a bit odd, but you easily get a grip after a bit. Totally worth it. Maybe a bit too short, but definitely a story worth playing",
            "review_score": "1"
        },
        {
            "review_text": "The game is worth playing just for story.",
            "review_score": "1"
        },
        {
            "review_text": "i recommend this game to any one who likes any detective storys.",
            "review_score": "1"
        },
        {
            "review_text": "If you like action packed games, well this game is not for you. This game is only for a matured adult who could only understand the true value of life as the game will point that to you, to understand the great concept of mind game (basically it was like point and click to be honest, but what the heck). Great storyline, the plot twist were awesome, and I bought this game for only 10$. Btw, Joy is really cute. I just love on how her freckle sparked on her cheeks, her lips were bloom with her piercing, her eye shines as she speaks, lol, I just fell in love with in-game character.  10/10",
            "review_score": "1"
        },
        {
            "review_text": "A gem of a game, not what I expected at all. It has innovative gameplay, an original storyline, and damn detailed side quest gameplay (also if you have a decent rig to play this on...well the graphics and effects are top shelf). In the end if you like crime solving games with a splash of supernatural... this game is well worth it. I highly recomend it indeed.   -Side Note (metascore);  -For the first time I really question the metascore, critics reviewing this baffle me... the users reviews are a bit more on par and fairer in their assessment... I guess in the end just watch some let's plays and see what your close friends think of it and thats that.",
            "review_score": "1"
        },
        {
            "review_text": "Murdered: Soul Suspect sees you take on the role of Ronan O’Connor, a felon turned detective. Roman is tasked with solving one of the most complex murders that he has come across… His! Yes, that’s right, the game starts as Ronan is killed by someone known only as ‘The Bell Killer’. I’m not going to spoil the story for you lovely people who are interested in buying it, but will stress that the story is enjoyable. Look out for Joy, who gets to become an accomplice of Ronan’s throughout the story. Their relationship is well scripted by the developers and really flourishes throughout the game as they help each other solve a mystery or two. I must say that when i thought i know who the killer is, I was genuinely surprised. Usually being dead in a game is not a state you want to be in. However, Murdered: Soul Suspect turns that statement completely on its head, giving you several advantages and powers. It’s fair to say that Roman is a better detective dead than he was alive LOL  Well, I must say that I missed a game with a good and catchy story.  And oh, we can possess cats!",
            "review_score": "1"
        },
        {
            "review_text": "Good story, great characters easy to pick up and play",
            "review_score": "1"
        },
        {
            "review_text": "Great game, it has its moments where it can get hard especialy if you suck at guessing the right clues but overall great game wish you could keep playing after you beat it to finish collecting all the collectibles.",
            "review_score": "1"
        },
        {
            "review_text": "This is an amazing storyline, its a bit spooky. But that's the point. It really messes with your mind. The demons are just a bit aggrivating... rinse and repeat with them, but I wouldn't count that as a con.",
            "review_score": "1"
        },
        {
            "review_text": "Murdered: Soul Suspect Is 2014 Best game of the Year I had fun running around the City of Salem, Trying to stop the relentless serial killer. The story is Awesome, It look's Good too, Game control's are easy, The sounds are pretty good and music just as good. I could not stop playing once I started the game I just had to finsh playing it. The partership between Ronan and Joy was very Sweet cause they needed each other to do thing's the other couldn't do. Now down to business Murdered: Soul Suspect is a 10 out of 10 and I hope to see more game's like this from Square Enix, I do recommend this game and I hope it will get a sequel.",
            "review_score": "1"
        },
        {
            "review_text": "This a a really prity game. The story is well written and the characters are believable although more background about them would have been good. The game play is really good with either Keyboard or controller. With surround sound it definitely creates a spooky atmosphere. The one down side of this game is that it is a bit short at around 10 to 13 hrs game play. 9/10",
            "review_score": "1"
        },
        {
            "review_text": "MSS is a very entertaining detective story, but very very short (4 to 8 hours). So you should buy it if the price is falling to 19,99 $. The concept of possessing people, eavesdrop their conversation and their thoughts is well made. It is more or less railroading, but you can walk freely through Salem, solve sidequests and find collectibles. There are many little ideas like possessing cats to avoid demons and find hard to get collectibles or teleport Dishonored-style.   The demons are very annoying, but easy to defeat or to avoid. No variety, no intelligent. wandering from point a to point b.  If you want an entertaining short detective b-movie you should play it.",
            "review_score": "1"
        },
        {
            "review_text": "The idea of the story is just awesome and players can easily bond with the main characters. Unfortuantely the developers missed the chance to create a brilliant game with deeper story lines like old Lucas Arts Adventures. The game is fun to play although controls are frustrating. Sometimes you walk by a clue and it is not discovered because the angle you look at it is not right or you are a step too far away. Also there are a few situations in the game where it is not clear what to do next if you 'learn' a new contolling feature. This and the total obsolete concept of deamons the game prevented a really great game....hopefully a sequel will correct this and leverage from the great potetial the actual story has.",
            "review_score": "1"
        },
        {
            "review_text": "The game has a nice atmosphere and an interesting plot. The gameplay is fairly lackluster, being too linear and simple. And the stealth sections are horrendous. But the game worth a buy during sales.",
            "review_score": "1"
        },
        {
            "review_text": "Great game for those who enjoy puzzles and storylines. This is NOT your average dull action game that the young kiddos like playing today (ahem, CoD). I wouldn't recommend paying full price for this game because it can be beaten in under 9 hours. If you want to have it last longer, I suggest finding all the side items.",
            "review_score": "1"
        },
        {
            "review_text": "So Murdered Soul Suspect I bought this game because I love games with a little chill to it and investigating games are especially great. This game is amazing finding and solving mysteries and or murders never been more interesting. This game takes mistery and discovery games to a new path. Do you like going through walls? Ever wondered what would it be to die and live after that? Have you ever tought about helping other people even after you are gone?? Pros: &gt; Great Graphics &gt; Shocking story &gt; Lovely gameplay (Challenging) Cons: &gt; Somethimes its kinda hard to find the right things",
            "review_score": "1"
        },
        {
            "review_text": "If you like to play as a detective and like horror games then go for it, it's so sp00ky; and as always, remember : IT'S TOO GOOD, COST TOO MUCH :)",
            "review_score": "1"
        },
        {
            "review_text": "I was afraid it would be a bad idea to play this but it turned out to be quite OK. The gameplay is a bit like as if someone took a point and click adventure and turned it into a TPS without the weapons - or the shooting for that matter and realized afterwards that there must be a degree of difficulty too so they added these dementors to the game. These demons are the biggest letdowns in this game BTW...  Anyway, graphics are OK, characters (the inhabitants of Salem) are repetitive, the story is OK (excpet that I don't get it: why on earth do you need to collect objects completely out of scope and proportion to be awarded with something? eg. boiler or whatever), side 'missions' are so-so (I am being positive here), controls OK (except for the demon 'fight' and usual camera mayhem) - and the game is way way short (7 hours or so on normal difficulty). Of course since it is 'open world'-ish you can wander about for long but I do not see the point in doing so. I would recommend it more than not but be warned: this game will not appeal to all.",
            "review_score": "1"
        },
        {
            "review_text": "Really Cool Drama Type Investigation game. I remember I play X Files which was same gameplay. Good mystery.  Good Graphics. Overall good waste of Time. because I learn how to investigate :D",
            "review_score": "1"
        },
        {
            "review_text": "10/10. Just a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, got it with AMD's never settle bundle.",
            "review_score": "1"
        },
        {
            "review_text": "You can possess a cat 20/10   **SPOILER ALERT**  You're a Ghost !!!",
            "review_score": "1"
        },
        {
            "review_text": "Got this for $7 on Humble Xmas sale worth that price but not much more. Game is like la noire not even close to the quailty standards tho so far the game does have an interesting concept; dead man looking to solve his own murder to get out of limbo to meet his wife in the after life. ( I didn't spoil anything pretty much first 5 mins of the game tells you everything...)",
            "review_score": "1"
        },
        {
            "review_text": "Sure, The game isn't a masterpiece but it kept me playing until the end. The game has an interesting concept and it is done fairly well, though therre is room for improvement. The story has many twists and you always want to know what happens next.  It is a game you can play once through, there isn't much replayabilty in my eyes. There isn't many sidequests, but therre is a lot of collectibles hidden aound if you like those.  Overall I'd say it's 6,5/10",
            "review_score": "1"
        },
        {
            "review_text": "SPOILERS   little ghost girl was the villain all the time!  ",
            "review_score": "1"
        },
        {
            "review_text": "Great game.Unique gameplay which i never seen,which is good,a litle change is great :)  The story is just AMAZING,great great gameplay whit so mutch details and interactions whit soooooo many ppl. Excellent side quests,all with good story to tell.  Million achievements and secrets to find through out this world.papers,news papers.objects,photos.collectables .... Powers you have are good and interesting and usefull in the game. Objects and environments in the game or the World are beautiful whit so mutch details.  So far the game is amazing,and I am sure it will be so until the end.  Dont no what is the down side for this game.... For me the game is locked at 30FPS so i gues it is that,but i do not mind really.  10/10  ",
            "review_score": "1"
        },
        {
            "review_text": "6,5/10",
            "review_score": "1"
        },
        {
            "review_text": "I can lay in my own body  #TheFutureIsHere",
            "review_score": "1"
        },
        {
            "review_text": "Story and gameplay is epic - Voice acting is spot on, adding to the Immersion! ONLY let down is the demons... The most pointless addition to a game I have ever seen. Takes that immersion that's just been built and throws it away.  Only reccomend as long as you can easily get back into a game once you've been distracted from the story.  8/10",
            "review_score": "1"
        },
        {
            "review_text": "99 OF 100 WILL MEOW BUT ONLY IF IT'S ON SALE   This is game is quite good, has an interesting story (I liked it), the graphics are nice, but it's too short and has few enemies.  Only recommended if you buy it for less than 6 dollars....",
            "review_score": "1"
        },
        {
            "review_text": "I was a bit skeptical about this game after the reviews I saw but after 5 hours of playing it is a solid game. There is barely any action, it's more of a L.A Noire without the gun fights or similar to a sherlock holmes game. The story really sucked me in though, the basic premise is a mysterious killer has murdered you and now you have to find a way to solve the case. I love detective games like this where you have to find clues and piece together the story.  The gameplay is good, theres nothing to really say, its fairly basic. The game does have some puzzle solving but its mostly about the story and solving this case. There are other smaller cases in the game that you can solve along the way optionally.  I have run into a few bugs here and there where I've had to reload my last checkpoint because something didn't load in properly or the game was stuck. It has only happened twice in my 5 hours of play so they are few and far inbetween.  Bottom line, if your a fan of mystery and puzzle solving, you'll love this game. Do not expect an action, think sherlock holmes. But there is a very good story that will suck you in.",
            "review_score": "1"
        },
        {
            "review_text": "I liked it. Get to play around while looking for some object. Very basic would be better if there was a harder mode and ways of making the investigation harder to figure out.",
            "review_score": "1"
        },
        {
            "review_text": "This is an EPIC story with twists, turns and surprises. Not to mention a scary story that has basis in historic events (The Salem witches).  We just could not put the game down once we started. I'm sure we will return to Salem again.  If you like a very well written script and a game play thats story driven, but still challangeing, this game is a must.  ",
            "review_score": "1"
        },
        {
            "review_text": "I blew through the game pretty quick, but I had a great time doing it. Enjoyable story-heavy gameplay with plenty of smaller side-stories throughout. Not a lot of action, but if you don't mind that, totally worth a playthrough! Also, if you're dumb and love achievements like myself, you can get them all in one playthrough without too much effort.",
            "review_score": "1"
        },
        {
            "review_text": "Well made, and very fun. The story starts out very strong, but in my opinion, starts to dwindle down towards the. I wasn't a fan of the final twist, but still had a lot of fun playing the game. Could have used a couple more diverse puzzles in order to spice things up a bit, instead of doing the same mechanics for 7 different levels.   I'd recommend for most fans. Still a very fun play.",
            "review_score": "1"
        },
        {
            "review_text": "You can be a cat. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "Fun game and nice gameplay",
            "review_score": "1"
        },
        {
            "review_text": "While not a partcularly excellent balance of survival-horror and investigation, there are several fun elements to the game and many nods to popular folklore surrounding ghosts. It has a storyline that is somewhat predictable, but the ending yields a few twists to keep it refreshing until the end. Overall, I wouldn't recommend buying it for the full price - wait for a sale.",
            "review_score": "1"
        },
        {
            "review_text": "The game was pretty good. The concept was interesting. So was the story. The 'twist' at the end was unsurprising. It's one of those games where if you have a day off of work and have nothing else planned, you could probably play the game from start-finish that day. It's replayablility is almost non-existent.   I got it for 50 percent off. I would reccomend waiting until it costs less to buy it. Definitely not worth the full price tag.   ",
            "review_score": "1"
        },
        {
            "review_text": "AWESOME STORY, reminds me of LA Noire slightly, mixed in with that horrible movie with Whoopie Goldberg and SWAZYEEE 'Ghost'. Beat the game in about 6 hours. Tried for all the achievements so it took a little longer. Great game, got it for free, otherwise probably not worth the 59.99 price tag. Wait for it to go on sale, but highly recommend.   10/10",
            "review_score": "1"
        },
        {
            "review_text": "Game is very plot and story heavy. Playing mechanics are very simple to learn and get used to. Collectables throughout the game are worth to find. They reveal a lot of depth to the characters, the ghost stories are fantastic, and the player learns so much about Salem's history! The art is very lovely and unified. Music...not a whole lot of selection, but it certainly got me jumpy. The overall ambiance is well done.   Annoyances: The game has a bizarre way of saving. Every collectible the player finds are immediately saved. But if player leaves the game while in the middle of a case, then returning to the game would place your character right at the beginning of the entrance. If the players stops and comes back in the middle of a side case, then the case will be resetted. Another, the collectibles are very annoying to find, especially the ghost girl's messages! They're drawings the character finds on walls. However, they are obnoxious to find! Not very noticeable! I looked at a video where someone managed to find all of them, but some of the spots that were revealed were areas I've tediously checked! Props to those that actually found those ridiculously hidden drawings/messages. Last, I love the character designs and voice acting, but the character's expressions displayed in every cutscene was a bit flat unless something very emotional happens like screaming.   Overall: The game is a bit shorter than most (I completed this game in a 3 days), but I would totally recommend this game to anyone that enjoys a decent mystery and storytelling. Although, I also recommend waiting for the price to go down to at least $30.",
            "review_score": "1"
        },
        {
            "review_text": "its a very quick game. i got bored with it after half way through it. its a good story but i just dont really care for these kind of games i guess, 6/10",
            "review_score": "1"
        },
        {
            "review_text": "This is more like a thriller-horror novel for those who are too lazy to pick up a book than a game. So if you aren't interested in stuff like that i dont recommend buying this game. Overall the game is great! It actually requires lots of reading (wall of texts ahead!) to fully understand the plot (and trust me, it worth it). The side ghost stories in the game are spooky as well. The story is good. Basically you're on a case to find out about a serial killer called ''The Bell Killer''. While persueing the suspect alone, you got killed and kinda stucked in between the two worlds. You need to find out about the truth in order to ''move on''. Gameplay was simple, feels a bit repetitive; great atmosphere overall, can be a little spooky due to random ghosts. I got this game on sale so i wont be complaining. Definitely worth a try!",
            "review_score": "1"
        },
        {
            "review_text": "A story driven game which reminded me of an old point and click adventure but with a modern style utilizing third person action. The action in the game itself is limited to some QTEs and some stealth gameplay against some malignant spirits, the majority of the gameplay is on investigating and puzzle solving. There are plenty of collectables with voiceover story extras which make exploring worthwhile as well. The story is a bit short yet very engaging that follows a likeable main character. It does have it's share of cliches but the main characters are realistic and relatable while the side storylines have a bit more into the 'what is wrong with these people' traits.  Overall the complete package is easy for me to recommend for people who enjoy games with a focus on story over purely gameplay itself.",
            "review_score": "1"
        },
        {
            "review_text": "Yay + Good story + Some really creepy scenes + You can possess a cat   Boo - Short - Lame combat with demons - Puzzles were not puzzling - No point to the side quests other than unlocking badges   I enjoyed the story but there isn't much game here. The main story is fun but short.  I list it's short lenght as a negative but really, had the game been any longer things would have felt tedious. I had no interest in completing the side stories. There didn't seem any point.   Good, but not great. Glad I didn't pay much. Had fun.",
            "review_score": "1"
        },
        {
            "review_text": "I'm a big fan of adventure games, more so than shooters and racing and such. There are a lot of good ones out there, and a lot of bad.   I wasn't at sure at first which this would be. It's not your point-and-click type. But it's also not overly NOT point-and-click. Which then gets more into RPG and such.  The premise - you're dead to begin with - on it's own made me thing 'huh?'. And it works beautifully. As a 'ghost', the game doesn't completely rely on, but is mostly based on, things you can (and can not) do, as a 'spirit'.  I think it works nicely. Without a map (I think, a 'where you've been' map of at least the current items (not the ghostly ones) would be a little more helpful) I found myself running around in (and through) circles a lot.  The main plot is fairly linear. If you just follow the 'now you have to go here' line and do what you're 'told', it's pretty straight forward, you go to a location that it tells you to. You collect evidence at that place.  That alone would still make a good game because of how it's done. But the additional stuff, while key to the whole story, isn't necessary to 'win' the game, make it not just a Point A to Pont B game.   Overall - play it! I'm going to again, because I didn't solve some of the sidelines, and I meant to.   A semi-negative. Which did make it harder to complete some side quests, and to a little degree even the main quest: 'Actionable' items were sometimes weird. Not that you weren't right on top of them. But that you had to face just the right direction, look the right direction. A lot of items I 'accidently' found, just because I happened to notice the 'action' text popup for a second. Altough sometimes I thought it might be, but it was just the XXm to next destination text moving positions.  Anyways, great game, great concept. I hope there's a sequel. Or well, not sequel, but a similar concept. Possesing a cat just rocks :)",
            "review_score": "1"
        },
        {
            "review_text": "Fun game and nice gameplay",
            "review_score": "1"
        },
        {
            "review_text": "Murdered:Soul Suspect is a supernatural thriller kinda like Ghost Whisperer,Medium or Deadbeat.The game focuses on the story and the plot twist adds to a great ending. The characters are well done and you can discover their stories through notes.Also,the voice acting was good.You can possess a cat and even 'meow' which ,let's be honest, is everybody's dream.The background characters are interesting(from psycho butcher to jealous girlfriend) and you can even help some of the ghosts as a side mission.The dialogue was funny most of the time and straight to the point. Unfortunately,the controls seemed to be made especially for console so it didn't quite adjust to PC keyboard.Another con was the length of the game.I was expecting more gameplay.After you finish the game you can't go back and explore.Speaking of exploration,it was limited by walking from point A to B.You can only roam between those points and it felt like Salem was not really a city but a place with a few locations. In conclusion, meow out of 10.",
            "review_score": "1"
        },
        {
            "review_text": "Very enjoyable investigation game. there isn't much replay value but i really enjoyed the game. 8/10",
            "review_score": "1"
        },
        {
            "review_text": "Ok, but could have been so much more. The combat mechanic is annoying and unneccessary, bolted on and jerking the player out of what is otherwise a reasonably immersive and interesting world. The investigation/hunting for clues elements are ok, but way too easy and simplistic. Despite this I found enough in this game to make a playthrough work $6. I'd pay as much as $10. Overall though one gets the feeling that this game could have been so much more.",
            "review_score": "1"
        },
        {
            "review_text": "You are a recently deceased detective, who has to solve his own murder. I would say this game is a graphical adventure with exploration and lots of collectibles, and a few (very light) stealth combat parts. It has a great ambience, cool characters and a good story, which surprised me at the end. It doesn't have many side quests, and the rewards for completing them aren't precisely rewarding. It's a short story, which I completed in 7 hours, but i skipped most of the collectibles and side quests. It doesn't have difficulty leveles or replay value. I would surely recommend it, but only if it is on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I was interested in this game from the moment of its announcement, and now having played it, I definitely do not regret the purchase. It has a very interesting twist right at the beginning and overall it reminds me of a blend of a number of games, including Blade Runner and Max Payne, however odd that might sound. I most certainly haven't seen all of it yet, but the effects, possibilities and abilities you have as a spirit are well implemented. Your main character being a spirit is certainly believable. The amount of interaction is just right and the story so far as interesting as it is sad.  The only major problem and complaint I have with this game is the inability to remap key bindings for any of the controls. Considering the game is Unreal engine based, that is neither understandable, nor really acceptable. However, having found a way around this problem (see my guide at the end of this review), 'Murder: Soul Suspect™' is as playable as it is fun. If you enjoy a spooky, dark and well told detective story, then this is definitely for you!  Please check out my guide that can help with using different key bindings:         Key remapping guide&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "As a Sci-Fi geek, I loved it. It feels like reading a book or watching a catching TV series, with the suspense building up as you help the main story and side stories progress, through exploration and some LA Noire style clue finding. Great atmosphere, voice acting and sound design. Well worth the price of a good movie, so grab it when it is on sale. Gameplay is secondary and limited but quite innovative. Demons are quite an annoyance at first but sparse and you'll get the hang of it (key combo) quickly (and checkpoints are close). They are necessary to get you deeply involved with some fear. Highly stable on my configuration: only once did I get stuck in a 'possession' menu. Steam achievements easy to grab, as it is a rather linear story on small maps.  Major cons: those of a direct console to PC port. No keyboard mapping possible (I have a foreign keyboard, so that was dreadful, but I found the 'GlovePIE' solution by google-ing 'keyboard mapping soul suspect'). And my gamepad was not recognized. Once reaching the Museum for the final confrontation, you cannot sort out your missing clues (and Steam achievements) without starting a new game. End credit is over 10 minutes long and you cannot stop it.  In sum, a great experience which I hope Square Enix will renew. Intelligent ghost based games not focused on blowing everything away are scarce. The foundation of this game has a lot of potential.",
            "review_score": "1"
        },
        {
            "review_text": "You can be a cat. 10/10",
            "review_score": "1"
        },
        {
            "review_text": "I just finished it after 9 hours and...it's different. It was a nice break from rpg and fps games. Obviously a lot of work went into the game but I think it comes across as an interactive movie with some elements thrown in to add length and something to do. The game is worth a play-through but whether you have fun or not is subjective. If you like point &amp; click type games you will probably enjoy it. I effectively disabled the demons by using a cheat and the game played more like a murder/mystery only - I was glad I did that as I read that many people find the demons annoying. This is probably better as a written story than a game, but since they went to all of the trouble and expense to make it you may as well give it a shot (on sale of course).",
            "review_score": "1"
        },
        {
            "review_text": "I genuinely enjoyed this game. 7.5/10, I'd rate it.  It has a feel of something similar to that of Dishonored with it's (sort of) sneak based system, and collecting 'artifacts'. Meanwhile it has a slight taste of something close to that of Silent Hill games. The artifacts in this game build up a history to the story as a whole, not only behind the people you come across as main, and minor characters, but even the town of Salem, of which this takes place. Also, depending on your personality, you just simply cannot prepare yourself enough for feels.    Spoiler Alert! Past this point!        Cons: Sneaking past Demons  (they are the most annoying things I've witnessed in a video game in a long time)    You can 'possess' npcs, but you don't actually 'possess' them.   (You can't actually walk around in the body of an npc or anything, but there's a cat... yeah.. a cat.)      You can use 'poltergist' on items to distract npcs  (only during quests of which an npc needs to be distracted. You can't just freak people out by doing ghost stuff, but I think we all wish you could)     You play a ghost, and can walk through people, and they have no reaction at all  (you would think they'd get chills.)     Characters that audibly cry but.. don't actually look like they are.  (this is minor but it's still awkward)     Scenes that aren't quite cutscenes, that you can't skip    In-game settings won't allow you to set your own keybinds/controls  Pros:    Interesting Characters    Feels that hit you right in the heart    Ghosts. Ghosts and more ghosts! Did I mention ghosts? Sadly these aren't the Casper kind of friendly ghosts.    It's like being on CSI! Except you're dead... and you're solving your own murder and the murders of others by this serial killer. Still, CSI!     I thought I totally had the twist ending figured out. I was so wrong...   All in all, it's a good game in my opinion. It has a lot of things that could have been made better. I feel like when this game was being made they wanted to go in the direction of mystery and suspense but.. then they tried (and failed) to add a horror aspect with the addition of demons. The demons could have been left out entirely. For me, they're the worst part of the game. Nothing quite like sneaking up on one of them, just to have it turn around last second. Or having you fail to 'excute' it because it's a random key + m1 or m2. Might sound easy enough but you try remembering the layout of your keyboard when you're trying to not have your soul consumed by a demonic creature.",
            "review_score": "1"
        },
        {
            "review_text": "If you are looking for an action 3rd person shooter then look elsewhere, but if you want a great story, interesting narratives, and great atmosphere this game is great. Highly recommended; Note: Does have various occult references and such. Essentially you are a ghost trying to solve his own murder so that you can cross over to the other side.",
            "review_score": "1"
        },
        {
            "review_text": "Decent game if you are looking for a change of pace. Solving your own murder in the town of Salem (which is suprisingly small, it almost makes you feel the police in the game are utterly incompetent due to limits on scale) is interesting. Game took me about 6 hours to beat, could likely get another hour or 2 if you try and complete and collect everything. This is more of a story/adventure game. Puzzles are minimal and while there is some bizzare stealth mechanics they felt overly simplistic and a bit out of place. If you are looking for a short game with decent story it could be worth your time but do not expect much more than 6 or 7 hours out of the game.",
            "review_score": "1"
        },
        {
            "review_text": "Alan Wake ghost edition,fun game.",
            "review_score": "1"
        },
        {
            "review_text": "Pretty good action adventure game. A little too short (8h), but overall I am satisfied with the purchase during sale.",
            "review_score": "1"
        },
        {
            "review_text": "i gonna be honest this game is ♥♥♥♥...   But it Is on sale for 7 bucks on like every steam sale and it is entertaaining for the amount of time that it goes on for  this game is a lot like the evil within   the game is fun to play and has a cool idea but its execution and apperance is awful   dont but this for full price buy it for 15 dollars or less",
            "review_score": "1"
        },
        {
            "review_text": "This game might be linear, but it's a follow-the-lead kind of game, what did people expect? It's a good game,with a good history that will make you play until you uncover the mistery. It might not be very adventurous of my part, but I do think the battles where unnecessary, after all, you're the ghost! Why do you have to be afraid of anything if you're the one haunting the place? It was a annoyance, but you quickly get the hand of it and it stops being frustrating. Definetivly a good game, go ahead and pick it up!",
            "review_score": "1"
        },
        {
            "review_text": "I like the game story. It makes you curious and keeps you wanting to finish chapter after chapter. I totally agree with others that this game has potential but the story is too short tho the ending is quite surprise. Nice music. Boring combat. Excellent game ideas. Hope that they will extend the idea n make it more fun in the future, more powerful main char, more puzzles, more tricks, etc... Recommend it on sale.",
            "review_score": "1"
        },
        {
            "review_text": "I thoroughly enjoyed this game. At first, I thought this would be a failure and not peak my interests whatsoever. After getting it through the recent humble bundle and trying it out I was hooked, once started, I did not play another game until I was finished up. Even went as far as attempting to get all of the collectibles for some extra story.   It really is a one and done kind of game though, which I enjoy but may not be for you. If this looks like a weird game or something you wouldn't like, i'd rethink that and give it a shot. I had the same mindset and immediately after starting it that all changed.",
            "review_score": "1"
        },
        {
            "review_text": "8/10 This is a very mediocre “game.” Let me explain that. If that were all there was to this, then I would obviously have given it a thumbs down. As a game, it’s just so-so, but as a piece of entertainment, it is fantastic. The actual gameplay has its ups and downs. There are really only a very few elements to the whole experience. You have exploration (walking around large/medium sized areas.) Collection (there are little glowing things liberally sprinkled around everywhere to pick up, and they all have some interesting tidbit to share.) There are a few stealth sequences, and then there are mysteries to solve. As for exploring, and collecting; I love and hate this sort of thing in games. A lot of games have them these days, and I have an unhealthy compulsion to collect all/most that I can. It’s not even for the achievements. I just have to. It’s like wringing out every bit of value that I can from a game. There are objects to be found, and I must find them. The stealth, is pretty horrible. This actually drags the gameplay as a whole from being good-ish down to mediocre. Plainly put, the stealth sections hurt this game greatly. For people who don’t play games, and would like to experience the story, these sections are going to be too difficult and very frustrating. For people who DO play games, these sections are just going to be annoying. They aren’t very difficult for a gamer, they just become tedious. Luckily they aren’t in there too often. Just, once in a while, when you are on your way to something interesting – boom. Ohh noos. Demons. I suppose I will have to watch them float around their 3 different way-points until it’s facing the way it’s obviously designed for me to kill it. Then, there are the mysteries. These are pretty fun. They are not unlike Phoenix Wright. There is a smallish area. and within that area are clues strewn about. Once you find all (or most) you can solve the mystery by selecting the correct “clue(s)” to answer whatever question the game is asking. Unfortunately this sometimes causes problems because the clues that they are asking for sometimes don’t make sense. The mystery asks for what seems like a specific answer, but instead accepts answers that are just vague repetitions of themselves. You’ll find yourself annoyed at the end of some of these sections when you find out which answers the game actually wanted you to pick. You’ll be able to think, “I guess that kind of makes sense?” but also roll your eyes because it doesn’t directly, and you are penalized for selecting incorrectly. Luckily the penalty isn’t too harsh, and you have unlimited retries. The only punishment is that you might get less “badge points” for how well you do. As far as I could tell, these points literally never had any bearing on anything. That is all of the gameplay that there is to this game. So as a game, it doesn’t do very well. However, most everything else about it is great. Great story, interesting characters, interesting setting. Great music, great voice acting (mostly), pretty decent graphics. The ending was a little bit abrupt, but there’s a little twist you might not quite see coming. Luckily for this game, to me, the gameplay didn’t matter too much. I kept coming back to find out what was going to happen next, and to see what little mysteries I could uncover in and around the spooky city of Salem. I ended up having a really good time with Murdered: Soul Suspect, and if they were to make a sequel, I would most definitely give it a purchase.",
            "review_score": "1"
        },
        {
            "review_text": "Really fun game, interesting mechanics and great story.",
            "review_score": "1"
        },
        {
            "review_text": "i gonna be honest this game is ♥♥♥♥...   But it Is on sale for 7 bucks on like every steam sale and it is entertaaining for the amount of time that it goes on for  this game is a lot like the evil within   the game is fun to play and has a cool idea but its execution and apperance is awful   dont but this for full price buy it for 15 dollars or less",
            "review_score": "1"
        },
        {
            "review_text": "You can play as a spooky ghost for the entire game.  You can also play as a cat posessed by the spooky ghost.  You can't walk through all the walls, just some of them.   7/10",
            "review_score": "1"
        },
        {
            "review_text": "Play this in the dark with headset.  Amazing visuals, refreshing puzzles, dramatic story and collectables!",
            "review_score": "1"
        },
        {
            "review_text": "A great supernatural 3D graphic adventure (with some action). Good story, graphics (very funny to go through walls and people), voices, sound effectrs and music. A lot amusing extras as secondary cases, Ronan's memories, etc. A good option to spend time. Don't pay much attention to the unfair critics from 'specialized media'.",
            "review_score": "1"
        },
        {
            "review_text": "Good game. Nice graphics. Nice story. Not easy, not hard. A way to short. I've made it in 4 hours.   But worth money to spend.",
            "review_score": "1"
        },
        {
            "review_text": "Love it!",
            "review_score": "1"
        },
        {
            "review_text": "Bought this during the Halloween sale and enjoyed every minute of it. If you are into action games it may not be your cup of tea, but if you enjoy slower paced games with a decent story then add it to your wish list and buy it in the next sale. I doubt you will be disappointed for the price.",
            "review_score": "1"
        },
        {
            "review_text": "Murdered: Soul Suspect is an excellent game. I don't usually write reviews, but I wanted to address the few issues that people do have with the game  The usual subject of criticism in Murdered: Soul Suspect is the combat system. The fact is, however, that Murdered is not a combat-based game. If all you care about is fighting, this wasn't gonna be the game for you to begin with. The combat system isn't like most fighting games, but that's because it's not designed to be. Murdered isn't an action game - Murdered is about telling a story.  This brings up the other common complaint about Murdered: that the story is too short. Sure, you can beat the game in six hours, but, the fact is, you shouldn't. Murdered is also a game about exploration. As an example, each story mission gives evidence you'll need but also some you won't. This makes sense, as when you're looking around a crime scene, not everything you notice is going to be relevant. In the end, you have to choose what pieces of evidence are relevant to what you want to know. So sure, you could just find the necessary pieces of evidence and realize 'Hey, I can solve this now.' Alternatively, you could try to find all the evidence anyways. There are also hidden collectibles that explain some of the backstory but are not necessary to progress in the game. Side missions don't present the player with any rewards, but do provide short interactions with other ghosts (not to say that these side missions are perfect though). The atmosphere of the town of Salem is captivating and makes it fun to just walk around and explore. As a ghost, you can possess any human and read their thoughts. Granted, the thoughts of random civilians in the streets can get repetitive and reused, but in story missions these thoughts are more unique. So if you're the kind of person who likes to rush through the game, your experience will be short, but that's because it won't be the full experience. My personal playstyle was to seek out all the collectibles that I could (but not obsess over getting all of them), explore the town of Salem as well as the locations for the story missions (the police station and museum are particularly neat), read everyone's thoughts (at least in story missions), look for all the evidence I could find, and read anything I could find lying around. I'm not saying that everyone should play this way or that my way is the only way/correct way to play, but I do feel like gamers who like exploration will get much more out of this than players who don't due to the atmospheric nature of the game. In doing such, not only did it make it a more enjoyable experience for me, but it also lengthened the completion time a little bit  Anyways, pros/cons: + Graphics + Story/Atmosphere/Characters/Lore + Voice Acting + Unique ghost gameplay - Side missions leave a little something to be desired - Certain collectibles can only be collected during certain story missions, so if you miss them then they're gone  In short, Murdered: Soul Suspect is a great game, but make sure you know what to expect before getting it. Many of the bad reviews are from people who expected it to be an action game, when in truth it never presented itself as such. Murdered is more of a linear interactive movie. If you like story-driven games, this is the game for you, but if gameplay is all you care about then save your money.",
            "review_score": "1"
        },
        {
            "review_text": "Great adventure game. The game is too short to be worth it's full price. 7-8 hours of gameplay, 75% achievements without looking too much, for the collective items you find in the games these days. The game is pretty straight forward and doesn't let you hang in difficult places. You only have the auto saves to get back to, but tbh they're more than enough.  Playing as a ghost it's quite different from other adventuregames and there is a eerie feel to it. You might even call it a thriller adventure.  That was a saturday that wasn't wasted. I do enjoy getting surprised by a good adventure game, last time I had a good adventure game was Cognition: an Erica Reed thriller ",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game for sure",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Immersive story and plot, Cool side stories, Enemies are total ♥♥♥♥♥♥♥t, And random QTEs are dumb.",
            "review_score": "1"
        },
        {
            "review_text": "You can be a cat! 10/10 IGN",
            "review_score": "1"
        },
        {
            "review_text": "Murdered: Soul Suspect is a game that errs on the side of an interactive story. It’s short and fairly easy, but entertaining while it lasts. It’s definitely not worth full price, since it’s only really going to get you maybe 10 hours of gameplay tops if you take time to find all of the collectables without a guide, but if it's on sale, I say it's worth the buy. I suggest you put it on the big screen, grab a blanket, a snack, maybe your cat, and your controller and enjoy the small side ghost stories and the overall story from the comfort of your couch. If that sounds like your kind of night, then get it and enjoy!",
            "review_score": "1"
        },
        {
            "review_text": "This game is not for everyone but it does what it tries to do reasonable well. This game is very light on the gameplay and people who are looking for a challenge or interesting gameplay mechanics should look elsewhere.   Aside from some very easy and basic stealth sections this games gameplay is basically made up by you walking around and pressing buttons when the game tells you to. Calling it a walking simulator wouldn't be a complete lie even though there certainly are some more stuff in the game. There are some investigations and puzzles but they are extremely easy and mostly made up by you walking around and pressing e/r or whatever when the game tells you that there is something interesting nearby.  But you will spend most of your time in this game walking around quite charming and comfy environments picking up clues and collectibles. There are some stealth sections, investigation questions, cutscense and ghost stuff here and there which spices it all up but the gameplay is very basic and simplistic and certainly not for everyone.  I enjoyed it though. The characters are interesting enough and the story kept me interested throughout the game. The environments are also pretty nice and overall i found it to be a nice and relaxing experience.  ",
            "review_score": "1"
        },
        {
            "review_text": "Very well written game, although it is entirely too short even if you decide to get the collectable things and do the side missons.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. I was hooked from start to end.  Easy achievements too if you are an achievement ♥♥♥♥♥.  Recommended.",
            "review_score": "1"
        },
        {
            "review_text": "Because ghosts. Besides, it has a good story. Too short but worth it (especially if you get it on a Steam Sale).",
            "review_score": "1"
        },
        {
            "review_text": "One of the best mystery games ive played in a long time. ",
            "review_score": "1"
        },
        {
            "review_text": "While the story is a bit hit and miss, the voice acting is fantastic and overall the journey is pretty satisfying.  Two MASSIVE recommendations :  1 - If you like achievements: Make sure to look up a missable's guide, without spoilering, there's a museum that you can't return to again after a point, so you want to collect everything from there before leaving.  2 - I didn't use it in my playthrough, but you can edit a file to disable the quicktime event demons from the game. They don't add to the game at all and just break the flow of your investigation/searching. Check out the forums to learn more!",
            "review_score": "1"
        },
        {
            "review_text": "Murdered Soul Suspect is a neat story, but the quick time events: kills demons or ecaping demons pits sucks with duel button and mouse click which if do not in 2-3 at the same time will messes up. Other than that it is good game.",
            "review_score": "1"
        },
        {
            "review_text": "Great game, Immersive story and plot, Cool side stories, Enemies are total ♥♥♥♥♥♥♥t, And random QTEs are dumb.",
            "review_score": "1"
        },
        {
            "review_text": "Unespected game. Really interesting, with nice cases to solve. don't understand the metacritic vote of 5.9 is not fair with the game. moreover now that on square enix store is on offer for 2.5€.",
            "review_score": "1"
        },
        {
            "review_text": "This is one of those games that would have sold a lot better if it wouldn't have been for the full 60 dollar price tag. Clocking in at around 5 hours of gameplay players are tasked to find their own killer as a ghost detective. The story is a nice mix of mystery, detective stories and a wink at Salem's well-known history. The gameplay consists of finding clues and piecing together hints (similar to LA Noire) as well as out of place stealth sections that quickly become repetative and unfortunately become more frequent near the end of the game. I however had fun playing Murdered Soul Suspect. It is exactly as long as it should be, the story doesn't go for an unneccessary 'DLC' or 'Start of a Franchise' Move (meaning, there is an actual ending to the story) and even on my sometimes a bit glitchy rig it ran smoothly on max without any problems. If you're interested and can pick it up on sale, go for it!",
            "review_score": "1"
        },
        {
            "review_text": "The best TPP Point 'n Click game",
            "review_score": "1"
        },
        {
            "review_text": "I really enjoyed this game. The puzzles, collecting, exploring as a ghost, the whole demon challenge really puts you into the game. As much as the demons are a pain but great for getting your controls down. Look forward to playing it again, thanks to a friend that gave me this game. Love it! ^_^",
            "review_score": "1"
        },
        {
            "review_text": "This Murder Mystery if filled with its uniqueness and presented with a story where the mystery actually gets a hold of you. A Whole new IP where you play as a ghost and to find peace you have to solve your own murder. This game be a bit rough around edges and maybe a bit limiting and linear but it provides a gamer with a fresh perspective and quite a different experience. Frankly speaking it is a big underrated game and i blame official mainstream reviewers, this may not be the best game around but its certainely worth playing.  rating - 7.3/10",
            "review_score": "1"
        },
        {
            "review_text": "This game is not bad at all. Actually it is pretty decent. Among the other user reviewers I also do not understand the press score. Yes, the fighting 'system' is a big zero, but this game has nice characters, a good story and an unique noir flow. I f you like story driven games and/or noir style buy this during a sale! You won't regret it.",
            "review_score": "1"
        },
        {
            "review_text": "This would have been much better as a movie or a mini-series, as a game it's somewhat lacking. The crap combat and no-brainer 'puzzles' are the worst offenders here, although the claustrophobic environments, innumerable collectables and two dimensional characters aren't all that endearing, either.  So why am I recommending this? The story. If you want a good murder mystery with a few neat twists in it, this game will scratch that itch. I wouldn't advise paying full price for this, mind you, so wait until you find it heavily discounted or as part of a bundle.  Worth playing once.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fantastic game . One of the few games in this genre that for the  walkthrough doesn't get bored.  I wish all of you to pass this game and learn all the secrets of Salem.",
            "review_score": "1"
        },
        {
            "review_text": "A fast casual game to play when youre bored and want to waste some time. Pretty much a simple walking simulator with a bunch of mini games and a plot.",
            "review_score": "1"
        },
        {
            "review_text": "Cool game with lots of things to do, control, collect, complete, etc.",
            "review_score": "1"
        },
        {
            "review_text": "It's a very intresting game. In my opinion, the graphics are amazing, the story is intresting, so, buy it. ;)",
            "review_score": "1"
        },
        {
            "review_text": "nice little story, relatively simple gameplay (find the hidden object, piece the puzzle together, move on) with smaller stealth sections. lots of stuff to discover and smaller side cases to solve.  not worth the full price but absolutely worth it when it's discounted.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very under appreciated game!",
            "review_score": "1"
        },
        {
            "review_text": "Excellent game, I really enjoy the whole story behind this awesome game, love it love it!! I am going to play this game again over and over.  I my humble opinion one the best games I have ever played!!  Thanks for the fantastic game!!",
            "review_score": "1"
        },
        {
            "review_text": "This game is an interactive movie with solid plotting, mild puzzling, and good characters. Buy when on sale.  I enjoyed the scavenger hunt for collectibles, including unrelated ghost stories. There wasn't anything particularly challenging about the puzzles and challenges, but the story was fascinating enough that it was enjoyable. Especially good since the play mechanic of being a ghost, and the Salem theme is unusual.  My only annoyance was the only collectible I missed was in the only inaccesible area at the end of the game, so I couldn't go back and get it. Oh, and it wasn't worth the full price that I payed.",
            "review_score": "1"
        },
        {
            "review_text": "The only thing holding your attention here will be the story, everything else is basic and an afterthought.  While you do play as a detective, the 'investigations' that you conduct mostly consist of running around a room looking for something that you can interact with until find the ones you need to complete the investigation. Every once in a while you get a few enemies coming your way, dealing with them is easy and they probably could have been left out of the game entirely as it feels like they're there just to pad out the game. You are able to possess people and cats, but there is not much you can do when possessing people, mostly just reading their mind which becomes dull after a couple of tries. While possesing a cat you can also move around the world with it, however the movement is not at all fluid, jarring even, and it's just so that you can move from one point to another which for game reasons you could not do before. Besides the main story you also have some side cases to solve, which can be interesting and I wish there were more of them.  In most ways the Murdered: Soul Suspect is generic and average at best. Thankfully though I certainly was interested in the story and it had some nice mysteries to keep you going. So I would only recommend it to people who are confident that they can enjoy a game just by following the story.  6 / 10",
            "review_score": "1"
        },
        {
            "review_text": "Pros: You can possess a cat and make it meow.   Cons: You can't possess a human and make it meow.   Overall a solid 7 out of 9 lives.  ",
            "review_score": "1"
        },
        {
            "review_text": "There is a lot to this game and I was not disappointed when I bought it. Very cool mechanic of walking through nearly everything, and the 'powers' you get made the game even better instead of taking away from the story (like they tend to do in other games). Highly recommend especially if you enjoy searching for all the little tid bits of info and collectibles (although that is not needed, saving other souls by doing the side missions was a ton of fun) Well written dialogue with great voice acting made this like an interactive movie! Link below to our playthrough of it.          YouTube™ Video:  Murdered Soul Suspect - Part 1 ~ GHOST DETECTIVE (Let's Play/Gameplay/Walkthrough)&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Hey, this game is pretty cool. Different twist on the thriller even if it was a little obvious on what to do, and not much guessing to it. Characters are cool. Get it on a sale if you want it and don't want to waste money. 4 bucks for this is absoloutely halal.",
            "review_score": "1"
        },
        {
            "review_text": "I got this game on a steamsale for 2.50€ and I think it was totally worth it.  + good graphics + nice audio + good atmosphere + good gameplay + good story  - pretty short - too many useless collectables - story ending  It's sad to say that this one could be so much betterthan it is right now! But I would still say: Play it. It has some interesting features and a nice storyline and for the sale price I can overlook many flaws :)",
            "review_score": "1"
        },
        {
            "review_text": "One of the most underrated game gems. Featuring a narrative and mechanics unlike anything I've ever seen, Murdered: Soul Suspect really showcases how games can shine as a storytelling medium.",
            "review_score": "1"
        },
        {
            "review_text": "Awesome game. Nice graphics, cool plot. I'd recommend it to everyone.",
            "review_score": "1"
        },
        {
            "review_text": "Game has a decent story, pretty simple to play with some boring gameplay elements. Worth purchasing for cheap and if you like detective games. If you enjoyed the case work aspects of LA Noire you'll probably enjoy playing through this game.",
            "review_score": "1"
        },
        {
            "review_text": "I loved this game from start to finish. It can be a bit easy at times, but if you go hunting and find all the side stories (I almost got all of them), there is a lot of stories to enjoy. What I enjoyed the most was that the story had me guessing the entire way.",
            "review_score": "1"
        },
        {
            "review_text": "Great concept, good story, good graphics. Short campaign - I completed it in less than 6 hours, but I got the game for free when I purchased my graphics card, so I can't complain. Great atmosphere and an addicting main story which makes you want to see the outcome. Worth a play through if you can buy it for a decent price and have a few hours to spare.",
            "review_score": "1"
        },
        {
            "review_text": "The story line is quite good which is why I recommend. However due to the controls and certain ingame bugs. It is better to wait till it is on discount because the price is too much for just a story. Or you should wait till the bugs/glitches get fixed before buying it.",
            "review_score": "1"
        },
        {
            "review_text": "Great game !",
            "review_score": "1"
        },
        {
            "review_text": "I just finished the game. I thought it was very well done, but keep in mind this in not an action, FPS kind of game. It's a detective game. I thought it could have done without the demons. I didn't feel it really added anything to the storyline; it just made things irritating. Other than the demons, I thought the storyline was interesting and I liked the character development between the main characters. I like the way they handled the clues and the 'mini-game' kind of feel for figuring them out. You actually have to pay attention to what's been going on and things you've investigated in the past to do a good job solving the questions.   Eventhough I enjoyed the game, like most mystery type games, it's not very replayable (unless you're a 'completionist') considering you know how it ends. Interesting twist at the end.",
            "review_score": "1"
        },
        {
            "review_text": "Brilliant game that is highly under-rated. Its good graphics along with an amazing story is a combination that is becoming harder to find in modern games, with most companies focusing on graphics it is refreshing to know that developer Airtight Games and publisher Square Enix have found a way to create balance between the two.         YouTube™ Video:  [1] Murdered: Soul Suspect (gameplay) - Ghost Time&nbsp;",
            "review_score": "1"
        },
        {
            "review_text": "Good Game. Has a pretty good story but the gameplay is a little lack luster. Pretty much the same thing over and over again. Go to a place, possess someone, click on some clues and repeat. How ever, the experience on wanting to know who the killer was kept me going and made the game very enjoyable. The game is rather short. Only 3-4 hours long for the main story and a few side quests. The other 2 hours I have on this game were spent AFK. Overall a 6.5/10",
            "review_score": "1"
        },
        {
            "review_text": "the bad reviews are overly harsh in my humble opinion, yes it is a bit linear, but thats the type of game it is, its real strength is the story which is excellent, who doesn't love a redemption story with supernatural thrown in. Also the detecive bits, its not always as cut and dry as it seems, if you go for all collectibles you will flesh it out a bit, however i cant recommend paying more than £15 maybe £20 at a push as the replay value is purely novelty should you wish to replay the story somewhere down the line.",
            "review_score": "1"
        },
        {
            "review_text": "Good game, just a little clunky at times with the controls and mechanics. I recommend playing this with a controller, it seems to make it a little less clunky. Over all I'd give it a 7.5/10 as the story is a little cliched but still quite enjoyable. I did have to quit a couple times due to the clunky mechanics that didn't mesh well with certain parts where you were required to be sauve and quick (without putting a spoiler in, those that have played the asylum portion will likely know what I'm refering to).",
            "review_score": "1"
        },
        {
            "review_text": "short and simple but great story",
            "review_score": "1"
        },
        {
            "review_text": "It's got an okay story, decent enough graphics, spooky atmosphere in places and gameplay is a bit different (fun at first but does wear off a litte by end) but not much action and the investigations are just to easy and a bit stupid in there execution (no way to fail them) If they make another one they seriously need to rethink this part. And its short but thats a good point (just would get boring if it dragged on) I also didn't encounter any bugs so far which is nice considering the amount of bugged games released these days.   Basicly a story driven modern supernatral point and click let down by the investigation gameplay. But overall a decent enough game that at least tried to be different from all the other clones out there and maybe worth 10 to 15 pounds (heck you can posses cats and that's gotta e worth a tener)",
            "review_score": "1"
        },
        {
            "review_text": "This game.................. just amazing. im not going to go into detail about it, but i would recommend this game to anyone who is interested in playing this. square enix realy out did themselfs with this game.  story / gameplay: 10/10 music: 10/10 replay value: 7/10 (worth replaying if you want to get 100% completion)  all in all a great game, and i loved it.  your resoults may vary.",
            "review_score": "1"
        },
        {
            "review_text": "While not a perfect title by any strech of the imagination, the intriguing plot, interesting characters and unique gameplay concept buggy, technical mess of a game highly worth playing; though certainly not at the full $50 asking price. Wait for a hefty sale, but definitely do snag it at $29.99 or less when it inevitably drops.",
            "review_score": "1"
        },
        {
            "review_text": "MURDERED: Soul Suspect is an atmospheric, story-based game. Tonally, it lies somewhere between LA Noire and the Still Life series. The gameplay is reminiscent of a point-and-click adventure but with the difficulty knob turned way down. If you're looking for a challenge, this isn't the game for you. However, if you're looking for a nice Noir-esque detective story with a supernatural twist, you should enjoy this game. Personally, I enjoyed every minute of it.",
            "review_score": "1"
        },
        {
            "review_text": "This game was really good, Short, but really good. I would reccomend it to anyone.",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR Poor gameplay, great story and worth it for it.  Soul Suspect has some really, really bad gameplay mechanics, not that bad, but bad, it was stiff, glitchy, boring, locations were badly designed also limited but they had a nice setting and a creepy feel to them. The 'combat' is pretty much useless, i guess the game needed some kind of level of threat and danger, all bad things on the other side. The story, oh, the story is so worth it, the writing is great, characters are unique and different, i don't want to spoil anything, it kept me going and it's just terrific and worth it just for the story. This game could have been great in both perspectives of gameplay and story, if it was done the TellTale way, it was made for it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a very simplistic game and quite often people are turned off to that but quite often it's enjoyable to play a game that doesn't have super complecated mechanics. This is more or less a story telling game. allowing you to see through the eyes of a character as the story unfolds. it's worth a play. 8.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Good game....If you like mystery solving games, and point and click style games even, this game is most likely for you. I am a huge fan of point &amp; click games, and this game was fun as hell for me. The story is rich, the voice acting is nice, and the puzzles are fun as well. I don't think it's worth more than $30, but I got it for cheap so I am happy about it for sure. If it's ever cheaper than the 32.99 it's charging, pick it up!",
            "review_score": "1"
        },
        {
            "review_text": "To start off I just want to say that I'd only recommend purchasing this game when it is discounted. It took me 14 hours of playtime to clear the game with 100% completion, and would have taken less if I'd have used a guide to find all the collectibles. So consider that if you're moving along at a decent pace and you're only torturing yourself over the ghost story collectibles so that you can get those extra short stories unlocked you should expect about 8-10 hours of playtime to get through this.  So to me, a price of 20-30 dollars sounds reasonable (about 2 dollars per hour of entertainment).  This game plays and feels very similarly to other story-driven cinematic games where much of what you are doing is exploration and interacting with the environment. There is no real combat in the game, only a dozen or so sections where you need to sneak up on enemies and button-combination eliminate them without being noticed. If you've played Heavy Rain or Indigo Prophecy/Fahrenheit you know what sort of gameplay to expect.  As far as the game itself (and by game I mean movie) is concerned I found it enjoyable though the ending is fairly predictable. If you've ever seen the movie The Frighteners with Michael J. Fox the game feels very similar (in a good way).",
            "review_score": "1"
        },
        {
            "review_text": "a little short but lots of fun to play. L.A noire style investigations, though at times what options to pick are a luittle unclear.",
            "review_score": "1"
        },
        {
            "review_text": "This game is mix from L.A. Noire and poltergeist storie. It's very atmospheric, has a pretty good story and relaxing, slow-pacing gameplay. I totally love it and hope there is be more games in this series.",
            "review_score": "1"
        },
        {
            "review_text": "I just played it from start to finish in one sitting. The first time I tried it (when it first came out), I didn't really get into it. After 10-15 minutes, long enough to get out of the first 'scene,' the game had me hooked. I thought it was going to be a gimmick, but this game made playing as a ghost feel extremely unique and interesting, all the way through the end.   I worried, in the middle, that the plot was being too easy to figure out. Revelations in the latter part of the game, however, just got more and more exciting - I had no idea what was coming. The story was well written, enjoyable, immersive, and refreshingly different.  I highly recommend this game. I wish I hadn't waited so long to give it a full effort. I now see why so many articles were written about it when it first came out, and I'm sad it isn't as well known as it deserves to be. It isn't just another gimmick in a game. It is deep and powerful, and I am so glad I played it.",
            "review_score": "1"
        },
        {
            "review_text": "Would defenitly recommend, it's a great game.",
            "review_score": "1"
        },
        {
            "review_text": "Good game....If you like mystery solving games, and point and click style games even, this game is most likely for you. I am a huge fan of point &amp; click games, and this game was fun as hell for me. The story is rich, the voice acting is nice, and the puzzles are fun as well. I don't think it's worth more than $30, but I got it for cheap so I am happy about it for sure. If it's ever cheaper than the 32.99 it's charging, pick it up!",
            "review_score": "1"
        },
        {
            "review_text": "This game pans out like you're watching some cinematic movie. Gameplay is easy and short, and side-quest is close to non-existence, so you'll be walking in linear path as the story unfold around our protagonist. Fortunately the story and the atmosphere around it is decent enough to keep you thrilled throughout the game.  Overall good game but not worth the full price. Grab it when it's on sale.",
            "review_score": "1"
        },
        {
            "review_text": "An Interesting and a fresh idea of a game on a perspective of a ghost with a Sherlock Holmes feel on it. It has some flaws that needs to be polished but it's still a good game",
            "review_score": "1"
        },
        {
            "review_text": "Dark and creepy, all in all a spellbind.",
            "review_score": "1"
        },
        {
            "review_text": "A great concept with some noteable flaws. If you can manage to put up with the pixel-♥♥♥♥♥ing puzzles, sometimes unintuitive investigation solutions, and inability to track missing collectables, the story, atmosphere and everything else can be worthwhile. Only recommended for those who do not get frustrated easily.",
            "review_score": "1"
        },
        {
            "review_text": "I got this from a Humble Bundle and actually really liked it. The story is a bit linear even tho the town is semi-open. The biggest con of the game is the replayability. Because there is none. Once you finished the game... you won't play it again. Maybe years later when the memories faded.",
            "review_score": "1"
        },
        {
            "review_text": "Entertaining! But likely only at sale price, unless 'pure story design of a detective and ghosts' is your bread and butter. Give it a shot if you want to enjoy a police story with the undead.  A supernatural\\detective story with collection-hunting and sorta-kinda open world exploration between zones. Almost purely a story game. Some performance issues where the game runs very smooth but some obvious crap-up when it's loading the next chunk of the map. At least one occassion where an entire section of the map failed to load, but a 'restart at checkpoint' fixed it.  'Demons' mechanic is either forgetful or just irritating, sadly. And without this, as small as it is, there is pretty much 'move mouse cursor everywhere to find clues' gameplay.  Overall had a good time, but this was gifted to me so that might influence things.",
            "review_score": "1"
        },
        {
            "review_text": "Enjoyed this game and liked that as the hero you are trying to solve your own murder.",
            "review_score": "1"
        },
        {
            "review_text": "Bit of fun, mixed in with a bit of repetition - and a taste of frustration. Overall would play again. Give it a shot, its an interesting niche game. New slant unlike the usual FPS clones. Play it at night in the dark :o)",
            "review_score": "1"
        },
        {
            "review_text": "The story was great and the controls were fine. I just expected a little more from the game. In all I feel like it was a giant game of I Spy. I would recommend this game on the story alone just dont expect anything like weapons and intense combat. Its all strategy and stealth.",
            "review_score": "1"
        },
        {
            "review_text": "Pros:  * Nice story and atmosphere  * Refrashing mechanics - somtimes you forget that as a ghost you can walk through walls  * Voice acting and the main cherecters are amazing * Side quests are nice and rewarding * Lots of locations that you can explore  Cons: * SO M-A-N-Y THINGS TO COLLECT * Only two types of enemies * Most of the NPC are clones  Bottom line: Great game, it is a bit short (somwhere around 6-8 hours) but it was the right amount of time for the story which wrapped up nicely in the end.",
            "review_score": "1"
        },
        {
            "review_text": "Not a good game unless finish it. A well story with a good ending. The way of Investigating through describing pictures was a bit interesting and relax, might meet some players' taste.",
            "review_score": "1"
        },
        {
            "review_text": "its good game, realy good game, for some one who love good story game. The cons was in their music, what i'm telling the music is meeh, so for u like the detective case . this could be ur game",
            "review_score": "1"
        },
        {
            "review_text": "Great game. More of an interactive story than a game but I enjoyed it none-the-less. 10/10 would play and awesome detective movie again.",
            "review_score": "1"
        },
        {
            "review_text": "So I'm a big fan of the game. It's interseting. As the preview says and to avoid spoilers you're attemtping to track down your own killer. Apparently some people have difficulty playing with mouse and keyboard. I did as well, but the 360 controller worked fine for me after that.    It's rather linear, and some of the collectables are really hard to find (I was three away from having a perfect game! &gt;:T ) Is it the most difficult game you'll ever play, heck no.   Sadly... there's not much replay value either.. part of me would like to get those last three things and be done with it, but idk.",
            "review_score": "1"
        },
        {
            "review_text": "L.A. Noire was worse when it comes to game mechanics in my opinion. This game has some fresh ideas, although some bugs are ovious and challange the atmosphere (ocassionally human NPCs walking through walls just like you). The rating of actually 59/100 is much too low because they really try something refreshing here. Paid reviews and belonging to a bigger company would give this game 75/100",
            "review_score": "1"
        },
        {
            "review_text": "Good Game, You're a detective who had a gun ( two if I wasn't wrong) and just got yourself kill by a ♥♥♥♥♥♥♥ dude dress like Altair and he didn't have any weapon so ♥♥♥♥ off man &lt;(') , really Square Enix ? ........... and you can control a cat , now I'm Ronan The Cat and I can go anywhere i want",
            "review_score": "1"
        },
        {
            "review_text": "Murdered: Soul Suspect takes a fascinating part of American history and pairs it with a supernatural detective story. The environment and plot is very creative and unique and kept me interested until the end. The game is fairly short and doesn't overstay its welcome, yet still provides a lot of character and plot development as well as a few twists.   That being said, there are two minor downfalls to this game.   The first is the overuse of collectibles. While the collectibles are easy enough to find and doesn't require too much 'post game time' to sit down and sniff them out, there are still a ton of them. Over 170 in fact. Each collectible gives some sort of backstory to the world or relevent major characters, but the sheer number of them will have you running to pick them up first before doing the actual story missions. I feel this can really take the player out of the setting and mood Murdered: Soul Suspect tried to create, with its old, colonial, haunted theme. If you are the type of player to skip right over collectibles and not be bothered, then this isn't a problem for you. But if you are OCD, have to get them all, hear every backstory, learn every secret, then this will probably get on your nerves a bit.  The other issue to this game is that some of the puzzles are unclear as to how you should go about solving them. While this has only happened to me about maybe 15% of the puzzles in the game, it is still frustrating to look up the answer and say to yourself 'How does that make sense?'. The game does give hints if you get the puzzle wrong, but sometimes the hints aren't that clear. With some trial and error, you should be ok though.  Overall, I enjoyed this game. I picked it up when it was $4 and would have gladly paid $20 for it. The setting and plot were really unique and I liked all of the ghost mechanics that were added into the game. It is definitely a game to play when you are looking to get a good story with some amusing puzzles. I rate this game a 9/10.",
            "review_score": "1"
        },
        {
            "review_text": "You get to play a badass ghost detective type of guy that solves misteryes, combats demons and posses people. Interesting point of view ... but short game, however it is worth buying it on sales.",
            "review_score": "1"
        },
        {
            "review_text": "Cool concept, I really loved the intro video and the introduction of Ronin, the tattoo montage is excellence. Its a really enjoyable game! my girl and I play it a couple of hours a night for the past week and have loved every minute of it. The storytelling is great, awesome voice-acting and sweet graphics. I give it a fair 8/10",
            "review_score": "1"
        },
        {
            "review_text": "To be honest , I dont think this game will be good and I think I will hate it. I've got this game from Humble Bundle for just a dollar and I dont want to waste that dollar. So I tryit... and This game is AWESOME !!! If you dont try it yet just buy it. You wont regret",
            "review_score": "1"
        },
        {
            "review_text": "This game is an adventure that brings about new concepts. Being a ghost solving your own murder was a nice idea, only could of been executed better. The story is great with many twists. The gameplay is simple. There are many collectibles to collect so you can spend more time in the game. 7.5/10",
            "review_score": "1"
        },
        {
            "review_text": "Really loving this game right now!",
            "review_score": "1"
        },
        {
            "review_text": "I love this game to bits already and I am barely even into it. But by far, possessing cats is the most fun and would definitely count as a Cat Simulator 2014/15. Also, the graphics are beautiful as always. &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "Even though the plot is a bit cheesy, the game's atmosphere and attention to detail make this game a brilliant dectective game. The mistery deepens right untill the end and the challenges are expertly ballanced. This game is a must play for those who enjoyed LA Noire - although it successfully surpasses LA Noire in many aspects.",
            "review_score": "1"
        },
        {
            "review_text": "I ADORE this game.. while it doesn't have a ton of Reply value it IS very fun.. has a great story.. and DESERVES a Franchise..",
            "review_score": "1"
        },
        {
            "review_text": "Well. This game is short. Sometimes boring. With so many opportunities that were wasted. But, it has their own Style and story. ",
            "review_score": "1"
        },
        {
            "review_text": "TL:DR Poor gameplay, great story and worth it for it.  Soul Suspect has some really, really bad gameplay mechanics, not that bad, but bad, it was stiff, glitchy, boring, locations were badly designed also limited but they had a nice setting and a creepy feel to them. The 'combat' is pretty much useless, i guess the game needed some kind of level of threat and danger, all bad things on the other side. The story, oh, the story is so worth it, the writing is great, characters are unique and different, i don't want to spoil anything, it kept me going and it's just terrific and worth it just for the story. This game could have been great in both perspectives of gameplay and story, if it was done the TellTale way, it was made for it.",
            "review_score": "1"
        },
        {
            "review_text": "Very good game. I enjoyed playing it and it had a good story.",
            "review_score": "1"
        },
        {
            "review_text": "Murdered: Soul Suspect, is very underated as a game. I put off playing this game for quite some time due to the negative publicity. My loss, because this is well above average in many regards.  The negatives are its total lack of replayability and pointless combat system. But forget about all that and don't even bother with the collectibles, the majotity of them are pointless and offer nothing in relation to world or charcter building. The npcs found everywhere are likewise pointless, dont waste your time with them.  However the reason I love this game is the story, the main story is gripping and the main characters are likewise compelling. This is not an fps or an rpg, its a very good interactive story. If like me you appreciate a well told story in a great setting and don't mind it being linear with no sidequests and the rest of the fluff then this is a winner. If you spacebar through conversations and skip cutscenes then avoid this like the plague.  Love  Arch",
            "review_score": "1"
        },
        {
            "review_text": "Really liked this one. 9 hours to complete, missed only 17 pickups out of 242. A good example of why Metacritic can suck it.  A thief turned cop gets killed during an investigation, but with things really unresolved he just can't leave yet. So you go after your killer and help a bunch of other (sometimes not-so) recently deceased and meet up with a medium.  There is nothing revolutionary, but it is a very well done adventure game (the only 'arcade' parts are dodging/killing demons from time to time.. and that was by far my least favorite part of the game) good focussed writing, a tale about ghosts in Salem that manages to stay interesting and not repetitive, good VO, nice density of hidden stuff to collect (only Abigail's graffiti were annoying because very little clues were apparent).  I think most people disappointed in this one were expecting an action heavy game, and it really is n adventure game.",
            "review_score": "1"
        },
        {
            "review_text": "An incredible insight to the Salem Witch Trials... with a twist! The interaction with objects is a little imperfect (and could get annoying at times), but the attention to detail and decent storyline nailed it as a 'Yes I still recommend this game'.",
            "review_score": "1"
        },
        {
            "review_text": "I'm not really good at most games and i spend most of my time being killed and restarting thankfuly this game was challenging but not to the point i wanted to give up and never play it again. The game had a really good story and great game play and i really loved playing it and once you have finished the game you can always go back and hunt down everything you missed the first time around. :)",
            "review_score": "1"
        },
        {
            "review_text": "I was really hoping for a bit more from this game. I snagged it in a humble bundle and was so excited to finally play. The graphics are pretty fanstastic, the controls can be a little clunky, the story has a lot of intrigue and the overall difficulty isn't that high (even if increase it in-game).  The part that let me down was the 'action' aspect of this game that revolves around hiding from demons in the whisp trails left behind by other ghosts. That's it. You walk around, possess people, find historical tidbits to complete achievements, and hide from the occassional demon. The story, however, is engaging and all of the side content does add quite a bit to the game. I loved the aestetics and finishing it was very satisfying. I just with that the developer had played a bit more with the combat mechanic.",
            "review_score": "1"
        },
        {
            "review_text": "6/10. 6 hours or so to complete. Only worth it cuz of humble bundle (got it for 1 dollar).",
            "review_score": "1"
        },
        {
            "review_text": "It's a very well written game, hatsoff to the story creator. I did'nt find any part in the game where I felt bored, it will keep you engaged till the very last. A very strong recommendation (y)",
            "review_score": "1"
        },
        {
            "review_text": "it has an cancer-free inextinguishable cigarette",
            "review_score": "1"
        },
        {
            "review_text": "It's a story rich adventure detective game that's really fun to play",
            "review_score": "1"
        },
        {
            "review_text": "An incredible insight to the Salem Witch Trials... with a twist! The interaction with objects is a little imperfect (and could get annoying at times), but the attention to detail and decent storyline nailed it as a 'Yes I still recommend this game'.",
            "review_score": "1"
        },
        {
            "review_text": "Paid $0.18 for this game.  -Demons suck, but if demons were not in the game it would be, 'just another detective game'.  -The storyline is absolutely fantastic.  -Not worth $30.  -Worth $10 maximum.  -You're going to get about 8 hours of playing for this game, as the campain is not open world, it's over once you reach the final mission.  -There are bugs, developer hasn't updated the game in forever, most bugs are not game-breaking.",
            "review_score": "1"
        },
        {
            "review_text": "Truly amazing game, perhaps for story one of the best. This game wil forever etched on my mind",
            "review_score": "1"
        },
        {
            "review_text": "A decent, but very short game. I like the poltergeist, possess and other ghost mecanic and the story is pretty intresting. Kind of a action horror game. For a 90% off its well worth it.",
            "review_score": "1"
        },
        {
            "review_text": "This is a fun game.",
            "review_score": "1"
        },
        {
            "review_text": "If you ever wanted to fill the gaping hole left by L.A. Noire, then this is a game for you, perhaps not quite as good, yet still impressive  the citizens basically all look the same and repeat roughly the same lines over and over  Non-rebindable controls, so you better like the defaults or tough luck.",
            "review_score": "1"
        },
        {
            "review_text": "A really good story driven game. Definitely pick up on special,due to it's short length and limited replayability.  + In game graphics look great. It runs a smooth,consistent 100+ FPS on ultra with a 970 and 3770k,without Vsync + At first I didn't know what the hell was going on,but once you get the hang of it,it really draws you in + Unexpected ending,and game in general. Really didn't know what to expect,and came out of it glad it exists + Refreshing,and breaks the mould + Eerie,non-textbook setting + 'Short',but I felt like the length was perfect for the game + Lots of collectibles   A few negatives that weren't overly bad,but worth pointing out:  - A weird mix of in game and pre rendered cutscenes. The pre rendered one's are obviously capped at 30fps,don't look that great,and somewhat detract from whats going on - Stuttering with a HDD when loading a new area (unsure about an SSD) - Limited dialougue for NPC's,basically 2 sentences each (despite the fact you can influence a few of what they do) - Slightly annoying how asking people questions during the story requires you to press a button to initiate each question,instead of a flowing conversation - Can be pretty confusing at first,but push through and you'll be rewarded ",
            "review_score": "1"
        },
        {
            "review_text": "A detective game that includes many of the tropes you'd suspect. From a fedora-wearing detective to an eternal nighttime in the game, the game was full of them. The twist that the detective is actually a ghost made the game lots of fun and gave it a unique perspective on crimes.  The game does a good job of selling the ghostliness of the main character. From seeing things that aren't there (like drawings), seeing parts of buildings from the past, to not being able to move things in order to view them.  The human sidekick made the game even better. ",
            "review_score": "1"
        },
        {
            "review_text": "my friend gave me this game for free and im a little ♥♥♥♥er havent played this at all",
            "review_score": "1"
        },
        {
            "review_text": "awesome game with good gameplay . i like it so much",
            "review_score": "1"
        },
        {
            "review_text": "I REALLY enjoyed this game. Had a really interesting story line, with a clever play style. Definitely worth checking out, especially when it's on sale. Not a super long game, though.",
            "review_score": "1"
        },
        {
            "review_text": "This game had a relatively poor reception at launch and, while I don't understand the vast amount of negativity towards it, let me preface this by saying it's not a $60 game or even a $30 game. It's a fun little title that would have probably been recieved better if it had been sold for around $20 right off the bat. Although it's relatively short and the stealth sections are annoying, I really enjoyed my time with this game. It's got that dark noir style with a b-movieish plot. Piecing together ghost stories as I went around the town was a blast, and this is a game that had me hooked through and through. Being a ghost and gathering little bits and pieces of information really appealed to me and it's one of the few games in my library that I actually completed in only a few sittings. TL;DR If you like narrative-oriented detective games and see this one on sale or in a bundle, I'd definitely suggest giving it a shot.",
            "review_score": "1"
        },
        {
            "review_text": "I paid $3 and it was totally worth it. The story is predictable and the ending burdened by a terrible quick-time event, but it held my attention throughout.",
            "review_score": "1"
        },
        {
            "review_text": "Literally a spiritual successor to LA Noire. I've been wanting to play a horror/detective game for quite some time, and Murdered: Soul Suspect was the perfect game, give or take.  Positive: + Excellent atmosphere and visuals. + Pretty good storyline with many relevant subplots  Neutral: * Simplistic combat system (obviously not the focus of the game) involving a mini-quicktime event * Gameplay is based in collecting items and evidence  Negative: - Investigations that involve choosing which pieces of evidence are relevant to the case can sometimes be too easy/obvious - Lack of gameplay variety  There were certain parts of this game where I just didn't want to put the controller down, but I can easily see why others might find it uninteresting. $30 dollars is a fair price, though I'd recommend it if you can get it on sale.  It's a shame this company shut down after making this game. They seem to have a lot of potential, and I would've loved to see what else could come from concepts like these.",
            "review_score": "1"
        },
        {
            "review_text": "This game is a work of art, Though buggy every once and a while it still plays really nice, and drives you to play by hooking you on an intence story! 9.5/10",
            "review_score": "1"
        },
        {
            "review_text": "excellent game! really loved the story it's cool . bought it on sale and it was worth it &lt;3",
            "review_score": "1"
        },
        {
            "review_text": "The game is alright, definitely worth a try when on sale  Pros:  -Decent Story -Unique perspective (you're not just a detective, you're a ghost detective) -Puzzles by possession (makes the game more interesting compared to traitional walking sims)  Cons:  -Too short -Optimization problems (for me anyways) ",
            "review_score": "1"
        },
        {
            "review_text": "Pretty fun game and quite nice graphics however lacks replay value. I was able to collect 228 out the 242 in the 9hrs I got out of this game. With little incentive to start again, I can say this is about as much as anyone will be able to play Murdered: Soul Suspect. I still recommend the game just be aware of the short amount of gameplay.",
            "review_score": "1"
        },
        {
            "review_text": "No real replay value, short, but delivers where it needs to in story. The controls are a bit wonky but it doesn't really matter because this is practically a third person walking simulator. I especially recommend this if you are a fan of the detective genre. ",
            "review_score": "1"
        },
        {
            "review_text": "absolutely fantastic game!,reminds me very much of wolf among us with the story telling so if you enjoyed that you'll love this,great atmosphere (very the secret world-ish).  went in with pretty low expectations and glad i was wrong,highly recommended :)",
            "review_score": "1"
        },
        {
            "review_text": "I love the atmosphere of this game and the concept behind it. The art is beautiful, the characters interesting, and the story as it unwinds even more so. The glimpses of Salem's past are fascinating.  My only complaint is the demons. They're a pain to deal with, don't have a lot of point other than to add something random to kill, and generally put a dampner on an otherwise highly enjoyable adventure game.   Other than that I love this game, and it's unique concept. Beautifully done.   Definitely play the game, just be prepared to occasionally wish they really hadn't put the demons in.",
            "review_score": "1"
        },
        {
            "review_text": "A short, but thoroughly intriguing game that'll make you want to keep playing till you finish.",
            "review_score": "1"
        },
        {
            "review_text": "It's ♥♥♥♥",
            "review_score": "1"
        },
        {
            "review_text": "If you like horror stories, this game is for you. It's not a challening game but rather feels like an interactive movie. There are some parts (like escaping spectres) that require your reflexes, but most of the game is spent exploring the environment and looking for clues. With every step different story elements are revealed and while some are straight forward and expected, there are some nice twists in the plot line that makes you want to go on and on.  It's not super scary like other games in this genre, but play it in the dark with headphones and let it do it's magic.  If you care for being achievement complete, prepare for investigating every corner of each area. Especially the hidden pictures are a pain if you want to find them all, because they are so easy to miss. It can be done, but it isn't the most fun challenge out there...  Would buy this game again for sure, because the story is really nice and it has a good pace. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "If you like horror stories, this game is for you. It's not a challening game but rather feels like an interactive movie. There are some parts (like escaping spectres) that require your reflexes, but most of the game is spent exploring the environment and looking for clues. With every step different story elements are revealed and while some are straight forward and expected, there are some nice twists in the plot line that makes you want to go on and on.  It's not super scary like other games in this genre, but play it in the dark with headphones and let it do it's magic.  If you care for being achievement complete, prepare for investigating every corner of each area. Especially the hidden pictures are a pain if you want to find them all, because they are so easy to miss. It can be done, but it isn't the most fun challenge out there...  Would buy this game again for sure, because the story is really nice and it has a good pace. Recommended!",
            "review_score": "1"
        },
        {
            "review_text": "I bought this game on sale, and I didn't expect much, i thought I would get tired of it after an hour or something like that. But I was wrong. I was really suprised by this game tbh. I played through the entire story in one sitting, not that the story was long :d   But one thing, the game is really, really short, but that is actually the only thing I have to complain about.  Because the game is so short I would recommend to wait to a sale, it's basically always on sale.",
            "review_score": "1"
        },
        {
            "review_text": "Bought this game on sale not too long ago, and I'm glad I bought it when it was cheap, as I feel the $6 tag was about right. Murdered: Soul Suspect is a crime drama about a murdered cop on the hunt for his killer. The story ended up being pretty good, a lot of twists and turns throughout, very well done and well written dialogue. If you're looking for a decent story that doesn't drag on, an interactive movie, this is a good purchase. However, if you're looking for more game elements? You won't really find it here. Gameplay is abysmally easy, the hardest parts coming in quicktime events, which are no more than two button combos. The puzzles are no more difficult than 'Which one of these reminds you of a cheese sandwich?' *picks the picture of a cheese sandwich*.   The setting is great, if albeit a little heavy handed (Wait... Salem... has witches?!), and the graphics are nice. The rest of it... just isn't really there. I completed the game (not 100%... like 75%, maybe) in about 10 hours, and do not feel the need to replay it or go back and hunt for the avalanche of clickies throughout.   Unless this drops to about the same amount I paid, I would give it a pass, but $6 feels about right.",
            "review_score": "-1"
        },
        {
            "review_text": "I can't recommend a game where the developer refuses to address a game killing bug for two years. That tells me all I need to know about the developers. This game has a bug where the keyboard interface simply stops working in the investigate window resulting in your having to manually shutting down the game and lose all progress since the last save point. It is a known bug since launch and the developers have done nothing to address it or even respond to it. Save your money and don't support developers like this.",
            "review_score": "-1"
        },
        {
            "review_text": "Classic case of good idea, bad implementation. I found several glitches on my first playthrough, most were graphical, but one where it was a bit stupid. There were several instances of objects(both real, physical objects) were clipping together. At one point part of the storyline is hindered by a locked door, however you can simply pass through the wall and open it while the NPC still believes the door to be locked with their hands inside the door's model trying to get it open. Many issues also exist with the port to PC. I'll be honest, I am a PC gamer and haven't played this game on console, however I expect game ports to be decent. On numerous occations I found myself in one of the game's many menus and interfaces with my mouse unable to correctly interact with said menus, I then had to go keyboard-only with the arrow keys to navigate and exit the menus. Character animation is also a bit sub-par, especially when characters are talking. Unfortunately all of the bugs and glitches I've noticed could have been fixed with patches yet have not been.  If you insist on playing this game I highly recommend a gamepad.",
            "review_score": "-1"
        },
        {
            "review_text": "Objective view:  Suffers from a few bugs. Story is quite bland, including the characters. Gameplay mechanics somewhat fail to do justice to the story. poor and monotonous combat. fmv fest. short length.   Subjective view:  As a big fan of mystery and problem solving detective stories, this game felt like another mediocre, awkward 'playstation title'. What's with the ghost projected 19th century wooden houses? they seem out of place, poor of an excuse to ♥♥♥♥♥♥♥ize the city. Thankfully, I was cautious on having too high expectations and grabbed it on sale (5 euros). Either grab it while on sale ( at least 80% off ), or steer clear. I suffer to play it through so I can get it out of my hard drive and thus free some space for other games.  I give it 4/10 (maybe the score would be a solid 6/10 with some beers and nachos)  meh.",
            "review_score": "-1"
        },
        {
            "review_text": "I wanted to like this game, but then I played it. Pretty much every mechanic in the game is handled poorly. Most of the puzzles in the game consist of you searching the crime scene to collect a pool fo mostly useless clues and then picking the correct one out of the list when prompted. Hmm, which clue is related to the Bell Killer? Could it be the one that just says 'Bell Killer'? Yes, yes it is. Every time. 90% of the 'puzzles' are exactly this. No creative or deductive thought is required to finish this game. The only other major mechanic in this game is demons. They are one of the worst mechanics of any game I've ever played. Basically they are like wandering sentries that you have to sneak up on to destroy. If they spot you they chase you around for a couple of minutes. They are never fun. They are only annoying hinderences that stop you from continuing the story. They were obviously slapped onto the game to make things more 'difficult' and drag the game out. Without them you could probably finish the game in a couple of hours. Most of which is walking back and forth between the various crime scenes in the absolutely tiny town of Salem. There are a bunch of collectibles to find throughout the game, but unless you collect all of them of a given type you don't get anything out of it. And when you do finally get them all you are rewarded with a crappy little short story about someone's death. The overall story of the game is ok I guess. It has some serious problems, but relative to how bad the rest of the game is, I guess it gets a pass. It does not however make slogging through the rest of the game worth it. I'll give the game some credit though, the title is sort of clever.",
            "review_score": "-1"
        },
        {
            "review_text": "Story starts mediocre, but keeps you interested. Possesion of people to find clues is fun. Helping other ghosts out is also fun, (something to do besides the main story).  BUUUUTTTT the demons, oh my god. The demons kill this game, patch them out and you have a fun detective story, but as it is, it's a frustrating finger twister.  Only because of this stupid enemys the game sucks.",
            "review_score": "-1"
        },
        {
            "review_text": "Used to love the trailer, until it released and played it I believe lot of flaws in this game is making this game less fun that it was supposed to be.  1. Investigation mechanic is dull, while you're investigating in the game by looking at clues all over the place, you didn't actually investigate anything. Unlike games like Sherlock Holmes or LA Noire, you just look for items and press the action button.  2. Open world mechanic wasting time too much. While I like walking around the place to know more about it's world, Salem is the city that's seriously flawed in time and space. While it looks like a big city, you can get anywhere in just few minutes. And why there's lot of people in the creepy night potrayed in the game. Even the presentation of some people dating in graveyard just plain creeping me. (In a bad way)  3. Story just making non sense, I believe I supposed to find the clue about the klller... In 1 night? I don't think I can laugh more after looking people are just pushing their activity in 1 night.  4. Fighting demon is stupid.  5. Cars in the game modeled for dwarf.  Overall, I'm glad I can teleport later in the game.",
            "review_score": "-1"
        },
        {
            "review_text": "It looks like such a good game, doesn't it? Too bad it's not a good game. -The 'powers' aren't that great. (They are fun, I'll grant them that. However ticking off cats isn't my cup of tea.) -There's combat that doesn't add anything to the story or game, it's just annoying. -The constant 'find every tiny clue' is hard to do; if you mess up, you basically can't go back. (Some clues are only found by being a terrible person, so don't worry if you mess with people to finish the game.) Although I didn't find even close to everything and maybe that fixes all of my problems with the game (I doubt it though.)  Honestly if you want a mystery with corpses and plot, I'd recommend The Vanishing of Ethan Carter.",
            "review_score": "-1"
        },
        {
            "review_text": "It's short. Real short. Got a copy for $9 so I guess I can't complain. Don't buy it for full price. The ending kinda came out of nowhere. Kinda silly really. Don't want to spoil anything.",
            "review_score": "-1"
        },
        {
            "review_text": "Not actually a game.",
            "review_score": "-1"
        },
        {
            "review_text": "Save your money.  I was pretty excited to play this game, but after completing the main story-line in under 9 hours I am severely disapointed.   Difficulty:  This game is incredibly easy. It's basically point-and-click. You can't make any mistakes, really. You walk between locations and look for clues, which are very obviously highlighted for you. I thought I'd have to be solving puzzles, piecing together clues, but everything is spoon-fed to you. The main character must be the worst detective in history, because I was figuring things out way before he was. There's no real threat or doom in this game. I mean, you're already dead, so you can't exactly die. The only obstacle (if you can call it that) are the soul-sucking demons (Which look like Dementors from Harry Potter) which pop up and must be vanquished (Which is also very easy to do. Just sneak up behind them, click three buttons and POOF! Gone).  Story:  The story could be interesting if it wasn't painfully dummed down. There are no complex intertwining stories, no in-depth characters. Everyone is exceptionally bland and cliche. *Spoilers ahead* So you play a detective called Ronan in Salem who has just been murdered by the 'Bell Killer'. Ronan is exceptionally slow. It takes most of the game for him to figure out that this 'Bell Killer' preys on 'witches'. (It's Salem. That was obvious.) He discovers who the murderer is with the help of a 'Medium' who can see/communicate with the dead.   Graphics: Even the graphics themselves aren't that good. The characters mouths move at random, not really forming any real words. They move their arms and heads around as if they're puppets being pulled by strings. Even the cinematics are poor; clothes have jagged edges, and character's faces have no emotion.  Glitches:  There are glitches in this game which don't allow you to complete current objectives. Also, it's a checkpoint save game, so if you encounter a glitch you must reload from the last save-point (wherever thay may be). I also had a problem of cinematic scenes repeating themselves if I walked into a location where the objectives had already been completed.   World: There is a very small area of game play. No map needed. You are in a tiny town and you are able to enter the museum, the church, the graveyard, the police station and the hospital (but only when the game calls for it). No free-roaming or exploring. Just walk to the next location (the arrows show you the way) and complete the objective. Then it's on to the next location.   Overall:  This is a VERY boring, VERY easy game. Utterly dissapointing.   Rating: 2/10 ",
            "review_score": "-1"
        },
        {
            "review_text": "Blah. Story is alright, gameplay pretty weak.   Starts on a high note. Introduces you to the variety of methods of interacting with characters. Peek through eyes, read what they are reading, eavesdrop on conversations, get clues, influence thoughts of others... ya that's cool. After the first investigation which is mostly a tutorial, one could easily think the stage is set for a game where investigations deepen and interactions get more complex. It doesn't. Infact it gets more linear. Anyways..... 10hrs is enough. Was happy to beat it and call it quits.",
            "review_score": "-1"
        },
        {
            "review_text": "The story and investigations are good (though sometimes a bit confusing). However the programmers managed to ruin the game with the demon hunts combined with crappy QTE-s. Could have been much better if they implemented some kind of FPS elements since we play a ghost cop after all.",
            "review_score": "-1"
        },
        {
            "review_text": "Not even five minutes into the game, I run into a glitch where I cant back out of any menu, be it the tab menu or whilst possessing someone. Only fix is restarting the game but then it always happens again. Completely unplayable",
            "review_score": "-1"
        },
        {
            "review_text": "How the reviews for this are 'Mostly Positive' is beyond me.  This game is essentially clicking on items, then clicking on dialogue options. There is absolutely no challenge to this, whatsoever.   It is mostly like an interactive movie. However, the voice-acting, storyline, and general plot foundation is total B rated garbage.   I couldn't get past around an hour before I started to feel like the game was more of a chore than doing laundry.  Not worth the $5 I paid for it.",
            "review_score": "-1"
        },
        {
            "review_text": "I enjoyed the game, but I having completed the game in one sitting I can't recommend it straight up. If you enjoy point n clicks, this will be a wonderful title. It functions much like one and the only reason it wouldn't work in the point n click format is the Demons sequences, which functioned for me a a quick jumpscare (that noise they make on spawn..) and then to slow my progress moving around. Moving the plot along feels very linear and I didnt feel any real motivation to deviate from the main plot. The detective sequences were also very simple, I wasn't challanged by any of the puzzles throughout.  Again, great for point n click fans! Not so much for anyone else though.",
            "review_score": "-1"
        },
        {
            "review_text": "WARNING -  The game is full of gamebreaking bugs, including one with you getting stuck in the menus not able to proceed. Only solution is ctrl-alt-delete. No patch or fix known, and the developer is defunct.  EDIT: Was able to play the game in windowed-mode. It's a damn shame cause the game ain't that bad.",
            "review_score": "-1"
        },
        {
            "review_text": "Great idea for a game and loved the story line and atmosphere. However.. short game, you are able to finish it within like 6 - 8 hrs if you aren't trying to collect all the hidden items like I was.   + very small map   Overall I wouldn't recommend it because you just can't get that far. You pay alot for a short game.",
            "review_score": "-1"
        },
        {
            "review_text": "30$ for 6 hrs game ? not WORTH it",
            "review_score": "-1"
        },
        {
            "review_text": "buggy, short, and not worth the price",
            "review_score": "-1"
        },
        {
            "review_text": "really shallow. it's ridiculous how this game shoves twists that are meant to be creepy or meaningful in your face. you also see them coming ages before they happen.",
            "review_score": "-1"
        },
        {
            "review_text": "The graphics are beautiful, and the story seems interesting. Too bad the game has clearly been developed for a console, and so the game play is severely limited: you can't save the game freely, there's no map, and it's very easy to crap out side quests, because due to inadvertent advancements in the main plot you're incapable of getting back to the earlier game zone. This is really annoying, because due to the save/load limitation you can't go back.  Another thing is the demons and traps in the game. Again, this seems to me more like an action console game, not a mystery adventure detective game.. Which might be OK with you, if you're into that sort of thing.",
            "review_score": "-1"
        },
        {
            "review_text": "Rented this game on console and it was alright, probably around a 6/10 for me. A friend gifted me the PC version when it was on sale, so most of my experience is with the console version and not the pc version.  Some great ideas and some nice graphics but this could have been soooo much better. If you want a style of game like this I would say go play all of the Tex Murphy detective games or even LA NOIRE.  The story is a mess, the characters are pretty meh and it is just not all that fun of a game. Far from terrible but I can't help but think this could have been so much more with another year or some different design decisions. The atmosphere is also pretty well done.  If it is $5 or $10 on sale it is worth a go, but as I said above, I would go hit up Tex Murphy series, Police Quest series or even LA NOIRE instead.",
            "review_score": "-1"
        },
        {
            "review_text": "This game was disappointing, to say the least. It had a wicked premise and I loved the concept of blending old Salem with new. But what should have been a challenging puzzle game was ruined by annoyingly repetitive quick time events that will one-shot you if you lose and easy puzzles. The first couple of areas in the game were intriguing, but it seemed like the team put less and less effort into the game during the later levels. One of the coolest gimmicks, possessing people, quickly became boring because NO ONE HAD ANYTHING INTERESTING TO SAY.   I really wanted to love this game. I did.",
            "review_score": "-1"
        },
        {
            "review_text": "I wish I could say I enjoyed this game. The story is rich, but that is where it ends. It has too many porting issues that glitch the game, causing you to restart the game and most likely losing the last hour of gameplay you had. Because there is no independent save mechanism. There is only auto saving at certain points in the main story. I played for an hour exploring the street and solving a larger side story, and then got stuck in the clues menu and lost everything. Poorly executed game. I cant even finish it because it's so poorly executed.",
            "review_score": "-1"
        },
        {
            "review_text": "Gameplay is boring and colour tone is too dark for my eyes, get dizzy after few mintues.",
            "review_score": "-1"
        },
        {
            "review_text": "I was sadly disappointed by this game. From the other reviews I saw I thought the play through would be a lot harder and would take me much longer. The game itself took me about 8 hours to play through and this was including the side quests and collectibles. I felt like the game started off good and had potential, but then the game developers just shrugged, said 'good enough!', and threw it on the market. There is almost no replay value and the crime solving aspect of the game, which is what I was really looking forward to, is way too easy.  Theres only two enemies to you in the game, both of which are very easy to dupe. One you just avoid stepping on, and the other can be executed by a simple click of a designated key board key. Wish I wouldn't have spent 30 dollars on this game.",
            "review_score": "-1"
        },
        {
            "review_text": "♥♥♥♥♥♥ game, I played for a few hours than my savegames got lost for no reason. Didn't even closed it while saving.",
            "review_score": "-1"
        },
        {
            "review_text": "You can't rebind the keyboard controls. So, if you are left-handed or if you're on playing on anything other than a QWERTY keyboard, this game is unplayable for you.",
            "review_score": "-1"
        },
        {
            "review_text": "Bugs Bugs Bugs. I guess this game was not designed for pc, therefore when you try to check the clues for exable it stucks and you have to alt+ctrl+del to close the game. Sensitivity is also an issue and you can't do much if you have a mouse where you can change dpi.",
            "review_score": "-1"
        },
        {
            "review_text": "Murdered: Soul Suspect is about a wannabe detective/previous gangster, who was over his head as usual. The game is almost a point &amp; click game at times. You are pretty much just looking at evidence, reading some person's mind, then solving a case with the most straightforward answer, which confuses you at times because the answer does nothing to help the case, &amp; it just trips you up.  Pros:  + Good Graphics + Music is good, is repetitive when examining evidence + Good Voice acting + Your a ghost + You can possess a cat + Can see women naked, jk XD   Cons: - When you're solving cases, almost all the answers are straight forward, making it pointless to collect evidence - Controls are a bit messy, it seems like this game was mainly developed for console - Gameplay gets repetitive after the 3rd case, which is look at this evidence, read mind, now conclude case   Conclusion: - If you someone who played L.A. Noire, Vanishing of Ethan Carter, those Sherlock games. Then I recommend you not waste your money or time with this game, because the story isn't much &amp; the gameplay gets very repetitive, but if you still want to buy it. I would wait until this game is %80-%90, because there are better detective games out there right now that are cheaper or of the same price of Murdered: Soul Suspect. ",
            "review_score": "-1"
        },
        {
            "review_text": "I could not recomend this game to anyone expecting engageing gameplay or meaningful motivation to seak out the many hidden clues litttered through this game. After spending a breif yet adequate amount of time with this game i had found myself stuck twice hunting for the very last clue in one of the games closed 'investigate' areas usaly holding about twelve clues scattered around containing only three releven ones and yet deming it necisary to hinder your progress untill such a time you find all of them then opening a blande menus houseing all the clues and instructing you to chose the correct three gradeing you on which of three chances you guess correct and utterly discarding of all the other clues they had just forced you to find.   So I didnt like the story so what it has several side storys for your to hunt down like collecting 10 scattered water heaters, and 16 1970s era jurry cans with a cardbord sign taped to them labled 'need gas' or somthing similar to that. hell I even had to walk circles around a drunk driving incident collecting trinkets only to discover i just had to wander to a gas sation around the corrnor and reinact a breif memory of who was driving the car that killed every one else within.    I would liken it to collecting the feathers in Assassins Creed 2 only instead of being thanked by an old lady for catching them all you get a dim blue menu containing a half-cliche half-based-in-fact story of a murder with its boring white text and mediocre plot that was given away by the name of the side quest. And this trend did not seem to be destined to reced as the game progressed if anything it slowly grew more mundane and trivial as i progressed forward.   That being said I admit i was only willing to devote three hours to this game with the only true interaction with the game's enviroment came from a breif few moments in possesion of a cat to platform your way to the top of a building and do you know what wonderful prized awaited me....remember those jurry cans i was speaking about erlier, their was one of some rediculuse number suposedly littering the game. It is always a posiblility that the game does a complete 180 at the last moment but i dont hold high hopes.   So no i canot recomend this game to anyone exspecting anything but trivial collectable insperations to make a game. This doesnt mean the storys within where not enjoyable but they mostly seemed more likly to belong in the local tabloids rather than a 'detective' game.",
            "review_score": "-1"
        },
        {
            "review_text": "I died came a ghost and den refund... Refund worked well",
            "review_score": "-1"
        },
        {
            "review_text": "Poorly ported, unremappable controls, and game stopping bugs regulate this already medicore game into another instantly forgettable 'we didn't give a ♥♥♥♥ about the PC port' console game.",
            "review_score": "-1"
        },
        {
            "review_text": "i couldnt play 10 minutes of this crappy title. its sooooo boring! and i like the final fantasy games that usually take hours before its fun. do not get this game.",
            "review_score": "-1"
        },
        {
            "review_text": "The game has an interesting idea, solving your own murder. But everything else is pretty bad. Weak story, boring gameplay. I usally finish a game but I just couln't bring myself to keep playing this game. ",
            "review_score": "-1"
        },
        {
            "review_text": "This game has a decent, somewhat interesting story line however it lacks in content. For a game that is listed at 40-50$ I got about 8 hours in until I beat the game (aiming for all collectables). Also, when you beat the game there is no replayablility. The game forces you to restart after the final cutscene. Overall a waste of my time, even when I got it free with my graphics card. I would not pay a penney from my pocket for this game.",
            "review_score": "-1"
        },
        {
            "review_text": "A solid rental. Purchased, played and done with it in about 7 hours, about 80% acheivements unlocked. Interesting story with some good plot twists, but not enough substance to warrant a $50 price tag. If Redbox has it, grab it and take it back tomorrow. A great play but a bad purchase.",
            "review_score": "-1"
        },
        {
            "review_text": "It wont even let me launch the game and i'm probably not even going to get a refund.",
            "review_score": "-1"
        },
        {
            "review_text": "Well what can i say about this game hmm.  Well first off it wasent very good. the reason for this is that it just does not involve the player enough, there are basicly no choices in this game. the story isent half bad but with it being so simple it just dosent draw the player in. i got bored after the first hour or so of the game due to this reason,The only reason i went through it was because i had bought it and figured i might as well finish it. so it wouldent feel like a totall waste of cash.  Basicly you go from point to point, find the clues in each location (wich is extremly easy to find) and you get a abit of the story then you move to next location rinse and repeat, and thats it. There are a collectables you can pick to get a few side stories thats not linked to the main story, They are basicly there to help add the darker feel to the game.  on the Plus side  + Good voice acting + Decent Graphics + Good atmosphere  On the Minus Side  - No Choices that effects gameplay at all - To strightforward - Main Story is to short. - Boring Main Character ( too cliché) - Side stories also very short  All in all it was a dissapointing game. feelt like i was playing a bad version of  The Walking Dead -    The Wolf Among Us -     Now if you like this type of game i would recommend picking up a copy of The Walking Dead Season 1-2 and Wolf Among Us.  Same stuff but with actuall choices that effects the story and really really good story.",
            "review_score": "-1"
        },
        {
            "review_text": "press start screen doesn't work, tried every key and button waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "Do not waste your money this game does not work. Crashes foor 80% of people after the first case. Check out the forum before buying.",
            "review_score": "-1"
        },
        {
            "review_text": "Story game so bored ~",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Console-Import i ever had. Game stuck in Menus, or if u switch into a person. No keybindings to change... Mouse sensibility at 'Low' faster as in an Ego-Shooter... And this problems exists at juny 2014, so i read it in the support.  No wonder Steam offer is to 2.50€... but No idea Why Ps3/XBox360 sold it at 60€ and Ps4/XBox-One at 70€!! Shame to game-developers.... Same worst-case like 'Alone in the Dark' ~10 years ago...  Could be a 'Horror-Game'......a Horror to play it -,-",
            "review_score": "-1"
        },
        {
            "review_text": "What could have been a fairly interesting murder mystery game was ruined for me at least by the awful combat QTE's they lazily shoehorned into the game.",
            "review_score": "-1"
        },
        {
            "review_text": "The type of game that makes me wish for a recommendation of 'Only on sale' One of the few games out there that lets you play as a ghost doing actual ghost like things, the game is marred by several issues that really prevent it from working enough for me to give it a pass at normal prices. It's a puzzle game first and foremost that felt it had to add in some action in the form of stealth segments where you must avoid getting caught by demons, which usually boils down to accidentally getting spotted and having to waste time teleporting around safe spots waiting for them to resume patrolling so you can try again at doing a QTE to get them out of an area so you can go back to exploring. And then there's the puzzles, that boil down to trying to find every object in a given area and putting 2 or 3 of them together to solve a small mystery, sometimes operating off of logic and other times suffering from the Phoenix Wright problem where you're ahead of the game's characters but are forced to answer extremely handholding questions in order to advance (such as 'there was a murder' as one of an early mystery's 'most relevant' clues when you are asked to investigate a murder). However, that's not what really hurts this game. Instead, it's the simple lack of content. There isn't enough dialogue recorded for a game that features a mind-reading mechanic. There are very few side quests and after you complete them all the hub world you are forced to travel through seems very boring. Collectables are decent but don't seem to ever really be enough considering the amount of ground you cover between them. The main plot ends way too early for something that came out above $20. And those demons mentioned above? They are thrown in purely to prevent you from breezing through levels in 10 minutes. As you'll probably get through most of the content you care about in the first run, the game really lacks a lot of replay value, so your first run through is going to be about as long as you spend with the game. I went through with the 'I'm going to try to collect as much as I can, but more than an hour without any result and I'm moving on' mentality, and I clocked about 8 hours (which includes a bit of idling time spent away from the computer).  It's kind of sad, because the game isn't devoid of value, just not enough to justify purchasing it normally. Its writing, especially concerning some of the ghost stories you come across, is engaging, even if it's not the best you'll ever experience. Meanwhile, it completely nails the 'I'm playing as a ghost detective' thing it was going for, even going so far as to have the first thing you do be trying to get back into your still barely alive body by trying to slip into it. If you liked Ghost Trick or Geist and wanted more games like that, this scratches that itch nicely.  This game is worth playing for those who have a weakness for a somewhat noir detective game or one where you play as a ghost, but because you'll probably only need to play it once, get it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "I feel bad for the people who bought this with over 50 euros. I would have payed only 5 euros for this.",
            "review_score": "-1"
        },
        {
            "review_text": "Adequate story but wastes gameplay with repetitive 'press x' mechanics, lack of proper puzzles, and has no real difficulty.",
            "review_score": "-1"
        },
        {
            "review_text": "$10 was at least $5 too much.",
            "review_score": "-1"
        },
        {
            "review_text": "This 'game' is one of the worst I've ever 'played'. Even if free, it's not worth the time you'd spend. Certain elements of the game make it clear that the game was rushed to publication, like the 'mysteries' that you solve for random ghosts, which appear only in the first two areas and give you no reward whatsoever. The game mechanics are shady and boring, like when you have to put together three clues and they tell you to put them in chronological order even though the clues have nothing to do with time. Most of the time I could figure out what they wanted but by and large it was guesswork. The game itself is only 3 or 4 hours of real gameplay with a great deal of padding in the form of hidden collectables, most of which also do not give you any reward except for the 'scary stories' which feature excruciating voice acting and are a giant waste of time.  I wish I had the kind of guts Square Enix has to publish this piece of garbage and demand 50 bucks for it. Do not buy it, do not play it, and remember this the next time you want a Square Enix game.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Console-Import i ever had. Game stuck in Menus, or if u switch into a person. No keybindings to change... Mouse sensibility at 'Low' faster as in an Ego-Shooter... And this problems exists at juny 2014, so i read it in the support.  No wonder Steam offer is to 2.50€... but No idea Why Ps3/XBox360 sold it at 60€ and Ps4/XBox-One at 70€!! Shame to game-developers.... Same worst-case like 'Alone in the Dark' ~10 years ago...  Could be a 'Horror-Game'......a Horror to play it -,-",
            "review_score": "-1"
        },
        {
            "review_text": "Okay so this game is basically a game where you really enjoy it or you don't. The game itself has a terrible story line and one of the worst endings ever, put it this way a COD ending has more detail then the ending on this game.  Pros: Awesome tp skills Some cool ghost things Deamons  Cons: Has a couple of bugs  Controls are very annoying sometimes  Objectives are sometimes not very clear to the player Aweful ending Bad story  So basically only get this game if it's on special. Don't get me wrong its a good game and has some great ideas behind it but it feels like the makers have just thrown it together in a hurry.  ",
            "review_score": "-1"
        },
        {
            "review_text": "The type of game that makes me wish for a recommendation of 'Only on sale' One of the few games out there that lets you play as a ghost doing actual ghost like things, the game is marred by several issues that really prevent it from working enough for me to give it a pass at normal prices. It's a puzzle game first and foremost that felt it had to add in some action in the form of stealth segments where you must avoid getting caught by demons, which usually boils down to accidentally getting spotted and having to waste time teleporting around safe spots waiting for them to resume patrolling so you can try again at doing a QTE to get them out of an area so you can go back to exploring. And then there's the puzzles, that boil down to trying to find every object in a given area and putting 2 or 3 of them together to solve a small mystery, sometimes operating off of logic and other times suffering from the Phoenix Wright problem where you're ahead of the game's characters but are forced to answer extremely handholding questions in order to advance (such as 'there was a murder' as one of an early mystery's 'most relevant' clues when you are asked to investigate a murder). However, that's not what really hurts this game. Instead, it's the simple lack of content. There isn't enough dialogue recorded for a game that features a mind-reading mechanic. There are very few side quests and after you complete them all the hub world you are forced to travel through seems very boring. Collectables are decent but don't seem to ever really be enough considering the amount of ground you cover between them. The main plot ends way too early for something that came out above $20. And those demons mentioned above? They are thrown in purely to prevent you from breezing through levels in 10 minutes. As you'll probably get through most of the content you care about in the first run, the game really lacks a lot of replay value, so your first run through is going to be about as long as you spend with the game. I went through with the 'I'm going to try to collect as much as I can, but more than an hour without any result and I'm moving on' mentality, and I clocked about 8 hours (which includes a bit of idling time spent away from the computer).  It's kind of sad, because the game isn't devoid of value, just not enough to justify purchasing it normally. Its writing, especially concerning some of the ghost stories you come across, is engaging, even if it's not the best you'll ever experience. Meanwhile, it completely nails the 'I'm playing as a ghost detective' thing it was going for, even going so far as to have the first thing you do be trying to get back into your still barely alive body by trying to slip into it. If you liked Ghost Trick or Geist and wanted more games like that, this scratches that itch nicely.  This game is worth playing for those who have a weakness for a somewhat noir detective game or one where you play as a ghost, but because you'll probably only need to play it once, get it on sale.",
            "review_score": "-1"
        },
        {
            "review_text": "press start screen doesn't work, tried every key and button waste of money",
            "review_score": "-1"
        },
        {
            "review_text": "Turned on game Died Turned of game  10/10 whould die again",
            "review_score": "-1"
        },
        {
            "review_text": "Pros: * Decent story (although highly linear) * Dark atmosphere * Good voice acting * Engaging side cases where you feel for the characters and genuinely want to help * You get to possess and control a cat!  Cons: * Irritating demon combat encounters (basically, sneak up, QTE, rinse and repeat ... ) * Glitches - clipping, and one instance of freezing, which meant I had to restart and get all the collectibles AGAIN (no quick save feature. Auto saves only during main mission, not in town) * Speaking of which, I didn't find the collectibles worth it. Unlocks one illustration &amp; draggy narration of a mini-story. I stopped bothering after a while, and I'm usually a completionist. * Repetitive dialogue from people you possess so why bother? * Many clues are unnecessary or illogical and thus a waste of time * The writing is dull at best and sometimes ridiculous * Riddled with cliches/nothing really original * Uninspired level and NPC design * No real rewards or motivation other than to unmask the killer. Even gaining new abilities mostly just helps in getting collectibles.  Overall, this game equals wasted potential and too much plowing between points of interest. It was an interesting concept, but many of the devs' decisions made the game tedious and annoying. Personally, I was happy to have it over and done with.",
            "review_score": "-1"
        },
        {
            "review_text": "it seems very good game, but i don't recommended. first of all, you can't save (just wait for autosave at the checkpoints), it doesn't allow you to change controls, have major bugs that crash the game and so you must start again from it's checkpoint (and when you do it some times you stop playing it). Nice story, nice graphics, music is good too but need fixes. i hope they do something for those problems. as a game it's 7/10 but i don't recomend it.",
            "review_score": "-1"
        },
        {
            "review_text": "I can see how some people might recommend this game. There is stuff to like about it, it's playable, but as a big studio title I'm going to take the harsher route and not recommend it. Mostly because it's so underwhelming, gameplay and story wise.  The game play is super casual. Reduntantly casual. Most of the game focuses around collecting clues, but you don't derive any meaning from them. Once you've found the right clues you can opt to solve the case and the game will ask you a straight forward question like 'what happened here', or 'where did the killer go next' and you click on the clues that blatantly answer the question. There's no deduction involve, just fill in the blank and then the character will summerize the obvious as though they were hit with some hard earned revelation.  There is also the hunt/be hunted aspect of the game. Every area has one or two sections where demons emerge and you either have to navigate through them, or destroy them without them attacking you. It was kind of like the developer was trying to include some action in the game, but it was pretty pointless. They didn't really get any more difficult as the game progressed and they had nothing to do with the story. It made me wonder if the developers were playing with what kind of genre they wanted the game to be and ended up not developing or cutting out any of the possibilities. Heck, even the opening scene of us trying to get back into our body uses a gimicky game play element that we don't see again for the rest of the game. It obviously wasn't an interesting enough element to use again, why is it still in there?  The story is also pretty mediocre. I guess it's fine, it wasn't painful, it was just blah. The superficial questions were answered, but there wasn't really any explaination as to why any of it was happening, nor was there any real character development for anyone. The story did conclude, which is more satisfying than some games, but there wasn't really much reward for exploring so much game territory. In fact, there were lots of smaller unrelated stories that presented themselves in the first half of the game that were probably more interesting and involving than the main plot. I think they got tired of programming ghosts in the second half of the game or something because the NPCs that drove these side stories stopped asking for help, and suddenly all the NPCs that had about 2 lines of original monologue each started sharing about 4 lines between all of them.  All in all, I'm sure some people will like this game. Maybe many will find it on the positive side of mundane, but personally I found it to be an overglorified, padded, hidden object game. It could really use some editing, and it would be a nice bonus if they actually decided on an aspect of the game to develop into something interesting.",
            "review_score": "-1"
        },
        {
            "review_text": " Now how can you go wrong with this? The first few minutes in, you die and come back as the ghost of christmas pa... no. Thats not right.   Anyways - the idea is just fine. In fact, it should have been gold. Thats probably why I pre-ordered it. How could they possibly go wrong? Proved wrong again. Instead it's just annoying and the least fun I have had in a long time.  Another shoddy port to pc, making the keyboard-mouse as natural as fish on land. But fine, we all have a controller (we really shouldnt need one, but thats another rant).   First few minutes and they're quick to tell you the limitations you have as a ghost. Ok. Fine. But it's starting to feel a lot like a corridor shooter. With out the pew-pew. Or fun. But I'll get back to that.  Wanna walk through that wall there? You can't. Why? Cause if you did, you would bypass that demon thats spesifically placed in your corridor path. They don't feel like they should be there. They are only there to slow you down, make you focus on them instead of whats around you. So that, you know, you miss out on that clue? Cheap trick. And annoyed me to no end. They are easy to take out, but it still messes up the flow of the game.  When i finished my initial 'tutorial'-chapter, I was exited that I finally could roam the streets of the city. What happened instead was deep and utter dissapointment. Just looking at the city I knew exactly what was going to happen in the future.   Demons are going to chase me here. I'm going to be forced to hide here and here, then I'll probably have to run up there ... cut-scene i guess, then run again over there. Oh, this path is blocked. Yeah, that will probably open up later when I've waved my magical wand. That guy doesnt want to talk to me, but in his conversation his rubbing it in my face 'im not gonna talk to you'. Translation? I'll talk to you, but first you have to do something. And the streets are littered with 'clues' that tell you about the plot, killer and well everything.   Oh joy. Cause thats what I want to do. I want to learn about the murderer and why he does what he does by jumping and exploring the terrain instead of the story.  And the story. Why didn't they hire better writers? At least let us keep guessing the 'why' untill after some gameplay. When the gamer feel like you know the 'why' right after chapter 1 - then you seriously have done something really really wrong. Thats not storytelling - thats insisting that the gamer is an idiot. And lazy.  It was just such a let down, I never finished chapter 2. Or was it 3? I dont know, and i dont care. ",
            "review_score": "-1"
        },
        {
            "review_text": "The game it self is decent but at a $49.99 price tag it leaves your wallet asking why did you spend this much on a 8-10 hour game at best with no replay value in it",
            "review_score": "-1"
        },
        {
            "review_text": "Annoying, buggy stealth sections. Item interaction that requires really specific camera positioning. A storyline that is basically a retooled version of the movie The Frighteners.  I did like a few of the ghost characters, some of the subplots and the walking through walls was done well. Also you get to be a cat twice.",
            "review_score": "-1"
        },
        {
            "review_text": "The beginning of the game is very well done, but for me it quickly fell flat. I was raised on Lucasarts point n' click adventures, so I am always on the lookout for adventure games with puzzle elements or a strong story driven narrative. Unfortunately, despite some cool mechanics and a story I WOULD like to see play out, the game feels like a series of annoying 'where the hell is that last clue!?' scenes. The system for solving crimes is also just a 'guess again until you get it right' kind of deal. Essentially, just push button to win. So close, yet so far.",
            "review_score": "-1"
        },
        {
            "review_text": "Let me save you the time, and let you know that while this will be a review, it is going to read as more of a rant than anything else. Understand going in that I am not going to recommend any one play this game, at all. The reasons will be detailed below, but I am writing this as a way of venting my frustrations with the game, and treating the main purpose of this as a 'buyers beware' because let me tell you, I am not going to let the store page lie to you. I will get to that in a second.   That being said, Murdered Soul Suspect is the most dissapointing game of the year for me. Hands down. When it comes to expectations (what little I had asked from it in the first place) Not only did they fail miserably, they somehow managed to fail at even the BASIC expectations. So what were my expectations? I just wanted a good mystery game. Interact with the environment/clues, piece stuff together. Learn about the mystery and basically just immerse myself as a detective. It didn't have to be a compelling narrative or anything, but for the story, I at LEAST wanted a likable main character. I didn't EXPECT an L.A. Noire esque mystery game, and I would have even allowed a Deadly Premonition esque kind of mystery game. But this......WHAT IS THIS?  Where do I even begin with this game. I hope if you are foolish enough to read my tirade you will at least have the respect for yourself to have a snack. Buckle in boys and girls, here comes the salt. I want to address the store page bullet points real quick. To get this out of the way now. It's a good starting point as any. I won't address them all, just the ones I object to, and you, the future buyer, deserve to know the truth of.   -'A twisting storyline supported by a great cast of characters constantly raises questions over the secrets that Salem hides.' This is cute. What great cast of characters? No. I am not being facetious, I mean what great cast of characters? Where are they? There are characters, sure, and I would have loved to learn more about them, but 75% of the cast occassionally drops in for that ol 'THEY COULD BE THE KILLER' scooby doo schtick. No in reality the game really only focuses on Ronan (main character) and Joy, his spirit medium. Every other character isn't any more developed than the last beyond fulfilling the cliche role they were intended to fulfill. There is no 'constantly raising questions over the secrets that Salem hides.' It's no secret. No, I want you as the reader, right now, to mentally say the first thing that comes to mind when you hear the word Salem. If you said 'oh the Salem witch trials right?' then you my friend, are one smart turkey. Tadah. Oh, and there is only one main twist. I don't know where this twisting storyline business comes from. That implies it's constantly twisting.  -' Move freely from one haunting location to the next and even if you have completed your investigation, return to previous scenes to follow new leads.' Sounds compelling right? By move freely they mean you are essentially in a little invisible walled off box, and boy let me tell you there are a TON of invisible walls. Yes, you can return to previous scenes, but 'to follow new leads?' What on EARTH are you TALKING ABOUT? The only time you return to a previous scene is if you forgot some disposable optional collectible you wanted to collect for 100% completion that doesn't do jack for you unless you are trying to get all the achievements. None of this 'new lead' bullcrap. You don't change the outcome of anything. You are merely just taking a guided tour through this game.  -'Seek-out hundreds of collectibles, side-quests and cases from Salem’s citizens past to learn facts about the town and its people, improve your detective ranking and help you piece together the truth about the killer.' If there was ever a burning point I wanted to address, it's this one. This one, singular sentence on their page. It's complete false advertising. First off, while there are a COUPLE hundred (not hundreds) of collectibles, there are NOT hundreds of sidequests and cases from Salem's citizens. There are FOUR cases (not a typo) where you help out deceased citizens, and EIGHT collectible sidequests that reveal a story of a previous murder not really tied to the main quest murders. The other collectibles that involve the main quest killer? They don't help you piece together ANYTHING about the killer other than he likes killing and little blurbs from tabloids. How does that HELP anything? and honestly, with how poorly fleshed out and planned the characters were, you can more or less figure out who the killer is within the first 2-3 hours of gameplay. The twist was nice, but again, you kind of expect it. The really sucky part about all this is they should have done more with the sidequests involving helping the citizens come to term with their death. But no, you get 4 quests, and the other spirits you run into, you get a two choice branch that changes nothing and it just falls flat. Or hey! hey! better yet! more of those collectible stories involving the side murders but you know, without the cheap copout collectible requirements! MAKE THOSE ACTUAL MISSIONS. It would have been a farcry better than what we actually received.  -'Survive powerful demonic spirits who devour souls in a belief that they can regain their own. Strategically use supernatural abilities to evade and outwit them before they tear away your soul forever.' HAHAHHAHA, 'strategically?' STRATEGICALLY?! Are you kidding me?! What STRATEGY? Wh-what, you mean, exploiting the terrible AI of the 3 enemies at any given moment by hiding in plain sight, waiting for them to lose aggro, then mashing a QTE prompt? Or, or, using the various distraction options available (j/king you can only distract them with one thing, a crow) and then rinsing and repeat? Get out of here with that nonsense. Stop dressing up this lazy nonsense to sound fancy. Shame on you.  Now that is out of the way, let's talk 'gameplay.' Well, you can basically consider this game a semi-rails game. Or, more or less, a guided tour game. You aren't actually playing the game. I mean, yes,you are controlling Ronan, and he is responding to your controls, but literally 60% of the gameplay is you collecting stuff. It's like a giant collectible scavenger hunt. When you aren't collecting things that have no rhyme or reason or impact to the game, the other 40% of the game is you 'solving' crime scenes. But, YOU aren't solving SQUAT. The GAME has that covered. Look, there is no penalty for guessing wrong or deducing something wrong. All the clues are in the same room. There is no interacting with clues. Hell, the game will sometimes literally zoom in on the primary clue in a cutscene before you even start, rendering all your clue collecting pointless. AND, when you DO have all the clues collected, guess what reader? The game is like, 'soooo what do you think happened' and you piece together 1-3 of the clues to 'solve the scene.' BUT AGAIN, there is no penalty for failing. It's as braindead as you can possibly get. My favorite moment occurs when the killer is looking at a picture, and the game asks me 'Well, what do you think he is doing?' and 6+ words flood the screen and you gotta figure out what he is doing. He is clearly startled and up to no good, and literally half the options are the exact opposite of the mood being displayed. What is this, Dora the Explorer?   Agh... this game, I haven't even scratched much of the surface, there is so much I want to talk about. So much...so much rage. But I have already spent too much time talking about the game. Look, I don't like it. I think it's highway robbery they would seriously ask for $50 of YOUR HARD EARNED MONEY for this crap.   TL;DR: I hate this game.  ",
            "review_score": "-1"
        },
        {
            "review_text": "Story is ok, gameplay isn't.",
            "review_score": "-1"
        },
        {
            "review_text": "Medium adventure game (adventure elements rather weak), medium action game (linear with pretty much one kind of enemy).  What drove my crazy in this game: - save system (lousy save points, only single save, no profiles, no save at quit, no chapter selection after finishing game) - collectables (most can be found anytime before final location, except museum - when you miss one item like me, you will have to replay almost entire game -&gt; lousy save system) - credits (long, boring, cannot skip, can only fast forward)  There are more better games and I am again disappointed with SQUARE ENIX (like with last Tomb Raider).",
            "review_score": "-1"
        },
        {
            "review_text": "One of the most boring adventure games I've ever played. Puzzles are so weak they can barely be considered such, and there's lots of tedious stealth combat mixed in for no apparent reason.",
            "review_score": "-1"
        },
        {
            "review_text": "Worst Console-Import i ever had. Game stuck in Menus, or if u switch into a person. No keybindings to change... Mouse sensibility at 'Low' faster as in an Ego-Shooter... And this problems exists at juny 2014, so i read it in the support.  No wonder Steam offer is to 2.50€... but No idea Why Ps3/XBox360 sold it at 60€ and Ps4/XBox-One at 70€!! Shame to game-developers.... Same worst-case like 'Alone in the Dark' ~10 years ago...  Could be a 'Horror-Game'......a Horror to play it -,-",
            "review_score": "-1"
        },
        {
            "review_text": "The only reason this game remains interesting is that there aren't that many detective titles around.   However, beyond novelty it has little to offer. The investigation mechanics have potential but are way to limited to be engaging. There is little thinking required. It usually comes down to clicking on all clickable things in the area and than choosing the relevant information. It is a straightforward process, as long as you don't overthing things. Your character (and everyone else for that matter) and quite dumb and you will often connect dots way quicker than game wants you to. The final reveal surprises only because of how silly it is.  Also the is something of a stealth combat mechanics, probably due to devs or producers not being confident in their product. It sucks but doesn't take too much time.",
            "review_score": "-1"
        },
        {
            "review_text": "You play as a cop that has to solve his own murder. Story has all the generic tropes of a common mystery. No real twists and everything they try to set up to be interesting...isn't. Very short game and no real replayablilty. Pass on this one, you have better ways to spend your time and money.",
            "review_score": "-1"
        },
        {
            "review_text": "Way too easy to tell if someone is lying, weird demon encounter mechanics. Just didnt get want i was hoping for :( If you like weird mystery solving and a creppy ghost girl talking to you ... this is your game.",
            "review_score": "-1"
        },
        {
            "review_text": "This game is more then boring. Don't buy it! If you interested about the story, watch some gamplay.",
            "review_score": "-1"
        },
        {
            "review_text": "Run away from demons simulator",
            "review_score": "-1"
        },
        {
            "review_text": "This game would be a good movie. The story is good enough to keep you playing, but the elements of the game, such as character development, new powers, side quests, are handled in such a poor way that it doesn't have any real difficult. If you don't understand what clue is missing, you can keep guessing and it doesn't have any real down side in the gameplay. The story is pretty straight foward and short and there is a little plot twist in the end, but it's quite guessable, even though the main character is usually clueless about things.  Some demons appear to scare us and to create the illusion of difficulty but they are killed so easily that after you get the hang of it, they aren't even a problem.  The game has a different feel, a feel I haven't felt in games for a long time because of the way things are, we being a spirit and all that, but I don't think this game is really worth all the money I spent. For fans of detective games, this one may be one of the fews and may perhaps be interesting. In my opinion, buy this game only on steam promotions and don't waste time with side quests.",
            "review_score": "-1"
        },
        {
            "review_text": "Its possible to disable the stealth part of this game (avoiding demons). It's easy to deal with but annoying and I found it better turning demon awareness off. Background of characters is implausible for some and one dimensional archetypes for others. The story bits you pick up do add depth to both though. The voice acting and animation was good outside lipsyncing. Some of the puzzle moments are obvious enough that they do not seem like puzzles or clues. It was an intriguing idea for a game and a spiritual successor improving on it I would consider buying. Maybe this is an example of a game that would've benefitted from being episodic?",
            "review_score": "-1"
        },
        {
            "review_text": "Pros:  - good story - good voice acting - great ending   Cons: - really short (beat in 5.8 hrs) - repetitive gameplay - only 1 type of enemy - sometimes unresponsive controls leading to death - crashed a few times for no reason.",
            "review_score": "-1"
        },
        {
            "review_text": "It's game really FU*KING boring !!!",
            "review_score": "-1"
        }
    ]
}