{
    "app_id": 233310,
    "name": "Avadon 2: The Corruption",
    "release_date": "2013-10-30",
    "developer": [
        "Spiderweb Software"
    ],
    "publisher": [
        "Spiderweb Software"
    ],
    "platforms": [
        "windows",
        "mac"
    ],
    "required_age": 0,
    "categories": [
        "Single-player",
        "Steam Achievements"
    ],
    "genres": [
        "Indie",
        "RPG",
        "Strategy"
    ],
    "tags": [
        "RPG",
        "Indie",
        "Strategy"
    ],
    "achievements": 30,
    "positive_ratings": 111,
    "negative_ratings": 22,
    "price": 6.99,
    "description": "Avadon 2: The Corruption is a huge, indie fantasy role-playing adventure, the second chapter in the epic Avadon trilogy. You will serve the keep of Avadon, working as a spy and warrior to fight the enemies of your homeland. As a servant of the Black Fortress, your word is law.",
    "header_img": "https://steamcdn-a.akamaihd.net/steam/apps/233310/header.jpg?t=1447357510",
    "minimum_requirements": "OS: Windows XP Processor: 800 MhZ processor. Memory: 512 MB RAM Graphics: Video card or processor with OpenGL support. Storage: 200 MB available space",
    "recommended_requirements": null,
    "reviews": [
        {
            "review_text": "Gonna be honest - it isn't much to look at. It is, however, a strangely engrossing and surprisingly complex (in some ways) RPG, which has more life in it than you'd expect for a game that looks the way it is. If you'll forgive the fact that Spiderweb Software have been using the same assets for over a decade, you'll find a decent game with a solid story and decent gameplay mechanics. A minor complaint for me is that combat is too easy (and this is coming from someone who had to cheat to beat Baldur's Gate) even on hard, but it wasn't too much of a barrier to my enjoyment of the game.",
            "review_score": "1"
        },
        {
            "review_text": "So I haven't played Spiderweb's games since the excellent Exile: 2 for Mac, with great spiders and an 'alien' race that I still remember to this day, but I decided to give this a try. It looked great on the mac (I loved the old 'flat' graphics, best rpg at that time, especially the mac version with its prettier interface and music), but besides trying out the demos a little, I've never completed another of his games until now.   I feel compelled to write my first review on Steam. I had a lot of fun playing this game!  This game has a great beginning and hooks you in right from the start. I had lots of fun and finished the game very satisfied! Great job! I think anyone deciding to jump in should just start with Avadon 2, and skip Avadon 1, it is that good. Others have mentioned the one spot in the game (with the wind teleporting) that was a little too difficult so I had to buff up a little first, but overall I've not played another RPG like this in 10 years that i've enjoyed so much!",
            "review_score": "1"
        },
        {
            "review_text": ":)",
            "review_score": "1"
        },
        {
            "review_text": "Tiny bad graphics, simple sound effects and a Gold Box-esque turn based interface.   (If you don't know what the AD&amp;D gold box games by SSI are (ex Dark Queen of Krynn, Curse of the Azure Bonds), you're a wet behind the ears gamer who probably sneers at anything not bump-mapped. And if you dont know what SSI was, you missed one of the best eras in CRPGs. If you live in a country where these games were not released, forgive me. Then go get them somewhere on the internet.)   Its Spiderweb. If youve played one of developer Jeff Vogel's games, visually/interface/sound wise you've played em all. You know what to expect and it isn't much.  But you weren't playing this game to be wowed by the graphics and sound, were you?  If you were, go somewhere else so you don't clutter the forum with your complaints. Id rather not hear it.  But if you like immersive, in depth plots where you actually have to read and imagine what your character sees, and you like gewtting swept away be an amazing world and story,  then go for it, you wont regret it.",
            "review_score": "1"
        },
        {
            "review_text": "This is another winner from Spiderweb Games. I have played them all and appreciate the graphical imporovements they make with each game. Where they really excell is the storyline and the conflict presented to players, there is never an easy choice. Avadon also engages you with the decisions that you make and draws you in. This is an old school style Dungeon Crawler where you play with at least 3 different characters from various classes to present a balaced fighting team.  I appreciate the choice of Easy to Hard so that I can play my own way as well as there being inbuilt cheats in the game if you get stuck. If you dont like reading a lot of text then I dont think that this game is for you. Play the demo on the developers website if you are unsure and then purchase it here. It is a big sprawling world with lots of surprises. I am really enjoying this game. ",
            "review_score": "1"
        },
        {
            "review_text": "Avadon 2: The Corruption is another excellent title in the Spiderweb Series of games. These old school RPGs might be lacking in graphics, but make up for it with a wealth of gameplay. This challenging game has you playing from an isometric view, free to move and explore. When you engage an enemy, it becomes turn based combat. Tactics are important, because if you charge in, most monsters will just slaughter you. The character system is great and while the story is linear, it offers a lot of side quests and adventures. This is another excellent title in the series.  Watch the full video review on  ShotGaming.com  Steam Shots EP125",
            "review_score": "1"
        },
        {
            "review_text": "Watching a Let's Play of this instead... I just can't bring myself to play this game. I want to be someone who could play a game like this, but I am not.",
            "review_score": "-1"
        },
        {
            "review_text": "Love this game. Love all of Jeff's games. If you're a RPG fan, do yourself a favor and pick it up.",
            "review_score": "1"
        },
        {
            "review_text": "More like a D&amp;D campaign than a video game, Avadon has a enganging story and simple but effective turn-based combat with good writing that makes the charecters interesting and settings believable. Old school RPG fans should give this a go.",
            "review_score": "1"
        }
    ]
}